[[{"date": "4 Mar 2023", "title": "Student Success Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Colorado Technical University", "Interview Descriptions": "Was two rounds. First with manager then associate director. Pretty general questions, how do you work in remote environment? They were professional and nice. I believe if first round with managers you seem like a good fit they will then ask you to go to second round with associate director but I am not sure.", "Interview Questions": "How do you handle conflict?"}, {"date": "19 Mar 2021", "title": "National Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Colorado Technical University in Mar 2021", "Interview Descriptions": "The interview process was very informative and the interviewer was very nice and easy to talk to. The whole process was easy and quick. They tell you their exact expectations and answer all your questions thoughtfully.", "Interview Questions": "Previous employment, customer service questions"}, {"date": "10 Feb 2021", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Colorado Technical University (Colorado Springs, CO) in Feb 2021", "Interview Descriptions": "The interview was through Zoom. There were three faculty members present and it went for 40 minutes. The questions were about student engagement, teachability/coaching,  and classroom presence.  It was very relaxed and the committee members were very positive. There was a lot of good head nodding when I spoke.", "Interview Questions": "How do you engage with students? How frequently do you engage with students? Are you open to being coached as a teacher? "}, {"date": "17 Jul 2021", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colorado Technical University (Houston, TX) in Apr 2020", "Interview Descriptions": "The two people I interviewed were late to the interview by almost 15 minutes and seemed disinterested from the start and found out the position was filled the next day.", "Interview Questions": "They used a behavior based interview style. Very similar to other interviews "}, {"date": "8 Jul 2019", "title": "Student Success Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Colorado Technical University", "Interview Descriptions": "2 rounds of interviews.  First round is with a recruiter to clear basic understanding of the organization and ensure it is known this is a for-profit institution.  Second round was with the future manager and one of their colleagues.  Basic interview questions", "Interview Questions": "Tell us a time when you had to share disappointing or otherwise difficult news to a student. "}, {"date": "11 Jul 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Colorado Technical University", "Interview Descriptions": "Magnificent. They allow you to get a feel and overview of your prospective job just in the same day of the interview.  Very easy process and it was a long interview.  It was definitely worth it.", "Interview Questions": "What do you look for in a company or your managers?"}, {"date": "23 Apr 2018", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Colorado Technical University", "Interview Descriptions": "very detail, but they don't talk about hours getting changed and you have to bid on new ones. they need to explain when you need to talk time off and what could happen if you don't have the time.", "Interview Questions": "a lot of....tell me a time when questions"}, {"date": "23 Apr 2018", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Colorado Technical University (Schaumburg, IL) in Apr 2018", "Interview Descriptions": "Short interview. Met with two people in management separately and shadowed an employee for a few minutes. Neither sit down was informative. They are very numbers driven. Numbers are looked at daily, weekly and monthly. They really stressed the “sales” aspect of the job.", "Interview Questions": "What motivates you"}, {"date": "17 Nov 2021", "title": "Admission Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Colorado Technical University (Schaumburg, IL) in Mar 2018", "Interview Descriptions": "Very typical job interview. Overall it was a great experience. Interviewer was nice and open about all questions I had . It was very easy going and straight forward. Nice experience", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Nov 2017", "title": "National Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Colorado Technical University (Schaumburg, IL) in Oct 2017", "Interview Descriptions": "Went through a recruiting service. Was emailed interview information. However, I did not meet with the person listed on the email. They had to locate someone else who I believe was the person's boss.  He interviewed me very quickly and sent me to shadow an employee.  I did that for about 15 minutes. I then met with with two people who again did not ask many questions. Mainly asked if I had questions.", "Interview Questions": "Tell me about a time you failed at something and what you learned. What did you do  about a problem you had with a coworker or employee."}], [{"date": "21 Nov 2016", "title": "Faculty Development Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado Technical University (Schaumburg, IL)", "Interview Descriptions": "Submitted application online.  Within one week I received a call for a conference phone interview with 3 people.  That interview took one hour or so and was fairly relaxed and pleasant.  Immediate call-back for an in person one hour interview the following week with two people, that was also pleasant.  I received a short tour of the facility.  Received within one day a request for a one hour phone interview with a VP.  That too went well.  Two days later offered position.  Total process was just under 2 1/2 weeks.  Quite quick and very professional.", "Interview Questions": "Explain your experience with software commonly used in online education."}, {"date": "22 Sept 2016", "title": "Admissions Advisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado Technical University (Schaumburg, IL) in Sept 2016", "Interview Descriptions": "Quite quick.  Sent me to shadow an employee that morning.  I knew I was getting an offer that day but I didn't get a real offer for about a week.  I was offered a position in the evening without any discussion of benefits or other important information one needs to accept an offer.", "Interview Questions": "Describe your job experience."}, {"date": "8 Mar 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Colorado Technical University", "Interview Descriptions": "I was called by a headhunter, the next week I showed up for an interview with the manager in the office and the head of the campuses. The focus was entirely on my own sales experience (the only thing that qualified me for the position) and almost devoid of any questions relating to my educational background (which is pretty great, actually) or opinions/thoughts on the role of diversity in a campus.", "Interview Questions": "\"What would be your 'elevator speech' for this school?\""}, {"date": "21 Feb 2016", "title": "Management Role Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colorado Technical University (Schaumburg, IL) in Jan 2016", "Interview Descriptions": "Behavioral interview based on previous actions and interactions with internal employees to include other departments and management. The individuals are not allowed to disclose any numbers about student populations or overall budget requirements for the month or the year. In some cases the advancement is based off an open role interview process (vrs applying for the next level) and off how the manager “feels” which can determine if or when you should advance.", "Interview Questions": "Please tell us your greatest accomplishment within your time here at the university? Why do you feel that this is a successful accomplishment? How did you evaluate your overall success?"}, {"date": "25 Jan 2016", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Colorado Technical University (Schaumburg, IL) in Jan 2016", "Interview Descriptions": "I applied online to several open positions listed by CTU. During a phone interview, the interviewer asked me the normal basic questions, and if I'd worked previously in a position with quota expectations. I was also asked about my last salary. The position sounded to me like a call center position that reflects little concern for students and only concern with the number of calls made. The interviewer was unable or reluctant to describe the actual work environment of academic advisors, however admitted that the position is \"like\" a call center position in which the employee reads from a script. A few hours later, I received a rejection email. Other posts appear to agree with my first impression.", "Interview Questions": "What would you say to a student that seems reluctant to be cooperatve?"}, {"date": "6 Oct 2015", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Colorado Technical University", "Interview Descriptions": "The interview consisted of two rounds. The first round was rather straight forward, typical questions given by managers with a brief overview of the position.  The second round was an interview with the director in order to learn more about myself.", "Interview Questions": "tell us if your customer service experience."}, {"date": "19 Sept 2015", "title": "Student Success Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Colorado Technical University", "Interview Descriptions": "A three person interview panel. They introduced themselves and then rotated through fifteen performance based behavioral questions. No real discussion or feedback after each question. Once the questions were complete, they allowed time for me to question them about the position and institution. Afterward, I was introduced and briefly interviewed by the supervisor. This was more of a back and forth discussion about my background and why I would like to work there.  No real surprises overall.", "Interview Questions": "Tell us about a time when you had to deal with a dissatisfied student or customer and how you dealt with the situation."}, {"date": "18 Jul 2018", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Colorado Technical University (Schaumburg, IL) in Aug 2015", "Interview Descriptions": "The interview process was pretty standard to most other processes. I first had to take an online assessment to determine if i was even eligible to apply. I then had an in person one on one interview with my director and then I had a phone interview with my Director's manager.", "Interview Questions": "They asked a lot of questions relative to hypothetical situations"}, {"date": "1 Mar 2016", "title": "National Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Colorado Technical University (Schaumburg, IL) in Jun 2015", "Interview Descriptions": "Very easy. In a lot of cases the temporary agency even offers the interview questions. Make sure to be prepared to offer examples of past experiences (i.e. a time when you lead)", "Interview Questions": "I don't remember the exact questions but just be ready to answer basic sales based kind of questions. "}, {"date": "18 May 2015", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado Technical University (Schaumburg, IL)", "Interview Descriptions": "A recruiter phone screen followed by a departmental phone interview. Didn't get to the next step. It was kind of a disjointed process. I got mixed messages as to if I would move on to the next step. I thought I was going to have an in-person interview, but then got a form rejection email.", "Interview Questions": "Talk about your experience."}], [{"date": "4 Nov 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Colorado Technical University (San Diego, CA) in May 2015", "Interview Descriptions": "Interviewed with someone from HR and the Program Chair along with taking some personality tests. It was pretty straight forward for the industry and the job title. As well, you were given scenarios and asked how you would respond.", "Interview Questions": "What sorts of outside learning materials would you bring to your courses?"}, {"date": "9 May 2015", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Colorado Technical University (Schaumburg, IL) in Apr 2015", "Interview Descriptions": "I met a recruiter at a job fair who told me they would contact me in a week for a phone interview. A week later, when I answered the call from Colorado Technical University, someone who was not the recruiter interviewed me. The interviewer explained the job responsibilities and the company background before asking me a series of questions. The questions were behavioral based and not very difficult.", "Interview Questions": "How important is ethics in the workplace?"}, {"date": "23 Feb 2017", "title": "Senior Marketing Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Colorado Technical University (Schaumburg, IL) in Feb 2015", "Interview Descriptions": "Was contacted by a recruiter who stated the available role was an ideal match for my background.  During the initial call, I called out that I was also a student with the university and the recruiter was surprised to learn this, despite finding me on LinkedIn and having a copy of my resume.  The same occurred with the hiring manager.  Prior to coming in for an in-person interview, I was given an assignment to do which required development of a presentation to be discussed during the in-person interview.  At the in-person interview, I met with the hiring manager, with the VP one level up, and with the team who would become my colleagues.", "Interview Questions": "What experience do you have with email marketing?"}, {"date": "30 Mar 2015", "title": "Admission Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Colorado Technical University (Schaumburg, IL) in Feb 2015", "Interview Descriptions": "Interviewed with one of the directors, shadowed a senior representative and interviewed with another director. The interview consisted your typical \"What would you do if....?\" questions. If you have a sales or are customer service savy answering the questions should be a breeze", "Interview Questions": "How do you handle stress?"}, {"date": "14 Jan 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Colorado Technical University (Schaumburg, IL)", "Interview Descriptions": "Went through a staffing  agency, sent application , called 2 days later, inverview lasted about 25 mnutes, called before the end of the day with a start date.  Staffing agency process was much longer to fill out the paperwork.  The wait in the lobby was longer than the interview,", "Interview Questions": "Nothing really challenging except question about what you feel about education."}, {"date": "29 Jul 2015", "title": "Student Success Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Colorado Technical University (Schaumburg, IL) in Jan 2015", "Interview Descriptions": "Basic questions for academic advising.  Three part interview process.  First you are contacted by a talent acquisition rep who does an initial screening via phone.  They will ask you a few simple questions to ensure you understand the job description and overall for-profit culture of the company. Within a week or two, you will be contacted by a manager to schedule an in-person interview.  Interview itself takes about an hour.  Managers in student advising are fairly casual, and prefer a conversation over an in-depth interview.  If you make it to the third phase, you will be contacted via phone by the Director of Student Advising, or the VP of the university for an impromptu final interview.  Much more of a formal interview compared to the one with the managers, which is odd given it is not a scheduled item.  If the Director/VP is satisfied with your answers, they will contact the talent acquisition rep who will extend an offer.  Two weeks of training follows, as well as a company orientation to Career Education Corporation.  If you worked in not-for-profit before, it is similar to Agents of Shield when you see Simmons working in the Hydra lab.", "Interview Questions": "Explain previous situations in which you advised a student on life events preventing them from attending class, and how you were able to encourage retention"}, {"date": "15 Dec 2014", "title": "Student Success Coach Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Colorado Technical University (Schaumburg, IL) in Dec 2014", "Interview Descriptions": "I am a former CEC employee (laid off from AIU), and I applied for the opening online (CEC website). I also had a referral from friend who was also laid off six months after me (same school). I reached out to the aforementioned friend (who is now a manager for CTU) who informed me that their recruiter would be following up shortly, and twenty minutes after I received that e-mail, the recruiter called. I was asked a series of general questions, and they noticed my background of having been previously employed with CEC, including for a significant number of years in a comparable role. There was a concern about salary - namely that it would be lower than my ending salary was when I was laid off, to which I acknowledged understanding, considering that I would (potentially) be starting over. I was given the go-ahead for the in-person interview with one person, but when I arrived, I was interviewed by two totally different people because the scheduled interviewer was out of the office (I was not informed of this change). The interview seemed to go well, and they seemed to be impressed with my background as well as previous tenure with CEC. At the conclusion, I asked when I would be hearing back, and I was told that it would probably be before the holidays, and I learned today that, despite my \"impressive background\" (which almost completely aligns with the expectations and requirements of the role) I was not selected.", "Interview Questions": "There were no difficult or unexpected questions."}, {"date": "27 Jun 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Colorado Technical University (Elgin, IL) in Dec 2014", "Interview Descriptions": "Two phone interviews and one in person interview. The interviews are not too long and the interviewers are rather respectful of your time. This was the first time I had to answer three, or four of the, \"Tell me about a time when...\", questions. Just be able to recall your past experiences in detail.", "Interview Questions": "Several of the, \"Tell me about a time when....\" questions. Also the standard ones like, \"Why do you want to work here and what do you bring to the table\"."}, {"date": "1 Nov 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Colorado Technical University (Schaumburg, IL)", "Interview Descriptions": "I was referred. The process took about 2 weeks. I was given a standard phone interview then scheduled to come in to be interviewed by a DOA (Director of Admissions.", "Interview Questions": "Interview was very simple. Experienced based questions followed by behavioral questions. Nothing you should not be able to answer very well. "}, {"date": "3 Dec 2014", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Colorado Technical University (Downers Grove, IL) in Oct 2014", "Interview Descriptions": "I was asked to take this interview by a staffing agent at Ultimate Staffing Agency. The agent basically told me that I already had the position. I arrived at the location in Downers Grove,IL early. As I was waiting to be seen, several other candidates were in the lobby with me. The people who were interviewing came to the lobby greeted me and then we went to a separate conference room to do the interview. They began by telling me the shifts that were available for each team of admissions advisors, and also the hierarchy of the admissions department. I was asked interview questions my response was to be in a STAR (Situation, Task, Action, Results) format as they explained in the beginning of the interview. I was asked also to read a paragraph aloud then answer questions following based in what I read. Also was as to tell the interviewers a little about myself.", "Interview Questions": "Tell me about a time you exceeded the expectations your own expectations."}], [{"date": "12 Sept 2014", "title": "Support Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Colorado Technical University", "Interview Descriptions": "There we two sets of interviews. One with a panel of three, and the second with an immediate supervisor and the Director of Operations. Had to wait for an offer due to negotiating a higher salary due to a discrepancy between HR and the school. Thankfully I received the salary that I had asked for, and was notified promptly by HR. Plus, my immediate supervisor kept me in the loop as to the process as well. Background check was done, and once I passed, my supervisor called to ask me about business cards to order before my start date!", "Interview Questions": "N/A"}, {"date": "25 Mar 2014", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Colorado Technical University", "Interview Descriptions": "first  a face to face and then some shadowing. Always be talking about closing and being successful. Must be open to long hours and weekends and ready to give your life to CTU. Speak clearly with great pronunciation. Must be articulate on the phones. Show personality and energy and a passion for education and development.Will then shadow with an advisor. He/she will most likely be a senior or direct favorite to director. After you leave they will ask that advisor what they thought. My DOA relied heavily on my input about each candidate. 9 out of 10 made decision based on my evaluation.", "Interview Questions": "Please name good or bad things about yourself. Do you have a problem working weekends and holidays? Why do you want to work in education?"}, {"date": "24 Mar 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Colorado Technical University in Jan 2014", "Interview Descriptions": "I applied online and was looped into an automated process.  I only had one phone interview which was very conversational and if you qualify you are move into a one month training program (unpaid) which is graded to move you though the process.\r\n\r\nThe program is intended to test your ability to use their technology (Adobe Connect) as well as teach the policies.", "Interview Questions": "Nothing unexpected the interview was very conversational."}, {"date": "28 Nov 2017", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Colorado Technical University (Downers Grove, IL) in Oct 2013", "Interview Descriptions": "30 min intense interviewing questions.  Advise: learn about the company. Have questions prepared to ask at the end.  They like that.  This job has been the easiest jobs to get, pays great and they like having fun.", "Interview Questions": "Do I have an sales experience "}, {"date": "12 Jun 2014", "title": "National Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at Colorado Technical University (Downers Grove, IL) in Jul 2013", "Interview Descriptions": "Two phone interviews followed by to in person interviews. Not a very hard process but very thorough . I was very impressed. They took the time to explain the job in detail and answered all my questions without side stepping my concerns.", "Interview Questions": "What is your biggest area of opportunity must answer."}, {"date": "26 Mar 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Colorado Technical University (Downers Grove, IL) in Apr 2013", "Interview Descriptions": "Hiring manager interviewed me then turned me over to someone else who didn't even know why he did. He was very caught off guard.", "Interview Questions": "Typical questions like what would you do in a certain situation. "}, {"date": "19 Nov 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Colorado Technical University (Schaumburg, IL) in Mar 2013", "Interview Descriptions": "I went through an employment agency initially. This company tends to do bulk hiring through employment agencies versus direct hire. I sat down with the VP initially and was transitioned to a director, and lastly on the floor job training to see how the flow of the position works.", "Interview Questions": "Prior academic, admissions experience? How do you overcome objections with communicating with prospective students?  "}, {"date": "14 Nov 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Colorado Technical University (Downers Grove, IL) in Oct 2012", "Interview Descriptions": "Apply online, get contacted to complete a career assessment. Interview is scheduled based upon score and initial interview can be group or single. If they like you will have second interview by higher manager that day in most cases.", "Interview Questions": "Why do you want to work here?  Why  do you value education?"}, {"date": "22 Jun 2015", "title": "Work Study Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Colorado Technical University (Aurora, CO) in Sept 2012", "Interview Descriptions": "Basic interview questions that most employers ask.  The individual that was interviewing me was the person that approached me about the job and requested I apply for the tutoring position she was posting.  Since I was a student, she had the confidence in me to perform tutoring for other students that needed help.", "Interview Questions": "How well do you get along with people"}, {"date": "10 Jun 2015", "title": "Registrar's Office Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Colorado Technical University (Colorado Springs, CO) in Nov 2011", "Interview Descriptions": "It was a formal interview. I was taken back to the Deans area where Registrar's was located. The office was smaller than I had expected. The interview was done by the Registrar and Registrar's assistant. Both of them were female. The Registrar was polite and always kept a smile on her face. It was hard to judge any reaction to any of my responses.", "Interview Questions": "The questions I remember: How much did I know about CTU. How much did I know about the position I applied for. Did I like working with people or alone. How much did I know about computer applications such as Microsoft outlook, excel, word....ect"}], [{"date": "10 Mar 2015", "title": "Online Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Colorado Technical University (Downers Grove, IL) in Oct 2011", "Interview Descriptions": "First and Second Interview, with questions on prior job experience, what I did in my last job and how would that experience transition into this job if offered and how would I integrate those skills in the position.", "Interview Questions": "How did you hear about us? Tell me a little about your work history? Would this be a position or company you would be interested in working in and for?"}, {"date": "23 Sept 2015", "title": "Information Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Colorado Technical University (Kansas City, MO) in Oct 2011", "Interview Descriptions": "Questions regarding:\r\n\r\nHeld multifaceted responsibility to configure, install and administer network infrastructure and telelcomommmunications systems that supported staff of 200 staff and faculty as well as 900 students.\r\n•\tHelped develop and establish policy and procedure.\r\n•\tDefined acceptable use of I.T. assets with the university. \r\n•\tFulfilled administrative responsibilities including the addition and changes to user desktop, email, and Active Directory accounts.\r\n•\tInstalled and maintained Cisco Routers and Switches.\r\n•\tActively installed and maintained proprietary software and programmatic coursework software.\r\n•\tCompleted full migration of systems to bring current", "Interview Questions": "How do you relate with non-technical educators?"}, {"date": "14 Apr 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Colorado Technical University (Schaumburg, IL) in Sept 2011", "Interview Descriptions": "Two managers or more will conduct the interview.  They want to know if you can close.  Are you ethical?  Are you an ontime worker?", "Interview Questions": "List a time when you were not your best at work by providing details.  A time when you could not turn it around."}, {"date": "13 Apr 2011", "title": "Department Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Colorado Technical University (Colorado Springs, CO) in Mar 2011", "Interview Descriptions": "I was interviewed by the President, who was new to their job, the chief operating officer and the HR manager.  They were very professional.  This is a for profit university.  So the emphasis on the interview was different from other higher education institutions I have worked for.  CTU is part of Rasmussen Education, Inc. and is run like a corporation.  However they offer degrees through the doctoral level, so it is not just a samll technical school.  For profit schools are now under pressure from the feds to minimize student loan default rates.  this can hurt enrollment numbers, and thus hurt funding.  So the interview really focused on strategies for maximizing profitability of the school, more than education of the students.", "Interview Questions": "What is going on in Libya (asked by the Pres., ex-military)?"}, {"date": "22 May 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Colorado Technical University (Colorado Springs, CO) in Jan 2011", "Interview Descriptions": "It was a single meeting with the Chair of the Department. He stated that I had all the qualifications and skills, and offered the job on the spot.  He gave me a couple days to think it over and I excepted early the following week.  Training session were held quarterly, so I had a few months until training started.  Very easy & uneventful for me at the CTU-Colorado Springs site.", "Interview Questions": "Why was I interested in teaching?"}, {"date": "30 Jan 2014", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Colorado Technical University in Jun 2010", "Interview Descriptions": "Initial interview was was assistant directors. Very informal. It was essentially a meet an greet. The second round was a group interview where they posed questions and applicants gave answers in a round table format.", "Interview Questions": "Questions were very standard. Things like what are your strengths/weaknesses. What was your greatest failure and how did overcome or learn from it etc..."}, {"date": "12 Jun 2010", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Colorado Technical University (Warrenville, IL) in May 2010", "Interview Descriptions": "I initially had a brief phone interview with CTU's recruiter, then they scheduled me for a skills test in this testing area located in Schaumburg. Passed the test and was then scheduled for a one on one interview. The interviewer has a questionairre in hand wherein she's reading the questions and taking down notes on my answers. The questions are mostly situational. Over all the interview went well. I was just expecting that they would inform their candidates the result of their applications via email or mail letter than just nothing at all. So I just assumed they got somebody else when I didnt hear anything from them since then.", "Interview Questions": "How would you deal with difficult superiors?"}, {"date": "15 Mar 2013", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Colorado Technical University in Oct 2009", "Interview Descriptions": "The university required 2 interviews along with background and references checks. My interviews were conducted by phone, not face to face, since I was being considered for an online teaching position based remotely.", "Interview Questions": "What is your teaching philosophy? (I should have anticipated this one but I was new to the process at the time.)"}, {"date": "29 Jul 2013", "title": "Admissions Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Colorado Technical University in Sept 2009", "Interview Descriptions": "They use the STAR interview process. Pretty straight forward. Know your strengths and weaknesses and be ready to sell yourself. Interviewers are trained not to show you if they like your or not so don't be mislead by the stoic presence. Dress professionally as you will be judged by how you look. Also, if you are seated with an admissions advisor, stay engaged because they will take their opinion into consideration.", "Interview Questions": "Describe a situation when you did not meet a goal or minimum expecation."}, {"date": "27 Oct 2009", "title": "Academic Support Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Colorado Technical University (Colorado Springs, CO) in Jan 2008", "Interview Descriptions": "THe phone interview was very easy.  I wanted to understand the position more and asked some questions about what are the responsibility and requirements.  Never really was given a straight answer and not sure if the phone interviewer knew anything about the position besides what I knew from the job positing.", "Interview Questions": "What salary rage are you looking for?"}]][[{"date": "4 Mar 2023", "title": "Student Success Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Colorado Technical University", "Interview Descriptions": "Was two rounds. First with manager then associate director. Pretty general questions, how do you work in remote environment? They were professional and nice. I believe if first round with managers you seem like a good fit they will then ask you to go to second round with associate director but I am not sure.", "Interview Questions": "How do you handle conflict?"}, {"date": "19 Mar 2021", "title": "National Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Colorado Technical University in Mar 2021", "Interview Descriptions": "The interview process was very informative and the interviewer was very nice and easy to talk to. The whole process was easy and quick. They tell you their exact expectations and answer all your questions thoughtfully.", "Interview Questions": "Previous employment, customer service questions"}, {"date": "10 Feb 2021", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Colorado Technical University (Colorado Springs, CO) in Feb 2021", "Interview Descriptions": "The interview was through Zoom. There were three faculty members present and it went for 40 minutes. The questions were about student engagement, teachability/coaching,  and classroom presence.  It was very relaxed and the committee members were very positive. There was a lot of good head nodding when I spoke.", "Interview Questions": "How do you engage with students? How frequently do you engage with students? Are you open to being coached as a teacher? "}, {"date": "17 Jul 2021", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colorado Technical University (Houston, TX) in Apr 2020", "Interview Descriptions": "The two people I interviewed were late to the interview by almost 15 minutes and seemed disinterested from the start and found out the position was filled the next day.", "Interview Questions": "They used a behavior based interview style. Very similar to other interviews "}, {"date": "8 Jul 2019", "title": "Student Success Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Colorado Technical University", "Interview Descriptions": "2 rounds of interviews.  First round is with a recruiter to clear basic understanding of the organization and ensure it is known this is a for-profit institution.  Second round was with the future manager and one of their colleagues.  Basic interview questions", "Interview Questions": "Tell us a time when you had to share disappointing or otherwise difficult news to a student. "}, {"date": "11 Jul 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Colorado Technical University", "Interview Descriptions": "Magnificent. They allow you to get a feel and overview of your prospective job just in the same day of the interview.  Very easy process and it was a long interview.  It was definitely worth it.", "Interview Questions": "What do you look for in a company or your managers?"}, {"date": "23 Apr 2018", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Colorado Technical University", "Interview Descriptions": "very detail, but they don't talk about hours getting changed and you have to bid on new ones. they need to explain when you need to talk time off and what could happen if you don't have the time.", "Interview Questions": "a lot of....tell me a time when questions"}, {"date": "23 Apr 2018", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Colorado Technical University (Schaumburg, IL) in Apr 2018", "Interview Descriptions": "Short interview. Met with two people in management separately and shadowed an employee for a few minutes. Neither sit down was informative. They are very numbers driven. Numbers are looked at daily, weekly and monthly. They really stressed the “sales” aspect of the job.", "Interview Questions": "What motivates you"}, {"date": "17 Nov 2021", "title": "Admission Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Colorado Technical University (Schaumburg, IL) in Mar 2018", "Interview Descriptions": "Very typical job interview. Overall it was a great experience. Interviewer was nice and open about all questions I had . It was very easy going and straight forward. Nice experience", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Nov 2017", "title": "National Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Colorado Technical University (Schaumburg, IL) in Oct 2017", "Interview Descriptions": "Went through a recruiting service. Was emailed interview information. However, I did not meet with the person listed on the email. They had to locate someone else who I believe was the person's boss.  He interviewed me very quickly and sent me to shadow an employee.  I did that for about 15 minutes. I then met with with two people who again did not ask many questions. Mainly asked if I had questions.", "Interview Questions": "Tell me about a time you failed at something and what you learned. What did you do  about a problem you had with a coworker or employee."}], [{"date": "21 Nov 2016", "title": "Faculty Development Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado Technical University (Schaumburg, IL)", "Interview Descriptions": "Submitted application online.  Within one week I received a call for a conference phone interview with 3 people.  That interview took one hour or so and was fairly relaxed and pleasant.  Immediate call-back for an in person one hour interview the following week with two people, that was also pleasant.  I received a short tour of the facility.  Received within one day a request for a one hour phone interview with a VP.  That too went well.  Two days later offered position.  Total process was just under 2 1/2 weeks.  Quite quick and very professional.", "Interview Questions": "Explain your experience with software commonly used in online education."}, {"date": "22 Sept 2016", "title": "Admissions Advisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado Technical University (Schaumburg, IL) in Sept 2016", "Interview Descriptions": "Quite quick.  Sent me to shadow an employee that morning.  I knew I was getting an offer that day but I didn't get a real offer for about a week.  I was offered a position in the evening without any discussion of benefits or other important information one needs to accept an offer.", "Interview Questions": "Describe your job experience."}, {"date": "8 Mar 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Colorado Technical University", "Interview Descriptions": "I was called by a headhunter, the next week I showed up for an interview with the manager in the office and the head of the campuses. The focus was entirely on my own sales experience (the only thing that qualified me for the position) and almost devoid of any questions relating to my educational background (which is pretty great, actually) or opinions/thoughts on the role of diversity in a campus.", "Interview Questions": "\"What would be your 'elevator speech' for this school?\""}, {"date": "21 Feb 2016", "title": "Management Role Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colorado Technical University (Schaumburg, IL) in Jan 2016", "Interview Descriptions": "Behavioral interview based on previous actions and interactions with internal employees to include other departments and management. The individuals are not allowed to disclose any numbers about student populations or overall budget requirements for the month or the year. In some cases the advancement is based off an open role interview process (vrs applying for the next level) and off how the manager “feels” which can determine if or when you should advance.", "Interview Questions": "Please tell us your greatest accomplishment within your time here at the university? Why do you feel that this is a successful accomplishment? How did you evaluate your overall success?"}, {"date": "25 Jan 2016", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Colorado Technical University (Schaumburg, IL) in Jan 2016", "Interview Descriptions": "I applied online to several open positions listed by CTU. During a phone interview, the interviewer asked me the normal basic questions, and if I'd worked previously in a position with quota expectations. I was also asked about my last salary. The position sounded to me like a call center position that reflects little concern for students and only concern with the number of calls made. The interviewer was unable or reluctant to describe the actual work environment of academic advisors, however admitted that the position is \"like\" a call center position in which the employee reads from a script. A few hours later, I received a rejection email. Other posts appear to agree with my first impression.", "Interview Questions": "What would you say to a student that seems reluctant to be cooperatve?"}, {"date": "6 Oct 2015", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Colorado Technical University", "Interview Descriptions": "The interview consisted of two rounds. The first round was rather straight forward, typical questions given by managers with a brief overview of the position.  The second round was an interview with the director in order to learn more about myself.", "Interview Questions": "tell us if your customer service experience."}, {"date": "19 Sept 2015", "title": "Student Success Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Colorado Technical University", "Interview Descriptions": "A three person interview panel. They introduced themselves and then rotated through fifteen performance based behavioral questions. No real discussion or feedback after each question. Once the questions were complete, they allowed time for me to question them about the position and institution. Afterward, I was introduced and briefly interviewed by the supervisor. This was more of a back and forth discussion about my background and why I would like to work there.  No real surprises overall.", "Interview Questions": "Tell us about a time when you had to deal with a dissatisfied student or customer and how you dealt with the situation."}, {"date": "18 Jul 2018", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Colorado Technical University (Schaumburg, IL) in Aug 2015", "Interview Descriptions": "The interview process was pretty standard to most other processes. I first had to take an online assessment to determine if i was even eligible to apply. I then had an in person one on one interview with my director and then I had a phone interview with my Director's manager.", "Interview Questions": "They asked a lot of questions relative to hypothetical situations"}, {"date": "1 Mar 2016", "title": "National Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Colorado Technical University (Schaumburg, IL) in Jun 2015", "Interview Descriptions": "Very easy. In a lot of cases the temporary agency even offers the interview questions. Make sure to be prepared to offer examples of past experiences (i.e. a time when you lead)", "Interview Questions": "I don't remember the exact questions but just be ready to answer basic sales based kind of questions. "}, {"date": "18 May 2015", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colorado Technical University (Schaumburg, IL)", "Interview Descriptions": "A recruiter phone screen followed by a departmental phone interview. Didn't get to the next step. It was kind of a disjointed process. I got mixed messages as to if I would move on to the next step. I thought I was going to have an in-person interview, but then got a form rejection email.", "Interview Questions": "Talk about your experience."}], [{"date": "4 Nov 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Colorado Technical University (San Diego, CA) in May 2015", "Interview Descriptions": "Interviewed with someone from HR and the Program Chair along with taking some personality tests. It was pretty straight forward for the industry and the job title. As well, you were given scenarios and asked how you would respond.", "Interview Questions": "What sorts of outside learning materials would you bring to your courses?"}, {"date": "9 May 2015", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Colorado Technical University (Schaumburg, IL) in Apr 2015", "Interview Descriptions": "I met a recruiter at a job fair who told me they would contact me in a week for a phone interview. A week later, when I answered the call from Colorado Technical University, someone who was not the recruiter interviewed me. The interviewer explained the job responsibilities and the company background before asking me a series of questions. The questions were behavioral based and not very difficult.", "Interview Questions": "How important is ethics in the workplace?"}, {"date": "23 Feb 2017", "title": "Senior Marketing Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Colorado Technical University (Schaumburg, IL) in Feb 2015", "Interview Descriptions": "Was contacted by a recruiter who stated the available role was an ideal match for my background.  During the initial call, I called out that I was also a student with the university and the recruiter was surprised to learn this, despite finding me on LinkedIn and having a copy of my resume.  The same occurred with the hiring manager.  Prior to coming in for an in-person interview, I was given an assignment to do which required development of a presentation to be discussed during the in-person interview.  At the in-person interview, I met with the hiring manager, with the VP one level up, and with the team who would become my colleagues.", "Interview Questions": "What experience do you have with email marketing?"}, {"date": "30 Mar 2015", "title": "Admission Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Colorado Technical University (Schaumburg, IL) in Feb 2015", "Interview Descriptions": "Interviewed with one of the directors, shadowed a senior representative and interviewed with another director. The interview consisted your typical \"What would you do if....?\" questions. If you have a sales or are customer service savy answering the questions should be a breeze", "Interview Questions": "How do you handle stress?"}, {"date": "14 Jan 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Colorado Technical University (Schaumburg, IL)", "Interview Descriptions": "Went through a staffing  agency, sent application , called 2 days later, inverview lasted about 25 mnutes, called before the end of the day with a start date.  Staffing agency process was much longer to fill out the paperwork.  The wait in the lobby was longer than the interview,", "Interview Questions": "Nothing really challenging except question about what you feel about education."}, {"date": "29 Jul 2015", "title": "Student Success Coach Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Colorado Technical University (Schaumburg, IL) in Jan 2015", "Interview Descriptions": "Basic questions for academic advising.  Three part interview process.  First you are contacted by a talent acquisition rep who does an initial screening via phone.  They will ask you a few simple questions to ensure you understand the job description and overall for-profit culture of the company. Within a week or two, you will be contacted by a manager to schedule an in-person interview.  Interview itself takes about an hour.  Managers in student advising are fairly casual, and prefer a conversation over an in-depth interview.  If you make it to the third phase, you will be contacted via phone by the Director of Student Advising, or the VP of the university for an impromptu final interview.  Much more of a formal interview compared to the one with the managers, which is odd given it is not a scheduled item.  If the Director/VP is satisfied with your answers, they will contact the talent acquisition rep who will extend an offer.  Two weeks of training follows, as well as a company orientation to Career Education Corporation.  If you worked in not-for-profit before, it is similar to Agents of Shield when you see Simmons working in the Hydra lab.", "Interview Questions": "Explain previous situations in which you advised a student on life events preventing them from attending class, and how you were able to encourage retention"}, {"date": "15 Dec 2014", "title": "Student Success Coach Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Colorado Technical University (Schaumburg, IL) in Dec 2014", "Interview Descriptions": "I am a former CEC employee (laid off from AIU), and I applied for the opening online (CEC website). I also had a referral from friend who was also laid off six months after me (same school). I reached out to the aforementioned friend (who is now a manager for CTU) who informed me that their recruiter would be following up shortly, and twenty minutes after I received that e-mail, the recruiter called. I was asked a series of general questions, and they noticed my background of having been previously employed with CEC, including for a significant number of years in a comparable role. There was a concern about salary - namely that it would be lower than my ending salary was when I was laid off, to which I acknowledged understanding, considering that I would (potentially) be starting over. I was given the go-ahead for the in-person interview with one person, but when I arrived, I was interviewed by two totally different people because the scheduled interviewer was out of the office (I was not informed of this change). The interview seemed to go well, and they seemed to be impressed with my background as well as previous tenure with CEC. At the conclusion, I asked when I would be hearing back, and I was told that it would probably be before the holidays, and I learned today that, despite my \"impressive background\" (which almost completely aligns with the expectations and requirements of the role) I was not selected.", "Interview Questions": "There were no difficult or unexpected questions."}, {"date": "27 Jun 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Colorado Technical University (Elgin, IL) in Dec 2014", "Interview Descriptions": "Two phone interviews and one in person interview. The interviews are not too long and the interviewers are rather respectful of your time. This was the first time I had to answer three, or four of the, \"Tell me about a time when...\", questions. Just be able to recall your past experiences in detail.", "Interview Questions": "Several of the, \"Tell me about a time when....\" questions. Also the standard ones like, \"Why do you want to work here and what do you bring to the table\"."}, {"date": "1 Nov 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Colorado Technical University (Schaumburg, IL)", "Interview Descriptions": "I was referred. The process took about 2 weeks. I was given a standard phone interview then scheduled to come in to be interviewed by a DOA (Director of Admissions.", "Interview Questions": "Interview was very simple. Experienced based questions followed by behavioral questions. Nothing you should not be able to answer very well. "}, {"date": "3 Dec 2014", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Colorado Technical University (Downers Grove, IL) in Oct 2014", "Interview Descriptions": "I was asked to take this interview by a staffing agent at Ultimate Staffing Agency. The agent basically told me that I already had the position. I arrived at the location in Downers Grove,IL early. As I was waiting to be seen, several other candidates were in the lobby with me. The people who were interviewing came to the lobby greeted me and then we went to a separate conference room to do the interview. They began by telling me the shifts that were available for each team of admissions advisors, and also the hierarchy of the admissions department. I was asked interview questions my response was to be in a STAR (Situation, Task, Action, Results) format as they explained in the beginning of the interview. I was asked also to read a paragraph aloud then answer questions following based in what I read. Also was as to tell the interviewers a little about myself.", "Interview Questions": "Tell me about a time you exceeded the expectations your own expectations."}], [{"date": "12 Sept 2014", "title": "Support Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Colorado Technical University", "Interview Descriptions": "There we two sets of interviews. One with a panel of three, and the second with an immediate supervisor and the Director of Operations. Had to wait for an offer due to negotiating a higher salary due to a discrepancy between HR and the school. Thankfully I received the salary that I had asked for, and was notified promptly by HR. Plus, my immediate supervisor kept me in the loop as to the process as well. Background check was done, and once I passed, my supervisor called to ask me about business cards to order before my start date!", "Interview Questions": "N/A"}, {"date": "25 Mar 2014", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Colorado Technical University", "Interview Descriptions": "first  a face to face and then some shadowing. Always be talking about closing and being successful. Must be open to long hours and weekends and ready to give your life to CTU. Speak clearly with great pronunciation. Must be articulate on the phones. Show personality and energy and a passion for education and development.Will then shadow with an advisor. He/she will most likely be a senior or direct favorite to director. After you leave they will ask that advisor what they thought. My DOA relied heavily on my input about each candidate. 9 out of 10 made decision based on my evaluation.", "Interview Questions": "Please name good or bad things about yourself. Do you have a problem working weekends and holidays? Why do you want to work in education?"}, {"date": "24 Mar 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Colorado Technical University in Jan 2014", "Interview Descriptions": "I applied online and was looped into an automated process.  I only had one phone interview which was very conversational and if you qualify you are move into a one month training program (unpaid) which is graded to move you though the process.\r\n\r\nThe program is intended to test your ability to use their technology (Adobe Connect) as well as teach the policies.", "Interview Questions": "Nothing unexpected the interview was very conversational."}, {"date": "28 Nov 2017", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Colorado Technical University (Downers Grove, IL) in Oct 2013", "Interview Descriptions": "30 min intense interviewing questions.  Advise: learn about the company. Have questions prepared to ask at the end.  They like that.  This job has been the easiest jobs to get, pays great and they like having fun.", "Interview Questions": "Do I have an sales experience "}, {"date": "12 Jun 2014", "title": "National Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at Colorado Technical University (Downers Grove, IL) in Jul 2013", "Interview Descriptions": "Two phone interviews followed by to in person interviews. Not a very hard process but very thorough . I was very impressed. They took the time to explain the job in detail and answered all my questions without side stepping my concerns.", "Interview Questions": "What is your biggest area of opportunity must answer."}, {"date": "26 Mar 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Colorado Technical University (Downers Grove, IL) in Apr 2013", "Interview Descriptions": "Hiring manager interviewed me then turned me over to someone else who didn't even know why he did. He was very caught off guard.", "Interview Questions": "Typical questions like what would you do in a certain situation. "}, {"date": "19 Nov 2015", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Colorado Technical University (Schaumburg, IL) in Mar 2013", "Interview Descriptions": "I went through an employment agency initially. This company tends to do bulk hiring through employment agencies versus direct hire. I sat down with the VP initially and was transitioned to a director, and lastly on the floor job training to see how the flow of the position works.", "Interview Questions": "Prior academic, admissions experience? How do you overcome objections with communicating with prospective students?  "}, {"date": "14 Nov 2016", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Colorado Technical University (Downers Grove, IL) in Oct 2012", "Interview Descriptions": "Apply online, get contacted to complete a career assessment. Interview is scheduled based upon score and initial interview can be group or single. If they like you will have second interview by higher manager that day in most cases.", "Interview Questions": "Why do you want to work here?  Why  do you value education?"}, {"date": "22 Jun 2015", "title": "Work Study Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Colorado Technical University (Aurora, CO) in Sept 2012", "Interview Descriptions": "Basic interview questions that most employers ask.  The individual that was interviewing me was the person that approached me about the job and requested I apply for the tutoring position she was posting.  Since I was a student, she had the confidence in me to perform tutoring for other students that needed help.", "Interview Questions": "How well do you get along with people"}, {"date": "10 Jun 2015", "title": "Registrar's Office Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Colorado Technical University (Colorado Springs, CO) in Nov 2011", "Interview Descriptions": "It was a formal interview. I was taken back to the Deans area where Registrar's was located. The office was smaller than I had expected. The interview was done by the Registrar and Registrar's assistant. Both of them were female. The Registrar was polite and always kept a smile on her face. It was hard to judge any reaction to any of my responses.", "Interview Questions": "The questions I remember: How much did I know about CTU. How much did I know about the position I applied for. Did I like working with people or alone. How much did I know about computer applications such as Microsoft outlook, excel, word....ect"}], [{"date": "10 Mar 2015", "title": "Online Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Colorado Technical University (Downers Grove, IL) in Oct 2011", "Interview Descriptions": "First and Second Interview, with questions on prior job experience, what I did in my last job and how would that experience transition into this job if offered and how would I integrate those skills in the position.", "Interview Questions": "How did you hear about us? Tell me a little about your work history? Would this be a position or company you would be interested in working in and for?"}, {"date": "23 Sept 2015", "title": "Information Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Colorado Technical University (Kansas City, MO) in Oct 2011", "Interview Descriptions": "Questions regarding:\r\n\r\nHeld multifaceted responsibility to configure, install and administer network infrastructure and telelcomommmunications systems that supported staff of 200 staff and faculty as well as 900 students.\r\n•\tHelped develop and establish policy and procedure.\r\n•\tDefined acceptable use of I.T. assets with the university. \r\n•\tFulfilled administrative responsibilities including the addition and changes to user desktop, email, and Active Directory accounts.\r\n•\tInstalled and maintained Cisco Routers and Switches.\r\n•\tActively installed and maintained proprietary software and programmatic coursework software.\r\n•\tCompleted full migration of systems to bring current", "Interview Questions": "How do you relate with non-technical educators?"}, {"date": "14 Apr 2014", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Colorado Technical University (Schaumburg, IL) in Sept 2011", "Interview Descriptions": "Two managers or more will conduct the interview.  They want to know if you can close.  Are you ethical?  Are you an ontime worker?", "Interview Questions": "List a time when you were not your best at work by providing details.  A time when you could not turn it around."}, {"date": "13 Apr 2011", "title": "Department Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Colorado Technical University (Colorado Springs, CO) in Mar 2011", "Interview Descriptions": "I was interviewed by the President, who was new to their job, the chief operating officer and the HR manager.  They were very professional.  This is a for profit university.  So the emphasis on the interview was different from other higher education institutions I have worked for.  CTU is part of Rasmussen Education, Inc. and is run like a corporation.  However they offer degrees through the doctoral level, so it is not just a samll technical school.  For profit schools are now under pressure from the feds to minimize student loan default rates.  this can hurt enrollment numbers, and thus hurt funding.  So the interview really focused on strategies for maximizing profitability of the school, more than education of the students.", "Interview Questions": "What is going on in Libya (asked by the Pres., ex-military)?"}, {"date": "22 May 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Colorado Technical University (Colorado Springs, CO) in Jan 2011", "Interview Descriptions": "It was a single meeting with the Chair of the Department. He stated that I had all the qualifications and skills, and offered the job on the spot.  He gave me a couple days to think it over and I excepted early the following week.  Training session were held quarterly, so I had a few months until training started.  Very easy & uneventful for me at the CTU-Colorado Springs site.", "Interview Questions": "Why was I interested in teaching?"}, {"date": "30 Jan 2014", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Colorado Technical University in Jun 2010", "Interview Descriptions": "Initial interview was was assistant directors. Very informal. It was essentially a meet an greet. The second round was a group interview where they posed questions and applicants gave answers in a round table format.", "Interview Questions": "Questions were very standard. Things like what are your strengths/weaknesses. What was your greatest failure and how did overcome or learn from it etc..."}, {"date": "12 Jun 2010", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Colorado Technical University (Warrenville, IL) in May 2010", "Interview Descriptions": "I initially had a brief phone interview with CTU's recruiter, then they scheduled me for a skills test in this testing area located in Schaumburg. Passed the test and was then scheduled for a one on one interview. The interviewer has a questionairre in hand wherein she's reading the questions and taking down notes on my answers. The questions are mostly situational. Over all the interview went well. I was just expecting that they would inform their candidates the result of their applications via email or mail letter than just nothing at all. So I just assumed they got somebody else when I didnt hear anything from them since then.", "Interview Questions": "How would you deal with difficult superiors?"}, {"date": "15 Mar 2013", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Colorado Technical University in Oct 2009", "Interview Descriptions": "The university required 2 interviews along with background and references checks. My interviews were conducted by phone, not face to face, since I was being considered for an online teaching position based remotely.", "Interview Questions": "What is your teaching philosophy? (I should have anticipated this one but I was new to the process at the time.)"}, {"date": "29 Jul 2013", "title": "Admissions Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Colorado Technical University in Sept 2009", "Interview Descriptions": "They use the STAR interview process. Pretty straight forward. Know your strengths and weaknesses and be ready to sell yourself. Interviewers are trained not to show you if they like your or not so don't be mislead by the stoic presence. Dress professionally as you will be judged by how you look. Also, if you are seated with an admissions advisor, stay engaged because they will take their opinion into consideration.", "Interview Questions": "Describe a situation when you did not meet a goal or minimum expecation."}, {"date": "27 Oct 2009", "title": "Academic Support Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Colorado Technical University (Colorado Springs, CO) in Jan 2008", "Interview Descriptions": "THe phone interview was very easy.  I wanted to understand the position more and asked some questions about what are the responsibility and requirements.  Never really was given a straight answer and not sure if the phone interviewer knew anything about the position besides what I knew from the job positing.", "Interview Questions": "What salary rage are you looking for?"}]]