[[{"date": "12 Jul 2023", "title": "Events and Volunteers Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Salvation Army (Toronto, ON)", "Interview Descriptions": "Fair interview and on schedule as expected from the initial conversation. Zoom interview. Panel. Cannot recall precisely how many days it took to hear back but it was not too long.", "Interview Questions": "Why did I want this role?"}, {"date": "9 Jun 2023", "title": "Front Desk Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Salvation Army (Etobicoke, ON)", "Interview Descriptions": "The interview process is a multiple-stage process for hiring new employees. The stages mainly comprise job interviews held either one-on-one, with a group of candidates, or with a panel. Interviews are conducted in person, over the phone or by email, or via video conferencing tools.", "Interview Questions": "how can you use trauma informed to support client"}, {"date": "14 Mar 2023", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Salvation Army", "Interview Descriptions": "Super easy and laid back. Everyone was so kind and welcoming. Asked questions about the company and its benefits. Loved working there because of all the kind people. Highly recommend", "Interview Questions": "What do you know about our company"}, {"date": "10 Mar 2023", "title": "Shelter Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Salvation Army", "Interview Descriptions": "If you have a pulse...you're hired! There are some great workers as well as some useless workers. It's a pretty dangerous place to work and extremely understaffed. A crazy balance of nothing to do, or everything to do.", "Interview Questions": "Can't remember any of them."}, {"date": "19 Jan 2023", "title": "Management Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Salvation Army (Toronto, ON)", "Interview Descriptions": "Pathetic. Agency recruiter called and explained false benefits. Role was posed as hybrid and mentioned in contract but expectation was to be onsite 5 days a week. At Meighan Centre Toronto they require NON UNION ALL STAFF TO DAILY TAKE A COVID TEST , NO MATTER ITS FINANCE , HR , IT ETC. POSITIONS. THIS WAS HIDED UNTIL THE OFFER LETTER WAS SIGNED AND ACCEPTED OFFER. AFTER ACCEPTING OFFER , HYBRID ARRANGEMENT WAS DECLINED TOO. Then out of no where they send the link to get the Criminal Check done that candidate has to pay !", "Interview Questions": "Question about faith and why Salvation Army"}, {"date": "29 Aug 2022", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Salvation Army", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire.", "Interview Questions": "Tell us about yourself and relevant experience"}, {"date": "26 Aug 2022", "title": "Community Program Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at The Salvation Army (Nanaimo, BC) in Aug 2022", "Interview Descriptions": "Extensive, 1 and 1/2 hours ,covered all aspects of the job requirements.  4 person interview dealing with the management of a large social organization and being ultimately responsible for the needs of the whole centre.", "Interview Questions": "How do you deal with the continuum of care ."}, {"date": "25 May 2022", "title": "Social Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Salvation Army", "Interview Descriptions": "The interview was good, the process didn't take long. A good rapport was built with the manager and I was given the opportunity to work with the company.  Staff members are helpful and friendly.", "Interview Questions": "What is one of my strength and weakness"}, {"date": "2 Jun 2023", "title": "Event Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Salvation Army (Toronto, ON) in Mar 2022", "Interview Descriptions": "I had two interviews. the first interview was with three interviewers, and they were really friendly and asked great questions. The second interview was with Manager and department Director. the process was smooth and feel comfortable", "Interview Questions": "why do you want to join our company?"}, {"date": "9 Dec 2021", "title": "Leadership Giving Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Salvation Army", "Interview Descriptions": "Questions and answers via phone\nShow your experience, successes?, \nWhy did you leave your previous position?\nWhat is the highest donation you sourced?\nHow many people did you supervise? Where would you like to be in five years time?", "Interview Questions": "Why are you interested in this role?"}], [{"date": "7 Jan 2023", "title": "Manager Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at The Salvation Army (Toronto, ON) in Dec 2021", "Interview Descriptions": "I had three interviews. The recruiter was great. The three managers in the second interview were not professional. Texting eachother and not engaged and then complained to the recruiter I was rude when I never was. The recruiter moved me up hire to the next level and I found they were not interested in hiring a Muslim or diversity. They say inclusion is a thing but it really isn’t. In addition I felt for the role the questions they were asking and the knowledge of HRIS was limited. They were hiring for a role they weren’t qualified to interview for. I would have engaged others in the organization from technology etc. They asked me my religion and after that it was all off key", "Interview Questions": "Which HRIS systems have you implemented"}, {"date": "8 Oct 2021", "title": "Assistant Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Salvation Army", "Interview Descriptions": "Quick and very positive. I ran late and they were totally gracious about it and made accommodation for this.\nThe interviewers knew I was nervous due to the lateness and made every effort to put me at ease", "Interview Questions": "Why do you want to work here?"}, {"date": "22 Sept 2021", "title": "Sales Associate/Cashier Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Salvation Army", "Interview Descriptions": "The interview was held by a manager but met with another manager partway through—a very comfortable environment—typical interview questions. The interview was 15 minutes. They went over my resume asking about some of my past work.", "Interview Questions": "Tell us about why you want to work here?"}, {"date": "12 Jul 2021", "title": "Store Clerk Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Salvation Army (Bedford, NS) in Jul 2021", "Interview Descriptions": "I haven't had to the interview yet. I'm trying to use glassdoor to prepare for it but I couldn't look at the interview questions without filling out this survey first. There should be a way to get out of filling out the survey.", "Interview Questions": "TELL ME ABOUT YOURSELF "}, {"date": "12 May 2021", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Salvation Army", "Interview Descriptions": "Very clear process. Interviewer went through a series of questions that you were required to answer. This included situations where you exhibited the desired characteristics/qualifications of the job. Other questions included situations where you would be required to act.", "Interview Questions": "Describe a time where you had to work collaboratively/in a team. "}, {"date": "18 Jul 2022", "title": "Residential Care Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at The Salvation Army (Kingston, ON) in Feb 2021", "Interview Descriptions": "Questions surrounding past experience in addictions and mental health, some questions are scenario based and others are behavioural based to assess skills in certain situations (e.g., crisis, conflict, etc.). Overall no surprises.", "Interview Questions": "Name a time when you had a conflict with a co-worker, how did you respond? "}, {"date": "23 Oct 2020", "title": "Major Gifts Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Salvation Army", "Interview Descriptions": "One preliminary phone interview and two video interviews. Very supportive and generous interviewers. They act like they want to help you do as well as you can in the interview.", "Interview Questions": "Can you take us through your work experience?"}, {"date": "27 Feb 2021", "title": "Direct Care Worker (DCW) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Salvation Army (Vancouver, BC) in Sept 2020", "Interview Descriptions": "The interview process was long but valuable in learning about the program , the leadership and if the program would be an appropriate fit for my personality and lifestyle.  The interviewers were committed to finding the right fit and assessing my skillset in the interview itself through interviewing techniqurs", "Interview Questions": "What my experience had been, how I would practice self care, my experience setting boundaries etc."}, {"date": "11 Jul 2020", "title": "Receptionest Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at The Salvation Army (Toronto, ON) in May 2020", "Interview Descriptions": "I was first contacted by email, the email address was spelt incorrectly, but thankfully the person who received it forwarded it to me. Once I responded, we set an in person interview. The interview happened in manager office, I was asked several questions about my experience, and I was asked for my references.", "Interview Questions": "What duties did you conduct in your previous receptionist job?"}, {"date": "15 May 2021", "title": "In-House Counsel Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at The Salvation Army (Toronto, ON) in Sept 2019", "Interview Descriptions": "One senior attorney and two mid-level attorneys questioned me for about one hour. They read prepared questions from a script. It was interesting but I felt I was too senior for the role.", "Interview Questions": "How would you handle a difficult situation"}], [{"date": "9 Sept 2021", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Salvation Army (Winnipeg, MB) in Jul 2019", "Interview Descriptions": "The interviewer let me sit and asked me several questions based on my education and career. The interview was proceeded in a comfortable atmosphere and not that stringent. The interviewer asked me what I learnt at my university and what career I built in my previous work experiences.", "Interview Questions": "What brought you to apply for this job?"}, {"date": "21 Jun 2019", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at The Salvation Army", "Interview Descriptions": "I had employee referral and was hired then met my manager on my first day of work. On my first day, my boss sat me down in her office and did a lot of paper work such as my account and direct deposit. Next I had to take a security course about safety at work. Finally I started being trained at the till for a few hours and my next shift I was great at it.", "Interview Questions": "I was directly hired "}, {"date": "8 Jun 2019", "title": "Co-Op Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Salvation Army", "Interview Descriptions": "Applied through school co-op site and selected for a 30 minute skype interview with the accounting manager. Asked mostly behavioural questions and reason for applying to the role. Results were released through the school directly.", "Interview Questions": "How comfortable are you with excel?"}, {"date": "19 Apr 2019", "title": "Mental Health Case Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The Salvation Army (Yellowknife, NT)", "Interview Descriptions": "I was emailed for an interview time after dropping off my resume and cover letter. Interview was about 45minutes. Easy questions. Met with panel of 2 people. Were very nice to us.", "Interview Questions": "Why mental health? \r\nWhat would you do in case of a situation that someone is being angry? \r\nAre you ok with working in a Christian facility? \r\nI don’t remember the rest. "}, {"date": "3 Apr 2020", "title": "Job Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Salvation Army (Toronto, ON) in Apr 2019", "Interview Descriptions": "Applied online for the position of Job Developer, got an email requesting to do a phone  interview, after phone interview I was invited for in person interview, got a phone call around a week later and was  offered the job", "Interview Questions": "Tell me about Yourself"}, {"date": "28 Sept 2019", "title": "Shelter Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Salvation Army in Feb 2019", "Interview Descriptions": "Phone screening interview, no heads up they just call you out of the blue. If you pass the phone interview they will bring you into the office to interview with the manager and assistant manager which will last about 45 minutes. If you are selected you have to pass a criminal record check and then you can begin training.", "Interview Questions": "Mostly about past experience working with homeless folks. A bit about yourself and how you deal with conflict. "}, {"date": "19 Jan 2019", "title": "Staff Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Salvation Army", "Interview Descriptions": "I initially had Phone Interview with the HR Admin then I had In-Person Interview with Assistant Directors. The hiring process took around 3 weeks so it requires a lot of patience. Sometimes they require two interviews but for me it required one interview.", "Interview Questions": "What do you know about us?"}, {"date": "21 Oct 2019", "title": "Residence Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Salvation Army (Saint Catharines, ON) in Jan 2019", "Interview Descriptions": "Very unorganized, did not properly train employer for all areas of the position, then expect full results from what they needed and required.  Candidate is not aware of options available to be given to client.", "Interview Questions": "What are you looking to accomplish?"}, {"date": "10 Nov 2018", "title": "Sales Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at The Salvation Army (Calgary, AB) in Nov 2018", "Interview Descriptions": "Dropped my resume off and was asked by the assistant manager if I was applying for full time or part time. Was called 2 days later and asked screening questions (why did you apply? What do you know about the Salvation Army? Availability?)  and an interview was set up for the following weekend.", "Interview Questions": "Examples of no name and high end brands, what makes good costumer service, example of when I've had to meet a deadline and how I did, example of when and how I dealt with a difficult costumer, example of when I went above and beyond what was expected of me, strengths and weaknesses, if I'm able to lift up to 40 pounds.\r\n\r\nThere was a three page booklet of questions but majority were skipped during the interview."}, {"date": "7 Jun 2019", "title": "Kettle Attandent Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Salvation Army (Ottawa, ON) in Oct 2018", "Interview Descriptions": "Many employers it's meeting a lot of employee and the interview very easy only ask three questions after that send email for everyone when to start and which location", "Interview Questions": "Do you like to ring the bell"}], [{"date": "21 Aug 2018", "title": "Store Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Salvation Army", "Interview Descriptions": "I was immediately welcomed into the interview room. The manager made sure that no outside interruptions would be made; there was a sign on the door. He informed me that there were supposed to be two parts to the interview (phone and face-to-face), and asked me if I was comfortable doing them both at that time. I agreed, and the entire interview took between 45 minutes to an hour. Overall the manager was very friendly and understanding; he was engaged in my responses and provided follow-up comments.", "Interview Questions": "What do you know about the Salvation Army Thrift Stores?"}, {"date": "14 Oct 2019", "title": "Day Program Counsellor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3+ months. I interviewed at The Salvation Army (Hamilton, ON) in Aug 2018", "Interview Descriptions": "Submitted application by email and interviewed first over the telephone, then pannel interview for about an hour at the main office. It was a behavioral and core competency kind of interview. For explaining your skills you have to relate one example to the skill you are explaining. The process was easy.", "Interview Questions": "Core competency and behavioral question"}, {"date": "28 Feb 2020", "title": "Assistant Store Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Salvation Army (North York, ON) in Jul 2018", "Interview Descriptions": "It was good. First, it was a phone interview and then there was the manager and district manager interview. the interview was for half an hour and then they gave the tour of the store.", "Interview Questions": "Do you know a good amount of brand names?"}, {"date": "30 Aug 2018", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Salvation Army (Toronto, ON) in Jul 2018", "Interview Descriptions": "This was with the Ontario (Canada) Central East Division.\r\n\r\nThe interviewer was so rude and unprofessional that I complained to the head of the organization.  It took two emails to get a reply, which said: \r\n\r\n1) The interviewer doesn’t think their behaviour was bad. \r\n\r\n(So?  That doesn’t mean it wasn’t bad.  And I didn’t ask what they think, I’m telling you what **I** think.)\r\n\r\n2) We usually do interviews with a panel but this time there were too many applicants for that.  \r\n\r\n(That makes no sense.  You should always have a proper interviewing process, and there is no excuse for rudeness in any recruiting process.)\r\n\r\n3) We’re sorry and we’ll try to do better from now on.  \r\n\r\n(Not holding my breath for that one.)\r\n\r\n\r\nUtterly clueless.  But perhaps not surprising given the scandals involving the organization worldwide.  Avoid this organization at all costs.", "Interview Questions": "Why do you want this job when the pay is so low?"}, {"date": "5 Nov 2018", "title": "Store Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Salvation Army (Toronto, ON) in Jun 2018", "Interview Descriptions": "They have about 40 questions. Those are simple questions like \"what do you do if...\" Just remember your past work experience and answer. It took over one hour to finish the interview.", "Interview Questions": "How to deal with repetitive work?"}, {"date": "30 Aug 2019", "title": "Camp Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Salvation Army (Saskatoon, SK) in Apr 2018", "Interview Descriptions": "A got a call about 30 days after I sent my application, they preceded to ask me what about my reasons for wanting to apply what qualifications I have and why I would make a good fit for their organization.", "Interview Questions": "Please provide 3 examples of when you had to deal with a stressful situation and how you responded to said situation. "}, {"date": "30 Oct 2022", "title": "Front Line Worker (Men's Homeless Shelter) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The Salvation Army (Ottawa, ON) in Jan 2018", "Interview Descriptions": "- interview, causal in approach. - asked behavioural questions. - goals for the position. - education. - long hiring process. took many weeks to get into the position. - hr called with an offer & to sign paper work. the job is widely underpaid and the work can be unsafe at times although they do their best to ensure safety.", "Interview Questions": "How do you build rapport with a client?"}, {"date": "20 Jun 2017", "title": "Store Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Salvation Army (Truro, NS) in Jun 2017", "Interview Descriptions": "I was called in for a face to face interview about 3 weeks after applying. Was interviewed by 3 ladies, 2 of which were the supervisors for the that specific thrift store. Started off with the \"what do you know about the company\" and this slowly lead to more specific situational questions to do with how I handled conflict, organization, and various other scenarios in my professional history. While I did not find the interview particularly easy, I wouldn't say any of the questions they asked were particularly hard. It was the typical one person asks a question, and notes down my response, and then it moves onto the next person. They didn't not seem to have extensive experience interviewing people, making the interview a bit more casual than normal.\r\nThey said, they'd get back to me by phone in a few days even if I was not selected.", "Interview Questions": "What do you know about the Salvation Army?"}, {"date": "18 Jul 2017", "title": "Digital Media Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Salvation Army (Toronto, ON) in Jun 2017", "Interview Descriptions": "I was contacted by the assistant in Toronto 3 weeks after submitting my application. The interview itself was short. The marketing coordinator and a lead writer had a list of about 20 questions. They start by letting you know they're a religious organization but don't force you to believe and they discriminate about your beliefs (or non-beliefs).\r\n\r\nQuestions were direct and clear about design. The tricky part comes after the \"interview\", the lead writer offers to walk with you and then she asks personal questions (that of course matter, as it is no longer legally part of the interview): marriage, family future plans, why you are applying,... Watch out for that moment.\r\n\r\nAnd don't wait for an email rejecting your application. After I walked out I never heard back from them", "Interview Questions": "How do you start a project? What's your process and how do you organize your day?"}, {"date": "28 Apr 2021", "title": "Donation Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at The Salvation Army (Toronto, ON) in Mar 2017", "Interview Descriptions": "The interview process was quick and easy as it required basic information about myself and previous work experience that related to customer service. It also required some information about my physical strength, as the job demands physical work to be done outside in terms of collecting people's donations and placing it trucks with skids and pallet boxes.", "Interview Questions": "N/A"}], [{"date": "7 Feb 2018", "title": "Store Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at The Salvation Army (Winnipeg, MB) in Jan 2017", "Interview Descriptions": "it was long and lots of tell me questions, it took almost 2 hours. some of those question did not relate to work environment, at the end its a charity organization if you like not to move up join them you will be doing the same job year after year no advancement , improvement, or training.", "Interview Questions": "Tell Me About a Time When You Went Beyond the Call of Duty to Get the Job Done"}, {"date": "22 Oct 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Salvation Army (Toronto, ON) in Jun 2016", "Interview Descriptions": "I found the employer website and read about the volunteer application process. They also had an online application which had to be filled out and submitted. I made sure to give them a call and introduce myself after I had sent in the online application.", "Interview Questions": "What makes you want to volunteer at the critical care unit"}, {"date": "8 Aug 2020", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The Salvation Army (Toronto, ON) in May 2016", "Interview Descriptions": "Pretty easy and straight forward.  One person interviewing, very relaxed environment interviewer did most of the talking.  Provided references and police check.  Called right away and was able to start immediately overall the process was pretty easy and positive", "Interview Questions": "Strengths/ weaknesses, conflict questions scenario questions "}, {"date": "21 Feb 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Salvation Army (Toronto, ON) in Nov 2015", "Interview Descriptions": "Very unusual interview.  When I first arrived, the man interviewing me told me not to think of it as a job interview, but think of it as a date where we were getting to know each other.", "Interview Questions": "I was asked if I would paint the office blue or neon green."}, {"date": "18 Jul 2015", "title": "Shelter Worker I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at The Salvation Army", "Interview Descriptions": "Panel interview, mostly. They ask a bit about experience and education and make sure you're comfortable working with addictions and homelessness. A few scenario questions are asked, mostly bout emergency response. Quite easy.", "Interview Questions": "How would you deal with co-workers who are openly arguing in front of clients?"}, {"date": "21 Aug 2015", "title": "Store Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Salvation Army in Jul 2015", "Interview Descriptions": "Only one interview a lot of questions.   Typical interview - was at the back where they did sorting.  It was only again one interview then if hired on your first shift you would do the rest of the paperwork. N", "Interview Questions": "Describe yourself"}, {"date": "5 Jul 2015", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Salvation Army (Toronto, ON) in Jun 2015", "Interview Descriptions": "Landed the interview within one week after they posted the ad. No telephone interview, just one round on-site interview.All questions were about your skills and experience, how much did you know the company, and how did you fit into the position, company?", "Interview Questions": "what are you looking for in the job?\r\nwhen did you know us?"}, {"date": "2 Jun 2015", "title": "Store Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at The Salvation Army (Winnipeg, MB) in Apr 2015", "Interview Descriptions": "Went in for interview, asked about my availability, then got hired on the spot. Talked about what happens and what I would be doing. Signed a bunch of employee papers. Did a quiz on how to handle customer situations.", "Interview Questions": "Are you able to stand for long periods of time?"}, {"date": "10 Mar 2015", "title": "Store Clerk Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Salvation Army (Ingersoll, ON) in Oct 2014", "Interview Descriptions": "30 mins in length...relaxed...not overly informative on their part \r\nmore concerned with how long I would stay\r\nasked if I could hit the ground running with very little direction in my duties\r\nasked if I could handle a diverse clientele", "Interview Questions": "was I available for any shift and for causal on call shifts"}, {"date": "4 Jun 2015", "title": "Receptinist/Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at The Salvation Army (Brampton, ON) in Sept 2014", "Interview Descriptions": "I've had an opportunity to be apart of the first step interview of a three step process with  Access Employment . My experience was a pleasant one, along with getting exposure to how online interviews are conducted, and being apart of a new learning opportunity. It was exciting, rewarding, and simply put exceptionally fantastic experience.", "Interview Questions": "There was no difficult or unexpected question. it was basically questions on how you would treat customers and why you will want to be hired. it was a good experience.   \r\n"}], [{"date": "23 May 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Salvation Army (Toronto, ON) in Jul 2014", "Interview Descriptions": "Applied online. Received the interview call after 3 weeks. The interview was taken by the Manager, HR manager, and the HR Director.  Since they need someone immediately I received the offer next day.", "Interview Questions": "What other services does the SA offer to clients other than shelters"}, {"date": "15 Jun 2015", "title": "Store Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at The Salvation Army (Montreal, QC) in Apr 2014", "Interview Descriptions": "Called the store to see if they are still hiring.\r\nI came in person to hand in my cv. However, a short chat with the manager unexpectedly turned into a job interview right on the spot. Whole process took about 3 days. I was offered the job and I accepted.", "Interview Questions": "Why do you want to work for us?"}, {"date": "6 Mar 2017", "title": "Case Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Salvation Army (Oakville, ON) in Jan 2014", "Interview Descriptions": "Applied online\r\nThey asked me about my understanding of their Mission Statement, case scenarios, etc.\r\nThey made me feel at ease and the interview was really laid back!The whole process took about two weeks.", "Interview Questions": "I was asked about my religion."}, {"date": "30 Sept 2014", "title": "Administrative/Accounting Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Salvation Army (Vancouver, BC) in Jan 2014", "Interview Descriptions": "I submitted my resume and coverletter, recieved an email about interview dates, set up an interview and was warmly recieved. Asked a lot of personal questions about my long term plans and what I was hoping for with the Salvation Army.", "Interview Questions": "Where do you see yourself in 10 years? What do you like about yourself?"}]]