[[{"date": "30 Dec 2022", "title": "Mktg Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AIESEC", "Interview Descriptions": "Assessment divided in two parts: functional and general, you must submit a questionnaire, then complete the task and assessment, eventually there is going to be a election day, in which all the committee will vote for your election and upgrade", "Interview Questions": "Why are you applying For this position?"}, {"date": "29 Nov 2022", "title": "IR Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AIESEC", "Interview Descriptions": "It's really easy, you have to send the application, then there's the interview in which you state your program for the following semester. In the end, there's an election inside the committee to choose between the various applicants", "Interview Questions": "What is your monthly routine as an IR Manager?"}, {"date": "29 Sept 2021", "title": "IT Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AIESEC", "Interview Descriptions": "It was a 3 steps interview. Very interesting and with challenging problem solving quiz. \r\nIt was mainly based on knowing my technical and interpersonal skills .\r\nMy job interview was about the It job position, and having an engineering background helped me quite a lot for overtaking the quiz.", "Interview Questions": "What would you do to solve a client issue of which  you  don’t know the process?"}, {"date": "2 Apr 2021", "title": "Global Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at AIESEC (Milan) in Apr 2019", "Interview Descriptions": "Mi è stato chiesto di esporre le mie motivazioni personali e professionali nel candidarmi nell'esperienza, raccontando esperienze di leadership e i valori in linea con il programma. Inoltre mi è stato chiesto cosa potessi aggiungere io come valore aggiunto per il progetto.", "Interview Questions": "Ad esempio: Cosa sono gli SDGs?"}, {"date": "3 Feb 2019", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AIESEC", "Interview Descriptions": "Some questions related to yourself, future goals, who is your mentor, your skills, past experiences everything is informal and very easy. Just be yourself and try to explain why you would like to join AIESEC.", "Interview Questions": "Who is your mentor?"}, {"date": "25 Sept 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at AIESEC (Rome) in Mar 2017", "Interview Descriptions": "The interview was very good managed and it wasn't difficult. It happened on Skype and they told me their answer just 4 days after the interview! And of course I've been selected", "Interview Questions": "Motivational questions basically"}, {"date": "30 Jan 2019", "title": "Ogv Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at AIESEC (Milan) in Mar 2017", "Interview Descriptions": "Case study, email sample writing, English speaking interview, simulation of situations, review of the cv, experiences at university.  Area of preference, level of English, knowledge of a second language, level of knowledge of the company and the core values, the different areas", "Interview Questions": "What are the values of the company? "}, {"date": "12 Oct 2016", "title": "Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at AIESEC (Milan)", "Interview Descriptions": "Very easy - general questions \nThey asked me questions in order to get to know me better. Their aim was to understand my international perspective and my skills to be involved in the organization", "Interview Questions": "Strengths and weaknesses"}, {"date": "17 Dec 2015", "title": "Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AIESEC", "Interview Descriptions": "Informal interview, purely motivational. After completing the interview, it may take a while for them to answer back, as they usually have only 2 recruiting sessions per year. When the session does come, you will be asked to participate in a weekend of induction, and then you can start working as an effective team member.", "Interview Questions": "Main questions include Why AIESEC, why this area, where do you see yourself in five year, what is your greatest achievement."}, {"date": "27 Feb 2016", "title": "EP Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at AIESEC (Bologna) in Oct 2015", "Interview Descriptions": "Aiesec people are friendly so the interview process is very relaxed. They ask you very easy question about your skills and expectation for your future insiede the organization. My interviewer was very kind and she answered me to all the questions I made about them. no stess. I got a feedback immediatly the same night of the interview. I raccomand to apply for some position in aiesec because the atmosphere is very young and friendly.", "Interview Questions": "3 good thing about your personality and 3 downfall"}]]