[[{"date": "1 May 2023", "title": "Neurodiagnostic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Avera McKennan Hospital (Sioux Falls, SD)", "Interview Descriptions": "The interview process was very smooth. I personally had two separate virtual interviews. All interactions with HR and other staff were positive and the process of becoming an employee was seamless.", "Interview Questions": "Why would you be a good fit for Avera and this position?"}, {"date": "7 Oct 2022", "title": "Clinical Dietitian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Avera McKennan Hospital (Sioux Falls, SD) in Aug 2022", "Interview Descriptions": "Received a call quickly and got an interview right away. First interviewed with clinical nutrition manager for one hour then had a phone interview with HR recruiter that same week. The recruiter kept me updated about the status of the position.", "Interview Questions": "How I could contribute to the team?"}, {"date": "2 May 2022", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Avera McKennan Hospital", "Interview Descriptions": "The interview process went very well. I was appreciative of the willingness to answer questions and how nice everyone was. Coming into the interview with no medical job background I wasn't sure that I would be offered a position, but I am glad that they did because it has helped me justify my plan moving forward.", "Interview Questions": "N/A"}, {"date": "22 Mar 2022", "title": "Network Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Avera McKennan Hospital", "Interview Descriptions": "Very formal interview process. Spoke with director and manager of department. Not entirely technical, but asked enough questions to know if you have what it takes. Great questions that they will ask.", "Interview Questions": "Explain how DNS works in an environment?"}, {"date": "10 Nov 2021", "title": "Registered Nurse - Pediatrics Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Avera McKennan Hospital (Sioux Falls, SD) in Oct 2021", "Interview Descriptions": "First, there was a screening call interview, next was a zoom interview with 2 hiring managers that are RNs. They went through a few questions and then asked if I had any questions.", "Interview Questions": "Describe a time you had a difficult experience with a customer. \nWhen did you take the fall for someone else in group work?"}, {"date": "20 Oct 2021", "title": "Registered Respiratory Therapist (RRT) Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Avera McKennan Hospital in Aug 2021", "Interview Descriptions": "They were very inflexible and would not negotiate pay. They cancelled my interview time due to a scheduling conflict that occurred after I had already scheduled and taken time off work. They wanted an in person interview when it could have been done virtually.", "Interview Questions": "Tell me about a time you overcame a difficult situation."}, {"date": "26 Mar 2021", "title": "BHT-behavioral Health Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Avera McKennan Hospital", "Interview Descriptions": "Very good questioning , very thorough, well put together, the process was about thirty minutes long, interviewed with hr bht and a senior manager, the wait time after the interview to hear back was about ten hours.", "Interview Questions": "How do you do working with a team "}, {"date": "27 Feb 2021", "title": "Certified Pharmacy Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Avera McKennan Hospital", "Interview Descriptions": "Standard questions, quick easy process, all virtual, they covered all HR over the phone aswell. It made the process very easy to work with. It was a panel interview. There was three individuals total. Three different pharmacists.  In total the interview took about thirty minutes.", "Interview Questions": "One thing they asked was if the schedule would work. The schedule was very inconsistent, couldnt make it work."}, {"date": "17 Sept 2019", "title": "Postdoctoral Associate/Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Avera McKennan Hospital (Sioux Falls, SD) in Aug 2019", "Interview Descriptions": "After submitting an online CV, I was contacted by HR via a phone call. They wanted to set up both a 30 minute HR screening call and a 30 minute in person interview with the lab. The HR screening call was a normal job interview conversation. They asked a lot of behavioral questions and why I was interested in the job. Unfortunately, the HR person was unable to answer some key questions I had about the actual job, such as who is the head of the lab (the job posting was a very generic one and their website lacks real info on their research labs). Thus, I was going into the actual interview without knowing who I was to talk to and exactly what they research (beyond it being a cancer research lab). The lab manager was early to meet me (10 min.) - making it awkward because I'd planned in time to use the restroom first and had to ask if that was okay. The PI of the lab seemed like he had no idea that he'd be doing an interview, couldn't coherently explain the work he does, hadn't looked over my CV, and refused to let me give detailed answers to his complex questions (he would cut me off after I stated step 1 of 3). Plus, his accent made it really difficult to understand what he was saying. He also seemed ignorant of how most postdoctoral positions work and described basics as though I should have been shocked and discouraged by them. The in person interview was the worst I've ever experienced.", "Interview Questions": "What sort of research have you done in the past?"}, {"date": "6 Dec 2021", "title": "Housekeeper Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Avera McKennan Hospital in Jan 2017", "Interview Descriptions": "great interview process, great benefits, great people to work with, great great salary, wonderful pay, hard working employees, hiring process was a breeze, easy, quick, all over video, so no in person interview process was performed", "Interview Questions": "Weakness, strengths, how do i work with others"}], [{"date": "13 May 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Avera McKennan Hospital (Sioux Falls, SD)", "Interview Descriptions": "Was hired via phone as they needed new nurses now due to hospital was understaffed. Was told that the hospital had a critical shortage of nurses. Got a phone call the next day after I submitted my resume'. After about a 15 minute phone call was told to talk to manager on one east that day. Was told I had the job after about 5 minutes of speaking with manager. Was not very happy about the religious and other personal questions but did not want to ruin my chance to get a job as I was fresh out of Nursing School.", "Interview Questions": "What church I belong to and also my beliefs."}, {"date": "24 Feb 2020", "title": "Network Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Avera McKennan Hospital (Sioux Falls, SD) in Mar 2016", "Interview Descriptions": "It was a great process, easy to work with. Very prompt in getting back to you. Everyone one there made it easy and worked with what schedule you had to get an interview ready to go for you.", "Interview Questions": "Give me an example where you had to work with a team to accomplish a task in a limited amount of time?"}, {"date": "25 Jan 2015", "title": "Department Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Avera McKennan Hospital (Sioux Falls, SD) in Jan 2015", "Interview Descriptions": "I interviewed as an internal candidate for the head of our department.  I was 1 of 4 total also all internal.  one interview, first half 1 on 1 with HR rep and the other half with 2 other department heads and senior manager.", "Interview Questions": "positive attributes"}, {"date": "19 May 2018", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Avera McKennan Hospital (Marshall, MN) in Jan 2015", "Interview Descriptions": "ok not bad at all. it was simply not to bad. If you know people there the interview is not too hard. Just questions about work. And then you go through getting your shots and drug screen I think and training.", "Interview Questions": "N/A"}, {"date": "18 Nov 2014", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Avera McKennan Hospital", "Interview Descriptions": "The pay is the lowest in the nation! The work load is enormous.  There is never enough employees in the same position to help.  Good luck finding a manager, either in a meeting, called in for what ever reason, or not available ever. The pay is ridiculous,  how are you even suppose to be able to afford the health insurance (Avera Health Plan) with such low wages! You pay more for health insurance than you would NOT being an employee. Some of the staff are great, but you really have to watch your back. \r\nI accepted the position and I am currently looking for a different place to work. Someplace to pay the bills and accepts a hard worker.", "Interview Questions": "Describe a time that was very difficult like a angry customer,  and how did you handle it."}, {"date": "8 May 2014", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Avera McKennan Hospital (Pierre, SD) in Mar 2014", "Interview Descriptions": "Interview process is so slow it deters many - we can't wait a month to find out if we have a job\r\nInterview questions come right off internet checklist\r\nYou will get a call to set up appointment following the closing date, after interview, be prepared to wait 2-4 weeks for letter", "Interview Questions": "None - if you can read off internet checklist, you will be prepared"}, {"date": "12 Jul 2015", "title": "Expressive Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Avera McKennan Hospital (Sioux Falls, SD) in Feb 2012", "Interview Descriptions": "I was told that I would be conducting multiple amount of recreational and leisure groups that varied from sitting, walking, running, and gym activities. The pay discussed was ok but it can always be better. The people were pretty respectful during the interview process and I would not mind doing it all over again with the exception of a different job overall.", "Interview Questions": "How did you find us ? "}]]