[[{"date": "4 Mar 2023", "title": "Medical Billing Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Conway Regional Health System", "Interview Descriptions": "It was very disorganized. I couldn't even get in the door at first. It was locked. It took a couple of texts before anyone responded to let me in. The interview itself went well; so well, in fact, that my application was never reviewed. After five weeks on the job, being praised for my performance, I was let go because of something that was disclosed on my application but not noticed at the time.", "Interview Questions": "They asked the standard interview questions. There was nothing that stood out."}, {"date": "24 Oct 2022", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Conway Regional Health System", "Interview Descriptions": "It is easy to get hired. Very easy to get fired. Take it how you want. Pay is decent for that size hospital. The atmosphere is different to say the least. You have to be there because you are passionate about what you contribute to life.", "Interview Questions": "What is your name mam?"}, {"date": "12 Jan 2022", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Conway Regional Health System", "Interview Descriptions": "Interview process was pleasant. Going into the interview I was nervous but once the interview began I felt welcomed and was able to relax some. I left feeling confident and pleased with the process.", "Interview Questions": "Where did you attend school?"}, {"date": "2 Oct 2021", "title": "Billing Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Conway Regional Health System", "Interview Descriptions": "Job Monday through Friday 8-4 . With my background in billing they really didn’t ask me too many questions . Just a typing test , and asked if I was familiar with icd10", "Interview Questions": "Needed to understand the different types of health insurance  . "}, {"date": "15 Jan 2021", "title": "GI Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Conway Regional Health System", "Interview Descriptions": "It was amazing. It didn’t take long to get acquainted and for the interview to start. They staff was friendly and helpful. Answers any questions you ask. They make you feel welcomed.", "Interview Questions": "A lot of questions were asked"}, {"date": "29 Aug 2020", "title": "Housekeeper Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Conway Regional Health System (Conway, AR) in Aug 2020", "Interview Descriptions": "Used to be one on one but now they have gotten lazy and do group interviews for a minimum wage position. Saying how important the job is but not once mentioning pay and benefits had to find out on my own. Something seems off about this place. Why else would they want someone to job shadow and waste more of their time. Total of 3 hours. They don't know what they are doing and said very questionable things to us of course when the director was not in there.", "Interview Questions": "where do you see yourself in 5 years?\n\nstrength and weakness?\n\nAll the usual stuff that doesn't tell an employer anything about the person. Just fills out paperwork. "}, {"date": "21 Feb 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Conway Regional Health System", "Interview Descriptions": "Very easy, was not asked any questions when I was hired 2 years ago. It might be different now. They told me about the hospital and the floor I would be working on.", "Interview Questions": "Do you have any questions about the hospital?"}, {"date": "19 Nov 2017", "title": "Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Conway Regional Health System (Conway, AR) in Nov 2017", "Interview Descriptions": "Very easy if you have some experience in a laboratory. Lasted about 30 minutes roughly. Got a decision within a week & a half. If you want to get into Conway Regional, befriend someone. Have them as a reference. Knowing people goes a long way. I met about 4 references in passing at my job. They all referred me, gave great feedback to my interviewer after and even BEFORE I was hired . I was called for an interview based on who I met and how well I interacted with them. Be kind !", "Interview Questions": "Tell him a time where you failed ? How did you improve or fix mistake? "}, {"date": "8 Apr 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Conway Regional Health System (Conway, AR) in Nov 2015", "Interview Descriptions": "Hiring process went quickly, interview took 45minutes and I got an offer three hours later. It did take a long time to get started working as they have a month long orientation process that includes a nursing test, orientation on the unit, and since my unit had a lot on their plate at the time of hire for me it was hard to get in contact with someone to be able to start.", "Interview Questions": "When are you available to start? "}, {"date": "18 Sept 2017", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Conway Regional Health System (Conway, AR) in Oct 2014", "Interview Descriptions": "The hiring manager asked very thorough, specific to the job questions, which I appreciated. She also recognized that I was nervous and had a lot of grace and patience with me.", "Interview Questions": "Why have you chosen this position at this facility?"}]]