[[{"date": "6 Jan 2022", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chestnut Health Systems", "Interview Descriptions": "Interview was positive and fair. I felt questions were fitting for position. Interview allowed me to get a sense of what position entailed as well as overall view of corporation.", "Interview Questions": "How do you deal with anger?"}, {"date": "31 Mar 2021", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chestnut Health Systems", "Interview Descriptions": "They called me for a phone screening and scheduled a in-person interview in a week. I had an interview with a hiring authority and another coworker in this field.  The whole process took about 2-3 weeks.", "Interview Questions": "Tell me about your strength and weakness.\n\nWhat specific skills you have in this field?"}, {"date": "26 Sept 2019", "title": "Employment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Chestnut Health Systems (Belleville, IL) in Sept 2019", "Interview Descriptions": "The first interview took less than twenty minutes and she asked about 7-10 questions about situational circumstances and how I would handle them as well as my educational and work background. They ended up calling me while I was driving home from the interview so I guess it went well.", "Interview Questions": "How would I go about handling someone with schizophrenia?"}, {"date": "19 Aug 2020", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Chestnut Health Systems (Bloomington, IL) in Jul 2019", "Interview Descriptions": "Quick and to the point, she asked questions that would be related to the job. About communication and personal relationships and boundaries as well. Emphasis on keeping relationships with clients professional and not personal", "Interview Questions": "Do you gossip with past coworkers? "}, {"date": "26 Jul 2018", "title": "Recovery Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chestnut Health Systems", "Interview Descriptions": "I was interviewed by panel, specifically by 3 people. Overall process not too bad. Was asked a lot of situational questions and how I would respond to those situations. The interview lasted about 20 minutes.", "Interview Questions": "what would you do if a client cussed you out"}, {"date": "29 Dec 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Chestnut Health Systems (Philadelphia, PA)", "Interview Descriptions": "Initially, warm and casual. Greeted by manager who appeared friendly and very down to earth.  The best experience out of the hiring process was the Nurse Recruiter.  She was definitely a people person.  After she did her part of hiring and paper work. It was down hill from there..", "Interview Questions": "Why should I hire you?\r\nTell me about one of your weaknesses\r\nHow do you handle staff not doing their work?"}, {"date": "22 Sept 2016", "title": "Crisis Unit Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Chestnut Health Systems (Granite City, IL)", "Interview Descriptions": "Not too intense but you must know about chronic mental illness and substance abuse because this is the primary client that you will be working with. There may be many times when you have to de- escalate crisis situation.", "Interview Questions": "About my knowledge of mental illness"}, {"date": "24 Feb 2017", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at Chestnut Health Systems (Granite City, IL) in Aug 2015", "Interview Descriptions": "Met with Human Resources, hiring supervisor, and director of the department to review employment opportunity, skills, training required, education requirements, and scope of job duties. Compensation was discussed last. Chestnut offers decent benefits - nothing special or over the top. Family insurance is very high cost considering the pay.", "Interview Questions": "Tell about a time you had to handle a difficult work situation. How did you handle it?"}, {"date": "17 Jan 2012", "title": "QA Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Chestnut Health Systems (Normal, IL) in Mar 2010", "Interview Descriptions": "Consisted of two interviews, 1 written portion, phone acceptance and orientation.\r\n\r\n1st interview- Met with 3 team managers (including team leader). Discussed educational background, discussed me as a person, discussed my goals, discussed the position.\r\n\r\n2nd interview- Met with 7 people total (5 at once and then 2 after the first group which consisted of the team leader, team managers, team leaders boss and training specialists). For this interview it got more in depth with first round of questions, plus asked me some work- related situation-type questions of on the job tasks/encounters/issues.  There was also a more in depth summary of the job and the requirements and what a day to day would look like. I took notes during this part and it ended up helping for the next part of the interview.\r\n\r\nAfter the second interview took place there was a short of quiz over the position of the job that required one to write out a summary of the key details of that job position and things that were went over in the interview (e.g., since this is a training position then it was things pertaining to what was learned in the interview and what was expected to be trained while on that job). I had a few days to submit this.\r\n\r\nAfter I submitted the last part I think it took them 2-3 weeks to get back to me and I was offered the job over the phone. After which an orientation was scheduled 1-2 days after that and I started within a few days of that.", "Interview Questions": "What would you do if a trainee was slow to understanding something or was behind in certification?"}, {"date": "17 Oct 2012", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Chestnut Health Systems (Bloomington, IL) in Aug 2008", "Interview Descriptions": "lots of questions about scenerios that might happen and to tell you that this is not a job where you can come in and feel like you can change the lives of these kids", "Interview Questions": "how would you handle a disgruntle parent "}]]