[[{"date": "10 Apr 2023", "title": "Financial Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Boise State University (Boise, ID)", "Interview Descriptions": "They mostly asked behavioral questions, and the interview itself was about an hour long. The interviewer was very friendly and kind. They were willing to work around my schedule when determining interview times", "Interview Questions": "Share a time you demonstrated leadership."}, {"date": "5 Apr 2023", "title": "Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Boise State University (Boise, ID) in Mar 2023", "Interview Descriptions": "Positive experience- first round was via zoom and only about 30', with the entire team (approx 5 people) for this role. Second round was about 2 weeks later and in person with the same team for 1 hour. Took about 1 month to get notified of the initial interview and then about 6 weeks total from application to \"non-offer\".", "Interview Questions": "Some role specific questions that I had to relate my background to, as I was not directly experienced with the role. A lot of behavioral/STAR type questions."}, {"date": "10 Nov 2022", "title": "Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Boise State University", "Interview Descriptions": "Simple 2 round panel interview process via zoom. Behavioral and technical based questions, if selected references are checked prior to job offer. 7-10 questions and 1-1 1/2 hr interview for both rounds with a varying amount of people.", "Interview Questions": "Tell us about your yourself -"}, {"date": "9 Nov 2022", "title": "Graduate Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Boise State University", "Interview Descriptions": "Very nice interviewers that made me feel welcome and wanted. Asked many questions after another but allowed a lot of time at the end for me to ask questions that I had about them and the program.", "Interview Questions": "What interests you about this program compared to others"}, {"date": "1 Sept 2022", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Boise State University", "Interview Descriptions": "Straightforward with one round, asking primarily about the field you want to become a learning assistant for. Make sure to be passionate about said field. Consisted of two interviewers in a panel and asked general behavioral questions.", "Interview Questions": "How would you help a student who is struggling on a particular concept?"}, {"date": "15 Mar 2022", "title": "Researcher and Grant Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boise State University", "Interview Descriptions": "Simple. Over the phone with one manager. Very comfortable, relaxed, informative and super positive. I had a chance to ask several questions about the role, the team, and the work being done.", "Interview Questions": "1. Describe a time when you had to work independently?\r\n2. Describe a time when you had to work with remote teams?\r\n3. What would you say are some of the unique skills you have to offer in this position?"}, {"date": "4 Apr 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boise State University (Boise, ID) in Mar 2022", "Interview Descriptions": "Straightforward and to the point. Quick reach out and follow-up. Not too bad at all compared to other similar interviews. I actually found it to be very enjoyable experience, would do it again in a heartbeat.", "Interview Questions": "What is your least favorite research task"}, {"date": "18 Feb 2023", "title": "Acoounts Payable Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Boise State University (Boise, WA) in Jan 2022", "Interview Descriptions": "Very easy, basic accounting questions. Asked a lot of personal questions. What was my background? What did I study? Did I have any previous experience with accounting? Leadership experience? If I was involved in my community.", "Interview Questions": "What’s in the balance sheet?"}, {"date": "7 Dec 2021", "title": "Assistant Language Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Boise State University", "Interview Descriptions": "straightforward and simple. Asked direct questions and only took one interview. The interviewer was very friendly and seemed genuinely interested in what I had to say. It wasn't necessary to prepare much for it. I just gave my honest answers.", "Interview Questions": "What did I wanted out of the job."}, {"date": "6 Dec 2021", "title": "Peer Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Boise State University", "Interview Descriptions": "Pretty laid back interview in the office of the supervisor . We discussed job goals, intentions and relevant skills. Supervisor was easy to talk to and covered job roles and responsibilities.", "Interview Questions": "Why did you choose to apply for the position?"}], [{"date": "5 Oct 2021", "title": "Legal Counsel Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Boise State University", "Interview Descriptions": "Easy and friendly crew, lots of great questions. It was one of the best interviews I’ve had and I felt very prepared and at home immediately. It was a great experience.", "Interview Questions": "Why do you want to work at BSU?"}, {"date": "9 Feb 2022", "title": "QA Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Boise State University (Boise, ID) in Aug 2021", "Interview Descriptions": "I had an initial 30 minute phone conversation then a zoom interview about 2 weeks later that lasted 45 minutes then an hour interview about 2 weeks later.  They repeated the same questions in all three interviews and were more focused on soft skills then actual content of the job. The process took about a month and a half then I got an email saying they were passing on me. Awful process for very low pay.", "Interview Questions": "Q: How do you handle reading people (\r\nWeird question for the role I was applying)."}, {"date": "1 Aug 2021", "title": "Laboratory Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Boise State University (Boise, ID) in Jul 2021", "Interview Descriptions": "About a week after the position closed I was contacted for a phone interview which lasted about 30minutes. I was asked pretty general questions about my teaching experience and why I am interested in the job. It went very well. About a week later I was sent an email inviting me for an on campus interview which would consist of an exam covering laboratory skills and knowledge,  to give a white board presentation on one of 4 topics (20mins), and a behavioral response screening. \r\n\r\nThe next week I had the interview and it was very professional (3 interviewees) and on schedule. The test was pretty standard, and the presentation went really well for me as I had prepared approproately. The 4 behavioral questions required you to use a personal experience as response. After that I had time to ask questions. Overall it was just under 2 hours. I was contacted the next week with an offer by phone", "Interview Questions": "Tell us about a time you had an angry student"}, {"date": "9 Sept 2021", "title": "Lecturer In Computer Engineering Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boise State University (Boise, ID) in Jun 2021", "Interview Descriptions": "A panel of 4 faculty members, two was asking questions and two was watching.\nNow it is 4 month and I didn't hear any thing form the university.  I felt the job was already given to someone, and the interview was just to fill out paperwork.  It was a waste of time.", "Interview Questions": "How can you run the course \nWhy are intersted in this Job?"}, {"date": "25 Jan 2021", "title": "Student Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Boise State University", "Interview Descriptions": "Easy overall. If you show that you are willing to do the work then you will have no problem. Be ready to provide any kind of example of working hard and you will be golden. Definitely show up with a good attitude too it will make a huge difference. It’s not the coolest job in the world but they pay well and if you show up to the interview and demonstrate your willingness to work this kind of job you will likely get an offer.", "Interview Questions": "Can you work with an off set pay schedule?"}, {"date": "14 Jan 2021", "title": "Financial Aid Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Boise State University (Boise, ID) in Sept 2020", "Interview Descriptions": "I was emailed about being offered an interview over Zoom. I was given eight-time slots between 2 days. The zoom call interview was completed with two directors in the department. It took about 20-30 minutes.", "Interview Questions": "What I was looking forward to in the position?"}, {"date": "26 Jun 2020", "title": "Marketing Manager - Extended Studies Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Boise State University (Boise, ID) in May 2020", "Interview Descriptions": "I applied online via Boise State's job portal the day before the closing date.\r\n\r\nI heard from the hiring manager about a week after that offering me a Zoom meeting interview a week after that.\r\n\r\nThe interview panel consisted of the hiring manager and other colleagues in the department as well as someone I would be managing (I always find that a little awkward).\r\nAt the conclusion of the interview I was sent a \"strategic prompt\" which was to create a 2-page executive summary based on reading a 24-page report on Some College, No Degree people.  The strategic prompt was due 24 hours after receiving it.  Because I already have a day job, I felt the assignment timeline was unrealistic.  But, I did it - and I rocked it.  \r\n\r\nI submitted my executive summary, along with a thank-you/follow-up/why I'd be great for the job note, and received an email from the hiring manager that it was received, and never heard from her again.  \r\nI find it to be pretty insulting and rude to ask someone to do a big assignment in a short amount of time in the interview process, and not even have the courtesy to let them know if they are in or out.  \r\nShe did say something about how slow things move \"you know how the State is\" so, 4 weeks later, I emailed to ask if I was still under consideration for the position and only then did I hear from her telling me no.\r\n\r\nJust a crappy way of handling things, in my opinion.  Ask a lot, and show not respect or courtesy.", "Interview Questions": "Why are you leaving your current job and why do you want this job?\r\nWhat is your experience with 3rd party vendors?"}, {"date": "26 Jun 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boise State University (Boise, ID) in Aug 2019", "Interview Descriptions": "1st round was a phone screening with the hiring manager. 2nd round was a panel interview with 3 staff, including the hiring manager. Then they called my references and extended an offer. Moved a little slowly, but overall were communicative throughout.", "Interview Questions": "Traditional questions - tell us about yourself, why did you apply to this department of the university, share your strengths and weakness as related to the position. A lot of behavioral / situational asking about customer service (working with students, faculty, etc.), teamwork, and conflict resolution. Also asked about prior experience with records and financial management software, etc."}, {"date": "2 Apr 2019", "title": "Outreach Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Boise State University in Apr 2019", "Interview Descriptions": "Applied online then shortly after the job posting closed I received a call to schedule a panel phone interview. Our connection during the call must have been bad due to my area or the system used. I say this because it was very difficult to hear any of the questions from the individuals speaking. \r\n\r\nThe questions asked were very straightforward and appropriate, the department head on the phone spoke very clearly and respectfully. However, it did feel as if I was being rushed off the line due to my difficulty hearing the questions. My 15-minute interview only ended up being roughly 10 minutes. \r\n\r\nMy advice to future individuals interviewing is to make sure you have a good headset or landline for these phone panel interviews. It can be very difficult to hear at times due to the speakerphone used on the other side. Also, I suggest writing out some prepared responses to common questions asked to ensure that you are not caught off guard and can decipher the question that was asked.\r\n\r\nMy advice to the hiring team in the future is to introduce the panel members then let the individual closest to the speaker ask all the questions. This will make it easier for applicants who are hard of hearing to understand the questions asked.", "Interview Questions": "In regards to this position, what does responsibility mean to you?"}, {"date": "5 Mar 2020", "title": "Phone Agent Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Boise State University (Boise, ID) in Jan 2018", "Interview Descriptions": "one on one, now it might be 3 people. why do you love technology? What is your background in information technology. can you use excel. Want you to have a passion for working in IT and helping others", "Interview Questions": "why do you like technology"}], [{"date": "6 May 2019", "title": "Help Desk Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boise State University (Boise, ID) in Aug 2017", "Interview Descriptions": "Single meeting in a very relaxed atmosphere. All related to  technical skills as well as experience with customer service. The entire interview lasted less than 30 minutes and was conducted by two supervisors in OIT", "Interview Questions": "If I'm a customer and I come in with my computer complaining that I can't 'login', how would you respond?"}, {"date": "7 Feb 2018", "title": "Technical Records Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Boise State University (Boise, ID) in Jul 2017", "Interview Descriptions": "I applied for the position online. After a couple of weeks I was called for the interview and we agreed on a date and time. They gave me a code for free parking in the garage. I sat in a conference room opposite three interviewers who took turns asking me scripted questions (a couple of non-scripted as well). They gave me a handout with the job description, told me the base pay, and listed some of the benefits of the position. After the Q&A I was introduced to the rest of the staff and given a short tour of the office. Before leaving they asked me to write my pay requirement on a piece of paper. I was offered the job at the end of the week and started two weeks later.", "Interview Questions": "What are your goals for the workplace and for your personal life?"}, {"date": "14 Jul 2017", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boise State University in Jun 2017", "Interview Descriptions": "The process was very quick, for a government agency. I submitted my application online which included completing the electronic form as well as uploading a word/PDF resume and cover letter. The position was open for 2 weeks. About 3 days after the interview closed I received a call to schedule a phone interview. The phone interview occurred approximately a week after the closing date. The phone interview was a conference call with 3 people. They asked the typical behavioral/situational questions. About half a week later I received a call to do an in-person interview. The in-person interview was schedule for an hour and 15 minutes and was broken into 2 components: a practical assessment (45 minutes) and interview with all available office staff (45 minutes).", "Interview Questions": "Why were you not successful in the past?\nTell me about a time you had a difficult coworker.\nHow you you measure success?\nWhat motivates you?"}, {"date": "19 Feb 2017", "title": "Work Study - College of Business and Economics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boise State University (Boise, ID)", "Interview Descriptions": "Called me for an interview a week after applying. The interview was business casual with the head of graduate programs and the admin for the office.  The entire interview lasted about 30-45 minutes.", "Interview Questions": "How do you like your eggs?"}, {"date": "26 Mar 2021", "title": "Online Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boise State University (Boise, ID) in Jan 2017", "Interview Descriptions": "There were several interviews, which increased in size throughout the process. Specific situational questions which covered points that related to the job. The people were friendly and welcoming, and it wasn't incredibly intimidating by any means.", "Interview Questions": "Give an example of a time where you were caught between managing two different expectations, and how you handled it"}, {"date": "20 Oct 2020", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Boise State University (Boise, ID) in Nov 2016", "Interview Descriptions": "Received a phone call and an email expressing interest in me as a candidate, then was interviewed by first the Department head, then a panel.  The panel was very friendly and made sure I was comfortable.  They asked me questions that were relevant to the position and how the position would help me to reach my personal goals.", "Interview Questions": "What do you think you would find most difficult about this position?\nWhat do you think you would find most rewarding about this position?"}, {"date": "6 Mar 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boise State University (Boise, ID) in Oct 2016", "Interview Descriptions": "panel ( depending on department) answering questions then on board process begins. Most questions were about work ethic and  what computer programs your savvy at. Some of the hiring is for grant so there will be some self teaching.", "Interview Questions": "where do I see myself in 5 years"}, {"date": "1 Apr 2018", "title": "Union Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boise State University (Boise, ID) in Oct 2016", "Interview Descriptions": "I was interviewed by 5 individuals. Two who are my bosses, and three who I would daily be working alongside. I was asked a lot about conflict management and how I handle high stress situations.", "Interview Questions": "What I would do to improve the building."}, {"date": "16 Jul 2019", "title": "Student Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Boise State University (Boise, ID) in Sept 2016", "Interview Descriptions": "One interview with manager. Asked me normal interview questions and at the end participated in a mock phone call, they gave me a script and I had 10 minutes to look over it until I had to call and pretend like I was asking for a donation.", "Interview Questions": "Why would you be good for this job? \r\n"}, {"date": "19 Jul 2017", "title": "Student Media Sales Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Boise State University (Boise, ID) in May 2016", "Interview Descriptions": "Usually one or two people at Student Media will interview one candidate. Once they narrow down the candidates they will go through a second round of interviews. The first and second interview are pretty similar but second one is just more specific to the role.", "Interview Questions": "How do you feel Student Media plays an important role at Boise State?"}], [{"date": "8 May 2019", "title": "Grad Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Boise State University (Boise, ID) in Feb 2016", "Interview Descriptions": "Done via Skype with the program head. The questions were in general very broad and seemed to be more focused on seeing whether I was a personal fit than diving deep into my experience/skills. Overall, the interviewer was very pleasant.", "Interview Questions": "Why are you interested in this position?"}, {"date": "1 Oct 2015", "title": "Student Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boise State University (Boise, ID) in Sept 2015", "Interview Descriptions": "They called me 2 weeks after I applied. In the interview they mostly discussed the job descriptions and everything I need to do on the job. The interviewer was really nice.", "Interview Questions": "If I am able to work in this kind of environment"}, {"date": "21 Jul 2015", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Boise State University", "Interview Descriptions": "The hiring process was four months long. Waited a month between the writing test and in-person interview. The in-person conversation went extremely well, followed up with thank you emails that were answered saying I would be notified when they made a decision. \r\n\r\nA month later, I received a press release with the new person's name at the bottom. Still waiting for my rejection email after three emails asking if the position was filled went unanswered. Extremely unprofessional and disrespectful.", "Interview Questions": "What are some ideas you have for reaching out to people via social media?"}, {"date": "10 Oct 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Boise State University in May 2015", "Interview Descriptions": "in order to be given this position, a reputation in the department of my study was needed. I voiced my interest in the position by replying to an internal email.  Questions after that were mostly related to my schedule and availability. This process was done once face to face, but mostly over email correspondence.", "Interview Questions": "What is your availability? How many hours would you be able to work?"}, {"date": "22 Sept 2015", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boise State University (Boise, ID) in Apr 2015", "Interview Descriptions": "applied online, was emailed asking for a time to set up and interview.  Had a long phone interview (about 1 hour) where we discussed my career goals, experience, and skills, and then was asked later to do an in person interview where I was offered the position", "Interview Questions": "describe your experience"}, {"date": "5 Jul 2015", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Boise State University (Boise, ID) in Feb 2015", "Interview Descriptions": "I was interviewed by a German professor with a thick accent. The language barrier made me nervous but it was ok. I met everyone on the research team. It seemed like one of the professors really didn't like me, but I guess that is just the way he always is. Aparrently I did really well and I got the job.", "Interview Questions": "What was the coolest thing in the Lab?"}, {"date": "19 Sept 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Boise State University (Boise, ID) in Feb 2015", "Interview Descriptions": "The interview process began with an email asking me to come in for an interview.\r\n The interview consisted of a three panel of PhD's from the department.  One of them was asking the majority of the questions.  The other two chimed in a few times.  I was asked specifically if I was adaptable and flexible for the position demands would change frequently.  The interview lasted about 30 minutes.", "Interview Questions": "Why would you be a good fit for this position or company?"}, {"date": "1 Aug 2016", "title": "Professional Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Boise State University (Boise, ID) in Jan 2015", "Interview Descriptions": "The job was posted on Boise State University's career page.  You apply online by sending a cover letter and resume.  The next step, after several months, was a phone interview from the director and former manager.  The final interview consisted of a panel of five asking questions for about an hour.  After the interview, I was directed to a computer where I read and answered a two scenarios the former manager had actually experienced.", "Interview Questions": "Give an example of a time that you had to deal with a stressful situation in the workplace and how you dealt with it."}, {"date": "9 Dec 2014", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Boise State University", "Interview Descriptions": "I was referred to the position through a contact I had made with a former class TA (now a Professor).  I set up a meet time with the faculty adviser at his office.  The interview consisted of basic questions about my previous course work, knowledge of the research field, and interest in the project.", "Interview Questions": "N/A"}, {"date": "26 Sept 2016", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Boise State University (Boise, ID) in Oct 2014", "Interview Descriptions": "There was a three person committee who interviewed me. They asked maybe a dozen questions, and then showed me around the library, introducing me to people in the department. I felt really good after I left, but then did not hear anything for almost 2 weeks. The slow callback is due to policies of the State of Idaho and the University itself.", "Interview Questions": "Why do you want to work at this library?"}], [{"date": "31 Mar 2015", "title": "Boise State Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Boise State University (Boise, ID) in Sept 2014", "Interview Descriptions": "There is not much to say about the process. I found the job posting through Bronco jobs and I applied for it. I really do not have anything else to say about the process but I have to get thirty words in here unfortunately.", "Interview Questions": "what does being a tutor mean to you?"}, {"date": "16 May 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Boise State University (Boise, ID) in Sept 2014", "Interview Descriptions": "I applied online through Bronco Jobs. It was about a week before I heard back to schedule an interview. Received an offer over the phone and accepted. Nothing too difficult - just showed my qualifications and discussed how I would help others learn.", "Interview Questions": "Why do you want to be a tutor?"}, {"date": "23 Jul 2015", "title": "Management Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Boise State University (Boise, ID) in Aug 2014", "Interview Descriptions": "Typical classified interview process. They are required to interview 3 people...most of the time they know who they want, but they have to abide by the rules. Depending of position- classified (hourly) or professional- exempt/salaried- the process will be slightly different. Classified will usually have a quick phone screen and then an in-person interview with 1-3 people. Professional will usually have a phone interview and then an in-person interview with 3-5 people. Depending on position it could last anywhere from an hour and a half to a couple of days.", "Interview Questions": "Basic strength/weaknesses. Examples of work environment/preferences."}, {"date": "29 May 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took a year or more. I interviewed at Boise State University", "Interview Descriptions": "I was already a state employee and was able to transfer, but it took quite awhile. I had to apply for a lot of jobs before something worked out. BSU has a ton of openings, but they really like to hire internally. Usually, somebody leaves a job and kind of a domino affect happens where the admins hop to a new position - which makes it hard to get in.", "Interview Questions": "They follow a pretty standard state hiring list of questions. Nothing too weird!"}, {"date": "30 Jan 2015", "title": "Graduate Student Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Boise State University (Boise, ID) in Feb 2014", "Interview Descriptions": "The professors interviewing were very receptive and friendly. Questions asked feel in line with the typical interview questions such as why here and respond to this situation. Just be friendly and honest and you will most likely do just fine.", "Interview Questions": "Students are fighting in the hallway, how would you react? "}, {"date": "4 May 2016", "title": "Student Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Boise State University (Boise, ID) in Jan 2014", "Interview Descriptions": "You must apply online through the Boise State University website. When called for an interview, you are required to give a presentation about what was studied in either your undergraduate or graduate program. Usually they are looking for some sort of researched based project that you are doing or interested doing to present. This interview process can take a maximum of two weeks.", "Interview Questions": "Where do you see yourself in two years?"}, {"date": "21 Mar 2016", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Boise State University (Boise, ID) in Jan 2014", "Interview Descriptions": "Turned in a resume and then talked with the professor about their research lab. This would definitely depend on the professor that you're working for but mine was very informal", "Interview Questions": "Unofficial transcripts to make sure that you wouldn't be hurting your studies"}, {"date": "30 Dec 2013", "title": "Project Manager - IT Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boise State University in Dec 2013", "Interview Descriptions": "Phone call to see about scheduling an interview. No indication that it would be a panel interview. Some email with dial in information. Apparently although this is a local candidate and local position, in person interview was not a consideration\r\nWhen I dialed in, it was on a speaker phone with 5 people and a terrible connection. I asked if there was a different number and they called me back on a cell phone, which was only slightly better. Could not hear most of the 5 people. Questions were theory based and cryptic.I got the impression I didn't answer a single question correctly.", "Interview Questions": "Not sure as I couldn't hear many of the questions. "}, {"date": "28 May 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Boise State University (Boise, ID) in Oct 2013", "Interview Descriptions": "I was offered a skype interview once my application was selected.  The skype interview was basic. They had questions regarding my prior research experiences. Then I was explained about the project and what is expected from me. It was a very casual interview and an easy one.", "Interview Questions": "Prior research experiences, Explained the project offered"}, {"date": "14 Aug 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Boise State University (Boise, ID) in Feb 2013", "Interview Descriptions": "Interview was pretty brief.  Had a schedule of meetings with several people in the department which all asked basically the same questions . . . what are you interested in working on, who are you interested in working with, what are your long-term goals, what things do you like to do etc..  Went out to lunch with several other students, think it was basically a free meal for them.  They all had typical 'watch out for this professor', I do 'this' for 'that' person.  Not terribly insightful or difficult overall.", "Interview Questions": "As listed above, what are you interested in working on, who are you interested in working with, what are your long-term goals, what things do you like to do etc.."}], [{"date": "2 Jan 2013", "title": "Senior Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Boise State University (Boise, ID)", "Interview Descriptions": "I contacted both the Director of Security and the Security Supervisor about the available position to get more information and to introduce myself.  The Supervisor was interested in what experience I had with security.", "Interview Questions": "The questions are geared to determine whether you could handle yourself in an emergency situation.  None of the questions were very difficult."}, {"date": "25 Mar 2017", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Boise State University (Boise, ID) in Jan 2013", "Interview Descriptions": "There were two rounds to the interviews; a group interview and a one on one interview. The group interview was more of a team building exercise where they asked questions to get to know you and then less serious questions like \"if you got to pick what animal to be what would you choose?\" there was also the dry noodle/marshmallow tower building challenge.", "Interview Questions": "In the one on one interview I was asked what I would do to calm an angry student."}, {"date": "15 Nov 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Boise State University (Boise, ID) in Jun 2012", "Interview Descriptions": "First interview with my advice and then with the research group. There are 6 graduate students in the research group. They asked basic technical questions about the research and your work style.", "Interview Questions": "General behavior questions."}, {"date": "21 Sept 2015", "title": "Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Boise State University (Boise, ID) in Jan 2012", "Interview Descriptions": "It took a long time to hear back regarding anything. The interview process was long and there was long gaps in between each interview. There were many different types of interviews. Including a personality test and skills review.", "Interview Questions": "They asked me how I handled stress?"}, {"date": "14 May 2015", "title": "Web QA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Boise State University (Boise, ID) in May 2011", "Interview Descriptions": "Well organized, friendly people. Asked general WebQA questions. Need to know terms and microsoft releated software. Need to know basic web application testing and debugging techniques. Not so hard.", "Interview Questions": "What things would you check for a login in form?"}, {"date": "3 Jun 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boise State University (Boise, ID) in May 2011", "Interview Descriptions": "It was very smooth. I talked on the phone with the supervisor. Then I was asked to come for an on site interview. Got the tour of the labs and facilities. And after that I got an offer.", "Interview Questions": "What were my interests? and how I will interact with a multidisciplinary team?"}, {"date": "23 Feb 2014", "title": "Customer Service Representative I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boise State University (Boise, ID) in Jun 2010", "Interview Descriptions": "I had one interview with two interviewing me.  It was relaxed as I remember and what was of importance to them was being able to research your questions  (learn by reading material provided)  being self motivated.", "Interview Questions": "N/A"}]]