[[{"date": "9 Apr 2023", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fox Chase Cancer Center (Philadelphia, PA) in Apr 2022", "Interview Descriptions": "pretty straight forward. quick screening call with HR and then a zoom interview with hiring manager. very conversation like and easy going. received a decision a day later. started working a few months later.", "Interview Questions": "where do you see yourself in 5 years? what are your strenghts/weaknesses"}, {"date": "8 Feb 2022", "title": "Palliative Care Physician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fox Chase Cancer Center", "Interview Descriptions": "One day, multiple interviews including the chair of Medical Oncology, the interdisciplinary team, hospitalists, multiple oncologists. No tour was formally provided but one of the oncologists offered to show me around.", "Interview Questions": "Are you prepared to only see cancer patients?"}, {"date": "11 Mar 2021", "title": "Student Co-Op Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Fox Chase Cancer Center", "Interview Descriptions": "An application needed to be submitted, an in person interview was scheduled. Talked to the head of the lab and some of the primary investigators there and after a while they got back to me", "Interview Questions": "Experiences with lab techniques and data analysis"}, {"date": "25 Nov 2019", "title": "Sci Tech I Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Fox Chase Cancer Center (Philadelphia, PA) in Oct 2019", "Interview Descriptions": "I had three interviews at Fox Chase Cancer Center. All of them went through the same recruiter. What a disaster that was. I got one offer, one rejection, and the other I withdrew from after accepting the other offer. The HR staff proactively advised AGAINST hiring me. I had accepted a job offer directly from the hiring manager. He was \"very excited\" that I accepted the offer. Three hours later I find out, through HR, that the job offer was rescinded. What a pos. There is no doubt HR helped sway him to not hiring me. But I'm glad I don't work at this awful company. Their salaries are awful anyway. They are trying to scam you. The only purpose of the HR bureaucracy is to pay sci techs less money. This way Temple saves a few bucks on payroll taxes. This was the worst interview experience I ever had. HR persuaded a hiring manager NOT to hire me (despite already accepting the offer). I even withdrew from one of my other interviews at Fox Chase after accepting the offer. The HR rep even said that they didn't \"screw me\" out of the position I withdrew from since I \"wasn't a top candidate anyway\". Yeah, that's why they brought me in for an interview after a 40 minute phone screen, because I wasn't a top candidate. And yet the HR rep had the nerve to yell at me for directly contacting the hiring manager (oh what a crime!). This company is awful, HR hates you, and the hiring managers will lie to your face. Don't apply to Fox Chase, they are going to underpay you anyway. Don't let them scam you. HR is the worst.", "Interview Questions": "Most question were related to science experience. HR recruiter asked where I lived, why I'm leaving my job, and how much $$$ I am looking for."}, {"date": "31 Jul 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fox Chase Cancer Center", "Interview Descriptions": "Process was slow to start but once started proceeded quickly, From time of initial phone call to interview was 2 months. Meet with human resources first then department manager and assistant manager", "Interview Questions": "Experience"}, {"date": "28 Jun 2019", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Fox Chase Cancer Center (Phila, PA) in Jun 2019", "Interview Descriptions": "Very brief, asked normal interview questions. Please see below. I was interviewed on the floor, by the floor manager and assistant manager. HR called me and asked me to come in to interview and HR took me directly to the floor, showing me around the hospital an explaining their values along the way.", "Interview Questions": "1. Why do you want to work here?\r\n2. What hours are you available to work?\r\n3. Where do you see yourself in 5 years?"}, {"date": "1 Mar 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fox Chase Cancer Center", "Interview Descriptions": "went there and met with the PI I was to work with; super friendly; curious about past experiences and what i was looking for in a lab; wanted to make sure i was a good fit", "Interview Questions": "What lab techniques are you familiar with?"}, {"date": "1 Mar 2019", "title": "Regulatory Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fox Chase Cancer Center in Feb 2019", "Interview Descriptions": "I applied online and had a short phone interview (less than 15 minutes). We scheduled an in person interview during the phone call for three days later. The in person interview lasted about 1 hour with standard interview questions. They mostly just talked about the position and daily tasks.", "Interview Questions": "Do you have trouble speaking to people in higher positions than you (ex: Department Chair, CEO, etc)?"}, {"date": "26 May 2018", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fox Chase Cancer Center in May 2018", "Interview Descriptions": "The interview process consisted of the interviewer telling about the job and the types of things I will be doing. It was very short and sweet. I got an offer the very next day and ter my interview.", "Interview Questions": "Only question I was asked is if I had any questions. And I was asked about my previous jobs. "}, {"date": "17 Jun 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Fox Chase Cancer Center in Jul 2017", "Interview Descriptions": "I interviewed with the doctor, who's research I was applying to be apart of. I was in contact with his assistant and scheduled the interview through her. The day of the interview I traveled to Fox Chase and met the doctor,. He then asked me about my previous experience based on my resume and then told me the research project. I answered some questions about the research project and then it was over.", "Interview Questions": "To understand the research project"}], [{"date": "16 Sept 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Fox Chase Cancer Center (Fox Chase, Philadelphia, PA) in Jul 2017", "Interview Descriptions": "I had three interviews. One with the recruiter, one with the manager, third with one of the staff in the department. I thought it went very well. It went past the expected time set aside. They never gave me an answer on my application despite contacting them 3 times to follow up.", "Interview Questions": "Tell me about yourself?"}, {"date": "7 Sept 2016", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Fox Chase Cancer Center (Philadelphia, PA) in Jul 2016", "Interview Descriptions": "HR emailed me asking me to call to set up an interview. Spoke briefly with HR who was very friendly. The interview was ultimately set up via email. I met with a few different people on the day of my interview and everyone was very friendly. The interview consisted more of me asking questions than them asking me questions. I had a great experience speaking with everyone. The only negative experience I had was the time it took to hear back after the interview. Otherwise, it was a great experience.", "Interview Questions": "Tell me about yourself"}, {"date": "14 Feb 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Fox Chase Cancer Center (Philadelphia, PA) in Mar 2016", "Interview Descriptions": "There were a lot of question about prior experience and research experience. It seems like taking courses related to chemistry or biology comes in very handy. Also the head investigator was very nice and the interviewing process was more like a learning process.", "Interview Questions": "What prior research experience did you have"}, {"date": "9 Mar 2015", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fox Chase Cancer Center", "Interview Descriptions": "Quick 2 interviews in one. Easy questions about job experience. Meet with a recruiter and a professor. I applied online and got a call back in two days. Then I was offered the job and declined it. Good experience overall", "Interview Questions": "Are you qualified?"}, {"date": "20 Feb 2015", "title": "Anonymous Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fox Chase Cancer Center (Philadelphia, PA)", "Interview Descriptions": "I Applied online, and received a call about 2 or 3 days later for an interview, then had 2 separate, same day interviews (for the same position). About 3 or 4 days after my interview I received a call that I was offered a position.", "Interview Questions": "Majority of the interview questions were related to my previous work experiences"}, {"date": "4 Jan 2018", "title": "ISP Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fox Chase Cancer Center (Philadelphia, PA) in Dec 2014", "Interview Descriptions": "interviewed by three scientists and given tour of lab- asked questions on my experience with science, but were more focused on my passion for it. It was an interesting experience to talk to incredibly accomplished and intelligent scientists about their love for their field and share a little about myself with them.", "Interview Questions": "Are you familiar with micropipetting?"}, {"date": "21 Jul 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Fox Chase Cancer Center (Philadelphia, PA) in Aug 2014", "Interview Descriptions": "Talked to the Lab director about their different projects and approaches to research and afterwards I talked to the rest of the doctors and lab technicians about my experience in laboratory settings.", "Interview Questions": "My experience in laboratory techniques"}, {"date": "7 Jul 2014", "title": "Data Warehouse Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Fox Chase Cancer Center (Fox Chase, Philadelphia, PA)", "Interview Descriptions": "Dont waste your time appling for this postion. The interview process will take atleast 6 months. They will interview 50 to 60 eligible candidates and downsize to 15 candidates for 6 hours onsite interview ending with a test and select one candidate. I am a Lead developer in my current company applied for Sr.Developer position and answered all questions because the interview is very easy to me and I answered all questions correctly in the final test because I work in extremely challenging project, but still not selected. This was happened to couple of other candidates too.", "Interview Questions": "There are no requirements in this project, how do you work/develop code in this environment"}, {"date": "18 Mar 2014", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Fox Chase Cancer Center (Burholme, PA) in Dec 2013", "Interview Descriptions": "After applying through their website, I emailed the person in charge introducing myself. The person in charge was nice enough to email me back with some questions about me. The next day, I got a call from HR wanting to have an interview with me. The interview was scheduled a couple days later. When I went to the interview, I was first interviewed by the HR representative. The interview questions were the standard ones asking me about my background and experience-nothing too difficult. The representative also explained to me their salary structure and benefit package at the initial interview. After the interview with the HR representative, I was also interviewed by the person in charge. It was supposed to be only about 15 to 20 minutes, but we talked for more than 30 minutes. The person in charge asked me about my background. I asked her about her background and research. We had a good conversation. She was very kind and it didn't feel like an interview.", "Interview Questions": "\"How do you manage your time?\""}, {"date": "16 Apr 2013", "title": "Major Gifts Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fox Chase Cancer Center", "Interview Descriptions": "Three to four step process. Phone interview followed by several face-to-face interviews.", "Interview Questions": "N/A"}], [{"date": "30 Mar 2013", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fox Chase Cancer Center", "Interview Descriptions": "You should expect to meet at least 3 people from the company plus HR.  They will ask about your work experience and expect you to have done many SIVs, Close out visits and monitoring.  They will make you swear on your life that you love to travel and 90% is not too much for you to handle.", "Interview Questions": "How do you handle an investigator who doesn't agree with your assessment of eligibility? "}, {"date": "30 Sept 2016", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Fox Chase Cancer Center (Philadelphia, PA) in Nov 2012", "Interview Descriptions": "No drug testing just start working without any training the interviewer was all over the place and unsure of everything very much unprofessional and high school like bragged alot about personal things not once about the actual facility and also badmouthing about the nurse managers he didnt lie he was very truthful about them i came to find out", "Interview Questions": "When can you start"}, {"date": "9 May 2010", "title": "Storage Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fox Chase Cancer Center (Philadelphia, PA) in Feb 2009", "Interview Descriptions": "Quick phone interview with HR.  In person HR interview then an interview with the Department Director and several of the employees.  Then nothing, pure silence.  No response from FCCC indicating that I had been passed over.  I even went so far as to contact the HR department and the Director asking for follow up but no reply received.", "Interview Questions": "Tell me about a situation where you were the direct cause of an incident that affected the entire organization and how did you resolve it?"}]]