[[{"date": "6 Dec 2021", "title": "Talent Acquisition Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Lakeside Behavioral Health System", "Interview Descriptions": "Ghosted me after calling saying was on to next step,  waited and contacted and never heard back, u fortunately, was disappointed. Could have decent to return message. On to the next…", "Interview Questions": "N/A"}, {"date": "25 May 2021", "title": "Community Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lakeside Behavioral Health System (Memphis, TN) in May 2021", "Interview Descriptions": "The interview process wasn’t to long. The interviewer looked over my resume, and asked all the normal questions most employers would asked. They also gave me a job description, and answered all my questions.", "Interview Questions": "How was something I did on my other job that I regret."}, {"date": "23 Feb 2019", "title": "Community Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Lakeside Behavioral Health System (Memphis, TN) in Feb 2019", "Interview Descriptions": "Interview was not difficult. I applied online and received a phone call from HR two days later. The phone call was a phone interview, if successful HR will send you a 45-60 min assessment test which determines if you move forward. If passed, they will invite you in for a face to face interview. I interviewed with the Director of Nurses in the unit I applied for. Was called with an offer from HR the next day.", "Interview Questions": "Normal interview questions were asked based on my resume/experience, how would you handle working with a difficult co-worker, what are your strengths/weaknesses, what does it mean to you provide quality care to patients"}, {"date": "16 Aug 2018", "title": "Therapist-Full Time Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lakeside Behavioral Health System (Memphis, TN) in Mar 2018", "Interview Descriptions": "Applied for position online. Waited a while and was contacted by program manager. Interview was scheduled soon after contact. Program manager explained the job and asked minimal questions. Basically said that he had determined that if I looked normal, he was going to hire me. After a couple of days an offer was extended. After accepting, a drug test, background check and physical agility test was given prior to orientation.", "Interview Questions": "What experience do you have?"}, {"date": "24 Jul 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lakeside Behavioral Health System (Memphis, TN) in Jul 2017", "Interview Descriptions": "HR called and made an appointment with me. Interview was great. HR answered all my questions about the company. Interviewer was very Knowledgeable about the company. \r\nA manager was called, the manager gave me a tour of the unit that I would be working on.", "Interview Questions": "Previous team work experiences. "}, {"date": "4 Jan 2017", "title": "Community Residence Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Lakeside Behavioral Health System (Memphis, TN)", "Interview Descriptions": "Once you receive a call back from a Human Resources, you're given a test to take then proceed with an interview for the position with the perspective supervisor. I interviewed with the Director of Nursing.", "Interview Questions": "Previous experience, and your ability to deal with patients who suffer from psychotic disorders?"}, {"date": "11 Jan 2015", "title": "Community Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Lakeside Behavioral Health System", "Interview Descriptions": "you are sent a test, then come in for an interview, after that if you are offered a position, training takes a week, you have to get you're bls license but they give it to you, very bs method too, but after that you begin to work", "Interview Questions": "nothing, typical"}, {"date": "10 Jul 2014", "title": "Assessment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Lakeside Behavioral Health System", "Interview Descriptions": "The interview process was pretty smooth and not difficult at all. I was interviewed and offered the job within the week. The background check was the long part which lasted about two to three weeks.", "Interview Questions": "There were really no difficult or unexpected questions."}, {"date": "26 Aug 2013", "title": "Outpatient Licensed Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Lakeside Behavioral Health System (Memphis, TN)", "Interview Descriptions": "The interview process was seamless. It was very casual as we discussed my prior work experience and specific areas of interest.  The responsibilities of the position I was applying for was explained throughly and I had the opportunity to answer any questions about the position.", "Interview Questions": "Several case examples were presented to determine my clinical skills and professional judgement as to how I would make decisions with regards to various levels of care, diagnosis and safety "}, {"date": "5 Oct 2013", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Lakeside Behavioral Health System in Jun 2012", "Interview Descriptions": "Interview with direct Manager of team, interview with VP, Interviews with the Hospital Psychiatrist (Hospital's Medical Director.  This is followed by finger printing and a FBI and DCF background check, which takes up to 3 months.", "Interview Questions": "Being able to tell your interviewers how your past experience will help you with this job ids hard unless you have worked in a very similar setting before."}], [{"date": "6 Dec 2014", "title": "Community Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Lakeside Behavioral Health System in May 2011", "Interview Descriptions": "Applied through a friend's referral.  Interviewed with the Director of Admissions and the Assistant Director of Admissions.  Interview questions were pretty general.  They did stress that this job was working directly with patients and asked repeatedly if I understood what that involved.", "Interview Questions": "Please describe how you would handle a patient who was ranting and raving but not acting physically threatening in any way?"}]]