[[{"date": "11 Apr 2023", "title": "Laboratory Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland School of Medicine (Baltimore, MD)", "Interview Descriptions": "This was a contract job at the State Lab in Baltimore. Initial interview was with the division chief to describe the job, salary, benefits and whether or not to proceed with the next step. 2nd interview was a panel of 5 people that were state workers from different positions within the various laboratories. Interview was about an hour. They had a combination of technical and behavioral questions. I think between 15-20 questions were asked. It wasn't about getting to know me and whether I would be a good fit, but rather to ask the mandatory questions.", "Interview Questions": "Tell me a time you worked with someone that was being difficult."}, {"date": "5 Sept 2017", "title": "Registered Nurse I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland School of Medicine (Baltimore, MD) in Aug 2017", "Interview Descriptions": "I applied for the PICU in mid August and interviewed late August. I interviewed with the nurse manager. I shadowed a couple nurses for two hours after the interview and saw a good variety of patients and the type of disorders I'd be caring for. Per the manager's request, I came back for a second shadow day and was there for an hour and walked around with one nurse. I thought the manager had liked me and I asked plenty of questions but the stars weren't aligned for me this time. Definitely a great unit to learn a lot on but didn't work in my favor.", "Interview Questions": "Why pediatrics?"}, {"date": "19 May 2016", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland School of Medicine (Baltimore, MD)", "Interview Descriptions": ". Applied to an online advertisement for the job. Got an invitation for an informal meeting same day I applied. Formal interview was set up with 15 days. It was open presentation and meet with few faculty members. Got an offer two days later by an email.", "Interview Questions": "Mostly scientific field related"}, {"date": "17 Jul 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Maryland School of Medicine (Baltimore, MD) in Apr 2016", "Interview Descriptions": "Exchange of resume to check my background and experience followed by phone call with the Principal Investigator regarding reasons for my application and discussing current projects in the lab and how I would be suitable for them.", "Interview Questions": "Why I want to work for this employer?"}, {"date": "30 Jan 2016", "title": "Shock Trauma PACU RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Maryland School of Medicine (Baltimore, MD) in Dec 2015", "Interview Descriptions": "Very organized and professional.Interview consisted of a formal Q & A with the hiring manager followed by a  couple of hours of share time. The hiring manager was very easy to talk to and put me at ease. I didn't get an offer, unfortunately. I really wasn't well prepared for the interview. I would definitely do some reflection before the interview about times you did well as a nurse, situations where you learned something so you can talk about specific examples in the interview.\r\nIt took a long time before I got the actual rejection, that was the only bad part.", "Interview Questions": "Vanilla stuff, strengths, weaknesses, what makes you stand out, tell me about a diificult patient situation and how you overcame it."}, {"date": "30 Nov 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Maryland School of Medicine (Baltimore, MD)", "Interview Descriptions": "Interview was conducted by PI and lab members. I was asked about my previous lab experience, technical skills, and knowledge that related to the position. It was a well organized and smooth experience.", "Interview Questions": "How did I see my previous technical skills applying to this position?"}, {"date": "17 Apr 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Maryland School of Medicine", "Interview Descriptions": "It went on smoothly, the interview was conducted by PI, not the institution. The PI made the decision based on my presentation and my resume, so did not raise any critical questions.", "Interview Questions": "The PI made the decision based on my presentation and my resume, so did not raise any critical questions."}, {"date": "6 Aug 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Maryland School of Medicine", "Interview Descriptions": "I was invited for a face to face interview, including a 1-h presentation on my previous research work, following by question-time and informational interviews with other faculties in the department", "Interview Questions": "N/A"}, {"date": "5 Feb 2014", "title": "Research Assistant-Clinical Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Maryland School of Medicine", "Interview Descriptions": "I was already an employee within the organization, so I did not have to go through the interview process.", "Interview Questions": "N/A"}, {"date": "20 Jul 2015", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Maryland School of Medicine (Baltimore, MD) in Nov 2013", "Interview Descriptions": "The interview was a lengthy process--2 phone interviews, 1 in person interview, and then a hefty amount of onboarding paperwork. It took about 6 weeks, going back and forth between the interviewer and HR to finally settle on the application, start date, and job description. UMSOM did not cover any of my travel costs, including flight, hotel, or food. This was slightly disappointing as I was out $700 without even a guarantee of a position (or a nod if I was a front runner), but thankfully in the end I got the job.", "Interview Questions": "What is your greatest weakness? And has it ever led to a mistake? "}], [{"date": "23 May 2014", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland School of Medicine in Aug 2013", "Interview Descriptions": "I Applied and didn't know anything for a few weeks. I Received an email letting me know That I was a contender. Next I Had a phone interview with the PI. I had an in person interview with the PI. Then I had another interview with the post doc and other lab mates. Got the job", "Interview Questions": "Questions were pretty straightforward."}, {"date": "16 May 2013", "title": "Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Maryland School of Medicine (Baltimore, MD) in Nov 2012", "Interview Descriptions": "interview totaled 30 minutes", "Interview Questions": "don remember"}, {"date": "4 Jun 2015", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Maryland School of Medicine (Baltimore, MD) in May 2012", "Interview Descriptions": "First step was a informative phone interview where the principle investigator for the lab I was applying to explained the work of the lab and the work that I would be doing. She then explained was expected of me and how much I would be paid and asked if I was still interested.", "Interview Questions": "Describe your previous lab experience."}, {"date": "24 Jun 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Maryland School of Medicine (Houston, TX) in Apr 2011", "Interview Descriptions": "It was relatively straightforward postdoc interview.  My boss and the prospective PI were old friends so that probably helped somewhat.  I drove to the prospective lab and gave a 40-60 minute powerpoint presentation of my past work and answered some relevant questions by the current lab members (postdocs and grad students) and then chatted very briefly with them, then got a very quick tour of the lab and then chatted with the PI some about my work and their work and what he wanted the position to do (i.e. the projects that the guy was doing who I'd be replacing).  He mentioned that the whole lab was moving across the country and, while very shocking, was doable since I did my PhD in a state I didn't live in anyway.  He seemed impressed and I got the distinct impression I'd be offered the job.  He called to offer it to me within a week or two.", "Interview Questions": "What techniques are you familiar and experienced with?\r\nHow experienced are you with (techniques X,Y,Z)?\r\nAre you familiar with our lab and publications?"}, {"date": "29 Jul 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland School of Medicine in Mar 2010", "Interview Descriptions": "After filling out the application, submitting my CV and a personal statement I was asked to come to the university for an interview day. The school payed for my hotel, fed me breakfast lunch and dinner and I met with at least 10 faculty.", "Interview Questions": "I was asked about subjects that I appeared weak in on my undergrad transcript. "}, {"date": "29 Mar 2013", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Maryland School of Medicine (Baltimore, MD) in Jan 2010", "Interview Descriptions": "I received an email from my future employer only few days after my application. The interview was planned for the following week for me to present my research experience. \r\nThe interview went well, the employer introduced me to my future colleagues, presented his work and then asked me to do a powerpoint presentation of my own research. I didn't feel that there were any tricky questions during the interview. We finished the interview less formally outside in a coffee shop.", "Interview Questions": "The most difficult question, however not expected, was about my reason to apply for the job considering I was slightly overqualified."}]]