[[{"date": "6 Jul 2023", "title": "Front Desk Receptionist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Oklahoma Heart Hospital (Oklahoma City, OK) in Jun 2023", "Interview Descriptions": "The woman giving the interview was very degrading towards my prior experiences. Unwelcoming environment. Better off not working for the Company. Gave a bad first impression of what things would be like if hired under this woman.", "Interview Questions": "Tell me about yourself? What are your past work experiences?"}, {"date": "5 Jul 2016", "title": "Clinic Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Oklahoma Heart Hospital (Oklahoma City, OK) in Jun 2016", "Interview Descriptions": "Interview was set up by the Human Resources Department within a couple of days of submitting my resume online.  The interview was with a high ranking position within the company.  The interview was very informational but the interviewer never stopped talking.  I would have been a great fit for the position and the company but I couldn't get a word in edgewise.", "Interview Questions": "I wasn't really asked many questions at all.  Made the interview very awkward."}, {"date": "5 Feb 2019", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Oklahoma Heart Hospital (Oklahoma City, OK) in Jan 2016", "Interview Descriptions": "Interview process was very relaxed and easy flowing. I was asked about my general knowledge base.  Questioned about the relevance of my education & training work history and the relevance of my work experience.   How I felt regarding my adaptability, Initiative Leadership, Work Ethic,  General Impressions,  and considerations for my confidence responsiveness,  verbal expression, and maturity judgment goals. \r\nAlso assessment questions of general Strengths and Weaknessess.", "Interview Questions": "What do you know about Oklahoma Heart Hospital?"}, {"date": "13 Mar 2015", "title": "Web Applications Developer I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Oklahoma Heart Hospital (Oklahoma City, OK) in Feb 2015", "Interview Descriptions": "Interview process was in-depth on types of coding I was able to do. It did include specific questions on what I would do for specific code I would use in certain instances. The interviewer was very professional but comfortable to interview with. I was also able to ask questions specifically regarding the position. They requested a view-able portfolio.", "Interview Questions": "What would you use to secure web applications with?"}, {"date": "7 Jan 2019", "title": "Check-in Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Oklahoma Heart Hospital (Oklahoma City, OK) in Feb 2015", "Interview Descriptions": "Pretty basic for a large corporation. Interview and do a standard test about how you would handle certain situations. No college degree needed for this job and it's your basic paperwork filing position so expect a simple interview process.", "Interview Questions": "How do you handle stress and unhappy patients?"}, {"date": "28 Feb 2013", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Oklahoma Heart Hospital", "Interview Descriptions": "All application process done online.  Right before interview EVERY potential employee fills out a psych/personality \"test\" and it shows them what kind of person you are. Very laid back and easy to talk to management. Human Resources staff very friendly.", "Interview Questions": "In nursing, there aren't too many difficulty questions unless there is something in particular they need to know about."}, {"date": "18 May 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Oklahoma Heart Hospital (Oklahoma City, OK) in Jan 2013", "Interview Descriptions": "One interview. Pretty short and to the point. The lady acted like the building was on fire and couldn't get out fast enough. I was actually surprised when I was offered the job. I wasn't given a chance to say much.", "Interview Questions": "Are you willing to work nights?"}], [{"date": "10 Sept 2015", "title": "Dietary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Oklahoma Heart Hospital (Oklahoma City, OK) in Mar 2011", "Interview Descriptions": "The interview process was pretty simple. The interview consisted of one on one sit down. After the interview a drug test is needed. This job requires all vaccines. Be prepared for multiple shots in order to start the job.", "Interview Questions": "if you have had all your shots"}]]