[[{"date": "9 Jul 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emporia State University", "Interview Descriptions": "After completing an online application, I received a phone call a couple days later to set up some time for an interview in the student union. The interview process was 2:1 interview setting for 30 min. Questions revolved around interest in the role and past experience. Minimal preparation required.", "Interview Questions": "Why are you interested in this role? "}, {"date": "10 Feb 2022", "title": "Assistant Project Manager (Student) - Office of the CIO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Emporia State University (Emporia, KS)", "Interview Descriptions": "I applied and within days scheduled a Phone Call Interview. After that, I was asked to come in for an in-person interview. This was both behavioral-based and a little technical. It was overall a great experience. Great communication and the whole process took less than a week.", "Interview Questions": "What does success mean to you?\r\nWhat are your short-term and long-term goals?\r\nWhat is your experience with project management?"}, {"date": "26 Mar 2021", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emporia State University (Emporia, KS) in Aug 2020", "Interview Descriptions": "Three different interviews beginning with a phone interview and ending with a 4 hour interview in person. The last interview was a panel interview. The interview was conversational and relaxed.", "Interview Questions": "What would you bring to our team?"}, {"date": "15 Aug 2019", "title": "Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emporia State University", "Interview Descriptions": "There was a hiring committee of 8 people consisting of librarians, advisors, and students. There were 16 questions, printed out for me to read and each person asked me two questions.", "Interview Questions": "How would you define diversity?"}, {"date": "28 Feb 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emporia State University", "Interview Descriptions": "Basic interview questions, show willingness to always learn. Met with the hiring committee and had a relaxed conversation on how our visions aligned. Very helpful and positive. Would do it again.", "Interview Questions": "Will you be able to work during the break?"}, {"date": "29 Oct 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Emporia State University (Emporia, KS) in Jan 2018", "Interview Descriptions": "- You need to find a GA position in the department you are doing your masters degree in. Once you find a professor in need of a GA position. It is highly advised that you talk to him face-to-face and get his recommendation.", "Interview Questions": "How will you interact with student's problems in the class? "}, {"date": "2 Jun 2021", "title": "Assistant Professor, Management Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emporia State University (Emporia, KS) in May 2017", "Interview Descriptions": "The first interview was via ZOOM, the second one - in person with a campus visit. Very easy going, friendly environment. Buildings are old, though. There is a nice pond and a fountain feature but it needs cleaning...", "Interview Questions": "Nothing that stood out.... Traditional \"Why Emporia?\""}, {"date": "3 Feb 2017", "title": "Technology Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Emporia State University (Emporia, KS)", "Interview Descriptions": "Phone interview first for apx. 1 hour. Then, in person interview with 1 hour performance & 1 hour interview with committee. In the performance I was asked to research and recommend a Dell PC and an Apple MacBook. Also, was asked to setup a projector with a laptop. In the interview, it was with 4 people from the search committee.", "Interview Questions": "As a tech person, what experience do you have with working regularly with non-technical people?"}, {"date": "19 Jan 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emporia State University (Emporia, KS) in Dec 2015", "Interview Descriptions": "long interview process / three interviews. panel interview with the whole dep. every single person in the department was there and they were asking questions in order. after 1 week I got a call to participate in another interview", "Interview Questions": "tell me about your past experiences"}, {"date": "7 Aug 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emporia State University (Emporia, KS) in Jul 2015", "Interview Descriptions": "Short and simple. I interviewed with 1 person over 2 interviews and was offered the position easily. They asked about my past experience and needed examples of how I had used the computer. I applied online and followed up before and after the interview.", "Interview Questions": "Have you worked in an office setting?"}], [{"date": "12 Aug 2016", "title": "Technology Consultant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emporia State University (Emporia, KS) in Jun 2015", "Interview Descriptions": "I was asked questions about the position, what I would be capable of bringing to the team and where I wished to go. I interviewed with a panel, as well as the team which I was joining. It was a selection committee, so they asked questions in a circle identically to other interviewees.", "Interview Questions": "Do you have any SharePoint experience?"}, {"date": "13 May 2015", "title": "Complex Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Emporia State University (Emporia, KS) in Sept 2013", "Interview Descriptions": "Phone interview then on-campus interview that lasted all day and included dinner the night before. The phone interview was fairly simple. The on-campus was long but I got to meet many different members of the campus community. After I only had too wait about a week to receive an offer. They moved fairly fat through their hitting process. I was very impressed by that.", "Interview Questions": "Why do you want to work here?"}, {"date": "29 Apr 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Emporia State University (Emporia, KS) in Mar 2012", "Interview Descriptions": "The interview went over smoothly. There was not a lot of tension in the room at all. It took place between myself and one other person. The interview was typical in the sense that standard interview questions were asked of me. I was able to receive feedback on my interview result fairly quick.", "Interview Questions": "Why do you want this job?"}]]