[[{"date": "5 May 2022", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Catalyst in Apr 2022", "Interview Descriptions": "Had an interview with a consultant. Was immediately scheduled for a second/third interview. I was told they wanted to move quickly and have a decision by the end of the following week. I had to reschedule due to a conflict with work that was outside of my control. I emailed the consultant and the coordinator to let them know and give my next availability and never heard back. I explained the situation and tried to be as clear as I could that it was outside of my control. 3 days later after not hearing back, I received an automated search closed email.\r\n\r\nAs someone in the recruiting industry, it was handled in a way that I would never handle it, and would hope they would have been better than that.\r\n\r\nCommunicate with candidates. It goes a long, long way.\r\n\r\nYou can reject a candidate and still have a raving fan, but you lost a raving fan here.", "Interview Questions": "Just general position-related questions. There was not anything that was out of the unordinary. "}, {"date": "9 Mar 2021", "title": "Research Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catalyst (Unknown) in Dec 2020", "Interview Descriptions": "Screening interview with a recruiter in HR, followed by a Zoom interview with two members of the research department. Very friendly, eager to answer questions, and easy to talk to.", "Interview Questions": "When was a time that you joined an existing team project? How was that experience getting up to speed and contributing to the group?"}, {"date": "10 May 2019", "title": "Senior Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catalyst", "Interview Descriptions": "HR screening interview over phone, panel interview over Zoom, interview with VP over zoom. Each interview was between 40 minutes - 1 hour long, spaced out with one per week over a 3-4 week period. The panel interview was perhaps the most challenging, since it's difficult to connect to three people at once, especially when all are on different screens.", "Interview Questions": "What strengths would you bring to the team?"}, {"date": "2 May 2018", "title": "Librarian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catalyst (New York, NY)", "Interview Descriptions": "Several phone and skype interviews with various members of the hiring team and work team. Interviews were both individual and group interviews and were fairly standard. First round was with someone in HR for basic screening  and then I was forwarded on to the team that I would have been working with.", "Interview Questions": "Questions were all very standard. Several focused on time management and organization - essential for remote work."}, {"date": "13 Nov 2017", "title": "Research Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catalyst in Nov 2017", "Interview Descriptions": "Second round of interview with the VP of research and development department. it was a short 30 minutes phone interview.  VP asked me specific questions about my prior work experience and how that fits with the work Catalyst does.", "Interview Questions": "How do you relate with Catalyst's vision?"}, {"date": "29 May 2017", "title": "Account Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catalyst (Toronto, ON) in Feb 2017", "Interview Descriptions": "Overall a very unprofessional interview and experience with this company.\r\n\r\nFirst had a phone screening interview.  Second interview was with a department head and another team member. The interview was marred with both of them not taking it seriously. Throughout the in person interview, one of the interviewers kept on looking at their phone and the main interviewer did not seem bothered. They left a poor impression of the company to me as the prospective employee.", "Interview Questions": "Describe your marketing experience?"}, {"date": "3 Feb 2015", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Catalyst", "Interview Descriptions": "HR called me first and we scheduled an interview. During the interview, the manager asked me do you have marketing experience before? Do you have leadership experience? What do you think will be important for a leader? It takes less than 15 minutes, the manager spoke really fast and it made me nervous.", "Interview Questions": "What do you think will be important for a leader? It seems that they want to find someone with leadership to do the job, not so basic for internships."}, {"date": "4 Nov 2014", "title": "Senior Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Catalyst", "Interview Descriptions": "this process was fine, i had no issues. took some time, but that is not unusual i guess.  I don't have 50 words to write about this, I'm not sure why I am being asked this.", "Interview Questions": "nothing, was expected."}, {"date": "27 May 2015", "title": "Prefer Not To Say Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Catalyst (New York, NY) in Apr 2011", "Interview Descriptions": "2 interviews, good questions. met with three people. the questions really tried to get at behaviors and how one would handle a situation. 2 interviews, good questions. met with three people. the questions really tried to get at behaviors and how one would handle a situation.", "Interview Questions": "N/A"}], [], [], [], []]