[[{"date": "20 Jun 2023", "title": "Consultant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at World Health Organization (Washington, DC)", "Interview Descriptions": "If you are shortlisted for the position, they will offer a written test and interview. The written test is technical and specific to the job. I would suggest doing some studying in advance to the relevant position.", "Interview Questions": "Written questions include detailed questions on the position and how to do data analysis."}, {"date": "4 Nov 2021", "title": "Technical Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Health Organization (New York, NY)", "Interview Descriptions": "I applied for a job with the AMR Stewardship and Awareness Unit, took a written test and passed on to the interview stage. The interview was really disappointing. Maybe it's because it's the big \"WHO,\" the interviewer behaved like he was god and was so arrogant! He was rude and kept interrupting my answers, acted condescending and seemed incredulous that I wanted to ask ANY questions about the position. He didn't seem to understand that interviewing is a two-way street, and that candidates are also assessing the employer when they go for these interviews, to judge whether they'd truly want to work there. This was hands down one of the worst interviewing experiences I've ever had (and that's saying something)! In the end, the interviewer did me a favor because he showed clearly what a nightmare he would been to work for!", "Interview Questions": "Tell me about a time you had to deal with conflict"}, {"date": "7 Sept 2021", "title": "Payroll Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Health Organization (Gary, IN) in Sept 2021", "Interview Descriptions": "Fast easy I just found it sketchy that you have to give them your bank account and cannot get paid by a prepaid card I’ve never been told I couldn’t receive pay from a prepaid card and only my bank account", "Interview Questions": "To give my bank account info"}, {"date": "25 Sept 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Health Organization", "Interview Descriptions": "Phone interview discussion the position and my experiences.  Very quick and direct.  People I spoke to were extremely nice and wanted to get to know me better.  Really appreciated the fast response and quick turn around for the internship offer.", "Interview Questions": "Why I would be a good fit based on my experiences?"}, {"date": "8 Mar 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at World Health Organization", "Interview Descriptions": "Phone interview within 10-20 minutes with a potential supervisor, after submitting application forms online. No tricky questions, mostly based on the application material and about the future career/aspirations. Note that interns are usually not hired as a staff upon completion of the internship.", "Interview Questions": "Why are you interested in this job?"}, {"date": "25 Nov 2019", "title": "Procurement Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at World Health Organization (New York, NY)", "Interview Descriptions": "First round - written exam \nGenerally shortlisted candidates are called for the written exam. Exam is related to the job profile and the duration of exam is 2 hours .\nThose who clear the exam and Shortlisted are called for final round.", "Interview Questions": "written Exam question s\n1.Define team work. explain the importance of positive working environment and what steps would you take to make the environment postive in an organization."}, {"date": "23 May 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 6 months. I interviewed at World Health Organization (New York, NY) in Mar 2018", "Interview Descriptions": "Got an email asking for phone call interview almost four-five months after applied through the school website, the process went pretty well, both supervisors sounded nice and helpful. Had to finish lots of paperwork and got a visa for Switzerland afterward. The supervisor communicated with me on time on these issues.", "Interview Questions": "Are you willing to come to work in Switzerland with no salary?"}, {"date": "11 Dec 2017", "title": "Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Health Organization", "Interview Descriptions": "I applied through the main WHO employment website.  I received an email that I had been selected to complete the technical \"exam\" which I was given 48 hours to complete and return.  I was notified within a few days following the submission of the exam that I received an interview, and I had an interview lasting about 1 hour via Skype with the position supervisor.", "Interview Questions": "Describe an unexpected challenge or problem and how you dealt with it"}, {"date": "14 Oct 2015", "title": "Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at World Health Organization", "Interview Descriptions": "I emailed the person I wanted to work with directly. After speaking with them on the phone to describe my experience, they scheduled a second interview with me. During this interview, I created a presentation on the topic I wanted to work on and presented it to the the higher-ups in the department. From there they decided who I would be best to work with, and then I spoke with them to define the internship and the deliverables.", "Interview Questions": "How I translate domestic experience to the international health space."}, {"date": "7 Feb 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Health Organization in Jan 2015", "Interview Descriptions": "I applied online and through one staff to be his assistant. I talked about my personal experiences and the staff talked about what kind of project he was working on.", "Interview Questions": "questions about personal experiences"}], [{"date": "24 Jul 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at World Health Organization (Washington, DC) in Apr 2014", "Interview Descriptions": "I applied online. The process took 2+ months. I was asked few questions on the phone. Interviewer was very respectful, and humble. After interview, it took two day when I received an acceptance letter from WHO. It was a great experience.", "Interview Questions": "Was asked about my academic background, about WHO, and what I expect from the internship."}, {"date": "19 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at World Health Organization in Apr 2013", "Interview Descriptions": "I reached out to a technical officer on Linkedin and he asked me to send him my resume and cover letter which I did. A month later, I received a phone call from HR to tell me that I had been selected for the internship.", "Interview Questions": "They asked me what kind of project I would like to be involved in and If I had any experience in my area of interest."}, {"date": "2 Aug 2011", "title": "Procurement Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 6 months. I interviewed at World Health Organization (Washington, DC) in May 2011", "Interview Descriptions": "You apply online through the website. It takes about 2 to 3 months to move to the next phase, that is a timed skills test. After the test it takes about 1 month to move to the next phase, which was a panel interview. After that you get an offer or not (it takes about 2 months to have a reply).", "Interview Questions": "Questions are mainly technical."}]]