[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "fine", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Mar 2021", "job_title": "Anonymous Employee in Montreal, QC", "duration": "N/A", "pros": "A calm building to work in.", "cons": "Hypocritical institution that does not reflect on it's own expositions."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Looks good on your resume, but are you mentally ready?", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "18 Nov 2014", "job_title": "Communications Department in Montreal, QC", "duration": "N/A", "pros": "There are only but a handful of institutions like the CCA, and for anybody in history or theory of architecture, in museum and library science, it seems to rank quite high, especially at the Canadian level. Management tends to be international and they bring their own prestige. They set very high standards for their work and expect nothing less but perfection and offer great benefits compared to what one can be used to in the non profit environment.", "cons": "Long, long hours, crazy bureaucracy, with key managers coming from an elite,  mostly wealthy background and disconnected from the implications that come with planning the perfect exhibit. While some people manage to stick around (mostly due to the very rare opportunities they have to go elsewhere) expect a certain amount of turnover, which might play in your favour if you're eyeing another position. Some people have reported toxic work environments in their own departments."}], []]