[[{"date": "31 Mar 2023", "title": "PhD Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ruhr-Universität Bochum (Bochum, North Rhine-Westphalia)", "Interview Descriptions": "It has been an informal and easy interview and the interviewer was really kind and calm. She was alone, with no other colleagues. The interview lasted one hour, more or less.", "Interview Questions": "About yourself and your research interests"}, {"date": "4 Nov 2022", "title": "Studentische Hilfskraft Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ruhr-Universität Bochum", "Interview Descriptions": "Lebenslauf wurde zuerst gefragt. Fragen nach Motivation, Vertiefung, einige fachspezifische Modulen, Hausarbeiten, Bachelorarbeit, Programmierungssprachen (welche und Niveau). Allgemein ganz locker. Freundliches Gespräch. Das ganze Vorstellungsgespräch dauert ungefähr 20 - 30 Minuten.", "Interview Questions": "when do you plan to end your master's study?"}, {"date": "10 Jan 2021", "title": "Sachgebietsleiter Operativer Einkauf Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ruhr-Universität Bochum", "Interview Descriptions": "Der Umgang war freundlich, offen und respektvoll.\nInsgesamt hat das Interview ca. eine Stunde gedauert.\nEs wurden Fragen zu Lebenslauf und Wechselgründen gestellt. Auf die Fragen zum Team hat der Interviewpartner ganz ehrlich und offen geantwortet.", "Interview Questions": "Was sind die Besonderheiten bei öffentlichen Ausschreibungen?\nWarum möchten Sie für die Uni arbeiten?"}, {"date": "17 Dec 2019", "title": "Diplom-Ingenieur und Architekt Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Ruhr-Universität Bochum (Bochum, North Rhine-Westphalia)", "Interview Descriptions": "Es waren etwa 10 Leute beim Vorstellungsgespräch anwesend. Dabei waren Vorgesetzter und Personalvertretungen vertreten. Gesprochen hat nur der Vorgesetzte, alle anderen haben nur dagesessen und gelangweilt ausgesehen. Tatsächlich hat man nur die üblichen Fragen gestellt, Stärken, Schwächen, wo sieht man sich in 5 Jahren...Das Übliche also.\r\nÜber den eigentlichen Job habe ich nicht sehr viel in Erfahrung bringen können. Man sagte, die Stelle müsse sich erst entwickeln. Zur Bezahlung hielt man sich bedeckt, obwohl die Stelle mit TV-L 11 ausgeschieben war, könne man mir nicht mehr als TV-L 10 zahlen. Aber man können mir eine Zulage anbieten (auf die ich im Übrigen noch heute warte)", "Interview Questions": "Was sind Ihre Stärken und Schwächen?"}, {"date": "17 Sept 2019", "title": "SHK Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Ruhr-Universität Bochum", "Interview Descriptions": "Eine Woche mach der Bewegung wurde für Vorstellungsgespräch eingeladen . Zum Vorstellungsgespräch wurde einige Fragen zum Studium und Programmieren Kenntnisse gestellt . Der Stelle war auf Mini Job Basis bzw. Weniger als 450 Euro monatlich", "Interview Questions": "Studium background "}, {"date": "4 Feb 2022", "title": "Bauzeichner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Ruhr-Universität Bochum (Bochum, North Rhine-Westphalia) in Apr 2018", "Interview Descriptions": "Ein sehr nettes und offenes Team in meinem Fall, welches auch die Weiterbildung (u.a. auch in der Arbeitszeit) fördert. Dies alles wird offen, lieb und ehrlich im Vorstellungsgespräch kommuniziert. Es war in einer kleinen Runde, mit dem wichtigsten Personen, und anschließend wurden die eventuell zukünftigen Mitarbeiter vorgestellt.", "Interview Questions": "Was ich in meiner Zukunft machen möchte, zu was ich mich entwickeln möchte."}, {"date": "6 Dec 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Ruhr-Universität Bochum (Bochum, North Rhine-Westphalia) in Feb 2018", "Interview Descriptions": "Interview on campus. Technical questions related to position. Firstly received an email invitation then interview on campus. I needed to wait for 4 days for iniviation. This is getting too much now to provide for such a description", "Interview Questions": "What is your experience with MATLAB? What do you know about FEM?"}, {"date": "25 Jan 2022", "title": "Wissenschaftler mitarbeiter TV-L 13 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ruhr-Universität Bochum (Bochum, North Rhine-Westphalia) in Feb 2018", "Interview Descriptions": "The interview was very smooth, although it can be quite PI-dependent. The invitation was also very nice, although the time of the interview was such that I had to find accommodation in the city. All in all, I highly recommend the university, and the german public sector.", "Interview Questions": "General questions that tried to infer the direction and level of one's motivation. "}, {"date": "6 Mar 2022", "title": "Doktorand Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Ruhr-Universität Bochum (Bochum, North Rhine-Westphalia) in Feb 2018", "Interview Descriptions": "Sehr nett und freundlich. Ein Gespräch in einem Raum neben den Laboren, ein kurzer Rundgang und Kennenlernen der anderen Mitarbeiter ohne Befragung. Ich habe dann Bescheid bekommen innerhalb weniger Tage und konnte dann zügig anfangen.", "Interview Questions": "Welche Vorkenntnisse haben Sie zu dem Thema?\r\n(fachspezifische Fragen)"}, {"date": "17 Apr 2017", "title": "Research Follow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Ruhr-Universität Bochum (Bochum, North Rhine-Westphalia)", "Interview Descriptions": "It was a smooth one. I was interviewed by the coordinator about my research topic and whom do I want as my supervisor. I was asked to present my topic as well. And she asked about some general questions like if I know German or any other European language..", "Interview Questions": "Why did you chose RUB for your PhD?"}], [{"date": "19 Jul 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Ruhr-Universität Bochum (Bochum, North Rhine-Westphalia) in Oct 2016", "Interview Descriptions": "that depends mostly in every person for me i was doing very good in one subject and then the professor him self ask me if i want to work in the department as a research assistant and then i started my work like that", "Interview Questions": "if i a interested in this topic and what is my personal opinion about it  "}, {"date": "16 Mar 2018", "title": "Studentische Hilfskraft Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ruhr-Universität Bochum in Jan 2016", "Interview Descriptions": "Bewerbung per Mail. Einladung zum Gespräch per Mail. \r\n\r\n1. Mich vorstellen, meinen bisherigen Lebenslauf\r\n2. Vorstellen der Stelle durch Recruiter, was kommt auf mich zu, meine Aufgaben\r\n3. Typische Fragen an mich. Siehe unten. \r\n4. Qualifikationstest bezogen auf meine zukünftige Stelle\r\n5. Zeit für Fragen von meiner Seite", "Interview Questions": "Wie würde ich mich selbst beschreiben?\r\n\r\n"}, {"date": "11 Jan 2017", "title": "Wissenschaftlicher Mitarbeiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Ruhr-Universität Bochum (Bochum, North Rhine-Westphalia) in Apr 2013", "Interview Descriptions": "Es war alles super. Ein sehr netter Empfang. Dies kann aber von Bereich zu Bereich unterschiedlich sein. Die Einarbeitung war auch sehr nett und alles hat super geklappt. Das Gespräch fand nachmittags statt.", "Interview Questions": "Haben Sie bereits Erfahrungen in dem Bereich, in dem das Forschungsprojekt stattfinden soll?"}, {"date": "24 Jul 2017", "title": "Wissenschaftlicher Mitarbeiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Ruhr-Universität Bochum (Bochum, North Rhine-Westphalia) in Feb 2013", "Interview Descriptions": "Nach erfolgreichen Abschluss der Diplomarbeit mit sehr gute Note wird man in der Regel vom Professor angesprochen und eine Stelle angeboten. Dies bezieht sich auf die Fakultät für Maschinenbau. In der Regel teilt sich die Stelle in Lehrtätigkeiten und Forschungsprojekte aus Drittmitteln oder Fördergelder. Das Promotionsthema wird in der Regel thematisch an den Projektätigkeiten angelehnt.", "Interview Questions": "Warum wollen Sie promovieren?"}, {"date": "23 Jul 2012", "title": "Studentische Hilfskraft Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Ruhr-Universität Bochum (Bochum, North Rhine-Westphalia) in Jul 2011", "Interview Descriptions": "Die Angebote werden innerhalb des Universitätsgeländes öffentlich bekanntgemacht. Die Bewerbung erfolgt hauptsächlich online und später kann auch eine Einladung zu einem persönlichen Interview folgen. Deutsch ist nicht verpflichtend, um einen Job zu bekommen, gutes Englisch ist meist ausreichend. Wenn man angenommen wird, werden die üblichen Bewerbungsdokumente verlangt (Arbeitserlaubnis, Ausweise, Zeugnisse, usw.) und es wird einem ein zeitlich begrenzter Vertrag angeboten, je nachdem, was mit dem Interviewer (der meist der direkte Vorgesetzte ist) vereinbart wurde.", "Interview Questions": "Es ist nicht schwer einen Platz zu bekommen, allerdings ist eine gute englische Aussprache von Vorteil, wobei Deutsch natürlich besser ist."}]]