[[{"date": "19 Jun 2023", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Very simple online background company is awful and takes forever finally got to start then u go through orientation Virtual and in person have to use shuttle’s to get there ect", "Interview Questions": "Tell us about you and accomplishment"}, {"date": "9 Jun 2023", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "2 levels of interviews were required at an ICU. First level was with the Clinical manager and Chief nurse and 2nd level was with 2 RNs. First level was more personal questions and why you wanted to be a Care partner. 2nd level of interview was more about maintaining Vanderbilt's work ethics and how you can contribute to their CREDO system (which is their policy of 5 pillars of work ethics)", "Interview Questions": "How can you contribute yourself to Vanderbilt and maintain their \"CREDO\" (which is the vanderbilt's pillars of work ethics)"}, {"date": "7 Jun 2023", "title": "Reserach assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "It was pretty easy and straight to the point. One interview and the professor was kind and explained what the position entails and what would be expected of me during my time at the job.", "Interview Questions": "How many years of experience do you have? Why this position?"}, {"date": "24 May 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "They asked about why I wanted to work at Vanderbilt. It is important to know someone who would want you to be part of their research team. In this way, your interview process is very simple and straightforward. They asked about your skills and interest.", "Interview Questions": "Why do you want to work at VUMC"}, {"date": "24 May 2023", "title": "Associate Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "Appointment was made on teams app, then I logged in the app and had the interview live audio and video. The interview then lasted about one hours with two managers", "Interview Questions": "What is your best achievement"}, {"date": "10 May 2023", "title": "MHT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Easy, informative and the managers were very willing to get to know you before hiring right away. It was a great process. They staff were very helpful and kind. This was the best interview I’ve ever had", "Interview Questions": "What is your previous experience?"}, {"date": "26 Mar 2023", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "They reached very quick. The interview was easy and professional very relaxed and described the job very well. I spoke with 2 different people who explained each step of the hiring and training process.", "Interview Questions": "Tell me how you have felt with a difficult coworker in the past."}, {"date": "6 Mar 2023", "title": "Registered Nurse PACU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center in Mar 2023", "Interview Descriptions": "This was a scheduled panel interview with manager and 2 clinical leads/instructors. You have an option to choose what type of interview. Did virtual interview via Microsoft Teams. Discussed what you are going to do with the position you are applying to.", "Interview Questions": "Do I have hospital experience and what I did at that hospital."}, {"date": "27 Feb 2023", "title": "Nurse Resident Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Pretty easy interview process. Once you complete the video interview and move onto the next step, it seems like they are trying to convince you to work there more than you are trying to convince them to hire you- there's a nursing shortage.", "Interview Questions": "What's an example of a time where you were faced with difficulty and how did you overcome it?"}, {"date": "26 Feb 2023", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Treated me with respect, seemed interested in my responses to questions asked, polite people. For lab positions, they detailed clearly what the job position entails and what a day on the job would look like.", "Interview Questions": "Where do you see yourself in five years?"}], [{"date": "23 Feb 2023", "title": "Assistant Director of Annual Giving and Stewardship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Their interview process is quite comprehensive ; after an initial screening interview with HR, you will meet with most members of your prospective team and applicable leaders within your prospective department", "Interview Questions": "What is your vision for this position and what do you bring to this position to meet that vision?"}, {"date": "21 Feb 2023", "title": "Real Estate Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Easy process with reasonable steps for hiring- not excessive interviewing. Generally a cal with internal recruiter and then meet with members of leadership on the team. Overall the process was quick and thorough.", "Interview Questions": "Very knowledge specific questions - almost like testing"}, {"date": "22 Feb 2023", "title": "Quality Review Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Feb 2023", "Interview Descriptions": "I was contacted via email to set up multiple Zoom interviews with different members of the team. The process took a couple of weeks. Everyone was nice and easy to work with.", "Interview Questions": "Talk about a time you worked with people different than you; how do you handle criticism; how would you describe your working style; how would your boss or coworkers describe you."}, {"date": "31 Jan 2023", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Interview consisted of both accounting related questions and personality fit. They also went over the job in detail which was appreciated. I was made an offer and accepted but contacted 2 days later and told they've decided to go with an internal candidate.", "Interview Questions": "Describe your experience with month end (what is done on each day) and how many days has close been with your most recent companies?"}, {"date": "24 Jan 2023", "title": "Clinical Research Coordinator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "The process was smooth and everyone I met during the process was friendly and very willing to answer my questions. The hiring manager made me feel comfortable and at ease at all points. The timeline was also clearly communicated to me and maintained.", "Interview Questions": "What skills do you have that would be beneficial to this role?"}, {"date": "27 Jan 2023", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "I met with multiple people (about 9) over a week throughout the process. Utilized a standard behavioral based question set. HR checked references (all very positive) and then I received a form rejection. Poor communication throughout the process.", "Interview Questions": "What was the job/result that I am most proud of."}, {"date": "6 Jan 2023", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "It takes a while to get an interview and the process can be long but once you are through the process, it is a great company to work for. I have worked there three times and the experience was always worth the wait. They look for the right fit.", "Interview Questions": "N/A"}, {"date": "14 Feb 2023", "title": "Assistant to the Chair Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2023", "Interview Descriptions": "Submitted my application on the VUMC careers website page. Received a phone call from the hiring manager three weeks later requesting a phone interview. Completed the phone interview and then was invited for a second interview in person a week later with two members of the administrative team for the department. After that interview was invited to a THIRD interview with the three physicians that this position would be supporting. Prior to the third interview was emailed a PDF containing information on the benefits available at VUMC along with another PDF explaining how their PTO program works. After both the second and third interviews was given an extensive tour of the area that this position would be working in and during both the second and third interviews, those that I was interviewing kept using the verbage \"you will be doing this\" \"you will be supporting these people\" \"This is where you will be sitting\". In an email that was received from one of the administrative staff members that I met with in the second interview she even stated that my skills and experience would allow me to be very successful in this position. One day after the third interview I received an email indicating that they wanted to obtain my references. VUMC uses an electronic reference service called Skill Survey. I was REQUIRED to provide FIVE references, two of which HAD to be either current or former managers. Hence I was very excited as normally reference checking is done prior to an offer for employment being extended. Thus I submitted the required information and sent the invitation to my references to fill out the form. I even ENSURED that they filled it out within twenty four hours as that is something that the Skill Survey notes in the summarized/aggregated report that is sent over to the hiring manager, how long it took your references to respond. The summarized report was sent late on a Thursday afternoon and by Monday afternoon I had not heard a word from the hiring manager and so I reached out to them. NOTHING, CRICKETS. Not happy at all, so I reached out to the person from the administrative staff that had emailed me previously and this person did respond to me. Unfortunately and quite shockingly they told me that I had STELLAR references, yet for some reason they saw the need to continue interviewing people and would be getting back to me in a couple of weeks?!! What in the heck?!! Had I known that they were not going to be offering me the job and were still interviewing people I would have NEVER provided my references, as it was a COMPLETE waste of my time and most importantly the people that I put down for my references time, and it was a bit embarrassing too, as I have NEVER heard of a company checking your references, having them come back great and then not offering you the job, but instead choosing to continue interviewing people. Absolutely ridiculous.", "Interview Questions": "What interests you about this position? Where do you see yourself in five years?"}, {"date": "18 Jan 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center in Jan 2023", "Interview Descriptions": "Had a voom interview. It was only supposed to be 15 minutes. I got in the interview and it was suppose to be two people but one had to go home and asked to texted when the interview was about to start. The other person never got on the interview. So she stated we would just continue with the interview. 45 mins later it was me asking all the question and the person interviewing me just talk about their personal life. At the very end of the interview I was told I was at a disadvantage cause the other person wasn’t on the meeting. If that was the case it should have been rescheduled and not continued with the inter for 45mins. Ridiculous. I even emailed the next morning asking if she would like to do another interview so the other person could be on it as well and never got a email back and didn’t know I wasn’t considered for the job until I actually logged on the companies website it’ll and it stated I wasn’t no longer under consideration. I wasn’t even given a chance.", "Interview Questions": "Was never asked interview questions."}, {"date": "28 Feb 2023", "title": "Patient Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Vanderbilt University Medical Center (Lebanon, TN) in Jan 2023", "Interview Descriptions": "The interview process was an in-person interview with the director, and it lasted about 30 minutes. At one point, someone joined the interview, but it was mainly with the director. She was nice and organized, which I appreciated. It was your average interview-style questions.", "Interview Questions": "What are your strengths and weaknesses?"}], [{"date": "20 Dec 2022", "title": "Research Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Some labs work with a recruiter to fill the position. Every position varies as far as interview process. One lab/PI required two interviews, half a dozen references, and a phone interview with my prior boss. In another I had one interview with the PI, then one interview with the lab members which was more of like a vibe check. Another lab just talked about experience and why I wanted to move to the city.", "Interview Questions": "Just had to talk about experience"}, {"date": "17 Dec 2022", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "If you have ever been apart of sorority recruitment/rush this process will be all to familiar to you. Not genuine, far too agreeable, and false promising. I felt like the interviewer were unprepared for my arrival and I felt like I showed up to a gathering uninvited.", "Interview Questions": "Tell us about yourself… more like dance jester dance hahahahhahaa 🤡"}, {"date": "21 Sept 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "Interview is situational based. Very thorough and scenario driven for specialty of interest. Personable and relatable. Interview consisted of mostly open ended questions with situational response driven answers. Overall great experience. ", "Interview Questions": "Describe a time when you were presented with a challenge?"}, {"date": "9 Sept 2022", "title": "Social Workers Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Two interviews via teams. Both interviews were group interviews with management and then with staff who are actively working in the hospital.  Pretty easy and straightforward. I had my interview within a week or so of applying. Overall pleasant experience.", "Interview Questions": "How do you handle stress? What is your learning style? "}, {"date": "25 Jul 2022", "title": "Community Development Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Short, but comprehensive interview process. They want to make sure you care about their cause and will fit into their team environment, as it is a very collaborative and supportive group.", "Interview Questions": "Do you have any non-profit or philanthropic experience?"}, {"date": "24 Jul 2022", "title": "Instructional Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "A lot of interviews via Zoom. The recruiter did not know anything about the position and called me thirty minutes late. Other interviewers were also late. They were overall offputting.", "Interview Questions": "They asked me about how I handle feedback"}, {"date": "20 Jul 2022", "title": "Nursing Care Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Detailed and lengthy interview process for Care Partner candidates. Extensive training and experience received is unmatched in my opinion and worth the rigorous process.\r\nRecruiter will contact for phone interview and schedule face-to-face if VUMC is interested in moving forward.", "Interview Questions": "Why are you interested in this position?"}, {"date": "5 Aug 2022", "title": "Clinical Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jul 2022", "Interview Descriptions": "I had a three-step interview process in which I met with the PI of the lab, a higher-up, then the director of the Cognitive center. It was very quick and smooth and they let me know either the day of or the day after if I would be proceeding with the next step.", "Interview Questions": "How do you deal with stress and what do you do when you are overwhelmed?"}, {"date": "18 Jun 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jun 2022", "Interview Descriptions": "It was a quick turn around time from the time I submitted my application. The interview was informative. I felt like the questions were directed at my goals more than my work experience.", "Interview Questions": "Why do you want to work for VUMC"}, {"date": "13 May 2022", "title": "Designer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "Good. It was lengthy but it went very well. I think it’s fine and u will do fine. Just research before and ask lots of detailed questions. I would use the HR person too.", "Interview Questions": "N/A"}], [{"date": "14 May 2022", "title": "PHP Applications Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Vanderbilt University Medical Center in May 2022", "Interview Descriptions": "Zoom interview for remote PHP role with VICTR department that lasted about 45 minutes. There were standard questions about my background and current role - nice chat with the interviewers. I was told at the end that there would be a take-home assessment. I was told to work on it when I can for a week or two and there would be a code review with me afterwards. I complete it and turn it in after spending a lot of hours on it. After a few days, I get a generic \"no longer a candidate\" email. No code review, no feedback on my performance, nothing. I asked for feedback and was ignored. If you are a developer, I wouldn't recommend applying at all.", "Interview Questions": "Tell me about your background."}, {"date": "5 Jun 2023", "title": "Nurse Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in May 2022", "Interview Descriptions": "Paper (online) application with resume and cover letter , video interview with five questions given ahead of time , real interview via zoom or Skype. Then selected from canadite pool for final offers. Then pre hiring screening begins.", "Interview Questions": "Typical nursing questions for interviews"}, {"date": "9 Apr 2022", "title": "Associate Patient Service Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "It was great. Manager was really nice. It was more of a conversation than a regular stale interview. Showed me around the clinic.  Got an offer basically the same day.", "Interview Questions": "What was your previous experience?"}, {"date": "14 May 2022", "title": "Statistical Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center in Apr 2022", "Interview Descriptions": "First submitted a resume. Then a zoom interview with the director. Last, a larger group interview with the team to show a day in the work life. It was easy to navigate and very transparent.", "Interview Questions": "What machine learning models are you familiar with"}, {"date": "25 Mar 2022", "title": "Nurse Residency Program Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Had us first answer recorder interview questions then put us with a specific floor to interview with, making it hard to see all of our opportunities that we could have chosen from. Interview questions itself were not difficult that were asked in the interview with the floor manager.", "Interview Questions": "Why did you choose nursing?"}, {"date": "8 Mar 2022", "title": "Host Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "It was a quick process; Interview was virtual because of Covid-19.  The recruiter asked me some basics “get to know you” questions and previous experiences. At most, it took 30 minutes for the full interview.", "Interview Questions": "What did I know about the company \r\nWhat questions did I have for them "}, {"date": "2 Mar 2022", "title": "Nurse Resident Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Bowling Green, KY) in Feb 2022", "Interview Descriptions": "I applied for the nurse residency program and then had an individual interview of an unit I was interested in. This interview was on Zoom. I talked to the unit manager about the floor I wanted to work on, and we talked about dynamics of the floor such as team work and collaboration.", "Interview Questions": "What interests you about the nurse resident program? What is a situation where you had to use critical thinking skills? "}, {"date": "25 Feb 2022", "title": "RN Resident Burn Unit Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Feb 2022", "Interview Descriptions": "It was virtual, and the interviewer was on time. She asked to introduce yourself, ask where you think you will be in 5-10 years, and why you chose nursing. She was very nice and answered all the questions that I had prepared.", "Interview Questions": "What made you choose nursing?"}, {"date": "17 Apr 2023", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Feb 2022", "Interview Descriptions": "Comfortable and thorough, the supervisor was very professional. I felt calm in the interview and that the questions asked were relevant to my role that I applied for. Overall, the interview was professional and made me feel calm.", "Interview Questions": "Explain a time when patient care was important to you."}, {"date": "16 Aug 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Feb 2022", "Interview Descriptions": "Three part interview The first one was a phone call the last two were zoom. Everything was pretty easy it did take a minute for them to reach out so be patient", "Interview Questions": "Why do you wanna work here"}], [{"date": "23 Jan 2022", "title": "Patient Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "It was great. Very enjoyable. Loved every minute of it. Best interview I've ever had. Very nice people. Great conversation and everyone was very kind.  Felt confident. It was a great interview with very very nice people.", "Interview Questions": "What's a good quality you have? "}, {"date": "24 Jan 2022", "title": "Medical Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Great! It was a great time and they did a great job, overall it was a pretty normal interview experience. That is really all that I have to say on the subject. Here is one more sentence.", "Interview Questions": "How was your day going?"}, {"date": "5 Jan 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Standard interviews, though the hiring manager was slow and uncommunicative during the process. At the end, I received a verbal offer. Then never heard from them again, even after I followed up. I'm still shocked by how unprofessional and inconsiderate they are.", "Interview Questions": "Why are you interested in this position?"}, {"date": "2 Jan 2022", "title": "IT Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "There was a phone call with HR, manager interview, product owner interview, and then one more conversation with HR to ask for reference check. It all went smoothly and quickly taking only 2-2.5 weeks with reference checks. Everyone was friendly and explained the role well.", "Interview Questions": "Why do you feel you are qualified for this role?"}, {"date": "22 Feb 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2022", "Interview Descriptions": "Zoom screening followed by job talk and full interviews. The full interviews take two days, meeting with the deparment chair and other faculty members in the department. People are nice.", "Interview Questions": "Could you talk about DEI effort in research?"}, {"date": "18 Dec 2021", "title": "MLT/MLS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Great process. Interview was accommodating and felt like I was already apart of the team. Answered every question I had. Smooth process. Heard back quickly. Seems like a great place to work", "Interview Questions": "How could you benefit the team"}, {"date": "12 Jan 2022", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Dec 2021", "Interview Descriptions": "I was contacted via email. we scheduled a phone call, and conducted the interview remotely over Teams. The department manager and a business analyst interviewed me. Both were super friendly and very professional.", "Interview Questions": "How long have you been a business analyst? Why are you leaving your current company? They described the day-to-day tasks and asked if I could perform the tasks and if I still found the job interesting ."}, {"date": "12 Nov 2021", "title": "SharePoint Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Vanderbilt University Medical Center (New York, NY)", "Interview Descriptions": "Was a good interview, the problem was no follow up at all.   They never followed up with me after the interview, even though I reached out to them on various occasions for an update.", "Interview Questions": "what was the tenant ID"}, {"date": "11 Nov 2021", "title": "Pharmacist Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "The interview process was organized and helpful with useful information. However, the entire process is lengthy and takes multiple weeks to complete from start to finish with scheduling, waiting, and limited days to select from.", "Interview Questions": "What are your strengths? What are your areas for improvement?"}, {"date": "4 Nov 2021", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "First round was a casual phone call with the supervisor, reviewing my resume. \nNext round was a zoom call with multiple managers and supervisors of that department. They asked preselected questions. \nThird round was a peer zoom call with the other social workers.", "Interview Questions": "Describe a time that something did not go as you expected, what did you do?"}], [{"date": "20 Aug 2021", "title": "Associate Applications Developer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Without phone screening, they asked for completing take home assignment. Then meet with multiple people over the interview and finally they asked for the reference. The reference was sent and after that no reply at all. Asked again, finally they said they are waiting for grant and not sure about the role.\n\nWhat a joke", "Interview Questions": "How You Handled A Difficult Situation at Work"}, {"date": "15 Jul 2022", "title": "Certified Surgical Technologist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Jacksonville, FL) in Aug 2021", "Interview Descriptions": "Applied for position, contacted by email for phone interview. Spoke with team coordinator. Was friendly and informative. Answer as many questions as were asked about previous skills and performance. Interview was followed up with a call from HR and then followed with offer letter.", "Interview Questions": "What’s your biggest weakness or fault. "}, {"date": "12 Jul 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Welcoming and generous. Felt appreciated during the interview/hiring process.  Responsive and flexible with scheduling as well. It was an overall positive experience and stress-free. Was oriented and given a tour to the place during that process.", "Interview Questions": "Why you want to join their lab"}, {"date": "1 Jul 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "The interview experience at Vanderbilt University Medical Center  was eventful and enriching. The faculty and students were welcoming and appreciated people from different backgrounds and with identities. The PhD program of the school was well defined.", "Interview Questions": "Explain your undergraduate and potential graduate research"}, {"date": "8 Jun 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Fairly short 30-minute interview with lots of questions that started off with \" Tell me about a time when___\". The interviews felt more like a conversation rather than an interview.", "Interview Questions": "Tell me about a time when a project didn't got the way you thought it would "}, {"date": "2 Jul 2021", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center in Jun 2021", "Interview Descriptions": "I applied online and then went through an interview process via video, you were asked 5 questions that were prerecorded and sent in. Then if you’re selected there is a 30 minute phone call/Zoom session (mine was with two individuals) to elaborate on your answers to questions and talk about the unit. The questions were typical of an interview and not too tricky, and the zoom was professional but relaxed and comfortable.", "Interview Questions": "Why do you want to be a nurse/why Vanderbilt\r\nTell me about a time you experienced conflict in the work place and how was it resolved"}, {"date": "29 Jul 2021", "title": "Senior Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Vanderbilt University Medical Center in Jun 2021", "Interview Descriptions": "One day after submitting online application, I received a request for an interview that day--30-minutes later. The initial interview went well and I had 7 more interviews, 4 of which were panel interviews, before being told I was entering the hiring process with 5 more final conversations with executive leadership. Once those final conversations were completed, I was told they were finalizing next steps. Two weeks later, I received a standard HR rejection letter which surprised and baffled me. The process took seven weeks from date of application.", "Interview Questions": "Behavioral questions like \"tell me about a time when\"..."}, {"date": "8 Feb 2022", "title": "Accounting Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jun 2021", "Interview Descriptions": "Excellent process that brought to light all things needed to make good decisions on both sides. Onboarding was equally well defined and executed. Seamless and profession in every way. An excellent organization with excellent processes and personnel.", "Interview Questions": "Standard questions that were very well presented and captured the essence of what was needed to make a determination"}, {"date": "10 May 2021", "title": "New Grad RN Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "It was a video interview where you could rerecord and a short 10 minute phone call. The questions were your typical why Vanderbilt. Hard time with a patient, most rewarding, where you want to work and why, etc", "Interview Questions": "Why you want to work there"}, {"date": "20 Apr 2022", "title": "Clinical Translational Research Coordinator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in May 2021", "Interview Descriptions": "Applied online, received an interview invitation about 2 weeks later. Only had one interview with the supervisor and current employee in the position I was interviewing for. The interview lasted about 30 minutes long.", "Interview Questions": "Asked basic questions such as why I wanted to work at VUMC and why I would excel in the position."}], [{"date": "26 Apr 2021", "title": "Associate Application Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Interview with researchers, discussing projects, skills preferred, and why certain skills are desired.\nMay be high level business needs to specific technical bottle necks due to limitations in background of the research team.", "Interview Questions": "Do you know any C++?"}, {"date": "28 Jun 2022", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2021", "Interview Descriptions": "Came to speak to my graduating cohort at school. Very pleasant time talking with them. They were open that new grad RN starting pay is $30.50 and differentials go up from there", "Interview Questions": "Came to speak to my graduating cohort at school. Very pleasant time talking with them. They were open that new grad RN starting pay is $30.50 and differentials go up from there."}, {"date": "23 Mar 2021", "title": "Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "I had two interviews with them. Never heard back either way. I found that unprofessional, it is not hard to inform applicants what the outcome was when they have taken time out of their day to speak with you.", "Interview Questions": "Why I was a good fit"}, {"date": "9 May 2023", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Mar 2021", "Interview Descriptions": "Depends on how desperate they are they will take anyone. Several rounds but easy. Very nice people. 1 day work from home when other departments are fully remote. This may be a deal breaker.", "Interview Questions": "How do you work in an environment with minimal supervision."}, {"date": "29 Oct 2021", "title": "Application Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Mar 2021", "Interview Descriptions": "Screening interview with HR then three video calls with dept manager, direct manager and panel interview with direct coworkers. Informal conversations. Pretty pleasant. Didn't hear anything back for about a month so I had mostly assumed I didn't get the job. \n\nOverly arduous background check and reference check. They asked for 5 references (3 bosses) and background check turned up long forgotten citations from the 90s.", "Interview Questions": "Open-ended hobby and personality related questions. Demonstrate some software usage. "}, {"date": "8 Apr 2022", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center in Feb 2021", "Interview Descriptions": "It was a multi step interview with the first step being a video taped interview that you sent in and then you have a one on one interview with the unit manager.", "Interview Questions": "Near miss\r\n\r\nWhen did you advocate for your patient "}, {"date": "21 Apr 2021", "title": "Clinical Supply Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Feb 2021", "Interview Descriptions": "Two Coordinators interviewed me. They seemed very responsive so brought in the Supervisor to ask additional questions. They were all very professional but not intimidating which was very nice. I was really hopeful but didn't get the job.", "Interview Questions": "If we talked to your previous employer, what are some good things they would say about you?"}, {"date": "18 Jan 2021", "title": "Junior Applications Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Overall felt disorganized and unprofessional.\n\nI initially applied in November and on two separate occasions was ghosted then contacted a month later asking if I was still interested.\n\nThe person contacting me did not want to set up a formal interview and only chose to communicate via email despite me asking for something more efficient/formal.\n\nWanted me to send some personal coding projects then promptly ghosted me (yet again) after she had trouble running the code due to an issue on her end that was out of my control.\n\nComplete joke and waste of time.", "Interview Questions": "Are you still interested in the position? "}, {"date": "28 Oct 2020", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center in Oct 2020", "Interview Descriptions": "First I received an email asking for an interview. I then set up a time to meet. Because of COVID, we met through Zoom.  A few days later, my references were checked.", "Interview Questions": "Tell me about yourself?\nWhat is your experience with softwares?"}, {"date": "28 Sept 2020", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "The Interview process is not difficult. I met with the Director it was overall an average experience. I received a job offer in about a month. The onboarding process can be time-consuming.", "Interview Questions": "What is your management style"}], [{"date": "22 Sept 2020", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "It was very situation oriented. Lots of questions. Lots of brain picking. I definitely suggest preparing before by thinking through specific clinical examples (questions were centered on team work, conflict, safety, resources, personal skills, why vanderbilt and why the specific unit)", "Interview Questions": "Q. Describe a situation when you feared for the safety of a patient or coworker. "}, {"date": "11 Oct 2020", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center in Sept 2020", "Interview Descriptions": "I received an email after applying and had an interview the following week. I was then contacted the next week and had another interview that same week. I was not contacted about being declined an offer. I had to check the online portal.", "Interview Questions": "Why are you interested in this position?"}, {"date": "17 Aug 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Interview process lasted thirty minutes. Lab manager asked basic questions about my future plans, strengths, experience with computers. Job description was vague so I just came prepped with basic questions about schedule, day to day tasked, etc.", "Interview Questions": "What are your future plans?"}, {"date": "14 Oct 2020", "title": "Sr. Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Aug 2020", "Interview Descriptions": "I have made it the last round twice. Each department is different.\n\nFirst time\nRound 1 - Phone Screening/ Recruiter\nRound 2 - In-person interview with administrative staff of department\nRound 3 - Zoom calls with four directors\nRound 4 - In-person interview with four directors\n\nSecond Time\nRound 1 - Phone interview with Director for the department\nRound 2- In- person interview with two managers and two admin staff", "Interview Questions": "Where do you see yourself in 5 years?\n"}, {"date": "24 Sept 2020", "title": "Research Projects Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vanderbilt University Medical Center in Aug 2020", "Interview Descriptions": "I applied online. The application was lengthy and was basically a substitution for a phone screen. After about two weeks, I got invited by a recruiter via email to do a 1:1 interview with who would be my direct supervisor. After a week or so, the recruiter asked me to schedule a second round of interviews consisting of 1-on-1 30 minute conversations with 5 people from across the department, including an assistant director, project managers, and people in the position I was applying for. Most of the questions were personality related. Everyone was extremely friendly and only had genuinely nice things to say about VICTR;  I could tell that it would be a wonderful team to be a part of. Two days after that, I asked the recruiter what the next steps would be and she said that they were currently still in the interview phase, but I should receive a rejection or offer by email. (With no specific time frame) However, 3 weeks went by and I hadn't heard back, so I contacted one of the people I interviewed with her to reiterate my interest. I didn't receive a response from her, but about two days later I got the rejection email from the recruiter. All in all it was a good experience and I'm disappointed it didn't work out. My only complaints are: A) some of the interviewers had little to no experience with interviewing people and B) I wish they hadn't left me hanging so long.", "Interview Questions": "So tell us about yourself."}, {"date": "3 Sept 2020", "title": "Lead health data coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Aug 2020", "Interview Descriptions": "The interview process was very smooth. I applied on 8/06/20 and I was called for an interview on 8/19/20.  The hiring manager told me that it would be about two and a half weeks before I would hear anything. I was contacted by HR on 8/31/20 with my offer.", "Interview Questions": "Name a time where you had to deal with something that was difficult. How did you handle it and what was the outcome?"}, {"date": "14 Jul 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Group interview. Probably 5 staff and myself sitting at a round table. They went around the room each asking their questions. It almost appeared that they were not interested in being there as if they already  made a selection/knew who they were going to select.", "Interview Questions": "Very long specific situational questions..."}, {"date": "16 Sept 2020", "title": "Senior Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jun 2020", "Interview Descriptions": "Got an email about an interview and scheduled about a week later. Heard back 3 months later for a second interview. Assuming it took longer because of COVID. Have not done the second interview, During the first it was a panel interview with other doctors and admin assistants.", "Interview Questions": "What is a time where you had a negative situation with a coworker and how did you handle it? "}, {"date": "11 Aug 2021", "title": "Mental Health Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Vanderbilt University Medical Center in May 2020", "Interview Descriptions": "Interviewed twice they were always late. For it to be a professional career job didn’t get back to you if they didn’t think you fit the job description. Just leave you hanging no feedback.", "Interview Questions": "Why choose Vanderbilt as a option? "}, {"date": "23 Jan 2022", "title": "Associate Patient Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in May 2020", "Interview Descriptions": "I felt very comfortable. We discussed what the job would entail. The interviewer gave a very descriptive and detailed job description.  In conclusion, it was a very pleasant interview experience.", "Interview Questions": "What are your strengths and weakness? "}], [{"date": "29 Apr 2020", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2020", "Interview Descriptions": "I received an email interview where I sent back my responses by email, then next step was video interview with two managers, then few days later video interviewed with two more people.", "Interview Questions": "Have you ever dealt with a coworker that you didn’t get along with and how did you handle it?"}, {"date": "8 Sept 2020", "title": "Nursing Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Mar 2020", "Interview Descriptions": "One on one with the unit manager in a conference room and then a tour of the unit. It took about 1 hour from start to finish. It was very informal and she told me there was no reason to be nervous as it was going to be very informal.", "Interview Questions": "Why do I want to work at VUMC"}, {"date": "14 Feb 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "It depends on the department you're interviewing with - mine happened to be on the more casual side. Definitely review some of their recent publications and have questions prepared on their research.", "Interview Questions": "Tell me about yourself. "}, {"date": "11 Feb 2020", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Phone screen, phone interview with MD that was very enthusiastic, then in person interview to meet team and tour facility.  I was told I was a great fit. After a week no formal rejection message, only a vague response to wish me luck. Vanderbilt likes to amass a large pool of candidates to boost their ego, I later found out they chose someone with a connection to another MD that worked there, so they probably never planned on hiring anyone else. Felt like a waste of time. It is still a good place to start out, but it is better to know from the start that they are known to do this.", "Interview Questions": "Tell me about your work history. Why do you want to work with us? "}, {"date": "23 Jun 2022", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Vanderbilt University Medical Center in Feb 2020", "Interview Descriptions": "Interviewer was very personable. I was interviewed during the pandemic so although we were social distancing and wearing masks, I felt comfortable. The questions were straight forward and general. I was most impressed by being asked about my career goals as growth is important to me with any job.", "Interview Questions": "Where do you see yourself in the next year?"}, {"date": "7 Oct 2021", "title": "Social Worker (BSW) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2020", "Interview Descriptions": "1st virtual via zoom, with two social workers, both asked questions\n2nd in-person, social workers, clinic manager\nThe first interview took place via Zoom, and two social workers asked me questions. I had applied to the position the week prior and I got the call for the interview that very next week. The second interview was in person at the Children's Hospital and this interview was done by multiple social workers and the clinic manager.", "Interview Questions": "Tell me about your prior experience?"}, {"date": "12 Jul 2022", "title": "Licensed Practical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2020", "Interview Descriptions": "It was brief. She asked me a couple of questions, I responded with the right answers and was hired. I don't know what this new NM is like. It was me and the NM at the time. She obviously trying  to fill her positions quickly.", "Interview Questions": "Standard behavioral what would you do in this situation style questions."}, {"date": "4 Apr 2020", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Vanderbilt University Medical Center in Dec 2019", "Interview Descriptions": "Was contacted 2 days after applying, spoke with HR before my interview about benefits and other details about the job. Had a phone interview and was given an official offer 2 days later.", "Interview Questions": "Describe a time when you said something you shouldn’t have to a patient. "}, {"date": "27 Nov 2019", "title": "Associate Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "The interview process was very detailed. I meet with individuals in the role i was currently applying for and upper management, all in one day.  After that was complete i was called back for a second interview with faculty.", "Interview Questions": "strengths/weaknesses, previous experience"}, {"date": "9 Sept 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "The interview process was easy. I received an email setting up the interview. Met with two HR ladies and was asked standard interview questions.Usually there would have been a second interview but both decided against it and offered me the position after the first interview.", "Interview Questions": "N/A"}], [{"date": "13 May 2021", "title": "Assistant Program Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Sept 2019", "Interview Descriptions": "The interview process was well organized and very efficient. I was able to meet multiple people while I was there and I felt as if all of my questions were answered. The overall interview process was much quicker than I expected from such a large company as well.", "Interview Questions": "What quality do you think qualifies you most for this position"}, {"date": "12 Aug 2019", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Hour long interview. All were friendly and made me feel at-ease. It took about 2 weeks from the time I applied online to receive an on-site interview. I haven't heard anything back yet, but I feel like they truly asked the right questions to understand what kind of employee I would be.", "Interview Questions": "Experience"}, {"date": "19 Jul 2019", "title": "Audiologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "The interview process included an initial online screening about background and interest and was followed up with a phone call and in person interview. The interview process was fair and timely.", "Interview Questions": "Asked about interests, teamwork, VUMC, and strengths."}, {"date": "25 Jun 2021", "title": "Mental Health Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jul 2019", "Interview Descriptions": "I had a friend who was able to put in a word with their recruiter. I was then invited to a recruiting event where the interview took place. It was pretty quick and easy.", "Interview Questions": "They asked about my previous experience"}, {"date": "27 Jun 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "It was an easy interview process. The interviewer spoke the majority of the interview and only asked a few questions. She was very nice though and made it a comfortable experience.", "Interview Questions": "When was one time you made a mistake?"}, {"date": "25 Jul 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jun 2019", "Interview Descriptions": "I was contacted through email about going through a phone screening as my profile matched what they were looking for. During the phone screening, they asked me about my research experience, went through my background and education, and asked me about relocating and a projected start date. The next day, they got back to me about scheduling a video interview within the next week. During that interview, it was a panel of the three people I would be working closest with, and it was mostly entry level questions. It was a back and forth conversation, and lasted around 40 minutes. They said that they would get back to me within a week, and they got to me the next Monday about offering to hire me (interview was Thursday). From then, it was about three weeks later that I received an official offer from the hiring manager because they were away.", "Interview Questions": "Why do you want to go into clinical research?"}, {"date": "16 Jul 2019", "title": "Exercise Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jun 2019", "Interview Descriptions": "Lengthy online questionnaire, easy phone interview, once they told me what my expected pay would be I had to decline. Not worth pursuing the job IMO.  Doesn’t pay competitively and benefits are pretty standard.", "Interview Questions": "Explain a time when you worked with a difficult patient and how you resolved it"}, {"date": "28 Nov 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in May 2019", "Interview Descriptions": "I was called by the recruiter and a phone interview was setup with HR. I then had an in-person interview with several people/departments. Overall it was a good experience.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "13 Mar 2019", "title": "Nurse Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "After filling out my application, an interview was scheduled with me within 2-3 weeks. The whole application/interview process was very well organized. Communication was quick and concise. You will be interviewed by managers, nurses, etc. from the area you are interviewing for. I think this is good, but if you don't get an offer from that specific track, then you are out of luck. My best advice if you really want to work at Vandy is to pick a track like acute care/med-surg where there will likely be more positions open. I also wish that the people interviewing me could have been the ones to follow up, and at least provided some feedback. I thought the interview went very well, so I would have liked to have known their reasoning if possible.", "Interview Questions": "\"Tell us about a time when you noticed a patient needed immediate nursing intervention. What did you do, and what was the outcome?"}, {"date": "17 Dec 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Mar 2019", "Interview Descriptions": "Phone interview, very serious, but they also cared a lot about getting to know me. Asked about clinical experience and what type of department I was currently working in", "Interview Questions": "What is an experience you have had in practice and how did you handle it? "}], [{"date": "19 Feb 2019", "title": "Associate Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "I interviewed with my current manager and then sat and spoke to her manager. I also got a chance to sit and chat with some of the people I work with now. Took a tour of the facility.", "Interview Questions": "What are some obstacles you had to over come in your last job?"}, {"date": "19 Feb 2019", "title": "Licensed Practical Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Los Angeles, CA) in Feb 2019", "Interview Descriptions": "I was currently in the process of moving from CA to TN, I had an interview with Pediatrics GI, Heptalogy and Nutrition Department. Since I am located in  California still they were able to do a Skype Interview. I was a great experience, the interviewers were so kind and it felt like I knew them forever. They seemed very passionate about their department. We talked on Skype for about 45 mins,  When I got the bid for the position I had the weekend to think it over and discuss it with my Husband, We came to the conclusion that we were taking a loss and it wasnt going to be a beneficial move for us. I checked in with the hiring manager to see if we were able to negotiate the cost, unfortunately they are firm on their offers. I was not able to negotiate the salary. I respectfully declined the offer.", "Interview Questions": "Three adjectives you would use to describe yourself, Three adjectives your coworkers would use to describe you , Three adjectives your managers would use to describe you. "}, {"date": "13 Dec 2018", "title": "Inpatient Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Dec 2018", "Interview Descriptions": "I had a phone interview, she was very polite and professional. I really enjoyed the interview. She was very informative and kind. I was left feeling very comfortable about the process and possibilities.", "Interview Questions": "Name a time you had to critique a co-worker and how they took it?"}, {"date": "14 Sept 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "First you get a phone screen then if you pass that well you will be invited for an in-site visit. Normally interview takes about half a day and you get chance to share your story with different people from that specific department. You will be asked some behavioral and specific scientific questions.", "Interview Questions": "Tell me about your background"}, {"date": "12 Sept 2018", "title": "Business Intelligence Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "two rounds  - behavioral and technical.\r\n\r\nFirstly, you would have a conversation with the HR and managers where they ask more about the behavioral and previous work experience and some of the best projects you worked on and if you are proud of those.", "Interview Questions": "SQL questions and what is success? and some Tableau related question"}, {"date": "28 Aug 2018", "title": "Administrative Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "Very lengthy, detailed questions inquiring on your experience and fit with the program. 8-10 different interviewers, many of which asked the same questions. Some are behavioral and some are more open-ended standard interview questions.", "Interview Questions": "Tell me about your work history."}, {"date": "7 Sept 2018", "title": "Patient Service Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Aug 2018", "Interview Descriptions": "Average interview, asked behavioral questions. They were friendly, made tou feel comfortable. They were honest about working there. They list the pros and cons about working in the area.", "Interview Questions": "Tell us about yourself "}, {"date": "7 Jul 2019", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jul 2018", "Interview Descriptions": "The full extent of my responsibilities was kept from me during the interview.  It was not until the second day on the job that it was revealed I would also be taking on the duties of an outgoing administrative assistant temporarily as they looked for a replacement.  This lasted for three months!", "Interview Questions": "The usual questions: Why am I looking for another opportunity?  Why Vanderbilt?  What was a challenging workplace situation and how did I resolve the matter?"}, {"date": "24 Apr 2019", "title": "BIA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in May 2018", "Interview Descriptions": "It was a lengthy interview but mostly nontechnical questions. It was not about skills but mostly about the personality of the candidate. As long as you are confident and friendly, you will have a higher chance of getting hired.", "Interview Questions": "Why Vanderbilt?"}, {"date": "13 May 2018", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in May 2018", "Interview Descriptions": "An HR representative sets up a screening phone interview. If she thinks you may be a fit she sends your CV to the hiring Director who then sets up an interview.", "Interview Questions": "Tell me about your work experience. "}], [{"date": "10 May 2018", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2018", "Interview Descriptions": "Met with three physicians plus inpatient team I would like to join. Was escorted (so nice!!) by office members as I would never have found individual offices on my own.", "Interview Questions": "Expectations for employment time commitment, amount of experience in the field"}, {"date": "26 Mar 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Received a telephone interview (a basic employee screening) a couple weeks after submitting my resume. Then received an in person interview the next week. The process was easy and smooth.", "Interview Questions": "Questions were to be expected from an interview. "}, {"date": "30 May 2019", "title": "Health Policy Analyst II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center in Mar 2018", "Interview Descriptions": "Interview process was fairly standard. I had a phone call with the manager, and Skype interviews with two faculty members and one analyst. Questions were mostly about my background and behavioral. Most of the people I interviewed with already knew of my experience, and so the process was fairly straightforward.", "Interview Questions": "Tell us about an analytic project you have worked on focusing on the technical aspects"}, {"date": "16 Feb 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "I interviewed at 9 am that morning, and received an email that evening that I was the leading candidate and they wanted to move forward. After checking my references  the total process was a bout 1 week and half", "Interview Questions": "What was my experience with calendar management"}, {"date": "24 Sept 2020", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Feb 2018", "Interview Descriptions": "Interviewed by 5 panels: 1- with would-be peers, 2- would-be direct reports, 3- key stakeholders (other nurse leaders),  4- the CNO, and 5- my future boss. ~Six situational targeted selection questions at each, looking for situation, action, and result.", "Interview Questions": "What was a change you were asked to make that you didn't agree with and how did you handle it?"}, {"date": "15 Sept 2018", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2018", "Interview Descriptions": "1 round. 1 in person interview with whole team. Panel of 3-5 people. Hard to find parking. Make sure you show up early. Very basic interview questions. Not hard at all. Looking for fresh graduates with limited experience.", "Interview Questions": "What are your greatest strengths and weaknesses?"}, {"date": "8 Dec 2017", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Vanderbilt University Medical Center (Goodlettsville, TN) in Dec 2017", "Interview Descriptions": "Interviewed with two managers, very laid back environment. Questions were fairly easy. Once the interview was over, I was shown the pharmacy and how a typical work day goes. Interviewed on a Friday and accepted the job offer on a Tuesday.", "Interview Questions": "How well do I handle conflicts in the work place?"}, {"date": "22 Dec 2017", "title": "Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Dec 2017", "Interview Descriptions": "The interview process consisted of multiple groups from various disciplines (i.e. Managers from other departments, staff nurses, providers affiliated with the department and nursing administration.) The Interviews are established based on the Targeted Selection model and behavioral based questions.", "Interview Questions": "Describe a project in which you did not see eye to eye with your peer and how did you go about reaching a final conclusion or outcome "}, {"date": "22 Jan 2018", "title": "Surgery Scheduler Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Dec 2017", "Interview Descriptions": "Panel of management and physicians, mostly situational questions, very informal and personable interview, lengthy interviews and a very long process from the date you apply to the date of offer,", "Interview Questions": "Why Vanderbilt? "}, {"date": "4 Jan 2018", "title": "Registered Nurse II Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Nov 2017", "Interview Descriptions": "Had to interview in person 3 times, coming in out of state. staff was not considerate of time spent on traveling for these interviews. they need to consolidate interviews, otherwise should offer phone or skype interviews.", "Interview Questions": "what was a specific time you had to deal with difficult patients, and how did you resolve the problem"}], [{"date": "6 Oct 2017", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Tallahassee, FL) in Oct 2017", "Interview Descriptions": "very easy, comfortable setting. Interviewers had their questions but I was prepared with my answers. I spent alot of time defining my goals before the interview - something I recommend all to do", "Interview Questions": "Tell us why you want to work here"}, {"date": "13 Dec 2017", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Oct 2017", "Interview Descriptions": "The two people who interviewed me were hilarious and so easy to talk to. They made me feel very comfortable. It was the unit manager and the nurse educator. I interviewed for a pediatric unit.", "Interview Questions": "Why Vanderbilt?"}, {"date": "18 Oct 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Oct 2017", "Interview Descriptions": "The Human Resources team and nurse recruiters contacted me and set up and interview with the nurse managers of the unit shortly thereafter. I interviewed with two nurse managers from my department in a relaxed and comfortable environment.", "Interview Questions": "Tell us a time that you experienced conflict with a coworker and how did you mitigate the conflict."}, {"date": "27 Sept 2017", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Try to match you with an individual professor or team leader, so that you could start working right after you begin your PhD study.  Lunch with Dean and dinner with current students. Very fun!", "Interview Questions": "Research experience, how to tackle problem"}, {"date": "9 Sept 2017", "title": "Nurse Resident Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "Panel Interview. Interviewers remained professional yet made me still feel comfortable.  Residency program sent PowerPoint explaining the interview beforehand and the interview stayed true to outline on PowerPoint. Be able to present clinical experiences.", "Interview Questions": "Why  did you choose Vanderbilt?"}, {"date": "8 Sept 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "I felt that the interviewer was friendly and encouraging. The interview setting was comfortable and the atmosphere was very relaxed. Everyone I came in contact with at the facility welcomed me with open arms.", "Interview Questions": "Why do you want to work at Vanderbilt?"}, {"date": "20 Dec 2017", "title": "Physician, Hematology/Oncology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 12 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Sept 2017", "Interview Descriptions": "It was good. Easy and straightforward- great administrative assistants to help you navigate you through the process. Easy to follow and everyone is so nice and friendly! Beautiful city too and everyone is cordial and nice", "Interview Questions": "They asked about my prior research experience "}, {"date": "31 Dec 2017", "title": "Data Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center in Sept 2017", "Interview Descriptions": "Initial phone interview with recruiter with potential in-person interview. Hourly range was lower then current wage but recruiter did let me know they would discuss with hiring manager. The recruiter said if the hiring manager was willing to negotiate for experience, they would follow up for in-person interview. However, this was not the case so  I only had a phone interview.", "Interview Questions": "How many years of experience do you have  inputting healthcare data?"}, {"date": "15 Oct 2017", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Sept 2017", "Interview Descriptions": "Easy process. Was initially invited to an interview with the Database Administrator. We spoke for about an hour, describing the database and what it does, the position, and my previous employment. Was told I would be contacted the next week, and did not hear anything for almost two weeks.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "12 Aug 2017", "title": "Learning Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jul 2017", "Interview Descriptions": "The interview process was quite long and excessive for the most part. It started with a phone screen and after about five (5) weeks of waiting, I get a call out of the blue to do a phone interview. About a week elapsed after that and then a little more than an hour later was invited in for a face-to-face interview round robin.\r\n\r\nThe interview in person lasted close to four (4) hours. The feedback they provided was very positive (well, so it was thought). It included meeting with everyone in the department and everyone seemed positive with the answers provided and the truths provided. It also included a presentation which was completed in the allotted time with all required specifications.\r\n\r\nThen after that, crickets for about three (3) weeks. Shortly after that, at about 7pm mind you, I was rejected. NO FEEDBACK WAS PROVIDED WHY AND NONE WILL EVER BE GIVEN BECAUSE THEY USED CANNED EMAILS JUST TO GET YOU OUT OF THEIR WAY!!!\r\n\r\nI wish they were more upfront and honest about the interview process and provided constructive feedback when it was asked. It was unprofessional to lead me to believe that I had a great interview only to find out that the materials provided likely were just thrown away. \r\n\r\nAlso, because I DO NOT HAVE CAPTIVATE, it was a likely another reason to reject. You can't download a trial every time you interview just for the sake of it when funds are tight otherwise.", "Interview Questions": "Please create a 15-minute presentation on how to balance a checkbook. They prefer "}], [{"date": "27 May 2021", "title": "Customer Service Representative (CSR) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jul 2017", "Interview Descriptions": "Two part interview. First was with multiple people in multiple departments, to see where the candidate might fit in best, second was with the direct hiring managers who were interested.", "Interview Questions": "Standard interview questions about former employment history, experience, and what hobbies you have outside of work."}, {"date": "30 Jun 2017", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jun 2017", "Interview Descriptions": "First there is a phone interview, which was very positive.  You feel like you're talking to a friend you have known for a long time.  Next they send you an online assessment to be sure you are suited to the job.  After you pass, you are offered an in-person interview.  I did a background check also.  I received an offer the same day I interviewed, which really made me feel invaluable.  I am looking forward to working for a world renowned medical corporation.", "Interview Questions": "How many years of experience do you have for this type of work, which is customer and patient related?"}, {"date": "4 Dec 2017", "title": "Medical Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jun 2017", "Interview Descriptions": "Very informal. My hiring manager was eating lunch when I arrived and during the interview. She was quick to find a list of jobs for me and offered me the position.", "Interview Questions": "What makes you unique?"}, {"date": "18 May 2017", "title": "Data Collector Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "1 interview with two managers, 1 hour, discussed my fit in terms of immediate needs of the project, and my long term career goals, tested language abilities, asked a lot of questions of my own", "Interview Questions": "Why are you prepared for this job?"}, {"date": "12 May 2017", "title": "Observation Unit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "Questions on various scenarios with patients and coworkers. Example: How would you handle a situation with a difficult patient? \r\n\r\nAsked a lot of scenario questions about emergency situations. And he sure to ask questions about how to advance within the organization. Vanderbilt is huge about their Magnet Status, as well.", "Interview Questions": "If you have a disagreement with a coworker, how would you try to resolve the issue? "}, {"date": "9 Aug 2021", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in May 2017", "Interview Descriptions": "Multiple pages of questions with multiple people. Lengthy and very in depth about your clinical knowledge. Basically you are back in school. Slightly intimidating how much info you have to give them.", "Interview Questions": "Page and 1/2 of clinical questions. 2 pages of interview questions. List the blood flow "}, {"date": "19 Jun 2019", "title": "MHS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2017", "Interview Descriptions": "It consist of a phone interview and then a face to face with the manager. We were asked questions about past work experiences and warned of the sometimes difficult nature of working in a psychiatric hospital.", "Interview Questions": "Describe a situation where you overcome conflict in the workplace."}, {"date": "29 Apr 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2017", "Interview Descriptions": "There was an initial online application followed by a supplemental application with a due date.  I was kept informed throughout the entire process. Interview was a panel with five people based mostly on behavioral questions.", "Interview Questions": "Tell us about yourself and why you'd like to work here."}, {"date": "22 Jan 2018", "title": "Neonate Pediatric Transport Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2017", "Interview Descriptions": "A phone call to verify things and get to know the supervisor. Then an interview with the supervisor and other leadership. A second interview with others from the same department.", "Interview Questions": "What was a time that you had conflict and how did you deal with it?"}, {"date": "7 Mar 2017", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "Begins with HR process online, then a phone screening from HR and finally a phone interview. From there I was brought in for a panel interview the next week. Usually takes one-two weeks total.", "Interview Questions": "What is your dream job? "}], [{"date": "4 Jun 2019", "title": "Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Mar 2017", "Interview Descriptions": "I submitted my application and was called a week later.  We set up an interview and I was offered the job that day.  I then started the job 3 weeks later due to personal reasons.", "Interview Questions": "Name a time that you have used your skills to over come something. "}, {"date": "9 Oct 2018", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Dec 2016", "Interview Descriptions": "I had 4 different interviews spread out across 3 months. It was a long process with very little information about the next steps or when a decision might be made.", "Interview Questions": "Why did I want to work at Vanderbilt?"}, {"date": "30 Dec 2016", "title": "Biostatistician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (New York, NY) in Dec 2016", "Interview Descriptions": "I applied online and two weeks later received an email from HR asking me to fill out a questionnaire about past experience. Two weeks later received an email to have a phone interview. Brief introduction followed by a series scenario questions to test statistical knowledge. Some general questions were asked at the end of the interview.", "Interview Questions": "How would you interpret the result of a logistic regression to your collaborator?"}, {"date": "5 May 2017", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Dec 2016", "Interview Descriptions": "I applied online on Vanderbilt Medical Centre Career site. The process took 3+ months. I was contacted by the recruiter and a interview with the hiring manager was set up. The recruiter and manager I spoke to were very friendly.", "Interview Questions": "Difference between Business Intelligence and Business Analysis? What do you like the most?"}, {"date": "17 Nov 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Just basic questions. I had two 1:1's and then a small group interview. Nice people, but definitely not used to interviewing people: Why us? What would your former boss say about you? What is your greatest strength and weakness?", "Interview Questions": "Are you organized?"}, {"date": "29 Sept 2017", "title": "Mental Health Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Nov 2016", "Interview Descriptions": "Poor, judgemental, and bias. It was made clear during the hiring process that my degrees would not be utilized. However, I needed the job and benefits.\r\n\r\nInterviewers were unfriendly and not involved in the day-to-day operations of the position.", "Interview Questions": "N/A"}, {"date": "13 Jul 2019", "title": "Charge Integrity Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Oct 2016", "Interview Descriptions": "The interview process was okay I met with the Assistant Director and two other ladies in the department.  One of the ladies during the interview did not ask any questions overall the interview was basic and I was not asked any unusual questions,", "Interview Questions": "My experience and background in healthcare."}, {"date": "17 Oct 2016", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Oct 2016", "Interview Descriptions": "I applied online for Nurse Residency Program. I chose a track but was not selected for the one I chose but given another option. Dates for interview times were sent and I replied back with when I would chose to come in. The interview was a panel of 3 people some on the units I was interviewing for and some were not. Questions were all situational based. Want specific clinical examples related to things like patient satisfaction, teamwork, and decision making.", "Interview Questions": "How did you handle a situation about a patient where you had to make a difficult decision or change"}, {"date": "14 Sept 2016", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "I interviewed with 2 Charge Nurses and 1 RN in a laid back atmosphere. One of the charge nurses ended up being my manager once I was hired. It was helpful that she had been in on the interview process.", "Interview Questions": "What makes you want to work here?"}, {"date": "9 Sept 2016", "title": "Product Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Not too bad.  Standard questions.  Interviewed with several members of the team.  Laid back conversational style.  No Panel Interview.  Lasted about 4 hours altogether.  Asked about background and skills.", "Interview Questions": "Why do you want to work at Vanderbilt?"}], [{"date": "24 Dec 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (New York, NY) in Sept 2016", "Interview Descriptions": "Received call for interview, came in the next day, was hired shortly after. Manager was very blunt during the interview process and had extremely high expectations. I did not expect to get the job, as I did not feel that I lived up to the expectations of the manager. However, I was given the opportunity in spite of all of this.", "Interview Questions": "What are you going to do for me?"}, {"date": "3 Mar 2020", "title": "Database Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Sept 2016", "Interview Descriptions": "Got a 1st round HR interview through phone. After a week I met the team for a Technical interview which lasted for an hour and 2 weeks later, I got a call from the employer the job was confirmed and the salary and processing were discussed.", "Interview Questions": "How do you use joins in SQL?"}, {"date": "9 Aug 2017", "title": "Medical Records Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Sept 2016", "Interview Descriptions": "My interview took place at the Grassmere location.  There were three coordinators that conducted the interview.  The interview was conversational and took about an hour.  They were very friendly and keep the conversation going.", "Interview Questions": "Are you planning on staying here for the full year long contract term?"}, {"date": "19 Mar 2017", "title": "Payer Relations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Sept 2016", "Interview Descriptions": "Applied on line. Contacted by HR and had an additional phone interview with Director.  They were more than flexible with my schedule for interviewing. The interview lasted about 45 minutes to an hour.", "Interview Questions": "Tell me about yourself?  How would you handle a disagreement with a payer?"}, {"date": "3 May 2019", "title": "Ophthalmic Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Sept 2016", "Interview Descriptions": "Hiring process took forever! It was 3 months before HR got ahold of me to schedule an interview. There was no skills assessment. The pay rate offered was based on what I was earning at my last employer.", "Interview Questions": "They asked if I could perform tonometry (duh)."}, {"date": "22 Dec 2016", "title": "Nuclear Medicine Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Vanderbilt University Medical Center (New York, NY) in Aug 2016", "Interview Descriptions": "The interview process at Vanderbilt University Medical Center was an in person and formal setting. The interview was with the head of the department who asked a series of multiple questions to learn who I was beyond my resume and cover letter.", "Interview Questions": "What is your five-year plan?"}, {"date": "12 Nov 2017", "title": "Student Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Aug 2016", "Interview Descriptions": "The interview process was pretty easy and relatively straight forward. I only interviewed with one person and was offered the job on the spot. I started a few weeks after.", "Interview Questions": "Tell me about yourself"}, {"date": "20 Aug 2018", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jul 2016", "Interview Descriptions": "No interview; had informal meeting with potential PI and was offered job shortly after.  Hiring was confusing because VU/VUMC split was occurring and no one knew who I belonged too...", "Interview Questions": "Just had informal discussion about potential projects since PI was already familiar with my research experience."}, {"date": "10 May 2016", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center in May 2016", "Interview Descriptions": "I was contacted by a recruiter a month after applying for the job online. Vanderbilt requests initial video interviews now. I was unable to do the video interview. Per the option in the initial email I received, I requested a phone interview. The recruiter stated that it was not a problem and sent me a link to her calendar. I scheduled an interview about 4 days out. I received a confirmation email. I never received a call for my interview. I waited 20 minutes beyond my interview time, left her a voicemail and sent her an email. The recruiter didn't respond. The following Monday, I sent an email to the general HR mailbox with Vanderbilt located on the careers webpage. I finally get a response from the initial \"recruiter\" stating that the position is filled. The position is still listed on the site as available. This all transpired within a matter of a few days. What was so hard about shooting me an email before the scheduled time to let me know that? I had to move some things around to make time for a phone interview by the deadline.\r\n\r\nI forwarded my previous emails to the HR manager and director. No response from them, which is not surprising.  I didn't think the \"recruiter\" had a right to get away with being unprofessional. It's not even about the job. It's about having some common courtesy and respect for my time. She is the one who contacted me for the interview. I believe she just didn't want to be bothered with a phone interview. It's disheartening to be looking for a job, having to deal with employed individuals who aren't even doing their job. Recruiters who don't recruit makes no sense at all.", "Interview Questions": "Was not contacted for an interview"}, {"date": "11 Apr 2017", "title": "Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2016", "Interview Descriptions": "Asked a few basic questions concerning technical and behavioral skillsets. Did not ask any trick questions, they just wanted to know how capable and committed I could be to learn and handle the laboratory techniques", "Interview Questions": "Do you know how to do PCR?"}], [{"date": "24 Apr 2016", "title": "IT Process Owner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2016", "Interview Descriptions": "Online application initiated the process.  Conducted 3+ phone interviews with the IT director and members of his staff group.  Culminated with them flying me to Nashville for 5-6 hours of face-to-face interviews with most members of the IT staff.  Most questions were situational from either past experience or what-if type questions.  After returning home, they contacted me with an offer previously negotiated and are following up with a formal offer sheet and benefits package list.", "Interview Questions": "How did you manage a previous incident or problem that your own IT support staff caused?  Also asked many pop quiz type questions concerning the specific area the job was for."}, {"date": "9 Jul 2016", "title": "Insurance Management Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2016", "Interview Descriptions": "Interview for a job where you have to verify patients insurance. They ask me several questions. What was my strength.  What wad my weakness.  Did i have experience with verifying. Insurance", "Interview Questions": "Why are you looking for another job"}, {"date": "27 May 2016", "title": "Health Policy Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Mar 2016", "Interview Descriptions": "A recruiter from HR contacted me for a phone screen interview. \r\nShe asked me typical questions regard to my work experience.\r\nThe entire interview took about 15 minutes.\r\nShe said she was going to get back to me after meeting with the faculty, but never came back.", "Interview Questions": "What statistical methods do you use for your daily work?"}, {"date": "1 Apr 2016", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Mar 2016", "Interview Descriptions": "I spoke with a number of people.  The interview process was very professional and pleasant.  It was nice getting feedback and questions from various people with different perspectives about the job.", "Interview Questions": "Have you ever been in an environment where there were people of all cultures and races? How did you work with them?"}, {"date": "6 Jun 2017", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Mar 2016", "Interview Descriptions": "The interview was an unformal discussion, a researcher to researcher discussion about ongoing projects in the lab and mutual interests. We went through my CV and saw how I can be a plus for the lab.", "Interview Questions": "My current project and interests"}, {"date": "23 Jan 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Mar 2016", "Interview Descriptions": "Two phone calls before I did a video interview.  The video interview was awkward as they could see me but I could not see them. It was difficult to read the room and know when to talk and not", "Interview Questions": "What qualifications do you have? Why are you applying to this position? "}, {"date": "14 Jun 2016", "title": "New Graduate Nurse Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center in Mar 2016", "Interview Descriptions": "They start out by asking you general questions such as where you see yourself in 5 years, why you want this position, etc. Then they go into situation-based questions (about 5 of them) and give you time at the end to ask questions. I had 3 people conducting the interview - a nurse from the floor I was applying for and 2 people from management/leadership.", "Interview Questions": "Tell us about a time you had to research a patient and how it resolved."}, {"date": "9 Apr 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Mar 2016", "Interview Descriptions": "It went well. They were very professional and made you feel comfortable the whole time. They asked a lot of good questions. I had no problems at all with the process.", "Interview Questions": "What is your previous work experience"}, {"date": "16 Jan 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "There was a phone interview then an in person interview, I am currently in a phase where I provide references and after 5 references are reviewed they can make a hiring decision. Of course I dont understand what that means, am I still in a pool of people or do they want to offer pending my reference review (which of course they will be good why would I pick poor references you know) So just waiting", "Interview Questions": "Comment on how you stopped something bad from happening (safety)"}, {"date": "24 Apr 2018", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2016", "Interview Descriptions": "The interview was done by a panel of the service managers. They took turns asking you questions. They are looking for an example of a situation, how you handled it or responded to it, and what was the outcome of the situation. They want you to demonstrate critical thinking skills.", "Interview Questions": "Describe a situation where you had a difference of opinion, and how you handled it. "}], [{"date": "4 Jan 2017", "title": "Community Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2016", "Interview Descriptions": "Great. The interviewers were friendly and interested in my experience. I had a chance to ask questions and felt like they were honest about pros and cons about the organization. Overall a really great experience", "Interview Questions": "My experience"}, {"date": "23 Nov 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "Contacted Principal Investigator via email, received response and invitation to visit for in person full day interview (gave 1 hour talk on research and met with members of lab in addition to PI)", "Interview Questions": "What do you want to do after finishing your postdoc?"}, {"date": "19 Nov 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "A typical hour long talk on previous research and one on ones with six different faculty members.  Everyone was very enjoyable to talk to and no one was overly critical.  Most of the interviews were just conversations about science in general.", "Interview Questions": "Career goals and interest in an academic career"}, {"date": "26 Feb 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Nov 2015", "Interview Descriptions": "I had a phone interview and it lasted 30 minutes. I had two interviewers and they made me feel very comfortable. They just wanted to get to know more about me and why I wanted to work for VUMC and their department. It was a pleasant experience and I wouldn't change anything about it.", "Interview Questions": "Why do you want to get into healthcare?"}, {"date": "20 Nov 2015", "title": "Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center in Nov 2015", "Interview Descriptions": "They take their time for their fit, and as long as it took - I find it to be very worth it. \n\nPhone interview, in person interview, background check, a formal offer, and orientation.", "Interview Questions": "How do you handle stress?"}, {"date": "21 Sept 2015", "title": "Dialysis RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Through networking, I reached out to the unit and came up for a visit. I was encouraged to apply for a position, so I did. From there my application was in the hands of HR, which was honestly a bit of a frustrating and lengthy process. There was a 30 minute phone interview with an HR personnel which frankly seemed inappropriate to me -- why is someone with no experience working in health care giving me a preliminary interview?? I have worked with HR departments previously of course in my field, but they seemed extra involved here. Maybe that's just the way things are done now, I'm not sure. Next I had my official interview with the Unit Manager and a Director over the unit. I was offered the position right away and just had to wait for HR to complete my background checks and send the official offer. It was time-consuming and it felt like HR was very much a middle-man, but it ultimately worked out so I have no real complaints about the process.", "Interview Questions": "Specifically which procedures I was proficient at."}, {"date": "22 Sept 2015", "title": "Associate IT Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Sept 2015", "Interview Descriptions": "Initial phone screen with a recruiter from Vanderbilt HR discussing my experience and qualifications. After completing the phone interview was informed that I would be getting an email to schedule an in-person interview.\r\n\r\nTwo days later I got an email scheduling a group interview with the department's IT staff less than a week later. In the group interview I met the team leader and two members of the three member staff. In addition to the IT staff I was also interviewed by a member of the leadership team.  \r\n\r\nI was initially asked questions regarding how I would handle difficult situations and being asked to compromise my integrity. After that I was asked a series of round robin questions from the IT staff that included technical and non-technical questions.", "Interview Questions": "If you could have any superpower what would it be?"}, {"date": "30 Sept 2015", "title": "Administrative Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Sept 2015", "Interview Descriptions": "Short, sweet, to the point. No messing around. I was overqualified with my experience & was told during the interview that I had already made it to the final round/meet & greet and that they just had me come in for HR reasons/fairness to other candidates. Interviewer was very kind.", "Interview Questions": "Where do you see yourself in five years?\r\nWhy do you want to work here?"}, {"date": "6 Aug 2015", "title": "Research Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "The interview was for a lab new to Vanderbilt and only lasted a couple of hours as they had not set up yet. It involved speaking with a researcher about my past experiences. This was different from another interview I had with an established lab at Vanderbilt where I met and interviewed with the entire team including the lead investigator.  Both involved lab tours.", "Interview Questions": "Have you performed mammalian tissue culture before?"}, {"date": "4 Aug 2015", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "Standard interview. Arrive night before, dinner with PI that evening. Next day meet with members of lab, give research talk, tour of lab facility, more meetings and then done and gone.", "Interview Questions": "no difficult or unexpected questions"}], [{"date": "14 Jan 2016", "title": "Administrative Assistant II Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Aug 2015", "Interview Descriptions": "I first submitted for the role in June 2015.  I didn't hear anything for a while, then I got a call asking me questions about working in the medical area/a specific department.  It sounded like they were interested, so I wasn't surprised when I got another call a couple weeks later.  However, it dawned on me in the middle of that conversation it was a different department calling.  This time they sent me a questionnaire to fill out.  I had a panel interview with some wonderful people via phone which went very well but then I didn't hear anything for several days.  I needed to make a decision about either moving to TN or move in town so when I didn't hear anything, I made the incorrect assumption they weren't interested so we moved in town.\r\n\r\nFive days after we moved, they called me to see if I could come for what I believed were to be the final, in person interviews.  I told them during this time they would have to pay relocation, as we had just moved.  I was ecstatic when they called to offer me the job but devastated that I needed to turn it down because they weren't able to pay enough for relocation, even though I truly believe they tried.  SO disappointed, as they are a fantastic group of people.", "Interview Questions": "Why are you interested in this position?  Why are you in the job market?"}, {"date": "4 Aug 2015", "title": "Medical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jul 2015", "Interview Descriptions": "I've had three interviews: Blood Bank, Microbiology, and Molecular Diagnostics. Each was conducted with two or more people in different conference rooms. They all felt very similar as Vanderbilt has a script they use for interviews. Micro stuck to it like glue but Blood Bank and Molecular were far more relaxed and casual.", "Interview Questions": "Typical and expected questions: tell us about yourself, why did you choose to apply here, greatest weakness/strength, tell about a time of coworker conflict, ect."}, {"date": "16 Jun 2015", "title": "Data Coordinator II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "The interview process was lengthy. It was pretty smooth. HR contacted me initially for phone interview then I had an interview with 2 supervisors and a few higher-ups in the office. After that, there was a panel interview with the other DC's. \r\n\r\nBeware of this job. The job description listed on Vandy's HR website is totally inaccurate. Does not match the actual responsibilities at all. Basically sitting in a dark area with little to no interaction with others while reading electronic patient complaints. There is little room for upward mobility and it pays VERY little. Only offered at 30hrs/wk but is still considered FT. The metrics and standards they keep to are unrealistic. The current supervisor is extremely incompetent and uneducated. If you are trying to \"get in the door\" at Vandy, this job serves its purpose but after a year or so, RUN!!! Pay is not worth the responsibility.", "Interview Questions": "Are you comfortable working in an environment where all you do all day is read patient complaints?"}, {"date": "12 Jun 2015", "title": "Laboratory Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Vanderbilt University Medical Center in May 2015", "Interview Descriptions": "The process takes a long time compared to other jobs I have had. I applied online for the job. One week later, I recieved an email for a pre interview screening. One week after I submitted the screening answers, I was contacted for an in person interview that was scheduled for another week out. The interview questions were pretty standard. The wanted to know a lot about your knowledge of laboratory procedures as well as a few personality questions. My two interviewers were great and very personable. The interview lasted about 20 to 30 minutes. After the interview, it took 2 1/2 weeks to hear back. They made me an offer that I accepted and have not regret it since.", "Interview Questions": "Name the order of draw for a phlebotomist. "}, {"date": "22 Aug 2017", "title": "Clinical Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Vanderbilt University Medical Center in May 2015", "Interview Descriptions": "HR interview and on-site interview with a variety of personnel one would be collaborating with in normal work functions.  Presentation required.   Typical interview process- not a whole lot of surprises.", "Interview Questions": "Why Vanderbilt?"}, {"date": "8 Sept 2016", "title": "Contact Center Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in May 2015", "Interview Descriptions": "pretty much the normal thing.  Tell me about your history by walking us through your prior work experience.  What is your greatest weakness and strength?  Why did you leave your last position? When would you be available?  What is the salary you are looking for?", "Interview Questions": "How much experience do you have in a contact center."}, {"date": "14 Apr 2015", "title": "Research Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "The interviews cumulatively were the most lengthy I have ever experienced. The interview day itself lasted 4.5 hours and consisted of talking separately with 8 people, each asking me the same questions. It was exhausting and inefficient to have to discuss the same things with each person, when a modified format would have been more pleasant, less draining, and require me to repeat myself less.", "Interview Questions": "How do you deal with conflict? "}, {"date": "10 Aug 2015", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2015", "Interview Descriptions": "They contact you for a phone interview and then you can have up to 3 different face to face interviews depending on the position which you are applying for.  They have practicum job related questions.  They are nice when interviewing but stick to the facts don't ramble and don't talk to much about yourself or where you see yourself fitting in unless asked specifically those questions.  Also go into 2525 West End and apply on their computers.  Ask all the questions you have to those ladies at HR Express they are a huge assists.  Even if you get the job I can guarantee you, that you will be calling them asking questions.  Also be on your best behavior and be nice to everyone you have no clue who knows who.", "Interview Questions": "Tell me a time when you have had workplace differences describe to me the situation surrounding the conflict the steps which you took and the outcome."}, {"date": "2 Mar 2016", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2015", "Interview Descriptions": "The interview process was fast and smooth. First there was a phone interview from one of the managers. During this I got to learn about nurse:patient ratios, number of beds on the unit, acuity of the patients, etc. At the end of the interview I was offered a face-to-face interview, with an option to do it on Skype (I lived about three hours away). I chose to drive to the hospital for the interview to get a better feel of the atmosphere and also places to live near the hospital. The assistant managers interviewed me and gave me a tour of the unit. They were very forthcoming and helpful, even talking about possible orientation dates.", "Interview Questions": "What is an example of a time when you had a difficult patient, and how did you deal with that?"}, {"date": "23 Feb 2015", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Feb 2015", "Interview Descriptions": "I was emailed by the administrative manager of department that had the opening requesting a phone interview. After a quick email conversation a phone interview was set for the next day. The Phone interview lasted about 30 minutes. She Asked some situational questions (what would you do if...), some personality questions (how do you deal with...), and some job experience questions (list your job duties at your previous job.", "Interview Questions": "If someone was calling, someone walked in and a coworker needed your help at the same time what would you do?"}], [{"date": "16 Aug 2016", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Vanderbilt University Medical Center in Feb 2015", "Interview Descriptions": "I went through a local recruiting firm to get the interview initially. The interview was scheduled quickly.The questions in the interview were directed mainly at job skills, with some additional focus on working style. The interview was conducted by two members of the current staff, including the manager that the position reported to. Overall, the interview was pleasant but the questions required thoughtful answers.", "Interview Questions": "Are you familiar with the use of Microsoft Project and Visio?"}, {"date": "30 Oct 2015", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2015", "Interview Descriptions": "As a student, the undergrad work/study program was was easy to understand in terms of the hiring process. What I've heard from full time staff is that the interview process is straightforward and simple as well. Getting the job required quite a bit of past experience, and also a strong interest in the work to be done and matching up with Vanderbilt's creed and values.", "Interview Questions": "What experience do you have with multitasking?"}, {"date": "30 Dec 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2015", "Interview Descriptions": "Easy talked about my employment history and how I could contribute to the Clinical staffing resource centre.  I had one interview with the manager and was contacted quickly with the job offer", "Interview Questions": "What is your work history and how will you contribute to full-fill our mission."}, {"date": "9 Apr 2019", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2015", "Interview Descriptions": "They were quick! Applied and got a call for an interview same day. They will take anyone with a BSN and a valid RN license. Offer next day. It was very easy process.", "Interview Questions": "Where do you see yourself in 5 yrs?"}, {"date": "7 Nov 2015", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Dec 2014", "Interview Descriptions": "A recruiter reached out to me on linked in and got me in contact with the hiring manager within a day. Had two phone interviews with the director and associate director, then was brought in for an onsite interview. Took about 5 weeks.", "Interview Questions": "I can't really recall any challenging questions asked."}, {"date": "12 Jul 2016", "title": "Administrative Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Vanderbilt University Medical Center in Nov 2014", "Interview Descriptions": "Applied online in October 2014. Contacted for a brief phone screening with HR about a month later. Pretty basic questions, like describing my education and current experience, explaining why I wanted the job, etc. Contacted several weeks after that by hiring manager of the department. I was living in another state, so he interviewed me by phone and we set up an in-person interview for later in the month when I would be in town for the holidays. More detailed questions this time, such as describing how I handle conflict, strengths and weaknesses, where I see my career path going. After that interview, he wanted me to meet with another manager in the department the following week. Pretty much the same questions as the first manager.\r\n\r\nAll in all, four interviews and a three month application process for a very basic, entry-level position! But part of that was due to my living out of state, and I was contacted just a few days after the final interview and offered the position.", "Interview Questions": "Describe a situation at you work that you didn't handle well, and what do you wish you had done instead?"}, {"date": "25 Nov 2014", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vanderbilt University Medical Center in Nov 2014", "Interview Descriptions": "Initial application was submitted through the VUMC career center website. There was almost a two-month lapse of time before any communication was received, regarding a screening interview via phone with an HR employee. That interview consisted of general behavioral questions, such as \"Why choose to work at VUMC? What is your general philosophy when dealing with conflict? What makes you the most qualified candidate?\" and the like. I then received a phone call two weeks later from the departmental manager, who discussed the details of the position as well as conducted an informal phone interview. The following week that departmental manager called to set up a face-to-face panel interview consisting of the manager and the department NPs. This interview consisted of more NP-specific behavioral questions where the interviewer provides a topic/scenario, and I had to describe an applicable experience of my own, what I did, and what I learned from that experience.\r\n\r\nI did not get the job due to lack of experience, but it was a positive interviewing experience overall. Everyone was friendly and kind, and although the questions were somewhat difficult, it was a fairly informal and comfortable atmosphere interviewing with this particular department.", "Interview Questions": "Describe a clinical situation where you went above and beyond your job requirements."}, {"date": "23 Jan 2018", "title": "Staff RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Nov 2014", "Interview Descriptions": "The interview consisted of a panel of interviewers asking questions and talking over each other at times.  Did not appear very professional and I felt like they had not interviewed in this manner very much in the past - it seemed like they did not know what they were doing.  In addition, the interview itself did not seem like it was objective - it was like they had already decided on who they wanted to hire and was just going through the motions while interviewing me.", "Interview Questions": "What makes you think that you would be a good fit?  Where do you see yourself in 5 years?"}, {"date": "27 Jul 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Nash, TN) in Oct 2014", "Interview Descriptions": "There are at least 2 or more people interviewing you up here so be prepared to face more than one person the interviews are quite difficult and not as easy as interviewing for a regular job.", "Interview Questions": "Why do you choose to work here"}, {"date": "10 Sept 2014", "title": "Health Systems Database Analyst III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "There were a series of interviews, with not only the team I would be working on, but other people within the VUMC system. The interviews were extensive, but there were no tests (like I have seen in other reviews). It is harder to get through the original HR screening process than the interview process. The original HR process depends in part because of whose desk the application lands on. When I was helping select candidates to interview once I was part of the VUMC family, I was sometimes frustrated on who got through and who didn't. It is a really good employer for middle Tennessee.", "Interview Questions": "No real unexpected questions. If you have read a good interview book (e.g., Knock 'Em Dead), you will be fine."}], [{"date": "22 Aug 2015", "title": "Mental Health Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Sept 2014", "Interview Descriptions": "Pretty basic. Conducted a phone interview with HR. Then got passed along to a panel interview with the 3 coordinators from each department (children, adolescent, and geriatrics). Later, I received an e-mail from one of the coordinators offering me the position. Furthermore HR then called me to provide me with details about benefits and pay. I got offered around 13.00 an hour. Unfortunately, with costs of my daycare and gas, etc. I was not financially able to accept the job. Furthermore, through negotiation It was extremely difficult to get specific answers regarding my hours/shift, specifically days and times which made it difficult to figure out childcare.", "Interview Questions": "Pretty typical interview questions. Strengths/weaknesses, past experiences. They did ask a lot of questions involving how you would handle a specific situaition and asking you to describe a situation in which you demonstrated a positive quality (such as leadership)."}, {"date": "27 Nov 2015", "title": "Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Sept 2014", "Interview Descriptions": "Very casual interview, replied to online job posting by email and was quickly (within 2 weeks) contacted to ask for available time slots. I went directly to the laboratory I would work for and spoke with the lab manager. Very nice woman who seemed to be focused mostly on finding an assistant whose personality matched with the lab.", "Interview Questions": "It was primarily a getting-to-know-you type of interview. Talked about future career plans, etc. "}, {"date": "4 Jun 2014", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Overall, the interview experience was very positive.  There is such a thing as southern hospitality.  The questions, however, were VERY difficult.  I was not expecting such questions, especially as a new grad (we barely have any experience!).  But the interviewers were nice and I enjoyed talking with them.", "Interview Questions": "\"Tell us about at time when you noticed that a patient required a medical intervention.  What cues told you so, what did you do, and how did it resolve?\" (as a new grad, that question was pretty intense."}, {"date": "1 May 2014", "title": "Business Office Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Received a phone call screening first. Then a regular interview, then a PEER interview. Was hired after manager's friend accepted a position elsewhere.", "Interview Questions": "If you had a choice on a snowy. icy  day to drive to work or stay home, which would you choose. "}, {"date": "1 May 2014", "title": "Accounting Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "One interview, had to start as a temporary employee", "Interview Questions": "Typical interview questions"}, {"date": "26 Apr 2016", "title": "Registered Nurse, Critical Care Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in May 2014", "Interview Descriptions": "After submitting the application, I received the response by email for setting up the interview date within a week. Also I had a friend woking in the new place so I contacted her prior to the application. I think this helped me have such a short period of waiting time prior to the interview.", "Interview Questions": "What is your strength, weakness, reason to leave the previous unit/place, what to learn and plan in a new job place"}, {"date": "24 Apr 2014", "title": "Senior Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "Very straight forward process.  A relatively long wait to hear back.", "Interview Questions": "N/A"}, {"date": "25 Nov 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2014", "Interview Descriptions": "Smooth, face-to-face interview in during which interviewer asked me about previous jobs listed on my resume. Got the interview after responding to a job post online. The whole process was pretty quick and lasted a little over a week from the time I applied to the time that I received an offer.", "Interview Questions": "Describe a time when you had to complete usual tasks on top of meeting multiple deadlines around the same time."}, {"date": "15 May 2015", "title": "Certified Nurse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Mar 2014", "Interview Descriptions": "Quick face-to-face interview with private duty manager. Asked a series of behavioral and situational questions related to healthcare. Asked about my previous experience working in healthcare. Asked about my academic goals and ambition.", "Interview Questions": "Have you ever been faced with a situation where you were unable to fulfill a task on your own. How did you proceed?"}, {"date": "11 Aug 2017", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center in Mar 2014", "Interview Descriptions": "New grad online application submitted before the winter holidays, then an interview a few months later.   After interview process option of in-person or skype.  Offer's were sent out again a few months later.  When I applied you either applied for critical care or acute care.  Then during orientation you had brief interview with each unit within the tract you were selected for and then given your unit placement.", "Interview Questions": "N/A"}], [{"date": "8 Feb 2014", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Professional, accurate representation of job", "Interview Questions": "N/A"}, {"date": "8 Aug 2014", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center in Nov 2013", "Interview Descriptions": "For leadership nursing roles, a new process is in place that is really intimidating and bazaar.  Applicants meet with several groups over a few hours.  One group is upper administration, one is peers, and one is management.  They take turns asking all scenario questions and you must state what you did and the outcome.  Everything you say is written down and then it is scored.  It is an event in which several applicants participate, but each is interviewed with the group individually.", "Interview Questions": "Name a situation in which you had to research a problem and used resources outside of the normally provided.  What did you do and what was the outcome?"}, {"date": "10 Oct 2013", "title": "Health Systems Analyst III Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "The process was very unique as Vanderbilt has a different atmosphere than most companies.", "Interview Questions": "Given specific situations to test skills."}, {"date": "27 Sept 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "Phone prescreening, initial interview with hiring manager/director, group interview with team", "Interview Questions": "All were typical Targeted Selection questions"}, {"date": "23 Sept 2013", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "Multiple phone interviews followed by a couple in-person interviews. Most were one-on-one but a couple were group interviews. Some of the interviews were more technical Q&A while some of the interviews were more conversational in nature. Overall I was impressed by the level of interest in my previous work and their interest in what I thought I could bring to the organization.", "Interview Questions": "Detailed technical questions in addition to some common interview-y type questions."}, {"date": "1 Mar 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Aug 2013", "Interview Descriptions": "The interview was very planned out. The interviewer is given a set of questions, i assume from HR,  and they must ask you every question on the list. It took over 5 months for me to hear back that I was awarded the job. VUMC's interview process is extremely slow and poorly managed.", "Interview Questions": "Past experience"}, {"date": "7 Mar 2017", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jun 2013", "Interview Descriptions": "I worked at Vanderbilt for 15 years in the same department, at the time I was interviewed it was a very casual interview.  During my time we started to use a interview tool that required canidates to go through 3 different people of which I was one of them.  The tool we used really allowed us to get an insite on how they would perform.", "Interview Questions": "Describe an interaction you had with a customer/patient that was difficult to handle.  Why was it difficult what did you do and what was the out come."}, {"date": "21 May 2013", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a staffing agency. The process took 3 months. I interviewed at Vanderbilt University Medical Center", "Interview Descriptions": "I got this job through a temp agency in the area. It was pretty direct to hire. As long as you show enthusiasm and do the work they need, you'll do great!", "Interview Questions": "There weren't any difficult questions. Very straight forward."}, {"date": "23 Jan 2017", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2013", "Interview Descriptions": "The interview process is variable and dependent on whether an individual is currently employed in the organization. Once passed the Human Resources portion, the interviewers are consistent and professional.\r\nThe interview process for nursing, in my experience, follows standards of best practice. As a Magnet awarded facility the organization strives to maintain high standards which are expressed in the interview process.", "Interview Questions": "Standard"}, {"date": "10 Mar 2017", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2013", "Interview Descriptions": "Twice yearly process where RNs out of school or with less than 6 months experience are chosen to interview/hire. Submit your application, if you meet the cut off score you interview, then best candidates chosen based on overall score of application/interview questions. You and 3-4 people across from you, interviewing you, using ruberics to score each question. They might be nurse managers, asst mgrs (CSL), educators, administrators. They ask clinical questions and what you would do in that situation.", "Interview Questions": "I'm sorry, I don't remember. Something about, \"Tell about a time you successfully educated a patient on an issue.\""}], [{"date": "14 Nov 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Vanderbilt University Medical Center (Spokane, WA) in Feb 2013", "Interview Descriptions": "I applied for the nurse residency program.  My panel interview was over Skype because I could not travel from Washington to Nashville.  It went as smooth as a Skype interview can and everyone was very nice.  Before the interview, someone from the recruiting office called me to make sure I was set up on my end and then we proceeded with the actual interview.", "Interview Questions": "They asked many behavioral based questions, \"describe a time when....\""}, {"date": "18 Mar 2014", "title": "Research Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2013", "Interview Descriptions": "Took about three weeks to have interview and background check to return.", "Interview Questions": "Not any difficult questions."}, {"date": "14 Feb 2013", "title": "SharePoint Integration Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2013", "Interview Descriptions": "The conversation with the Technical Recruiter was friendly, informative, and overall a pleasant experience. He asked me to contact him in a couple weeks to ensure the Hiring Manager had gotten in touch with me. I left a follow-up email and voicemail, but never received a response from either him or the Manager. It's a shame, because my background and my desire to be in an academic environment would have meshed very well.", "Interview Questions": "All of the questions were typical Q&A from both myself and the Technical Recruiter. Nothing was difficult."}, {"date": "26 Jul 2016", "title": "Research Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2013", "Interview Descriptions": "My interview was very friendly, I felt at ease throughout. The questions were straight forward, and I feel mainly to get an idea about my temperament as a person, employee and co-worker (to supplement what they already knew from my resume and cover letter/e-mail. It was short and to the point, and they let me know in a very timely fashion whether or not I got the job.", "Interview Questions": "Do you have any previous experience in this field? What is your level of interest in this type of work/career path?"}, {"date": "15 Jun 2015", "title": "IT Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Dec 2012", "Interview Descriptions": "I applied and got called for an interview within a month. The first interview was with a recruiter, with questions regarding my background. The second interview was about 30 minutes with the one of the senior employees on the team. I also interviewed with the hiring manager on the same day. This interview was about 30-45 minutes. I received a thank you for coming in to interview, later that day. This was followed up with an offer, contingent on a background check.  I accepted the job and really enjoyed the work there.", "Interview Questions": "What's your methodology for handling projects."}, {"date": "24 Aug 2012", "title": "Health Systems Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Vanderbilt University Medical Center (Nashville, TN)", "Interview Descriptions": "The interview here for me was in Jan of 2007. The interview started in the morning and lasted the entire day. I met with most of the doctors and Team leads for both technical interviews and regular interviews.", "Interview Questions": "How would you monitor applications in an environment where there is no standard for app servers, or technology developing the application?"}, {"date": "14 Dec 2013", "title": "Temporary Sub Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Aug 2012", "Interview Descriptions": "The interview was great and offered many chance for carrier. Detailed on education and personal; experience", "Interview Questions": "are you willing to adapt to any shift"}, {"date": "9 Mar 2016", "title": "Undergraduate Research Analyst/Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Aug 2012", "Interview Descriptions": "I went to the career fair in August and gave out my resume to the places I was interested in working for. I got called back for an interview by a staff member for a position in a research study the next day. I did the interview the following week, followed by a second interview with the principal investigator for the study. After these interviews I got the job and chose to accept.", "Interview Questions": "Why do you want this job? What are your previous experiences working in a clinical setting? What are your greatest strengths and weaknesses? What do you hope to accomplish here? Where do you want to be in 10 years?"}, {"date": "22 May 2014", "title": "Research Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jul 2012", "Interview Descriptions": "I was a internal hire by a PI. I didn't deal with HR at any point during the process. I had previously demonstrated my effectiveness as a researcher and group leader, and the PI was interested in skill sets that made me a unique addition to their team. I have found Vanderbilt HR to be exceedingly policy driven.", "Interview Questions": "What form will success in this position take?"}, {"date": "17 Aug 2016", "title": "Client Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in May 2012", "Interview Descriptions": "Initial email with recruiting agent, then brought onsite for a group Interview with team members. I immediately had a 20 minute interview with the program managers and COO, and a 5 minute interview with President (mostly a formality at that point). I was offered the role later that day.", "Interview Questions": "What do you know about malpractice insurance?"}], [{"date": "9 Sept 2013", "title": "Lab Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Mar 2012", "Interview Descriptions": "A simple on site interview. Wasn't tough at all. They asked all relevant questions which were very easy to answer.", "Interview Questions": "N/A"}, {"date": "16 May 2015", "title": "Systems Software Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Mar 2012", "Interview Descriptions": "Two at a time interviews, all day.  Spoke with about 10 different people.  None of the questions were hard, just common sense stuff for an experienced programmer.  A lot easier than some start-up interviews I've had over the years.", "Interview Questions": "Do you validate a web form client-side with Javascript or server-side?"}, {"date": "5 Apr 2016", "title": "Senior QA Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Feb 2012", "Interview Descriptions": "All day process from peers to managers to executives. Some team based, some individual. Treated with great respect. Very laid back and personable. Felt immediately welcomed. Potential team members took me to lunch. Was tired, but felt very good about the interview and got the job. Some difficult questions. Personality based and skills based questions. Most centered around team fit.", "Interview Questions": "Describe a difficult situation at work, how I handled it, outcomes, and what I learned from it."}, {"date": "29 Dec 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2012", "Interview Descriptions": "Arrived on time. Met with HR mgr, then met hiring mgr. After interview,  was escorted to work area to meet workers. Process was roughly  two hours. Then was hired same day.", "Interview Questions": "Tell me something about  yourself "}, {"date": "28 Jan 2016", "title": "Research Assistant II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jan 2012", "Interview Descriptions": "Simple phone interview that sounded very scripted and mostly went over my submitted resume. Nothing too challenging was asked. Vanderbilt hiring managers are required to ask the same scripted interview questions, regardless of department. They are very predictable and boring.", "Interview Questions": "Standard strengths and weakness type questions."}, {"date": "26 Jan 2012", "title": "Administrative Assistant II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Dec 2011", "Interview Descriptions": "All applications are online.  You never speak to anyone in HR. Someone from the hiring manager's office will call or e-mail you.  The process is very slow.  Be prepared to wait up to 30 days before someone contacts you.   You may start with 1:1 and then proceed to group interviews. or vice-versa.    The university prefers behavioral interviews and gives the hiring managers templates of questions,. \r\n\r\nThe after-interview process is also a long period.  You may never hear from the again, or you may receive a e-mail form letter from HR stating that they hired someone else.", "Interview Questions": "What would be your fantasy job--not related the position you're applied for today?"}, {"date": "24 Oct 2011", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vanderbilt University Medical Center (Franklin, TN) in Oct 2011", "Interview Descriptions": "Applied online with an excellent match for stated qualifications needed. Contacted within 24 hours to schedule a phone interview. Wonderful conversation with a recruiter. It appeared that the recruitment office is somewhat disconnected from the hiring department -  the recruiter only had very general answers. However, the recruiter was very helpful and assured me that the department manager could answer the questions or she would find the answers herself. We set up a time for me to talk to the department manager via phone. However, I accepted a position elsewhere before being invited for a live interview.", "Interview Questions": "How has your professional background made you an appropriate candidate for this position?"}, {"date": "31 Mar 2015", "title": "Budget/Accounting Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Sept 2011", "Interview Descriptions": "I had a three one-on-one interviews with two administrative officers and a group interview with the individuals that I would be working with.  the questions asked were about my past work experience and how my skills would assist me in being a successful Budget/Accounting Analyst. the one-on-one interviews lasted about an hour and my group interview was thirty minuets.", "Interview Questions": "my goals for the next 5 years"}, {"date": "25 Dec 2012", "title": "Playroom Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Sept 2011", "Interview Descriptions": "I applied online and then waited for several weeks to hear back. I was offered an interview and then went to my scheduled date. The interview was short but filled with many direct questions aimed at finding out why I deserved this job more than other applicants. After the interview I was offered the job on the spot.", "Interview Questions": "Why should you get this job over the other applicants?"}, {"date": "18 Jun 2015", "title": "Office Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Aug 2011", "Interview Descriptions": "Standard Targeted Selection questions. Interview with Manager first, followed by group interview. Was very laid back. Lasted 45 minutes total. Interviews were scheduled just a few days apart, so I knew pretty quickly that I had gotten the job. This was an internal transfer/promotion. I was a little disappointed to find that the pay increase was not going to be as high as I wanted it to be. However, I accepted because at the time, I wanted to stay at Vanderbilt long term... Thought other management opportunities would become available. That was not the case.", "Interview Questions": "All were Targeted Selection questions."}], [{"date": "3 Jan 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center in Jun 2011", "Interview Descriptions": "In brief, I applied by email to a scientist and fixed an interview date. Then I gave a presentation and got the offer the very same day. I was also asked to go out on lunch with the rest of the colleagues to learn more about the supervisor and get second opinion before I accepted the offer.", "Interview Questions": "N/A"}, {"date": "4 Nov 2015", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Mar 2011", "Interview Descriptions": "I applied online through their jobs website. It took a few weeks to hear back from them. Met with hiring manager for the unit as well as member of staff whom I would be working with. I felt good after the interview and was called back within a couple of weeks with the job offer. The hiring process takes so long that I had also had two other interviews in different departments after my initial before I was hired at neuro.", "Interview Questions": "Why do you want to be a care partner."}, {"date": "4 Apr 2014", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Nov 2010", "Interview Descriptions": "Easy going.  I gave an hour long presentation of my previous work, spoke to lab members, and was hired.", "Interview Questions": "N/A"}, {"date": "10 Mar 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jul 2010", "Interview Descriptions": "Lengthy, lots of people to meet with and it takes a long time to navigate the process", "Interview Questions": "what is your biggest weakness."}, {"date": "12 Feb 2014", "title": "Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Vanderbilt University Medical Center in Jun 2010", "Interview Descriptions": "The interview was conducted by panels. The entire day of interviews did not include a tour of the nursing unit. I had to request this. I had to pay for my own plane ticket, and was told that the person hired for the position would be reimbursed for the plane fare.  Once hired, I had to be very persistent before the expense was reimbursed.", "Interview Questions": "There were no unexpected questions."}, {"date": "24 Feb 2014", "title": "Research Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 8 months. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2010", "Interview Descriptions": "I approached a lab I wanted to work in, sent in my resume, and came for an interview. It lasted two days and I was offered the position the day of my interview. Hiring took a little while, but I was unable to start the position for several months, so the actual hiring process was not expedited.", "Interview Questions": "Nothing unexpected was asked"}, {"date": "9 May 2013", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Sept 2009", "Interview Descriptions": "It is very difficult to get salary information. Vanderbilt has a system where the hiring manager \"does not have control\" over the offered salary, and instead says that Personnel sets the salary based on the candidate's experience and education. It is difficult to circumvent the system. You will have to apply through the online system and, if it kicks you out as not appropriate for a particular job, it is almost impossible to do anything to make your case.", "Interview Questions": "None - interview was easy."}, {"date": "25 Sept 2013", "title": "Transportation Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Jun 2009", "Interview Descriptions": "Hiring process takes at least 3 weeks,Interview process is easy.", "Interview Questions": "N/A"}, {"date": "4 Jun 2012", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Vanderbilt University Medical Center (Nashville, TN) in Apr 2008", "Interview Descriptions": "I was referred by an employee who I had worked with previously. I had a phone interview initially with the employee who Id be working under and then went to Nashville to meet with the department head. The interview process was relatively informal with the basic questions about future plans, previous work experiences, and interests in the health field.", "Interview Questions": "Where do you see yourself in 5 years"}]]