[[{"date": "28 Mar 2023", "title": "Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Webster University", "Interview Descriptions": "I applied online and was contacted to set up a phone interview. The phone interview was rushed and the interviewer didn't even take time to fully introduce the position. I was definitely not expecting the 2 part highly specific behavioral questions for a first phone interview, especially with such a low salary being offered. Do yourself a favor and ask about salary before you agree to an interview with this University. The pay is super low for what they are expecting of candidates.", "Interview Questions": "Tell me about how you handle stress"}, {"date": "24 Jan 2023", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Webster University", "Interview Descriptions": "The people were very friendly and forthcoming, the problem is that the salary is just too low. They are below the industry average. If they could increase the salary they seem like it would be a nice place to work. I just couldn't do it on that salary.", "Interview Questions": "Asked about experience with recruitment, international students, managing others, etc."}, {"date": "4 Mar 2022", "title": "Graduate Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Webster University", "Interview Descriptions": "Interview process was fine. It was 3 total rounds of interviews.  The first interview was with the Director, the second interview was with the team , and the third interview was with the VP of the department.  3 interviews felt excessive for a low paying position.  But overall, experience was fine.", "Interview Questions": "How do you work under stress?"}, {"date": "11 Jun 2021", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Webster University", "Interview Descriptions": "There were multiple rounds of interviews with multiple people from the department  at every interview. It takes a while to find out if you moved on to the next round.", "Interview Questions": "If I had experience interacting with multiple locations. "}, {"date": "17 Apr 2019", "title": "Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Webster University in Apr 2019", "Interview Descriptions": "It was a little awkward we went from meeting on base to off base.  It was in the most awkward of places. Just seemed to laid back to be a university job.", "Interview Questions": "What type of car would you be? "}, {"date": "10 Feb 2020", "title": "Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Webster University (El Paso, TX) in Mar 2019", "Interview Descriptions": "Video conference interview.  Reviewed resume and asked basic questions and to give examples of such.  They went over availability and what the duties entailed and asked to expound on my past experiences as related to the primary duties of the position..", "Interview Questions": "Based on customer service experiences."}, {"date": "14 Apr 2017", "title": "Social Media Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Webster University (Saint Louis, MO)", "Interview Descriptions": "I applied and was contacted for an interview in December where I met with what would be the supervisor for the position. Following the interview, I was given a period of time in which I would hear back about a second interview. I heard back with in the time and was scheduled for a second interview about 3 weeks after the first. I also had to complete an assignment prior to the second interview. I met with 5 people and had a positive experience. I was told I would hear back and did not. I followed up and received an apology and explanation as to why I had not heard back. I followed up again after not hearing back some time after that and received much of the same as before. Finally, after nearly 3 months, I got a form letter response back from the university, not even the people I had been in contact with, telling me the position had been filled. I'm not sure why the decision process took so long and if they were not interested, it would have been best to hear sooner rather than later and from an actual person.", "Interview Questions": "How would you handle the numerous social media accounts out there related to Webster that we aren't in control of? "}, {"date": "3 Jan 2017", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Webster University (Saint Louis, MO)", "Interview Descriptions": "I interviewed by phone first, then had an on-campus interview in person where I spoke with a search committee, members of the office where I'd be working, and the person I'd report to.", "Interview Questions": "Why are you interested in working for Webster University? Why are you looking to transition from your current employer?"}, {"date": "11 Jul 2016", "title": "Media Center Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Webster University", "Interview Descriptions": "I walked into the office of the head of the media center. We talked for fifteen minutes. He asked me about my previous experiences and my career goals. Then he said I had the job. It was easy, but it was just a work study job.", "Interview Questions": "Where have you worked previously?"}, {"date": "6 Jun 2016", "title": "Department Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Webster University (Saint Louis, MO)", "Interview Descriptions": "There was no interview process. It was simply: come in, talk to the director of operations who proceeded to tell me about the position. Instead of asking me questions, I was told that the position was very demanding with conflicting priorities that had to be managed. I was then asked if I could handle that. I was also told that I needed to be able to answer phones and asked if I could do that. Again, there was no interview.", "Interview Questions": "Do you think you can do what I just told you about?"}], [{"date": "9 Mar 2016", "title": "Administrative Support Staff Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Webster University", "Interview Descriptions": "Phone, then in person. Search committee shared questions about how I worked in team, what would I do in an emergency, what strategies would I employ in the job. They did not provide feedback. That was a little intimidating. Pretty cut and dried. Asked about what programs I could innovate. Reasons for switching jobs. Did not immediately give an overview of what the job entailed besides what I read in the ad.", "Interview Questions": "Why do you want to work here?"}, {"date": "15 Jan 2019", "title": "Department Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Webster University (Saint Louis, MO) in Dec 2015", "Interview Descriptions": "thorough but quick, not much experience so we discussed what I could do for the company.  The manager was really cool and I was referred through a friend, so we just chatted about my graduation and other similar topics", "Interview Questions": "strengths"}, {"date": "19 Sept 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Webster University (Webster Groves, St. Louis, MO) in Oct 2015", "Interview Descriptions": "It was a very informal process. I was told by a professor to get a job as a tutoring center because they needed help. Twenty minutes after having this discussion with my professor, I went to the Academic Resource Center to speak with the tutoring advisor. They knew I was coming in. When I walked in they asked me if I knew the subject matter, I said yes and that I was an advanced student of my recommended professor. Once they heard my professor had recommended me they offered me the job. The interview lasted all of 10 minutes. I started that following day.", "Interview Questions": "Why do you want to be a tutor?"}, {"date": "14 Dec 2015", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Webster University (Washington, DC) in Jun 2014", "Interview Descriptions": "The interview was one of a panel interview, with a variety of individuals from the Webster University NCR team. It lasted just under an hour, and the questions were very thoughtful and employee focused. This was one interview I actually enjoyed, as it was not stressful and quite engaging and welcoming.", "Interview Questions": "What is your experience in dealing with adult education?"}, {"date": "15 Jan 2014", "title": "Programs Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Webster University", "Interview Descriptions": "I interviewed here a while back and it was a pretty strange process. At one point, the hiring manager dropped me off in a shared office space where the new hire would work alongside  two men. These two gentlemen were clearly not trained or prepared for interviewing a potential candidate. Here's how one of the exchanges went:\r\n\r\nGuy #1: Where do you live? Do you own or rent?\r\nMe: Um, I own a house in...\r\nGuy #1: Are you married? Do you have kids?\r\nGuy #2: I'm not sure we can ask that.\r\nGuy #1: Why not? She's wearing a ring.\r\nMe: Yeah, I don't mind answering, but you're really not supposed to ask.\r\nGuy #1: Well, I'm trying to determine if you have a lot of home responsibilities that might interfere with your work or prevent you from traveling.\r\n\r\nNeedless to say, I was pretty uncomfortable. This was the only time I've ever been relieved to not have gotten a job offer. I contacted the HR department later to tell them what happened. They were pretty shocked.", "Interview Questions": "Where do you live? \r\nDo you own or rent? \r\nAre you married? \r\nDo you have kids?"}, {"date": "28 Jan 2016", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Webster University (Saint Louis, MO) in Sept 2013", "Interview Descriptions": "I first interviewed at the regional campus.  The candidates were then narrowed to another person and me.  We were then flown to St. Louis to interview with the VP of Military Affairs.", "Interview Questions": "What would be my plan to increase enrollments. "}, {"date": "15 Jul 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Webster University", "Interview Descriptions": "I would prefer not to divulge this information at this point in time because it is not applicable to the process overall.", "Interview Questions": "N/A"}, {"date": "23 Feb 2017", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Webster University (Saint Louis, MO) in Jun 2013", "Interview Descriptions": "Lots of interviews. Met with a ton of different people, lasted full day, and meals out. Tour and open discussions. Meet with people who you never work with but need to sign off on your position. Overall a very positive interview experience. Panel interviews can be intimidating as anyone can attend and ask you questions, but it shows people want to know who they are working with.", "Interview Questions": "Lots of questions about diversity"}, {"date": "18 Apr 2016", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Webster University in Jun 2012", "Interview Descriptions": "There was zero interview process.  I applied.  Waited about 5 weeks to hear back and then was offered the position.  I did call several times to follow up.", "Interview Questions": "N/A"}, {"date": "24 Jan 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Webster University (Lexington Park, MD) in Jan 2012", "Interview Descriptions": "The interview process was thorough, relaxed and positive.  The Hiring Manager, the Director of the DC Capital Region offered many options for sites for employment to include Bolling, AFB and the Southern Maryland Higher Education Center in California, MD.  They call and confirm teaching availability at least 60-90 days in advance of terms.", "Interview Questions": "Describe your teaching and delivery process."}], [{"date": "30 Nov 2010", "title": "Campus Activities Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Webster University (Saint Louis, MO) in Jul 2008", "Interview Descriptions": "The hiring process was pretty intensive as far as what the current employees thought about you as well as, the graduate assistant who would serve as your manager. The process however went pretty quickly once you had a 1:1 meeting with the manager then a panel interview with other employees.", "Interview Questions": "Where do you see yourself in five years"}]]