[[{"date": "13 Jun 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Inspira Health Network", "Interview Descriptions": "I dont need an hour video interview with HR before even getting submitted to the hiring manager. What sort of process does that? You wasted both our time, I got dressed up for a \"real\" interview and the HR lady spent the entire hour with long pauses staring at me like I was an alien. Strangest interview ever in my life. Complete waste of time!", "Interview Questions": "They let you go right into a specialty as a new grad??? What company let you do this training? (on my resume!) Other. BS questions that revealed she was judging me based on my history and this HOUR of my time in the middle of a workday on video was a complete waste of my time, She already made up her mind, judgemental and she never met me!! hahahahaha"}, {"date": "11 Apr 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inspira Health Network", "Interview Descriptions": "Initial interview was with HR by phone and was set up via email. Next interview was with a manager via Teams (this was during Covid). HR then called back with the job offer.", "Interview Questions": "Tell me about a time you deviated from protocol and why."}, {"date": "13 Dec 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Inspira Health Network in Dec 2022", "Interview Descriptions": "Met with the recruiter via zoom for the first interview. She was very nice and friendly. Asked a lot of questions and gave good information. Next interview was a phone interview. Have not made it any farther yet.", "Interview Questions": "Asked me about my clinical experience. Asked about a difficult patient. Asked about a conflict with a team member. Asked about when I had a task that I wasn't sure how to complete and what did I do to complete it."}, {"date": "8 Nov 2022", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inspira Health Network (Vineland, NJ) in Sept 2022", "Interview Descriptions": "Recruiter was not kind. Spoke in a demeaning manner. Said she would follow up but never did. Explained the job description and experience needed for position but when applying experience was not stated.", "Interview Questions": "Asked about experience. Why do you want to work at Inspira?"}, {"date": "7 Jul 2022", "title": "Medical Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inspira Health Network", "Interview Descriptions": "overall not bad, the questions were easy and the process was fast\r\nI had a second interview within 10 minutes of finishing the first phone call interview, so I was happy about that", "Interview Questions": "What were 3 words your former employer would describe you as?"}, {"date": "21 Apr 2022", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inspira Health Network", "Interview Descriptions": "Basic interview questions including “tell me about a time when”.  Friendly interviewer. Reviewed job responsibilities and pay. Was told at the end of the interview that the position had already been filled by someone else.", "Interview Questions": "What are your Strengths and weaknesses "}, {"date": "12 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Inspira Health Network (Mullica Hill, NJ) in Apr 2022", "Interview Descriptions": "Too many emails that could have been accomplished with in-person one day time and far too much correspondence between too many people. The initial interview was simple but incessantly repeated with multiple people.", "Interview Questions": "Basic typical questions like how you deal with a patient who is being combatant etc."}, {"date": "4 Feb 2022", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inspira Health Network in Feb 2022", "Interview Descriptions": "The interview was virtual, and the recruiter was pleasant and nice. Took about 30 minutes, and was told the next process such as the pay rate and the benefits. The recruiter said she would reach out to the other departments", "Interview Questions": "Difficult client ? \r\n\r\nA challenge I faced? \r\n\r\n"}, {"date": "8 Dec 2021", "title": "Nursing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inspira Health Network", "Interview Descriptions": "Not sure but it was a virtual interview. It didn't take long. I did remember anything afterward. make sure to come prepared, eat, drink water and use the bathroom, dress up (business or casual)", "Interview Questions": "N/A"}, {"date": "30 Dec 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inspira Health Network in Dec 2021", "Interview Descriptions": "The interview was with the recruiter online. They provided a link before the interview. During the interview I was asked about my different positions and why I'm looking for a change. I had to explain why I left each position. I was then asked questions for about 30 mins. After the questions, I was told about the pay scale and about their sign on bonus. I was also told I'll have a second interview with management soon.", "Interview Questions": "What are your weaknesses and strengths?\n\nWhat was a mistake you made and how did you solve it?\n\nHow do you deal with patient/family conflict?\n\nHow are you dealing with the nursing shortage at work?\n\nWhat is one thing you don't like about your work? \n\nHow did you deal with a disagreement at work?\n\nHave you ever experienced co-workers discussing patient  information in a public setting?\n\nHave you called out a lot this year or arrived late?\n\nTell us about a time you made a positive difference for a patient.\n\nHow do you deal with a patient that is refusing care?\n\nDiscuss a time where you needed help and how did you go about it?\n\n"}], [{"date": "9 Jun 2021", "title": "Med Surg Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Inspira Health Network (Vineland, NJ) in Jun 2021", "Interview Descriptions": "The interview process was about 35 minutes long. Typical interview questions asked... strengths/weaknesses, 5 year plan, describe a conflict, describe a mistake you made, etc. Debbie the nurse recruiter was very straightforward with the questions. She explained all of the benefits thoroughly.", "Interview Questions": "What would your past employers say about you?\nWhat is a mistake you have made in the past that you corrected?"}, {"date": "7 May 2021", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inspira Health Network", "Interview Descriptions": "The interview process was great. I had a phone interview with HR and later interviewed with the hiring manager and 2 supervisors. It was very professional. I heard back a week later.", "Interview Questions": "Why do you want to work at Inspira?"}, {"date": "9 Feb 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inspira Health Network in May 2021", "Interview Descriptions": "The process was very easy and straightforward. Staff were willing to listen and were able to cooperate to bring you forward. The position was vacant and staff were immediately hiring at the time.", "Interview Questions": "What is your flexibility to work?"}, {"date": "11 Feb 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inspira Health Network", "Interview Descriptions": "I applied online, within 1 week they reached out for an interview. It was a simple phone interview but right at the beginning I was told about employees already wanting the jobs so they would take priority over me. We continued with the interview and was told within one week the hiring manager would reach out for an interview if chosen, 5 hours later I got an email that I wasn’t chosen the other candidate was. I don’t know why they even bothered with the interview.", "Interview Questions": "A time I had a difficult patient"}, {"date": "28 Jan 2021", "title": "CHHA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inspira Health Network (Vineland, NJ)", "Interview Descriptions": "Applied online received email for initial interview with HR within a week, then interview with manager of department I would be working in, and was hired on the spot. I was set up for training the following month", "Interview Questions": "What makes you want to work for us? "}, {"date": "19 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inspira Health Network (Elmer, NJ) in Jan 2021", "Interview Descriptions": "This interview was better than I thought it was quick and straight to the point.  I was asked about five questions and there were multiple managers interviewing me. I received an offer and I accepted", "Interview Questions": "Why do you want to work here? "}, {"date": "22 Feb 2021", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inspira Health Network (Mullica Hill, NJ) in Jan 2021", "Interview Descriptions": "Great interview process. There are two rounds, and both are brief. You must highlight your working knowledge of the role and who you are as a person.\n\nIn my opinion, the interview is a great place to connect with the people on the call. I interviewed 1 person and my second round with 4 people of various departments and locations.", "Interview Questions": "Would you be able to work from X time to Y time?"}, {"date": "2 Dec 2020", "title": "Outpatient Licensed Practical Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Inspira Health Network", "Interview Descriptions": "Applied and received an email for a phone interview with a manager. Manager forgot about it. Rescheduled. Only asked two questions. I followed up with an email a few days later asking about the status of my application.  Never received anything back. Big waste of time.", "Interview Questions": "Please tell me about yourself "}, {"date": "16 Nov 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Inspira Health Network", "Interview Descriptions": "It was a quick process. Pretty basic questions.  You start with an interview with HR then you may get an interview with the nurse manager of the floor.  Then from there they'll decide if you're a good fit or not.", "Interview Questions": "Why did you choose Inspira?"}, {"date": "21 Jan 2020", "title": "Information Systems Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inspira Health Network", "Interview Descriptions": "The entire interview was unprofessional and a waste of time. Very unorganized, and the interviewer made it clear that there would be headaches for myself if I were to get an offer. I left the interview with the intention of never wanting to interview at Inspira again. I was only asked one related question in an entire hour.", "Interview Questions": "Describe your work experience"}], [{"date": "11 Jan 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inspira Health Network (Mullica Hill, NJ) in Jan 2020", "Interview Descriptions": "The hiring manager was very kind and showed me around the unit. She was late to the interview but explained thoroughly why and there were no hard feelings just made me a little more nervous due to overthinking. Overall a very pleasant experience.", "Interview Questions": "How would you handle a co-worker that was being difficult?"}, {"date": "31 Aug 2019", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inspira Health Network (Mullica Hill, NJ)", "Interview Descriptions": "It was a group interview for the new hospital opening up. Each person was assigned an appt time to come in for an interview. The recruiting staff first gets to know you and asks a good amount of question. That took about 30 mins. Then I met with the hiring manager and had more questions asked, which also took about 30 mins. 3 weeks later I was offered the position.", "Interview Questions": "What are your strengths and weakness?"}, {"date": "13 Aug 2019", "title": "Director of Community Engagement Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inspira Health Network (Trenton, NJ) in Jul 2019", "Interview Descriptions": "Organized and efficient.  Prompt responses to email and phone calls.  Everyone that I interviewed with was informative with regards to the expectations for the role.  Staff seemed to like working for the organization and were friendly.", "Interview Questions": "Experience essential to the job"}, {"date": "16 Jul 2019", "title": "Dietary Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Inspira Health Network (Vineland, NJ) in Jul 2019", "Interview Descriptions": "Interview process was pretty easy. They ask a lot of questions you can simply study for. After my first interview I was told I could move on to a second interview. Second interview came and questions were just as easy as the first. Both women that interviewed me were very nice. I was given a business card just in case I wasn’t called for the 2nd interview. My first interview was on a Thursday and I had my second interview set up by the following Tuesday.", "Interview Questions": "What are you strengths? Weakness? And a lot of Scenarios.. (tell me a time you had conflict with a coworker and explain in detail how you resolved the issue.."}, {"date": "7 Jun 2019", "title": "Assistant Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Inspira Health Network", "Interview Descriptions": "Medication calculation test, then waited 45 mins for\nInterview, then in person interview with HR rep which took 20 mins. A lot of questions and brief description of job. Overall questions were simple", "Interview Questions": "Strengths?"}, {"date": "13 Oct 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Inspira Health Network (Vineland, NJ)", "Interview Descriptions": "After two interviews,  they told me to send an email with my availability so that I can come back and meet the entire team. After sending an email and a follow-up, I never heard back from her. A few days later, I saw that they reposted the job. I would understand if they told me that they're still interviewing and that they'll keep in touch, but they told me that I was clear for the next step and that they want me to come in within the next two weeks. I still haven't heard from them. Very unprofessional and untrustworthy. Be wary.", "Interview Questions": "What is your management style?"}, {"date": "20 Oct 2017", "title": "Housekeeping Aide Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Inspira Health Network (Vineland, NJ) in Oct 2017", "Interview Descriptions": "Never ask me  any questions about housekeeping,  Ask me weird question that had nothing to do with the position that I  applied And she was coming off rude most of the interview.", "Interview Questions": "Why did I quit my other job ? "}, {"date": "30 Sept 2017", "title": "Mental Health Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Inspira Health Network (Vineland, NJ) in Sept 2017", "Interview Descriptions": "Very short before I was able to even begin this interview I was told that the position had been basically given to 2 other interns. I was not able to understand why I was called for a interview knowing the position was taken .communication was not in good standing. I also do not livein the Cumberland county area so I drove a hour to get to Vineland to hear this news I was told I was more then qualified for this position  but if the interns did not take this position I would be able to move forward. I don’t understand why I was not notified of this before hand I feel as though I was racially profiled when entering this interview.", "Interview Questions": "If I would be interested in per diem "}, {"date": "18 Nov 2018", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Inspira Health Network (Vineland, NJ) in Nov 2016", "Interview Descriptions": "The hiring process is long. It took me about 4 months from my initial interview to get hired in my position. In the intial interview you have to take a typing test. The interviewer was helpful as I didnt intially apply for this position. If they like you, they will try to get you hired.", "Interview Questions": "How would you be an asset to you team?"}, {"date": "25 May 2016", "title": "Payroll Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Inspira Health Network (Bridgeton, NJ)", "Interview Descriptions": "The interview with the recruiting manager was very good.  When it came time to meet the person doing the hiring it was not so good. A few unprofessional questions were asked, such as \"do you want my job\"?   It was a little unsettling and was one of the most difficult interviews I have ever had. Other questions were cookie cutter questions that you find on the web.", "Interview Questions": "Why should I hire you?"}], [{"date": "4 Jan 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inspira Health Network (Elmer, NJ) in Aug 2015", "Interview Descriptions": "I met with the hr manager and we discussed benefits first, she actually tried to get me to take another job, then I met with the workplace manager and she discussed the job and about 3 weeks later I found out I got it.", "Interview Questions": "Why are you leaving your current job"}, {"date": "1 Jan 2017", "title": "ER Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Inspira Health Network (Woodbury, NJ) in Jul 2015", "Interview Descriptions": "Extremely slow, you sit and wait and wait finally get in to talk to someone and it's literally 3 questions and about 5 minutes and your interview is done. Very unprofessional in my opinion. I'd think that an interview would be longer maybe more thought out instead of short and non specific to the job or hospital. Totally not worth the time to go for the interview. It was more of a casual Friday kind of feel.", "Interview Questions": "Why should we hire you?"}, {"date": "2 Oct 2017", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Inspira Health Network (Woodbury, NJ) in Sept 2014", "Interview Descriptions": "Interview with HR, then interview with the office manager. I was called about a week later and offered the job. Although i have had other co workers that say the process took a lot longer then 2 weeks.", "Interview Questions": "What would you do in a situation that the patient is unhappy?"}, {"date": "7 Dec 2013", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Inspira Health Network (Vineland, NJ)", "Interview Descriptions": "The interview process was decent, yet it wasn't an adequate reflection of what the job experience would ultimately entail. Most people in an Interviewing environment cannot understand what a Sterile Processing Tech really is responsible for..Most Interviewers don't even know what the job requires. And the expectations placed upon an employee are never adequately brought into focus during an interview, or an employer would scare 90% of people away. I just felt that the minuses of working in Sterile Processing are never discussed because most HR departments don't have a clue how stressful the environment is.", "Interview Questions": "How would I handle a difficult Doctor upset over instrumentation not being ready? "}]]