[[{"date": "18 May 2023", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Christian Horizons (Kitchener, ON) in Jan 2022", "Interview Descriptions": "two times interviews, the interviewers were very friendly but had many questions, so you have to be well prepared. and you have to be very supportive and have volunteering hours for the same.", "Interview Questions": "how do you find yourself working with people who have difficulty?"}, {"date": "28 Sept 2021", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Christian Horizons", "Interview Descriptions": "It was an interview with a program manager and a district manager.  It was in an office and it was a behavioral interview where they asked for examples of times where you displayed the qualities they are looking for.", "Interview Questions": "Tell me about a time you showed leadership in the workplace"}, {"date": "13 May 2021", "title": "HR Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Christian Horizons", "Interview Descriptions": "Very efficient interview process. I was contacted by a recruiter for a short phone screen.  The next step was an interview  with the recruiter and HR manager in a 30 minute video chat.", "Interview Questions": "Why do you want to work for Christian Horizons?"}, {"date": "30 Aug 2021", "title": "Seasonal Communications Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Christian Horizons (Waterloo, ON) in May 2021", "Interview Descriptions": "Online via Teams with one other person. The interview was professional and gave me the chance to provide insight of my experience while looping back to the position I was applying for", "Interview Questions": "Why do you want to work at Christian Horizons?"}, {"date": "24 Jun 2021", "title": "Direct Support Professional (DSP) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Christian Horizons in May 2021", "Interview Descriptions": "Interviewed with 3 individuals, the HR, the manager and a recruiter for the workplace. HR went over my past work experiences and an overview of the job and the manager went over experienced based questions.", "Interview Questions": "How have you dealt with stressful situations in your past experiences? "}, {"date": "4 Sept 2019", "title": "PSw Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Christian Horizons (Cobourg, ON) in May 2019", "Interview Descriptions": "The interview process was good . They let me know approximately 1-1/2 weeks later that I was offered the position . Then I accepted the position in cobourg, but I need more hours.", "Interview Questions": "To describe a time where I went over and above my requirements "}, {"date": "11 Apr 2021", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Christian Horizons (Chatham-Kent, ON) in Dec 2018", "Interview Descriptions": "Basic interview that maybe took 15-25 minutes. Two interviewers that took turns asking questions. The main questions asked were  behavioural and situational questions and how you would react.", "Interview Questions": "What would you do to help a non verbal client find new goals for the year? "}, {"date": "18 Nov 2019", "title": "Direct Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Christian Horizons (Saskatoon, SK) in Jun 2018", "Interview Descriptions": "it was a not too difficult exercise. there were 3 interviewer. it lasted for about 45 minutes. basic questions about how you would handle a situations in the house. the interviewers were quiet nice and accommodating.  They gave time to think about the question and proffer an answer.", "Interview Questions": "how do you handle crisis?"}, {"date": "15 Jun 2022", "title": "Direct Support Professional (DSP) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Christian Horizons (Ottawa, ON) in Jan 2018", "Interview Descriptions": "Interview lasts approximately an hour. Questions are based around actual experiences. I felt comfortable with the interview process. It usually ends with a writing component. They will inform you if you are or are not the successful candidate.", "Interview Questions": "Describe a time you had an ethical issue and how did you resolve it?"}, {"date": "19 Jan 2016", "title": "Developmental Services Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Christian Horizons (Ottawa, ON) in Feb 2015", "Interview Descriptions": "3 stages. First was with the HR rep they asked about my skills and past work experience specifically with individuals with special needs.t\r\n Then stage two was similar but with an area manager as well going over how to handle certain behavioral situations.", "Interview Questions": "What would you do of a client wanted to watch porn?"}], [{"date": "14 Jan 2014", "title": "Relief Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Christian Horizons", "Interview Descriptions": "Initially I applied online and within two days I received a call from the departmental office asking when I would be available for an interview. I agreed to a time to meet with them the following week. During the first interview, there were three people interviewing me, two staff members and one person with exceptional needs. He was placed there to gauge my reaction to conversing with someone who had exceptional needs, which was appropriate given that the nature of the job was developmental service work in a relief capacity. I answered the questions that they asked me, and following that I was required to fill out a form, provide references and complete a police background check. After I had completed these forms I was asked to send the completed forms to them, and fortunately was asked to come back for a second interview, which took place a couple weeks after the fact. At the second interview I was interviewed by different people, one of which was the manager who eventually hired me to work for her at the group homes that they supervised. I answered several of the questions that they answered, and then was asked to type out the answer to a few questions that were typed onto a piece of paper that they handed me. I completed the answers on that form - which were related to my prior experience to those with exceptional needs - and emailed the answer to those questions to the email address provided to me. After a week passed, I was asked to come and visit one of the homes that Christian Horizons operated out of, and after visiting that home was asked if I would like to work at that home. I said that i would like to, and at that point I was offered a position, though no written offer was provided to me until the following meeting.", "Interview Questions": "The most difficult question that I was asked was how I would go about aiding someone with exceptional needs in managing their finances."}, {"date": "6 Aug 2015", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Christian Horizons (Toronto, ON) in Mar 2011", "Interview Descriptions": "Phone interview followed by 1:1 interview with scenario questions. Although the interviewer had worked front line, she did not have a full grasp of the profession. Asked questions and reacted in ways designed to rattle the candidate. Hired into a recommend for hire pool. 3rd stage interview by program manager followed by 4 hr observation shift.", "Interview Questions": "How would you prepare for a community outing."}]]