[[{"date": "10 Jun 2023", "title": "Dialogueur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Corris (Lausanne)", "Interview Descriptions": "Explication du entier, présentations personnelles devant des coachs mise en situation puis délibération. Après l’entretien on commence la formation avec signature de contrat remise du materiel (tablette, veste, vêtements…) visite du local", "Interview Questions": "Mise en situation en binôme"}, {"date": "15 Nov 2021", "title": "Candidata Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Corris", "Interview Descriptions": "Il colloquio è perfetto per capire chi é la persona più giusta per la posizione. Consiste in una prova in aula e una in strada. Questo permette di capire chi è portato per il lavoro sul momento.", "Interview Questions": "Come approcceresti una persona anziana in stazione?"}, {"date": "28 Apr 2021", "title": "Dialogatore Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Corris (Bellinzona) in Apr 2021", "Interview Descriptions": "All’inizio ti presenti, dici un paio di cose su se stesso, dopo ti viene spiegato il modo di lavorare e di cosa si tratta. Come ultimo step devi avere una conversazione esempio con il coach, mostrando un po’ le tue skill di convinzione", "Interview Questions": "Sai di cosa si tratta nello svolgere questo lavoro?"}, {"date": "14 Oct 2020", "title": "Dialogueur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Corris", "Interview Descriptions": "Une journée au bureau avec une  formation en groupe avec d'autres postulants, une simulation d'une conversion avec un passant après quelques minutes de préparations et interview en tête à tête avec un recruteur. La réponse est donnée sur place.", "Interview Questions": "Travaillez-vous plutôt en équipe ou en solo?"}, {"date": "23 Feb 2019", "title": "Dialogueur Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Corris (Lausanne)", "Interview Descriptions": "A l'heure du rdv à Lausanne, vous êtes une bonne quinzaine convoqués pour cet entretien, à l'issue duquel 3-4 personnes seront retenues.\r\nVous êtes accueillis par un homme d'une trentaine d'années, Pierre-Alain, très gentil, qui vous mettra rapidement à l'aise. Vous êtes invités à prendre place dans une petite salle où Pierre-Alain vous présente l'entreprise, toutes les modalités à connaître (salaire, heures de travail, conditions...). Une heure plus tard, Pierre-Alain annonce que les \"coachs\" vont venir se présenter, et que l'on devra à notre tour se présenter individuellement devant eux. Ce sont les \"coachs\" qui choisissent qui ils recrutent, car c'est directement avec eux que l'on travaille ensuite. Très vite, on ressent l'hypocrisie de ces coachs qui se prennent pour les managers d'une grande banque. Ils se présentent, jouent un rôle de dialogueur devant nous pour vous montrer un exemple du processus à utiliser pour aborder les gens dans la rue. Ensuite, chacun se présente : prénom, d'où tu viens, ton parcours scolaire/expériences jusqu'ici, quelles causes tu soutiens, un adjectif te qualifiant pour le poste de dialogueur, tes disponibilités et à partir de quand. Et c'est là que tout se joue : il faut se montrer hyper extraverti, en faire des tonnes, tenter d'avoir un échange avec les coachs, les faire rire. Sinon, autant quitter l'entretien après les présentations, car vous serez restés pour rien.\r\nBref, tout le monde se présente, les coachs prennent des notes sur chaque candidat.\r\nEnsuite vient l'étape de l'entrainement-test : Pierre-Alain distribue des carnets sur WWF avec plusieurs sujets à propos de la protection animale. On vous laisse dans la salle, vous avez une dizaine de minutes pour préparer des notes pour votre jeu de rôles : une phrase d'accroche, une problématique, une présentation de WWF, des solutions possibles et les effets des donations. Ensuite, on se retrouve tous dehors, on se met par groupes de 2 : chacun à son tour, on joue le rôle de dialogueur et de passant. Pendant ce temps, les 5-6 coachs se promènent entre les binômes et écoutent une partie de votre jeu de rôles.\r\nEnsuite, les coachs repartent dans le local pour délibérer et choisir leurs 3-4 candidats. Ils vous font attendre une bonne heure dehors pendant que chaque coach appelle chacun à son tour les candidats. Le coach vous fait refaire un test, cette-fois ci avec lui en tant que passant. Il vous pose quelques questions (voir plus bas), puis vous dit si vous êtes sélectionné(e) ou non.\r\nSi vous êtes sélectionné(e), vous sortez une heure pour manger puis reprenez l'après-midi pour la formation avec Pierre-Alain et les coachs.\r\n\r\nCe que j'en retiens : \r\n- Pierre-Alain est adorable et très humain, les coachs beaucoup moins : on voit vite qu'ils ne se prennent pas pour de la m*rde (ils ont pourtant tous commencé en tant que dialogueurs...). \r\n- Si vous ne faites pas bonne impression dès les présentations, ça ne sert à rien de continuer : les coachs font en réalité leurs sélections bien avant. Si vous avez fait preuve d'extraversion dès les présentations, vous serez pris(e) même si vous faites une catastrophe lors des jeux de rôle. Les coachs vous donneront simplement des conseils pour vous améliorer pour aborder les passants.\r\n- L'entretien est long, vous prenez toute la matinée et vous patientez ensuite plus d'une heure dehors sans savoir si vous êtes pris ou non.", "Interview Questions": "Qu'est-ce que tu fais si le passant n'a pas l'air intéressé ?"}, {"date": "16 Mar 2019", "title": "Dialogueur Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Corris (Lausanne) in Mar 2019", "Interview Descriptions": "Entretien en groupe pas très professionnel, demande des informations en groupe alors qu'il y a des questions priver nous mettent dehors pour faire les entretiens individuels, nous sommes une quinzaine et nous venons tous pour la même chose c'était un entretien très perturbant.", "Interview Questions": "Comment avez vous connu corris"}, {"date": "4 Dec 2022", "title": "Call Center Agent Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Corris (Zürich) in Aug 2018", "Interview Descriptions": "Erstes Gespräch war in einer Gruppe. Die Leute waren sehr freundlich und offen. Alles wurde klar kommuniziert und es gab spannende Aufgaben zu lösen. Ich fühlte mich sehr wohl und willkommen.", "Interview Questions": "Für welchen Zweck möchten Sie sich einsetzen?"}, {"date": "23 Jul 2018", "title": "Dialogueur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Corris (Lausanne) in Jan 2018", "Interview Descriptions": "Tout le monde arrive à 9h. Environ 10-15 personnes sont là dans le même but que toi. On vous appelle pour aller dans une salle ou ils y aura les évalués, et différents coachs qui vous prendront ou non dans votre équipe.\r\nCeux assis devant commencent à se présenter, suivis par ceux assis derrière. Nom, prénom, âge, lieu ou l'on habite, pourquoi on est à cet entretien.\r\n/!\\ Après avoir été embauché, on m'a confié que tout se jouait pendant cette présentation /!\\\r\nEnsuite, c'est l'école: on vous donne un carnet sur WWF (pour ma part) avec énormément d'informations. On a 20min pour préparer un \"speech\" digne de ce nom. \r\nAprès ces 20min on va tous dehors, tout le monde choisit un binôme et on se speech mutuellement. LÀ il faut avoir la tchatche. Les coachs passent vers vous et vous écoutent pour vous donner des conseils (en général c'est à ce moment là que tu remarques quel coach est intéressé par toi). \r\nEnsuite on attend tous dehors pendant que les coachs rentrent et débriefent. On vous appelle un par un, j'ai été le premier. \r\nUn bureau qui te sépare toi du formateur. Quelques questions (notées ci dessous), et ensuite un poignée de main pour soit vous féliciter: Félicitations et bienvenue chez Corris, soit vous recaler en vous expliquant pourquoi.\r\nAprès il y a une pause pour manger et toute l'après midi on vous forme. Chacun a son coach et son association.\r\nÀ savoir: à mon entretien il n'y a eu que 4 personnes prises sur 15, et à la fin de la première semaine de travail plus que 2.", "Interview Questions": "Pourquoi vous et pas un autre? "}, {"date": "24 Jan 2018", "title": "Dialogueur Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Corris (Lausanne) in Jan 2018", "Interview Descriptions": "On vous test pendant 10 minutes si sa le fait ils vous prennent vous forme a la va vite vous explique énormément de chose qu'il est compliqué de retentir entre le logiciel le speech les formulaire l'imprimante et on fini par vous dire oui bon quand même cest pas normal de ne pas y arriver vous avez été formé", "Interview Questions": "Pourquoi devrions nous vous prendre dans l'équipe? "}, {"date": "17 Aug 2021", "title": "Dialogatrice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Corris (Lugano) in Jun 2017", "Interview Descriptions": "Il colloquio richiedeva essenzialmente un'elevata capacità comunicativa; bisognava improvvisare un incontro con un potenziale cliente e parlare delle iniziative di un'associazione umanitaria o ambientale che fosse. Dunque, si veniva valutati in base a quanto ben impostato e fluente risultasse il discorso", "Interview Questions": "Che cosa ti ha spinto a scegliere questo lavoro?"}]]