[[{"date": "24 Jan 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elica Health Centers", "Interview Descriptions": "It was a super simple but took kind of long to hear back from HR. I had one recruiter call and then one thirty-minute interview with the manager and head medical assistant at the location where you will possibly get placed", "Interview Questions": "past experience, how you would handle certain situations"}, {"date": "21 Jan 2023", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Elica Health Centers", "Interview Descriptions": "Hiring manager very disrespectful and rude. She would make it sound as if I wasn’t qualified yet would berate me with questions and continue the interview. Waste of time in my opinion especially with the low pay that they offer. Definitely going to consider elsewhere.", "Interview Questions": "Why do you want to work here?"}, {"date": "10 Nov 2022", "title": "Dental Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Elica Health Centers (Sacramento, CA) in Nov 2022", "Interview Descriptions": "Easy and friendly very nice people great interview looking forward to starting my forever place of employment Great benefiys, PTO, Holidays, Sick and family coverage I rec anyone to apply if you want to work at a great place", "Interview Questions": "Why do you want to work at Elica?"}, {"date": "15 Dec 2022", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elica Health Centers (Sacramento, CA) in Dec 2020", "Interview Descriptions": "The interview was smooth and comfortable. The interviewer asked questions that I could elaborate on. I was able to share my past experiences and how I have grown since then.", "Interview Questions": "How do you work on a team?"}, {"date": "19 Jun 2019", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Elica Health Centers (Sacramento, CA) in Jun 2019", "Interview Descriptions": "One on one with various questions lasting up to half an hour. Went over what was on my resume and then in detail further explained my experiences  and what I encountered during my past jobs. Related to certain skills more personally and the company’s mission statement. They also wanted to know where I see myself in the future and how willing I was to train or take on further training so I can be applicable in more than one position or one office. They ask if you have reliable transportation.", "Interview Questions": "Why did you have an interest in Elica Health?"}, {"date": "22 May 2019", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Elica Health Centers", "Interview Descriptions": "The interview process was well organized and casual.  I met with members of the administratie and clinical team.  I went to several clinics and they shared how their EMR system worked.", "Interview Questions": "Why did I want to join Elica Health."}, {"date": "3 Mar 2020", "title": "Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Elica Health Centers (Sacramento, CA) in Oct 2018", "Interview Descriptions": "I applied online, received an e-mail for an interview, picked a time, interviewed, and I followed up in a week. Found out I had gotten the position, then waited for HR to call me to confirm officially. Did a physical, drug test, TB test, and then had orientation within a couple of weeks.", "Interview Questions": "What did you do in your previous internships that would help you succeed in this role?"}, {"date": "21 Feb 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Elica Health Centers (Sacramento, CA) in Feb 2018", "Interview Descriptions": "Interview took place in the office with 2 ladies. 1 serious questions was asked thats it. It was super easy. I got a phone call the very next day saying I got the job.", "Interview Questions": "What would you of if PT came in for Rx refill and Dr. was not in the office. "}, {"date": "7 Jul 2017", "title": "IT Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Elica Health Centers (Sacramento, CA) in May 2017", "Interview Descriptions": "First Interview was over the phone, 2nd was with a panel of 4 - 3 in a round table conference room and 1 CIO remote on the phone and the final was a panel consisting of CEO, Head of HR and a employee from the first panel.  It came down to someone else and myself and they told me I'd hear a response in a few days... I had to actually call them!  Perhaps the reviews are correct...  probably would have been an awful place to work!", "Interview Questions": "They had 1000 questions!"}, {"date": "1 Feb 2018", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Elica Health Centers (Sacramento, CA) in Jan 2017", "Interview Descriptions": "when i first applied they never called me back after my second interview at the admin, then after that the dental manger saw me and knew that i am bilingual and wanted to hire me, she sat with me , asked me couple of questions along with the dentist there, go over the rules and dental office routine and the job description with me , sent me to do my tests and physical right after, i went very smooth and it was very professional", "Interview Questions": "what experience do i have in customer service "}], [{"date": "10 Dec 2016", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Elica Health Centers (New York, NY)", "Interview Descriptions": "Very short. When I was hired, I went in to interview and started the next week. The company did not drug test. I went in to the admin office and waited 45 minutes for an human resources representative to arrive.", "Interview Questions": "When I could start."}, {"date": "3 Mar 2020", "title": "Community Development Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Elica Health Centers (Sacramento, CA) in Jul 2016", "Interview Descriptions": "Elica's interview process was well-prepared and thorough.  Many questions were asked about my fundraising and community outreach experience.   The interview also focused on Elica's healthcare accomplishments, and its service to low-income, medically-underserved populations.", "Interview Questions": "Elica asked a question about how I would approach fundraising at Elica?"}, {"date": "3 Jun 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Elica Health Centers (Sacramento, CA) in Sept 2011", "Interview Descriptions": "Multiple interviews, including with board member(s), other staff and CEO.", "Interview Questions": "Asked to draft sample business strategy."}]]