[[{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great surgeons!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Dec 2020", "job_title": "Certified Surgical Technologist in Beckley, WV", "duration": "N/A", "pros": "Great doctors and OR staff. Very clean hospital and nice OR.", "cons": "OR management could’ve been nicer."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "CHS GVMC", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Dec 2020", "job_title": "Medical Laboratory Scientist in Lewisburg, WV", "duration": "N/A", "pros": "Small \r\nLearning facility \r\nPay\r\nCommunity Based", "cons": "Understaffed\r\nManagement\r\nNo advancement in career\r\nSchedule managing"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Great if you are looking for a local hospital to work, as its your only local choice, otherwise, its atrocious", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Aug 2010", "job_title": " in Lewisburg, WV", "duration": "N/A", "pros": "The only positive thing about working at GVMC is that if you live in the Lewisburg/Ronceverte area, and do healthcare, it's local to you.", "cons": "To begin with, GVMC gives sub par healthcare to it's patients, and treats it's employees even worse.  I moved to the area for other reasons, and applied at GVMC.  I accepted the position when it was offered to me, even though it was a 65% pay cut for from my previous facility.  Pay is understandable, GVMC is a small 120 bed hospital, so I expected the pay cut, just not that severe.\r\nIf you work in the healthcare field doing direct patient care, and are NOT a physician, you may find this facility tedious and absurd if you have worked at other facilities who have advanced past 1983 medical practices.  Physicians are still looked upon here as \"gods\" who are not to be questioned, regardless of their abilities/knowledge base.  After observing several physicians ordering non indicated medications and other treatment modalities, I began to become more verbal about it, and was told other healthcare workers are not to question physicians. \r\n The emergency room physician and staff in general are probably the worst.  The physicians don't see patients in the emergency room for roughly the first 20-25 minutes that they get an actual  room.  The nurses have a check list of generic orders they can just check off to do and the physician later signs the orders.  Many of these orders are non indicated as well.  Unnecessary labs, ekg's, breathing treatments, all to patients who have no true indication for them, and are either done because the staff (physicians included) are not competent in their diagnosing skills and have to order an enormous battery of tests to diagnosis, OR it is simply done to bill health insurance/medicare/medicaid and increase the facilities revenue.  \r\nMany of the physicians that work at this hospital are older, and do not seem to be aware that advances have been made in medicine, as they still seem to practice as if it is 1983.  I never met one physician who was open or receptive to discussion/suggestions/or input about patient care, no matter how outdated their practices and treatments were.\r\nThe hospital has a terrible reputation amongst the locals in the area, I was told by many many people in the community that the nickname for Greenbrier Valley Medical Center was \"Death Valley\", I'm not sure I would go to that extreme.  The nearest hospital is over an hour away besides GVMC, and unless I would die within 10 minutes, I would take the chance to drive to another facility for healthcare.  \r\nI can honestly say their is nothing positive about this facility as a whole, or even any department in general."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Not worth it", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Jul 2019", "job_title": "Phlebotomist in Ronceverte, WV", "duration": "N/A", "pros": "Great place to get experience straight out of school. That's about it.", "cons": "Pay sucks. Yearly raise sucks.  Too much favoritism. Understaffed in all departments.  No teamwork"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible company", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Aug 2017", "job_title": "Phlebotomist in Ronceverte, WV", "duration": "N/A", "pros": "Great experience for entry level work. That's about it. Seriously the worst place to work", "cons": "Terrible management, no team players. Too many chiefs not enough Indians.  Management give no support towards goal. Doctors willing to let patients die. Keeps patients in emergency room way to long to get more money out of them. Management refuses to hire help. Raises suck."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible Management STAY AWAY", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Oct 2020", "job_title": "Registered Nurse, BSN in Ronceverte, WV", "duration": "N/A", "pros": "Staff is fairly nice depending where you work.", "cons": "Rude management.\r\nHorrible pay - no weekend diff. night diff +1$. \r\nHostile work environment, especially if you're not a local.\r\nScary that the hospital has no real \"protocols\".\r\nNO SELF SCHEDULE."}], []]