[[{"date": "3 Mar 2023", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Art Institutes", "Interview Descriptions": "Good The Art Institute is a great, great art museum. From the lions out front, to seeing treasures of the world, the experience is fabulous. My office was down the block from the museum, and I have been there a couple of hundred times. A must to see for everyone coming to Chicago.", "Interview Questions": "What do you want to work with us"}, {"date": "8 Jan 2023", "title": "Sales Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Art Institutes", "Interview Descriptions": "Questions around my experience and what I can contribute to the company. Interview was conducted One on one at the school office. I really like the energy of the school. Interviewer was very friendly and professional.", "Interview Questions": "Why do I think I will be successful in my role here?"}, {"date": "4 Nov 2022", "title": "Asst. director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Art Institutes", "Interview Descriptions": "Group interview so you will not get to ask many questions, that will make it hard to determine if you actually want the job. The 2nd interview is where you go into depth", "Interview Questions": "Do you have hustle, are you good at interviewing people"}, {"date": "25 Jun 2022", "title": "Adjunct Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Art Institutes", "Interview Descriptions": "I was cold called by the chair of the program on a day not agreed upon.  Full interview is to be scheduled later. I'm curious about them as a school- I've never worked for a for-profit institution before.", "Interview Questions": "Asked about experience and history "}, {"date": "2 Feb 2022", "title": "Student Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at The Art Institutes", "Interview Descriptions": "It was easy only 1 interview.  I got a call they scheduled face to face interview. After 2 days they called and offer me the position. Their Onboarding was easy too", "Interview Questions": "What are my expectations in past?"}, {"date": "26 Nov 2021", "title": "Enrollment Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes", "Interview Descriptions": "There are two rounds of interviews. In the second interview, the interviewer never showed up at all. Was waiting for over an hour.  When I contacted the recruiter about this(for this position), he said for me to double-check I had the right link. In the second actual interview, the interviewer never apologized or mentioned what happened prior. Offered a position, asked to have a couple of days to review it but the recruiter began to pressure me that night. Insisting for me to call him (at 10 PM) to talk more about the role and as to why I was hesitant. Unprofessional.", "Interview Questions": "Basic higher educations questions about admissions process"}, {"date": "8 Sept 2021", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Art Institutes", "Interview Descriptions": "Interrupted by several position description changes.  One phone screen,  and one in-person with 6 panelists about 3 months later.  The phone interview lasted about 20 minutes and the in-person about 40.", "Interview Questions": "Tell me about a time you had to give bad news to someone."}, {"date": "31 Aug 2021", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Art Institutes", "Interview Descriptions": "Two interviews. After being recommended from first interview then they’ll call to set up a second interview and then depending on how well you did they’ll offer position. Quick and easy", "Interview Questions": "Basic admissions or higher Ed questions"}, {"date": "28 Jul 2021", "title": "Admissions Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Art Institutes", "Interview Descriptions": "Long due to politics. Takes awhile for a response after initial group interview. Then second interviewed narrowed down then a wait game for offer. Everyone is pleasant during the process with a sense of urgency.", "Interview Questions": "How do you respond under pressure "}, {"date": "25 May 2021", "title": "Assistant Director of Admissions Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Art Institutes", "Interview Descriptions": "Met with multiple people on the Admissions team. Was asked about sales experience and approach. Additionally, I was asked to meet with the school's president. The walked me around the admissions area.", "Interview Questions": "Why are you interested in admissions?"}], [{"date": "22 Mar 2023", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Art Institutes in Jan 2021", "Interview Descriptions": "HR will vet your resume. The Dean of Campus and or the Department chair will interview you. A panel interview may also occur. You will recieve a tour of the campus and maybe a teaching demo", "Interview Questions": "Why do you want to work here?"}, {"date": "9 Sept 2020", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Art Institutes", "Interview Descriptions": "Very relaxed and conversational. This is with the former dean. Securing the interview was a good deal of “hurry up and wait” and then there wasn’t clear communication from the admin office on what was needed and when (documentation/transcripts/etc.) \r\n\r\nOverall, it was brief.", "Interview Questions": "What would be at the top of a “resume of failures”"}, {"date": "25 Dec 2019", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Art Institutes", "Interview Descriptions": "Interview process was fairly easy at this particular school. Group interview and then subsequent interviews with HR and director managers. Very friendly. Stated clearly expectations of the role.  Got the offer.", "Interview Questions": "Why are u interested in working here? "}, {"date": "6 Feb 2020", "title": "Desktop Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at The Art Institutes (Houston, TX) in Nov 2019", "Interview Descriptions": "The position was posted in a third-party job site on a Monday. I applied the same day and got a call back on Thursday. We have the phone interview next Monday and it went pretty well. He says that he will be flying in to town and would like to meet with me on Wednesday. \r\n\r\nI arrive on time, and did the interview with him and another of his colleague. The interview went for about 30-40 minutes. In the end, they mentioned that they will need the position to be filled as soon as possible and will let me know of their decision most likely by Friday. \r\n\r\nI do not hear back from them till Monday and decided to call the interviewer. He picks up and I remind him of who I was and an update of the job position. He then remembers who I was and ask if he can call me back real quick. Since I just called him out of the blue, I figured he must be in the middle of something. So I agree and disconnect the call. That was the last time I heard from him.\r\n\r\nWhat I believe happened was that they had picked another person for the position and forgot to inform me. Which is a bit insulting considering that he just came to town so he mustn't have had a whole bunch of applicants to interview.  After not receiving his call in over an hour, I really thought I would get one of those \"Thank you for applying\" emails, but I guess he thought: \"why should I have to call him to give him bad news? I'm sure that in a couple of hours after he doesn't receive my call, he will get the message.\"", "Interview Questions": "Tell us about yourself?"}, {"date": "18 Nov 2019", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (Miami, FL) in Oct 2019", "Interview Descriptions": "Two persons conducted the interview. It was a casual interview with interruptions of other staff, maybe as part of the process as well.  Questions were more about how classes are conducted. Then a school tour was provided, felt like I got hired already. Then an actual teaching demo was asked.", "Interview Questions": "Tell me about yourself."}, {"date": "22 May 2018", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Art Institutes", "Interview Descriptions": "Interview took one try and i was offered thr position! The overall interview went smoothly and i was asked a lot of basic interview questions along with knowledge i had of the school. Do your honework.", "Interview Questions": "Mock role play! "}, {"date": "4 Mar 2022", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at The Art Institutes (Fort Lauderdale, FL) in May 2018", "Interview Descriptions": "It was very professional, they asked good questions related to my skillset and explained the responsibilities of the job and what was desired in an ideal candidate. They let me know right away where I stood on my candidacy and I was hired that day.", "Interview Questions": "Tell me about yourself?\r\n\r\nWill your school schedule affect your ability to perform the job?"}, {"date": "5 Jun 2022", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at The Art Institutes (Minneapolis, MN) in Apr 2018", "Interview Descriptions": "Very detailed and clear in what was going to be expected.  The team did a great job of describing the students expectations and the demands of the role.  This was tremendously helpful knowing what to expect from the first day of class.", "Interview Questions": "How do you handle difficult situations?"}, {"date": "22 Aug 2022", "title": "Art Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (Pitts, PA) in Jan 2018", "Interview Descriptions": "The interview was simple. Your average telephone interview. The interviewers walked through the role and stated the role requirements. It was indicated that they have immediate openings and work would commence within the month. I was hired and paid, but they never gave me work.", "Interview Questions": "Explained in detail my Experiences in teaching."}, {"date": "27 Nov 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Art Institutes (Pittsburgh, PA)", "Interview Descriptions": "I spoke with the program director and briefly discussed my education, past teaching experience, as well as my industry experience. A quick review of the classroom setup and program overview was provided.", "Interview Questions": "what is your experience in industry?"}], [{"date": "2 Dec 2017", "title": "Student Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The Art Institutes (Phoenix, AZ) in Oct 2017", "Interview Descriptions": "Once your application and resume has been submitted they will call and pre-qualify you. If you qualify they will arrange an in person interview at the corporate office. Pass that, and they then will schedule you for a followup phone interview that requires “role play”. Do your homework. Ask open ended questions.", "Interview Questions": "Tell me about a time you had conflict in the office and how you handled it?"}, {"date": "24 May 2019", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at The Art Institutes (Atlanta, GA) in Oct 2017", "Interview Descriptions": "It is truly who you know and what you have to offer to make the company look good. You interview with the Director of the department, then HR, and then with the College President. A very casual atmosphere and setting. You can dress business casual. They review your resume before not during. Also, they ask questions like your passion, your long term dream, etc. same questions they ask consumers as well.", "Interview Questions": "What did you choose this position?"}, {"date": "20 Feb 2021", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (San Diego, CA) in Sept 2017", "Interview Descriptions": "Applied online and two weeks later I received an invite to interview.  The whole process was easy and direct. Manager asked about past jobs and about my schedule, timeline questions, and personality questions.", "Interview Questions": "Who do you handle a stressful situation ?\nWhat do you if you have a phone call and someone at the desk?"}, {"date": "4 Jan 2021", "title": "Order Fulfillment Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at The Art Institutes (Novi, MI) in Sept 2017", "Interview Descriptions": "Very quick , simple and straight to the point. Melanie was very polite and nice. A tour was completed and overview of the job description. Was introduce to all departments and notified where to park.", "Interview Questions": "What is your availability and can you do the job?"}, {"date": "15 Aug 2017", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Art Institutes", "Interview Descriptions": "Quick interview over the phone. Hired on the spot. They only asked if I knew the software I would be teaching. I enjoyed working with them for over 10 years. You are evaluated on quarterly basis and asked to come back if you do a good job.", "Interview Questions": "There were very few questions. Interview lasted minutes. They try a lot of professors out for one quarter and you are invited to come back if you do a good job. "}, {"date": "23 Mar 2021", "title": "Student Admissions Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Art Institutes (Miami, FL) in Aug 2017", "Interview Descriptions": "They called me to schedule the interview and It was just one. They offer me the job right away and I started next Monday. The questions were very easy and they were very friendly and welcoming", "Interview Questions": "He was very friendly and just ask typical questions about where I am from and how committed I was to the job "}, {"date": "8 Oct 2018", "title": "Residence Life Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Art Institutes (Indianapolis, IN) in Jul 2017", "Interview Descriptions": "The interview process as a whole was very quick. I believe it was about a three week turnaround. The company's recruiter contacted me and passed my resume along. I then did a phone interview, an in person interview, and another phone interview.", "Interview Questions": "What are some of your ideas to build the student's sense of community at the Art Institute?"}, {"date": "23 Apr 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at The Art Institutes (Charlotte, NC)", "Interview Descriptions": "I attended an open house that The Art Institute of Charlotte hosted, inviting applicants to interview for several different positions.  I got selected to Interview with the direct supervisor: Dean of Students", "Interview Questions": "What experience do you have with creating a database of information for potential internship sites?"}, {"date": "20 Apr 2017", "title": "Career Services Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (San Francisco, CA)", "Interview Descriptions": "Super easy process. I had one on-site visit and met with two people from the department. It's clear that the reviews are accurate and this institute is completely disorganized and old-school. The recruiter and director offered me different salaries and weren't on the same page. Plus, it's hard to be impressed when the people who are interviewing you are less experienced, a few years out of college and are in director roles. Plus, they hire anybody, you don't need an advanced degree to do career counseling. That says everything about this place. This is San Francisco and 2017, and they had me fill out a paper application and scan it to them.", "Interview Questions": "What's more important - helping students get their dream jobs or meeting university quotas and getting them into any job after graduation?"}, {"date": "7 Mar 2017", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at The Art Institutes (Atlanta, GA)", "Interview Descriptions": "Met with department chair.  Classes started the next week and they needed classes covered.  The department chair had a good friend that I had worked for who recommended me as an excellent instructor.  The interview process has changed quite a bit since then.", "Interview Questions": "Can you start next week?"}], [{"date": "26 May 2021", "title": "Adjunct Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (Dallas, TX) in Feb 2017", "Interview Descriptions": "Met with a panel consisting of both faculty and staff for over a 45 minute time frame. The questions were conversational with equal dialogue of questions and answers. The questions asked by the panel which consisted of faculty and staff were direct but the usual questions asked during an educational interview.", "Interview Questions": "Typical questions regarding education, teaching style  and  student learning scenarios. "}, {"date": "25 Jan 2017", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (Philadelphia, PA) in Jan 2017", "Interview Descriptions": "I applied on their website and was scheduled for a phone interview the next day.  After that I was scheduled for an in person interview two days later.  I met with the Director of Admissions who was very professional and asked normal interview questions.  After leaving the interview I was called about 30 minutes later to come in for the third and final interview which was scheduled for three days later.  I met with the President of the department who really went into detail about the position itself and what they would be looking for if I were selected for the position.  After meeting with him I talked to HR for about 15 minutes about the culture of the company.  Everyone that I spoke with and met with were very professional and they have been great with communication as far as whats going on with my application.  The day after my third interview the man that conducted my phone interview e-mailed me asking how the interview went, which I thought was very nice.  I was told I would hear back either way within in a week.  It has only been two days so I am keeping my fingers crossed that I get an offer I would love to work for everyone that I spoke with.", "Interview Questions": "Where do you see yourself in the next 5-10 years?"}, {"date": "24 Apr 2018", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Art Institutes (Los Angeles, CA) in Dec 2016", "Interview Descriptions": "The interview involved meeting the Director of Admissions.  We spoke for about an hour.  The next interview was with the Associate Director of Admissions.  We did that by phone.  They really wanted to know if I felt comfortable talking to individuals by phone since that was most of the job.", "Interview Questions": "How comfortable are you talking on the phone with strangers?\r\nHow much experience you have counseling and recruiting prospective students?\r\nWhat are your strengths and weaknesses? Where do you see yourself in 5 and 10 years?"}, {"date": "12 Oct 2016", "title": "Enrollment Processor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Art Institutes (North Hollywood, CA) in Oct 2016", "Interview Descriptions": "First, I had a phone screening with HR. She asked basic questions and said I would hear from the supervisor if they were interested. \r\n\r\n2 weeks later I received a phone call to set up the in-person interview. \r\nI was interviewed for 2 1/2 hours. \r\nFirst I met with the supervisor, who spoke at length about how much harder this job was than my old job (with no basis in reality) and asked a lot of questions without letting me answer them. She interrupted every time I tried to tell an anecdote illustrating my competence to talk about how this job was harder. I was warned no fewer than 10 times that the previous person in this position was amazing and I would never live up to her standard. \r\nThen, I met with a part time person. I am not sure why a part time coworker is involved in the interview process, but she was the friendliest and most professional of the bunch. She then admitted that the company is falling apart.\r\nAfter a long wait, I then met with a manager. He spent a lot of time discussing other concerns with the supervisor in front of me, and then revealed that the supervisor was going on leave soon and the PT person was leaving her role, so it was \"sink or swim.\" I described similar circumstances I had survived before and let them know I could handle it. He asked me the same questions I had already gone over at length with the previous two interviewers and again did not really let me answer. I asked about compensation and neither of them had any idea.\r\nFinally, after 2 1/2 hours, I was told that I would \"definitely\" hear from them by the next day (Friday). It is now a week later and I have not even heard the customary \"we went with someone else.\" Very unprofessional, and a huge waste of my time.", "Interview Questions": "How do you deal with conflict in the workplace?"}, {"date": "3 Aug 2016", "title": "High School Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Art Institutes", "Interview Descriptions": "An informational meeting where you had to present in front of the group. They give an overview of the company and position as well.  Then they choose candidates to move on to a series of phone interviews. It seemed thorough but took a long time.  Over a month from start to finish.", "Interview Questions": "Describe how you would spend a typical day."}, {"date": "9 Jul 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at The Art Institutes (Nashville, TN) in Jun 2016", "Interview Descriptions": "There was no interview. I was downsized from a full time faculty position after 6 years. They offered me adjunct, and I took it while I look for a better job with a less devious company.", "Interview Questions": "N/A"}, {"date": "14 Jul 2016", "title": "Full Time Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2+ months. I interviewed at The Art Institutes (Denver, CO) in May 2016", "Interview Descriptions": "Went through the standard interview process.  First with a hiring committee, then with the Dean of Academic Affairs.  Then the position was cut.  The interview questions were specific to the needs of the school and how resolutions would be resolved.", "Interview Questions": "N/A"}, {"date": "30 Apr 2016", "title": "Chef Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at The Art Institutes (Atlanta, GA) in Apr 2016", "Interview Descriptions": "The usual process for hiring a job candidate. There was nothing different about this one.  They are pretty much the same in the way the questions are structured. There is no other way to put this information.", "Interview Questions": "One question in particular was what was one situation that stood out for me in my work as a chef?"}, {"date": "29 Sept 2018", "title": "Web and Graphic Design Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at The Art Institutes (Austin, TX) in Mar 2016", "Interview Descriptions": "It was pretty simple.  They called me up and asked the typical interview questions.  Then we setup a teaching demo that I did through Skype.  After that they offered me the job", "Interview Questions": "Typical dumb interview questions"}, {"date": "26 Aug 2020", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Art Institutes (Tucson, AZ) in Jan 2016", "Interview Descriptions": "I was hired through a temp agency, so the process was fairly easy for me, not sure how it would have gone had it been a direct hire. I assume a panel interview with the department heads and Human Resources and the campus director.", "Interview Questions": "N/A"}], [{"date": "12 Mar 2018", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (Los Angeles, CA) in Jan 2016", "Interview Descriptions": "There was a call by the Director of Admissions.  Came in for an interview and she wanted to know my goals and how I am working with diverse group of individuals.  I had a second interview with her Associate Director of Admissions.  They really wanted to make sure if I am comfortable talking with people over the phone.  That was the bulk of the job.", "Interview Questions": "What are my short term and long term goals?"}, {"date": "15 Dec 2015", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (Minneapolis, MN)", "Interview Descriptions": "First I took a personality test. If that goes well you will be asked in for an interview. I interviewed for about an hour with two managers in the area. I was called two-ish days later and asked to interview with the President of the company. It went very well, she was easy going and very nice. I was told they would contact me in about a week. It has been a little over two weeks now so I'm assuming I did not get the job. I will say that everyone I spoke with was kind, professional, and easy to speak with. I think they have great programs and should be proud of what they have built. I would have loved to work with the president of the company because she seemed to have a very similar background as me and I think I could have learned a lot from her.", "Interview Questions": "They asked to role play speaking with students and convincing them to enroll in a program."}, {"date": "30 Dec 2015", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at The Art Institutes (Santa Ana, CA) in Dec 2015", "Interview Descriptions": "I applied for the position after seeing it posted on Indeed.com. Approximately 5 days later, I received a call from a recruiter who conducted a telephone interview with me. He then forwarded my information to the hiring manager of the particular location I was interviewing for. She called me a few hours later, did a short phone interview herself, then scheduled me for an in-person interview.", "Interview Questions": "The interview itself felt more like a discussion rather than an interview. The hiring manager talked about the culture of the place, what her expectations are for someone in this position, and what it would take to be successful in the position. She also asked me about my responsibilities at my current position and some situational questions."}, {"date": "12 Sept 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Art Institutes (Sacramento, CA) in Oct 2015", "Interview Descriptions": "Present a lecture and previous students' portfolio and my own. Interviewed by the department chairman. I talked about my previous experience in teaching in other schools and my own experience in operating my own school. I also presented my students' portfolio and my own. It seemed the chairman was impressed.", "Interview Questions": "What kind of classes can you teach"}, {"date": "14 Oct 2015", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (Charleston, SC) in Oct 2015", "Interview Descriptions": "Web based application followed by in person interview and decision making within 7 days; I had prepared questions to ask interviewer about things that they wanted in the person they would hire for this position, and I think that impressed slightly.  Found some of the questions difficult to answer without knowing a little more about what they defined as \"team work\" and how they handled recruiting on weekends.", "Interview Questions": "Big question was \"How would you relate to someone with a background clearly different than yours and get them to want to come here as a student?\""}, {"date": "31 Jul 2015", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (San Diego, CA)", "Interview Descriptions": "First of all, the ADA position is pretty much an admissions rep. Also, they do a drug test so for anyone on drugs, just be aware. The interview was pretty basic. They were just asking why I want this position and what I can add. They said it is sales and they do check everyday on apps. They were asking about my experience with high school students as well.", "Interview Questions": "1. What is your experience with high school students?"}, {"date": "8 Sept 2015", "title": "Assistant Director of Admissions Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (Los Angeles, CA) in Aug 2015", "Interview Descriptions": "First interview included a presentation of the job duties. After presentation, those still there were interviewed for a few minutes. I got a second interview as well as an assessment online. Second interview was more personal, with questions about my experience and what I would contribute.", "Interview Questions": "How would you motivate students?"}, {"date": "14 Mar 2019", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (Phoenix, AZ) in Aug 2015", "Interview Descriptions": "It was a group interview at first. We were given a presentation providing information on the role, the company, and the culture . Then we were taken individually into a room by a hiring manager that did some role play questions.", "Interview Questions": "Tell me a time you had to over come an objection. What was it and how did you over come it?"}, {"date": "30 Jul 2015", "title": "Director of Admissions Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Art Institutes (Hollywood, CA) in Jun 2015", "Interview Descriptions": "Quite possibly the most unprofessional interview I had ever been on. The manager giving the interview was taking calls, responding to emails, and allowing subordinates to walk in and out of the office during our conversation. Almost all of my answers were either interrupted by one of these distractions or she would cut me off mid-sentence.", "Interview Questions": "Why do you want to work for this company that keeps laying people off?"}, {"date": "10 Jun 2015", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (Virginia Beach, VA) in Jun 2015", "Interview Descriptions": "The interview process was quite simple. I received a phone call in response to my resume submission, and scheduled a face to face interview after a short conversation. The interview was with the Campus President, as well as the Associate Director of Student Financial Services. After the in person interview, I received a verbal/written offer two days later. Overall, I had a very positive experience and accepted the offer without hesitation.", "Interview Questions": "Describe your experience with CampusVue as it relates to Student Accounts and Financial Aid."}], [{"date": "11 Jul 2015", "title": "Academic Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (Chicago, IL) in May 2015", "Interview Descriptions": "Approx. 1-hour interviewer with Associate Dean of Academic Affairs, the Dean of Academic Affairs, and the Director of Institutional Effectiveness. Seemed like a pretty standard interview, with all three interviewers reading off of a list of questions. They said they would have a hiring decision within 7-10 days. However, to the best of my knowledge the position has not yet been filled.", "Interview Questions": "Name one time that you had a confrontation with a student or another faculty member. Explain how you handled it and what you would have done differently in retrospect."}, {"date": "7 Oct 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Art Institutes (Tucson, AZ) in May 2015", "Interview Descriptions": "First there was a information session to ensure it was the job you were searching for. Then you were called back fro an interview with the Director. They also had you sit with someone in admissions and observe. I ended up meeting with the president of the company. there is room for growth he told me as long as I was willing to relocate.", "Interview Questions": "Describe a situation when you gave someone advice."}, {"date": "31 Mar 2015", "title": "Career Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The Art Institutes (Seattle, WA)", "Interview Descriptions": "Phone interview, behavioral interview and a group interview. There is a brief presentation on expectations, work at AI, and career services before questions. I was interviewed by the director, the regional manager as well as the campus president. \r\nThey were really seeking a person that was the right fit for the job moreso than the exact experience. I liked that they wanted to get to know who I am and why I want to work for the company. I'm glad I prepared by reading about the company, its mission statement, etc.", "Interview Questions": "Why do you want to work for AIS?"}, {"date": "2 Apr 2015", "title": "Assistant Director of Admissions Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Art Institutes", "Interview Descriptions": "The process was pretty easy. Come in for info and get called back in for interview. Job was offered a few days later. The interview questions made you think somewhat, but were not overly hard. I was interviewed by two different people and was told about the job and some of the pitfalls.", "Interview Questions": "Why do you want this job?"}, {"date": "27 Oct 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Art Institutes (Charlotte, NC) in Mar 2015", "Interview Descriptions": "I talked to the director of the program, asked about my education and past teaching experience.He asked me to prepare a presentation for the class that I was going to teach. I got very well prepared and got satisfactory results. He told me about the program and gave me information about the classes that I was going to teach. It was a very positive, pleasant interview and I was very content during my time working there.", "Interview Questions": "They asked to do an example presentation, the whole faculty watched and approved me."}, {"date": "19 Feb 2015", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2+ months. I interviewed at The Art Institutes", "Interview Descriptions": "Invited to a group session where they gave an overview of the job and benifits  candidates were then all ed to ask questions before we met one on one in a mini five minute interview.", "Interview Questions": "tell me how you experience would translate to this position."}, {"date": "5 Feb 2015", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Art Institutes", "Interview Descriptions": "I met with the Office Manager for the Admissions office.  The interview was fairly easy.  She asked me questions about my past job experience on my resume and gave me more information about the school and position.", "Interview Questions": "Describe how you dealt with a difficult client or customer?"}, {"date": "24 Sept 2015", "title": "Career Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Art Institutes (New York, NY) in Feb 2015", "Interview Descriptions": "The interview process was a two step process.  I interviewed with the head Human Resources, then went on to meet with the president of the school, and then the Career Services team.  I met with the Director first, and then was asked to meet with the additional Career Services team members.  Both took turns asking me questions about myself and my past experience.", "Interview Questions": "Give us an example of a past work experience that can relate to this role."}, {"date": "8 Jan 2015", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (Seattle, WA)", "Interview Descriptions": "Applied online through AiS careers page. Was called a week later to set a phone interview day and time with HR. Had HR phone interview a couple days later. Lasted about 30 minutes.  Was asked basic \"qualifying \"questions.  Was told at the end of the phone interview that she would like to set up an in person interview for the following week. Went in the next week and meet with the Director of Admissions and a lead ADA. Interview lasted about an hour and then they asked me to sit down with a recently hired ADA to chat about her experience and viewpoint on the position. That lasted about 30 minutes. Two weeks after my in person interview i was called by the Director and given a job and salary offer which i negotiated and after about a ten minute conversation , i accepted the position at the new negotiated salary. I started at AiS exactly 2 weeks later wuth one other person.", "Interview Questions": "Give an example of the best and worst supervisors you have worked under?\r\nHow do you handle constructive criticism? "}, {"date": "17 May 2015", "title": "Peer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at The Art Institutes (San Diego, CA) in Jan 2015", "Interview Descriptions": "Seamless. In depth questions related to the role of helping new students and how you would overcome obstacles & organize events to involve new students on campus. Also how I would help stay in contact with new students. Questions about time management.", "Interview Questions": "What do you think is something new students struggle with?"}], [{"date": "5 Apr 2019", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Art Institutes (Dunwoody, GA) in Jan 2015", "Interview Descriptions": "Long and boring People that think they know what they are talking about but they do not. The president is cool but is definitely like Donald Trump in all the worse ways. But truthfully is there any good side of donald trump.  LONG WAITS!! I waiting like 2 hours to interview each time. If i didnt need a job  I would have not waited.", "Interview Questions": "Why do you want to work for the company? "}, {"date": "3 Dec 2014", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at The Art Institutes", "Interview Descriptions": "The hiring and interview process was pretty easy to be honest. They pursued me for a while before I said yes. Having good grades was a big bonus and I knew some of the administration in academics. You just need to fill out a bunch of paper work and go through a background check.", "Interview Questions": "There really wasn't any major questions, other then do I have time to carry out my tasks. "}, {"date": "28 Dec 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at The Art Institutes (Phoenix, AZ) in Dec 2014", "Interview Descriptions": "4 interviews- one with recruiter over the phone, one in person with a manager, one with another manager over the phone.  and one with a director over the phone.  Interviews were super easy.  They gave me tips for how to be successful for the next interview.  Looking for expression in tone of voice.  The overall interview process was easy but confusing.  One recruiter emailed me to tell me that i got the job.  Another manager called to tell me that I didnt get the job. Turned out that the paperwork was messed up.", "Interview Questions": "typical interview questions: tell me about yourself, how do you communicate with people, tell me about an experience where you had to overcome obstacles, tell me about your organization skills"}, {"date": "23 Nov 2014", "title": "Adjunct Professor, Fashion Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (Kansas City, KS) in Nov 2014", "Interview Descriptions": "This was a great experience.  The head of the division was helpful and charming.  Our conversation was precise and enlightening.  We shared teaching strategies and exampled classroom successes.  This was one of the most wonderful phone interviews I have ever had.", "Interview Questions": "I did not encounter a difficult moment"}, {"date": "7 Feb 2015", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at The Art Institutes (Saint Louis, MO) in Nov 2014", "Interview Descriptions": "Applied online and received a call to come in for an in-person interview after about a week. The interview ended up being a presentation for everyone that was called back, which was  about 6 of us. If you were still interested, after they gave you the overview on how \"amazing\" the company is and how most of your time spend will be on the phone making cold calls to get students to come to the school, you could stay for a in person 5 minute interview due to the others waiting. It was basically a meet and greet. It felt positive, but after a week passed I sent her an email with no response and another a week later without any response on the process. To me, even if I didn't get the consideration for another interview I felt the lack of respect of my time even after trying to get an update through email.", "Interview Questions": "What is something about you that I might know based on your resume? "}, {"date": "14 Oct 2014", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Art Institutes", "Interview Descriptions": "Had a couple of phone interviews along with a face to face.  All of the interviews went well.  They asked mostly about my experience and a few questions about what I liked and did not like about past jobs.  Also wanted to know where I saw myself in the future", "Interview Questions": "Nothing our of the ordinary as far as question"}, {"date": "26 Sept 2014", "title": "Advisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at The Art Institutes", "Interview Descriptions": "The interview process was organized and everyone was friendly.  I met with manager and two team members.  Overall, I enjoyed my the interview experience and seeing the office.", "Interview Questions": "behavioral interview questions"}, {"date": "11 Sept 2014", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at The Art Institutes (Nashville, TN)", "Interview Descriptions": "Sent in my application through their online site, received an email within 2 days to set up an interview for the next week. I came through a referral so they were very excited to meet me. \r\n\r\nWhen I first got in they required that I fill out a full paper application, even though all of the information they were requesting was already submitted electronically. This was my first red flag, why waste 20 minutes of my time - so that I was then late to my interview - to fill out a paper application when one is already available to the company? The interview was based on this paper application and you could tell the application and resume was glanced over for a few seconds at most and they conducted the interview accordingly. If you invite someone in for an interview you would think they would have reviewed your resume for at least a couple minutes to get a slight feel of the person.\r\n\r\nThey were not interested in anything but sales experience, even with a thorough background in education. No commission, but it is 100% a sales job. They described it as \"only\" 4 hours of cold calling a day, with other administrative tasks the rest of the day. Interview was less than 30 minutes with a tour around the building afterwards. Building was small and it made me uneasy that they were convincing mostly low-income students to pay $100k+ to attend an arts school. They were definitely looking for people who were hungry for the job, and I took the interview as a courtesy to my referrer, not because I truly wanted the position. I did not get the position, and found out through a letter at the end of the week. The entire process seemed dated, I didn't realize company's still sent rejection letters.", "Interview Questions": "Questions were usual interview questions, kept asking if I had any sales experience."}, {"date": "13 Jul 2015", "title": "I Applied for Associate Dean Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at The Art Institutes (Los Angeles, CA) in Sept 2014", "Interview Descriptions": "It was easy. Asking about my previous job experiences. This job required a lot of paper work, so how patiently i can handle that. They ask about my customer services skills. Helping students also required a good listener skills.", "Interview Questions": "Do you know Microsoft Excel and Word ?"}, {"date": "29 Aug 2014", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at The Art Institutes", "Interview Descriptions": "I was interviewed by one person who was not even the dean, and HR. I was asked general questioned about my experienced. But when I inquired about the position, neither could tell me anything about what I would be doing.", "Interview Questions": "Why did you leave your former employer"}], [{"date": "28 Aug 2014", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at The Art Institutes", "Interview Descriptions": "First, you will most likely go to a group interview where they tell you more about the job, then go to the second round of preliminary interviews, then final rounds of interviews with Senior Director and HR.", "Interview Questions": "Why do you want to work for Ai?"}, {"date": "26 Jul 2014", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Art Institutes (Charleston, SC)", "Interview Descriptions": "Apply online, then they shift through and call several canidates to come in for a presentation and mini interviews. They decided who should come in for interview with Sr. Director and to shadow one of the other Assistant Directors.  Then they decide to make offer.", "Interview Questions": "Easy breezy questions."}, {"date": "21 Jul 2014", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (Austin, TX)", "Interview Descriptions": "Very detailed explanation of structure and job duties. Had to return several time and was kept waiting for hours. Listened to the interviewed talk more than talked myself. They are most concerned with candidates who will not challenge the process.", "Interview Questions": "All interview questions were generic."}, {"date": "11 Dec 2016", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at The Art Institutes (Seattle, WA) in Jul 2014", "Interview Descriptions": "Recruited by their HR rep through my LinkedIn account. It started with phone screen, a personality survey and then you get selected for a group interview. Then had 3 in-house interviews with each director. Process took about a month.", "Interview Questions": "How do you handle change?"}, {"date": "23 Jun 2014", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes", "Interview Descriptions": "Got a phone call from HR and set up an in-person interview shortly. In a less than one hour interview, questions were almost about behavior. After a week, received the offer.", "Interview Questions": "As long as be well prepared about your background and experience and answer the questions logically, you should be fine."}, {"date": "4 Jun 2014", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The Art Institutes (Indianapolis, IN)", "Interview Descriptions": "My job interview, many years ago, was a pleasant experience. I first met with the Dean of Academic Affairs (the supervisor of the position), given a tour of the campus, met the current librarian, then met with a team of faculty and staff. I was offered the position a few days later.", "Interview Questions": "The difficult question was why I wanted to come to work for a for-profit school. "}, {"date": "12 Jun 2015", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (Troy, MI) in Jun 2014", "Interview Descriptions": "First information sessions to learn about position.  Multiple interviews after.  Asked typical questions.  Had maybe one or two phone interviews and two in person interviews.  Small campus, one of the interviews was with the president of the college.  Director kept asking me if I was still interested which I probably should have taken as I sign.", "Interview Questions": "Describe a weakness of yours?"}, {"date": "5 May 2016", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Art Institutes (Dallas, TX) in Jun 2014", "Interview Descriptions": "The interview process was great.  There was a presentation, and I spoke with the director of the department.  It was an easy process.  I was nervous at first, but afterwards, I calmed down and presented to the hiring staff.", "Interview Questions": "How long have you been in the industry?"}, {"date": "30 May 2014", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Art Institutes (Dallas, TX)", "Interview Descriptions": "Interviewed for position and was very pleased with interview process. Spoke with department director and dean of students. Had several interviews with department head and was very impressed with his background and had an enjoyable experience doing the interviews.", "Interview Questions": "None came up, very relaxed interview"}, {"date": "21 May 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at The Art Institutes", "Interview Descriptions": "It is online process....one phone interview.  It takes a long time to go through the process....months before you have the training and then several months before you have a course.", "Interview Questions": "none....can take months before you have a course to teach"}], [{"date": "21 May 2014", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at The Art Institutes", "Interview Descriptions": "I was called in for a group interview, and they were great about making this clear in the very beginning. However, when we all gathered to learn more about the position, the title was completely different. Yes, it would require some administrative tasks, but it was both confusing and frustrating to come in expecting the job description posted to be correct and instead to find a completely different job. It would have also been nice to know this before having to fill out an entire employment application.", "Interview Questions": "I was only asked one question, as the interview was a brief time of one-on-one screening which included a short elevator pitch. \"What three qualities would you use to describe you?\" "}, {"date": "2 May 2014", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at The Art Institutes (Pittsburgh, PA)", "Interview Descriptions": "Filled out the paperwork in the office and handed it in along with a resume. Waited about two weeks and got a call for an interview. The interview took about 20 minutes. Received a call about a week later offering me the job. Had to go in to fill in the hours I could work and was set to begin working the following week.", "Interview Questions": "Tell me about a time when you had to deal with a co-worker who wasn't doing his/her fair share of the work. What did you do and what was the outcome?"}, {"date": "30 Apr 2014", "title": "Assistant Director of Admissions Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at The Art Institutes", "Interview Descriptions": "Not an accurate title for the position. You're really an admissions counselor. Making up to a min of 100 calls daily.", "Interview Questions": "The whole process was too drawn out. "}, {"date": "15 Apr 2014", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Art Institutes", "Interview Descriptions": "I submitted my resume through the EDMC Career Opportunities page, was called for an in person interview with DOA/SDoA, and extended an offer the same day.  They are constantly hiring for the ADA position and depending on the time of year (with regard to class start dates) will have a high sense of urgency.  It was a very smooth interview process.", "Interview Questions": "How do you find yourself adapting to a more structured environment?"}, {"date": "22 Mar 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (Tampa, FL)", "Interview Descriptions": "Very straight forward.  Position was advertised on their web site and I submitted my resume electronically.  I was called within one week and an interview was scheduled.  Interview consisted primarily of a review of my credentials to ensure I was qualified to teach the subject matter.  Was asked to request and submit all transcripts for undergrad and graduate work.  I was interviewed by the department director and the head of training.  (Unfortunately, both of these positions have subsequently been eliminated.)  Final step in selection process was preparing a 30 minute sample lesson and presenting it to a panel of three current instructors.  Entire process took less than two weeks.", "Interview Questions": "Nothing difficult or unexpected came up.  Success in gaining a position is to meet the academic requirements stated for the position (usually a Master's degree with at least 18 grad hours in the subject matter to be taught.)"}, {"date": "22 Oct 2014", "title": "Teachers Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at The Art Institutes (North Hollywood, CA) in Feb 2014", "Interview Descriptions": "I applied as a student by the recommendation of one of my teachers. The process was easy and I was recommend it to any student of the Art Institute. I had a meeting with career services. I was drug tested, which was easy. I was given my employee packet with very clear instructions. Career services answered any and all questions I had and helped make the process easy and comfortable.", "Interview Questions": "I don't recall any difficult or unexpected questions of any kind."}, {"date": "24 Jan 2014", "title": "Admissions Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at The Art Institutes", "Interview Descriptions": "It was internal hiring process for me, and the interview wasn't that difficult since I've worked here previously. They mainly question you with behavioral questions- just to see how you delt with issues, pressure, and such.", "Interview Questions": "What was the most difficult experience you have experienced, and what initiative did you take to resolve the issue?"}, {"date": "12 May 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (Arlington, VA) in Jan 2014", "Interview Descriptions": "Sent in resume, received a call and interview on the phone, went to interview in person. Interview was fairly straight forward. They mainly wanted to know about my experience with teaching others and my professional credentials and knowledge in my field. There were no real test questions. Met both heads of the department.", "Interview Questions": "What experience you've had with teaching"}, {"date": "30 Dec 2013", "title": "Admission Recruiter Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at The Art Institutes", "Interview Descriptions": "Group information session. Initially was in a big group for the job presentation. Several people left after the presentation. 11 people remained for the interview. Waited for about an hour to be my turn for the interview. Only asked one question \"Why should we hire you\".\r\nCalled back next day and denied my application.", "Interview Questions": "Why should we hire you"}, {"date": "17 Dec 2013", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at The Art Institutes (Santa Ana, CA) in Dec 2013", "Interview Descriptions": "Found the position posted on indeed.com and was transferred to edmc website. Got called in for an info session and mini interview after.", "Interview Questions": "The questions I were asked were typical. Why apply for the position, what motivates me."}], [{"date": "18 Mar 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Art Institutes (Cincinnati, OH) in Dec 2013", "Interview Descriptions": "Submitted complete academic CV, 3-4 full page references, 3 page teaching philosophy, complete set of unofficial transcripts from all degrees, 25 samples of student design work and complete online portfolio of my personal work.", "Interview Questions": "Was asked to present a sample lecture to a varied group of people who work in all different departments at the college"}, {"date": "18 Feb 2015", "title": "Student Worker- Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Art Institutes (Sacramento, CA) in Nov 2013", "Interview Descriptions": "Create a cover letter and resume to submit as well as design samples if asked for. Two interviews were given, one with all supervisors in the department in a traditional style interview and one with just the head of the department going over what the details of the job are and if you are a good fit. The entire process took about two weeks. Drug testing was a part of the process as well.", "Interview Questions": "Can you multitask on multiple different projects at once? \r\nAre you willing to participate in school events?"}, {"date": "9 Oct 2013", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at The Art Institutes (Brookline, MA)", "Interview Descriptions": "There is a 1-2hr long information session. If you are still interested, they invite you for individual interviews. They will tell you they are interested and then never bother to call, email or snail you a rejection. Bad form.", "Interview Questions": "They ask you whether or not you'd push a product that a customer/client didn't want. "}, {"date": "7 Apr 2014", "title": "BDR Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Art Institutes (Arlington, VA) in Oct 2013", "Interview Descriptions": "Initial phone screen, 2nd interview was phone panel interview, 3rd interview was on campus by Sr. Director of Admissions. Stock questions were used more often than behavioral interview questions due to non-complexity of the position requirements.  A week later an offer was made and renegotiated that evening.  Management requested signed offer letter to be returned within 24 hours.", "Interview Questions": "How would you identify community events to gather prospective students using the internet?"}, {"date": "19 Oct 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at The Art Institutes (Virginia Beach, VA) in Oct 2013", "Interview Descriptions": "Very simple and straightforward. Interviewed once and was basically hired on the spot. Was a bit leery because they seemed interested in having me teach classes that I didn't feel completely qualified for. I think their attitude was \"You know more than the students.\"  That seems unfair to the students who are paying a lot of money to go there.", "Interview Questions": "N/A"}, {"date": "14 Aug 2013", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Art Institutes (West Hollywood, CA)", "Interview Descriptions": "Had a telephone interview and was invited for an in-person interview.  Half of the selection committee was present.  They made it apparent that they recently made permanent cut-backs and currently work 65+ hours per week.  They did not have any formal questions prepared and also joked around about telling students to \"shut up\" in their classrooms.  There seemed to be a general vibe of narcissism.", "Interview Questions": "They problem was that their questions were generally unclear because they didn't prepare any."}, {"date": "1 Oct 2015", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Art Institutes (Los Angeles, CA) in Aug 2013", "Interview Descriptions": "Group interview discussing the basics followed by a one-on-one interview with the Senior Director of Admissions. Then was called back a few days later & invited for second interview/met the campus president, shadowed people in the office to see what the floor was like. Was fairly relaxed process. Outside of the office, there were online quizes to take for personality/education level.", "Interview Questions": "how have I overcome rejection/difficult obstacles in customer service? usual sales/service rep questions."}, {"date": "16 Jul 2015", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at The Art Institutes (Tucson, AZ) in Jun 2013", "Interview Descriptions": "contacted by 3rd party recruiter, 3 in house interviews with a lot of information given. Role playing was key during this process. The second interview is a panel interview where you break off into 1 on 1 interviews. Time is given to memorize a script and then you role play as if you are trying to give/get information from a promising student.", "Interview Questions": "Be prepared to role play immediately and study prior to interview"}, {"date": "27 Jul 2015", "title": "High School Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Art Institutes (San Francisco, CA) in Jun 2013", "Interview Descriptions": "Group interview, where each of us had to give a small presentation. The next portion of the interview was in person with the remaining candidates. Then I had another phone interview with another director. I was given a background and drug test before they offered me the position.", "Interview Questions": "Why did I move to San Francisco."}, {"date": "2 Sept 2015", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (Charleston, SC) in Jun 2013", "Interview Descriptions": "Group Interview and then personal interview.  Very specific, but loose on job description.  Lots of duties needed other than the recruitment process.  People seemed very excited abotu their job and were exuberant in sharing the information about position", "Interview Questions": "Why are you a good fit"}], [{"date": "12 Jun 2013", "title": "Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Art Institutes (San Francisco, CA) in Jun 2013", "Interview Descriptions": "I received an email for an \"information session\" regarding this position. I found that strange but attended regardless. When I arrived, there were about 15 people in the reception area filing out applications for this position. Um...didn't I already Fill out an application when I input all of my Information online?!?!!? I felt as if I were completing an application for a temporary agency for placement. After the application was completed, we were herded into a classroom and told about the position. I guess this weeds out those interested and those who are not, but I think the worst thing is seeing your \"competition\" versus assuming the unseen competition. The information session was pretty straightforward. The person who the Receptionist will be working with discussed the role further and I didn't see this is a good fit for me due to work schedule, the Supervisor's wants, and how he kept talking about this is \"a business.\" I understand the business model but this view of indicating that this institute views this as \"a business\" was completely off-putting. There wasn't anything particularly inviting about this information session. After this was over, we were herded back downstairs and interviewed one on one. What I couldn't understand is how this felt like a cattle call. The supervisor and office manager who interviewed everyone one by one didn't even have any particular questions specific and/or tailored to me. He simply regurgitated my resume back to me with superficial questions that weren't even difficult. I couldn't understand how they would get a candidate of high caliber that way. I wasn't even challenged! I was floored by the whole experience. And completely unimpressed.", "Interview Questions": "There weren't any difficult questions because they were asking questions on the fly with no preparation whatsoever."}, {"date": "26 May 2013", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at The Art Institutes", "Interview Descriptions": "I was referred by an employee who told me about an information session. I Went to the info session then applied at the end. I received a call back within a couple days for an in person interview. The Director of Admissions interviewed me for over an hour, then I took a personality test and a skills test. I was offered the job within a week.", "Interview Questions": "The interview was mostly to get a sense of my personality,so the most difficult question was, \"Why do you want to work in education?\""}, {"date": "7 May 2013", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at The Art Institutes (Cincinnati, OH)", "Interview Descriptions": "You will have multiple interviews, I had 4 total, some say they were all done in the same day. \r\nYou will meet with HR first, Director 2nd, Senior Director 3rd, and finally the President last.", "Interview Questions": "Tell me about your self? they don't specify personal or professional, they want to know about you personal and professional.\r\n "}, {"date": "24 Mar 2015", "title": "Assistant Director of Admissions Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Art Institutes (Denver, CO) in May 2013", "Interview Descriptions": "Filled out a detailed 90 question survey. Was then asked to come in for an information session with other candidates. Was called about a week later for another interview with current employees. We were able to ask them questions about what they do.", "Interview Questions": "Basic interview quesitons"}, {"date": "12 Apr 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (San Antonio, TX) in May 2013", "Interview Descriptions": "This was a phone interview with a teaching demo. I prepared a 20 minute lesson and gave it to Human Recourses, and the director Academic Director – Media, neither of them were fluent in my field of study so they didn’t ask any difficult questions.", "Interview Questions": "nothing difficult they don't really care about the quality, expect to be a cog in their system."}, {"date": "15 Apr 2013", "title": "Admissions Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Art Institutes", "Interview Descriptions": "I went to a group interview.  It was fairly informal and more informational that a real \"interview.\"  There were about 10 people in my group.  Most of them had advanced degrees, and several had recruiting experience.  There were about four former military.", "Interview Questions": "I did not expect to have to fill out a generic job application in addition to my resume.  I wasn't ready for that.  "}, {"date": "12 Apr 2013", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (Austin, TX)", "Interview Descriptions": "Basic sales and recruiting questions. What motivates you? Are you competitive? Do you like working with others?", "Interview Questions": "Nothing really unexpected if you come prepared and are a good candidate for the position. The interviewers will know pretty fast if they like you or not and want to continue. "}, {"date": "5 Apr 2013", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (Los Angeles, CA)", "Interview Descriptions": "Very quick, a little disorganized.  Had to wait for the Director for over 30 mins, he spoke about the job very quickly.  Looking for sales people and need to make a lot of calls and build value with the students- know your business and be a go getter", "Interview Questions": "Why do I want to work for them?"}, {"date": "24 Apr 2013", "title": "ADA- Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (San Francisco, CA) in Apr 2013", "Interview Descriptions": "the interview process was very fast and my recruiter was very thorough. I applied for the position in San Francisco. he replied to my application request in less that four days, and scheduled a group information session. the session was about two hours and it was worth every minute. He let us know exactly what we were going to be getting into and left no stone unturned. He was very honest about why people fail in their position and what keeps people from remaining in the company longer that a year and a half.  after the interview i was even more encouraged to pursue the position further and i a sent the recruiter an email requesting a formal interview. he replied promptly and the interview was scheduled for the following day. so far that is where i am at in the interview process.", "Interview Questions": "no questions asked during group session."}, {"date": "17 Mar 2013", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Art Institutes (Austin, TX)", "Interview Descriptions": "The interview process keeps changing, but when I interviewed there was one interview with a Director of Admissions, then the Senior Director of Admissions, then the Campus President.  Just an FYI - the job title is \"ADA\", but you're actually just a recruiter.  Beware though, that if you interview and they like you, they'll want you to start ASAP.  There is a high turnover rate here, and there are always openings.", "Interview Questions": "Nothing was really unexpected.  I mean, it's a sales job."}], [{"date": "4 Mar 2013", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Art Institutes (Atlanta, GA)", "Interview Descriptions": "In a room of about 5 other candidates we were invited to watch a presentation about the position. Then I had an interview after the presentation. Usual questions, what motivates you? Why do you want to work here? I was asked a lot of questions about my current position, why I wanted to leave, etc.", "Interview Questions": "What are the goals at your current job, at what percent do you meet those goals "}, {"date": "1 Mar 2013", "title": "Career Services Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Art Institutes", "Interview Descriptions": "Initially contacted through email about two weeks or so after putting in the application. Set up a phone interview from there and we agreed to a 10am appointment. Interviewer called at 9:30am despite the confirmed appointment. Pretty basic phone interview and an in person interview was offered at the end of the call. In person interviewed followed about a week later. Interviewer spent the time more so playing the role of bad cop and trying to, \"paint as realistic of a picture,\" as possible without even taking the other side and making it seem like a solid opportunity worth pursuing. Walked away from the interview more impressed with the city itself than the company. Interviewer proceeded to call back three times (as a follow up of sorts?) without even once leaving a message.", "Interview Questions": "Let's say you're short of your 85% quota for the month and you have a student who refuses to return your calls. What do you do? "}, {"date": "23 Oct 2015", "title": "Residential Life Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Art Institutes (Santa Monica, CA) in Mar 2013", "Interview Descriptions": "There will be two interviews. The first process is not difficult, but once you pass and have the second interview it will be a lot of grilling. You have to have lots of confidence.", "Interview Questions": "How can you make it an effective community? What's an event that you would like to create for the students?"}, {"date": "27 Feb 2017", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at The Art Institutes (San Diego, CA) in Feb 2013", "Interview Descriptions": "Very detailed.  First had a group interview with about 15 people which they all asked about 100 questions each.  After I met with four different hiring managers.  All cared about hiring the perfect candidate.", "Interview Questions": "Mainly asked the tough questions about your views in education and Creative Arts."}, {"date": "18 Oct 2017", "title": "Student Employment Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Art Institutes (Costa Mesa, CA) in Feb 2013", "Interview Descriptions": "I was a referral to the department so it was easy getting an interview. During the interview, the director at the time barely asked me any questions and did all the talking (this was for the Career Services department, have you). By the end, she already was talking to me as if I had the job. It was the easiest interview process I had ever had. Unfortunately, I didn't get a chance to really interview her and the organization/department and found out the hard way what I was getting into -- a lot of turnover and no training.", "Interview Questions": "When can you start?"}, {"date": "14 May 2015", "title": "Part Time Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at The Art Institutes (San Francisco, CA) in Jan 2013", "Interview Descriptions": "phone call, then 101 review of portfolio and resume, then group panel presentation with more faculty members and then got hired! It was difficult since i had never taught before but it was a great experience.", "Interview Questions": "years of experience, computer skills, educational experience, skills applied on current job"}, {"date": "9 May 2013", "title": "Recruiter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes in Jan 2013", "Interview Descriptions": "I had 2 interviews for the Recruiter position - one was more like a group info session, and then if you were still interested you could wait for your own 10 minute interview. This went well, and I received a callback interview. The second interview was a panel interview with 3 managers. This also went well, though it was becoming obvious to all of us that it wasn't a good fit for me. The very next day I received a call from the dept manager wanting me to consider an alternate position. I shadowed someone for about an hour, then we had another private interview. Ultimately, they offered me the position, which I turned down. I will say that I enjoyed every person I talked with and met. It seems like a great company with really great people. Even though I didn't take the position, I wouldn't hesitate to recommend this company.", "Interview Questions": "I don't remember any specific questions. There were lots of situation type questions and \"tell us of a time\" questions. Go in with lots of stories to choose from."}, {"date": "16 Sept 2015", "title": "Media Arts Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (Sunnyvale, CA) in Jan 2013", "Interview Descriptions": "Great.  Brief.  Had one phone interview and an on-site demo for a small team of instructors.  The director was very informative and answered all of my questions.  I got a tour of the facility and met a few of the team instructors that I would work closest with.", "Interview Questions": "What makes your teaching style significant?  How do you reach students from diverse backgrounds?"}, {"date": "28 May 2015", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at The Art Institutes (Tucson, AZ) in Dec 2012", "Interview Descriptions": "I had to go in at least 3 times before getting an offer. First day was a group interview where we all sat around a table and they contacted me back after that one.\r\nThen the second time in it broke into more individual with the director and HR, doing role play and full on interview. One of the only times I can remember doing role playing in an interview! It was at least an hour long, and I was contacted by HR a few days after with a formal offer.", "Interview Questions": "We are going to do a role play where I will pretend to be a student, are you ready?"}, {"date": "5 Nov 2012", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Art Institutes (Houston, TX)", "Interview Descriptions": "I received a call about a week later after I applied for the position. I had one interview and I was hired. It's very easy to get hired here.", "Interview Questions": "None.  I was asked \"why\" I wanted the position. Overall, it was a very \"to the point\" interview process. "}], [{"date": "15 Dec 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Art Institutes (Troy, MI) in Nov 2012", "Interview Descriptions": "The interview process consisted of a phone screen to start.  The next step was a personal interview.  In the final step I had to prepare and present a classroom lecture.", "Interview Questions": "Why do you want to teach?"}, {"date": "28 Aug 2014", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at The Art Institutes in Nov 2012", "Interview Descriptions": "Applied Online,\r\nCalled 2 days after with Director of Admissions, few minutes later call from Senior Director of Admissions, giving basic info about job.\r\nWent two days later met Senior Director, and had interview with the other Director of Admissions.\r\nOne week later  HR called with job offer.", "Interview Questions": "Not difficult questions."}, {"date": "6 Dec 2012", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (Milwaukee, WI) in Nov 2012", "Interview Descriptions": "1st = Group Interview.  Very flashy, but very vague\r\n2nd= Met with Director of Admissions.  Again, very flashy... and more of the focus on on her and her life story.  Very weird.\r\n3rd= Met with the President of the Campus.  Again, just weird.  Non-job related questions and more of a life story/talking to fill quiet air.  I found myself fishing for answers to try to get to the bottom of what it was that I would REALLY be doing in the position.", "Interview Questions": "How do you feel about the for profit education?"}, {"date": "16 Nov 2012", "title": "Admission Director Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Art Institutes (Charleston, SC) in Oct 2012", "Interview Descriptions": "Applied, and was scheduled for a class room presentation about the position with about 15 other applicants.  After the 30 minute presentation, was given a short 5 minute, 3 question personal interview with one of the many staffers. Received a denial letter in the mail 2 weeks later.", "Interview Questions": "Nothing difficult: \r\nDescribe in detail your daily routine at your last job. \r\nWhy do you want to work in education?"}, {"date": "28 Mar 2014", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Art Institutes (Chicago, IL) in Oct 2012", "Interview Descriptions": "Two interviews, one with a director of admissions and another with the president of the school. Both are intelligent and nice people. Just be yourself and you will have a good conversation at the very least.", "Interview Questions": "Why did I want a job that required mostly all phone-oriented work?"}, {"date": "13 Apr 2016", "title": "Residence Life Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Art Institutes (Schaumburg, IL) in Sept 2012", "Interview Descriptions": "Interview process was real easy. Met with HR, Director of Housing, and Dean of Student Affairs. Typical interview questions. All were lovely people. I really enjoyed meeting the group and got excited to start with the position. The Dean, who is now retired, was the greatest. The Director of Housing and I got along really well and instantly had chemistry to make the department very successful.", "Interview Questions": "Why are you qualified for this position?"}, {"date": "29 Sept 2012", "title": "Assistant Director of Admissions/Academic Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (Fort Worth, TX) in Sept 2012", "Interview Descriptions": "I applied online and the following day I received an email response to see If I would accept a group session. After confirming, In the information session we were to go over the institution and its background, go over the position requirements, and the expectations, along with salary details which was fairly good/average in the low to mid 40's. The information session was with the Senior Director and Director of Admissions. Afterwards we were to do one on one interviews which never happened I've never experienced anything like this along with a group of 9 other candidates. It was pretty unprofessional all we were allowed to do was go around the table and sell ourselves short why we would be the best candidate. After that we all left and the following morning I received a survey once completed about minutes later another email for a background check. To my knowledge a background check I figured meant i was in however not on their terms it was a screening process. Who pays money to do a background check and then don't give you the chance to have a proper interview. Needless to say even though my background is good I received almost a week later I wasn't selected for whatever reason.", "Interview Questions": "Explain how you would be the best person for this position?"}, {"date": "29 Aug 2012", "title": "Full Time Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at The Art Institutes (Atlanta, GA)", "Interview Descriptions": "I was flown in from another town, interviewed by a group of faculty members.", "Interview Questions": "How to handle conflict."}, {"date": "3 Jun 2014", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Art Institutes (Phoenix, AZ) in Aug 2012", "Interview Descriptions": "First steps are an over the phone interview, then a face to face interview, then you are tested on how well you can hold a conversation with one of the directors. Be enthusiastic and engaged and be prepared to ask questions.", "Interview Questions": "The over the phone conversation test was difficult. It was hard to understand the expectations initially."}, {"date": "7 Aug 2016", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at The Art Institutes (San Bernardino, CA) in Jul 2012", "Interview Descriptions": "Very easy interview because the director was easy going . Too bad that they could not keep him, we loved him. The position was for an outgoing instructor who is a friend of mine so I can recommended. that may have made the process easier. I had a presentation to make to the other directors which was not that hard. They wanted to see my teaching style. I don't regret for one minute my experience at the Art Institutes its when they REALLY started to focus on money that the whole place started to go downhill.", "Interview Questions": "Why do you want to teach at the Art institutes?"}], [{"date": "2 Dec 2012", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at The Art Institutes (Seattle, WA) in Jul 2012", "Interview Descriptions": "There is a group interview and if they deem you worthy they follow up with an individual interview. After that if they are still interested they will schedule you for another interview. In my case I was told they were running my background and reference checks (which took three weeks). I was under the impression I was going to be hired, all of my references were great. Then at the last minute they called to say they were going a different direction. My advice would be don't slow down on your job search to wait for this company! Also from everything I've gathered, employee moral especially for ADA's was very low. My best advise would be to steer clear all together.", "Interview Questions": "Asked about a former supervisor who you liked the management style of, and one that you didn't."}, {"date": "3 Jan 2013", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Art Institutes (Houston, TX) in Jul 2012", "Interview Descriptions": "Took 2 Weeks to hear back after interview asked if I like helping people.", "Interview Questions": "N/A"}, {"date": "9 Jul 2012", "title": "Assistant Director of Admission Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at The Art Institutes (Phoenix, AZ) in Jun 2012", "Interview Descriptions": "Very basic interview... nothing too specific... seems like they will hire most people who can speak well, and aren't on drugs.", "Interview Questions": "How will you stay motivated since we can't pay commission?"}, {"date": "7 Apr 2014", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at The Art Institutes in Jun 2012", "Interview Descriptions": "Instead of interviewing initially, you do an 'Information Session' about the role with a group of people. They aren't really in any hurry to call you back. It took a month when I heard back, then I went through 3 interviews with different directors, 6 mos later got the offer.", "Interview Questions": "They asked me what are \"deal breakers\" for me with a company or manager."}, {"date": "22 Jun 2012", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 days. I interviewed at The Art Institutes (Tinley Park, IL) in May 2012", "Interview Descriptions": "The first point of contact was from an HR rep that phone screened candidates. After, I received and email inviting me to a group information session. Upon arriving for the information session, along with 10 other people, there were clip boards handed out and applications to be completed. We were then shuffled into a small classroom where a presentation was given by the Director of Admission for that campus. The presentation consisted of information about the company in general, then went in depth about the positions and expectations of candidates. Lastly, the HR benefits were talked about, where it seemed more like they were selling us on the job, rather then have us sell them.\r\n\r\nThey reps from the school then asked if anyone would like to leave now, if they feel the position isn't right for them. I knew this wasn't the job for me after the presentation as I didn't want to be in a sales position, but I stayed for the remainder of the interview. They then informed us that each of us would be taken one by one and asked a few more questions, a quick personal interview. So, they took each of us, one. by. one. It took two hours to get through everyone, and they went in a random order, not by arrival time.\r\n\r\nThe process was a bit ridiculous for the position, and came across like selling insurance. Hard to sell a $70,000 plus education from a private company to a student who deserves better.", "Interview Questions": "Why do you want to be in a sales job?"}, {"date": "19 Sept 2016", "title": "Faculty Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at The Art Institutes (Atlanta, GA) in May 2012", "Interview Descriptions": "The interview was mostly behavioral questions. They wanted to know things like how I handled difficult situations and how well I worked under pressure. I met with the Depatment director first and then there was a committee interview about a week later. It was a very pleasant group. They were sincerely interested in my background. I had to do a teaching presentation for the committee. This school goes year round, so there are no Summers off.", "Interview Questions": "Name a time you had a conflict with a co-worker; how did you solve it?"}, {"date": "29 Oct 2012", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at The Art Institutes (Santa Monica, CA) in Apr 2012", "Interview Descriptions": "Phone interview with recruiter. Then a group interview with other candidates. At the end of the group interview you will meet individually with the director who will ask you a few questions. If you make it to the next round you will meet with the senior director, HR and at least one director for a final interview. The key is to be animated and talkative. You may not receive an answer that day but a next day offer is expected.", "Interview Questions": "Pretty typical sales questions. How do you stay motivated when doing a task over and over again? (You make a lot of dials on the phone.)"}, {"date": "8 Sept 2013", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Art Institutes (Saint Louis, MO) in Apr 2012", "Interview Descriptions": "Initial review involved group \"interview,\" where about 15 potential candidates were given an introductory speech and tour of the company. We introduced ourselves and filled out standard application paperwork, which was turned in with our printed resumes. Many candidates did not have traditional faculty backgrounds (lots of MATs or business professionals, very few MAs and MFAs). We then set up individual interview times. For the individual interviews, we gave a class presentation to the Dean and met briefly to discuss the position. Only continue if you know this is an entry-level, resume building job that will enable you to move on to something else. There is virtually no room to advance within the company.", "Interview Questions": "\"Is the pay rate typical for the area?\" "}, {"date": "23 Mar 2012", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at The Art Institutes (Santa Monica, CA) in Mar 2012", "Interview Descriptions": "I was referred by a recruiter. First, had a group info session where they discussed what the position would entail.  It was a very thorough presentation and quite comprehensive.  There were six candidates in the room and it seemed crucial to ask questions and to stand out. Following, there was a one on one interview that lasted approximately five minutes.  Received a call back a day later. Went back to be interviewed by the two directors and the executive director. I received news the same day by the recruiter that they wanted to make an offer. Less than a week later, HR contacted me with the salary offer and was informs there would be a background check.", "Interview Questions": "How do you deal with rejection?"}, {"date": "30 Jul 2015", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Art Institutes (Chicago, IL) in Mar 2012", "Interview Descriptions": "3 step process before hiring offer was made.The first interview is a group/panel interview to provide information about The Art Institute network of schools, the roll of admissions and job expectations. This includes both in-bound and out-bound calling, face-to-face student meetings and variable hours that consist of days, evenings and some Saturdays.", "Interview Questions": "Why I wanted to work for The Art Institute."}], [{"date": "28 Aug 2015", "title": "Printing Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at The Art Institutes (Charlotte, NC) in Mar 2012", "Interview Descriptions": "You basically have to know people that work in that place. Act responsible, make the right connections, and you will be fine. You also have to be a student to take on these positions.", "Interview Questions": "My availability."}, {"date": "3 Nov 2015", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Art Institutes (Pittsburgh, PA) in Mar 2012", "Interview Descriptions": "Very easy and quick process, this should have been a red flag but I needed a change fast so I went with it. I wish I would have been able to meet the management team beforehand as I would have declined the offer or asked for much more money.", "Interview Questions": "Describe a time you dealt with a tough situation"}, {"date": "21 Jan 2013", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at The Art Institutes (Saint Louis, MO) in Jan 2012", "Interview Descriptions": "Was fed lies by all interviewers. Had four different phone interviews and one in person interview. Took about a month to get the job offer. The job description made it sound as if we were going to help people and run our own business, however, we are micro managed and feeding students lies.", "Interview Questions": "Nothing was difficult or unexpected they wanted to know about me and my background. They like  people with a lot of drive and motivation, a bit of an ego can help you. That's if you really want to work for this company. "}, {"date": "23 Oct 2012", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at The Art Institutes (Austin, TX) in Nov 2011", "Interview Descriptions": "Met with the Director and Senior Directors.  They are seeing your communication skills, and really if they like you.  Can you get them to talk and feel comfortable around you.", "Interview Questions": "asked \"what is my biggest risk if I hire you?\"  which is difficult being that it is a double negative.  "}, {"date": "20 Oct 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Art Institutes in Aug 2011", "Interview Descriptions": "One phone interview in which they asked very basic questions. Then one in person interview with the Dean. They are more concerned that you submit your transcripts.  They did not negotiate salary at all.", "Interview Questions": "Describe a time when you were faced with a challenging student. How did you handle the situation?"}, {"date": "9 Sept 2011", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at The Art Institutes (Seattle, WA) in Aug 2011", "Interview Descriptions": "I first had a pretty detailed phone screening. I was then asked to come to a informational presentation and very short, 5 minute, one on one interview. Next I was called in for a final interview with the Director of Admissions. From the time I actually applied for the job to the end of the interview process, it took one month.", "Interview Questions": "Tell me about a time that you failed at something."}, {"date": "12 Dec 2011", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Art Institutes (Houston, TX) in Aug 2011", "Interview Descriptions": "I applied online, was called back in about a week and the interview was arranged for later that same week.  My interview was set up initiallly with one person, but another person actually interviewed me.  I was escorted to the office he worked in, although it was almost completely bare.  This was probably one of the most awkward interviews I've had.  It was like the guy who interviewed me took one of those generic interview question list and asked me every question.  Truthfully, I didn't feel comfortable with the interview style and I have given better interviews.", "Interview Questions": "\"What are your greatest strengths / weaknesss.\""}, {"date": "5 Feb 2013", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Art Institutes (Houston, TX) in Jul 2011", "Interview Descriptions": "I knew there were openings for adjunct instructors because I knew someone teaching at AIH already.\r\nSubmitted resume and online application form.\r\nReceived email from program chair for interview.\r\nInterview on campus.\r\nDemonstrated teaching for 20 minutes with 3 faculty present.\r\nVerbally hired on the spot.\r\nThey emailed paperwork to fill out via email.", "Interview Questions": "How do you motivate students?"}, {"date": "8 Apr 2015", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (Fort Lauderdale, FL) in May 2011", "Interview Descriptions": "This was a two part interview process for me. There was a meet and greet with the admissions supervisor with a follow up phone call and a second interview within two weeks.  The second interview was in front of the admissions directors and human resources director.  Overall, a fairly easy interview process.", "Interview Questions": "How would you handle a situation where a student clearly cannot afford monthly tuition fees, but really wants to attend?"}, {"date": "21 Jul 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Art Institutes (Milwaukee, WI) in May 2011", "Interview Descriptions": "Met with head of department and discussed job opportunities and classes I would be comfortable teaching. That was followed by a  teaching demo - audience included current faculty. After that I had to keep calling to find out that I was hired -  the only negative.", "Interview Questions": "How do you handle difficult students?"}], [{"date": "19 May 2011", "title": "Financial Aid Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Art Institutes (San Bernardino, CA) in Apr 2011", "Interview Descriptions": "I was contacted by the Art Institute to set up an interview with the Director of Financial Aid. On the day of the interview the Director was around 45 minutes late but she apologized and immediately placed the blame on the individual who scheduled my interview. I was first interviewed by the Director of Financial Aid and was asked around 3 or 4 basic questions and then the Assistant Director came in where they both began to ask questions. The interviewer stressed fit of the company above experience or knowledge. The best advice I could give would be to demonstrate your adaptability and eagerness to work with a team. The emphasis of the interview was teamwork and doing whatever it takes to help another co-worker. After what I deemed a successful interview and a call back date, I have yet to receive word back from the interview.", "Interview Questions": "If another employee was falling behind on a deadline, what would your response be?"}, {"date": "2 Dec 2015", "title": "Financial Aid Office Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Art Institutes (Miami, FL) in Apr 2011", "Interview Descriptions": "I was called for an interview. I met with two people, the department manager as well as the director. They had some easy questions. they look for people they will not cause any drama and very calm. It was easy questions. However, they took a long time to call me to start.", "Interview Questions": "What are your strength"}, {"date": "3 May 2015", "title": "Assistant Director of Admissins Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at The Art Institutes (Portland, OR) in Mar 2011", "Interview Descriptions": "It was a long time ago when they profiled ADAs with the Kaliper Test.  Now you typically interview with the Director of Admissions and the Senior Director of Admissions and sometimes a team member or school president.  The conduct both panel interviews and individual interviews.", "Interview Questions": "N/A"}, {"date": "2 Oct 2013", "title": "Assistant Director of Admissions Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Art Institutes in Mar 2011", "Interview Descriptions": "Initial communication with an HR REP who invites you in for an info session followed by several interviews.", "Interview Questions": "Why work here?  What makes you qualified to be a part of the team"}, {"date": "10 Apr 2011", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Art Institutes (Tinley Park, IL) in Mar 2011", "Interview Descriptions": "It was a group interview with about 11 people, everyone shared information about themselves, she gave a presentation of the job, then everyone had to sell themselves to interviewer.", "Interview Questions": "Give me all the reasons why you would be good at this job"}, {"date": "1 Jun 2011", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Art Institutes (Tucson, AZ) in Mar 2011", "Interview Descriptions": "The company is very upfront that the interview process could take 2 - 3 months. Interview started with a presentation of answers to frequently asked questions. Then we were given a tour from one of the \"Assistant Directors.\" This title implies management, but it is just a sales position. The actual assistant director is called the associate director. The position is about 6-8 hours of calling combined with 2 hours or so of giving interested students tours of the facility and then signing them up for the next step. After the tour we went to a 15-20 minute interview.\r\n\r\nThe people seemed professional and kind. The interview was standard. Why this job? What are your strengths? Were you ever frustrated with not making a sale and what did you do? The interviewer was concerned that I had other Saturday obligations for a couple of months and stated that this was a problem. This company wants you to eat, sleep, and breath sales for them without scheduling conflicts.\r\n\r\nThis is an hourly position that depends on mandatory overtime to make the stated salary of $30-$35,000. With the time and half and the hours expected 55-60 this puts the hourly wage at around $10 per hour. It seemed that the management was looking for people that were \"hungry\" for a job, and willing to wait a long time to get it. The other applicants interviewing with me were also put off by the long term interview process. We all had interviews with other companies the following week. This seems like a good way to  lose top talented personnel.", "Interview Questions": "Have you ever lost a sale and what did you do about it?"}, {"date": "9 Oct 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at The Art Institutes (Fort Lauderdale, FL) in Feb 2011", "Interview Descriptions": "They were only concerned with a few things. If I had an accredited graduate degree, if I had any teaching experience and if I had the time. It was all over the phone. To date I have never met one of my bosses.", "Interview Questions": "Do you have an accredited graduate degree in design?"}, {"date": "31 May 2012", "title": "Digital Photography Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at The Art Institutes (Tampa, FL) in Jan 2011", "Interview Descriptions": "I paid my own way to fly to Tampa, and stay in a hotel, and rent a car.  No offer was made to reimburse me.\r\nThe interviewers were extremely uninterested in my interview, and it lasted about all of 10 minutes.", "Interview Questions": "N/A"}, {"date": "1 Sept 2013", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 2 days. I interviewed at The Art Institutes (Sunnyvale, CA) in Jan 2011", "Interview Descriptions": "One-on-one, then staging interview in front of students and instructors", "Interview Questions": "N/A"}, {"date": "31 Aug 2015", "title": "Adjunct Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at The Art Institutes in Jan 2011", "Interview Descriptions": "This was a typical application and interview process.  They required copies of my transcripts, samples of past work, past performance reviews, and the usual professional references.  First step was a phone screening, followed by an in-person meeting and then a panel interview and presentation. Had to give a sample presentation in front of an evaluation panel on a topic of my choosing related to the subject.", "Interview Questions": "What is your past experience with students who have limited background in...?\r\nHow do you handle...?\r\nTell us about...?"}], [{"date": "7 Apr 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Art Institutes (Henderson, NV) in Dec 2010", "Interview Descriptions": "Years ago I had two interviews. The first was just with a middle manager \"Academic Director\" (AD). The second time I came back I met some others from the academic team and I performed a \"Teaching Audition\" where I spent just 10 minutes giving a sample lesson in front of a small audience of 5 AD's and faculty.", "Interview Questions": "You may be asked about classroom management and how you would handle various situations. You may be asked about how you appeal to different learning styles, large groups of students."}, {"date": "18 Feb 2014", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Art Institutes in Nov 2010", "Interview Descriptions": "The first interview was a group of 20 people, those who stood out made it to one with just the directors. It was a very fast process and I started within the week.", "Interview Questions": "How competitive are you?"}, {"date": "6 Mar 2012", "title": "Director of Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2+ months. I interviewed at The Art Institutes (Charleston, SC) in Sept 2010", "Interview Descriptions": "This was an interview for an internal position.  I interviewed with an area VP, then another, then a third.  Next I interviewed with a company VP.  These were phone interviews.  Next I had a phone interview with the executive team for the location.  I requested an onsite interview.", "Interview Questions": "Why do you want to move?"}, {"date": "21 Apr 2011", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Art Institutes (Tucson, AZ) in Jul 2010", "Interview Descriptions": "The hiring process consisted of an initial one to one interview followed by a group evaluation consisting of a sample teaching presentation. Feedback of the presentation was given immediately following the presentation. The skills that were evaluated were: lesson plan creation and preparation, classroom presentation, and time management.", "Interview Questions": "What areas of the teaching curriculum do you anticipate having problems with? "}, {"date": "5 Oct 2010", "title": "Administrative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Art Institutes (Sunnyvale, CA) in Jun 2010", "Interview Descriptions": "I met with the Dir. HR first and he spent lots of time going over his background and asked me a few questions.  Then I met with the President, Operations Manager and the Recruiting Manager for about an hour as a panel and finally with the HR person.   \r\nThey all seemed to like their job and really wanted to do the best for the company.   \r\n\r\nAfter spending several hours there I never heard back from anyone.  No rejection nothing.  That is really not the way to do business.  It was very unprofessional.", "Interview Questions": "Tell me why you should get this job."}, {"date": "21 Dec 2011", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 months. I interviewed at The Art Institutes (Chicago, IL) in Jun 2010", "Interview Descriptions": "1:1 interview. friendly environment. basic questions.", "Interview Questions": "Tell me more about yourself"}, {"date": "7 Sept 2010", "title": "Career Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (North Hollywood, CA) in May 2010", "Interview Descriptions": "I first did a phone interview (screening) with a company recruiter (HR).  They asked some basic questions - why applying, name weaknesses & strengths, describe previous experience.\r\n\r\nFirst Interview: I met with the Director of Career Services 1:1 interview.  Pleasant interview, she asked basic expected interview questions, plus a couple of hard ones.\r\n\r\nSecond Interview:  I met with one of the Career Advisors.  Pleasant interview, questions were geared more for company fit than experience.\r\n\r\n- After these two I felt that I was going to get an offer.\r\n\r\nThird Interview:  Met with Director of HR. Totally not necessary , but could tell that he just wanted to be part of the decision making process.  I think this is where I lost the offer - but good for me, cause I got another job offer that was better suited for me later on!", "Interview Questions": "Tell me about a time where you had to make a decision, but didn't have all the information?"}, {"date": "8 Dec 2011", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (Draper, UT) in Mar 2010", "Interview Descriptions": "They start by inviting a large group of people to come to the campus and learn more about the position.  It's a great forum to ask questions and potentially sticking out.  From there they invite you to meet one on one if you're still interested.  After the one on one interview they will call you back to set up another round of one on one's.  I interviewed with the Senior Director of Admissions and HR Rep as well as the campus President and CFO.  All were very professional and well spoken... the CFO had no clue what he was doing and really didn't know much about my position, but other than that, it's important to impress everyone.  In my opinion the trait they're looking for is that you are comfortable talking with people and are able to gather information from the conversation.  Being able to ask open ended questions is a great strategy.  I recommended a friend and told him to mention \"open ended questions\" in his interview and he got the job.", "Interview Questions": "(in regards to potential student) How would you get someone to talk to you if they were very shy?"}, {"date": "23 Mar 2010", "title": "High School Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at The Art Institutes (Chicago, IL) in Mar 2010", "Interview Descriptions": "An employee forwarded my resume and cover letter to the hiring manager. I was then contacted via email and asked to complete a questionnaire. The manager liked my answers and I received and email a couple of days later inviting me to a group information session where I learned more about the role as well as the compensation (benefits and salary parameters) that the position offered. It was conducted by two individuals, who stated the hiring decision was a group one. I was also asked in the email to prepare a 2-3 minute presentation on the benefits of a product or service, as this is an educational sales job. A couple of days after delivering my speech, I received a call to set up a phone interview. I was provided with a phone number and access code to dial in. There were three people on the line, the two who had conducted the group session and one additional person who did not say anything. The interview was a little tricky, but the interviewers were friendly. I was told I would be contacted by either way. Two weeks later, I was notified that they went with someone else for the position. The company culture seems great- they really want to see their employees grow within the company, the benefits package outstanding, and the hiring manager was extremely down-to-earth. The presentation rattled my nerves a bit, so I suggest preparing well in advice. Further, when asked to \"tell me about yourself\" I advise prospective candidates to really focus on their sales experience, whatever that might me. A little bummed I was not offered the position, but the interview series was great experience of what to, and not to, do on a sales interview.", "Interview Questions": "Tell me more about yourself, beyond what we see here on your resume."}, {"date": "13 Oct 2014", "title": "Admissions Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Art Institutes (San Diego, CA) in Mar 2010", "Interview Descriptions": "Consisted of two panel interviews, pretty grueling.  The first was with other admissions coordinators and a series of very usual interview questions.  The second was with several different employees from HR, Admissions, Student Affairs, etc.  All in all very standard panel interviews.", "Interview Questions": "...the strengths and weaknesses question always gets me."}], [{"date": "25 Mar 2013", "title": "Student Worker Mail Clerk Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Art Institutes (Philadelphia, PA) in Jan 2010", "Interview Descriptions": "Show interest and persistence. That'll help you land the job. Become acquainted with those in charge of the position and visit from time to time to see if there will be available positions. Just remember that you will most likely be replacing a student currently working there, so becoming acquainted with them might be somewhat awkward once they discover they've been cut and replaced by you. Still, it doesn't hurt to reach out to the student workers either. They may be the ones to help you get your foot in the door.", "Interview Questions": "Are you still interested in the position?"}, {"date": "6 Jan 2010", "title": "Admissions Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Art Institutes (Nash, ND) in Nov 2009", "Interview Descriptions": "There was an initial group interview with 15 people where each had to introduce themselves.  The three supervisors conducted a presentation that explained the position and then left time for questions.  There was then individual 1:1 interviews that consisted of three questions to see if you qualified for a second interview.", "Interview Questions": "Why do you want a career in sales?"}, {"date": "1 Jun 2012", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Art Institutes (San Antonio, TX) in Nov 2009", "Interview Descriptions": "Received an email requesting interview set up. Went in for oneon one interview. Was later asked for second interview and to fill out paperwork for background check.", "Interview Questions": "What type of experience do you have ?"}, {"date": "19 Mar 2013", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at The Art Institutes (Pittsburgh, PA) in Jul 2009", "Interview Descriptions": "You are induced (an illegal action considering the realities that unfold later) by lies that the job is about interviewing students and helping them achieve a dream of starting college. Within a week or so of training, it becomes abundantly clear that it is a hard-sales job. The company is always hiring for this job because it is always firing these employees. No staffer can always make the unrealistic quotas (thinly disguised as \"goals\") imposed, but these quotas and how they are used to illegally fire you (constructive dismissal) are not explained in the interview process.", "Interview Questions": "What would you do to save a student who applied and is wanting to cancel?"}, {"date": "20 Jul 2013", "title": "Chef Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Art Institutes (Lenexa, KS) in Jan 2009", "Interview Descriptions": "Interviewed over the phone with the Director of the Culinary Program first. Then was phone interviewed with the Dean of Academic Affairs", "Interview Questions": "N/A"}, {"date": "25 Mar 2009", "title": "Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at The Art Institutes (Seattle, WA) in Jun 2008", "Interview Descriptions": "The 'interview' was at the end of the day, the human resources contact asked questions and typed the answers as given. All questions were asked with a FLAT aspect, answers given were abbreviated. The process was robotic at best. Although the position would require creativity and personality, the interview process selected away from any customer response or customer service skills.", "Interview Questions": "N/A"}, {"date": "2 Dec 2009", "title": "Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at The Art Institutes (Minneapolis, MN) in May 2008", "Interview Descriptions": "Started with a cover letter and resume, followed by three interviews and a presentation.  Employees seemed to enjoy their work environment.  My first interview was a group interview with the Vice President and two other program directors for the school.  The second interview was a one on one with the President who then sent me to a one on one with the head of human resources.  I was called by a few weeks later to do a demonstration lesson in front of a class with a group review from the Vice President, President and two other program directors.", "Interview Questions": "What is my favorite color?"}]]