[[{"date": "22 Jan 2022", "title": "Care Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Covenant HealthCare", "Interview Descriptions": "Multiple interviewers, intimidating, put you down, wants you to have just as much as experience as they do, no training obviously, your skillset is irrelevant if it doesn’t consist of the specifics they are looking for.", "Interview Questions": "Describe what I would do given the position."}, {"date": "7 Oct 2021", "title": "Environmental Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Covenant HealthCare", "Interview Descriptions": "First with HR then with housekeeping coordinator. The onboarding process to get these interviews is pretty lengthy especially with HR.  Overall I felt very comfortable during the process. They do not try to intimidate you or trip you up like you see in other jobs. Make sure you have specific work examples ready.", "Interview Questions": "Describe a situation where you acted as a leader"}, {"date": "11 Jun 2021", "title": "Hospitality Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Covenant HealthCare (Saginaw, MI) in Jun 2021", "Interview Descriptions": "Friendly, didn’t make me nervous, 3 people interviewed me and took turns asking me questions and different scenarios and how I could relate them to this job, and if I had any experience in customer service at all", "Interview Questions": "A time I faced a hardship "}, {"date": "3 Oct 2019", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Covenant HealthCare (Saginaw, MI)", "Interview Descriptions": "Very nice interview which included an option for a 4 hour job shadow. The unit I hired onto was a specialty unit so I wanted to make sure I was ready for the requirements of the job. I enjoyed the job shadow and was excited to take on the responsibility.", "Interview Questions": "Would I want part time or full time"}, {"date": "17 Sept 2019", "title": "Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Covenant HealthCare (Saginaw, MI) in Sept 2019", "Interview Descriptions": "Phone interview, Panel Interview, HR Interview (All super great!) All of the ladies I had from the Visiting Nurse group were amazing. They made the interview process super easy and even laid back. Asked questions that actually pertained to the role.", "Interview Questions": "What should the relationship be between you and your manager "}, {"date": "25 Jan 2020", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at Covenant HealthCare (Saginaw, MI) in Jan 2019", "Interview Descriptions": "The interview process moved along really fast. It was easy.  Interview lasted no longer that 15-20 minutes. Really relaxed. The interview process moved along really fast. It was easy.  Interview lasted no longer that 15-20 minutes. Really relaxed.", "Interview Questions": "What makes you a perfect fit for the job."}, {"date": "29 Nov 2018", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Covenant HealthCare (Saginaw, MI) in Oct 2018", "Interview Descriptions": "I first met with HR, then as soon as she was done interviewing me she took me to meet the pharmacy director. I then interviewed with him for a good hour and half and he thoroughly explained the job to me and what to expect if I was offered the position.", "Interview Questions": "How would you uphold their mission statement?"}, {"date": "10 Jul 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Covenant HealthCare", "Interview Descriptions": "Had to drive way out almost to dumplin valley !! had to check in at front desk and then they came and got you .took you back explained the job and benefits pay etc.... asked why you wanted to work with them asked about past experience and then offered you a position very easy interview.. after interview you have to fill out all sorts of paperwork they send to your email you also have to take a drug test /urine and blood also a tb tezt and get a flu shot Id say the all together process takes about 3 ro 4 weeks for hire. you also have to attend 1 to 2 weeks of orentation and computer training", "Interview Questions": "past experiece"}, {"date": "12 Sept 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Covenant HealthCare (Knoxville, TN)", "Interview Descriptions": "Easy online and private. Contacted immediately and had phone interview. Flexible with interview times and environment was comfortable. Met with manager and ancillary staff, given a tour. Offer was made in two days and I accepted. Still have the same manager and our unit is more like a family.", "Interview Questions": "What would you do if you saw someone stealing narcotics?"}, {"date": "12 May 2021", "title": "Behavioral Health Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Covenant HealthCare (Saginaw, MI) in Aug 2017", "Interview Descriptions": "In person interview with two individuals who asked basic questions about my experience and if I met the standards of compassion, integrity and many other qualities. Not a ton directly on the job itself.", "Interview Questions": "Do you have experience with individuals with Autism? "}], [{"date": "1 Sept 2017", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Covenant HealthCare (Saginaw, MI) in Jun 2017", "Interview Descriptions": "Long but very detailed asked lots of questions and the managers were very easy going. I interviewed with three different managers and they were all great and also too a tour of the facility and was amazed at everything.", "Interview Questions": "Why do you want to work for Covenant?"}, {"date": "8 Jan 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Covenant HealthCare (Saginaw, MI)", "Interview Descriptions": "A few phone interviews, along with a panel interview, then a meet and greet. It was scary, but interesting.... make sure you look at all of the managers and learn how to do panel interviews... otherwise you won't do well.", "Interview Questions": "The number one question is to make sure you know the Hospital's motto: Extraordinary care for every generation. Screw this up and you're toast."}, {"date": "8 Apr 2016", "title": "Chaplain Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Covenant HealthCare", "Interview Descriptions": "Phone interview.  The interview was with a team of people - from HR and from department applying with.  There were two parts to the interview.  First part was primarily with HR, and involved general interview questions.  Second part with department, and was more specific to skills and experience directly relating to job applied for.", "Interview Questions": "If we were talk to your references, what would they say about you?"}, {"date": "8 Oct 2015", "title": "Pharmacy Inventory Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Covenant HealthCare", "Interview Descriptions": "Very informal. Didn't not ask more than 3 questions relevant to the experience.  Interviewer was very nice and personable. Overall it was very relaxed and it seemed like it would have been a very nice place to work", "Interview Questions": "What do you know about covenant healthcare?"}, {"date": "9 May 2015", "title": "Surgical Technologist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Covenant HealthCare (Saginaw, MI) in Apr 2015", "Interview Descriptions": "They got back to me very quickly( within 3 days) upon me submitting my application online. I went in for the interview they had me watch a video about the hospital then wait til the interviewer was ready. The interviewer was very professional and asked standard questions. I have been called back for another interview with the O.R. manager which should be the final interview. The shifts that were offered were great but the pay is substantially lower than other hospitals in the area I'm talking 15 an hour. That has kinda of turned me off a little about this job but I'm open to working here because I have heard from current employees that it is a nice work environment.", "Interview Questions": " Name a time when you messed up at a previous job. How did you correct that problem. All standard interview questions and she even chats a little between questions which helps to lighten the mood a little. "}, {"date": "8 Oct 2014", "title": "EKG Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Covenant HealthCare (Saginaw, MI)", "Interview Descriptions": "Interview and hiring process was rather simply, not complicated. I was referred by an employee. I received a call in reference to the interview.  Shortly thereafter I completed the interview and was hired. The process was rather quick.", "Interview Questions": "Nothing was really difficult about the interview. The questions were about real life scenarios, and demanded practical responses"}, {"date": "13 Dec 2011", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Covenant HealthCare (Saginaw, MI) in Mar 2009", "Interview Descriptions": "Applied in person at Human Resources. I was given two interviews. The first interview was with the department head. Interview was simple and short. Basic questions about myself and past work experience. The manager also asked if I was going to school for a healthcare career. Covenant likes to hire employees who are in college studying a health profession. Great opportunities if you are going into nursing. The second interview was conducted by an employment specialist at HR. Most questions were behavior based. She also wanted to know my work history and how I worked with a team. Covenant is a very team orientated company.", "Interview Questions": "Describe a time when you were leader?"}]]