[[{"date": "6 Jun 2023", "title": "BI Developer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "Three interviews. Interviews were with hiring manager, team and then finally director. The interviews were straight forward. The questions revolve around sql knowledge, tableau experience and Power BI experience. A few questions were asked about the software development life cycle.", "Interview Questions": "Please see my comments above"}, {"date": "27 May 2023", "title": "Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Rutgers University in May 2023", "Interview Descriptions": "20 min + video interview and then an in person. \n\nAsked basic questions regarding experience. \n\nThey will claim they will let you know if you moved on to the next step but just end up just ghosting instead.\n\nArchaic technologies are used.  They did not seem open to using anything new and stuck with what they know. Not good for growth.", "Interview Questions": "Are you familiar with Linux commands?"}, {"date": "7 Apr 2023", "title": "Front Desk Receptionist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University (Newark, NJ)", "Interview Descriptions": "Pretty good. Easy interview. Fun and interesting. Was in a group with many people and it was great talking with many other people. We had to watch two videos and make some comments. Videos were fun.", "Interview Questions": "How would you rate your interview experience"}, {"date": "29 Mar 2023", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Quick, easy to follow- interviewer asked many relevant questions that were applicable to the job. Found the process to be very straightforward and helpful when actually applying for the job", "Interview Questions": "What relevant experience do you have"}, {"date": "10 Mar 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "representing. Provide an overview of the interview process and what the interviewee can expect. It is important to establish a friendly and welcoming tone to make the interviewee feel comfortable. Background: Ask the interviewee to provide some background information about themselves, such as their education, work experience, and any relevant skills or qualifications. This will help you understand their perspective and provide context for the rest of the interview. Goals and Motivations: Ask the interviewee about their goals and motivations. This can help you understand their values, aspirations, and what drives them. For example, you can ask them about their long-term career goals, what they hope to achieve in their current role, or what motivates them to excel at work", "Interview Questions": "Do I have a lot of time in the following semester"}, {"date": "6 Mar 2023", "title": "IT Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "30 min interview asked simple questions. Had a technical, verbal, and communications, interview section. People were very nice and were happy to answer any question you may have. Got my offer 2 months after my interview.", "Interview Questions": "Asked how to print multiple slides on 1 page."}, {"date": "2 Mar 2023", "title": "Preschool Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Fill out application on Rutgers website. You will receive a Phone call and Set up interview according to your availability. Come to the location and you will Interview in the Supervisor office. The Supervisor will ask you questions and you will have to Answer questions . 30 minutes", "Interview Questions": "How many years of experience do you have? Do you have your P-3 certificate?"}, {"date": "1 Mar 2023", "title": "Special Education Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "The interview was held in a timely manner and the administrators were personable. They offered a lot of good information about the school, students, and staff. It was overall a good experience.", "Interview Questions": "What type of skill acquisition programming would you focus on given a certain age range of learners."}, {"date": "1 Jul 2023", "title": "Foundation Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ) in Mar 2023", "Interview Descriptions": "Wasted hours on months of an extended interview process with over 16 current employees -- affiliated with the role and not -- that resulted in a form email at 10pm on a Sunday evening. Completely unprofessional and disrespectful of candidates' time.", "Interview Questions": "Involved 18+ hours of interviewing"}, {"date": "22 Feb 2023", "title": "Peer Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "The employer was very nice and introduced the whole process of the work. Asked you some basic questions. Be confident and express your willing to help. Have some own strategies for helping diverse groups.", "Interview Questions": "What your own strategy for helping freshman to learn about more school activities."}], [{"date": "17 May 2023", "title": "Member Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Rutgers University in Jan 2023", "Interview Descriptions": "Very straightforward. You are interviewed by one of the building managers. Be sure to show up at least ten minutes in advance, be cheerful, and remain confident. It was a series of scenario based questions followed by personal questions.", "Interview Questions": "Question: Describe how you would tell a patron how to get to our facility from the Quads, for example. Question: Describe a difficult moment and how you have persevered. Question: What is one thing you would suggest to improve Recreation."}, {"date": "2 Feb 2023", "title": "Finance PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Rutgers, NJ) in Jan 2023", "Interview Descriptions": "Committee members come together and ask you some general questions. The interview starts with a self-introduction and then moves to your research background. They will ask you about the projects you have done as well as the specific research question you want to study in the future. Overall, the interview is easy, and the atmosphere is pretty good.", "Interview Questions": "Self-introduction; previous research project; future research field;"}, {"date": "22 Dec 2022", "title": "Student Programming Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Simple easy and to the point. The director was very chill. Simple role assignment. Best of the best. One of the easy roles to master for any new student. Any student can pick up easily", "Interview Questions": "How was your experience at rutgers and when can you start?"}, {"date": "5 Dec 2022", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "It was quite brief! They were very nice and straight to the point. The meeting lasted about 20 minutes and I got a call shortly after telling me that I got the job as the marketing coordinator in one of their schools.", "Interview Questions": "Can you write a press release?"}, {"date": "12 May 2023", "title": "Temporary Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University (Newark, NJ) in Dec 2022", "Interview Descriptions": "I got an email about interview and then they want me to complete 2 skills tests which are about supervisory skill and analyzing data. After complete these tests we set up an in person interview.", "Interview Questions": "Are you US citizen or do you have greencard?"}, {"date": "19 Nov 2022", "title": "Teaching Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "I have two round interviews. The process was normal. Have a phone interview and video interview. I have got Average question, and average vibe. The whole process was normal not very hard", "Interview Questions": "Why do you choose this area"}, {"date": "28 Oct 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "No interview showed me around and explained duties and procedures. Asked me if i had any prior knowledge in this field. If i had a drivers license. Very kind and chill", "Interview Questions": "Are you familar with research"}, {"date": "26 Oct 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rutgers University", "Interview Descriptions": "Fairly easy. Just a few questions. Mainly about availability and what their expectations were for you on the job. They also asked about prior work experience, just to see if this was your first job or not.", "Interview Questions": "When are you available to work?"}, {"date": "20 May 2023", "title": "Part Time Student Helper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (Newark, NJ) in Sept 2022", "Interview Descriptions": "A quick interview process online through zoom and clear description of the job and what it needed, daily tasks, etc. The paid were mentioned as well during the interview process, flexible hour were provided.", "Interview Questions": "How many hour could you work ?"}, {"date": "27 Aug 2022", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "The process was straightforward and asked standard interview questions. I applied online and was contacted for a virtual interview. I met with different team members in the organization.  It was a standard interview process.", "Interview Questions": "Why are you interested in this position?"}], [{"date": "16 Aug 2022", "title": "Research Teaching Specialist V Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Rutgers University", "Interview Descriptions": "The interview process is straight forward with the basic interview questions, go over publications of your PI and be inquisitive. Given opportunities if the grades are good and did a thesis", "Interview Questions": "Tell me about your current experiences and why you want to job this position"}, {"date": "22 Nov 2022", "title": "MHC II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Edison, NJ) in Aug 2022", "Interview Descriptions": "Long process. Simple but long. Must complete full physical with a Rutgers appointed physician before offer is official. Only one interview, on Zoom with Director and program supervisor, lasted 1hr. Lots of questions and scenarios", "Interview Questions": "Specific situations regarding crisis intervention, team work, and treatment modalities. They were interested in knowing history of working with groups. Group work is a MUST"}, {"date": "14 Jul 2022", "title": "Post Doc Fellowship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Very open and direct, the team was welcoming and exciting. As far as interview processes go, it was the shortest of the ones I experienced, and there was no need for an autobot personality test or extraneous items in the process.", "Interview Questions": "To describe your background and interests for future development"}, {"date": "22 May 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Jul 2022", "Interview Descriptions": "After completing an online application, they reached out via email for a Zoom interview. The questions were about availability, organizational strategies, and experience related to administrative duties. This position was for the educational department, so they also asked about background related to that.", "Interview Questions": "What is one strategy you use for time management and organization?"}, {"date": "16 Feb 2023", "title": "Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University in Jul 2022", "Interview Descriptions": "The interview was a two step process. First interview was with the Principle Investigator and the research coordinator that was leaving. It was through Zoom and fairly easy. The second interview was with HR. The asked for my CV again that detailed all the laboratory experience I had. The hiring process took over a month after I accepted the job offer.", "Interview Questions": "What type of laboratory experience do you have."}, {"date": "9 Jun 2022", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Formal, in person, was a good process, I got hired. Campus center associate. Decent base pay review. It went well. Formal, in person, was a good process, I got hired. Campus center associate. Decent base pay review. It went well", "Interview Questions": "What’s customer service mean to you"}, {"date": "19 May 2022", "title": "Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "First contact was a phone interview. Followed by an in-person interview with hiring manager then lastly an in-person interview with the director of the department. Interviews were used to discuss my previous experience and the departments role on the campus.", "Interview Questions": "Expected administrative and technical questions"}, {"date": "23 Jun 2022", "title": "Program Coordinator II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in May 2022", "Interview Descriptions": "Fully remote process, moved very quickly! Had an initial phone interview with the hiring manager, proceeded to make the next round- a Zoom call with a panel of 4 interviewers, then had a final phone interview with an HR representative and received an offer. All within about a week's time, but this will vary based on the department and their needs.", "Interview Questions": "Q: Tell me a little bit about yourself and your background.\n\nQ: What made you want to apply for this job? \n\nQ: Why do you want to work at Rutgers?\n\nQ: What are some of the strengths you possess and you could bring to this position?"}, {"date": "11 Mar 2023", "title": "Graduate Teaching Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Rutgers University in May 2022", "Interview Descriptions": "I emailed my professor at the end of the semester to become a TA for the course, and she easily agreed (because I got an A and met with her regularly during office hours)", "Interview Questions": "Why do you want to be a TA for this course and do you want to get a recommendation through your TA? What time are you available?"}, {"date": "31 Mar 2022", "title": "IT Deskside Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University", "Interview Descriptions": "They want people that aren't really in tech. So you probably won't get it if you are a CS engineer or something like that. The people I know that have been chosen to work there are econ or a humanities degree.", "Interview Questions": "What is your experience with tech"}], [{"date": "28 Mar 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "It was cordial and collegial. They had a sense of honesty and investment that I had not experienced any where else. Additionally, there was a keen sense of professionalism, from the moment I was invited to do the interview until the very end. It was definitely exciting and I couldn’t be happier going through the process.", "Interview Questions": "My future projects and teaching skills "}, {"date": "24 Mar 2022", "title": "Instructional Designer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rutgers University (New Brunswick, NJ)", "Interview Descriptions": "Completed a phone screening with a manager first. Then was invited for a live interview with a panel of 3 people. Invited back for a final interview that included a skills test but declined.", "Interview Questions": "How do you stay current on trends in the instructional design industry?"}, {"date": "8 Mar 2022", "title": "Classroom Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "I sat in a room with 4 people and I interviewed with all of them at once. Spoke about my experience and how I would handle situations in a classroom. Then  they went over job requirements.", "Interview Questions": "What would you do if a student started acting up while running a program."}, {"date": "1 Mar 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Quick and to the point. Will not be tricky. Asks the basic questions you would expect. Why are you here? What are you trying to accomplish? What can you bring to the table?", "Interview Questions": "Why are you applying to our department?"}, {"date": "8 Aug 2022", "title": "IT Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Rutgers University in Mar 2022", "Interview Descriptions": "Interview was a video call where 2 people asked questions about my knowledge on troubleshooting and computers and about what to do during certain scenarios. My interviewers were very kind and patient when I was answering their questions.", "Interview Questions": "Your coworker is slacking off. What do you do?"}, {"date": "22 Feb 2022", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Takes long for them to contact you but once you are contact, the interview session is average. Panel interview like. Once you are offered the position, HR process not very clear.", "Interview Questions": "Are you able to keep up with the high demand from students?"}, {"date": "14 Feb 2022", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University", "Interview Descriptions": "Standard interview process. Spoke with various people that explained the position in detail. What I enjoyed is that they were able to do this in a panel interview setup. That way I did not have many interviews at different times. This may have been due to COVID, but this made the interview process easier.", "Interview Questions": "Describe your past work experience and how it aligns with this position;"}, {"date": "10 Feb 2022", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "It took quite a long time to go through the system just because of the system of appliance and getting past all of the barriers for a job and then hear back", "Interview Questions": "What is the most important trifecta in project management when  looking at program coordination?"}, {"date": "21 Mar 2022", "title": "Global Roommate Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rutgers University (Rutgers, NJ) in Feb 2022", "Interview Descriptions": "You can do it with your partner or alone. No matter what option you choose, they have the fixed question in a list, around 6 or 7. They are about why you want to apply for this position, how to solve roommate conflicts, etc.", "Interview Questions": "why you want to apply for this position, how to solve roommate conflicts, etc. "}, {"date": "18 Mar 2022", "title": "Associate Director of Web Strategy and Systems Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Feb 2022", "Interview Descriptions": "First I was contacted via email, \r\nThen I had two phone screens\r\nAfterwards  I had two video interviews\r\nFollowed by ghosting, after the final round I heard nothing for some time, which is unprofessional. \r\nOverall end to end was about 4 weeks from first contact to me deciding I wasn't going to get some professional courtesy. I had a decade of experience, private sector, state government, and federal experience (I was actually an executive in the federal government when we began the process, the lack of courtesy for someone who's a fellow civil servant was disappointing)", "Interview Questions": "Do you have experience in a nonprofit environment? Do you have editorial experience? How do you leverage marketing for initiatives?"}], [{"date": "20 Apr 2022", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2022", "Interview Descriptions": "The interview that I had with this company gave me a better insight on how to answer questions that are in the likes of clinical research. I think its important to gain proper knowledge prior to your interview and that is what would have made my interview a bit better", "Interview Questions": "Why do you want to work for this company?"}, {"date": "25 Feb 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2022", "Interview Descriptions": "Seamless and based on logical thinking, decision making competency. There is emphasis on continuous improvement in the role, hybrid work environment for all roles is also available. The professors are really helpful and available for guiding through the complex tasks in the project.", "Interview Questions": "Why do you like this role?"}, {"date": "10 Dec 2021", "title": "Student Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Rutgers University", "Interview Descriptions": "Had the interview with Mary Ann in her office at Cook Douglass. Basic review of your transcript, especially for the courses you want to tutor. Be prepared to give remarks about any low grades you may have had for other courses as well.", "Interview Questions": "I had a C in a single class while the rest were A's. She asked why this was the case."}, {"date": "5 Dec 2021", "title": "Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "I was a given a list of problems and on the day of the interview, one was selected for me to do on the board as I would in front of a real class.", "Interview Questions": "How/what kind of technology have you used in the classroom?"}, {"date": "25 May 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rutgers University (New Brunswick, NJ) in Dec 2021", "Interview Descriptions": "Interview was quite detailed, but no extremely challenging questions. First round with 2 members of the team.  Second round with 2 groups. Everyone was friendly and it seems to go well. But sadly they never followed up to invite back, or even thank for attending.", "Interview Questions": "More focused on experience and expectations for the particular role."}, {"date": "19 Oct 2021", "title": "Applications Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University (New Brunswick, NJ)", "Interview Descriptions": "Worst interview of my life. Went in person and had to complete multiple whiteboard coding problems as well as one debugging code problem. They also asked me to recall every class I took in university and asked me class specific questions (wtf).\n\nOverall the entire session was three hours (way over time). Obviously I did not do very well as what they were asking of me was beyond ridiculous - I'm a person, not a human robot able to recall all of this information! 😓 They proceeded to ghost me.", "Interview Questions": "Bring in code samples and discuss what you did.\nDebug code live."}, {"date": "3 Nov 2021", "title": "Applications Developer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rutgers University (Piscataway, NJ) in Oct 2021", "Interview Descriptions": "Too many interviews. Nice people. Decent pay and benefits, offer of continued education which is nice if you're into such a thing. Did I say too many interviews, though? Overall, seems like a nice place to work if you enjoy a lot of breadth in your job.", "Interview Questions": "Difference between an interface and an abstract class."}, {"date": "23 Mar 2022", "title": "Application Programmer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Oct 2021", "Interview Descriptions": "Simple phone interview, except literally over a phone call which is archaic in the year 2021-22. Interviewer didn't seem to care about any critical thinking abilities or actual skills, just rote memorization. Stay away.\r\n\r\nAsked random trivia-esque questions, as well as if I knew what a certain acronym meant. Replied I didn't, afterwards I googled it and realized I did know what they meant as I had been using it for years. They were just calling it a nickname I had never heard of.\r\n\r\nNot once was I asked about anything on my resume besides clarifying if I filled their laundry-list of knowledge of random technologies. \r\n\r\nTake the title literally, they don't want an engineer. They want a programmer who will be little more than a code monkey. Nothing in the way of critical thinking or interesting problem solving will be experienced here.\r\n\r\nThey also ghosted after the interview, another black mark.\r\n\r\nRutgers also doesn't pay much, I got two offers just a couple weeks later for 60% more than they offered and then after a couple months an offer for twice as much.", "Interview Questions": "1. What does M.V.N. mean to you?\r\n\r\n2. Java OOP trivia.\r\n\r\n3. What is a singleton?\r\n\r\n4. What is a SQL db? (Didn't clarify if relational or noSQL, and didn't clarify when pressed on it. Clearly didn't know the difference themselves and was flustered)"}, {"date": "6 Jan 2022", "title": "Adminsitrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rutgers University in Oct 2021", "Interview Descriptions": "The first one started with a phone call interview and then a Zoom call with 3 interviewers.  This went really well. \nI had another Zoom call interview from a different department which did not go well.", "Interview Questions": "What kind of Management experience do I have?\nHow would you deal with a diverse environment?\nWhat kind of software have I used?"}, {"date": "27 Sept 2021", "title": "Student Center Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Smooth and easy going, there was not much technical questions, most of it was behavioral questions. The one behavioral question was to test if you knew what basic AV stuff did", "Interview Questions": "How do you feel about working in a team?"}], [{"date": "22 Sept 2021", "title": "Systems Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "I was interviewed by 2 managers at the same time for over 2 hours and needed to give a 15 minute presentation after. Standard interview questions ranging from job history to specific projects details.", "Interview Questions": "Why are you leaving your present company?"}, {"date": "5 Aug 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rutgers University (New Brunswick, NJ)", "Interview Descriptions": "I applied on Rutgers' career portal. The interview experience was toxic. Also my mistake was I should've never applied for a part-time position while looking for a full-time position. At the very beginning, they asked me and all other candidates to attend a \"training\" for a whole day on zoom !! We were asked to read the survey question by question (role play) for 6 hours! Then I was given a second-round interview with the team. They asked me my data skills and other work experiences. I specifically told them I didn't know SAS. They said it would be ok. They mentioned they would give me another round of interview to test my language skills and a skill test to do. After a few days, I did a third-round interview with a data analyst in another language. Then I did a forth-round interview that only lasted for 10 min with another lady! The lady confirmed my data skills and I told her I didn't know SAS. I could only do the test in R or Stata. She said no problem and then sent me a test that had to be down in SAS. I got so mad and felt they had been wasting my time. In order to be transformed to be a full-time, you need to work part-time for 6 months and get pass. It is extremely toxic and I encourage every one to look for somewhere else", "Interview Questions": "Why do you apply for this position"}, {"date": "26 Aug 2021", "title": "Secretary Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2021", "Interview Descriptions": "Remote interview over Zoom with two higher ups. The questions were generic. The tone was less friendly than I’ve encountered in most other interviews. This was the first interview in (I think) a two round process. I went with another opportunity before hearing back.", "Interview Questions": "What is your Excel proficiency?"}, {"date": "9 Sept 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University in Aug 2021", "Interview Descriptions": "Very straightforward interview process and took less than 10 minutes through a phone call. The interviewer asked questions pertaining to the responsibilities of the job and my experience related to the job.", "Interview Questions": "Do you have any previous research experience?"}, {"date": "20 Jul 2021", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "Basic interviewing and behavioral questions over the phone, then an in-person interview asking about interests and other topics relating to the position, followed up with an acceptance or denial within the week", "Interview Questions": "What made you interested in this position?"}, {"date": "18 Jul 2021", "title": "Senior Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Had phone interview. I thought it went well. No one ever called for a follow up or emailed. I would have appreciated something either way. Interview was short and not too difficult.", "Interview Questions": "Where do you see yourself in 5 years "}, {"date": "15 Jul 2021", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Talk with PI about the your career goal and post research projects, what you can bring to the team, also the description of the projects the PI has, the team size, and job description.", "Interview Questions": "Can you introduce me your PHD project?"}, {"date": "8 Jul 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "It was easy and straight forward. Know your stuff and just talk technical. Interpersonal skills are important for the job, but not during the interview. I followed my resume and talked about the education, experiences, and courses that were relevant to the position and answered the interviewer's questions.", "Interview Questions": "Why do you want to work for me?"}, {"date": "8 Jul 2021", "title": "Research Assistance Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "The job sounded like a lot of work and very little pay.  Also did not sense much growth beyond entry level position. Did not seem like the best of fit for me.", "Interview Questions": "Give us an example of a project you managed"}, {"date": "23 Jun 2021", "title": "Resarch Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "It took about three weeks or so to get an interview and it was done virtually. They asked standard interview questions based on the resume and previous industry experience. Overall, it was a smooth experience.", "Interview Questions": "They asked me to talk about my previous experience."}], [{"date": "3 Jun 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "The professor's team is very nice. Process goes great. \r\nFirst, meet the professor, and then go to the seminar room to present and Q&A.  after that, meet with other professors and scientists from the lab and the department and HR. cool", "Interview Questions": "very specific science questions and discussed details"}, {"date": "2 Sept 2021", "title": "Student Lab Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University in Jun 2021", "Interview Descriptions": "extremely long process with little communication in between waiting to hear if you got the job. the people are very nice but it’s a waiting game. I still have not heard back as they are still interviewing candidates after a month", "Interview Questions": "What is your experience pertaining to this position?"}, {"date": "24 May 2021", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Asked for lesson plan sample, experience with classroom teaching, college education, and knowledge of course content. Wasn't too stressful in my opinion. My interview was for the Academic Foundations Center for the Trio Talent Search.", "Interview Questions": "Q. Tell me about yourself and why are you interested?"}, {"date": "11 May 2021", "title": "Compensation Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ)", "Interview Descriptions": "Was called to meet with the Compensation Manager and another person 2 times.  After my 3rd interview with a more senior person I was never got a call back or rejection letter.", "Interview Questions": "Why are you leaving your current employer?"}, {"date": "22 Apr 2021", "title": "Application Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Went in and talked briefly about past projects / experiences; then was asked a number of trivia type questions about the technologies and relevant concepts for the role I was applying for. I was asked to bring code samples of a past project.", "Interview Questions": "After looking at a code sample of a previous project I worked on, they asked what I might do differently now and how would I make it more maintainable."}, {"date": "21 Jan 2023", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in Apr 2021", "Interview Descriptions": "I applied through the career portal as soon as it was posted. I heard back from them and got the 1st round of interview soon. Interviewers were friendly and asked some behavioral questions and a lot of technical questions related to their machine learning project. Then I was asked to provide 3 references. The next day when they finished talking with my references, I received a verbal offer.", "Interview Questions": "How do you use machine learning to solve xx this problem? What are the steps?"}, {"date": "31 Mar 2021", "title": "Special Collection Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "I talked with the head of the department for some time about my interests in the field. With my skills and interests decided we discussed the openings that were available.", "Interview Questions": "What is your computer literacy?"}, {"date": "29 Mar 2021", "title": "Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Basic questions, behavioral questions and general things about your resume. They reply back pretty quickly. Friendly interviewers and nice people overall. You have to go in and talk to them face to face. No need to be a cs major just tech related is good", "Interview Questions": "Tell me about yourself. What experience do you have?"}, {"date": "19 Mar 2021", "title": "Part Time Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "One main interviewer who introduced me to her mgr and several of the other staffmembers.  Very informal and friendly. The interview took about 30 minutes, followed by a review of procedures to complete the hiring process.", "Interview Questions": "I was asked about my background that qualified me to speak on my subject matter."}, {"date": "20 Mar 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Rutgers University (New Brunswick, NJ) in Mar 2021", "Interview Descriptions": "I scrolled through the Aresty portal and found a position that matched my coursework and interests quite well, and after submitting the typical supporting documents, received a phone call with the chief researcher of this project who turned out to be an extremely fascinating person with a depth of experience both in academia and in the \"field\". I did not hear back for five or so months.", "Interview Questions": "Are you particularly attached to being a research assistant through aresty?"}], [{"date": "19 Feb 2021", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "Team interview with multiple people. Was mostly behavioral in nature. You get observed by the hiring staff in teaching situations. You are given different scenarios in which you must create lesson plans or react to something.", "Interview Questions": "Why do you want to be a learning assistant?"}, {"date": "15 Feb 2021", "title": "Learning Assistance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "The interview process with okay. We have been seating in groups and each group got asked questions. I can say that it’s not technical interview. So have fun it. Ask questions, allow your other group-mate to talk and listen to them.", "Interview Questions": "Some non technical questions like challenges you faced and stuff. "}, {"date": "10 Feb 2021", "title": "Work Study Student Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "There was no interview, I just applied and got it. All you need to do is apply to get in.  Just make sure you apply to the right campus or you'll have a mistake.", "Interview Questions": "They did not ask any questions."}, {"date": "6 Feb 2021", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "I gave a talk and met with some people - great atmosphere. Very academic and devoted to research and students.  Just very upbeat.   Probably the most upbeat from all universities I have ever interviewed.", "Interview Questions": "What is your most important acheivement"}, {"date": "2 Feb 2021", "title": "Resident Physician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "Straightforward, disorganized, lots of down time between  interviewers, could have been organized in 2 or 4 hours and instead took 1 day, met with all attendings and several other HCP", "Interview Questions": "Previous History, Career aspirations, don't recall the rest"}, {"date": "22 Nov 2021", "title": "Student Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Rutgers University (Piscataway, NJ) in Jan 2021", "Interview Descriptions": "It was on Zoom because of COVID. Very easy. There will be a few staff and they will ask you questions pertaining to the work. They'll ask you \"what if\" scenarios. Don't worry. Super easy.", "Interview Questions": "Why do you want to work here"}, {"date": "2 Jan 2021", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "Group interview, split into smaller groups of three to four people to complete activities and later present to full group, activities were related to real life classroom scenarios and lesson planning", "Interview Questions": "Provide a compliment and a constructive comment to your group members. "}, {"date": "7 Oct 2021", "title": "Student Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2021", "Interview Descriptions": "I was interviewed by a professor who needed a student to help coding and designing a website for a digital humanities project. The professor was courteous and to the point. He asked about my web design qualifications and the interview lasted around 25 minutes.", "Interview Questions": "What is your experience with web design? Why are you interested in participating on the project?"}, {"date": "31 Dec 2020", "title": "Spring Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Interviewed by two attorneys who were very accommodating and personable. They made me feel very comfortable and had a great experience. The interview was over Zoom, but it did not make the interview awkward.", "Interview Questions": "Tell us a little about yourself"}, {"date": "27 Apr 2022", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2021", "Interview Descriptions": "It was good quality questions to seek the education, experiences, and salary. I learned how to perform the university job interviews through this opportunity. Also, they are very positive to see and heard my experiences and opinion.", "Interview Questions": "Why do you want to work with us?"}], [{"date": "24 Nov 2020", "title": "Volunteer Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Very welcoming and comfortable. I was engaged through the entire process and felt all of my responses to questions were listened to diligently. Never felt intimidated and was excited at the rapport I was able to establish with me interviewer", "Interview Questions": "What I thought expectations may look like for me in the role"}, {"date": "22 Nov 2020", "title": "Student Dining Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "super easy basically asked my availability hired on the spot and asked me how i was adjusting to school she was rlly nice and straighforward and i would reccomend to anyone", "Interview Questions": "how are you doing today"}, {"date": "14 Nov 2020", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Quite straight forward asking scientific questions, technical queries, Soft skills, and technological skillsets. The benefits, recreation is very good. Transport around the university town is very good. Postdoc Association is active and helpful for the personal, career development of the fellows.", "Interview Questions": "Technical expertise, scientific expertise, soft sills as a group work"}, {"date": "31 Oct 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "First round was with 3 people then 2nd round was with each individual director (superday). Very nice people but did not get offered the position. Did reach out for additional feedback which I received and was happy with that.", "Interview Questions": "Walk me through your resume?"}, {"date": "12 Jan 2021", "title": "Inventory Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Newark, NJ) in Nov 2020", "Interview Descriptions": "I received an interview request via email the next day after I applied for the position.  I Interviewed that same week. Then I received a rejection letter about a month  after.", "Interview Questions": "Why Rutgers Dentistry and Medicine?"}, {"date": "27 Oct 2020", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "The inter view straight foward and relaxed. We sat, in person, in an office room and the total interview process lasted around twenty two  minutes. I felt good about the whole process.", "Interview Questions": "What was your favorite class in school"}, {"date": "27 Oct 2020", "title": "Resaercher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Ask questions on tell me about yourself, what are your goals. Why do you love working in research. Where do you see yourself in 10 years. Describe a challenging situation and how you solved it", "Interview Questions": "Tell me about yourself? \nWhat are your strengths and weaknesses?\n"}, {"date": "6 Oct 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Depends on the stipend/program you go through. Within the departments it's easier to connect with professors for their research since it is all about networking when it comes to connections. This gives the option to see different research topics within the departments as well.", "Interview Questions": "What are your goals in this role?"}, {"date": "2 Oct 2020", "title": "Application Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "Had an over the phone interview followed by a panel interview. Interview consisted of mostly behavioral questions. I was asked about project and some technical experience, but not in great detail. During the interview I was asked questions about experience on my resume.", "Interview Questions": "Why do you want to work at Rutgers?"}, {"date": "20 Sept 2021", "title": "Computer Lab Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in Oct 2020", "Interview Descriptions": "Very quick interview, goes over basic IT troubleshooting as well as some HR questions to make sure you are good with customer service. Overall relatively easy and low stress, very good student job", "Interview Questions": "There are bunch of problems with this computer in front of you, please do your best to resolve all of the issues"}], [{"date": "29 Sept 2020", "title": "OIT Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Interview with the specific campus you applied to. They ask some tech questions and more situational questions. They put an emphasis on customer service. After a month I heard back in April.", "Interview Questions": "What kind of file ends in a .txt"}, {"date": "31 Aug 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Rutgers University", "Interview Descriptions": "Very simple process that is dependent on the department or college hiring. Did not take much preparation and just speak on how it relates to what you are studying, and longterm career goals.", "Interview Questions": "Why do you want this?"}, {"date": "10 Aug 2020", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "Not time consuming , informative. A couple of questions as well as a review of your resume. Arriving earlier than on time was a big plus in their eyes that they mentioned during the interview.", "Interview Questions": "Name a time where you had  to deal with someone with a bad attitude?"}, {"date": "26 Apr 2020", "title": "Correctional Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "There was a brief phone conversation asking generic nursing experience questions.  Afterward, there was a  Face to Face Meeting. After the meeting, I was walked around through the clinic and had been introduced to the staff.", "Interview Questions": "Do you understand the responsibilities of a correctional nurse?"}, {"date": "22 Apr 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rutgers University", "Interview Descriptions": "Everyone's experience is different. For me this entire process took about 1 month after initial email. \r\n1. started with an email from department (a couple of months after submitting application)\r\n2. phone screening\r\n3.  formal in-person\r\n4. offer made", "Interview Questions": "How do you prioritize multiple tasks"}, {"date": "6 Apr 2020", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University", "Interview Descriptions": "Panel interview: They reached out to me 24 hours in advance for the position. It all felt rushed. A couple of the panelists had negative energies about them that made the experience uncomfortable. I did the best I could given the constraints but did not meet mine or their expectations.  I am happy about the experience because I learned more about the office culture and myself - We are not a fit. ", "Interview Questions": "Who are you?\r\nWhat can the position do for you?\r\nWhat can you do for us?\r\n\r\nStandard questions: "}, {"date": "10 Jan 2023", "title": "Radiologic Technologist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Apr 2020", "Interview Descriptions": "Odd questions you might see in an HR manual from 30 years ago, I don’t see how it had any relevance to todays working world. Interviewer too you and inexperienced", "Interview Questions": "Where do u see yourself in 5 years"}, {"date": "16 Mar 2020", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "I interviewed for the position of Research Analyst at the State Health Policy at Rutgers University. The interview comprised of mainly technical questions on my data analysis experience followed by a few behavioral questions. Basically, asked me about data sources I have worked with, research methodologies and data management experience. They asked me about my data management skills though I had mentioned none in my resume.", "Interview Questions": "How do you manage your data?"}, {"date": "9 Feb 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "The interview was about 30 minutes long. Most of the questions were experience-based, others were behavioral. I interviewed with two people and heard back the next week. Accepted offer.", "Interview Questions": "Do you have experience using any project management software?"}, {"date": "6 Feb 2020", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Rutgers University (New York, NY)", "Interview Descriptions": "I had applied for a position back in October and received an e-mail to schedule a phone interview in December. Hours after the phone interview, I sent a thank you e-mail. Weeks pass and I hear absolutely nothing back. I sent a follow-up e-mail in those three weeks asking the interviewer to at least let me know where we are in the process. There was still no reply. Almost 2 months pass and the only communication I receive is a no-reply generic e-mail (not from the person who interviewed me) basically stating that I did not get the position.\nIt's really an inconvenience to take the time out to thank the person who interviewed and to follow up only to receive no feedback at all. It exhibits apathy toward the candidate's time and it's very unfair.", "Interview Questions": "Tell us about a time you received constructive criticism from a manager and what did you do to correct the problem?"}], [{"date": "5 Jun 2022", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rutgers University (Newark, NJ) in Feb 2020", "Interview Descriptions": "There are at least two interview stages. Your first interview will most likely be an interview with a professor in the admissions committee. In the first interview, you will mainly be asked about your studies and your research interests. The second interview is mainly with the PhD program coordinator. The coordinator asks in-depth questions about why you should come to this school.", "Interview Questions": "Why this school, why this major, why you should come to this school"}, {"date": "19 Jan 2021", "title": "Course Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University (New Brunswick, NJ) in Feb 2020", "Interview Descriptions": "Rather informal, but I felt like the staff actually got to know me as opposed to just ticking off boxes. But we had open conversations about overall career goals and interest in helping students succeed in the various courses.", "Interview Questions": "What are some of your career goals?"}, {"date": "3 Aug 2020", "title": "Postdoctoral Fellow Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ) in Feb 2020", "Interview Descriptions": "It was overall good. Took in two steps. First one was over phone and last one was in person. Typically ask about my experiences, skills that matches with the job and my organizational ability.", "Interview Questions": "Tell me about your education and experience"}, {"date": "29 Jan 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ)", "Interview Descriptions": "Submit resume online, phone interview, and lastly in-person interview with researcher. They expect you to know your excel formulas and pivot tables right off the bat. Researcher was very nice and understanding about scheduling difficulties.", "Interview Questions": "Why do you think you're qualified for this job?"}, {"date": "21 Jan 2020", "title": "Graduate Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "THE INTERVIEW IS NOT VERY DIFFICULT. Usually the professor asks you the research question. and then ask you why you choose Rutgers. Will you join Rutgers if get the offer?", "Interview Questions": "Why you choose Rutgers. "}, {"date": "11 Jan 2020", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "Interview was casual and easy. Wear business casual. Polish your resume. They will go over each line in your resume. Be prepared to explain each in detail.  Have an example of how you worked together as a team.", "Interview Questions": "Explain a time where you worked as a team."}, {"date": "31 Jan 2020", "title": "Program Coor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rutgers University in Jan 2020", "Interview Descriptions": "Apply for position on website. It can take up to one month before you are called for an interview. Depending on the position, a hiring recruiter will call and schedule a phone interview or an in-person interview.", "Interview Questions": "What did you find interesting about this position and why did you apply?"}, {"date": "4 May 2023", "title": "IT Desktop Support Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Rutgers University in Jan 2020", "Interview Descriptions": "a Zoom meeting with several questions, and some talking to the existing employer, which is pretty good, but I have a time conflict with this position so I have to let g.", "Interview Questions": "What did you do after class"}, {"date": "30 Jul 2021", "title": "Student Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2020", "Interview Descriptions": "The interviewer will question your communication skills and ability to fundraise. It is a laid-back interview, just prepare well and do not stress. It is a very straightforward interview and they do not expect you to be the best fundraiser at the start.", "Interview Questions": "Do you have any experience with fundraising?"}, {"date": "7 Jun 2021", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2020", "Interview Descriptions": "Apply online and got admitted through email. Will have a meeting with the professor before the semester starts.  And also a conversation with the professor about how the class is going to be and any materials he/she wants to teach.", "Interview Questions": "Basic knowledge of the class you are going to assist with."}], [{"date": "21 Jan 2021", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University in Jan 2020", "Interview Descriptions": "Interview included 8-10 people asking various questions pertaining to their department (Greek Life, Facilities, Contract Management, Administration, Higher Education, etc.). Asked many questions pertaining to how the applicant would feel in situations that frequently arise on the job.", "Interview Questions": "How would you prioritize different tasks if they all have the same deadline? What would you do to stay organized?"}, {"date": "25 Sept 2020", "title": "Janitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University (Newark, NJ) in Jan 2020", "Interview Descriptions": "Answered ad. Got a call set up appointment. Sat with supervisor for 15 minutes. Wasn’t job for me so I turned the job Down. It was 10 hour shfits 6 days a week for 10 dollars per hour", "Interview Questions": "What is your work experience in this field "}, {"date": "19 Sept 2021", "title": "Procurement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2020", "Interview Descriptions": "Was told with 3 people on Phone interview ;series of questions were not in line w job description; wasn’t allowed to explain pertinent info related to experience; asked for certification when wasn’t apart of job requirements", "Interview Questions": "Mainly asked about project management background however job description didn’t identify this task "}, {"date": "15 Dec 2019", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "Common interview questions,\r\nAverage difficulties \r\nGood interview experience\r\nBehavioral questions \r\nMake sure you have questions to ask at the end\r\nFriendly staffs\r\nLong process as I expected \r\nDress well \r\nEye contact and smile \r\nThe above is my experience and I would like to see other people interview process as well", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "13 Dec 2019", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Basic interview covering past experience with lab equipment as well as past lab and thesis work. Asked a lot of specific questions about my past research as well as prompted me to talk heavily about my role in the past.", "Interview Questions": "Explain your role in x position. "}, {"date": "1 Dec 2019", "title": "Assistant Teaching Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (Newark, NJ)", "Interview Descriptions": "It was a very nice and formal online interview of around 25 minutes with two scholars, and no difficult or really complex questions were asked. I believe that I could have done way much better and provided other information and insights that, at the moment of the interview just didn't happen.", "Interview Questions": "Talk about your career trajectory."}, {"date": "16 Feb 2020", "title": "Property Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (Newark, NJ) in Dec 2019", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire.", "Interview Questions": "How will you improve "}, {"date": "10 Nov 2019", "title": "Laboratory Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Interviewed by a few different department supervisors, get a tour of the lab, each supervisor interview candidate separately, interview can take up to an hour.  Parking at Rutgers is a hassle, took forever to for them to call candidates back after applying and after interviews.", "Interview Questions": "How to you fit in a team environment"}, {"date": "18 Dec 2019", "title": "Unit Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rutgers University (Newark, NJ) in Nov 2019", "Interview Descriptions": "Applied online early October and received an interview about 4 weeks later. I scheduled a phone interview and it was really quick. And then scheduled for an in-person interview a couple days later. I thought the interview was successful, but never heard back. So I assume i didn't get the position.", "Interview Questions": "Tell us about yourself."}, {"date": "5 Dec 2019", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Nov 2019", "Interview Descriptions": "Very quick process! I had a quick 10 minute phone interview with the hiring manager. Within two days they called to ask me to come in for a panel interview. The panel was three people, the interview was very informal and very informational.", "Interview Questions": "Why are you leaving your current position?"}], [{"date": "28 Oct 2019", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "I did not have to interview as I was placed by recommendation of a professor. That said, interview experience totally depends on professor (some will not interview). Some professors will require you to go through an interview while others are looking for students and will take you on the fly.", "Interview Questions": "Do you have any projects you would like to explore?"}, {"date": "9 Oct 2019", "title": "Web Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University", "Interview Descriptions": "Was asked questions based on my resume. If there is a language that is listed on your resume, make sure you know how to explain it, they will def ask you about it. Also went through my various projects and work experience. Next, there were a couple of whiteboard questions I had to answer. Pretty standard stuff.", "Interview Questions": "Do you know any software development methodologies?"}, {"date": "12 Sept 2019", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Pretty straightforward, simple questions surrounding the role of the position, who I would be working with, what I would be doing on a daily basis, and also the qualifications of the positon", "Interview Questions": "Why do you want to do this?"}, {"date": "25 Jun 2021", "title": "Student Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Sept 2019", "Interview Descriptions": "The director was very friendly. She asked me about my previous experiences, my grades in my classes, and my availability to start. It was a quick interview. Be prepared to talk about any experiences you've had tutoring or teaching.", "Interview Questions": "Have you had any experience tutoring?"}, {"date": "26 Aug 2019", "title": "Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "The interview process started off well. They brought me in for 3 in-person interviews with members of various teams. The interviews were pretty standard. They asked me multiple questions about my past experience as well as things that I would be comfortable doing in this new role. Everyone I met was nice and the interview process was smooth. It seemed like a good place to work and I was excited to join the team. I received a phone call with a verbal offer the day after my last interview. This is where everything went downhill.\r\n\r\nThe salary they offered was low, so naturally I asked for a higher salary, to which they refused to even negotiate. I then said I would have to think about it. They told me that they would move on if I didn't get back to them within 2 weeks. I called my contact back 6 days later and again tried to negotiate for a higher salary, although this time I significantly lowered the salary I asked for. I also said that I would be accepting the offer regardless but I wanted to be sure the salary couldn't be slightly higher. He said he would speak to his boss about it. He called me back later that day to say that the 1 person who could approve a higher salary was out of the office for the week and that they would contact me when they were back in the office. \r\n\r\nAfter this call, one of my references called me to \"congratulate\" me on my new position. My reference said he wasn't sure if he should be congratulating me though because the person who reached out to him from Rutgers said that I wasn't going to accept the offer because the salary was too low. I thought it was extremely unprofessional that my contact would share private information like this with my references. I reached back out to my Rutgers contact who didn't pick up. I thought that was strange but I waited another week before contacting my contact again. He didn't pick up. He continued to dodge my phone calls and emails for almost 2 weeks before finally calling me again. He said that they went with another person because I had apparently waited too long to give them my decision. I said that I had accepted their offer less than a week after they gave it to me. He acknowledged that I had accepted the offer and said that me waiting plus asking for a higher salary played a part in them deciding to rescind my offer. I was kind of stunned that they kept me in the dark for so long to buy themselves times to find a replacement for me. \r\n\r\nLesson learned. If you're applying for a full-time position at Rutgers - the number at the lowest end of the band in the job posting is the salary you will be offered, don't try to negotiate with Rutgers whatsoever, and accept their first offer immediately or they will pull it from underneath you. What started out as a pleasant and relatively painless interview process quickly turned into a nightmare.", "Interview Questions": "How do you handle multiple deadlines?"}, {"date": "16 Aug 2019", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "45 Minute phone interview with a Junior Coordinator that would have reported to me had I been hired. Before the call, she asked me when I would be able to come in for an in-person interview as they were \"moving quickly\". We discussed a tentative date and she told me she would confirm by email if the date worked. It is now 4 weeks later and I have yet to hear from anyone even after sending a thank you email that they could have easily replied to if they decided to go in a different direction.", "Interview Questions": "Generic HR questions. "}, {"date": "9 Aug 2019", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ)", "Interview Descriptions": "Short, decisive, unimpressive.  Academics asks mostly boilerplate questions. Multistage interview process. 1/1 phone followed by campus visit including a panel interview which mostly included my presentation of credentials orally.  Rutgers did not require a drug test at that time.", "Interview Questions": "Long term commitment,"}, {"date": "8 Aug 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Highly based on academic interest. Not very extensive or intimidating. One of one interview with the professor and clear exchange of expectations made it a good experience. I was asked about my background and if I had any similar experience but that was not a strong factor in selection.", "Interview Questions": "Have you ever taught before?"}, {"date": "24 Sept 2019", "title": "Human Resources Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2019", "Interview Descriptions": "I applied on indeed and heard back from them in about two weeks (which is EXTREMELY quick for Rutgers) We scheduled a phone interview for the next day and overall, it was pretty standard. They asked simple questions about my work experience and what I was comfortable with.  Then that Monday, they contacted me for an in person interview with the manager for later that week. That interview had a lot more questions, but still, they were standard questions and inquiries about how you would handle certain situations. I felt comfortable with all the questions asked and didn’t feel like they were trying to trip me up. All in all, it was a solid and fair experience.", "Interview Questions": "What would you do if you did not get the job?"}, {"date": "17 Feb 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2019", "Interview Descriptions": "I was hired for Neilson Dining Hall in August 2019.  The interview was pretty relaxed, it was with the Student Unit Manager, who was a rising senior at the time. I applied one day and immediately got an interview the next. The requirements aren't that strict, just show that you're a decent, outgoing person and you'll get the job.", "Interview Questions": "Name one problem you were faced with, and how you solved it. This can be from past work, school, or life in general."}], [{"date": "18 Apr 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Rutgers University (Chicago, IL) in Aug 2019", "Interview Descriptions": "I had a great experience while I was interview by the Rutgers university. The interviewer is great, nice and kind. I got the job.   Now I work here around 2 years, all the co-worker are great and I believe we are doing a great job .", "Interview Questions": "Tell me about your experience. "}, {"date": "29 Jul 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Got a call from the PI. We spoke via Skype. I then spoke with other graduate assistants in the group about their experiences. At the time, I was unaware that this is how they recruit.", "Interview Questions": "What are the questions you are most interested in researching?"}, {"date": "30 Jan 2023", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University (Edison, NJ) in Jul 2019", "Interview Descriptions": "virtual, in person and final round and had a presentation on a topic that I am interested in discussing in relation to the position that i applied for at the moment", "Interview Questions": "What would your supervisor say about you?"}, {"date": "17 Jun 2019", "title": "IT Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Rutgers University", "Interview Descriptions": "Business casual- had a manager and current person in the role interview. Interview was about only 30 minutes and asked behavior and scenario questions. Honestly was very difficult and they asked direct questions. You have to know your stuff.", "Interview Questions": "What I know about outlook, Microsoft programs, Java"}, {"date": "17 Feb 2020", "title": "Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Jun 2019", "Interview Descriptions": "Emailed the researcher in charge of the lab to see if there were any open positions for the summer. Heard back within the week and scheduled a meeting. Was asked some questions about why I wanted to work in his lab, what experience I had how much time I could commit to working in the lab.", "Interview Questions": "Why are you interested in aerosols "}, {"date": "15 May 2019", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "I submitted my resume through the Rutgers hiring page and was contacted two weeks after. The initial interview is 1:1 in Newark, the second interview is 3:1 in Piscataway. Overall the process took about a month. No tricky interview or “what if” questions. If you meet the requirements, it’s a fairly simple interview.", "Interview Questions": "Tell me about your experience working with XYZ\nWhere do you see yourself in ten years?"}, {"date": "13 May 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University in May 2019", "Interview Descriptions": "The interview consisted of a video conference with about six panel members from the university.  They represented various departments of the institution and asked me questions based on their departments and how I could contribute to each one. The interview lasted about 30 minutes.", "Interview Questions": "What is one piece of advice you've been given and how did you respond to it?"}, {"date": "16 Sept 2019", "title": "Summer Maintenance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in May 2019", "Interview Descriptions": "Wasn't to difficult. Was more of a formality and explained what I'd be doing for the job. I essentially has the job already but they just wanted to meet me and get a feel for who I was and what I was about.", "Interview Questions": "How will your past experience help you in this job"}, {"date": "19 Dec 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Rutgers University (Newark, NJ) in May 2019", "Interview Descriptions": "I submitted my application and was contacted by email for an interview. The interviewee was friendly and culture seemed nice. I presented some of my work to the laboratory and some asked questions.", "Interview Questions": "Tell us more about your experience."}, {"date": "26 Oct 2019", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rutgers University (New Brunswick, NJ) in Apr 2019", "Interview Descriptions": "TLDR: Bad experience, disorganized HR. I applied online in April 2019 and had a phone interview in May. I’m a Canadian citizen, so during my interview I notified my interviewer of the (free, very easy) work authorization I would need, and followed up afterwards with a memo; I was assured that it wasn’t an issue. They offered me the job in June.  I accepted in July. At the end of July, shortly before I was supposed to start, I was informed that HR reinterpreted their policy on hiring Canadians and they were considering rescinding the offer. Several weeks passed, during which time my previous visa (which I’d calibrated to align with my scheduled Rutgers start date) ended and I had to leave the country. About a week after I was supposed to start work, they rescinded my offer. HR never apologized to me or accepted responsibility for their error. This was a serious personal, professional and financial setback for me.  Future applicants, I strongly suggest that you continue to apply for other positions, and do not retract your other applications,  even after you formally accept a job offer at Rutgers.", "Interview Questions": "Tell me about yourself"}], [{"date": "11 Feb 2020", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Apr 2019", "Interview Descriptions": "I cold emailed a bunch of professors and a few reached back to me. I eventually decided to pursue one whose research topic interested me and then he asked me to complete a few preliminary assignments before offering me the position.", "Interview Questions": "They asked a few questions about data structures and algorithms"}, {"date": "21 Mar 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "If they need workers, they'll hire you. They ask about your availability to see if it matches with what's needed. They also asked if you have relevant past experience to see if the skills you have are transferrable.", "Interview Questions": "When are you available?"}, {"date": "3 Jul 2020", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Rutgers University (Piscataway, NJ) in Feb 2019", "Interview Descriptions": "Great communication throughout the process. Three step in person interview process including two individual interviews and one panel interview. Once I accepted the offer, there was a process to go through including a background check and medical screening.", "Interview Questions": "What’s your experience doing this work in the healthcare field?"}, {"date": "3 Mar 2019", "title": "OIT Lab Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University in Feb 2019", "Interview Descriptions": "Unnecessarily hard interview for a rather unimportant part-time job. One of the supervisor was being a little harsh and intimidating. Timed skill tests on a computer where the supervisor would allow random number of minutes to solve a computer application related question. Googling was however allowed.", "Interview Questions": "to solve hypothetical computer application related questions"}, {"date": "8 Mar 2019", "title": "Laboratory Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rutgers University (Rutgers, NJ) in Feb 2019", "Interview Descriptions": "I applied and was contacted two months later for a phone interview. The phone interview was over an hour, at the end I was invited to come in for an in person. The in person took place the next week, I was told at the end of the week I received the position and was chosen. It took two weeks with interviews and waiting for the decision.", "Interview Questions": "What interests you about this job? Why do you love science?"}, {"date": "8 Jan 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Talent Acquisition recruited me - 2 phone interviews and one in-person interview. Was fairly easy - small department so I met with all colleagues. It took about 2 hours but the turn around was 2 days when I got the offer.", "Interview Questions": "Why Rutgers?"}, {"date": "26 Apr 2019", "title": "Senior Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University (Linden, NJ) in Jan 2019", "Interview Descriptions": "Applied on a Sunday night and received a call on Monday to schedule a phone interview. Had the phone interview and thought it went well. For some reason the application was on Indeed.com instead of the regular university job posting site. Was invited for an in person interview. Met some people in the office and completed an interview with the person who was leaving and who would train me. Was pleasant, gave me more insight on the job duties. Followed up with a thank you note right away and follow up email 3 weeks later. I was asked to be patient. No letter or email was sent saying the standard message of sorry you were not what we were looking for etc., just no communication months later and I saw a new posting posted for the same department in a part time capacity so maybe they didn’t have the funds to hire full time.", "Interview Questions": "Standard questions were asked that pertained to the job.\n\nTell me about yourself."}, {"date": "6 Oct 2020", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University in Jan 2019", "Interview Descriptions": "Two phases. One was a group interview, one was an individual interview.  The group interview looked for teamwork and leadership. The individual looked for problem solving skills, and how you deal with challenging scenarios.", "Interview Questions": "Generic interview questions, working together, facing challenges, knowledge of resources"}, {"date": "14 Nov 2019", "title": "Research Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Rutgers University (Piscataway, NJ) in Jan 2019", "Interview Descriptions": "Personal conversation and Skype call with both bosses with whom I was applying. We had a relaxed conversation and projected about what would be needed and how I would meet those needs.", "Interview Questions": "What were my relevant experiences."}, {"date": "13 Oct 2018", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "The interview is a single group interview. You are given tasks to do in groups and they rate you based on your interaction with the group. The groups are of about 5-6 people and there are a total of about 6 groups per session.", "Interview Questions": "Give constructive criticism to the person next to you in the group and they will give you constructive criticism as well."}], [{"date": "28 Mar 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Newark, NJ) in Oct 2018", "Interview Descriptions": "The interview was for a technical subject and hence technical. Coding questions comprised the majority of the interview and some theoretical questions too. I was also asked to demonstrate a project that I had done using the R-studio software.", "Interview Questions": "What are the projects that you have done using R-studio?"}, {"date": "27 Sept 2018", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ)", "Interview Descriptions": "Group Interviews with different group activities. Specific subjects and specific roles may have one to one interviews. Interviews are easy and test communication, listening and people's skills. Easy interview, group interviews not based on the subjects.", "Interview Questions": "With your group decide which is an important quality a learning assistant must possess?"}, {"date": "6 Sept 2018", "title": "Help Desk Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rutgers University", "Interview Descriptions": "The process is very easy for someone who is serious.  You are given a booklet to study over the summer and at the end of the summer your knowledge is tested through a test on the computer and if you pass you are hired.", "Interview Questions": "First interview asks why you want to do this job."}, {"date": "28 Jun 2022", "title": "Information Technology Consultant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Rutgers University (New Brunswick, NJ) in Sept 2018", "Interview Descriptions": "Mostly there to get a sense of who the applicant is as a person and whether or not they are good natured and willing to learn; having prior extensive technological experience is not required.", "Interview Questions": "Why would a keyboard not work?"}, {"date": "20 Aug 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Rutgers University", "Interview Descriptions": "Pretty calm, was not too hard. The managers were really cool and it was not a stressful environment. The interview was easy as there seems to be a lot of turnover in this place. I would interview here.", "Interview Questions": "What experience do you have?"}, {"date": "18 Jan 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2018", "Interview Descriptions": "It was very easy technical interview.. They wanted to hire someone who has previous experience in business and analytics as well as someone who had handled companies profile.  I had 5 years of experience in business management and analytics so it was very easier for me to crack the interview", "Interview Questions": "easy questions about  SQL, Tableau and python"}, {"date": "4 Oct 2021", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Rutgers University in Aug 2018", "Interview Descriptions": "The process was very straight forward and the interview team was great. I discussed with the manager the role over the phone and in person before completing a swim and lifeguarding test.", "Interview Questions": "N/A"}, {"date": "13 Apr 2021", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University in Aug 2018", "Interview Descriptions": "Fair interview, asked mostly situational questions. Asked to provide examples of leadership and marketing-related experience. Also asked why I was interested in the role and how I would be a good fit.", "Interview Questions": "Why are you interested in the role?"}, {"date": "18 May 2018", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Apr 2018", "Interview Descriptions": "Applied online, then passed a phone screen. Shortly afterward, I was invited to a face-to-face interview. Both phone screen and face-to-face interview took 1 hour each.  Staff was pleasant throughout the process and listened to my answers intently.", "Interview Questions": "Where do you want to be in the next five years?"}, {"date": "14 Nov 2018", "title": "Java Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Rutgers University in Apr 2018", "Interview Descriptions": "I was asked about what my goals were upon graduating college. What skills I could bring to the team. The interview felt very informal, as the department was rather small. Although I was never asked to perform a code challenge, I was asked the basics of how I would tackle problems with code.", "Interview Questions": "What classes would you be interested in taking before graduation?"}], [{"date": "21 Feb 2019", "title": "Secretary Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Newark, NJ) in Apr 2018", "Interview Descriptions": "The first interview was relatively smooth.  The 2 interviewers were very professional, yet made it very casual, I definitely felt at ease.  They clearly explained to me what the position was and what was expected in this new position created for a team of research members.   During my second interview, I first met with a doctor (the main person that the secretary would work closely with), and then the interview proceeded to a panel of 5 people  (the team members).  All team members seemed very pleasant.  However, it was a little intense and unexpected.", "Interview Questions": "What qualities do you have that you can bring to the team?"}, {"date": "14 Feb 2019", "title": "Peer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Rutgers University (Piscataway, NJ) in Mar 2018", "Interview Descriptions": "It is a group interview. People are getting together to talk about your idea about how to teaching international students. The advisors will observe your behaviors and value them.", "Interview Questions": "Do you have any recommendation for teaching international students?"}, {"date": "17 Aug 2022", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Mar 2018", "Interview Descriptions": "I met with about five professors from the department. In between interviews, I was back to a common room where I could talk to graduate students. I also went to a lab meeting.", "Interview Questions": "The first and foremost question is \"tell me about your research.\"  Follow-up questions depend on your specific research area. "}, {"date": "28 Mar 2018", "title": "Lecture Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Mar 2018", "Interview Descriptions": "The group interview is not to see if you are smart, but instead to see if you can cooperate. Just be polite and engage in the discussion and you will be fine.", "Interview Questions": "They ask a simple question that you and the group have to solve collaboratively."}, {"date": "16 Feb 2018", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "-Group interview, very easy. Just one interview in total. The overall process was just that they wanted to see if I had gotten at least a B+ in the class I was applying to be a learning assistant at first for.", "Interview Questions": "What was one time you worked effectively in a group?"}, {"date": "9 Feb 2018", "title": "Head Chef Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "The hiring process was good. Took 2 weeks, everyone i dealt with was nice and professional. This job is a difficult job to find and acquire. Once you get a job with rutgers you get great benifits.", "Interview Questions": "How do you make a PB&J"}, {"date": "30 May 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Rutgers University in Feb 2018", "Interview Descriptions": "submit the CV and cover letter. got E-mail back in 3 days with a positive response. set up the next interview, and one day visit and presentation and  got an offer at the end of the day", "Interview Questions": "background and technical skills"}, {"date": "7 Jan 2022", "title": "Orientation Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Rutgers University (Piscataway, NJ) in Feb 2018", "Interview Descriptions": "Group interview then a one on one interview. The group interview was a couple of activities that wanted to see how you would work in a group. As for the one-on-one interviews, these were primarily behavioral questions that just wanted to get to know you as a person.", "Interview Questions": "How would you design an article of clothing if you could choose anything?"}, {"date": "21 Sept 2020", "title": "Building Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Rutgers University (Jersey City, NJ) in Jan 2018", "Interview Descriptions": "Very calm and relaxing. When I walked in there was no fear. They welcome everyone with open arms and make the interview a lot less stressful. All the managers are nice and its a great work environment.", "Interview Questions": "Tell me about yourself and what is your major?"}, {"date": "13 Dec 2017", "title": "Learning Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Rutgers University", "Interview Descriptions": "The process was not long. First introduce yourself and watch two video to discuss in groups about what should a good teaching  assistant do when handling students' problems. Later discuss what it the perfect scenario for a LA. In the last, everyone shared advantages and constructive suggestions of their group members.", "Interview Questions": "Describe the perfect scenario for a Learning Assistant when solving students' problems"}], [{"date": "4 Nov 2019", "title": "Postdoctoral Fellow Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rutgers University (Orlando, FL) in Dec 2017", "Interview Descriptions": "Midyear in Orlando, FL - chaotic with hundreds of applicants applying to various positions. It feels a little like a zoo. There is a lot of energy. It is still enjoyable. Be yourself and enjoy the process.", "Interview Questions": "How many people in the US are frying a sunny side up egg at 6am in NY on a Saturday in July?"}, {"date": "23 Feb 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Rutgers University (Edison, NJ) in Dec 2017", "Interview Descriptions": "It was a casual interview. Most of the questions were about my background, what kind of courses i had taken and what my interests are. Also why I would like to work there.", "Interview Questions": "Why do you want to work for Rutgers University?"}, {"date": "30 Mar 2018", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Rutgers University (Rutgers, NJ) in Nov 2017", "Interview Descriptions": "They post up papers of hiring CITs each fall semester. Getting the call is competitive. Once you do, u meet with a couple of supervisors and go through several behavioral questions as well as some critical thinking and personality based questions.", "Interview Questions": "fire alarm went off but student has to finish his paper, how do you get him to leave the building?"}, {"date": "25 Oct 2017", "title": "Medical Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ)", "Interview Descriptions": "I applied for the position about a month and a half before receiving an email from the manager requesting me to go in for an interview the next week.  I met with her and she was extremely nice and explained the position in very great detail. She told me she would contact me by the end of the week to let me know if I was chosen for a second interview which I was.  I went to the second interview exactly a week later and was contacted the next morning stating I was the candidate they chose.  I received a call from HR stating they have an offer and they sent over paperwork for me to fill out.  Everything so far seems to be moving very quickly and I am very excited to begin this new chapter of my life.", "Interview Questions": "The one dreading question is why should we choose you out of all the candidates?  What makes you the best for this position?"}, {"date": "15 Oct 2017", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University (Newark, NJ)", "Interview Descriptions": "It was a very welcoming experience that allowed me to get familiar with the type of tasks and jobs I will be involved with.   The questions definitely allowed for me to answer based on my experience in a law enforcement setting.", "Interview Questions": "What are some weaknesses that you may have and what have you done to mitigate them? "}, {"date": "21 Apr 2021", "title": "Spanish Medical Interpreter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University (New Brunswick, NJ) in Oct 2017", "Interview Descriptions": "Super nice people! felt very comfortable talking about my experience. I was a bit nervous because it was when I recently had started my fall semester but they were great", "Interview Questions": "I was asked if I had any previous experience and why I thought I was fit for the position."}, {"date": "19 May 2021", "title": "Chandler Health Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ) in Oct 2017", "Interview Descriptions": "There were two separate interviews and the whole process took roughly 2.5 months. The first interview lasted nearly three hours and it was more the interviewer describing the job role to me and commenting on the past and future of the program as well as my past work experiences.", "Interview Questions": "How will your past experiences help you in this role?"}, {"date": "21 Sept 2017", "title": "User Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Newark, NJ)", "Interview Descriptions": "Panel of 3 interviewers.  Interviewers began by introducing themselves and telling their backgrounds.  Interview consisted of personality/situational questions and about 9 technical questions.  Mostly related to Cisco networking, routing & switching.", "Interview Questions": "What is the difference between a Static & dynamic IP addresses?"}, {"date": "13 Sept 2017", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "i applied online and, after a few months passed, was invited for an on-site interview. i was interviewed by a would-be coworker and manager at the same time.\r\n\r\ncoworker was polite but manager was pretty rude when he asked me questions. i didn't like his attitude at all. it was difficult to strike up any kind of conversation/\"get the ball rolling\" since the manager definitely did not want to be in that room with me.\r\n\r\nvery dissatisfied.", "Interview Questions": "why do you want to work here?"}, {"date": "6 Feb 2019", "title": "Graduate Student Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Rutgers University (Newark, NJ) in Sept 2017", "Interview Descriptions": "Most of the questions are either Job Specific or research oriented. There are about Three rounds with professors, May vary depending on the department. They may ask a case study on some of the on going research. Questions on prior experiences.", "Interview Questions": "They gave me a programming assignment and asked me to write code infant of them."}], [{"date": "11 Sept 2017", "title": "Campus Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2017", "Interview Descriptions": "A Two round interview process.  Phone interview for first round and in-person interview for second round.  No presentation needed during the second round of interview.  Met most of the mid-level and senior staff in department.", "Interview Questions": "Tell us about your experience and why you feel this is a good fit for your career\r\n"}, {"date": "28 Jul 2017", "title": "Graduate Student Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "Application was online. I was interviewed by phone with a professor in the department I was applying for. Also I was emailed by a few current students of the department to understand the culture and experience. Overall, pretty good experience. This is for a graduate program in Busch Campus.", "Interview Questions": "research interest"}, {"date": "1 Aug 2017", "title": "Business Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Rutgers University (Camden, NJ) in Jul 2017", "Interview Descriptions": "I applied online and about 3 weeks later I was emailed and asked for a phone interview, I had one the next day, then a week later I was asked to come on campus and interview with a panel. I was told I would have a decision by the next week. I then received an email asking to come to the department and meet with the other people in the department so they can go over the job and what it entails. I was told numerous times that I would be fine when I started and I would learn by hands on experience. I was under the assumption that I was getting the job the way they talked to me. I then met with the same person I was in contact with throughout the process and asked again which position I was interested in (the temp or perm one) and he informed me I should here within the next two days. A week and a half later I had to email him to find out I did not get the job and they never gave me a reason. Total waste of time.", "Interview Questions": "Why should we pick you over the other candidates?"}, {"date": "29 Jun 2017", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "It took 11 days after submitting my application to get a call back. I had a brief phone screening and then an in-person interview with 2 people the next day. It was a very easy interview given that I had previously worked with the department as an undergraduate student and was already familiar with the staff there. I'm sure this aided me significantly thus this may not be a fair or neutral review on the interview process for someone else coming in with no prior history with the staff, department, or school.", "Interview Questions": "What attracted you to this department/position?"}, {"date": "26 Jun 2017", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "After applying online I received an email to come on campus and interview for a position. The process was very laid back, very easy. Questions were basic interview questions. This position seemed to cater highly to recent graduates.", "Interview Questions": "What can you bring to the company?"}, {"date": "13 Nov 2017", "title": "Financial Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Rutgers University (New Brunswick, NJ) in Jun 2017", "Interview Descriptions": "Brief phone interview first then an in person interview with four people, 3 men 1 woman.  Everyone read their questions off the same Rutgers sample interview question sheet.  Even though there were four people I could tell who would ultimately decide on the candidate.", "Interview Questions": "Why are you applying for this position?"}, {"date": "16 Nov 2021", "title": "Summer Camp Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Rutgers University (New Brunswick, NJ) in Jun 2017", "Interview Descriptions": "It's pretty simple. You go in and they literally give you scenarios and problems and ask for times when you were faced with them and how you overcame them. If you answer genuinely of any obstacles you overcame you'll be alright.", "Interview Questions": "Tell us about one time when you were faced with a very difficult situation that presented roadblocks and how did you end up overcoming them?"}, {"date": "1 May 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "I submit a bunch of applications online, and the committee reviewed and then decided quickly to hire me. The result comes pretty surprisingly, because there is no more interview in between, like Duke that did a phone interview.", "Interview Questions": "typical application"}, {"date": "8 Aug 2017", "title": "Research and Development Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University (Piscataway, NJ) in May 2017", "Interview Descriptions": "well it was great but not too great because it had several issues within the process. The HR were not to happy when I saw them because it was in the summer but thankfully I got though the interview.", "Interview Questions": "Tell me the time about your leadership position in the club?"}, {"date": "16 Apr 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in Apr 2017", "Interview Descriptions": "interview process was not difficult, just required to show you can perform the task well and will on time and dedicated to work. they don't ask too many questions", "Interview Questions": "have you worked at one of our other locations "}], [{"date": "21 Mar 2017", "title": "Security Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "situational questions, behavioral questions, General questions about yourself and what makes you different from other candidates. practice asking yourself questions to prepare so that you will be ready to answer whatever they throw at you", "Interview Questions": "What are your strongest and weakest attributes?"}, {"date": "21 May 2017", "title": "Dean's Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University (Piscataway, NJ) in Mar 2017", "Interview Descriptions": "Very casual, conversational, while maintaining a professional attitude.  The interview did not take as long as I thought... I was in and out in under 15 minutes.  Dressed business casual.", "Interview Questions": "Tell me about yourself and your experiences.  "}, {"date": "4 Oct 2017", "title": "Lead Peer Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Mar 2017", "Interview Descriptions": "Interview wasn't hard. I had two interviewers for my position. They were very friendly and welcoming.  Most of the questions were about my experiences that I listed on the resume and my previous on campus jobs/involvement", "Interview Questions": "What do you think might be struggle for you in this job?\r\n"}, {"date": "13 Jul 2017", "title": "Estimator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Piscataway, NJ) in Mar 2017", "Interview Descriptions": "Both interviews seemed to go very well.  Oddly though, the second interview was 6 weeks after the first interview.  In the second interview, I was told that in addition to estimation duties, I would need to be a change agent for the highly dysfunctional facilities department.  I made a good case for my being able to do that gracefully.  \r\nI was told I would be contacted by phone, by one of the interviewers \"early next week\"\r\n10 days later I phoned the only guy I'd interviewed with twice.  I was very uncomfortable about my phoning him.  (But was never given an HR contact....)  I was told I'd learn \"soon\".\r\nTwo weeks later I call the VP, with whom I'd interviewed.  She yelled at me saying that it was \"highly inappropriate\" that I contacted her.  I ended the phone call calmly.  Two months later I received a form-letter email from HR saying they'd chosen another candidate.  Rather anticlimactic at that point.  Why even bother?", "Interview Questions": "They administer a test - to have you estimate a job from LF, SF, Man-hours, etc.  It's not hard but the spreadsheet is not well laid out.  I also wondered if asbestos removal (which wasn't costed out, but was mentioned) was something of a trick question"}, {"date": "22 Feb 2017", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Rutgers University", "Interview Descriptions": "Called in for group interview where several general team questions asked. Given a scenario describe what you would do. Be able to give criticism to peers. Interview process was around 30 mins to 1 hour.", "Interview Questions": "Give constructive criticism of a peer in your group"}, {"date": "9 Feb 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "I applied online from India. In the mathematics department they admit students every alternate year (at Rutgers-Newark). They did not apply any graduate students the year I applied, so they kept my application for consideration during the next academic year.", "Interview Questions": "N/A"}, {"date": "2 Feb 2017", "title": "CSO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "You sit in front of a panel of three people who take turns asking you questions.  It's mostly behavioral and situational questions.  You should come with resumes and in business formal attire, so a suit and tie for example.  Personally, I didn't find the interview tough, but I have heard from many other employees and potential employees that they did find it tough.", "Interview Questions": "What are your strengths and weaknesses?  Why do you want to be a CSO?  \"What would you do if....\" questions."}, {"date": "13 Feb 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in Feb 2017", "Interview Descriptions": "I applied for this position online, and a few days after the posting closed , I was invited for an interview by phone. I attended the in person interview about a week after the phone call. The interview (with two people) lasted about an hour. I was informed that there was another tier of interviews to follow so I'm currently waiting for a call back.", "Interview Questions": "We discussed the duties of my last (current) job at length."}, {"date": "8 Mar 2017", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Rutgers University in Feb 2017", "Interview Descriptions": "On January, I applied online, and waited for two weeks for the interview invitation. It was an in-person interview and the whole interview last for half hour. The interview went well, and the hiring person was nice and helpful.", "Interview Questions": "What do you know about development"}, {"date": "6 Apr 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University (New Brunswick, NJ) in Feb 2017", "Interview Descriptions": "Phone screen, in-person interview for a group, final interview with two Supervisors. It was fine until after the last interview when I was sent extremely mixed messages by hiring manager who at first wanted to meet again but then after not responding to my email decided to finally reply back and say they had moved on. Very unprofessional.", "Interview Questions": "How would you handle an under performing employee?"}], [{"date": "21 Mar 2017", "title": "Software Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Rutgers University (New Brunswick, NJ) in Feb 2017", "Interview Descriptions": "It was simple phone screening and then F2F at their location. There were very logical questions. they mainly test your logic.They give you scenario and ask you questions on the basis of that", "Interview Questions": "what is inheritence"}, {"date": "12 Mar 2018", "title": "PC Technician Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rutgers University (Newark, NJ) in Jan 2017", "Interview Descriptions": "i applied online, the process took 2 months. then i was called for an interview. when i arrived the manager asked most common questions like any interview. then i was hired after a month", "Interview Questions": "questions about previous experience"}, {"date": "1 May 2021", "title": "Head Bottle Washer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Cave in Rock, IL) in Jan 2017", "Interview Descriptions": "It was good it was nice it was fair they were not mean they were nice to me I liked interview very much. Very good nice place. I like it", "Interview Questions": "Do you like turtles or zombies"}, {"date": "21 Apr 2017", "title": "Global Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2017", "Interview Descriptions": "Well one you have had to study abroad at least a year, a semester, or during one of the breaks. Once you have done that than you will be asked during your semester or week overseas if you would like to partake in the Global Ambassador.", "Interview Questions": "what did study abroad do for you, and do you feel a change ?"}, {"date": "16 May 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2017", "Interview Descriptions": "One in person interview followed by an online writing test. A few back and forth emails with hiring manager and another school administrator.  Good overall interview experience as a whole", "Interview Questions": "What do you hope to accomplish from this experience"}, {"date": "11 Dec 2017", "title": "IT Tech Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (Newark, NJ) in Jan 2017", "Interview Descriptions": "you can apply online thru their website and HR will contact you if you're qualified. then normally it will be a phone interview, then you wait. the manager will give you a call to interview you. it was just basic questions and not sure if they were really looking to hire or just fulfill a quota", "Interview Questions": "how do you describe yourself as an employee"}, {"date": "4 Sept 2021", "title": "Secretary of Graduate Student Association Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2017", "Interview Descriptions": "There was a polling system where a candidate had to get votes from peers to be appointed for the position. Once a candidate was selected, an interview with the previous committee was conducted to chose the right candidate", "Interview Questions": "Why do you want the position?\r\nWhat would you bring to the team?"}, {"date": "28 Dec 2016", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University", "Interview Descriptions": "The interview process is quite standard for higher education. You have a panel of people  Dean, HR, coordinator, faculty member, and someone who works in career services. They are looking for someone who is a fit and someone who knows how to facilitate student success more than anything.  However, competition in this field is exteremely high. If you do not stand out someone will get the job over you.", "Interview Questions": "Greatest accomplishments "}, {"date": "12 Nov 2016", "title": "Habilitation Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University (Piscataway, NJ)", "Interview Descriptions": "First you get a call and then they set up a interview. But 20 people interviewing for one position. The lady was really nice. Interview took about 30 minutes. You meet wity one person. They explsin the position to you. They let you kno that the hiring processs takes about 3 months", "Interview Questions": "They gave you a scenario abiut working with clients in the field."}, {"date": "13 Sept 2017", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Rutgers University in Nov 2016", "Interview Descriptions": "I was referred by the employee there and then discussed with the department chair about some more personal information about myself, mainly about the academic background. Then he made the decision.", "Interview Questions": "When will you get your Ph.D. degree?"}], [{"date": "12 May 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in Nov 2016", "Interview Descriptions": "I spoke to a professor of mine during the school year outside of class and requested an RA position. She asked to see several writing samples. transcripts, along with other documents and I eventually got the position.", "Interview Questions": "why do you want to work here?"}, {"date": "5 Oct 2016", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ)", "Interview Descriptions": "First, you need to submit application along with your resume, and then they will ask you to go to one of the information sessions if you are selected. At the end of information session, you need to sign up the one-to-one interview, and then do the interview, after a few days, the program coordinator will email you if you are selected or not.", "Interview Questions": "Tell me about yourself"}, {"date": "5 Oct 2016", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Rutgers University", "Interview Descriptions": "I emailed the director of the center, received a reply to set up a phone interview. Easy phone interview and received a response within 4 weeks that I got the job.", "Interview Questions": "few technical skills and a lot of behavior questions."}, {"date": "23 Mar 2019", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Sept 2016", "Interview Descriptions": "Quick responses and everything was coordinated efficiently, there was email communication with the agenda and I received phone calls quickly. Met with the manager first then the nurses and doctors on separate days .", "Interview Questions": "Why interested in this field"}, {"date": "22 Feb 2018", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (Piscataway, NJ) in Sept 2016", "Interview Descriptions": "The interview is done in a group of 6 people. There are some group activities you have to complete. Older Learning assistant will observe you while you completing these task.", "Interview Questions": "how would you plan a lesson for students?"}, {"date": "10 Oct 2016", "title": "Graduate Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Rutgers University in Sept 2016", "Interview Descriptions": "Did a data analysis problem about survival analysis. Interviewed about those questions:\r\n1. Briefly explain the reason why we do survival analysis\r\n2.Why do we use Weibull distribution rather than Exponential distribution\r\n3. How to select 4 important variables from 20 variables\r\n4. How to solve overfitting problem", "Interview Questions": "Describe the usage of survival analysis."}, {"date": "26 Nov 2019", "title": "Student Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Rutgers University (Camden, NJ) in Sept 2016", "Interview Descriptions": "Apply online, it usually takes 3-7 business days for them to reply. If you are qualified then they will call or email you about the days in which you are available to schedule for an in-person interview.", "Interview Questions": "Why do you want to work for Student Accounting and Cashiering?"}, {"date": "2 Apr 2018", "title": "Senior Care Coordination Speciaist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University (Newark, NJ) in Sept 2016", "Interview Descriptions": "Hiring manager contacted me via telephone to set up an interview. i interviewed in person for about 1 hour. hr followed up with 3 references for background check. there was delay in reaching all references. i was offered the position about a month after the interview. there was limited space for salary negotiation. once you are hired with rutgers, it is very unlikely to receive significant raises. as a result, you must push for a high salary up front.", "Interview Questions": "tell us about a difficult experience with a coworker"}, {"date": "8 Sept 2016", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2016", "Interview Descriptions": "The interview consisted of an in-person meet up with the Human Resource Manager after she reviewed my online application. After deeming me fit for the next round, she scheduled another meeting with the department chair. The second interview was pretty informal and more about giving me a sense of my duties.", "Interview Questions": "Why I was interested in the position and if I would consider transitioning into a more permanent position?"}, {"date": "20 Jul 2016", "title": "Tester Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Rutgers University (Jersey City, NJ)", "Interview Descriptions": "Interview went very well and was very nice people.  We spoke of the knowledge trends over the pas few years and disc. possibility of the future.  I have already given all info I know now.", "Interview Questions": "N/A"}], [{"date": "13 Jul 2016", "title": "Boiler Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Rutgers University (Newark, NJ)", "Interview Descriptions": "question answer filling out papers going though the process of telling about my self what are my goals what do i have to offer the company as to my work and loyalty to my fellow workers", "Interview Questions": "how did i found about the job"}, {"date": "6 Jul 2016", "title": "Phone Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Rutgers University", "Interview Descriptions": "I met with the program manager and some scenarios were presented to me that callers might speak about and I had to describe how I would handle them. We did a little role-playing with mock conversations, and afterward we discussed my answers (what I said that was good and what I said that might have been improved).", "Interview Questions": "About my experience, but mostly about the scenarios as i mentioned."}, {"date": "6 Jul 2020", "title": "Freelance Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Jun 2016", "Interview Descriptions": "A phone call was how I was interviewed.  A few questions were asked about the services I could offer and my availably for quick turnarounds. They were interested in mostly print work.", "Interview Questions": "What experience do you have specifically with print graphic design?"}, {"date": "20 Jul 2018", "title": "PTL Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in Jun 2016", "Interview Descriptions": "This job looks for presentation skills. So, in your resume while you apply make sure you highlight them instead of just your knowledge about Software Engineer. Give presentation skills in your resume and apply them in interview.", "Interview Questions": "N/A"}, {"date": "6 Oct 2017", "title": "Part-Time Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Rutgers University (Newark, NJ) in Jun 2016", "Interview Descriptions": "They asked me questions, asked to see me demonstrate my teaching, and wanted a curriculum vitae.  They wanted to know the comprehensive nature of my knowledge, professional experience, activites, publications.", "Interview Questions": "Describe your teaching philosophy?"}, {"date": "21 Jun 2016", "title": "Financial Aid Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Camden, NJ) in May 2016", "Interview Descriptions": "It was a 30 minute interview. The question were simple and they were straight forward about job requirements. The staff was really nice. I went through two rounds of interview. The second one was with the Director. She didn't seem as prepared for the interview.", "Interview Questions": "What are your 5 year and 10 year goals?\r\nWhat is the most difficult situation you've experienced in this position?"}, {"date": "19 Apr 2016", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Apr 2016", "Interview Descriptions": "Overview of overall research process being conducted. Standard back and forth interviewing process. Depending on the field and position,previous knowledge will be required. They provide on the job training. Looking for overall, independent, competent individuals.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "29 Mar 2016", "title": "Head Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Newark, NJ) in Mar 2016", "Interview Descriptions": "2 people interviewed me (a man and a woman) and they asked me 1) my strengths 2) my weaknesses and how I deal with them 3) why I want to work for Rutgers 4) why should they hire me (what makes me the best candidate 5) computer skills\r\n\r\nThey told me it would take 3 weeks to go through human resources. Then they gave me their business cards. Today makes it exactly 3 weeks and no word yet but I'm still hopeful I will receive good news this week.\r\n\r\nThis interview was like your average interview except with two people. I thought it was going to be more of a people approach job but after the interview I realized its more of an IT tech job. But I'm up for the challenge.", "Interview Questions": "1) my strengths 2) my weaknesses and how I deal with them 3) why I want to work for Rutgers 4) why should they hire me (what makes me the best candidate 5) computer skills"}, {"date": "11 Apr 2016", "title": "Computer Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Mar 2016", "Interview Descriptions": "The interview process was longer than I anticipated but they tested a variety of fields. They asked personality and situational questions along with tech questions where you actually had to demonstrate your knowledge of technology. This included determining log-on issues all the way to dealing with excel, word, and powerpoint. There was also some work with photoshop and saving files in some manner.", "Interview Questions": "What would you do if you found a random brick laying around the building?"}, {"date": "25 Oct 2016", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Mar 2016", "Interview Descriptions": "It was a great experience, they asked technical questions and it all worked out in the end. They really helped me grow as a person, both in the CS Industry and in my academic career.", "Interview Questions": "What is your name?"}], [{"date": "30 Apr 2016", "title": "Media Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Mar 2016", "Interview Descriptions": "I met with three members from the department and mostly learned more about the position. They were very friendly, but they were clearly looking for someone with specific technical qualifications I do not possess.", "Interview Questions": "How would you handle an unhappy client?"}, {"date": "24 May 2016", "title": "Health Care Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Rutgers University (Newark, NJ) in Mar 2016", "Interview Descriptions": "Panel interview of three people - the nurse manager, social worker, and nurse practitioner. The interview lasted approximately one hour. As a current Rutgers employee, I was advised upon arrival that this was just a \"formality\". The mood was light and the conversation easy. Due to the similarity of in work history and the position for which I was interviewing, the questions were limited. The panel spent most of the time discussing their program and the job role.", "Interview Questions": "Why do you want to step down from a leadership position into a staff nurse position?"}, {"date": "19 Oct 2017", "title": "Resident Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at Rutgers University (Piscataway, NJ) in Feb 2016", "Interview Descriptions": "Application is available via the school's sakai site.  There is a group interview and then two subsequent individual interviews.  Overall, its the first two that are most important.", "Interview Questions": "How do you handle conflict?"}, {"date": "29 Dec 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Feb 2016", "Interview Descriptions": "Not much of a interview, it had pretty generic questions. These questions were pretty standard to all interviews that are conducted at the university, I believe.  Room was non-intimidating, and it was a pretty lax interview.", "Interview Questions": "Name a strength and weakness. "}, {"date": "6 Oct 2017", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Rutgers University (Piscataway, NJ) in Jan 2016", "Interview Descriptions": "It was very casual. You'll want to dress casually, or wear a suit if that's your style, although business casual is more well-received.  They ask questions aimed around figuring out what kind of person you are, your technical skill, knowledge, and previous experience working with computers. Demonstrate your worth and they'll scoop you up.", "Interview Questions": "What would you do if you were alone on shift and a fire alarm went off?"}, {"date": "30 May 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2016", "Interview Descriptions": "it was brief. Once you go in, you know you are hired because you go in because you are accepted from a bunch of people. It is definitely hard to get into. You have to have connections to get in.", "Interview Questions": "Why you need job?"}, {"date": "28 Jan 2018", "title": "Dining Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2016", "Interview Descriptions": "Quick process that lasted about 3 weeks. Applied online and received a call within a few days. Met with two hiring managers for a 30 minute interview. Simple questions about myself and relating to previous work stated on my resume.  They just want to make sure you're willing to learn and work as a team with others. Questions relating to situational problems and what you would do.", "Interview Questions": "What would you do if a customer persistently wants to take food home when we have a clear no food outside the venue policy"}, {"date": "10 Jul 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Rutgers University (Newark, NJ) in Jan 2016", "Interview Descriptions": "I received a call and was asked why I am interested in becoming a Ph.D. I was also asked about my math and coding skills. The professor also asks me if I am interested in the accounting area.", "Interview Questions": "Do you want to be in the academic area when you graduate"}, {"date": "25 Mar 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (Newark, NJ) in Jan 2016", "Interview Descriptions": "We met in her office and had a quick excel test. We then talked about my past experiences and how long i would be in school for. Then we discussed how much I knew about the nursing school and the program.", "Interview Questions": "What roals in managmnt have you had"}, {"date": "2 Apr 2016", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2016", "Interview Descriptions": "Meet with management of department he or she explain about the position and I give them my duties of my passed employment responsibilities.  If we both have any question about the position to get a better understanding about the position we continue.  But, if there question and conversation is ended.  The response from management you will hear back by the end of the week.", "Interview Questions": "How comfortable are you working with people?"}], [{"date": "2 Dec 2015", "title": "Human Resources Staff Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rutgers University (New Brunswick, NJ)", "Interview Descriptions": "Was called by interviewer to come in and meet with a manager. There was a total of two interviews before I was selected for the position. I met with different people each time I was interviewed. Everyone was very nice and personable. I was called with an offer within a week of my second interview.", "Interview Questions": "How would you assist an employee who came in with a question but was not clear in their directions?"}, {"date": "29 Jan 2017", "title": "Child and Adolescent Psychiatry Fellow Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Rutgers University (Newark, NJ) in Dec 2015", "Interview Descriptions": "The program director who interviewed me was great but unfortunately he is leaving by the end of June and no enough staff to run the program. No enough attendings and no structured didactics. The University cut our salaries and CIR is fighting back.", "Interview Questions": "No challenging questions "}, {"date": "24 Mar 2017", "title": "RTS I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Rutgers University (Newark, NJ) in Nov 2015", "Interview Descriptions": "Most of the times, preference is given to internal candidates. Once you apply for the open position on the website, the resumes are shortlisted. At least 5 candidates are interviewed and the top selected 1 or 2 are contacted by HR for salary updates and background check. once approved you undergo general health and TB test and are hired once clearance is obtained", "Interview Questions": "they ask about the skills and the number of hours you can work.\r\nAlso about salary expectations"}, {"date": "27 Oct 2015", "title": "Professional Student Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University", "Interview Descriptions": "They call you and you get interviewed on the phone.  You wait about a week and then they call you again to tell you if you got the job.", "Interview Questions": "Tell me about a time you solved a problem at your previous job."}, {"date": "17 Jun 2016", "title": "Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Oct 2015", "Interview Descriptions": "The woman who interviewed me asked basic questions about myself and why I was interested in working for an educational institution that is Rutgers University. Then she asked me where I saw myself in the team and how I could contribute my skills to their projects.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "13 Sept 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University", "Interview Descriptions": "Basic questions about prior research experience, type of research, papers published. Also questions about type of research you are interested in and why you want to work in that research group", "Interview Questions": "What type of research did you work on?"}, {"date": "16 Nov 2015", "title": "Helpdesk Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Sept 2015", "Interview Descriptions": "It started via email, getting basic information than you set up an interview that lasts about 15-30 minutes. The questions are a lot about your work ethics and how hard of a worker you are. A lot of the technical stuff is taught on site so these questions really focus on how well you would work with the team.", "Interview Questions": "One thing they asked me was my history and where I worked."}, {"date": "4 Aug 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University in Aug 2015", "Interview Descriptions": "Received an email requesting phone interview at first, lasted about 20 minutes with 3 people asking standard interview questions. A few days later I was sent an email again, this time for an in-person interview. I was sent very detailed directions as well as an interview itinerary. Interview lasted about 3.5 hours, panel interview, everyone had a list of questions. Two days later I was informed that I was moving on in the interview process and they requested references. Two days later got a call with the offer.", "Interview Questions": "Why did you choose Rutgers? What attracted you to this position? What skills do you have?"}, {"date": "26 Aug 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Interview Process was moderate. Importance was given on depth of knowledge about the subject and future aims. The interview process mainly consists of a telephonic interview, followed by a power point presentation of the major focus area, followed by specific questions on career goals and aims", "Interview Questions": "Future aims within the next five years"}, {"date": "13 Aug 2015", "title": "Administrative Assistant (Part Time) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Rutgers University (Piscataway, NJ) in Aug 2015", "Interview Descriptions": "Applied online and got a call back the following day to schedule a meeting the day after. Very fast process. Met with 2 people who asked questions from a sheet of paper but nothing difficult. Laid back, very friendly. I think my mistake was letting them know that I wasn't hoping to build a career there or in that field - though I thought it was understood seeing as it was only a part time position and my resume had no indication of pursuing a career in that department.", "Interview Questions": "What can you do to create a good work environment? Why this position? How do you juggle and prioritize tasks? What's one thing that we didn't ask you that you were expecting us to and how would you answer it? Tell us about a time you dealt with a difficult client and how did you handle it? Tell us about a time you received horrible customer service and how would you have handled it differently."}], [{"date": "17 Nov 2016", "title": "NCS Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University (Newark, NJ) in Aug 2015", "Interview Descriptions": "It was about an hour, and a very laid back group interview. There was a quiz beforehand for around 20 minutes. 3 supervisors were there and they asked about prior experience with an emphasis on customer service (asked us how our previous experiences would relate to the new job)", "Interview Questions": "Questions specific to Mac and  Windows systems. Asked which wires correlate which use."}, {"date": "20 Nov 2018", "title": "Rutgers Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2015", "Interview Descriptions": "Fairly straightforward. I, as well as another candidate, was interviewed by two assistant coordinators and a head guard. They asked us what saving techniques were appropriate for certain situations, what are the responsibilities of a lifeguard, and gave us scenarios and asked us how to deal with them.", "Interview Questions": "What/who are high risk swimmers?"}, {"date": "29 Jul 2015", "title": "Program Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University", "Interview Descriptions": "The interview process was quite straightforward.  I was called for an interview less than a week after I applied for the position and was offered the position about 10 days after the interview.", "Interview Questions": "Why would someone with a research background be better suited for this position than someone with a clinical background?"}, {"date": "21 Jul 2015", "title": "Gardening Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Rutgers University", "Interview Descriptions": "I think if i remember correctly they maybe asked me the very very basic questions about my previous expect nicest in different kind of jobs and different kinds of different em ployments and other stuff related to that past  stuff it was all very easy and  all everyone was actually very very  nice  ok", "Interview Questions": "What was your last job like"}, {"date": "5 Jul 2015", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ)", "Interview Descriptions": "It was relaxed. Submit CV and letter to chair.  Arrange meeting.  See if there's match. Negotiate there after.  Could spend more time negotiating after.  Can come back for a second look.  Can ask colleagues to speak after hours.", "Interview Questions": "What's your vision for here."}, {"date": "27 Jun 2015", "title": "Research Teaching Specialist IV Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Rutgers University (Newark, NJ)", "Interview Descriptions": "I was interviewed by several Principal investigators and they all asked me questions. I was also first interviewed by the research director as well. Each PI took turns asking me questions about prior work experiences, academic experiences and education based questions. I was asked why I would like to work there. What's experiences make me suitable for the job.", "Interview Questions": "They asked me about the projects I have worked on and what it entailed"}, {"date": "22 Jun 2015", "title": "Summer Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Talk with a professor, Ask for a research project during the semester\r\n\r\nMost graduations apply with recommendations from a professor at Rutgers, in the ECE department\r\n\r\nMostly behavioral questions, however, GPA does matters\r\n\r\nTry to take many courses early on, You are generally competing with other Rutgers ECE students\r\n\r\nTalk with a professor, Ask for a research project during the semester\r\n\r\nMost graduations apply with recommendations from a professor at Rutgers, in the ECE department\r\n\r\nMostly behavioral questions, however, GPA does matters\r\n\r\nTry to take many courses early on, You are generally competing with other Rutgers ECE students", "Interview Questions": "What previous research experience do you have?"}, {"date": "17 Jun 2015", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University (Piscataway, NJ)", "Interview Descriptions": "Had a ten minute interview with one of the Dean's assistant. When it came time to interview with the dean, 5 minutes into our interview, an HR rep was called in to clarify NJ state labor laws for about 10 minutes after which I was given an addition 3 minutes for my last words of the interview.", "Interview Questions": "What's the difference between a salaried and an hourly worker?"}, {"date": "31 Dec 2015", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Rutgers University (Newark, NJ) in Jun 2015", "Interview Descriptions": "Took 4 weeks to get a call, took another 2 weeks for phone interview - too long.  The phone interview was basic and related to my experiences and my resume.  I came with specific questions about working within Rutgers.  It would have been better to have a conversation with benefits/hr first to address these questions.  I ended up sending an email to hiring manager who forwarded onward.", "Interview Questions": "nothing out of ordinary - shocking not too much focus about working with students!"}, {"date": "12 Nov 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ) in Jun 2015", "Interview Descriptions": "Application- email or phone call for interview - get interviewed at the location or by phone - behavioral questions- was later sent samples of work to analyze and return to view work capability- was later offered.", "Interview Questions": "Difficult situation"}], [{"date": "30 Aug 2018", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (Newark, NJ) in Jun 2015", "Interview Descriptions": "One hour seminar and half an hour meeting with the hiring manager. I also met with the group for one hour while lunch. Expenses were paid by Rutgers. Easy and straightforward interview.", "Interview Questions": "What is your experience in program management?"}, {"date": "14 Apr 2016", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Rutgers University (New Brunswick, NJ) in Jun 2015", "Interview Descriptions": "Interviewed with Graduate Student in order to enter a research position for the summer. One interview which was given at 7:30 am and had to find a ride myself there since the buses do not run that early in the morning. Was given the opportunity the next day.", "Interview Questions": "Take any piece of item around the room and tell me 20 things that you can do with it."}, {"date": "23 Feb 2016", "title": "Writer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (East Brunswick, NJ) in Jun 2015", "Interview Descriptions": "We first had an over the phone interview and then an in person interview. Very professional. Very well done. Very genial professionals to deal with. Great organization. The Human Resources Department really works hard and is very communicative. They prepare you well and schedule everything accordingly.", "Interview Questions": "We talked about my background and the fit into higher education. We talked about Rutgers' reputation. i was asked to summarize my background."}, {"date": "14 May 2015", "title": "IT Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Rutgers University (Jersey City, NJ)", "Interview Descriptions": "Panel type interview.  The questions were both technical and interpersonal- good balance. I thought the job requirements were explained thoroughly.  Process took about one and a half hour with a technical test at the end. You will be interviewing with the team members.", "Interview Questions": "What prompted you to seek employment at Rutgers?"}, {"date": "23 May 2015", "title": "Secretary Math Department Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University in May 2015", "Interview Descriptions": "Applied online and a couple days later received a phone call for setting up an interview. Only gave you one day and a small amount of time slots available. Made me assume they already had someone in mind.", "Interview Questions": "Are you able to work with multiple personalities and their scheduling needs?"}, {"date": "5 Feb 2016", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rutgers University (Piscataway, NJ) in May 2015", "Interview Descriptions": "I applied online through the website as a student of Rutgers University. I received an email about an in person interview and was selected by project mentor. Discussed about resume and past experiences dealing with research. It was not that hard due to the direct needs I met with the current research project.", "Interview Questions": "How do your past experiences meet the needs of our current project?"}, {"date": "25 Jun 2016", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Rutgers University (Piscataway, NJ) in May 2015", "Interview Descriptions": "not many questions were asked, just the position was described and my interests were asked. i was referred by an employee, so i was almost directly recruited. Overall the interview was not so important", "Interview Questions": "what is my specific interest"}, {"date": "24 Feb 2016", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Rutgers University (New Brunswick, NJ) in Apr 2015", "Interview Descriptions": "I submitted my cv, and just took one phone interview, and was hired. There was no technical question but simple question like when did you graduate, can you manage big class. I guess it is because the position was to teach undergraduate courses.", "Interview Questions": "When did you graduate? When did you obtain your degree?"}, {"date": "27 Sept 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Rutgers University (Piscataway, NJ) in Apr 2015", "Interview Descriptions": "I was asked to explain my experience on my resume, and tell the interviewer what I knew about the project the research group worked on. In addition to this, I was escorted around the facility, to show me the laboratories and their functions.", "Interview Questions": "Describe your experience in the laboratory."}, {"date": "1 Mar 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rutgers University (Piscataway, NJ) in Apr 2015", "Interview Descriptions": "First I was contacted for a phone interview. This was a general discussion of what the job tasks were. I was then scheduled for an in-person interview. This started with a panel and then one-on-one with the program director. I was hired at the end of this process.", "Interview Questions": "What experience do you have in data analysis?"}], [{"date": "14 Jun 2017", "title": "EOF TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Rutgers University (Newark, NJ) in Apr 2015", "Interview Descriptions": "Very easy interview process with leading professor. Was very familiar with the professor and she was very familiar with my academic record so it was an easy decision. Just asked general questions about availability and potentially dealing with young students and varying personalities.", "Interview Questions": "What courses have I taken to prepare me for this role?"}, {"date": "28 Jan 2015", "title": "Career Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at Rutgers University", "Interview Descriptions": "I interviewed with the undergraduate career center; met a woman who was an assistant director. She could not have looked any more disinterested during our brief interview. It's like someone had dumped the task of interviewing on her and she resented it. So she asked me a couple of questions, I answered, trying to demonstrate some enthusiasm, trying to make some kind of connection with her. Then she asked me if I had any questions; I asked one, she made a quick reply, and then said, thanks for coming in. We left the conference room and walked back to her office. She opened the door, and I don't remember what I said exactly, something along the lines of thanks for meeting me, I'm really interested in the job, etc., smiling as I said it. What did she do? She frowns and slams the door in front of me.  Totally unprofessional", "Interview Questions": "What's your current salary?"}, {"date": "5 Jun 2015", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rutgers University (Piscataway, NJ) in Feb 2015", "Interview Descriptions": "the interview process was pretty straight forward. My prof. asked me few question, sadly its only based on your GPA so if you have a 4.0 then you are definitely getting the position. If not you need a ton of experience.", "Interview Questions": "What classes did you take?"}, {"date": "9 Dec 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (Rutgers, NJ) in Feb 2015", "Interview Descriptions": "The professor asked me whether i have taken his class before and then he asked me some questions related to the class, i gave him the answer which he was very satisfied and he offered me the job after the interview immediately", "Interview Questions": "why do you want this job"}, {"date": "16 May 2017", "title": "Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University (New Brunswick, NJ) in Feb 2015", "Interview Descriptions": "Smooth, Positive , The interviewer were friendly and didn't care about the coding language and stuff. He asked me certain technical questions about my background. He gave me a berlin clock to design and gave me couple of days to code it.", "Interview Questions": "Asked Resume based questions, Database design questions, Normalization and Denormalization. What was your role in previous company? How you handled this situation? Questions on Database optimization? when can you start working?"}, {"date": "17 Dec 2016", "title": "Information Technology Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Rutgers University (Piscataway, NJ) in Feb 2015", "Interview Descriptions": "Overall just ask basic computer/networking questions. Know your hardware, your software and your customer service and be a personable candidate. Experience isn't necessary (but a bonus) but being good at talking to people definitely is.", "Interview Questions": "What is hard-drive defragging and how does it work?"}, {"date": "13 Feb 2018", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ) in Feb 2015", "Interview Descriptions": "The interview took 3 weeks. Phone interview first then meeting up with the meeting on Skype. Questions about my background and how will I fit the team. I have to accept to manage the project without supervision as the Principal investigator did not have the time.", "Interview Questions": "Questions related to the research project of the position."}, {"date": "16 Sept 2019", "title": "Associate Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University (Newark, NJ) in Feb 2015", "Interview Descriptions": "3 person interview process- each PI asks you what your experience is, what lab techniques you have, how many years/publications you have. Overall, its a very relaxing interview process, compared to other industry interviews", "Interview Questions": "(given a hypothetical experimental question) How would you solve this? What methodologies would you use to figure out this issue?"}, {"date": "21 Jan 2015", "title": "Geocoder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Rutgers University", "Interview Descriptions": "Easy, not difficult. Friend recommended me. Did research online about the position, accepted a week later for an interview. Interview with boss was easy and relaxed. Looking for hard workers who dont slack. Be prepared for work that is easy and very relaxed. Will not be moving up in a position. consider this to be a temporary position for easy money.", "Interview Questions": "Typical"}, {"date": "25 Nov 2015", "title": "Caller Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2015", "Interview Descriptions": "There was no interview process. You simply submit your resume, it gets reviewed, and you are called in for training. Afterwards, you sign up for your first couple of shifts and that's it.", "Interview Questions": "N/A"}], [{"date": "27 Sept 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University (Piscataway, NJ) in Jan 2015", "Interview Descriptions": "One of the professor interviewed me and ask me some questions to test my calculus ability. Challenging questions. You should have strong background in mathematics. Also, you need to\r\nshow the ability to be a good teacher", "Interview Questions": "Explain what is Riemann integral"}, {"date": "27 Mar 2015", "title": "Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Rutgers University (Piscataway, NJ) in Jan 2015", "Interview Descriptions": "This was a very simple interview with the Douglass Campus Supervisor. It was a quick two or three questions to gauge how much you want the job, and if you can speak English in general (this applies to all the international students we have here at RUtgers). It is very basic and you basically can't fail it.", "Interview Questions": "Are you comfortable speaking to large crowds?"}, {"date": "9 Feb 2016", "title": "Engineering Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (Piscataway, NJ) in Jan 2015", "Interview Descriptions": "The main skill required is Auto CAD knowledge. The Employer will ask you to recreate a drawing in Auto CAD. He is strict when it comes to details, however, he does not put you under time pressure, so you can take your time. After you complete the test, he takes a while to respond to you because it is a long process before the HR department allows him to hire you, but eventually he will get back to you.", "Interview Questions": "Recreate a drawing."}, {"date": "23 Dec 2014", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "The interview process takes a long time , for Rutgers clearance and DOc clearance then you have to wait to get a physical.There was no one to really follow up to see the progress of your application. The interviewer was very honest about the length of the process, however a company should not take taht long with their process they will loose potential good employees", "Interview Questions": "What make you think we should hired you"}, {"date": "19 Oct 2014", "title": "Web Editor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "It was easy, they just asked me about my experince with web and if i knew any coding or had exposure to an CMS. Asked me about what i thought about the site they were working on and how i could help them", "Interview Questions": "N/A"}, {"date": "27 Jun 2017", "title": "Post Doc Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Newark, NJ) in Oct 2014", "Interview Descriptions": "Interviewed with the PI I was working with, very friendly and professional. Prepared prior to interviewing by reading previous publications of the lab and getting to know the particular work the lab is doing. I got very lucky with my PI, he was very easy-going.", "Interview Questions": "What are my previous research experience?"}, {"date": "17 Apr 2015", "title": "Help Desk T/Resnet Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University (Newark, NJ) in Oct 2014", "Interview Descriptions": "I had two interviews. Both were Mostly behavioral and questions asked were mostly to test your communication skills. Questions asked were mostly pertaining to team work, leadership, conflict handling and testing basic technical skills.", "Interview Questions": "Any conflicts in team? how did you solve it"}, {"date": "19 Nov 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rutgers University (Newark, NJ) in Sept 2014", "Interview Descriptions": "I was invited by the professor of the group to give a research talk in the group and a private discussion of my work. During the talk, I was grilled hard about my past research, questions designed to throw me out of my game and challenge me, but all went well and I got the job.", "Interview Questions": "Situate my research in the present state-of-art"}, {"date": "28 Mar 2018", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in Sept 2014", "Interview Descriptions": "Everyone was really nice and helpful during the process. It was fairly short, trading emails then coming in for a quick interview to meet everyone and talk about the kinds of skills I have the projects I've worked on.", "Interview Questions": "Any experience with CMSes or web development"}, {"date": "20 Sept 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Sept 2014", "Interview Descriptions": "The process involves two staff members to the research group you are interested in working with. They typically begin by explaining the project that you will be working on and using your resume as the basis to understand if you are a good fit. They want you to explain in detail how your experience will be used for the purpose of the project.", "Interview Questions": "Explain a project that involved your expertise in GIS? "}], [{"date": "14 Jan 2016", "title": "Student Technician At SAS-IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Sept 2014", "Interview Descriptions": "Work Study assigned me to SAS-IT for my job placement, but the job requires an interview to be finalized, since Work Study doesn't have a really good pre-screening process. I dressed business-casual and felt a bit over-dressed, but it's better to be safe than sorry. After the questions were asked, I got the offer on the spot and we discussed the details.", "Interview Questions": "What are the different types of malware and what do they do? What signs does a computer show that would make you suspect it is infected with malware? What is an operating system and which operating systems do you have experience using? What is an IP address and how is it different than a MAC address? How do you find a computer's IP address and MAC address on Windows? Do you know how to find them on any other operating system? What is the difference between a Mac and a PC? What are the main hardware components of a computer? If you didn't know the answer to a problem you faced on the job, how would you figure it out?"}, {"date": "22 Mar 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Rutgers University (Piscataway, NJ) in Sept 2014", "Interview Descriptions": "It was a connection based hire. There was no formal interview. It's very domain specific. I obtained information and agreed to work for them. The hiring process is very length because it's a state government agency.", "Interview Questions": "Do you wanna work for us?"}, {"date": "18 Aug 2014", "title": "Program Coordinator II Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "Was emailed and selected for a phone interview. Was told would be informed if went on to in-person interviews soon but received a letter stating that they pursued another candidate.", "Interview Questions": "N/A"}, {"date": "30 Oct 2017", "title": "Technical Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2014", "Interview Descriptions": "I met with one of the supervisors in person. We went over my resume and experiences. They asked me a few technical questions. It was not too difficult. They just wanted to get a feel of who you were.", "Interview Questions": "How are you with handling people who are tense?"}, {"date": "14 Jul 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Application with a Statement of purpose,bachelor transcripts, GRE score, TOFEL score, subject GRE score and subject GRE score. It is helpful if you know what area of research you want to work in and additional which professor would you like to work with. Some professors do reply to personalized emails.", "Interview Questions": "N/A"}, {"date": "11 Jun 2014", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "It is from Department appointment and most PhD students and some MS students could have a chance to be teaching assistant. It is from Department appointment and most PhD students and some MS students could have a chance to be teaching assistant.", "Interview Questions": "It is from Department appointment"}, {"date": "28 May 2014", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "one voicemail and quick return call to ask general details of the job duty.  Few days  before interview, got two more phone calls regarding the salary and the directions to the office.  The interviewer was very nice and answered all my questions.   i was very interested in the  job but i decided to decline due to far commute.", "Interview Questions": "are you willing to work overtime"}, {"date": "31 May 2015", "title": "Accounting Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University (New Brunswick, NJ) in Jun 2014", "Interview Descriptions": "The interview process took about a half hour.  There was a panel of people interviewing me. The Business Manager and the Director. They took turns asking me questions and explained job requirements of the position. They got back to me after two weeks.", "Interview Questions": "How much do you know about excel?"}, {"date": "25 Dec 2014", "title": "Business Specialist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Rutgers University in Jun 2014", "Interview Descriptions": "I was  called in for an interview based on a position that  I had seen listed on line. I met with a Business specialist then a Business Manager", "Interview Questions": "The questions  were typical. What brought you here?  Why do you want to leave your current position. "}, {"date": "29 Jun 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University (New Brunswick, NJ) in Jun 2014", "Interview Descriptions": "The hiring process was quick. I interviewed with two people in the department, my supervisor and her supervisor. After getting to know more about me, my supervisor asked if I had questions.", "Interview Questions": "Why do you want to work here?"}], [{"date": "12 Feb 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Jun 2014", "Interview Descriptions": "Was relaxed, had a discussion on my skills. I met with the assistant director of the program. She and I had connected earlier at an information session, where I had a mock-presentation of my teaching abilities. Most other candidates were not required to perform a mock, so maybe that helped me with the process. I earned the job by explaining my communication skill and effective ability to alleviate distress and ambivalence among groups of people.", "Interview Questions": "How would you manage twenty or so rowdy students?"}, {"date": "29 Apr 2014", "title": "PM Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Rutgers University", "Interview Descriptions": "Two manager interview", "Interview Questions": "I feel the interview were not experienced interviewer"}, {"date": "10 May 2017", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University (Newark, NJ) in May 2014", "Interview Descriptions": "They want to make sure that you genuinely care about your students and that you are willing to work according to the department's standards. Be articulate and clear about your teaching abilities, and be prepared to discuss your teaching philosophy.", "Interview Questions": "What is your understanding of the Rutgers-Newark student body?"}, {"date": "14 Apr 2015", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Rutgers University (Rutgers, NJ) in May 2014", "Interview Descriptions": "It was quick, introductory, casual and relaxed. We met at the pool, the boss showed me around and showed me how to perform duties. It was more of a formality.", "Interview Questions": "Have you worked at other pools before?"}, {"date": "20 Nov 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University (Newark, NJ) in May 2014", "Interview Descriptions": "The interview process was great. Interviewer was great asked basic questions like strengths and weaknesses and past experiences. They called me in after a few months of submitting my application", "Interview Questions": "What is your weakness "}, {"date": "11 Apr 2014", "title": "Plumber Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Rutgers University", "Interview Descriptions": "hr sucks they take forever cause there always off and sends paper work to you late", "Interview Questions": "Have you ever thought of leaving your present position before? If yes, what do you think kept you there?"}, {"date": "31 Mar 2014", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Rutgers University", "Interview Descriptions": "Recruiting is all about 2 events: FIND held at Rutgers, and ASHP Midyear. Succeeding here is all about networking e.g. connecting with fellows to \"learn about the program\" and preparing for standard interviews. \r\n\r\nNavigating Midyear, or \"the gauntlet\", is all about preparation. Just practice interviewing until you are comfortable and you will succeed over the amateurs. The most challenging part is the pace and sheer quantity of interviewing, so the best prepared will their loads lighter than those scrambling last minute.", "Interview Questions": "All interviewers can see every position and company you are applying to, so be prepared to explain your rationale for what kind of positions you applied to"}, {"date": "25 Oct 2015", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University (Piscataway, NJ) in Apr 2014", "Interview Descriptions": "The Principle investigator invited me to his office the day of the deadline where he had to pick his candidates.  After coming to his office in the pouring rain.  He sat me down, and only asked me one question, which I spent the next 10 minutes answering.", "Interview Questions": "Tell me about yourself?"}, {"date": "24 Mar 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "worked with course professor and had experience with the project, asked for opportunity to work further, got introduced to the team, volunteered first then got paid", "Interview Questions": "working pace was different, and cooperation sometimes failed"}, {"date": "24 Mar 2014", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Rutgers University", "Interview Descriptions": "Took two weeks, interview with a manager", "Interview Questions": "What would I do in a situation like this....?\r\n\r\n"}], [{"date": "24 Mar 2014", "title": "Head Lifeguards Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Rutgers University", "Interview Descriptions": "One on One Interview, Skills Check", "Interview Questions": "How do you feel about team work?\r\n"}, {"date": "11 Oct 2015", "title": "Temporary Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Rutgers University (Piscataway, NJ) in Mar 2014", "Interview Descriptions": "I met with the principal investigator of the lab that was hiring in their office. They went over the research that was being done and asked me about my past experiences. I was required to read a journal article from the lab and discussed what I understood in the interview as well.", "Interview Questions": "Why do you want this job?"}, {"date": "27 Jun 2015", "title": "Master of Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Mar 2014", "Interview Descriptions": "The process took 1-2 month to  finally receive the acceptance letter from the Director of the program, the entire process experience was great, got all the questions answered by the Administration office and they did reply email quite fast. The international services office is really helpful in terms of assisting in the process of the immigration documents, and day-to-day Q&A assists.", "Interview Questions": "Why you want to apply for Master of Financial Analyst"}, {"date": "5 Apr 2016", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University (New Brunswick, NJ) in Mar 2014", "Interview Descriptions": "It was very casual and inviting. We all met for a lunch as a group and played ice breakers, then had individual interviews that become more specific. They asked us questions that ranged from creative to technical to see how well we would fit in the team and workplace environment.", "Interview Questions": "Is it better to be great and late or good and on-time?"}, {"date": "3 Jul 2015", "title": "Mental Health Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (Piscataway, NJ) in Feb 2014", "Interview Descriptions": "Two-step interview process with standard interview questions (background information such as previous employment history as well as educational/academic history). The second interview differed from the first as the questions became more situational and more relevant to the inpatient units (children, adolescents, and adult).", "Interview Questions": "QUESTION: How would you respond to a patient in crisis (either behavioral or medical)?"}, {"date": "2 Feb 2014", "title": "Student Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Rutgers University", "Interview Descriptions": "Interviewed about 5 weeks after application. Panel interview, questions were prepared and the questions did no stray from the sheet everyone had. Make sure you have questions and are able to highlight yourself and your experience that relates to the job.", "Interview Questions": "Behavioral questions including how you handle conflict, goals, and dealing with your supervisor."}, {"date": "3 Mar 2014", "title": "Teaching Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 months. I interviewed at Rutgers University (New Brunswick, NJ) in Feb 2014", "Interview Descriptions": "Took over 2 months from time of application to first hearing anything from employer.  Took an additional month to schedule interview.  Starting time was prompt.  Three persons were part of the interview.  False promise of hearing something by end of week or week after.   I emailed them, sent a thank you letter, and kept waiting.  I have received three emails to let me know they are still waiting, but I was their favorite candidate.", "Interview Questions": "Asking if I understood everything they just spoke about.  "}, {"date": "2 Dec 2015", "title": "Help Desk Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University (Rutgers, NJ) in Feb 2014", "Interview Descriptions": "IT was a fairly easy interview, it was just siple questions an simple stuff that they asked. It talked about school life, how busy I wouuld e etc. Then there was stuff about my background in IT but thy were going to train me anyways so it wasn't that big of a deal. The most important part was the behavior part.", "Interview Questions": "How long have you gone to this University?"}, {"date": "27 Jan 2014", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "It is a kind of scholarships. So the hiring process is similar to the recruiting process of graduate school. You submit your CV, personal statement, transcripts (including GRE) etc. The committee members of the department will review your applications. Interview is usually optional. Rutgers does not give interview when recruiting graduate students.", "Interview Questions": "N/A"}, {"date": "6 Jan 2014", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Rutgers University", "Interview Descriptions": "not much things going on since I graduated from this place and know most of the people working there", "Interview Questions": "N/A"}], [{"date": "14 Oct 2015", "title": "Patient Accounts Specialist - University Hospital Newark Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Newark, NJ) in Jan 2014", "Interview Descriptions": "Not a difficult process, except the time between the initial interview and the time they contact you with an offer can be several weeks/months.  Very slow hiring process.", "Interview Questions": "Where do you see yourself in the next 5years type questions.  "}, {"date": "20 Aug 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Rutgers University in Jan 2014", "Interview Descriptions": "The interview was done over the phone only as I was at the time living abroad. It lasted less than 30 minutes since I had been recommended by mutual collaborators.", "Interview Questions": "What are you plans after the post doc?"}, {"date": "26 Dec 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Rutgers University (Piscataway, NJ)", "Interview Descriptions": "No interviews. I was required to pass English speak test or RIVA test before I could give a lecture to students.", "Interview Questions": "N/A"}, {"date": "23 Dec 2013", "title": "PhD Candidate-Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "No interview for either position, simple online application submitted", "Interview Questions": "N/A"}, {"date": "11 Dec 2013", "title": "Part Time Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Rutgers University", "Interview Descriptions": "You can find the openings online on the career website. Or sometimes it's by word of mouth or recommendation of an existing employee. They check your technical ability and past teaching experience if any. Having a past teaching experience is a big bonus.", "Interview Questions": "It can vary from personal to person. I don't recall any such thing. "}, {"date": "2 Dec 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University", "Interview Descriptions": "A former graduate student called me and we had a friendly chat over my background and research interests. Then he talked about the wok environment at Rutgers.", "Interview Questions": "I didn't have any"}, {"date": "3 Jan 2018", "title": "Community Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University (New Brunswick, NJ) in Dec 2013", "Interview Descriptions": "Small interview  with different county employees. Easy question about oneself . Response was late but because it has to go through the university. But contact was maintained and over all easy Interview", "Interview Questions": "No real difficult questions "}, {"date": "22 Nov 2013", "title": "Helpdesk Employee Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "Got recommended through a friend, two rounds of interview with assistant director and field support employee. Mainly customer service related some technical questions. Mainly issues related to how do you deal with a difficult customer. Was pretty short maybe 30 minutes maximum and got back to me within a week. Neccesity to have some sort of in because most of the people who get hired get hired through their friends.", "Interview Questions": "N/A"}, {"date": "13 Jul 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Nov 2013", "Interview Descriptions": "Fairly simple, got talk to the Prof who like to work with and then if he likes you get to work. As soon as you hear from the guy give him an email saying you would like to meet him in person. It may take a while to get a one on one meeting sometimes be patient. Don't go asking for pay and financial support on first meeting. Work with him for sometime if you are satisfied then request him if he can support you.", "Interview Questions": "be thorough in basics. Don't try to be smart, be realistic"}, {"date": "7 Oct 2013", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "academic course work, future plan,you have to introduce yourself and your interest of your research area. tell something about your achievement on  academic work. why you choose teh university. what do you see iin 5 years. your strength and weakness. what have you conquered during your past and how do you deal with it.", "Interview Questions": "personal statement."}], [{"date": "3 Jan 2017", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Rutgers University (New Brunswick, NJ) in Oct 2013", "Interview Descriptions": "Two-day process; on the first day, I had a dinner with a few faculty members in the department I was applying to. On the next day, I had a research presentation (1 and half hours) and several research meetings with each of other faculty members and PhD students.", "Interview Questions": "What are your main research topics and what is your plan to develop your identity as a scholar? "}, {"date": "26 Dec 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Rutgers University (Rutgers, NJ) in Oct 2013", "Interview Descriptions": "Questions on past teaching experience. Some personal questions on whether I live on or off campus, if I had a car to make sure that I can get myself to work.", "Interview Questions": "Any past teaching experience?"}, {"date": "10 Sept 2013", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University", "Interview Descriptions": "One interview, no technical questions just need to show experience. They look for someone mature and responsible. If you have good experience they won't hesitate to hire you. Overall very easy process and a nice place to work.", "Interview Questions": "There were none technical questions"}, {"date": "4 Oct 2015", "title": "SAS IT Tech Work-Study Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Sept 2013", "Interview Descriptions": "Poor, very very basic. 1 stage - face to face interview.\r\nI was invited in to interview with the head of the SAS IT department. \r\nAfter finding the office and being invited in, I met with head for a casual interview\r\nA few basic behavioral questions were asked and then I was told that the technical part would start.\r\nTo my surprise there was only 1 question and it did not really test whether or not one should be suitable for the job, but I answered it and was asked when I could start. I started the next day.", "Interview Questions": "What is the difference between a worm and a trojan"}, {"date": "8 Jul 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Sept 2013", "Interview Descriptions": "They tell you what they expect from you and what to do in certain scenarios. Not long, they don't ask any questions like 'tell me about yourself\". Listen to what they say because they might ask you a question about what they said before.", "Interview Questions": "Would you mind getting me a bagel in the morning?"}, {"date": "17 Mar 2017", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Sept 2013", "Interview Descriptions": "The interviewer simply asked about my major and work history and asked why I was majoring in my major. Also asked why I would be a good fit for the role.", "Interview Questions": "What is your major? Why?"}, {"date": "24 Jan 2017", "title": "Graphic Design Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2013", "Interview Descriptions": "During the Summer break I received an email about a few job listings on campus. One of them was for a Graphic Design Intern which was exactly what I was looking for. I submitted my resume via email and waited to hear back. About a week later I received a phone call from their office asking for an interview. Close to when school was starting again, I went in with my portfolio in hand and met with the two supervisors for the position. We spoke about the work and looked over my portfolio. They were both so nice. A few days later I got a call that I got the position!", "Interview Questions": "Do you work well with others? "}, {"date": "7 Jan 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2013", "Interview Descriptions": "No interview process occurred rather they opted to look at your resume and class work.  From there they decide whether or not you are accepted into teaching as a graduate student.  While it seems stressful, it really is not.", "Interview Questions": "Talk about your dip in grades"}, {"date": "11 Feb 2014", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2013", "Interview Descriptions": "send the resume through the University hiring webpage, got the email back after 1 week and the PI called back after 2 weeks", "Interview Questions": "N/A"}, {"date": "10 Jul 2013", "title": "Program Coordinator II Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University", "Interview Descriptions": "I applied online and made it through to first phone interview. Interviewer was director of the Center for Women and Work. We had a 15 to 20 minute conversation going over particular details of the job, and emphasized that the position is grant-funded. Overall, it was normal, casual interview. Interviewer told me that they would notify me on whether or not I'd be going on to next round the week after, but it took them over 2 weeks to respond.", "Interview Questions": "What was it about this position that made you apply?"}], [{"date": "19 Oct 2017", "title": "Temp Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Rutgers University (Piscataway, NJ) in Jul 2013", "Interview Descriptions": "Hiring and interview where super straightforward and relaxed where I worked.  I was asked simply what I knew and what I could offer and if I was comfortable doing the work that I was applying for.  Everyone involved was really friendly and helpful!", "Interview Questions": "What sets you apart from the other candidates?  How did you hear about this position?"}, {"date": "14 Dec 2016", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Jun 2013", "Interview Descriptions": "no interview; I know the person who assign courses in the department, I applied directly with him and then he looked at my portfolio and give me the position. Basically there is no interveiw for this job. I just got it directly", "Interview Questions": "N/A"}, {"date": "19 May 2013", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Rutgers University", "Interview Descriptions": "An initial phone interview mainly to confirm my qualifications. 45min presentation during an on-site interview. All were very interested.", "Interview Questions": "Why I wanted to work at Rutgers."}, {"date": "5 Dec 2016", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Rutgers University (Piscataway, NJ) in May 2013", "Interview Descriptions": "As a genetics major, I was required to do at least 1 full year of research. I got a list of professors from department page, emailed selected professors and asked for an interview or couple minutes of their time.", "Interview Questions": "What are your interests? What are your future plans? Ph.D.? Master's? Thesis?"}, {"date": "26 Jun 2015", "title": "Geoscience Scholar Program Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (Newark, NJ) in May 2013", "Interview Descriptions": "Interview process was very general because it mainly dealt with reviewing my transcript and the classes I have already taken to determine if I was a good candidate to teach.", "Interview Questions": "Why am I interested in this position and this program?"}, {"date": "16 Jun 2017", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Rutgers, NJ) in Apr 2013", "Interview Descriptions": "Resume with  proper grammar, a high GPA and a friendly demeanor will get you in the door\r\nThen group interviews - don't bee too agressive - be insightful and helpful. Be a team player", "Interview Questions": "Group dynamics - What do you do when a student does not want to participate in study group?\r\nWhat if you lead a study group and students are texting?"}, {"date": "17 Jul 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Camden, NJ) in Apr 2013", "Interview Descriptions": "Applied online through the recruitment website and interviewed in person with the head of the department I was applying for a few days later after they called me in. I started two days after the interview and pretty much actively trained which is something I prefer.", "Interview Questions": "How much of a work life balance do you think you have?"}, {"date": "11 Feb 2014", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Feb 2013", "Interview Descriptions": "I had worked there part time previously for about 2 years so there was no real interview process.", "Interview Questions": "It was difficult to answer what were the highs and lows of the position because I never really had any lows while working there.  "}, {"date": "22 Dec 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Feb 2013", "Interview Descriptions": "Interviewed on skype and then in person after accepted. Interview over skype was quick, thirty minutes. Full-day interview after accepted. Interview full-day after accepted required lots of meetings, a little overwhelming. But it was good to meet other graduate students during my interview, I got to ask them many questions", "Interview Questions": "Tell them about myself"}, {"date": "16 Sept 2017", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Newark, NJ) in Jan 2013", "Interview Descriptions": "It was a Skype interview conducted by a faculty member. It was succinct, with very pointed questions, and not many pleasantries. The questions were mostly about reseach interest and intention rather than personality or other facets of one's character.", "Interview Questions": "Research experience, familiarity with the institute/program, future plans"}], [{"date": "18 Mar 2014", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Rutgers University (Newark, NJ) in Jan 2013", "Interview Descriptions": "Pretty basic interview. Asked if I had basic proficiency in microsoft excel for data entry purposes.", "Interview Questions": "Pretty basic interview, no in depth questions."}, {"date": "16 May 2015", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Rutgers University (Piscataway, NJ) in Jan 2013", "Interview Descriptions": "They hire you based on experience.  Some problems requires lab skills lab safety animal handling and analysis. Be prepared for them to ask a lot of questions about their field and what you can do", "Interview Questions": "Why are you interested in research?"}, {"date": "3 Jan 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2013", "Interview Descriptions": "I had an interview with the professor and it takes only 15 minutes. We meet in his office and asked me if I have any teaching experience. Give me some advises how to deal with problem students. We then talk about the salary.", "Interview Questions": "Do you have any teaching experience?\r\nHypothetical scenario question, what if a student comes to you and claim missing point in grades."}, {"date": "21 Apr 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Rutgers University (Newark, NJ) in Jan 2013", "Interview Descriptions": "First we have to apply online or find an adviser. Then, in the case your background was matched with the adviser position you will be asked for an interview. After than I needed to wait by the time they informed me about my approval.", "Interview Questions": "About the reason I like to continue my education."}, {"date": "24 Feb 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Rutgers University (New Orleans, LA) in Dec 2012", "Interview Descriptions": "This position is recruited for through ASHP, and involves interviewing with as many as 15-20 pharmaceutical companies. These interviews are done over 3 days and you may get 2nd and 3rd rounds from companies. I personally had approximately 30 interviews with this program over the course of Midyear. After ASHP, on-site interviews are conducted for companies who you are interested in and who you are interested in.", "Interview Questions": "I was asked what other positions I was interested in and forced to rank them."}, {"date": "12 Nov 2015", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rutgers University (Piscataway, NJ) in Nov 2012", "Interview Descriptions": "It was a day long process including a presentation, dinner and  panel  interview questions, meeting with the Executive Director and dinner.  I started about 10 am and did not conclude until 7pm.\r\nI applied internally and forgot about the opening only to receive a call several months later that I should come in for an interview.  I had to prepare a 20 minute presentation.\r\n\r\nI didn't get the position but it allowed me an opportunity to gain visibility within the department which opened the door for future opportunities.", "Interview Questions": "How would I ensure equitable distribution of services"}, {"date": "30 May 2016", "title": "Student Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rutgers University (Newark, NJ) in Oct 2012", "Interview Descriptions": "There were two interviews. The first interview was with a search committee. Be prepared to discuss your experience working with students, academic advising, and any knowledge of the career process. The search committee is the most difficult. You typically meet with the hiring manager last. Definitely wear professional dress. (ex: suit, button down shirts).\r\n\r\nIt's also helpful to research the division and campus for which you're applying. The schools each have their own identity and will want to know that you are aware of what makes them different from every other school within the university.", "Interview Questions": "Tell us about yourself? Why do you think you are qualified for this position? What is your experience working with diverse student populations? What is your understanding of the majors offered in this division? What are some of your strengths? Weakness?"}, {"date": "12 Apr 2015", "title": "The Rutgers Club Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in Sept 2012", "Interview Descriptions": "They ask you questions about things in your resume and tell you about the job to see if it's for you. The guy was very thorough about what the server position entitled. He made it clear that it was flexible but that he was also looking for responsible people.", "Interview Questions": "Do you mind cleaning up and picking things up?"}, {"date": "2 Mar 2014", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 months. I interviewed at Rutgers University (New Brunswick, NJ) in Sept 2012", "Interview Descriptions": "Had a total of 3 interviews which went well, very straight forward.\r\nYou must have patience though because the process is long, almost 4 months between 1st interview and hire date. Hiring date is not up to department where you will be working, processing after interview goes to HR where it can stall for a while.", "Interview Questions": "If you're qualified for the position you're applying for then you should have no problems.  They're not out to trick you"}, {"date": "23 Jul 2015", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Rutgers University (New Brunswick, NJ) in Sept 2012", "Interview Descriptions": "Easy, You walk in and meet a manger. They let you feel comfortable and as a student they do not put a lot of pressure on you in terms of projects and skill level. They explain you can learn a lot and get many different unique opportunities to learn and relate to your field", "Interview Questions": "What programming languages do you know"}], [{"date": "5 Aug 2015", "title": "Business Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Sept 2012", "Interview Descriptions": "Once I submitted the resume and application, I got called in for an interview. It was relatively basic, going over my experience, how it would apply to the role I was interviewing for, and certain questions about how I would deal with theoretical situations and problems that might come up. All in all, it was a relatively smooth and pleasant experience.", "Interview Questions": "How would you deal with a co-worker who was delivering as expected?"}, {"date": "27 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Rutgers University (Piscataway, NJ) in Sept 2012", "Interview Descriptions": "Coordinator sat me down, talked to me a bit. Not very insightful. The position I applied for was relatively easy as an intern. However, it seemed as if no one really cared what I did, when I did it by, etc. The interview reflected that. It was very easygoing, casual, nice people. However, still a boring place to be.", "Interview Questions": "What do you like doing?"}, {"date": "30 Mar 2016", "title": "Administrative Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2012", "Interview Descriptions": "Sent my resume online and they called me to came in for an interview.  They seemed disorganized.  My gut feeling was correct.  The interview was very short and brief.  The job was already filled in house but person in charge or the secretary forgot to cancel or tell me.  She was so sorry for wasting my time.  The campus was nice and the facility is very well funded.  The experience was very frustrating since I took a personal day off from work to met with them.  Overall, not a very positive experience.", "Interview Questions": "Why do you want to work for Rutgers?"}, {"date": "15 Sept 2016", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University (Piscataway, NJ) in Jun 2012", "Interview Descriptions": "I gave a talk on my thesis research and I had one-on-ones with several faculty in the department, as well as a few post-docs. We went to dinner. Pretty standard interview process. They covered travel to and from the interview.", "Interview Questions": "I was asked to describe my research and some side projects that I worked on."}, {"date": "23 Oct 2016", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University in Jun 2012", "Interview Descriptions": "One hour phone screen interview with questions about my skills, my background, my previous projects and publications. One day on-site interview (presentation and meeting with team members) that discussed my role in the team, future projects and my career plans.", "Interview Questions": "Everything about the work and projects and what I could do"}, {"date": "15 Oct 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University in Mar 2012", "Interview Descriptions": "Contact by email, discussing about the professor s research projects. No interview, just wait for a month and got the offer. Background match is the key. Strong plus if you have related publication.", "Interview Questions": "What's your related publications?"}, {"date": "23 Jun 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University (Camden, NJ) in Feb 2012", "Interview Descriptions": "Interview process involved an initial phone screen, then a 1-1 interview, then an interview with a panel. All interviewers were warm and friendly. I was not intimidated during the interview and found that speaking knowledgeably about what I had to offer helped me make it all three.", "Interview Questions": "What kind of experience and skills do you bring to the table?"}, {"date": "25 Nov 2015", "title": "Course Ranger Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in Feb 2012", "Interview Descriptions": "Speak with Head Professional.  They evaluate your knowledge of golf, personality and ability to communicate.  Overall, it is a conversation about your interests and availability.  Smile and just be yourself.  Everyone here is very friendly.", "Interview Questions": "Do you play golf?"}, {"date": "4 Oct 2015", "title": "Lab Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Rutgers University (Piscataway, NJ) in Feb 2012", "Interview Descriptions": "Online application, from which individuals are chosen to have an in-person interview. From this interview, individuals are given a variety of technical and situational questions, and questions about personal background. Employers are looking for strong customer service skills and good tech baseline. Previous work experience will be asked, and tech questions involving applications, networking, and hardware will be asked.", "Interview Questions": "How would you change the language in Microsoft Word?"}, {"date": "23 Jan 2013", "title": "Community Service Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2012", "Interview Descriptions": "Interview in front of 3 men. The Commander, the CSO Battalion Commander, and a representative from the Rutgers police department.", "Interview Questions": "\"What would you do if your partner stole a piece of candy?\"\r\n\r\n\r\n"}], [{"date": "28 Jun 2012", "title": "Assistant Director of IT Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Dec 2011", "Interview Descriptions": "I was contacted by email and setup the interview.   During the interview, I met with 3 individuals and the interview went extremely well. Hiring manager exchanged emails with me about the interview assuring me why I was not a candidate.  It was great feedback.", "Interview Questions": "Do you have any programming  and development background."}, {"date": "7 Jun 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Nov 2011", "Interview Descriptions": "Ask about the past experiences.", "Interview Questions": "What do you do when something goes wrong in the process?"}, {"date": "25 Jul 2015", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Oct 2011", "Interview Descriptions": "I walked into the rec center, asked to speak to the building manager, realized my mistake and asked for the aquatics director, asked the director if they were hiring, asked for an application, filled it out in front of him, asked when we might do an interview, was interviewed on the spot and told to send in my resume as a formality before beginning work the next week.", "Interview Questions": "N/A"}, {"date": "23 Sept 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Rutgers University in Sept 2011", "Interview Descriptions": "Very informal interview.  Met with Director and one of the Deans of the school.  Had lunch, talked about my personal goals, their goals for the university and that was that.", "Interview Questions": "How long do you plan on being here? "}, {"date": "16 Jul 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (Newark, NJ) in Sept 2011", "Interview Descriptions": "Started as work study. Applied and went in for interview. Then met someone the other individual I would be working for. The process was smooth because I automatically got the position because I was a work study student.", "Interview Questions": "What are you good at and would bring to the position?"}, {"date": "17 Oct 2012", "title": "Marketing and Communications Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Rutgers University (Newark, NJ) in Sept 2011", "Interview Descriptions": "Hired as work-study student assistant which allowed me to transition into a part-time summer/fall job and high pay. Interview was in an intimate location directly with the director of the marketing and communications department. Questions were straight-forward and short. He basically just went through my resume step by step, The whole interview lasted about 20 minutes and I was hired at the end.", "Interview Questions": "How will you be an asset to our team?"}, {"date": "22 Sept 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2011", "Interview Descriptions": "Started with a standard resume/cover letter submission, then an in-person interview with several department members. There was discussion about dedication to the role, since they would spend a lot of time training the person.", "Interview Questions": "There were questions about my knowledge of the department, academics, etc."}, {"date": "2 Apr 2012", "title": "Group Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2011", "Interview Descriptions": "The interview was set up through email. She was nice and just wanted to get a feel for you and why you think you'd be a good tutor. I'm pretty sure the job is yours if you really want it. Be prepared to answer how you would handle some situations (such as what you would do if multiple students come in with questions). Honestly though, you can't go wrong. It's a quick interview with no follow up. It's simple and odds are you'll get the job working the hours that you want.", "Interview Questions": "How would you deal with multiple students who need to be helped?"}, {"date": "7 Aug 2013", "title": "Security Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Rutgers University (Camden, NJ) in Jul 2011", "Interview Descriptions": "They just ask you security questions like if there was a fire what would you do? Almost all the questions are like situational questions. Very easy.", "Interview Questions": "N/A"}, {"date": "15 Jul 2015", "title": "Research Teaching Specialist V Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rutgers University (Newark, NJ) in Jul 2011", "Interview Descriptions": "Brief meeting with the principal investigator followed by 3 separate interviews with lab members. They asked mostly about my research skill sets and future plans. They didn't ask any behavioral questions.", "Interview Questions": "What is your GPA?"}], [{"date": "19 Sept 2011", "title": "Engineering Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Apr 2011", "Interview Descriptions": "The interview was blase. but the school is very bureaucratic and corrupt -from graduate students to faculty, it's all about who you know, and that trumps what you know. Also very political. High turnover of non-tenured instructors but tenured ones stay and teach long past the times when they contribute positively and usefully to the university community.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Sept 2015", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Rutgers University (Newark, NJ) in Mar 2011", "Interview Descriptions": "You have to do online application. After that your application will be reviewed and based on their review they will contact you. You may email their office to know the status of your application any time", "Interview Questions": "They really want to know what is your interest in different field of chemistry."}, {"date": "21 Mar 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2011", "Interview Descriptions": "Basically we just submitted the application materials then got the offer. The materials include personal statement, CV and possible publication. I wrote about my future career plan and summarized what I did in college in the personal statement.", "Interview Questions": "No one interviewed us. We submitted the statement of purpose."}, {"date": "18 Aug 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2011", "Interview Descriptions": "The interview process starts from online application. After a couple of weeks, I got notice to interview with the administrator. During the interview, I was firstly asked about what physics courses that I had taken and at what levels (undergrad or grad). Then, a couple of basic concepts about physics were asked. A small demonstration was conducted following the manual they provided.", "Interview Questions": "How will you help a student to understand that static friction for a walking man is in the same direction that the man is moving?"}, {"date": "4 May 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2011", "Interview Descriptions": "Hiring process involves contacting a professor based on your interest.\r\nThen work under him for a period of time before actually getting recruited.", "Interview Questions": "Previous research experience."}, {"date": "18 Jan 2011", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in Dec 2010", "Interview Descriptions": "I was initially contacted by phone for a brief interview by someone at Mason Gross School of the Arts.  After a few days I was contacted again and asked to come in for an in person interview.  The same woman who interviewed me by phone did the in person interview as well.  She asked me a series of fairly difficult questions which sounded like they probably came out of a book on how to conduct interviews.  Not only were the questions tough but required very speculative answers.  After about 1/2 hour I felt like I had been grilled and couldn't wait to get out of there.  When she was done she literally said \"I'm done.  I don't have any more questions.  You can go now.\"   Very unprofessional.", "Interview Questions": "Why do you feel that you are the best person for this job."}, {"date": "10 Dec 2010", "title": "Academic Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Nov 2010", "Interview Descriptions": "Received a call for an interview, met with the committee for 90 minutes, received an email saying I was overqualified. But, it was a personal email and very nicely done!", "Interview Questions": "Why have you switched jobs so often during your career?"}, {"date": "14 Nov 2010", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Rutgers University (Newark, NJ) in Sept 2010", "Interview Descriptions": "Interview was conducted with the Principal Investigator (P.I.). I was asked about my reserch experience and if I helped publish any articles on scientific journals.  The interviewer also asked about my future goals--- if I have plans on pursuing a graduate program in Rutgers University. I was also asked if I show my recent college transcripts. Overall, I felt that the interview was long and less intimidating.", "Interview Questions": "In the future, will you be interested in applying for a graduate program here in Rutgers?"}, {"date": "28 Oct 2013", "title": "Dining Hall Server Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Rutgers University in Sept 2010", "Interview Descriptions": "There really wasn't an interview. I sent the manager at the time an email with my resume attached, and he sent me one back asking if I was available at certain times during the week, because those were the times he was trying to fill. I said yes, and he told me to come in later in the week, had me fill out the application, and then put me on the schedule ten minutes later.", "Interview Questions": "Can you work on Wednesday, and the weekends?"}, {"date": "13 Jan 2014", "title": "Student Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (Piscataway, NJ) in Sept 2010", "Interview Descriptions": "Very simple. A couple questions about technical skills. Work study job so guaranteed placement.", "Interview Questions": "No difficult questions"}], [{"date": "26 Mar 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in May 2010", "Interview Descriptions": "Very pleasant and informal experience meeting with a few members.  They clearly outlined the job responsibilities.", "Interview Questions": "What can you bring to the table that another applicant can't?"}, {"date": "15 Jan 2014", "title": "Network Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Rutgers University (Piscataway, NJ) in Apr 2010", "Interview Descriptions": "I was hired from within Rutgers. I first started as an hourly emplyee at the student level. When I was initially hired the manager reached out to me via phone to set up an interview.\r\n\r\nThe interview process was not long and I was on the job by the next month. This is important to note that this was for an hourly position though. Getting hired for a salaried position is much much slower and moves at a glacial pace. Be prepared for a long and tedious process that could take over 3 months.\r\n\r\nInterviews will be with the direct manager you will be reporting to, the associate director and the director. The most technical part of the interview will be with the direct manager. The interviews with the directors will be more personal/attitude interviews.", "Interview Questions": "If you know the skillset they are asking for there are no really difficult questions. Make sure you know it is a team environment more than anything so be prepared for teamwork questions. For the technical side, CCNA level knowledge will be as in depth as the interview will get."}, {"date": "6 Apr 2011", "title": "Fitness Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (New Brunswick, NJ) in Apr 2010", "Interview Descriptions": "Show up on time, bring a resume.  Don't worry about dressing up; I interviewed in a tshirt and shorts.  Just like with any other job, good grades and impressive involvement/activities will help you win them over.  Emphasize any customer service jobs in the past.  Also, they might ask you where you get your understanding of cardio and lifting and exercise in general; it'll help if you have an identifiable source (anything from Men's Health magazine to an exercise plan from a personal trainer).\r\n\r\nAfter a couple weeks I got an email offering me the position.  TAKE THE JOB.  The pay is literally minimal, but you'll meet great people, learn a lot about fitness, and become a recognizable face on campus.", "Interview Questions": "What source do you get your knowledge of fitness from?"}, {"date": "18 Jan 2012", "title": "Fitness Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (Piscataway, NJ) in Apr 2010", "Interview Descriptions": "It was a simple one on one interview just some basic questions like what is your most proud achievement, etc etc", "Interview Questions": "What is your most proud accomplishment?"}, {"date": "21 Feb 2012", "title": "Physical Plant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Rutgers University (Newark, NJ) in Jan 2010", "Interview Descriptions": "it was very professional and on topic", "Interview Questions": "what you would add to the university"}, {"date": "1 Oct 2010", "title": "Technology Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rutgers University (New York, NY) in Dec 2009", "Interview Descriptions": "They asked me mostly technical questions.", "Interview Questions": "Did you ever face a problem with your team mate ?"}, {"date": "6 Nov 2009", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Rutgers University (New Brunswick, NJ) in Oct 2009", "Interview Descriptions": "Found this job online- posting for a research assistant in a psychology lab.  Great place to work.  Wish I got hired there, but they only hire internally for stimulus projects.  Lots of research.  Bit confusing to get there from northern nj though- roads are often closed, traffic is bad.  Workplace culture seemed to be very collaborative.", "Interview Questions": "Why didn't you pursue your senior honors thesis as full-time research after graduation?"}, {"date": "10 Sept 2013", "title": "Secretary Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at Rutgers University (Piscataway, NJ) in Aug 2009", "Interview Descriptions": "The hiring process drags for too long and  I think it depends on which campus you apply for.  If it is a small department they try to fill the position much quicker. Sometimes I can tell that the interviewer already knows who they are going to hire.", "Interview Questions": "The most difficult question is when they want to know why there are gaps in my resume. Most of the time is because I was laid off or got sick."}, {"date": "13 Mar 2013", "title": "Senior Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Rutgers University (New Brunswick, NJ) in Aug 2009", "Interview Descriptions": "Interview with a committee of people.", "Interview Questions": "What is your vision?"}, {"date": "7 Jan 2013", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Rutgers University (New Brunswick, NJ) in Jun 2009", "Interview Descriptions": "Hiring proceeds as at any AAU university.  You send in an application with your CV and statement of teaching and research interests in the fall.  The search committee will wade through hundreds of applications and choose the 10-12 best for phone interviews.  Then the search committee identifies the top 3-4 candidates for in-person interviews.  These are usually 1.5 to 2 day interviews, where you are expected to present at least one seminar.", "Interview Questions": "Nothing unexpected"}], [{"date": "31 May 2011", "title": "Community Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Rutgers University (Newark, NJ) in Apr 2009", "Interview Descriptions": "There is a panel interview so its normally 1:3 interview. Standard questions are asked like: why do you want this position, what makes you a good fit, etc. Then more personal questions are asked like: who is your hero and what are your personal aspirations in the company. After that there is a time where you can ask questions and it is imperative that you do so!", "Interview Questions": "What would you do if....."}, {"date": "25 May 2011", "title": "Part Time Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Rutgers University (New Brunswick, NJ) in Mar 2009", "Interview Descriptions": "applied online and then i was invited for a phone interview. The person that i talked to on the phone was very nice and he made me feel comfortable. he asked me some questions about my background and resume. A week later i received an email and was asked for an in person interview.", "Interview Questions": "where do you see yourself in 5 years?"}, {"date": "9 Nov 2009", "title": "Human Resources Manager  Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rutgers University in Jun 2008", "Interview Descriptions": "While the interview process began quickly, three days after I applied, it did take awhile to complete.  I met with the hiring manager and subsequently met with two others that held the same title. I was asked back to meet the department dean and spent about 30 minutes with her and then spoke again with the hiring manager for another 45 minutes.  There were not a lot of questions asked of me which should have been a red flag.  The hiring manager told me some personal info about others which also should have been a red flag.", "Interview Questions": "Asked about my previous university experience."}, {"date": "27 Oct 2012", "title": "Resident Hall Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rutgers University (New Brunswick, NJ) in Apr 2008", "Interview Descriptions": "After accepted to a graduate school program at Rutgers New Brunswick, I wondered into the Residence Life offices to inquire directly about graduate assistantships. There are group, peer, and director interviews", "Interview Questions": "When did you have to act as a moderator?"}, {"date": "17 Mar 2010", "title": "Lab Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rutgers University (New Brunswick, NJ) in Jan 2008", "Interview Descriptions": "2:1 interview.  Questions based on online survey completion.  If you say you are highly skilled they will ask questions accordingly.  Interviewers are professional but easy to relate to and they only make it as hard as you set yourself up for.", "Interview Questions": "Match the following file extensions to the Appropriate program used to open them: .doc, .xls, .ppt, .pdf"}]]