[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Excellent Client-Centered Non-Profit", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Mar 2023", "job_title": "Direct Support Coordinator in Chapel Hill, NC", "duration": "N/A", "pros": "Their ACTUAL PRIORITY is resident care. They do not tolerate neglectful employees. Excellent place to work, grow, and excellent place to receive care.", "cons": "Live-in hours were difficult, but that's just the nature of the work."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Committed to Residents and Staff", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Feb 2023", "job_title": "Office Staff in Chapel Hill, NC", "duration": "N/A", "pros": "Great benefits, work environment is friendly and down-to-earth, and RSI truly tries their best to accommodate all sorts of things. They are very understanding, and committed to the residents and the staff. I truly enjoyed working with the people I worked with every day and it was nice to work in an environment that didn’t feel toxic.", "cons": "Pay can be low, but this IS a non-profit; they receive funding from the govt and have to budget that money properly. Plenty of opportunities to make more money, get promoted, and get bonuses. Group homes are sometimes poorly maintained, but the pandemic and lack of staff definitely caused this."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "dsc", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Jan 2023", "job_title": "Dsc in Chapel Hill, NC", "duration": "N/A", "pros": "i enjoyed working with the residents.", "cons": "lots of work low staff"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Okay place", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Oct 2022", "job_title": "Direct Support Professional (DSP) in Duluth, MN", "duration": "N/A", "pros": "Fun, good clients, alright pay", "cons": "Hypocritical management, not super great training"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "DSP", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Jun 2022", "job_title": "Direct Support Professional (DSP) in Chapel Hill, NC", "duration": "N/A", "pros": "Great Job security. Ability to pick from different schedules.", "cons": "Pay isn't great. Can be mentally exhausting."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "okay job", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 May 2022", "job_title": "Direct Support Professional in Chapel Hill, NC", "duration": "N/A", "pros": "they are flexible with having to take some days off", "cons": "low pay, communication among staff/house is lacking--especially when people come by unnoticed"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "You get what you put in", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Mar 2022", "job_title": "Direct Support Professional (DSP) in Mora, MN", "duration": "N/A", "pros": "The individuals are a blast.", "cons": "The unplanned schedule changes can be difficult."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Salary", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Feb 2022", "job_title": "Direct Support Professional (DSP) in Carrboro, NC", "duration": "N/A", "pros": "The residents are wonderful to work with", "cons": "Low pay and sometime little room to exercise therapeutic care"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Low pay", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Nov 2021", "job_title": "Direct Support Professional (DSP) in Raleigh, NC", "duration": "N/A", "pros": "Rewarding work caring for residents.", "cons": "Low pay and high attrition"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Service", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Sept 2021", "job_title": "Mail Handler in Indianapolis, IN", "duration": "N/A", "pros": "Very caring for their clients", "cons": "Don't communicate with their employees as they should. Under staffed and over worked employees"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible. Don’t do it.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Jun 2021", "job_title": "Direct Support Professional in Chapel Hill, NC", "duration": "N/A", "pros": "Horrible. Nothing. Stay away. Pay isn’t worth it, management doesn’t care about you.", "cons": "Everything. Absolutely everything is awful"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Really great people", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "21 Jan 2021", "job_title": "Work With Families and Individuals With Disabilities in Chapel Hill, NC", "duration": "N/A", "pros": "The people who work for RSI are really wonderful human beings - smart and kind. They are committed to the residents. In general, supervisors have great clinical skills.", "cons": "Depending on the position, the work can be isolating. It can definitely be stressful. The pay isn't great at any level."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Caregiver", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Feb 2021", "job_title": "Dsc in Durham, NC", "duration": "N/A", "pros": "Good pay is for students", "cons": "Bad organization is not fair"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "a typical job", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Nov 2020", "job_title": "Warehouse Worker in Charlotte, NC", "duration": "N/A", "pros": "pay is good and people are nice", "cons": "long hours and sometimes annoying"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Solid concept. Poor team building. Not Honest.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Oct 2015", "job_title": "Direct Support Coordinator in Durham, NC", "duration": "N/A", "pros": "They are very client based. Their residents are undoubtedly very well cared for. There are areas for improvement but I would say the overall population of the residents at RSI are happy in their homes and are receiving a quality service. Their over all ambitions as a company are solid.", "cons": "Upper management and administration are power tripping, for lack of better word. I needed to be accommodated for my mental illness in the work place and they were completely unwilling to work with me. Actually no, they were willing to work with me but for such a short time that it seemed like a slap in the face to me. They often said things that ended up not being true From the application process on. If you don't have inordinate amounts of time to dedicate to this job I wouldn't suggest going for it. VERY rigorous hiring process. I would have expected more out of them from the image they project for themselves."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "HR", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Nov 2015", "job_title": " in Chapel Hill, NC", "duration": "N/A", "pros": "Not only do I whole-heartedly believe in the mission of RSI, but I love the culture of this company.  Because of the nature of the work that we do, we are able to bond as staff members because we are all here for the same reasons- to help our residents.  We are so lucky to be close to so many area colleges/universities and employ the 'best of the best'- students or recent graduates who are eager to gain hands-on experience.  I love working with other staff who care about the residents as much as I do.", "cons": "Many of the shifts (particularly on the weekends) are very long- but all the fun activities that happen on the weekends make the days go by fast!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Supervisor of Support Services", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 Aug 2016", "job_title": "Supervisor of Support Services in Chapel Hill, NC", "duration": "N/A", "pros": "RSI has conviction with their mission and vision.   RSI's individual services and support are exceptional and unparalleled.  I would not hesitate to have a loved one within their care.\r\n\r\nFor anyone seeking career advancement, RSI offers excellent opportunity for growth and progressive responsibility.", "cons": "RSI is a non-profit that is state and federally funded.  Funding for I/DD, MH and SA has been declining over a number of years, so it is fiscally challenging for all service providers within the field."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Rewarding work but not very good communication or dispersement of duties.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 May 2018", "job_title": "Direct Support Professional in Chapel Hill, NC", "duration": "N/A", "pros": "Great schedule! Monday through Friday with no weekends and 11/hr. It feels rewarding in the relationships you gain with the residents;you get attached.", "cons": "Can be strenuous work and they get upset when you ask for time off for a last minute emergency. The work seems to be pushed on 1 person in the group home,and sometimes you’re not treated the best by the individuals in the office as if they’re inferior to you and your job."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Pleasant company to work for", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Apr 2017", "job_title": "Accounts Payable/Payroll Specialist in Chapel Hill, NC", "duration": "N/A", "pros": "RSI has some of the friendliest, hardest-working people on staff that I have ever met. Every interaction I had in my position was pleasant for the most part, and the staff genuinely care about the residents as well as each other. As cheesy as it is to say, working here felt like working as part of a family rather than as though I was a number; RSI as a whole wants to see the success of its people.\r\n\r\nBenefits package is nice. The 403(b) is not matching but I advise setting it up anyway because it is never too early to start saving for retirement. My direct supervisor was also very flexible about me taking days off and she worked to accommodate me when I needed assistance completing payroll in order to take a vacation. The company is very family-oriented and understanding in that respect, which is great. Overall, RSI has a wonderful community and positive vibes.", "cons": "Too many people are involved in every project, which slows the decision-making process considerably. Meeting and committees should be used only when necessary, not for every change the company considers. It was also hard to receive feedback on performance unless something very negative happened; most people benefit from hearing what they are doing well, in addition to suggestions for improvement.\r\n\r\nThere is not much room for advancement in RSI in terms of career opportunities. The management is unlikely to change until they reach retirement age since they are so loyal to the company, but that means turnover is high since lower level employees are only staying long enough to get the experience added to their resume and then they are leaving for higher-paying work. Pay is also low, but that is expected with a non-profit organization. It's a great starting point from which to build your career."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible Management", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Jan 2014", "job_title": "Direct Support Professional (Full-Time) in Chapel Hill, NC", "duration": "N/A", "pros": "Working with the residents was a blast! They are some of the most honest, caring, amazing people I've ever met, even if working with them can be difficult at times. Every day a smile was put on my face by one resident or another. Most of my coworkers (at the ground level) were also great. It was just the management (or lack thereof) that got in the way.", "cons": "The management was AWFUL. Even though the direct support professionals (basically the lowest position on the totem pole) do basically the hardest and most important work (the actual day-to-day ground work with the residents - the actual teaching of skills and coping mechanisms and handling of crisis situations) they hardly get any recognition for just how important their work is and not nearly enough compensation (including pay & benefits) for how hard & vital the job is. In my experience with RSI, the management rarely consulted the ground staff and seemed to make decisions in a bubble. \r\n\r\nFurthermore, the training was horribly inadequate and when I requested more/better training I was told that I should be able to figure things out on my own (like how to interact with unfamiliar residents in specific recurring situations) based on generalities given during the initial 2-day orientation session. This implies that there's a one-size-fits approach to supporting adults with developmental disabilities, which, if you've ever worked with adults with disabilities, you would know is simply false, if not disrespectful. The residents are unique individuals just like anyone else and should be treated as such. This SHOULD mean that if, as staff, you're going to have to interact with a particular resident in a recurring situation, you should be given adequate training for how to support them in that specific situation. This was not provided initially and when I asked for it to be provided, this negatively impacted my performance evaluation (which was over 6 months overdue to begin with, and referenced instances from my initial 3-month probationary period which no one had previously mentioned or addressed). And that's not even getting into the safety risks of lack of training with certain residents who have a tendency to become physically violent towards themselves and/or others if certain detailed procedures aren't followed properly.\r\n\r\nA friend of mine who's moving back to the area and works in the field recently asked if I would recommend RSI as a place to work and my answer was an emphatic NO because of how awful the management was. At first I really liked working for RSI because, as mentioned above, I loved working with the residents, it was a reliable full time job with consistent hours (even if it meant getting up before dawn), and I could leave work at work and come home and still have a life. But the management got in the way of doing my job so often that I dreaded going in and eventually it started following me home. I would get home so exhausted and frustrated that I could barely do more than veg out in front of the tv for a few hours, eat dinner, and go to bed. So unfortunately I had to break my year-long contract (even though initially I could've seen myself staying indefinitely) and quit. It was an upsetting experience because I cared quite a lot about the residents and I miss them dearly half a year later. And what makes me even more sad is that I know I am not the only one who felt this way. Not only did I hear similar complaints made by my coworkers but RSI's horrid turnover rates should speak for themselves.\r\n\r\nOn a side note, I did work for one of the day programs (LO) which seemed to be the most poorly managed area of the company. So perhaps working in a different area wouldn't be quite as bad (independent living, for instance). Still, my experience was so bad that I would NEVER recommend RSI as a place to work. I wish I could say otherwise for the sake of the residents but I can't. Perhaps if your only looking to be an intern or volunteer the poor management wouldn't be so damaging. But the bottom line is: They don't treat the employees on the ground well which means ultimately they don't treat the residents well either since it's the ground staff that do the day-to-day work with the residents."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Excellent Work Environment", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Jun 2019", "job_title": "Direct Support Coordinator in Chapel Hill, NC", "duration": "N/A", "pros": "Excellent work environment,  supportive supervisors/directors. They provide bonuses yearly if funds are available. Good opportunity for growth if you have a associates/bachelors or good experience.  Residents are amazing, and working directly with them can be incredibly fun if you plan your days correctly!", "cons": "Salary is average for the field/for a non-profit. Long working shifts, especially on weekends. Holidays are usually required."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Jul 2013", "job_title": "Direct Support Professional in Carrboro, NC", "duration": "N/A", "pros": "This is a very rewarding position.  The work matters, and the company is very responsive to ideas from employees.  The schedule can be flexible, and there are opportunities for advancement.", "cons": "They are sometimes short staffed, and it can be difficult to provide the support the residents need.  Some of the work is very emotionally challenging."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Direct Support Professional", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Apr 2017", "job_title": "Direct Support Professional in Chapel Hill, NC", "duration": "N/A", "pros": "Staff is mostly friendly, and focuses on work. Residents are taken care of very well, and staff is given extensive training from CPR, First Aid, to NCI.", "cons": "Pay is pretty low, for a high stress job. However it is social work so it's understandable."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "One of my favorite jobs", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Apr 2019", "job_title": "DSP in Chapel Hill, NC", "duration": "N/A", "pros": "The relationships with the residents have been my absolute favorite part of the position. They become apart of who you are as a person and definitely change your perspective of life. \r\nCapability of moving up quickly in the company. \r\nAWESOME experience reference.", "cons": "Quick training,  low pay."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 5, "review_title": "Great Company with strong values", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Aug 2020", "job_title": "Supervisor in Chapel Hill, NC", "duration": "N/A", "pros": "People that work there genuinely care about the residents.", "cons": "There is not enough funding to support the salaries for the above and beyond."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Direct Support Professional", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Mar 2014", "job_title": "Direct Support Professional (Full-Time) in Chapel Hill, NC", "duration": "N/A", "pros": "It is a good part-time college job", "cons": "Low pay and very poor benefits; staff gets very little support from management"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Great Organization, Hiring Process Needs Work", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Jul 2019", "job_title": "Direct Support Professional in Chapel Hill, NC", "duration": "N/A", "pros": "Plenty of opportunities to take on more hours \r\nBuild relationships with team members and residents\r\nMileage reimbursement\r\nAdditional trainings offered often", "cons": "There seems to be a trend with inadequate DSC's being hired. \r\nPay is low"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Rewarding But Frustrating", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Mar 2016", "job_title": "Direct Support Professional in Chapel Hill, NC", "duration": "N/A", "pros": "rewarding, looks good for graduate school or on a resume", "cons": "terrible pay, disorganized, physically demanding and sometimes gross work for a tiny paycheck (toiling, showering, cutting toenails for $10/hr)"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Not bad for a non-profit", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Sept 2020", "job_title": "Behavior Support Professional in Chapel Hill, NC", "duration": "N/A", "pros": "Good people, fair admin, HR department actually cares.", "cons": "The pay is a bit low, but it IS a non-profit."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Decent Job", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 May 2020", "job_title": "Direct Support Professional in Chapel Hill, NC", "duration": "N/A", "pros": "The schedule is very flexible\r\nThere are opportunities for overtime.", "cons": "The pay for this job is low\r\nCommunication could be better."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not paid annual leave balance", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 Dec 2019", "job_title": "Direct Support Professional in Chapel Hill, NC", "duration": "N/A", "pros": "Nothing about the job had any pros....", "cons": "I had over 20 hours of annual leave balance and was never paid for it.... because I only worked for the company for eight months..... I emailed HR and they never responded!!!"}]]