[[{"date": "27 Jul 2023", "title": "Creator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at WaterAid (London, England) in Jun 2023", "Interview Descriptions": "Straightforward process with 3 stages. First screening interview was just as expected with usual questions (what excites you about this job, why WaterAid etc). This was with the hiring manager and current team member who were really friendly and made me feel at ease straight away. Following the screening I was given a problem statement and a week or so to create a presentation on an idea to generate more income for WaterAid. I was also given 7 questions in advance to prepare answers. These covered topics like how to measure innovation, experience with prototyping, what support I would need to thrive in the role. Although the presentation required quite a lot of prep, I appreciated having the time to prepare answers and having the bulk of the interview process done in one go. The final interview was with the head of department and hiring manager. Again, they were very friendly and it felt like a two-way conversation where I could really get to grips with what life at WaterAid would be like and what they were looking for. In this interview we covered a bit more about my previous experience and skills, what I might find challenging about the role.", "Interview Questions": "What excites you about this role? Why WaterAid? How do you measure innovation? Tell me about a time you guided others through the design thinking process. What does diversity equity and inclusion mean to you?"}, {"date": "25 May 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at WaterAid (London, England) in May 2023", "Interview Descriptions": "This was a temporary role for 6-8 weeks so it was an informal chat the interviewer was very pleasant and did advise I would hear that day which was a Friday as they wanted someone to start the following week. I checked my emails all day eager to know if I had work- I then chased my agency towards the end of the day only to find they were going to make a decision on the Monday now. I could understand further deliberation for a permanent role but I had to wait anxiously the whole weekend not knowing. I then had to chase this again on Monday and found out late afternoon that I didn’t get it. It was quite a junior role and I have a lot of experience so did ask for feedback as that would be helpful to me going forward to know where I went wrong. Never received any feedback. All very disappointing and I wouldn’t be encouraged to apply again in the future off the back of this sadly.", "Interview Questions": "Tell me a bit about you and your experience."}, {"date": "5 Mar 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at WaterAid", "Interview Descriptions": "It was straight forward. The women were nice. I didn’t get the job but I didn’t mind too much. The questions were your standard questions, no presentation or anything which was preferable for me.", "Interview Questions": "Why do you want the job"}, {"date": "16 Jan 2023", "title": "Projects Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at WaterAid (London, England)", "Interview Descriptions": "Applied online via website, contacted withtiny two weeks for forty to fifty minute interview online and received good feedback when i did not get role overall very good experience interviewing with wateraid", "Interview Questions": "General previous experience and situational judgement"}, {"date": "14 Feb 2023", "title": "Marketing Product Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at WaterAid (London, England) in Jan 2023", "Interview Descriptions": "I was invited for a 1-1 interview with the hiring manager. General questions were asked about my previous experience and why I wanted to join the organisation. Some of the questions caught me off-guard, for example, \"What is your super power?\" The interview was about 45 minutes. They explained that there will be a 2nd stage process, but unprofessionally ignored me in the aftermath of the interview.", "Interview Questions": "How do you gather requirements? What tools do you use?"}, {"date": "14 Sept 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at WaterAid", "Interview Descriptions": "Interview with 2 senior members. Case study given before hand and presentation in the office. Questions about past experience, why want to work at Wateraid, and what interest in the role.", "Interview Questions": "What are the key donor strategies for this client? "}, {"date": "31 Aug 2022", "title": "HR Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at WaterAid (London, England) in Aug 2022", "Interview Descriptions": "Has an assessment for 40 minuets prior to the interview then meet with senior BP & Head of HR following the interview I got the rejection email and asked if I wanted feedback.", "Interview Questions": "How do you deal with conflicting proprieties?\r\nHow do you build thoughts relationships when  you have to push back with stakeholders. "}, {"date": "2 Jul 2022", "title": "Partnerships Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at WaterAid", "Interview Descriptions": "Initially I didn’t make it through the application process but was reached out to by the hiring manager to say there had been a mistake, meaning that I had a couple of days to prepare for the interview. The interview involved around 10 questions and a presentation on a specialist area of WaterAid. Some of the questions required the same answers and were worded just a little bit differently. The interviewees seemed polite and nice, however the hiring manager turned their camera off (on both rounds) so that was a bit disconcerting when interviewing as it was hard to pick up on body language. I made it through to the second round and it was another load of questions and a task that according to the hiring manager would usually be shared prior to interview but they wanted to know a gut reaction. I answered as best as I could and then was later informed that I wasn’t chosen. I completely understand not being chosen, it’s a competitive field. What concerned me was the language and reasoning behind why I wasn’t chosen. The phrasing was “If it was a different region, it could have been a different story” this is open to a lot of interpretation and so I followed up asking for feedback. The hiring manager asked if she could share this with me after her leave, I asked if it could be done beforehand as I have other interviews lined up and would really like to learn where I can improve, I received the hiring managers out of office. It has now been a week since the hiring manager has returned from leave and just over two weeks since the interview, I’ve still not received any feedback. Considering the time and preparation they expect from a candidate to put into an interview, this is really poor form. The people who I had spoke to in interview had been working at WaterAid for 10+years, and I can’t help but believe they have forgotten what it is like to be on the other side, and just how valuable feedback is to a candidate. I later learned from a friend I have in the sector that someone has joined WaterAid recently and has been in tears daily from the pressure. So perhaps it was a blessing in disguise that I didn’t get the role!", "Interview Questions": "What does safeguarding mean to you?"}, {"date": "1 Sept 2022", "title": "Management Accountant Apprentice Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at WaterAid (London, England) in Jan 2022", "Interview Descriptions": "Application process was over 3 months long(over 2 months longer than expected) which included a telephone interview with the training provider, an excel test(including a case-study) and a video interview with two senior finance members.\r\n\r\nLong story short, I was given the job offer, however, a few days after the offer, they sent me an erroneous contract length which I disputed and then they subsequently pulled my job offer. My contract was meant to be 36 months(as mentioned in their own JD) yet they offered me a mere 18 months. They later told me that they would fix it and then offered me 30 months. I asked if it would be possible to get my full 36 months and they pulled my job offer.  \r\n\r\nI later pursued a case with ACAS since I believed there was a breach of contract, and sure enough WaterAid were ordered to give me compensation for pulling my job offer without giving me any notice despite me having already accepted the job offer. \r\n\r\nThey claim to be a \"great place to work\" yet they are unaware of  any employment laws; a truly clueless and incompetent People's Team and an equally arrogant Financial Management Team. So much for being a \"charity\". \r\n\r\nAvoid this place.", "Interview Questions": "why are you interested in this role?"}, {"date": "3 Sept 2021", "title": "PMER Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at WaterAid", "Interview Descriptions": "Two rounds, first round with line manager and HR and second round with more senior members of the team. Very standard conversational interview process.  Useful feedback was provided after the results of the interview process were shared.", "Interview Questions": "Tell us about a challenge you've experienced in your role and how you overcame it. "}], [{"date": "11 Nov 2021", "title": "Engagement & Information Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at WaterAid (London, England) in Aug 2021", "Interview Descriptions": "Very simple, they did only one round of interviews. Asked interviewees to prepare a 10-minute presentation about the ways in which we've seen other companies effectively engage supporters/partners with their community engagement efforts. Afterward, it was basic Q&A with two interviewers.", "Interview Questions": "What do you think this job role entails?"}, {"date": "6 Apr 2021", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at WaterAid", "Interview Descriptions": "Case study, speaking with the interviewers, questions about the company. Consisted of two interviewers and myself. Many questions about me and my past experience, my ways of thinking and how I would approach certain problems or situations.", "Interview Questions": "How would you approach a donor?"}, {"date": "25 Apr 2021", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at WaterAid (London, England) in Dec 2020", "Interview Descriptions": "Application form completed online followed by an invite to a video interview with a panel made up of the hiring manager and team members currently in the hr and talent team", "Interview Questions": "Why would you like to work for us?"}, {"date": "6 Jun 2023", "title": "Policy Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at WaterAid (London, England) in Jan 2020", "Interview Descriptions": "First interview with 3 - technical, supervisor and country programme rep. The interview was online, and lasted one hour. It used a format where you had to mainly answer with experiences and how those experiences were representative of a criteria on the TOR.", "Interview Questions": "How would you describe WASH sustainability?"}, {"date": "19 Jul 2019", "title": "Account Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at WaterAid", "Interview Descriptions": "One interview and there were two people interviewing - not very friendly. They had a number of questions they wanted to ask but didn’t really flow and they didn’t make an effort to try and make me feel relaxed", "Interview Questions": "Give me an example when you failed at something "}, {"date": "10 Nov 2019", "title": "Supporter Care Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at WaterAid in Mar 2019", "Interview Descriptions": "Easy online application involving CV and cover letter,  then one interview with short written test prior. Interview was by two people, both in the team, manager and officer level.", "Interview Questions": "Tell us a time when you've shown excellent customer service?"}, {"date": "21 Apr 2020", "title": "International Programmer Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at WaterAid (London, England) in Oct 2018", "Interview Descriptions": "It was a panel interview asking the standard competency questions, followed by a presentation which you give around a specific programme, then they question you around various parts of it. Human resources is also there to answer questions around other parts of the organisationa and working culture.", "Interview Questions": "What is your greatest weakness? How would your colleagues describe you?"}, {"date": "18 Jul 2018", "title": "Learning And Development Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at WaterAid (London, England)", "Interview Descriptions": "Very professional, smooth process and extremely personable. You get a good feel for the company upfront and their core values. \n\nAlthough I was not offered a job, they took time to give me constructive feedback and ensured that any  \nquestions I had were addressed in an honest and open way. This really goes to show that they care for the people they interact with and if you’ve taken the time for an interview, they will take the time to help you in any way they can, even if it isn’t a job.", "Interview Questions": "They asked questions related to the personality test taken."}, {"date": "3 Jul 2018", "title": "Engagement Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at WaterAid (London, England) in Jun 2018", "Interview Descriptions": "I submitted an application online then was invited for a 45 minute interview with a panel of 3. For the interview I had to prepare a 5 minute presentation, and submit a 30 minute session plan for them to review after the interview.\r\n\r\nThe panel were brilliant, they gave me great feedback and it was overall a very positive experience.", "Interview Questions": "Why do you want to work for WaterAid?"}, {"date": "17 Apr 2018", "title": "Events Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at WaterAid (London, England) in Apr 2018", "Interview Descriptions": "Very enjoyable relaxed interview. Started with a prioritisation task. The feedback I got was that I focused too much on my own achievements and not enough on what I achieved as part of a team.", "Interview Questions": "What experience do you have working at events?"}], [{"date": "25 Jul 2017", "title": "Events Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at WaterAid (London, England) in Jun 2017", "Interview Descriptions": "Started with 3 tasks to be completed in 30 minutes (prioritising 12 tasks and justifying your priorities later in the interview, brainstorming an event idea and drafting an email), followed by a one hour interview with two people. Mostly standard questions you'd expect (why WaterAid, why this role, strengths and weaknesses, giving examples of tasks as per the job description). Also needed to tell them why your prioritised as you did in the first task, as well as talk them through your event idea. Then gave you lots of space to ask questions and answered openly. The three tasks stressful because of the time constraint, but not too hard. The interview atmosphere was friendly and I would almost say I enjoyed it. I was invited to a further interview but was not ultimately offered the job.", "Interview Questions": "Question: describe your ideal boss"}, {"date": "8 Feb 2017", "title": "Events Projects Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at WaterAid (London, England) in Jan 2017", "Interview Descriptions": "I was left to complete a difficult prioritisation task before the interview, where I had ten items on a to-do list and I had to order them. I then had to justify my ordering to my interviewers. I was then asked questions on how I deal with people in various situations, how I manage my time, my past experience with databases etc. Also, other than explaining why I worked there, I was asked nothing on the organisation itself.", "Interview Questions": "Why WaterAid? Why this role?"}, {"date": "20 Mar 2016", "title": "Business Insight Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at WaterAid (London, England) in Mar 2016", "Interview Descriptions": "I applied online and received an email about 2 weeks later to sign up for an interview online. There was no mention anywhere of it being a phone interview, but it was only scheduled for 15 minutes. I had to call and clarify with HR that it was a phone interview. The phone screen was done by the hiring manager and it was very general questions. \r\n\r\nI was later invited for an in person interview. There was a data analysis test, short SQL test and general CV questions with the hiring manager and another analyst that lasted about 2 hours total. I was given 20 minutes for the data analysis exercise and then had to explain my findings to the interviewers. The SQL test was 5 simple queries to write. \r\n\r\nI was told I would hear back the next week and never did, despite attempts to follow up, so I assume I didn't get the job.", "Interview Questions": "What job on your CV do you think is most related to this role and why?"}, {"date": "13 Jan 2016", "title": "Policy Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at WaterAid (London, England)", "Interview Descriptions": "After a comprehensive application form, successful candidates are invited to interview. For this role there was a statistical assessment (which was done through excel) and an interview with three people. There is also a pre-interview task I was asked to write a policy brief for the director as if she were going for an interview with the economist. All three factors: the excel/data analysis, interview, and policy brief are considered when choosing an ideal candidate. \r\n\r\nDespite being unsuccessful I would apply for WaterAid again, they were kind enough to offer me comprehensive feedback on my application process. They also offer to reimburse travel expenses, which is a nice touch when a recent graduate. Everyone was kind and friendly.", "Interview Questions": "Describe the evolution of one policy change, how it came about etc. "}, {"date": "2 May 2018", "title": "Database Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at WaterAid (London, England) in Jan 2015", "Interview Descriptions": "Database entry task using Excel and basic calculations, although was not told about this prior. Followed by questions of motivation for the job, work history, long term goals. interview conducted by 2 people.", "Interview Questions": "How would you motivate your team?"}]]