[[{"date": "1 Mar 2023", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kutztown University", "Interview Descriptions": "Friendly and organized. Professional but not overwhelmingly interrogative. Compared to other schools it seems pretty standard. Less demanding than other schools I’ve interviewed at. It’s a good program so they want to make sure you can perform.", "Interview Questions": "How would you deal with behavioral issues within your classroom"}, {"date": "31 Aug 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kutztown University", "Interview Descriptions": "The hiring process took around 1-2 weeks. Applied online, and the Interview was scheduled like a week after the submission of application. The interview took around 20 minutes, with some general and behavioral questions.", "Interview Questions": "Tell me about your favorite course, and why?"}, {"date": "15 Apr 2022", "title": "Member Of Technical Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Kutztown University (Kutztown, PA) in Feb 2020", "Interview Descriptions": "Not much of an interview. You get hired after you clear a background check. They pay for it and it’s done all on the spot. Nice and easy and you make your own hours", "Interview Questions": "Not many questions. Fill out papers and make your own hours"}, {"date": "8 May 2019", "title": "Temporary Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Kutztown University", "Interview Descriptions": "Phone interview with hiring committee, then phone interview with chair of the department.  Then meeting with the dean of the college.  Then teaching demonstration.  After that you wait.  There is not much more to it than that.", "Interview Questions": "Why Kutztown University? "}, {"date": "29 Nov 2018", "title": "Shift Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Kutztown University (Kutztown, PA) in Apr 2017", "Interview Descriptions": "Asking how to handle difficult situations that may arise during a shift. Also talked about how to handle your co-workers who may not be doing what is asked of them.", "Interview Questions": "How would you handle a friend acting up or showing bad sportsmanship during a game?"}, {"date": "2 Mar 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Kutztown University (Kutztown, PA) in May 2016", "Interview Descriptions": "There really was not an interview process for me.  I was actually approached by someone who knew my grades were good and sent me to talk to the person in charge of making those types of decisions.  Since they wanted to help me out, and they knew I was a good student, I basically got the job.", "Interview Questions": "There were no difficult or unexpected questions."}, {"date": "26 Mar 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Kutztown University", "Interview Descriptions": "The interview was typical for the academic hiring process, except it was actually shorter than normal.  The interview only lasted a half a day during which I met with the Dean, Department Chairperson, search committee, and I taught a class.  I had breakfast with a department member and because I stayed late we had dinner together.", "Interview Questions": "The questions were what was expected for an academic job interview.  Nothing was unexpected."}, {"date": "17 Dec 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Kutztown University (Kutztown, PA) in Dec 2013", "Interview Descriptions": "Since the position was a type of promotion, I was informed about the position very early. I submitted my application along with my resume. The interview date was quickly scheduled. \r\nThe Interview was pleasant. It took about an hour; however, I was interviewed by the director and two associate directors of the department. That was unexpected. It started off with the interviewers presenting themselves. The leader then proceeded to talk about the position and the more about the university. \r\nThe first question was for me to introduce myself and provide a little info about my background. Some questions came up as they read through my resume. \r\nMost of the questions were what one would expect from an interview:\r\n-Are you open to diversity?\r\n-Can you multitask?\r\n-Give us an instance where you had to multitask.\r\n-Are you good with computer programs (excel, access,word, SAS, PeopleSoft, etc...)\r\n-etc...", "Interview Questions": "-What is your weakness?\r\n"}, {"date": "2 Dec 2016", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Kutztown University (Kutztown, PA) in Feb 2013", "Interview Descriptions": "Very simple and basic questions. Nice people. You get to know the staff so it's not awkward or uncomfortable. Casual attire is accepted. I enjoyed it very much. Would recommend it to anyone.", "Interview Questions": "They asked when have you ever faced diversity and conquered it."}, {"date": "8 Jul 2015", "title": "Computer Generalist (ResNet) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kutztown University (Kutztown, PA) in Mar 2012", "Interview Descriptions": "Met with the ResNet coordinator for about 10 minutes. Asked basic computer and networking questions. Checked familiarity with Windows and Mac platforms. Discussed the overall job, what would be involved at the help desk. Interview process was laid back and straight forward. Heard back within a month, to start at the beginning of the next school year.", "Interview Questions": "How would you check an IP on windows."}], [{"date": "19 May 2012", "title": "Full Time Temporary Faculty, I Year Contract Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kutztown University (Kutztown, PA) in Aug 2011", "Interview Descriptions": "Sent a package of information (which took about 3 weeks to prepare - reference letters, transcripts, and work samples) from online job posting on KU employment site. Got a response via email to check availability for interview. Met with the Associate Dean for a trip to the Diversity Office and Human Resources. Then had a short interview with the Dean (15 minutes), then a longer interview (2 hours) with a panel of faculty members (the hiring committee). Presented my work and answered specific questions about instructional techniques, assessment, and classroom management. The interview was fun and interesting, as I was well prepared and felt confident about my experience and my presentation, and our personalities all seemed to \"click.\"", "Interview Questions": "How would you engage a student who is missing classes and seems unmotivated?"}]]