[[{"date": "11 Jun 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ocean Park (Hong Kong)", "Interview Descriptions": "Apply job on their website, meet their HR, answer the questions, wait for result, prepare for further testing. Overall take about 1.5 hours around and meeting more than 1 staff", "Interview Questions": "What is your strength and weakness"}, {"date": "18 May 2023", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ocean Park", "Interview Descriptions": "30 mins interviews session regarding on personal skills and contribution to previous works. Some questions may follow-up. Some of us got type test for both chinese and english. May question about your typing speed. No cell phone is allowed", "Interview Questions": "What is your major duties on last job?"}, {"date": "11 May 2022", "title": "Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ocean Park", "Interview Descriptions": "Fill in the applcaition form first and then do  a 30 mins written test. After that there is a face to face interview around 15-20 mins asking the job experiences and others related information.", "Interview Questions": "N/A"}, {"date": "7 Feb 2022", "title": "Restaurant Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ocean Park", "Interview Descriptions": "It was fast and simple. The questions were easy and straight forward. You first enter the room and the interviewer will ask you to introduce yourself personally, what you like to do, your personality tour experience in the restaurant industry. Then, basic questions like why do you want this job. Are you comfortable in working in large teams etc.", "Interview Questions": "What did you like about ocean park?"}, {"date": "11 Jan 2022", "title": "Programmer Instructor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Ocean Park", "Interview Descriptions": "Nice experience, interviewers are friendly.  In the beginning of the interview, I was asked to do a self-introduction and explain why do I apply for the job. After that, I did a mock classroom with other interviewees.", "Interview Questions": "Please introduce your self briefly."}, {"date": "27 Feb 2022", "title": "Animal Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at Ocean Park (Hong Kong) in Jul 2021", "Interview Descriptions": "They would offer you to go to a face to face interview after application submission. You will be interviewed by your boss directly. There is only one round of interview and make sure you show your vast interest in the job during the interview.", "Interview Questions": "It was a group interview and could be divided in two parts.\r\nPart 1: Job Field Knowledge\r\nQuestions would be asked with regards to the research paper launched by the employee that was attached to the job duties. Be familiar with the articles. Also, a set of basic questions would be sent to you prior the interview, just make sure you checked out what those technical terms are.\r\nPart 2:\r\nPersonality Test. The job requires very much teamwork spirit and would ask you stories with relevance to your personal experience that showcase your interpersonal relationships."}, {"date": "5 May 2021", "title": "Assistant Summer Ride Operator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Ocean Park", "Interview Descriptions": "No prior application was needed. Just directly went to the recruitment day and told the receptionist that I wanted to apply for a summer job. Waiting in the lobby until I was called to get in the interview room.  There were 3 interviewers and two interviewers, one interviewer was hr staff and another one was the supervisor of the department which you would be working at. They asked interviewees questions one by one until all of the interviewees had answered all questions. Offer would be given immediately after the interview.", "Interview Questions": "Can you introduce yourself in English"}, {"date": "28 Apr 2021", "title": "Volunteer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ocean Park (Hong Kong) in Apr 2021", "Interview Descriptions": "Was a relaxed interview with the head of the research team. She gave a few interview questions to us in an email prior to the interview to prepare but she asked a lot of questions about the dolphins so I'd recommend doing a lot of your own research and reading in preparation for the interview.", "Interview Questions": "what was one difficult situation you have had to deal with in the past and how did you get through it without help from any one"}, {"date": "16 Sept 2020", "title": "Public Affairs Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Ocean Park", "Interview Descriptions": "need to work on the written test before one to one interview, the HR and interviewer seems nice. They ask for my past experiences and how can I contribute to this company", "Interview Questions": "basic info, your past experiences"}, {"date": "15 Jun 2022", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Ocean Park in Aug 2020", "Interview Descriptions": "It is a zoom group interview. Mostly asked about interpersonal skills and some of the questions were about some knowledge about conservation and the research study about . The atmosphere is chill.", "Interview Questions": "Q. Are you a team player\r\n"}], [{"date": "8 Jun 2019", "title": "Retail Helper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Ocean Park (Aberdeen) in Jun 2019", "Interview Descriptions": "Quick and straight-forward process following an initial registration process and position-related questions. Interviewing process proceeded in the local language of Cantonese, however not being fully fluent will not hold you back in the selecting process. The hiring process at Ocean Park is streamlined, staff are friendly and accommodating and it receptive to all types of candidates.", "Interview Questions": "Why did you select this position at Ocean Park?"}, {"date": "15 Oct 2021", "title": "Ticket Seller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Ocean Park (Hong Kong) in Jun 2019", "Interview Descriptions": "the hiring process is simple, as I applied for a front line job, the manager would ask you to give a self-introduction, and your availability. As long as you are presentable, you would pass the interview", "Interview Questions": "Introduce yourself\nWhat are your previous job experiences\nCan you withstand hot weather"}, {"date": "23 Oct 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Ocean Park (Hong Kong) in Jan 2018", "Interview Descriptions": "Did an interview with the boss and it was questions regarding the research that they are conducting.  The atmosphere was very laid back and not stressful at all.  The interviewers were very nice and introduced us around the office and helped out if someone from the panel were confused about the questions.", "Interview Questions": "Are you aware of the current research scope"}, {"date": "3 Oct 2016", "title": "Contract Aquarium Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Ocean Park (Hong Kong) in May 2014", "Interview Descriptions": "Applied online. Took 3-6 months for whole process.\r\n1st interview with senior and manager. Easy talk.\r\nWork trial for 1 day in the department. (Most important part, be cautious)\r\n2nd interview with job-related theme presentation. Behaviour question.", "Interview Questions": "Which style of management would you choose: harsh with strict rules or loose with empathy?"}]]