[[{"date": "31 Jan 2023", "title": "Contracts and Grants Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Food For The Hungry in Jan 2023", "Interview Descriptions": "Screening interview and then a panel interview with 6 individuals. Hiring manager reached out via email on a Friday afternoon to apparently \"discuss the position\". I unfortunately was on PTO and out of pocket so could not drop everything to reply on a Friday afternoon. I found time to reply on Tuesday after prioritizing my current job and by that point the offer I didn't know I had was rescinded. For Christians, they don't extend a whole lot of grace.", "Interview Questions": "Describe your faith experience and how it relates to service."}, {"date": "30 Apr 2021", "title": "Grants Position Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Food For The Hungry", "Interview Descriptions": "Overall the team seemed great as far as personalities and skill levels are concerned. They seemed to mesh very well and were very genuine people. The process was very straightforward and easy to follow. \n\nThe only issue was after spending the time interviewing and going through the process for several weeks and speaking directly to people I got an automatic rejection email. It felt somewhat cold and that there could have been more personal interaction in the email.", "Interview Questions": "3-5 minute presentation on a FH value"}, {"date": "22 Jan 2021", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Food For The Hungry", "Interview Descriptions": "Initial interview with 1 person (I believe the hiring manager) with basic questions and then a panel interview (with the hiring manager, HR, teammates, and I believe a director) with more difficult questions, including describing how you relate to one of their core mission/values", "Interview Questions": "You will be asked to give a 3 to 5-minute presentation on one of the FH values you connect with most."}, {"date": "4 Jun 2018", "title": "Regional Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Food For The Hungry (Dhaka) in Oct 2016", "Interview Descriptions": "FH Association published circular on Regional Program Manager position. I applied for the said position. I was shortlisted CVs. Invited for interview. Interview was in three processes. Written, presentation, viva-voice .", "Interview Questions": "They asked about conflict resolution, budgeting, management, leadership, logframe, planning, etc. "}, {"date": "28 Jul 2017", "title": "Donation Processor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Food For The Hungry (Phoenix, AZ) in Jun 2013", "Interview Descriptions": "Started with a phone interview with questions. Then came into the office for a panel interview with 3 current employees. They took turns asking questions. Many of the questions were thought provoking but not much different then those asked by other companies. They do look closely at  your faith and your willingness to continue to follow God's direction.", "Interview Questions": "If I could work and a computer for 8 hours straight."}, {"date": "20 May 2014", "title": "Livelihoods Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Food For The Hungry (Washington, DC) in Apr 2010", "Interview Descriptions": "Received an email requesting an interview. The first interview lasted 1 hour. Within a week I received a follow up email requesting a second interview. The second interview last about 2 hours. Both interviews were with the same individuals, but I now know that it's common for these interviews to be with different people.", "Interview Questions": "Provide two examples of how you've managed conflict in the workplace: first, with a subordinate and second, with a supervisor."}], [], [], [], [], []]