[[{"date": "28 Apr 2023", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Regions Hospital (Saint Paul, MN) in Apr 2023", "Interview Descriptions": "Applied online. Contacted via phone to set up interview. In person interview with two team members. Tour of the unit for the position completed before interview. Timely with responses and follows through with contact.", "Interview Questions": "How have you handled conflict in the workplace?"}, {"date": "3 Dec 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Regions Hospital (Saint Paul, MN) in Sept 2022", "Interview Descriptions": "Via zoom, very good experience. The nurse managers were very attentive and made it a pleasant experience. I had a life situation occur where I couldn’t take the job at the time. Definitely would have taken the job, however.", "Interview Questions": "They wanted to know my 5 year plan and how I could incorporate Regions in that plan."}, {"date": "12 Aug 2022", "title": "VP Data Science Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Regions Hospital", "Interview Descriptions": "Got the offer but it was way low what i told in the very first place. I didnt like the fact that they low balled when I was explicit about the range", "Interview Questions": "data science related questions were asked"}, {"date": "19 May 2022", "title": "Speech Language Pathologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Regions Hospital", "Interview Descriptions": "Consisted of interview questions and a tour. The interview was professional, but yet comforting and a good process. Consisted of a phone screening/interview and then an in person interview. Good process overall.", "Interview Questions": "Tell me about yourself and your professional experience."}, {"date": "7 Jan 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Regions Hospital (Saint Paul, MN)", "Interview Descriptions": "Application process user friendly. Able to monitor status of application. I received an email stating they had an interest in me and would like to set up an interview. They provided a few dates and available times for me to choose from and once I replied with my first and second choices they send me verification of my Interview date and time. Very prompt and friendly. I interviewed with two hiring managers, both friendly, and was told that I will hear back this next week following their interviews this week.", "Interview Questions": "Average questions.  Nothing unusual. Why did you decide to apply to Region’s Hospital?"}, {"date": "14 Dec 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Regions Hospital (Saint Paul, MN) in Sept 2021", "Interview Descriptions": "I was given a panel interview which gave me the opportunity to talk to specific unit managers and see if they thought I'd be a good fit and vice versa.", "Interview Questions": "What is one weakness and one strength you have?"}, {"date": "11 Jan 2021", "title": "Staff RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Regions Hospital (Saint Paul, MN) in Aug 2020", "Interview Descriptions": "I suppose like everyone else, they use behavioral questions, asking for a specific experience.  I find these questions difficult to answer, and frankly short-sighted.  I have thousands of patient experiences, why not a more generalized, how would you handle this situation \"question\"?", "Interview Questions": "They wanted one specific example for each question."}, {"date": "15 Jul 2020", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Regions Hospital (Saint Paul, MN) in Jul 2020", "Interview Descriptions": "Started with a phone interview, and then an in-person interview to meet the rest of the team. Everyone was extremely nice and it the interview feel like a conversation. You could tell that they genuinely care about getting to know their candidates.", "Interview Questions": "Why do you want to work here? Why this position? A lot of behavioral questions! "}, {"date": "22 Oct 2020", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Regions Hospital (Saint Paul, MN) in Nov 2019", "Interview Descriptions": "Applied online via PCA pipeline. Phone interview with HR. Asked 3 questions. One about strengths, weaknesses, and where do I see myself in 5 years. Then HR told me where they thought I would be a good fit and set up an in person interview for that unit.", "Interview Questions": "How would you handle working with a patient who had different goals of beliefs than yourself?"}, {"date": "20 Mar 2019", "title": "Emergency Room Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Regions Hospital", "Interview Descriptions": "They asked a number of behavioral questions and gave a tour of the ED. I was interviewed by two nurse managers and it was a low key environment. They wanted to know logistical things such as a potential start date, but also asked questions to assess personality and fit with the company.", "Interview Questions": "This job can be stressful-what are things that you do to help yourself relax in a stressful situation?"}], [{"date": "16 Feb 2019", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Regions Hospital (Saint Paul, MN) in Feb 2019", "Interview Descriptions": "1- 20 minute phone interview turned immediately into a 2nd in- person interview on the floor I applied to. The in- person interview was with the director,  the head nurse and then with a PCT that has worked there for nearly 20 years.", "Interview Questions": "Why do you want to work here?"}, {"date": "19 Sept 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Regions Hospital", "Interview Descriptions": "Meet with multiple staff members. They hire about 10 interns who are current students at the hospital. Students get hired in Fall. The staff meet together to decide who gets the job.", "Interview Questions": "Why should I hire you?"}, {"date": "11 Nov 2017", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Regions Hospital", "Interview Descriptions": "The interview process was quick and easy and professional courteous informational and personable the manager staff that was present at the time when I was interviewed was very Fair and accommodating to those who have children", "Interview Questions": "Some questions were can you work under stress and pressure also can you describe your attendance"}, {"date": "2 May 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Regions Hospital (Saint Paul, MN) in Apr 2017", "Interview Descriptions": "I applied for the position, waited about four weeks and was contacted for a math quiz and personality assessment online. Two weeks later I was contacted for an interview that was scheduled for the next day. Two business days later I received notification from HR that they chose another applicant. Interview questions were all behavioral questions, but they were not the standard questions. Their HR department recently revamped their interview questions and they were very different from questions I had been asked before. I was interviewed by a nurse manager of the unit as well as their unit education nurse.", "Interview Questions": "Tell me about a time you were part of a group where you felt inferior to others in the group and how you handled that situation."}, {"date": "9 Jan 2019", "title": "Special Events Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Regions Hospital (Saint Paul, MN) in Apr 2017", "Interview Descriptions": "At first I did not get a call back after applying. I followed up when I saw the position was still open and HR set me up with an interview. I had three phone interviews because I was applying from out of state.", "Interview Questions": "Describe a time you had to problem solve"}, {"date": "19 Nov 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Regions Hospital (Saint Paul, MN) in Apr 2017", "Interview Descriptions": "Great interview process, sat down with two managers and they were extremely kind and inviting. Made it all the more enticing to gain employment with the organization. After the interview I received follow up from the department nurse educator and various emails from both managers regarding the interview and next steps I should expect. All of it was a very good and organized process.", "Interview Questions": "What were my weaknesses?"}, {"date": "15 May 2020", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Regions Hospital (Saint Paul, MN) in Oct 2016", "Interview Descriptions": "Excellent talent management team. Behavioral interview-based. Be prepared to answer the situation, how you addressed it, results and what would you do differently in the future. Be prepared. People here are smart and they will ask questions to really get to know you and your experience.", "Interview Questions": "Tell us about your technical expertise?"}, {"date": "27 Feb 2016", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Regions Hospital in Jan 2016", "Interview Descriptions": "Phone interview with HR was usual sort if screening.  I was told I'd meet with a couple people, but it was a panel interview with NINE staff members for a part time entry level position. Nice people, but this was scary!", "Interview Questions": "All questions were behavioral questions requiring an example."}, {"date": "11 Mar 2015", "title": "Nurse Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Regions Hospital", "Interview Descriptions": "Long, unorganized and the people were not friendly. Average salary offer, good benefits and new building. The atmosphere was cold and not inviting. A very false feeling was the impression I got. The offer was decent but, nothing to get excited about. The new part of the building seemed nice.", "Interview Questions": "Where was your last job"}, {"date": "26 Aug 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Regions Hospital (Saint Paul, MN) in Oct 2014", "Interview Descriptions": "Applied online. Did assessment online called for interview with in 2 days. Completed phone interview then 1:1 in person interview. Interview was comfortable casual and not intimidating. Interview was on the specific unit I applied for and was offered the position the following day.", "Interview Questions": "Where are you looking to be in your career in the next 5 years"}], [{"date": "15 Jul 2015", "title": "Recruitment Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Regions Hospital (Saint Paul, MN) in Sept 2014", "Interview Descriptions": "I had an introductery phone interview where the recruiter explained the position thoroughly, asked a variety of questions and allowed me to ask questions. From there, I was invited to come on-site for a panel interview with the team, then a one-on-one interview with the manager.", "Interview Questions": "It was a lot of behavioral based questions"}, {"date": "8 Oct 2015", "title": "Nutrition Services Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Regions Hospital (Saint Paul, MN) in Jul 2014", "Interview Descriptions": "Open ended and questions in regards to past experiences that I have had that can relate or be beneficial in the position I am interviewing for. There were two people interviewing me asking questions and giving informative responses.", "Interview Questions": "Do you have any experience in nutrition?"}, {"date": "7 Mar 2014", "title": "Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Regions Hospital", "Interview Descriptions": "Very positive experience.  The recruiter was knowledgable and kept me informed.  Met with a panel of peers.", "Interview Questions": "Can't recall.  But thy wanted specific examples of situations I've handled."}, {"date": "25 Mar 2014", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Regions Hospital in Mar 2014", "Interview Descriptions": "Initial communication\r\n- Applied online\r\n- Received a confirmation that the application was received\r\n- Received call from HR two days after applying to schedule an interview. HR asked about salary expectation. HR sent an email to confirm interview time, date, and names of interviewers.\r\n\r\nPlanning\r\n- One hour was planned for the interview. The interview did not last the entire hour. \r\n\r\nNumber of interviews\r\n- One interview with the Supervisor and Manager of the Department\r\n\r\nPerception of the people, office, and work culture\r\nThe people are great. From the first call from HR to the interview to the offer all personnel was great to work with. The culture is very much open to new ideas and easy to get a long with. Everyone that I've met so far has been great and optimistic. Management so far have been supportive and eager to have new hires on board. There are a mix of employees who have been there for a long time to those who are fairly new. Even in management there are people who have been with the organization for years and years to those those who have only been there a few months to a few years. There is a lot of emphasis on teamwork and communication.", "Interview Questions": "Basic questions. No \"hard\" questions. The questions were more to gauge your thought process and approach to problem solving and teamwork. I suggest to really try to show them who you are and how your personal experiences can work with the current team. Use examples."}, {"date": "26 Aug 2013", "title": "Interpreter Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Regions Hospital (Saint Paul, MN) in Aug 2013", "Interview Descriptions": "During the summer, the director was on PTO so the processed took longer than normal. One month total.", "Interview Questions": "Tell me about a time when you went against convention and helped other think outside the box. "}, {"date": "12 Jun 2010", "title": "Manager Workforce Planning Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Regions Hospital (Saint Paul, MN) in May 2008", "Interview Descriptions": "Multiple interviews.  First with HR Generalist by phone. 2nd interview with Director HR. 3rd Interview with Co workers - 4 HR Managers. Next round of interviews: CNO and DONs", "Interview Questions": "Information about  current nursing shortaage and how to solve it."}]]