[[{"date": "7 Dec 2022", "title": "Bookseller and Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Long Beach City College", "Interview Descriptions": "You're greeted by the store managers and they ask you a few questions about leadership. They give some insight to how it is working on a day-to-day basis as well as ensure you know what your salary will be. Very transparent process.", "Interview Questions": "What was one time you demonstrated leadership?"}, {"date": "28 Oct 2022", "title": "Technical Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Long Beach City College in Aug 2022", "Interview Descriptions": "Applied online via Government jobs and was invited for interview via Zoom a few weeks later. A panel conducted the interview lasted about 30 minutes. Was asked multiple questions. Was placed in a eligibility list.", "Interview Questions": "Describe your experience and education?"}, {"date": "3 Feb 2023", "title": "Part Time Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Long Beach City College (Long Beach, CA) in Sept 2021", "Interview Descriptions": "The interview process for the Part Time Counselor position was quick and easy if you're familiar with community college counseling. Like most interviews, there are scenario questions to see how you'd handle a situation - get you to think on your feet and questions that reveal your emotional intelligence.", "Interview Questions": "Q; What makes a good Counselor Q; Tell me about a time you worked with a difficult student Q; Tell me about a time you had to advocate for a student"}, {"date": "2 Jun 2018", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Long Beach City College", "Interview Descriptions": "In total there were about 8-10 questions, but the questions are also written on a paper that is given to you. You will also be asked follow-up questions based on your responses.", "Interview Questions": "N/A"}, {"date": "25 Apr 2017", "title": "Deputy Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Long Beach City College (Long Beach, CA) in Feb 2017", "Interview Descriptions": "Answered and submitted a few supplemental questions online mid-December 2016. Was notified via email one month later that I was the #1 candidate. Was then to attend interview mid-February 2017. They ask the same questions from the application given online. The panel seemed stiff and had no enthusiasm. It was difficult to be myself because I had a lot of energy and motivation in the interview. I followed up 3 weeks later with HR and no response. It took them a month to respond via email saying my skills were great, but they were going to re-post the job online and if I want to be considered for employment, I had to reapply again. Right when I was going to reapply 3 days later, the job opening was gone in the beginning of April 2017.", "Interview Questions": "Please describe your work experience and education as it pertains to the Deputy Director of\r\nWeb and Mobile Services."}, {"date": "11 Apr 2017", "title": "Graphic Design Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Long Beach City College (Long Beach, CA) in Feb 2017", "Interview Descriptions": "You had to fill out an application online complete with transcripts. It took 2 months for someone to email me back. Then scheduled an interview with a panel. Didn't look at my portfolio.", "Interview Questions": "Had a set of general questions that they asked all applicants."}, {"date": "12 Jan 2017", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Long Beach City College (Long Beach, CA)", "Interview Descriptions": "Filed application with HR\nReceived telephone communication to schedule interview \nArrived 1 hour prior to face-to-face to preview questions and complete a writing assignment \nEscorted to conference room and introduced to the 8 person panel\nCompleted a teaching demonstration\nResponded to questions read by each member of the panel\nWas asked if I had any questions for them \nWas informed of the next step in the process and was escorted out of the room", "Interview Questions": "What is your philosophy on teaching?"}, {"date": "13 Aug 2016", "title": "Student Achievement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Long Beach City College (Long Beach, CA) in Jul 2016", "Interview Descriptions": "After submitting an application they call you in for an interview. It's a moderately easy interview process. They day of you show up to location and the two managers have a copy of the questions ready for you as wait in the lobby. This is the first time in which they allow you to review the questions prior to the interview. Also, the same copy is taped down to the desk for your perusal during the interview. During the interview everyone is very nice and supporting. The panel wants you to succeed. They're looking to see if you are confident, positive and an approachable person. I feel that you either had to say something very stupid or be a poorly prepared for them to not offer you the internship. Questions we're typically behavioral based dealing with potential situations with students that may arise. Just use the STAR method and be familiar with your role as a coach let your personality shine through and you'll be successful. If you are selected you'll hear back within a week.", "Interview Questions": "What does being a coach mean to you?"}, {"date": "13 Jun 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Long Beach City College", "Interview Descriptions": "I applied online submitting my typing certificate and received an email for the testing date for approx two weeks later.  It was a written test consisting of these areas:  alphabetizing, word problems, reading and writing, some Word and Excel questions and situational questions which were awkwardly worded.  I received an email that my score wasn't high enough to proceed to the next step so that was that.  It would be nice to know what the minimum acceptable score was or if it was based on highest percentile scorers.", "Interview Questions": "N/A"}, {"date": "28 Jun 2019", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Long Beach City College (Long Beach, CA) in Jun 2016", "Interview Descriptions": "It was a group interview. We arrived at the tutoring center and used one of the study rooms for the interview. The 2 coordinators in charge of the tutoring centers conducted the interview. There were about 3 other students interviewing there as well.", "Interview Questions": "How would you tutor a student who is feeling unmotivated? "}], [{"date": "23 Apr 2016", "title": "Matriculation Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Long Beach City College (Long Beach, CA) in Mar 2016", "Interview Descriptions": "I applied online, and attended 2 interviews following a written exam that tested for basic clerical skills. Both interviews are recorded and the process was thorough. I was notified through email for the first interview, and called for the second. The interviews are not daunting, but do emphasize a background in working in the higher education system, so do keep that in mind.", "Interview Questions": "Experience working with diverse groups of people"}, {"date": "11 Mar 2020", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Long Beach City College (Long Beach, CA) in Jan 2016", "Interview Descriptions": "The interview was an easy one so there is no need to be nervous. They check your math skills and ask you questions on how you may deal with a difficult student or one who is having a hard time grasping concepts, all of which are things you pretty much have to do regularly.", "Interview Questions": "Why do you want to be a tutor"}, {"date": "22 Apr 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Long Beach City College (Long Beach, CA) in Sept 2015", "Interview Descriptions": "The hiring manager was very kind and welcoming.  I was nervous getting into the interview but the two hiring managers made me feel super comfortable. They asked very basic questions that anyone could answer.  They seemed genuinely caring and polite.  I felt like they were making sure I had a decent head on my shoulders and was capable of handling a stressful situation.", "Interview Questions": "Tell us about some of your accomplishments? "}, {"date": "14 Dec 2015", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Long Beach City College (Long Beach, CA) in Jun 2015", "Interview Descriptions": "It was brief and I was asked about my skills and weaknesses. It was very straight forward. I was interviewed by my current supervisor and the previous marketing Intern. They were polite and it was in a small office environment.", "Interview Questions": "My weakness"}, {"date": "27 Mar 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Long Beach City College (Long Beach, CA) in Mar 2015", "Interview Descriptions": "Sent typing certification.\r\nApplied online. \r\nTook test got 80% no interview. Person has to score 94%. Other parts of the government it's 70%.\r\n\r\nTest is based on knowing word, excel, simple math, and customer service (trick questions). The test was poorly written. Other parts of the government the test would be written 100% better. \r\n\r\nProbably hired an insider. All of this is smoke and mirrors. Don't bother unless you think your going to get 90 percentile or 100% just for admin job.", "Interview Questions": "N/A"}, {"date": "29 Jan 2016", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Long Beach City College (Long Beach, CA) in Jan 2015", "Interview Descriptions": "Online application and replied to within a month.\r\nMade appointment for interview via email. \r\nInterview takes 30 minutes.\r\nFriendly and simple.\r\nYou should prepare yourself by coming up with answers to simple interview questions like \"why should we hire you?\" or \"How will you help our team?\"\r\nHave a great attitude and smile!", "Interview Questions": "Why do you want to work here?"}, {"date": "12 Sept 2014", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Long Beach City College", "Interview Descriptions": "Ask about previous experiences tutoring, how might you approach x topic, what would you do if a student does not understand material, how may you facilitate a group, what are important skills a tutor needs, and any experience with higher education or simply tutoring", "Interview Questions": "How would you facilitate a group in 15 minutes with materials that may range from sociology, art, photo, or culinary. students have different levels of learning so how may i accommodate for the group"}, {"date": "29 Jun 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Long Beach City College (Long Beach, CA)", "Interview Descriptions": "For adjuncts, we had an application.  When I tried for a tenure track line, the competition was great, and there were many hard questions.  Also, we always have a \"pretend\" lecture for 10-20 minutes.  For an adjunct part time job, we just showed up.  Most times, I have got in when we needed a last-minute opening.", "Interview Questions": "Can you work tomorrow morning?  Help!"}, {"date": "9 Aug 2017", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Long Beach City College (Long Beach, CA) in Jan 2014", "Interview Descriptions": "The interview was straight forward. I was interviewed by the department chair and another full time faculty member.   You are required to do a teaching demonstration based on a topic given before hand.", "Interview Questions": "How would you respond to as student who asked you a question you didn't know the answer to?"}, {"date": "21 Feb 2017", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Long Beach City College (Long Beach, CA) in Apr 2013", "Interview Descriptions": "Tedious - supposed to be fair - but once you're hired you can tell it gets rigged!  The Senior Manager even get people they know to apply - so that there are only so many spots for \"real\" candidates", "Interview Questions": "Don't recall - the questions were so specific - you'd have to already work in the department to know the right answer."}], [{"date": "25 Oct 2015", "title": "Supplemental Instruction Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Long Beach City College (Long Beach, CA) in Oct 2011", "Interview Descriptions": "The hiring process was fairly simple. You can just go into the supplemental instruction leaders main office and ask for an interview after filling out the online application. simple easy and quick process. as long as you passed the classes you are trying to SI for with an A you should get the possession.", "Interview Questions": "Did you get an A in your class."}, {"date": "23 Jul 2014", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Long Beach City College (Long Beach, CA) in Apr 2011", "Interview Descriptions": "The hiring process was simple. They asked me to come in, and asked me if I wanted the job from my experience from volunteering.  I was overjoyed that they asked me and answered a few questions they had after the interview.", "Interview Questions": "Not that I can remember."}, {"date": "18 Apr 2014", "title": "Supplemental Instruction Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Long Beach City College (Long Beach, CA) in Jan 2010", "Interview Descriptions": "If you get a professor to recommend you for their class, you're basically in. I didn't even interview.  Although you have to get at least a B in the class you're trying to instruct.", "Interview Questions": "There were no questions. "}]]