[[{"date": "16 Dec 2022", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at HCA Florida Memorial Hospital​", "Interview Descriptions": "You sat down with the manager of the unit and they were very cordial. They work with you to find a date and time to interview and identify the things you're seeking from this job and what you hope to achieve at their hospital.", "Interview Questions": "What drew you to applying to this hospital? What do you hope to achieve from this position? What is one strength and weakness that you have?"}, {"date": "13 Jul 2021", "title": "Mental Health Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at HCA Florida Memorial Hospital​ in Jul 2021", "Interview Descriptions": "Great friendly interview process, the supervisor was down to earth and gave me a lot of information about the job. Questions were pretty regular, such as what are your go to interventions, etc.", "Interview Questions": "What are your go to interventions?\nWhen was a time you went above and beyond at the job?"}, {"date": "2 May 2021", "title": "Nurse Residency Program Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HCA Florida Memorial Hospital​ (Jacksonville, FL) in Apr 2021", "Interview Descriptions": "Friendly staff. They make you feel welcomed. The process didn’t feel as stressful because it was like I was having a conversation with the staff versus Sitting in front of a review board.", "Interview Questions": "Why do you want to work for memorial"}, {"date": "19 Oct 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HCA Florida Memorial Hospital​ (Jacksonville, FL) in Oct 2020", "Interview Descriptions": "It was normal interview process where I was interviewed in person. Two individuals interviewed me in which it did not take long. The questions fairly generic, and you could do very well if you study beforehand for a little.", "Interview Questions": "How does your work ethic differ from others?"}, {"date": "25 Sept 2018", "title": "Registrar ER Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HCA Florida Memorial Hospital​ (Jacksonville, FL) in Sept 2018", "Interview Descriptions": "I applied online and was contacted to schedule a phone interview via email. After completing the phone interview I received a call a week later to schedule a face-to-face interview. The interview lasted approximately 45 minutes and was asked two pages of behavioral interview questions from a Team Lead and a Trainer. I was told the director was out of town and that they would be making job offers the next week (during Hurricane Florence-so I expected it to take a little longer). \n\nI felt the interview went really well and was told they were going to be hiring at least 12 people. I emphasized that the job was something I really wanted and prepared for it accordingly. I had been hired under a contract position that was to be starting the following week so I decided to cancel the contract before I started it as to not wasted anyone's time. I am now unemployed and really hoping that HR just takes awhile to make their decisions.", "Interview Questions": "Why should we chose you over another candidate?"}, {"date": "30 May 2019", "title": "IT Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at HCA Florida Memorial Hospital​ (Jacksonville, FL) in Jan 2018", "Interview Descriptions": "Easy to connect with the hiring manager. Questions were basic and not over the top. Expectations were managed prior to walking in. An overall great experience. If I had to recommend this to a friend, I would most definitely suggest them.", "Interview Questions": "What is one thing you would improve about yourself?"}, {"date": "21 Sept 2017", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at HCA Florida Memorial Hospital​ (Houston, TX) in Jul 2017", "Interview Descriptions": "The interview process was fairly standard. First interview was a phone screen with a recruiter, the second interview  was a phone screen with a manager and the third interview was an in-person interview with the manager.  The people were nice and the dialog was good.  The reason for the negative experience rating is due to the length of time between the interviews.  The overall process was 3 months from first interview to getting the final answer on the position.   They selected an internal candidate and took 3 1/2 weeks from the in-person interview to reaching out with the decision (only after following up)", "Interview Questions": "Asked technical knowledge of project management and how situations were handled."}, {"date": "29 Aug 2016", "title": "Patient Sitter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at HCA Florida Memorial Hospital​ (Jacksonville, FL) in Aug 2016", "Interview Descriptions": "The Interview lasted for about 10-15 minutes. I was interviewed by two ladies and they asked generic questions. One of them also took me on a tour around the hospital. This hospital has 107 beds, but very nice, as well as very nice people. They said that I would hear something back within a week", "Interview Questions": "Tell me about yourself"}, {"date": "4 Jun 2016", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at HCA Florida Memorial Hospital​", "Interview Descriptions": "I applied online through their website. I then received an email to schedule a selected time for a phone interview for the desired position. I then received a confirmation and reminder email for my scheduled phone interview.", "Interview Questions": "Give an example of a conflict you encountered with a coworker and how did you handle it?"}, {"date": "21 Oct 2016", "title": "Critical Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at HCA Florida Memorial Hospital​ (Jacksonville, FL) in Jun 2016", "Interview Descriptions": "I was interviewed initially over the phone by a representative from HR and then had an in person interview with the nurse manager of the unit and the director of the unit. A drug screening was performed through HR a few days later and I also had to have a tb skin test done by employee health prior to orientation as well.", "Interview Questions": "What are some of your five year goals?\r\n\r\nWhat is your previous experience in this field?\r\n\r\nAre you able to work night shift?\r\n\r\nWhat makes you a better choice compared to others that have applied?"}], [{"date": "17 May 2015", "title": "CVICU Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at HCA Florida Memorial Hospital​ (Jacksonville, FL) in Mar 2015", "Interview Descriptions": "A bunch of bs telling me how everyone that is currently employed there sucks. I was told my goal was to \"get rid of old trash\" as far as other nurses. And that I was needed to accomplish this. I interviewed for a staff position and they only gave me a charge position. How ever, I am incompetent in this job so I just review charts and drink coffee all night.", "Interview Questions": "Generic interview questions asked"}, {"date": "30 Aug 2014", "title": "Pct Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at HCA Florida Memorial Hospital​", "Interview Descriptions": "I interviewed with a manager I knew from a previous job at another hospital. After the Interview I was told I had the job and to expect HR to contact me to proceed with the hiring process. It has now been over a month both myself and interviewing manager have made multiple attempts to contact HR. At this point I have found alternative work, this HR department is extremely lacking and unprofessional.", "Interview Questions": "If I could be any animal what would it be and why...."}, {"date": "23 Jun 2014", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at HCA Florida Memorial Hospital​", "Interview Descriptions": "Initial communication was over 4 weeks from the time my application was submitted. My interactions with employees at this facility were unprofessional at best. No return phone calls. Communication was very intermittent.", "Interview Questions": "N/A"}, {"date": "22 Nov 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at HCA Florida Memorial Hospital​ (Jacksonville, FL) in Oct 2013", "Interview Descriptions": "Applied online. Lengthy multiple choice personality profile questionnaire. Phone call from HR about a week later to schedule in person interview with Director, which went about an hour and a half, because we got along well & enjoyed a very pleasant conversation.", "Interview Questions": "What kind of Case Mgt or Utilization Review experience do you have?"}, {"date": "31 Jul 2013", "title": "Patient Advocate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at HCA Florida Memorial Hospital​ (Jacksonville, FL)", "Interview Descriptions": "Human resources does not return phone calls ever. You have to continuously direct dial multiple times a day in order to get a \"live\" person on the phone. When you do finally get the opportunity to speak with someone, the standard response is \"I don't know the status of your application. We are short staffed and will have to get back with you.\" They never do. After 9 weeks someone called to schedule an interview. I politely informed them I've found other employment since their process was tragically broken and entirely way to long. People are looking for jobs to begin the application process in a professional amount of time. It was quite insulting. If they treat prospective employees in this manner, I can't imagine how they treat their current employees. Scary.", "Interview Questions": "N/A"}]]