[[{"date": "14 Apr 2023", "title": "Art Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mary Washington Healthcare", "Interview Descriptions": "There were two rounds of interviews- a one-on-one with immediate supervisor and a panel with multiple members of the department, including department head, all completed on the phone or Microsoft teams.", "Interview Questions": "The questions weren’t too difficult. It was fairly casual. Tell us why you’re a good fit kind of thing."}, {"date": "31 Aug 2022", "title": "Nurse Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mary Washington Healthcare (Fredericksburg, VA) in Jul 2022", "Interview Descriptions": "Nearly an entire day of the interview process consisting of multiple panels. Each panel represented a level of leadership then peers and departmental board. It was well planned out, including an itinerary prior to arrival.", "Interview Questions": "How do you handle adversity among doctors and staff?"}, {"date": "29 Jan 2022", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mary Washington Healthcare", "Interview Descriptions": "Two meetings with interview questions. Met with doctor and current nurse.  Scenario-type questions were asked. Was given a tour of facility and was able to meet the rest of the staff.  Was offered the position.", "Interview Questions": "How would you handle certain situations."}, {"date": "25 Apr 2022", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mary Washington Healthcare (Fredericksburg, VA) in Jan 2022", "Interview Descriptions": "Very thorough interviewing process. It was organized and allowed for me to get a glimpse of what working with the organization would be like. After a swing questions I was able to take a tour as well as ask any questions that I had.", "Interview Questions": "Questions regarding Communication with the operating room"}, {"date": "10 Sept 2019", "title": "Registrar Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mary Washington Healthcare (Stafford, VA) in Sept 2019", "Interview Descriptions": "I applied two to three weeks before they called me in for interview . They interviewed me for at least an hour. It was the head manager and the Supervisor and they took turns asking me questions. They told me all about their company and how I felt about different scenarios.", "Interview Questions": "What are some weaknesses"}, {"date": "3 Nov 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mary Washington Healthcare (Fredericksburg, VA) in Sept 2019", "Interview Descriptions": "Submitted my application, got a phone call from the Practice Director whom was super flexible in scheduling the interview. The Practice Director let me know at the end of the interview that he wanted to put in to hire me with the HR Department and they would be in touch with an offer letter.", "Interview Questions": "Give me an example of a time where the schedule went out the window and began to get chaotic? How did you react, handle it, and feel afterward?"}, {"date": "21 Jul 2019", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Mary Washington Healthcare (Fredericksburg, VA)", "Interview Descriptions": "The candidate interviews with several managers to ensure a good fit into the culture of the hospital.  Questions regarding real life scenarios were asked to see problem-solving skills and clinical knowledge.  Since the job I was applying for was home health others questions involving subjects such as team work, working solo in homes and being comfortable with communicating remotely were asked.  Questions were relevant and on target, but not cookie cutter and typical.", "Interview Questions": "Describe a difficulty you have had with a patient and how did you handle it?"}, {"date": "14 Mar 2019", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mary Washington Healthcare in Feb 2019", "Interview Descriptions": "I had a phone interview. There were 4 people on the phone and they were all added in. The quality of the call was poor; however, the interviewees were extremely nice. They asked some difficult questions that were off the wall but overall the experience was pleasant.", "Interview Questions": "Name a time where you did something you didn't have to do. What was it, why did you do it, and what were the rewards. "}, {"date": "26 Dec 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mary Washington Healthcare (New York, NY)", "Interview Descriptions": "I was first contacted by the hiring manager. After a brief discussion of my credentials, HR scheduled an in person interview. I am out of state, but they wanted me to make it the following week, so I did. As soon as I got there, other managers, who would be my peers, were waiting. I interviewed with them for about 2 hours. After that, interviewed with the MDs and 3 subordinates. Everything went well. One supervisor, who thought she had it all together, asked an inappropriate question, trying to figure out how old I was. I fully believe there was age discrimination at play as I have a young appearance. It obviously made them feel uncomfortable that I have a higher degree, more experience, and am somehow younger than them.  Never thought  being an over achiever would be a bad  thing. Thehiring manager acted as if I had the job, disclosing some very personal details. To top it off, I was assured I'd be reimbursed for the travel expenses (plane, car rental) and basically had to beg HR for the reimbursement. Over 2 months went by before I received the check... Crazy, right?! In the end, I am over qualified for the position, so everything works out  :)", "Interview Questions": "Very basic questions... tell me about a time you resolved a conflict, etc."}, {"date": "30 Oct 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mary Washington Healthcare", "Interview Descriptions": "Initial phone call - brief and to the point - are you qualified?\r\nFace to face - With Director, fellow managers, direct reports\r\nEverybody was extremely helpful and welcoming. \r\nFollow up - lengthy process.", "Interview Questions": "Conflict management questions primarily. "}], [{"date": "1 Dec 2018", "title": "Transport Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mary Washington Healthcare in Jul 2018", "Interview Descriptions": "Took forever to hear back from the manager. Nearly a month later, then another month until I was actually working. I wish they could have kept me updated on the process or let me know how long it would take and all of the subsequent procedures.", "Interview Questions": "What was a time when you saw something wrong and fixed it?"}, {"date": "29 Jul 2020", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mary Washington Healthcare (Fredericksburg, VA) in Jun 2018", "Interview Descriptions": "The process was smooth but long. It took two weeks for HR to contact with job offer after manager told me I got the job. I had to call back multiple times before HR. The manager said she had to make a spot available for me .", "Interview Questions": "What makes you the best candidate for the job "}, {"date": "18 Oct 2017", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Mary Washington Healthcare", "Interview Descriptions": "Interview process was easy and very laid back. The admins are very professional easy going people. Was initially interviewed by one admin then was interviewed by a second. Both were very nice and easy to talk to.", "Interview Questions": "Describe an incident where you had to deal with a disgruntle coworker or patient"}, {"date": "8 Jun 2017", "title": "Mental Health Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mary Washington Healthcare (Fredericksburg, VA)", "Interview Descriptions": "I met with 2 supervisors, face to face, and they went over specific scenarios.  I was asked how I would react to each of these and to give an example of when I actually had to do something similar.  They were patient and gave you a chance to process the information before expecting an answer.", "Interview Questions": "Explain a time when you or a coworker did something to reflect poorly on the company, how did you fix this situation?"}, {"date": "27 Sept 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mary Washington Healthcare (Fredericksburg, VA) in Apr 2017", "Interview Descriptions": "they called me over the phone and then invited me into the place. i just answered my past experience and they were eager to hire me. they called the next day after i placed my application, it was a very fast process.", "Interview Questions": "they only asked me what my experience was"}, {"date": "20 Jul 2016", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mary Washington Healthcare (Fredericksburg, VA)", "Interview Descriptions": "Online application, phone call for interview a few days later and interview scheduled about a week later. In person interview with director and manager. Standard interview questions given by HR. Friendly and easy going, open about the HR process taking some time.", "Interview Questions": "How do you manage unexpected changes in your schedule?"}, {"date": "6 Aug 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Mary Washington Healthcare in Mar 2016", "Interview Descriptions": "It was very simple. I met with the manager and another staff member(cna). First the manager asked me the questions she thought that were appropriate for the position. She also gave the other staff the chance to ask questions she thought were important.", "Interview Questions": "If there is a patient that was becoming angry or aggravated, how would you handle the situation?"}, {"date": "25 Jul 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Mary Washington Healthcare (Fredericksburg, VA) in Mar 2016", "Interview Descriptions": "I received a call to come in for an interview that was set up the following day. The initial interview was mainly general HR questions. I was called back the next day to come in for a second interview with 2 others. I came in and that was more of a laid back, get to know me, kind of interview which was nice. There was no pressure or intimidation at all.", "Interview Questions": "How have you handled distraught customers or patients in the past?"}, {"date": "28 Jun 2016", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mary Washington Healthcare (Fredericksburg, VA) in Dec 2015", "Interview Descriptions": "Finished my application at 1:30PM on a Thursday. Received a call for an interview by 10:00 AM on Friday with an interview for the following Monday. Given an offer on Wednesday and sealed the deal on Friday.", "Interview Questions": "Sought my level of experience. No specific questions of note but rather ensuring I was the right for for the position."}, {"date": "24 Oct 2015", "title": "Prn Cna Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mary Washington Healthcare", "Interview Descriptions": "Very quick and easy! Applied for a job on Wednesday night, got called for an interview on Friday morning! The interview was relatively easy. I interviewed with the unit manager and she was wonderful! There is a mandatory one week orientation to be aware of once you accept the offer.", "Interview Questions": "How do you think you would handle a patient being rude to you/ calling you names?"}], [{"date": "11 May 2018", "title": "Team Lead - Telemetry Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mary Washington Healthcare (Fredericksburg, VA) in Apr 2015", "Interview Descriptions": "Interview process is fairly simple.  Phone interview followed up by in office interview with the manager and director for the department.  We met in an office and went over some questions. Contacted by HR with  offer letter.", "Interview Questions": "What are some expectations you have of your team and yourself?"}, {"date": "12 Aug 2014", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at Mary Washington Healthcare", "Interview Descriptions": "I was hired before all of the strange questions were asked. I was called and talked to the manager and she contacted HR and I got hired withing a couple of weeks.", "Interview Questions": "I have had only interviews looking for other jobs in house the most ridiculous was Why do I want to work for Mary Washington Hospital, and What is the worst thing about myself.  "}, {"date": "24 Apr 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Mary Washington Healthcare", "Interview Descriptions": "They never called me back. I sent them required information. 3 weeks later I called, then got a call back from someone different who didn't know who I was, then I said I would look elsewhere. I finally got a call back after I said I was going to look at another hospital. This should have been my first clue something was wrong with this company.", "Interview Questions": "Why do you want to work for Medicorp. This is a ridiculous question to ask a nurse. Duh."}, {"date": "5 Mar 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Mary Washington Healthcare", "Interview Descriptions": "Be prepared to tell them what you will provide for them as an employer in the way of customer service, skills, background.", "Interview Questions": "What do you dislike most about yourself?"}, {"date": "13 Oct 2016", "title": "Clerical/Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mary Washington Healthcare (Fredericksburg, VA) in Aug 2013", "Interview Descriptions": "I was interviewed by two managers in the department.  They were both professional, not too intimidating and asked the typical questions.  They mainly wanted to know what exactly I did in my prior healthcare experience and how many years I had been in the profession.", "Interview Questions": "Tell us how you would handle a difficult patient and/or co-worker.  "}, {"date": "26 May 2017", "title": "Tech Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mary Washington Healthcare (Fredericksburg, VA) in Apr 2013", "Interview Descriptions": "You meet with the team lead/supervisor or dept. Manager then you meet with senior management if you do well on the first interview. The second interview was with a panel. Dress business casual closed toed shoes. No perfume or excessive make up.", "Interview Questions": "When was a time you went above and beyond to deliver excellent customer service?"}, {"date": "11 Mar 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mary Washington Healthcare", "Interview Descriptions": "One on one interview with department manager.", "Interview Questions": "Straight forward. Nothing unexpected."}, {"date": "19 Oct 2012", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Mary Washington Healthcare", "Interview Descriptions": "Interviewed by two people, your typical job interview.", "Interview Questions": "N/A"}, {"date": "29 Dec 2015", "title": "Nurses Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mary Washington Healthcare (Fredericksburg, VA) in Apr 2012", "Interview Descriptions": "Online application process, then called in for a formal 1:1 interview with nursing manager. Asked about my customer service skills along with basic nursing knowledge. Asked me if I understood the importance of Teamwork and if I had any prior experience in entering physicians lab orders. All I. All the interview was quite fast was called the next day and offed position.", "Interview Questions": "How many years of nurses aid experience I had?"}, {"date": "12 Jun 2016", "title": "Clinical Informatics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Mary Washington Healthcare (Fredericksburg, VA) in Jan 2012", "Interview Descriptions": "The interview was done in 2-3 different parts, by peers, then by the two managers with a matrix management reporting system.\r\nInterview was smooth and professional in nature, they made me feel comfortable and asked the usual interview questions in both fields - psychological and work expertise related, along with future plans for my career development.\r\nThe calls for interview were flexible and I was kept informed for all the processes along the way.\r\nOverall it was a great experience and I always felt informed, welcome and warm.\r\nI was happy to join when offered the position that I interviewed for.", "Interview Questions": "How, if you did contribute to the innovation side of the work field?"}], [{"date": "27 Mar 2016", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mary Washington Healthcare (Fredericksburg, VA) in Jan 2012", "Interview Descriptions": "Interview went well.  The supervisor was nice and professional, and made me feel welcome.  I got a good first impression.  Supervisor seemed supportive and I wound up applying for and accepting the position.", "Interview Questions": "N/A"}, {"date": "17 Dec 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mary Washington Healthcare (Fredericksburg, VA) in Feb 2009", "Interview Descriptions": "Applied for position online, received call for 1:1 interview", "Interview Questions": "What is your weakness?"}]]