[[{"date": "21 Nov 2022", "title": "Medical Records Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ohio Living (Monroe, OH) in Aug 2022", "Interview Descriptions": "Very easy interview, essentially just asked about my education, previous experience, and salary desires. Afterwards, a tour of the facility was included. I received an offer of employment less than a week later.", "Interview Questions": "What are some of your strong suits?"}, {"date": "22 Feb 2022", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ohio Living (Willoughby, OH)", "Interview Descriptions": "I met with HR then with the director of rehab. HR was nice and the director of rehab was very casual and laid back. I was introduced to rehab staff day of interview.", "Interview Questions": "What are your top three qualities?"}, {"date": "17 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ohio Living (Monroe, OH) in Apr 2021", "Interview Descriptions": "Easy and relaxed. One person interview. Be early and dress professional. Nothing more to say about this process at this time thank you. I do not have 30 words to say about the process for the interview ", "Interview Questions": "How to handle difficult  situations. "}, {"date": "19 Sept 2021", "title": "Sales Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ohio Living (New York, NY) in Jan 2021", "Interview Descriptions": "Easy. Questions about yourself and ccx what are your interests outside of work. Questions about your goals in your career.  Questions about why you want to work for the company", "Interview Questions": "What are your career goals "}, {"date": "13 Oct 2017", "title": "STNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ohio Living (Cincinnati, OH) in Sept 2017", "Interview Descriptions": "Very organized and very warm.. HR seemed to be really nice people who love their position with this company..obce you're checked in HR staff was very prompt.. They literally come get you and start the interview right away... So no long agnostic wait.. It's a one on one interview as well", "Interview Questions": "What makes you stand out amongst other aides "}, {"date": "30 Jun 2017", "title": "Dietary Aid Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Ohio Living (Willoughby, OH)", "Interview Descriptions": "Came in for open interview event, signed in, filled out a mini application (took less than 5 minutes to complete) then went to a back room for the interview. Only one interviewer. Overall very relaxed environment, friendly", "Interview Questions": "What is your favorite food --- sell it to me, make me want to buy it."}, {"date": "10 Jul 2017", "title": "Resident Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Ohio Living (Willoughby, OH) in Jun 2017", "Interview Descriptions": "I applied for the Resident Assistant position a week before the hiring event at the facility.  So the entire process took about 2 weeks. \r\n\r\nI went to the hiring event they were having at the facility.  I filled out the mini application they had all applicants fill out,  I made sure I put that I was available for weekends only first or second shift. So I got a tour of the facility and the person who gave me the tour inform me of the hours of first and second shift and also went over the resident assistant role.  I got the chance to meet a few people in that role.  Everyone was very nice.\r\n\r\nA week after the interview I received a phone call stating that I applied for the resident assistant weekends nights.  I informed the individual  that I did apply for the resident assistant position, however the position I applied for was the day shift online.  But I put on the application that I filled out, I stated I am flexible to work day or evening  shift weekends.  The individual  stated that I can inform I guess the hiring manager (I forgot the name) that you are flexible to work day or evening.  I informed the individual I could not work nights because I have a full time job during the week day and working nights that will run into my full time.  The individual stated they didn't understand why there was notes on my application for night shift.  The individual stated that they will call me back. They never did.\r\n\r\nI went to look at my application status and I notice that I was withdrawn from the position and then put back into the position.  I was very confused, I never withdrawn from the position.  The position I applied for said clearly \"Weekends-Days\", so I would not have withdrawn from that position.  Couple days later I was declined for that position.  \r\n\r\nEveryone at the facility was very nice and I don't have anything bad to say about that.  However,  I am still confused on how the position I applied for was for days only  and my application I stated I can work days or evening and I was offered Weekends-Nights. Then withdrawn from the position I initially applied for and place back into the position just to be declined.", "Interview Questions": "None was asked.  Given a tour"}], [{"date": "19 Oct 2016", "title": "Hospice RN Case Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ohio Living (Columbus, OH) in Mar 2014", "Interview Descriptions": "It was a pretty straight up interview. It would help to have a basic understanding of the home health field and why you want to be a part of it.", "Interview Questions": "Why would you be a good fit for this postion"}, {"date": "22 Jun 2013", "title": "Communications Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Ohio Living", "Interview Descriptions": "Talked on the phone first. Came in for one on one interview. Was asked to come in a second time after the field of applicants was narrowed down, and was offered the job a few days later. Interviewers were nice and were the people I was going to be directly working for.", "Interview Questions": "What do you think your greatest asset to this company would be"}, {"date": "14 Jun 2013", "title": "Home Health Aid Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Ohio Living", "Interview Descriptions": "Just one face to face interview- asked very basic questions, got job offer in less than five minutes", "Interview Questions": "They were all very easy and expected questions"}, {"date": "21 May 2013", "title": "STNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Ohio Living (Willoughby, OH) in Mar 2012", "Interview Descriptions": "You take a two week unpaid class to be certified to work as an STNA. Very great experience! From their you must pass written State exam and Clinical exam. Before the exam you are taken from the class one by one to have an interview with the D.O.N", "Interview Questions": "None. Basically told to show up for work or you will be fired. More intimidating then anything else."}]]