[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Really Learned a lot", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Sept 2017", "job_title": "Account Executive in Clemson, SC", "duration": "N/A", "pros": "Training conference was a lot of fun. you get to meet students from different colleges. You'll learn a lot during the day and get some team bonding in\nThe managers are very supportive and really caring people. They care about your success and whenever you need to vent, they are there.\nThe experience makes you tougher, smarter, and more confident \nThe app is really cool and something that will probably take off in most college towns \nGreat future opportunities and hands on experience", "cons": "It's hot out during the summer and you're outside a lot\nyou are only paid when you make a sale or when you win a contest\nSome students drop off because they aren't tough and you might be the only one in your market if this happens"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Hard-Work, Great Experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Nov 2016", "job_title": "Account Executive in Greensboro, NC", "duration": "N/A", "pros": "Through this internship, I gained valuable skills that I would not have otherwise developed. I gained experience in the sales profession and learned how to come back to rejections and make those rejections into sales. At the beginning of the summer, I was very shy, quiet, and nervous when talking to potential customers. With the consistent help of management and their commitment to helping me grow as not only an account executive but also as a person that will one day enter the workforce. I was challenged, encouraged, and eventually saw results. Without the constant calls and texts from the management, I would not have sold two cover spots on the coupon book. The management is there for you and wants to see you succeed.  \r\nWhile I do not see sales as my career path, I can honestly say that this internship has given me invaluable skills that are transferable to any career path. I highly encourage anyone who is willing to work REALLY HARD every day of the internship to apply. It will challenge you to be a more persuasive, persistent, and confident person.", "cons": "Although it is considered a paid internship, this should not be your only source of income for the summer. While the experience is great, this internship is not for you if you are looking for only monetary gain. This internship is great for gaining skills and learning to be persistent.\r\nIt is hard work (9-5 each day, going business to business) but the harder you work, the more it will pay off."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Total Joke", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Aug 2015", "job_title": "Account Executive in Atlanta, GA", "duration": "N/A", "pros": "Brad and Yvonne are the top two people in the company and Yvonne does the interviews and runs things in Atlanta while Brad is the CEO and sales head. Both of them are extremely nice and know what they are doing.", "cons": "Having said that, this job is a total joke. They make all of these promises upfront about how they will help you with your resume and getting a job, but they wont. Almost a week ago I finished my internship with them and I have not heard from them since. They have seemingly vanished for whatever reason. Also, There is no PAY, they say its a paid internship but its strictly commission. However much you might end up making you will turn right back around and spend on gas driving around to local retail stores with your scripted sales pitch that NEVER WORKS, unless of course you run into one of the innocent mom and pop shops who don't understand that coupon books don't work because almost zero percent of students want to be seen using coupons much less have to carry around a book full of them. I talked to several businesses who said they did the coupon books at some point and everyone of them, outside of franchises, says that it is a rip off and that they had up to 2 students come in off of them. They also try to tell you how to sell using an ROI system that is completely BS. They have no statistical value connected to them that is concrete. The whole sales pitch is skeptical and truly a farce."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Account Executive (Summer Intern)", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Nov 2016", "job_title": "Account Executive in Gainesville, FL", "duration": "N/A", "pros": "I developed my communication, interpersonal, project management, accounts receivable and marketing skills by working with local business owners every single day. I also learned a lot of wonderful negotiating skills that is applicable to my daily life. You also earn commission based upon your sales and it is uncapped. This means that you can make as much money as you want and are incentivized to work as hard as you can to get those sales and make money.", "cons": "The managers are traveling managers and are not always available to you in person. However, there are daily morning meetings to discuss goals and such for the day. Also, they encourage you to call them when you need encouragement, want to discuss businesses and when you're in meetings to negotiate deals in order to close sales."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Internship I've Worked", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Nov 2016", "job_title": "Account Executive in Oxford, MS", "duration": "N/A", "pros": "The internship was more of a job since I was actually doing practical and real world projects that many people do in careers. I learned a lot of skills that will help me in my future and the career partners program already landed me a job for when I graduate. I also had a really supportive team to work with and my managers Brad and Clint were always there when I needed help.", "cons": "Selling advertising isn't the easiest thing to do so you have to be very hardworking and dedicated if you want to succeed. A lot of my clients told me they weren't interested at first but I kept going back to them and building more value. By the end of the summer I had half of my college town in the coupon book but it did take a lot of hard work!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "This internship is what you make of it.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Jun 2017", "job_title": "Account Executive in Columbia, SC", "duration": "N/A", "pros": "This internship is completely what you make of it, which can be a good thing or a bad thing. It separates the hard workers from the slackers. The managers are all really nice, friendly, and encouraging and inspire you to do your best! And if you are good at sales you can make a decent amount of money, better than an unpaid internship. This internship also connects you to a lot of business owner and helps you build sales and communication skills!", "cons": "Some of the cons include paying for gas if the market you work in is spread out. As I said in the pros, this internship is challenging and if you don't put the work into it, you won't make any money."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great opportunities to learn and network", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "18 Sept 2017", "job_title": "Account Executive in Gainesville, FL", "duration": "N/A", "pros": "There are different online conferences and workshops that helped me to have better communication with everyone including my manager and other interns from other universities. \r\nThere are tons of motivation and praises every day that keeps  you inspire to work each day\r\nEach team manager is very professional and know their market very well and of course they always open to for questions or any concern. \r\nYou get to speak to all business owners if you get in touch with them. They know people who might know people and make sure you are willing to develop a relationship with them.", "cons": "It is hot in the summer, of course and you will have to spend most of your time in the car if you want to earn some money. \r\nCould run into some rude people \r\nyou might not the only company that is doing this in the location so it gets competitive"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Would recommend", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Nov 2016", "job_title": "Account Executive in Tampa, FL", "duration": "N/A", "pros": "Learned a lot of sales and myself, became more confident and a better public speaker, grew as a person, management always there to help, Clint and brad taught us so much about sales and facing rejection that will set us up for a great future. Career partners will be key in getting a job in the future.", "cons": "Long hours and you really have to work hard to be successful-- but it's totally worth it. You get what you put in. Commission pay so you have to sell to make money."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great Learning Experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Nov 2016", "job_title": "Account Executive in Tallahassee, FL", "duration": "N/A", "pros": "Gain valuable real world experience\r\nHelps build communication skills\r\nBuild relationships with local businesses around town with customer service as the top priority\r\nTeaches you valuable sales techniques \r\nDifficult but extremely rewarding", "cons": "Hard to find motivation\r\nNew company which makes it hard to sell\r\nYou will need a second job if you are relying on this as a source of income"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Account Executive Internship", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "21 Nov 2016", "job_title": "Account Executive in Raleigh, NC", "duration": "N/A", "pros": "Great Sales Experience, as well as professional planning and relationship planning.", "cons": "Hard work. Struggled at first, but overall grew a lot through out the whole process."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great Experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Nov 2016", "job_title": "Account Executive in Statesboro, GA", "duration": "N/A", "pros": "Great experience\r\nSales training \r\nLooks good on resume\r\nPromoted team work", "cons": "Have to work hard for your money but it's worth the experience!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Pocketmoney", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Dec 2016", "job_title": "Event Marketing Specialist in Tampa, FL", "duration": "N/A", "pros": "Nice people to work with. The manager was always helpful and available.", "cons": "None according to me other than the checks took a bit longer than expected."}]]