[[{"date": "2 Jun 2023", "title": "Senior Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at GiveDirectly in May 2023", "Interview Descriptions": "The process. is very lengthy with 3 interviews and then reference checks. I only made it through the first interview which seemed more like a second interview as some questions were more technical", "Interview Questions": "1. Tell me about your experience. 2. How do you deal with challenges? 3. How would you engage stakeholders that may question the work that we do? 4. What type of safeguarding practices would you implement?"}, {"date": "14 Jun 2023", "title": "People Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at GiveDirectly in May 2023", "Interview Descriptions": "It was a good process overall, had 3 stages within 7 days. First call with the hiring manager , then an assignment, the a team call, the final stage was meant to be one with the chief people officer but I didn't make it past the team interview. I asked for feedback on my performance and the hiring manager responded with a detailed constructive feedback on my performance which I'm super grateful for. Overall great process.", "Interview Questions": "Tell us about a time when you've received feedback and how did you take it?"}, {"date": "11 Apr 2023", "title": "Senior Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at GiveDirectly (Johannesburg) in Feb 2023", "Interview Descriptions": "The interviewer asked a lot of specific technical questions at the first interview. They also asked lots of questions related to why you would be a good fit with their organization. First screening interview felt more like second interview.", "Interview Questions": "Lots of financial management questions."}, {"date": "11 Jan 2023", "title": "Director of Major Giving Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at GiveDirectly", "Interview Descriptions": "GiveDirectly outsources its first round of interviews to recruiters outside of the country who don't understand philanthropy or fundraising. Some companies record the interview so it can be vetted by others in the company but this was not. Out connection was spotty at best. I was asked about if I would be interested in another role if did not advance in this one.", "Interview Questions": "Tell us about your background."}, {"date": "9 Dec 2022", "title": "Systems Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at GiveDirectly", "Interview Descriptions": "Average. though Google meet. First was a 30 mins interview with the manger followed by a take home assignment. The take home assignment was a coding assignment . Then a third interview to discuss the assment. All the interviews were moderate.", "Interview Questions": "What is your experience with poverty. Have you ever dealt with outliers. LASSO regression, Data Encoding,feature selection, Geospatial data. Availability. How to handle datelines."}, {"date": "5 May 2023", "title": "External Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GiveDirectly (Maputo, Maputo Province) in Oct 2022", "Interview Descriptions": "I was invited for a first interview , after the interview I was invited for a writing text. The day that I was supposed to receive an e-mail with the indications to complete the writing text, I did not received anything. This was the first sign of unprofessional behavior. \r\n\r\nAfter this incident, they send me the 3 hours writing assessment.  After sending the assignment,  I never heard back from them. \r\n\r\nI can understand that I was not the right candidate for them, but the minimum is to send an e-mail. Ghosting is very unprofessional, given the time and effort one does to prepare for the interviews and writing assessments.", "Interview Questions": "Q: Why I am the perfect candidate for this position? Q: Why I want to work with Give Directly? Q: What is my understanding of \"poverty\"? Q: Strategies to create partnerships."}, {"date": "12 Sept 2022", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at GiveDirectly", "Interview Descriptions": "Extremely lengthy recruitment process. Included a three hour test and more than 4 interviews with different panelists each time. Responses from GD for each stage took at least a month and several follows up from my side before receiving an answer. The whole process lasted more than four months. Did not feel like my application, time and effort was valued and respected by the recruiting team, which was a red flag for the organisational values for me.", "Interview Questions": "Did not record the interview questions, though they were varied and challenging, both about past experiences and ideas for programming. "}, {"date": "5 Sept 2022", "title": "Research Data Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at GiveDirectly", "Interview Descriptions": "Too long a process. Even if you make it through all of them, you might miss the job at the end. Poor communication with last minute updates about the interview requirements leaving you unprepared.", "Interview Questions": "Varied questions for the interview "}, {"date": "6 Nov 2022", "title": "Manager Fundraising Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at GiveDirectly in Sept 2022", "Interview Descriptions": "More likely the worst interview process I experienced. I was asked to choose a day and time using the recruiter's calendar which I did. I even sent her an email to inform her about my choice. One week after and 30mn before the interview to be held by Zoom, no link or whatsoever. I suddenly received a cold email telling the choice I made didn't fit the recruiter and was asked to provide other days and times. I finally been able to attend the interview by zoom. The recruiter in Kenya didn't bother using her video, told me she was taking notes...sounded robotic and asked usual questions. This recruiter seems to forget she is representing the firm and at least should show some self excitement representing and promoting it. Besides having to use the video, taking notes or not, you would expect her to do so as well. It is not of a surprise considering the lack of organisation shown and the entire communication and interview genuinely put me off working for these people while being over qualified. The job was also badly advertised with a salary benchmark being transparent for USA but totally unclear elsewhere as being a remote job. Unfortunately and as much as I like the business concept this is exactly what you want to avoid to gain the interest of future candidates.", "Interview Questions": "Why Givediretly What do you do if a colleague doesn't hit his/her targets"}, {"date": "24 Aug 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at GiveDirectly", "Interview Descriptions": "First round was a short answer questionnaire about why I was interested and a difficult project I previously managed, second round was an interview, and third round was a timed excel assignment", "Interview Questions": "They asked how my current role would inform how I approach the position and work. "}], [{"date": "26 Sept 2022", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at GiveDirectly in Aug 2022", "Interview Descriptions": "The interview process is far too lengthy for an associate level position. There was the initial interview, an excel and written skills test, a panel interview, and another final interview. I was lucky though because on their application they state that they may have two more interviews after the panel interview. A five step interview process (not including references) is too much for an associate level position. \n\nThey also state that they want to hire more individuals from the populations they work with, however, this interview process alienates those who would not be able to afford to take time off work for such an extensive interview.", "Interview Questions": "Details on how you’ve project-managed multiple, competing priorities\n\nAccomplishments you’re proud of from your previous role(s)\n\nAreas that you think constitute personal opportunities for improvement\n\nYour thought process when approaching different scenarios that might come up in the role you’re applying for\n\nIn the past how have you handled an unethical situation \n\nExplain a time where someone convinced you to change your mind\n\nExplain what you did on an average day in your previous role \n\nWhat do I think \"poverty\" means\n\nWhy are you interested in working for Give Directly? \n\nA few scenario based questions"}, {"date": "13 Jul 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GiveDirectly", "Interview Descriptions": "The timelines were not communicated clearly and the agreed feedback dates were always moved with no clear communications prior. In addition, the feedback after a round of interview was very generic and scripted.", "Interview Questions": "What kind of role i was searching for"}, {"date": "8 Sept 2022", "title": "Senior Treasury and Partnerships Manager (Merry-go-round) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GiveDirectly in Jul 2022", "Interview Descriptions": "Scene I – I applied for a role at GD, and after a 5-step recruitment process reached the final stage. For the assignment for the evaluation, I aced it and even noticed errors in some of the data which I pointed out. Also, in the interview I shared some important insights how to tackle certain situations and you could see one of the senior staff delighted. A week after the final interview I got a regret call from a senior employee (not email) that they hired someone else! \r\n\r\nI find this questionable because 1. At a later stage finding out who the hire, I feel I had a stronger profile in many aspects (hint: LinkedIn) and 2. One that breaches one of the criteria of the equal-opportunity statement which is really hard to prove by an applicant!\r\n\r\nScene II – the senior staff who called for regret wanted to refer to me another role in GD and I said yes please do so. 14 days after giving my nod, I get my first interview for this different role. I asked the interviewer if he was aware that I had reached the final stage and was interviewed by a C-level staff, he said no. Which means I wasn’t referred, on hindsight and flowing my gut instincts I applied for this role on their website without waiting for GD staff to refer me (referral means no need to apply for this online, GD staff has put a word for you and sent your CV so that respective team should pick it up). I also asked the interviewer if I had to start the process from scratch and he said yes! 9 days after I had the first interview for this role, I get a regret email from the same interviewer mentioning his team had already filled the position while interviewing me as other interviews were on-going!\r\n\r\nI also find this questionable because 1. The interviewer had mentioned that there were two hires for this managerial position plus VP for the department and 2. Even as of today, 8 days after the second regret, this role is still up on their website!!! Who is fooling who here? This is very dishonest and unethical of them.\r\n\r\nWhat came out clear is that GD departments work in silos and can’t refer applicants in time, or some don’t act on it. Where is the applicant’s fault in this? Plus, this role is still being hired for!\r\n\r\nGD need to realise their staff get paid to interview you, whereas applicants don’t and go through their very lengthy recruitment process. I found this tossing around of a qualified and experienced African applicant by GD very discriminatory.\r\n\r\nGD have the absolute right to hire whoever they want though that doesn’t really mean it’s a fair process. GD is an international organisation but not a professional one!", "Interview Questions": "Lots of tell me about a time questions."}, {"date": "10 Aug 2022", "title": "Operations Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at GiveDirectly in Jul 2022", "Interview Descriptions": "I had an initial screening interview which was scheduled pretty fast but I didn't hear back until nearly 3 weeks later when I followed up to check in. I was invited to move onto the next round, a written & excel exercise. After completing the exercise, I wasn't contacted until nearly 2 weeks later with an update. Love the company and the mission but found the hiring process to be disrespectful of an applicants time and entirely too long for an associate level role.", "Interview Questions": "Why do you want to work at Give Directly?"}, {"date": "2 Oct 2022", "title": "PROGRAM MANAGER, RECIPIENT ADVOCACY Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at GiveDirectly (Tampa, FL) in Jul 2022", "Interview Descriptions": "I was contacted for a first interview, and they made a couple of mistakes/changes in the process (wrong position title, change of time, change of person interviewing). I ended up having the interview but was just an HR screening with little opportunity to ask job-specific questions. I followed up twice with my interviewer but never heard from them again. ", "Interview Questions": "What are my experiences with poverty? How do I manage my time?"}, {"date": "17 Apr 2023", "title": "US Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GiveDirectly in Jun 2022", "Interview Descriptions": "Took a long time and it felt like a consulting company came up with the process to attempt to be equitable, but they still just prioritize the same types of people and experiences they would otherwise.", "Interview Questions": "N/A"}, {"date": "16 May 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at GiveDirectly", "Interview Descriptions": "After not applying to this position, I was informed that I was selected for the first round of interview. I was also told that the recruitment was an urgent replacement. After two months, I did not receive either follow-up and even less feedback.", "Interview Questions": "Experience related to managing direct reports in challenging circumstances"}, {"date": "1 Jun 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at GiveDirectly in Apr 2022", "Interview Descriptions": "The process felt very straightforward and transparent.  I was first screened on my general background, then took a 1.5 hour skills text (excel & written questions on a case study), then had a panel interview with a program manager & associate asking specific day to day experience and work.  It was a fairly quick process and everyone seemed very fair.", "Interview Questions": "In the past how have you handled an unethical situation\r\nExplain a time where someone convinced you to change your mind\r\nWhat is your idea of an ethical organisation\r\nExplain what you did on an average day in your previous role"}, {"date": "15 Jul 2022", "title": "Partnerships Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at GiveDirectly in Apr 2022", "Interview Descriptions": "I was invited to a phone screen over zoom. The interviewer did not turn on their camera and asked standard phone screen questions. Two weeks later I followed up and then was sent a work sample exercise. The work sample exercise ended up being two different exercises, one written and one in excel. This work exercise was by far the most extensive work sample exercise I've ever been asked to do.  Then invited to a second interview, however in the second interview it was framed as another phone screen and I was asked the exact same questions as in the first interview. Again the interviewer did not turn on their camera. After two weeks I reached out to check in and was told I would not be moving forward. I emailed back to ask for feedback and was never given a response. I felt like the time I put into this interview process was not respected. I would not apply here again.", "Interview Questions": "What innovations would you suggest to leadership?"}, {"date": "18 Apr 2022", "title": "Front End Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at GiveDirectly (New York, NY) in Apr 2022", "Interview Descriptions": "The worst interviewer I have ever dealt with in my entire career. He was late to the call, never introduced himself or told me his title or what he even does there. There was no initial phone screening, he just jumped immediately to a live coding test. He didn't ask me a single question - not about myself, my background or my experience - nothing. He even told me he didn't read my resume(!). He gave unclear instructions and expected me to spit out code out on the spot without telling me what he was actually looking for. Then he abruptly said \"I have to drop\" and ended the call.\r\n\r\nThis was without a doubt the most unprofessional, sad excuse for an interview I have ever dealt with. You couldn't pay me enough to work for or with a person like that. I promptly emailed saying I retract my application and was not interested.", "Interview Questions": "N/A"}], [{"date": "25 Apr 2022", "title": "Partnerships Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at GiveDirectly in Mar 2022", "Interview Descriptions": "I heard from them less than two weeks after submitting an application. The interviewing process sounds like a bit too much though: it consists of an initial screening with someone in a similar position followed by a written skills test, and then three other interviews. I stopped mid-way and the people that I interacted with by that point sounded pleasant and left a good impression.", "Interview Questions": "Basic questions about my experience to date, my reason for applying, and what do I think \"poverty\" means. The written test wasn't too difficult either and it focused precisely on the job. I particularly loved the fact that they provided useful guides on what they want to see written and submitted. "}, {"date": "24 May 2022", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GiveDirectly in Mar 2022", "Interview Descriptions": "I had two interviews. introduction one and a professional one. both of them were very nice and fair. the wall process was pleasant. Both of the interviews was over zoom. I", "Interview Questions": "in the introduction I was asked to tell about myself and my expirince"}, {"date": "19 Mar 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at GiveDirectly (New York, NY) in Mar 2022", "Interview Descriptions": "Telephone Screening- A hiring manager reached out via phone.\nTake home  Skills test- This was to generally test communication and analytical skills \nOral interview- Faced a panel over Google Meet", "Interview Questions": "What's your perspective about poverty?\nWhat's an ethical organization?"}, {"date": "13 Apr 2022", "title": "Senior Manager, Campaign Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at GiveDirectly in Feb 2022", "Interview Descriptions": "Bizarre experience - my first (and only) interview with GD was with someone at an associate level. I found this initially strange since I was applying for a manager-level position. It felt like a red flag to me that no one who would be at least at the level of this position joined the call. At a minimum, I expect an HR rep to handle initial screening interviews, not the most junior program staffer.\n\nAs a result, I spent most of my 30-minute conversation with this associate explaining the words I used to describe my work experience. For instance, we spent about 10 minutes going back and forth while I defined and described what a shareholder is. By the end of the interview portion, we had about 3 minutes left for me to ask questions. Unfortunately, the associate interviewing me told me he had a hard stop, so I had to squeeze all my MANY questions about this interesting (and innovative! and perhaps questionable!) organization into three minutes. He couldn't answer my first question about GD's comparative advantage in the cash transfer field, so I threw him a softball and asked about his favorite part of working at GD. Not surprisingly, he loved that question!!", "Interview Questions": "How is your experience applicable to this position?"}, {"date": "26 Jan 2022", "title": "Program Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GiveDirectly", "Interview Descriptions": "Hiring manager screen, Skills test for several hours involving Excel before even being told if you are meeting with the rest of the team, then meetings with the rest of the team if you pass that. It should also be noted this organization does not provide actual health benefits to employees, they provide a monthly stipend for you to purchase on your own. Extremely questionable practices.", "Interview Questions": "Why are you looking to leave your role?"}, {"date": "25 Dec 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at GiveDirectly", "Interview Descriptions": "First interview was nice, then did a skills test, and then a second interview with someone else, which was okay.  Second interviewer said they would get back to me about a question I asked since they didn't know the answer (they said it was a good question), and that I would hear from them about a final interview next week. I never heard back from anyone. It was a shame since I was excited about their work and put a lot of time into the application process. Hopefully they improve their process because they seem like an organization with a great cause.", "Interview Questions": "What stands out for you about GiveDirectly?"}, {"date": "23 May 2023", "title": "Country Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at GiveDirectly in Nov 2021", "Interview Descriptions": "I didn't apply for this position but for others on their site months before at different intervals. I was asked to apply to this position and was immediately given an interview. Then the interview was straightforward and was told I would go normally through the second round but never heard from them anymore. I saw that the position was still advertised a year later. I would say then it was a mock recruitment process.", "Interview Questions": "What's your experience working in challenging environments?"}, {"date": "1 Nov 2021", "title": "Senior Manager, Humanitarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GiveDirectly in Oct 2021", "Interview Descriptions": "Pleasant experience, First was a call with the HR manager, then a written skills test and first round formal interview. Waited for a week between rounds. Formal interview was with a peer. Another Senior Manager, Humanitarian", "Interview Questions": "Why do you think you're the right candidate?"}, {"date": "8 Feb 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at GiveDirectly in Oct 2021", "Interview Descriptions": "First round interview was very unconventional. It was introduced as a casual chat but felt very scrutinizing. Almost immediately was informed I wouldn't be advancing to the next round and I wasn't surprised.", "Interview Questions": "What is your preferred communication style?"}, {"date": "11 Aug 2021", "title": "Partnerships Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at GiveDirectly in Aug 2021", "Interview Descriptions": "GD reached out to me, asking me to apply. I thought the position was a great fit for me based on my experience and education, and I applied immediately. A few days later, I was asked to interview. I selected the first available time slot. I prepared for the interview by reading nearly everything on their website. The interviewer was 6 minutes late calling me. I had to email her asking if we were still talking. I thought the conversation went fine. Simple questions asking me about my experience and thoughts on poverty as well as what I liked about the organization. A few days after the interview, someone emailed me letting me know that I didn't move on in the process, and they wished me luck in my job search. But, I was not job searching. They had reached out to me saying they thought I'd be a good fit, not vice versa. I was surprised that I wasn't moving foward and couldn't imagine what I could have said during the very simple phone screen to disqualify myself from the process. Their website says they value direct, constructive feedback, so I asked for feedback about what I did or did not do that caused them to lose interest so quickly. No response. I guess they do not value direct feedback as much as they claim.", "Interview Questions": "Tell me about your career journey; What are your thoughts on poverty; what do you like about GD?"}], [{"date": "28 Sept 2021", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at GiveDirectly in Aug 2021", "Interview Descriptions": "Was reached out to by a recruiter and told I looked like a great fit for the role. Went through 3-4 interview rounds (phone screen, casestudy and excel proficiency assignment, walk-through of assignment, and final conversation with some other folks at the same level.) Final interview was a bit tense - they seemed to be looking for very specific answers to very vague questions, which made for a bit of a frustrating experience.\n\nLike many others, did not receive any feedback between rounds and eventually received a rejection email after a quite drawn-out interview process.\n\nIt was nice to meet so many people on the team, however! Very open and honest about what to expect from the role.", "Interview Questions": "Why are you intersted in GiveDirectly in particular?\n\nHow do you feel about working with minimal supervision/instruction?"}, {"date": "7 Jul 2021", "title": "Business Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at GiveDirectly", "Interview Descriptions": "Fair interview, some data questions some on fit, enjoyable process overall, met with many members of the team got a good understanding of the position and role, were transparent through the process", "Interview Questions": "Why here vs other nonprofits?"}, {"date": "1 Jul 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at GiveDirectly", "Interview Descriptions": "The interview process is quite intense. You have an intial phone call, then you have to pass a skills test, and then you have a final interview with the VP of the team your applying to.", "Interview Questions": "What is your favorite thing about GD"}, {"date": "22 Jul 2022", "title": "Country Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at GiveDirectly in Jul 2021", "Interview Descriptions": "Interviewed with HR rep in the application country - Malawi. Launched straight into personal stuff with little introduction and no screen camera on, very impersonal.\r\n\r\nWas invited to do the Skills Test - Excel / Word within a week but at the appointment two hour window, the app they were using didn't spit out the two documents. Emails went unanswered for 3 days. Another time was set up to do the Skills test again. \r\n\r\nAfter submitting I didn't hear receive any further correspondence. \r\n\r\nVery unprofessional and if it reflected the Malawi operations I'm glad the relationship was terminated.", "Interview Questions": "What is poverty?\r\nWhat excites you about GD?\r\nwhy are you suitable?"}, {"date": "25 May 2021", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GiveDirectly", "Interview Descriptions": "The interview process was as follow: \n1. An interview with the HR manager about motivations and experience\n2. A case study to do in 1 hour after it's sent\n3. An interview with the Country Director - 1 hour, going through the case study\n4. An interview with the Regional Director - 30mn, asking specific questions about project management and team management.", "Interview Questions": "1. Interview 1: Motivations and previous experience with a focus on project management and team management with specific examples. \n2. Case study of a GD real experience on the ground sending cash to recipients, focusing on risks identifications and mitigation actions, in addition to an excel exercise skills testing.\n3. Last interview, they asked for specific examples in my experience demonstrating strong project management skills as well as team management, in addition to motivation for the position. \nOverall, It was a very positive experience. "}, {"date": "24 Jun 2021", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at GiveDirectly (Los Angeles, CA) in Jun 2021", "Interview Descriptions": "The call was supposed to last 30 minutes and it lasted only 11. The interviewer had only 2 questions. I got the impression that the interviewer did not want to be  interviewing me. Furthermore, I was the only one with the video one which made it very awkward.", "Interview Questions": "Tell me about your experience. "}, {"date": "16 Mar 2021", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at GiveDirectly", "Interview Descriptions": "The interview process with Give Directly for the position of Communications Manager was straightforward and easy. They got back to me quickly and were very responsive.  I appreciated their honesty and the lack of confusion.", "Interview Questions": "Which of Give Directly's values are you most passionate about."}, {"date": "3 Jun 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at GiveDirectly (Stoke-on-Trent, England) in Feb 2021", "Interview Descriptions": "Not transparent and evidence of equal employment terms.  The interview process had no quality control as there was only one person who was not much interested in details of the responses provided", "Interview Questions": "Tell me about your self"}, {"date": "20 Nov 2020", "title": "Humanitarian Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at GiveDirectly", "Interview Descriptions": "After an initial CV screen, they began the interview process with a couple of written exercises. One assessed excel/data skills and the other assessed more context specific analytical problem solving.", "Interview Questions": "Sumif, countif, etc. functions in excel"}, {"date": "8 Jun 2021", "title": "Senior Manager, Humanitarian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at GiveDirectly in Oct 2020", "Interview Descriptions": "First round was a 30 min phone interview with the hiring manager. Second round was a written exercise that included Excel analysis. This portion had a 2-3 hour time limit.", "Interview Questions": "What is your leadership style?"}], [{"date": "24 Dec 2020", "title": "Africa regional director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at GiveDirectly (New York, NY) in Sept 2020", "Interview Descriptions": "I went through at minimum 7 rounds of interviews with multiple people. There was no feedback from the team and after several non-replies, I finally received feedback. The process was extremely drawn out, while each person was extremely privileged that I interacted with. In each interview, the team asked me about my experience and were \"impressed\". The hiring manager reviewed my LinkedIn multiple times. However,  after several interviews and me following up, I received a rejection email. An interesting fact was that I had several more years of experience across the entire Continent. This organization does not hire African-Americans and I would highly recommend not engaging with this organization as they are only interested in certain people.", "Interview Questions": "Why Give Directly? \r\n\r\nWhat would you bring to the organization?\r\n\r\nHow do you interact with various cultures? \r\n"}, {"date": "10 Mar 2021", "title": "Country Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GiveDirectly (Lilongwe) in Jan 2020", "Interview Descriptions": "I didn't even get through to the other stage. I was given an exercise to do which was irrelevant to the post. The exercises were on data excel sheets and how to do the basic excel work.", "Interview Questions": "To compute several excel formulas"}, {"date": "23 Oct 2019", "title": "Community Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at GiveDirectly (New York, NY) in Oct 2018", "Interview Descriptions": "I had a brief phone screen and was invited to interview with two directors at their offices in a WeWork in Manhattan. The interviews were mostly qualitative and fit, but their process seemed a bit disorganized - they hadn't booked rooms correctly so I was shuffled back and forth a few times.\r\n\r\nThe interview themselves were fairly straightfoward but I think it was somewhat clear by the end that it was not the right fit for neither them nor myself. They placed an emphasis on operating like a startup (data-driven, iterative, constant feedback loops, etc.) which was the environment I was coming from and wasn't look for again. It seemed like they didn't have a clear directive for this type of marketing/comms role and were building it from the ground up.\r\n\r\nI ended up accepting another offer right as they let me know I wouldn't be moving forward.", "Interview Questions": "How would you quantify marketing goals/objectives? What ways would you measure this data?"}, {"date": "18 Jul 2018", "title": "Country Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at GiveDirectly (London, England) in May 2018", "Interview Descriptions": "Applied online, Need to submit CV, Cover Letter and answer a few questions. I received an email to conduct a phone interview after that, then was selected for a computer test (Excel Test).", "Interview Questions": "Interview Questions mostly about your past experiences, not very complicated"}, {"date": "26 Apr 2018", "title": "Field Activities Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at GiveDirectly (Kampala) in Sept 2017", "Interview Descriptions": "It was a such owesome interview basically it was one on one. It was 1:1 , phone screening. Overall this was a fair and free interview for me. Finally i was offered a contract of employment", "Interview Questions": "Asked me why did i apply for this position?"}, {"date": "11 Sept 2017", "title": "Communications Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at GiveDirectly in Aug 2017", "Interview Descriptions": "Applied online. Contacted by email to schedule a brief tel chat (20 mins) with executive while in their car. Asked for writing samples. Then asked to complete a writing exercise.  All this before even discussing salary range, the job itself and any in-person contact. I get the impression they don't have an HR person and don't know what they are doing.  Impressed with my background and education but really don't know how to hire someone for the role, or for what they are looking. The writing samples and exercises were silly.", "Interview Questions": "How does \"Big Corporation on my resume\" run their communications practice?"}, {"date": "6 Jun 2017", "title": "Data and Analytics Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at GiveDirectly (New York, NY) in Apr 2017", "Interview Descriptions": "GD's interviews are rather chill,  marked by \"getting to know you\" questions and then the occasion grilling on why you're interested in international development and how your experience is applicable. Downside is sometimes they shop candidates around to various positions without knowing their hiring needs - AKA you could talk with them for two months as I did only to learn that they're not actually filling a position at all! Nice folks, and they seem smart. Their less than cogent approach to candidate management is probably just a sign of their small and nascent operation.", "Interview Questions": "No tricky behavioral questions, just questions about your background."}]]