[[{"date": "18 Jun 2023", "title": "Post Production Teaching Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New York Film Academy (Burbank, CA)", "Interview Descriptions": "Did an interview over zoom. The interviewer asked me several in depth questions about my experience in Post-Production, including a on-the-spot test about how I would solve an issue a student recently faced. He seemed satisfied by my answers, but I never heard back .", "Interview Questions": "If a piece of media shows up offline on an AVID Media Composer timeline, what is the first thing you do?"}, {"date": "19 May 2023", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at New York Film Academy (Miami Beach, FL)", "Interview Descriptions": "First you're invited to a preliminary Interview, after that, you'll need to pass a test to measure you knowledge of the technologies and some theory of film. The very last thing is am interview with the hiring manager.", "Interview Questions": "How long have you been in the film industry"}, {"date": "11 Oct 2022", "title": "HR Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at New York Film Academy (Los Angeles, CA) in Sept 2022", "Interview Descriptions": "Applied online. Interviewed with HRD from NY and Dean in Los Angeles, CA. After a few weeks received email regarding a panel interview with 8 senior leaders. Went well. Followed up regarding and was ghosted. Very unprofessional, inconsiderate and bad for business especially when you are interviewing for senior leadership positions.", "Interview Questions": "Tell us about yourself. Tell us a time you managed a work conflict...."}, {"date": "12 Jun 2021", "title": "Technical Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at New York Film Academy in Jun 2021", "Interview Descriptions": "I applied on indeed and they got back to me pretty quickly. The interviewer was enthusiastic about me joining up, but kept the details of the structure of the summer camp program kind of vague. I had to ask a lot of follow-up questions just to get a sense of what was going on. Then I looked up the school's reputation...", "Interview Questions": "They didn't so much as ask me questions as they spent the whole interview talking about the position in vague terms."}, {"date": "27 Apr 2021", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at New York Film Academy (New York, NY) in Apr 2021", "Interview Descriptions": "It was great they first asked about me then we talked about the job description then how day to day tasks would go, quickly touching on salaries and rates at NYFA.", "Interview Questions": "Why were you interested in working with us?"}, {"date": "22 May 2023", "title": "Security/Front Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at New York Film Academy (Burbank, CA) in Mar 2021", "Interview Descriptions": "Zoom interview that happened from their location in Burbank California. Interview process was easy and took 5 minutes. Zoom interview that happened from their location in Burbank California. Interview process was easy and took 5 minutes.", "Interview Questions": "What is your availability? Do uou have transportation?"}, {"date": "29 Jul 2020", "title": "Operations Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New York Film Academy (New York, NY)", "Interview Descriptions": "The interview process was very tedious. Took about a month to get the job and had 3 interviews that weren't necessary. Consisted of a phone interview with HR, in-person interview with HR, in-person interview with HR and supervisor, and then an in-person interview with HR and a VP.", "Interview Questions": "Basic questions about experience. Nothing that required much time for a simple role."}, {"date": "3 Nov 2021", "title": "International Student Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New York Film Academy (New York, NY) in Feb 2020", "Interview Descriptions": "They were very friendly and described the position to me in detail. They did not ask me very many questions about past work experiences, and also did not ask many questions about how I have handled specific types of situations in the past, etc. They asked a few of that type of question, but not many.", "Interview Questions": "How is your previous experience relevant to this position?"}, {"date": "5 Oct 2019", "title": "HR Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at New York Film Academy (Los Angeles, CA) in Oct 2019", "Interview Descriptions": "Basically applied online, and 3-4 days later, I received a call and was asked to come in for an in-person interview. I came in and there were a 3 of the people from HR there who sat and asked me questions. They seems very nice and kind. They mentioned how it was a fast-paced work environment, and how its highly collaborative. They seems very organized(I have had job interviews with employers that seems extremely disorganized, and almost too eager to give me a job) The NYFA HR team on the other hand were extremely professional, friendly, but didn't give \"false hope\" that you killed the interview, or used wording that would imply you got the job. (I have had interviews where things like \"when you work here, this will be your office\" kinda talk and didn't get the job) They merely mentioned that they would get back to me on their hiring decision.", "Interview Questions": "They asked me why I wanted to do HR, as well as what I wanted to do in 5 years, as well as what a day at my previous job looked like."}, {"date": "14 Aug 2019", "title": "Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New York Film Academy (Burbank, CA) in Aug 2019", "Interview Descriptions": "Met with committee of three. Very nice people. Respectful and relaxed. They were curious about my background and gave pertinent information regarding culture of school and how it was similar and different from my past academic and professional employment. Environment was friendly and open. I am from LA so I am comfortable with the culture. Setting up mock teaching for next meeting. This is something I have done before so I know how to do that.", "Interview Questions": "What kinds of classes have you taught? How do you approach teaching students from other countries? "}], [{"date": "4 Sept 2019", "title": "Summer Camp Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at New York Film Academy (Burbank, CA) in Mar 2019", "Interview Descriptions": "The process was quite a nightmare to find parking in their garage that has no open spaces, they didn't tell you what room to meet in, just a floor in the office that you helpless look around for someone who looks like their looking for you. Other than that, the actual interview itself is simple, took place at the burbank, ca location. They asked a lot of questions that had nothing to do with the job itself and had little information to give you because they couldn't find a location to house everyone. They also don't hire based on your experience, they hire anyone regardless because hardly anyone applies.", "Interview Questions": "What's your favorite movie?"}, {"date": "7 Jan 2019", "title": "Human Resources Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at New York Film Academy", "Interview Descriptions": "I applied for the position online and was contacted by someone in the HR department a day or two later to schedule an interview. When I arrived a few minutes early for my interview, I assumed I would be waiting for the hiring manager until my scheduled interview time. However, I was waiting, and waiting, and waiting for almost 45 minutes. Finally, I was greeted by the person who scheduled my interview. She brought me to a theater, where I would be meeting the hiring manager. This person stalled... and stalled... until she texted and tried calling the hiring manager multiple times to then tell me that the hiring manager was stuck in a meeting. I eventually met with someone else in the HR department instead, who was professional in interviewing me, but told me that this particular position I applied for would be to replace her. Overall, it seems like their HR Department is a mess with absolutely no semblance of organizational or prioritization skills. If an interviewer shows up at his or her scheduled time ready to interview with the interviewer as scheduled, it is completely disrespectful to leave the interviewee hanging. Ultimately, it is absolutely wrong that I didn’t even meet with the hiring manager at all after I traveled all the way there and waited almost an hour past my interview time to even begin interviewing with someone whose perspective on me won’t even matter because she won’t be with the company shortly. I was not even sent a follow up or apology after that experience. My first impression and experience with NYFA was awful and telling. I urge everyone to stay far, far away. I’m glad I didn’t get the position.", "Interview Questions": "Tell me about yourself"}, {"date": "15 Dec 2018", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at New York Film Academy", "Interview Descriptions": "At first everything seemed okay but at the end they stopped communicating. They would not reply to emails. The interview scheduling is quite hectic and they can ask you to do it right at the same day. Everything seemed very disorganized.", "Interview Questions": "Questions about cameras and equipment. Nothing hard."}, {"date": "28 Aug 2022", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New York Film Academy (New York, NY) in Sept 2018", "Interview Descriptions": "I was invited to come in for an interview, met with one of the senior admission staff members for about 35 minutes. That interview went well and she was very nice and seemed excited about my résumé and experience. They told me the job was for an \"Admission Specialist\" role and that they needed help in their recruitment tactics and their overall admission process. I was invited to come in for a second interview, which was also fine, again with another senior admission staff member. Felt like a standard interview. After that interview, I was brought upstairs to meet with the President. He was late to the interview and the interview took place in his office on this really low couch, which was weird to me, and it was so loud because the room was next to a dance studio so I was super distracted/couldn't concentrate on the questions. I offered him my resume after introducing myself, so he could have a copy to look over, and he declined, saying he'd already looked at it earlier. He then asked me where I'd gone to college and questions about my work experience that could be found on my resume. It was such a weird interview and I got such weird vibes from him and he just kept talking about how wonderful he is and how NYFA is not as prestigious as where I had gone to college or where I had previously worked, and that he understood where I was coming from because he had gone to Harvard, and that this would be different but that people really give it their all here etc etc. That should have been my first red flag. I was offered the position later that week and negotiated the salary up by 5-10K, I believe. But when they sent me the official offer, they had changed the job title without telling me, and informed me my working hours would be from 11:30AM-8PM, which they had never mentioned during the interview process. I ended up accepting the job, but quit shortly thereafter because it was not the right fit for me and it felt like a bait-and-switch. The job they had described for me was not at all the job they asked me to do when I first showed up. I should have listened to my gut and the reviews from others before accepting the position/applying in the first place.", "Interview Questions": "What is your experience in Admissions? "}, {"date": "22 Jul 2020", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New York Film Academy (Burbank, CA) in Aug 2018", "Interview Descriptions": "Interview process was very good. They were very helpful and welcoming. We talked about my resume. They were very pleasant. They seemed very smart. They explained the job and academy itself. We had a very good conversation. They brought me back to observe a sample class that I taught. That process went very smoothly.", "Interview Questions": "They asked about items on my resume."}, {"date": "12 Oct 2019", "title": "Writer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New York Film Academy (Los Angeles, CA) in Feb 2018", "Interview Descriptions": "In person. The president asked me to work for them. He wanted to see my work. Asked if I've ever worked on advertising. Asked me, what my vision is. What do I think I would do there.", "Interview Questions": "expectation on pay"}, {"date": "30 Oct 2017", "title": "ESL Tutor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New York Film Academy (Los Angeles, CA) in Aug 2017", "Interview Descriptions": "First interview followed by teahcing demonstration with the panel. I did not have a panel- waited for 15 minutes for panel to show up- only one person showed up. I was told to choose a topic of my choice.", "Interview Questions": "Experience, and gave me a test in the first interview- it was grammar and syntax test."}, {"date": "16 Oct 2017", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New York Film Academy (New York, NY) in Jun 2017", "Interview Descriptions": "First I took a test then I had to show my practical knowledge of two different cameras. And later I went in for interview questions. If you have worked with cameras before the practical should not be too difficult. My tester was understanding and he provided us with material to study before the test.", "Interview Questions": "Have you worked with children before?"}, {"date": "18 Oct 2018", "title": "Front Desk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at New York Film Academy (Burbank, CA) in May 2017", "Interview Descriptions": "I applied for the job and the next day I was called and had a phone screening. The girl on the phone was very nice and throughly explained the job position and what it in tales and then continued to ask me questions regarding my availability etc.  She then scheduled me to come in for an in-person interview where I met with her and the Director of Operations. The interview was about 30 minutes.", "Interview Questions": "What do you know about the New York Film Academy?"}, {"date": "22 Feb 2018", "title": "Bursar Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New York Film Academy (Burbank, CA) in Feb 2017", "Interview Descriptions": "I was contacted within a few days of applying. The HR team was super helpful in answering my questions about the role and were very detailed in the e-mail instructions of where to go, park and where to report once in the building. I got there for my interview and was immediately greeted by the girl I had been interacting with in HR, she offered me a water as I waited for my interview. \r\nOnce I got into the interview the Manager went over what the job was, the day to day tasks and then asked me more about my previous experience etc. \r\n\r\nA few days later, I was contacted again by the same girl in HR to schedule a 2nd interview with the Director and CEO. I again was given great detail of the instructions and who I would be meeting with. I met with them and they were intimidating and could tell I was nervous but they were nice. \r\n\r\nA day later, I got the call from the same girl offering me the position, giving me details about my compensation, schedule, paperwork etc.", "Interview Questions": "Describe a time when you have given excellent customer service."}], [{"date": "9 Nov 2016", "title": "Junior Web Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at New York Film Academy (New York, NY) in Aug 2016", "Interview Descriptions": "Run of the mill interview questions (strengths, weaknesses, etc), with some job-specific ones. She looked over my portfolio and resume throughout the interview and asked to explain my design process too.", "Interview Questions": "Do you like working with a lot of set instructions, or handling the project on your own?"}, {"date": "14 Jul 2016", "title": "Student Outcomes Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at New York Film Academy (New York, NY) in Jun 2016", "Interview Descriptions": "A 20 minute Phone screen - followed by a 2 hour long in person interview with head of Student Outcomes. Very Transparent about the process throughout and communicative with me. Asked questions about very specific situations, coaching styles and was asked to review resumes. Asked about ASANA use.", "Interview Questions": "How would you deal with a student who has been looking for a job and wants to give up?"}, {"date": "1 Feb 2016", "title": "Scheduling Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at New York Film Academy (New York, NY)", "Interview Descriptions": "I applied online on Indeed. They emailed me to schedule an appointment. I sat down in their small office with two of the managers that I would possibly be working for. The only asked me two questions. While I was talking, one of the managers started to check his email on his computer. They didn't seem interested in what I had to say at all and didn't ask me any questions. Very rude. Terrible experience and very reflective of their work culture. They did not even reply back to tell me I was no longer in consideration.", "Interview Questions": "What computer technology do you currently use?"}, {"date": "4 Jan 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New York Film Academy (New York, NY) in Jun 2015", "Interview Descriptions": "After the formal interview where I was asked about my previous experiences, my practical skills were tested (they asked me to choose between a film camera and digital camera), and then I took a written test with other applicants about film terminology and camera settings.", "Interview Questions": "Do you have experience with 16mm cameras?"}, {"date": "6 Oct 2015", "title": "Technical Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at New York Film Academy (Los Angeles, CA) in Feb 2015", "Interview Descriptions": "It went by smoothly. Interviewed by two managers and discussed thoroughly the job descriptions and how my experience and skills benefit the position. I was also given a tour of the facility and the neighboring facilities as well as shown an introduction video and ended with a skills test.  I dont think I did too well as my mind wasn't as prepared and fresh to answer but I was eventually chosen, so perhaps it was more to gauge my current understanding.", "Interview Questions": "What experience do you have with Cameras and film equipment?"}, {"date": "12 Jun 2017", "title": "Instructor, College Or University Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at New York Film Academy (Los Angeles, CA) in Jan 2015", "Interview Descriptions": "I was referred to the department chair by a friend who taught there.  I sent my CV and bio and was contacted by the chair for an interview.  I met with her and was hired with the condition that I come in and teach a mock class to a select group of faculty and students.", "Interview Questions": "She asked me about my experience teaching and my professional experiences.  Asked about my availability etc. "}, {"date": "12 Nov 2017", "title": "Equipment Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at New York Film Academy (Burbank, CA) in Nov 2014", "Interview Descriptions": "Very basic. A couple of questions about my background, who referred me, and the rundown of the position.  1 phone call, 2 interviews. The orientation was too quick to catch up but when you get in the shifts, it becomes easier to understand the procedures and policies. The other TA's  are helpful and willing to breakdown any equipment questions that I had.", "Interview Questions": " Availability. "}, {"date": "28 Jul 2015", "title": "TA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at New York Film Academy (Burbank, CA) in Aug 2014", "Interview Descriptions": "Simple, but pretty drawn out. Pointless testing of knowledge for programs. Applied online, sat down 1-on-1, took a test, got an offer a few days later. Corporate process of hiring takes too long.", "Interview Questions": "Have you worked in a school before."}, {"date": "21 Oct 2014", "title": "Social Media Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at New York Film Academy (New York, NY) in May 2014", "Interview Descriptions": "In person. The president asked me to work for them. He wanted to see my work. Asked if I've ever worked on advertising. Asked me, what my vision is. What do I think I would do there.", "Interview Questions": "Amount of money I'm hoping for."}, {"date": "26 Nov 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at New York Film Academy (Los Angeles, CA) in Apr 2014", "Interview Descriptions": "It was a very interesting open conversational process. We had a great chat on the skills that would benefit the company as well as the advantages I am going to get from them.", "Interview Questions": "How is your relations?"}], [{"date": "1 Dec 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New York Film Academy (New York, NY) in Mar 2014", "Interview Descriptions": "Straightforward and had a chance to show off my skills to a listening panel. There was no follow up. I had to call to check in and it seemed out of sight out of mind for the hiring manager. They were like \"Oh ya! we want to hire you. Start next week.\"", "Interview Questions": "To give them a demo teaching lesson"}, {"date": "14 Jun 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at New York Film Academy (Burbank, CA) in Mar 2013", "Interview Descriptions": "The interview process was pretty fun and welcoming, extending the prospective teacher the opportunity to teach a mock class and receive questions and feedback from chairs and CEO. However, even at this early stage of the process, I sensed some hostility between the faculty chairs and the executive members.", "Interview Questions": "How will you make your material reflect the \"hands-on\" nature of filmmaking?"}, {"date": "16 Oct 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at New York Film Academy (New York, NY) in May 2012", "Interview Descriptions": "It involved a hands on test to see your ability to work with the cameras they use at the film academy and a written test as well. Personality and connections will help you get through the door as well. Be calm, knowledgable and likable and you will probably be a shoe in.", "Interview Questions": "Written test about ability\r\nHands-on camera test"}, {"date": "11 Jul 2012", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New York Film Academy (New York, NY) in Jan 2012", "Interview Descriptions": "Interviewed me once, and then offered me the position over the phone.", "Interview Questions": "What kind of ideas do you bring to the table? "}]]