[[{"date": "29 Jul 2019", "title": "Strategy Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Institute for Healthcare Improvement (Boston, MA) in May 2019", "Interview Descriptions": "Phone interview came first followed by request for on-site interview.  Interviews with multiple department heads in person.  The phone interview was also detailed with questions about background, but also to explain position relevant experience and problems encountered and how addressed.", "Interview Questions": "Give me a specific example of a time when you failed at something."}, {"date": "15 Mar 2018", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Institute for Healthcare Improvement", "Interview Descriptions": "fairly relaxed but professional, standard questioning, there were two interviews in the room and me, initial phone screen then an in-person interview at IHI, no complaints overall, pleasant experience", "Interview Questions": "what is your biggest accomplishment "}, {"date": "11 Mar 2018", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Institute for Healthcare Improvement (Boston, MA)", "Interview Descriptions": "Referral led to a phone interview and then a marathon interview in person with 5 separate people. Typical questions about background and the like. They like you to go in with knowledge of the company’s background and values.", "Interview Questions": "Why IHI?"}, {"date": "20 Oct 2016", "title": "Temporary Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Institute for Healthcare Improvement (Boston, MA) in Sept 2016", "Interview Descriptions": "I was emailed to schedule a phone screening/interview.  We scheduled for the following week and I was called on time, just when we planned.  The interviewer was pleasant, had a handful of questions, and took notes on my answers throughout our conversation.", "Interview Questions": "Give an example of a difficult situation at work and how you found a solution."}, {"date": "19 Jan 2018", "title": "Event Planning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Institute for Healthcare Improvement (Boston, MA) in Sept 2016", "Interview Descriptions": "Quickly was asked to meet on campus for interview with two individuals from the company. 30 minute interview. Basic interview questions. Wished that someone from the event planning department was present for interview because the individuals didn't know everything", "Interview Questions": "What are your strengths?"}, {"date": "16 Jul 2015", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Institute for Healthcare Improvement", "Interview Descriptions": "I first got a phone call and interviewed briefly about myself and I  was told I would be contacted in a couple weeks. Then I got an email week later for an in-person interview. I talked to project manager and a coordinator for about an hour who were both incredibly nice and obviously passionate people. They asked me a lot of behavioral questions and questions regarding conflict and relationship with colleagues. Then a week later I was asked to fill out 5 reference names and they were sent a survey. After a week I was contacted for a third and final round of an interview where I met with more people from the team and HR and spent 2 hours talking more about my background and explaining why I would fit best with the position. A couple later I got a phone call to tell me I didn't get the job.", "Interview Questions": "What is a time you had to face ambiguity?"}, {"date": "28 Aug 2015", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Institute for Healthcare Improvement (Cambridge, MA) in May 2015", "Interview Descriptions": "I applied online and got an email for an interview a week and a half later. The phone screening consisted of basic interview questions. A week later I was asked to come into the office to interview with five different people. There four different 30 min interviews. After these interviews I felt like I knew a lot more about the position and their company. Finally, two weeks later I came in for a final interview with the Director. A week later I got an email to follow up with the status of the position and they said that they found someone with direct experience.", "Interview Questions": "Give an example of how you worked with a difficult person."}, {"date": "18 May 2015", "title": "Community Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Institute for Healthcare Improvement in Apr 2015", "Interview Descriptions": "I was contacted by HR to set up a phone interview.  I was expecting to speak to HR, but I was actually called by the person who would be the position's supervisor, which was a pleasant surprise, since I felt we could better discuss the work involved.  My interviewer was cordial and pleasant, and let me know that they would get back to me within a few weeks.  A month later, they let me know by email that they were pursuing another candidate.", "Interview Questions": "All the questions were fairly standard.  The first question was what drew me to this position and this project specifically."}, {"date": "13 Mar 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Institute for Healthcare Improvement (Boston, MA) in Feb 2015", "Interview Descriptions": "I applied online and received an email from HR to have a phone interview. I was not told who I would interview with so I assumed it was the HR person who contacted me. Instead it was not. It was the hiring manager who launched into questions without introducing herself, position, and role in the hiring process. I only found this out at the end when I could ask questions. I was contacted for an in person interview again without being told who or many people I would meet with. I ended up meeting with 3 separate people. In the 3rd interview I again met with a series of people and was surprised with a timed writing sample.", "Interview Questions": "The questions were all pretty standard and expected."}], [{"date": "18 Nov 2014", "title": "Staff Accountant - Accounts Payable Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Institute for Healthcare Improvement in Oct 2014", "Interview Descriptions": "I applied for the Staff Accountant position about 1 month ago. Received an email from HR asking me to come in for an interview. Met with HR member, the Sr Accountant and the Controller. Very pleasant and personable people. It was a very enjoyable and exciting interview. I didn't think I would make the cut, but a week later, I received an email asking me to come in for a second interview, which is this week.", "Interview Questions": "The HR representative asked me where I saw myself in 15 years. To be honest, that is not even a thought in my mind, but gave the answer, I would give for \"Where do I see myself in 10 years?\" "}, {"date": "8 Oct 2014", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Institute for Healthcare Improvement in Sept 2014", "Interview Descriptions": "Phone interview with what I thought would be one person (as is the norm) instead I was surprised to be put on speaker phone with multiple people. Not only was it strange but not productive as I could barely hear them as there was background noise and constant interrupting.  It reminded me of why I left the non-profit world in the first place. Sometimes their processes can be off and they really don't think things through. In corporate it is common sense: Phone interviews are preliminary screenings; Group interviews are reserved for in-person. By  the end of it I knew it was not a place I wanted to work.", "Interview Questions": "Tell us about your background"}, {"date": "19 Aug 2017", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Institute for Healthcare Improvement (Boston, MA) in Apr 2014", "Interview Descriptions": "In person, easy access, relaxing; I was interviewed by two people who worked on two different projects which was great because I got to learn about the organization from both angles.", "Interview Questions": "what am I interested in?"}, {"date": "12 Mar 2014", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Institute for Healthcare Improvement", "Interview Descriptions": "Two rounds of interviews with about 6 individuals total. They are very thorough.", "Interview Questions": "N/A"}, {"date": "23 Nov 2015", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Institute for Healthcare Improvement (Cambridge, MA) in Oct 2012", "Interview Descriptions": "One phone interview and one in person interview. The phone interview was very straightforward--I spoke with someone on the potential team that I would be working with and a woman in HR. The in person interview was just with the team that I ultimately joined.", "Interview Questions": "Tell me about yourself"}]]