[[{"date": "12 Jan 2021", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Trinity University", "Interview Descriptions": "Found position online on student worker list and applied easily via email. The standard interview process, communication via email, and video interview online. Standard questions for students including experience and schedule for the upcoming semester.", "Interview Questions": "What is your schedule for the upcoming semester?"}, {"date": "18 May 2018", "title": "Student Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Trinity University", "Interview Descriptions": "Very positive experience.  Interviewed with the director, and was offered the position.  Interview questions were straightforward.  The interview took 30 minutes and I was given a tour of the building.", "Interview Questions": "Why are you interested in this position?"}, {"date": "29 Jul 2019", "title": "Tiger Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Trinity University (San Antonio, TX) in Jan 2018", "Interview Descriptions": "Very easy and straightforward hiring and interview process. Schedule interview via email and have a short interview with visit team. It is only one 1:1 interview and afterwards they will email you if they have an offer for you or no.  However, I was referred by a former employee.", "Interview Questions": "What do you like most about Trinity? What are you involved in around campus?"}, {"date": "16 Feb 2020", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Trinity University (San Antonio, TX) in Nov 2017", "Interview Descriptions": "A 7-hour process with 17 individuals and groups... the questioning was pretty simple and basic, but geez, 7 hours, 17 people; my head was spinning at the end of the day.", "Interview Questions": "What can you do to help break down the cross-divisional silos?"}, {"date": "6 Oct 2017", "title": "Web Service Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Trinity University", "Interview Descriptions": "The interview process was quick and easy, because they expect you to be able to learn as you go. They are more worried about your work ethic then anything else.", "Interview Questions": "How do  you manage time?"}, {"date": "1 Nov 2016", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Trinity University (San Antonio, TX) in Jul 2016", "Interview Descriptions": "I submitted an application online, and by the following week they had contacted me to \"stop by\" to discuss the position further. The interview itself was with 3 people, very informal. Each had their own set of questions, and bounced back and forth between them. This was the only interview and I was notified about their decision by the end of that same day.", "Interview Questions": "Why do you want to leave your current job?"}, {"date": "25 Mar 2014", "title": "Residential Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Trinity University (San Antonio, TX)", "Interview Descriptions": "Several interviews including group, individual, and panel. They are looking for leaders that know how to lead through empowering.  Be honest and and think outside the box.  They really care about compliance to policy, but they do want to know that you have a mind of your own.  Very few students actually get accepted.", "Interview Questions": "What rule would you change?"}, {"date": "13 Feb 2014", "title": "Phonathon Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Trinity University", "Interview Descriptions": "Found out about position through advertisements sent through mail. After sending them in, I scheduled a phone interview. The interview was only a few minutes long, and very casual. The whole process took a few days and was generally very easy. Does not seem extremely exclusive, easy to get in, especially for Federal Work Study", "Interview Questions": "This is a job calling people for donations, the question will generally see if you can describe something, sell it, or be persuasive. For me, it was \"please tell me about your favorite restaurant in a way that would make me want to go there\""}, {"date": "11 Sept 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Trinity University (San Antonio, TX) in May 2012", "Interview Descriptions": "Called by department head, asked to interview. Informal feeling but with as many faculty as were available. Felt comfortable answering questions and they seemed excited to meet with me.", "Interview Questions": "Tell us about what you have been doing since we last saw you"}, {"date": "18 Jul 2009", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Trinity University in Nov 2007", "Interview Descriptions": "Started with a 20-minute interview at a \"cattle call\" at a conference.  Probably made a good impression since I was flown out for an onsite interview, which lasted 3 days.  The onsite interview consisted of lots of one-to-one interviews with people of varying importance/power; meals with potential colleagues and supervisors; a research presentation; a teaching presentation; tour of the campus; and tour of the city. Total of approximately 32 hours (8/16/8) over three days, plus air travel time.  Very intensive and exhausting process.", "Interview Questions": "Convince us that you want this job (that you would take the job if offered to you)."}]]