[[{"date": "23 Feb 2023", "title": "Addictions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Gateway Foundation", "Interview Descriptions": "contacted through email to schedule 1. phone screen then there is 1. Zoom interview shortly after consisting of various scenarios that you may or may not have or will experience", "Interview Questions": "What was the most difficult situation you encountered and how did you handle it ? okay"}, {"date": "30 Aug 2022", "title": "Substance Abuse Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Gateway Foundation (Chicago, WI) in Jun 2022", "Interview Descriptions": "There was minimal communication from the recruiter durning the interview process. They are a small practice and want to expand but do not seem to have the capacity to recruit for that level of staff. The interview was ease and had just the basic questions on group therapy experience", "Interview Questions": "why gateway over other substance use counselor positions"}, {"date": "8 Mar 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Gateway Foundation (Chicago, IL) in Feb 2022", "Interview Descriptions": "Super relaxed and asked about strengths and weaknesses. Talked about the duties of the intern. Described the ability to learn and grow at the company. Talked about hiring in house.", "Interview Questions": "What is one of your limitations?"}, {"date": "24 Nov 2020", "title": "Substance Abuse Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Gateway Foundation", "Interview Descriptions": "There is a three part interview process. Interviewers were nice but over sold the prison’s safety. They conveniently did not mention the riot that took place in 2016. That made them seem dishonest.", "Interview Questions": "What are some interventions you would use. "}, {"date": "20 Oct 2020", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Gateway Foundation", "Interview Descriptions": "I interviewed and got a call back the day after with an offer! It was a hard interview but the interviewers were so kind. I had 3 different managers in my interview", "Interview Questions": "Where do you see yourself in5 years"}, {"date": "10 Jul 2019", "title": "Ar Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Gateway Foundation", "Interview Descriptions": "Youll go thru about two phone interviews which are easy going and smooth then meet in person with the managers. low stress interview. truly a great company to work for", "Interview Questions": "N/A"}, {"date": "5 Apr 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Gateway Foundation (Caseyville, IL) in Apr 2019", "Interview Descriptions": "Received a call for an interview.  Initial interview was 1:1 and  informal.  The second interview involved  three other people that would be my coworkers.  The interview was informal and conversational. I felt at ease to ask the questions that I needed in order to determine if this was a good fit for me.", "Interview Questions": "How do you handle multiple tasks.  How have you handled working with difficult people."}, {"date": "20 Mar 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Gateway Foundation (Aurora, IL)", "Interview Descriptions": "Spoke with main supervisor to set up interview.  Was asked during interview what my goals, experience and such were. Was granted a second interview with the whole team of IOP counselors with their interns. Each person took time asking about goals, exp, why I wanted to be there and such. There were about 12 people interviewing me.", "Interview Questions": "Why do you want to intern here?\r\nWhat experience do you bring with you?\r\nWhat do want to do with your career?"}, {"date": "25 Feb 2019", "title": "Talent Acquisition Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Gateway Foundation (Chicago, IL) in Nov 2018", "Interview Descriptions": "Efficient, quick, thorough, and very professional. It was done in a timely manner and I wasn't kept waiting to hear back for the second interview and for the third interview.", "Interview Questions": "How do you recruit hard to fill positions? What was the outcome? "}, {"date": "1 May 2018", "title": "Executive Office Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gateway Foundation (Chicago, IL)", "Interview Descriptions": "Weird interview for the position. I had a phone interview first and within the same week, was invited for an in-person review with the HR Manager and some other guy. I arrived in the small disheveled  office and amalgamated environment of folks. Who seemed to be running around like chickens with their heads cut off. This made me very uneasy. The interview was severely intense as if I was interviewing for a VP position.  Both interviewers read questions off of papers and both seemed unprepared and quite honestly -  unfriendly or more like - stressed. Almost as if they didn't have time to be interviewing for the position -  at least that's the impression I got. In any case, after I heard the history of the role and the hybrid job description, I decided it wasn't a good fit for me before the interview was even over. They seemed to be searching for a unicorn of some sort with the use of 5 hands.", "Interview Questions": "How are organized are you?"}], [{"date": "21 May 2018", "title": "Counselor II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Gateway Foundation in Feb 2018", "Interview Descriptions": "Standard interview with 2 administrators alternating asking questions.  The questions were different than what I've experienced with most job interviews as it was greatly focused on previous employer evaluation.", "Interview Questions": "What is something you did not like about your previous employer."}, {"date": "9 May 2017", "title": "HRBP Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Gateway Foundation", "Interview Descriptions": "A recruiter within the organization reached out to me stating the organization had an HRBP role open.  He sent me the \"job description\" which was really only the requirements for the role not any of the action items and a \"blurb\" about the company.  Very informal documents looked as though they were cut and pasted into a word document.  I looked on the website there was no HRBP role listed but an employee relations specialist.  The two positions are very different in the HR world.  Once I spoke to him about the role, sure enough it was the employee relations specialist role that he was trying to recruit for not an HRBP.  I looked back on their website under the Employee relations role and it was the job description from the website except the action items were deleted.  Very deceiving and quite sketchy if you ask me.  Just be open and honest about the role you are recruiting for.  Why bother recruiting if you are trying to hide what the actual role is?", "Interview Questions": "Is this something that would interest you? "}, {"date": "27 May 2017", "title": "Substance Abuse Counselor I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Gateway Foundation in May 2017", "Interview Descriptions": "I applied online and received an email from the facility Clinical director the same week.  I interviewed at the clinic a week later.  The interview roundtable was comprised of the Clinical Director, Assistant Director and HR Manager.  All three took turns asking me a series of Mental Health related questions, mostly pertaining to substance abuse within the correctional population.  Most of the questions were hypotheticals or situational awareness/reactivity based on past experiences.  The interview lasted an hour and a half, at which point the Director gave me a job offer, which I accepted.  He then went over the salary, benefits and asked what shift I would want to work.  Shortly thereafter, the HR Manager took me to her office and we filled out paperwork.  For this particular position (correctional) a urinalysis and fingerprints are required and time sensitive (48 hours).  I was given a tentative start date of mid-June.", "Interview Questions": "Have you ever had a client or supervisor question your treatment plan?"}, {"date": "24 Mar 2017", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Gateway Foundation", "Interview Descriptions": "one phone session, two in person interviews with four different senior employees, followed by a tour, very god interview process, made me feel like I was getting into a job that valued the work that went on there.", "Interview Questions": "Do you know how to counsel, things about boundaries"}, {"date": "21 Oct 2016", "title": "Counselor I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Gateway Foundation (Aurora, IL) in Jul 2016", "Interview Descriptions": "I had 2 interviews. The first one was with my future supervisor and 2nd was with administration.  It took about 4 weeks between my interviews and my start date.", "Interview Questions": "Give an example of what working as a team would be"}, {"date": "18 Aug 2016", "title": "Substance Abuse Counselor I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Gateway Foundation (Austin, TX) in Jun 2016", "Interview Descriptions": "During the hiring process there are two interviews you must get through to receive an offer.  The first interview is usually with two Clinical Supervisors since they are the supervisors who oversee the work the Counselors do.  This interview was fairly easy, but went by kinda quick after they asked at least 10 questions relating to the job.  As a 0 hour Counselor Intern I didn't have any experience with this type of work, but I did have education and all the questions were related to how you would handle yourself in a stressful or questionable situation. It may help to look them up online in order to see what exactly the job requires too. \r\n\r\nThe second interview was with the Executive Director of the site.  It was easy and I was shown the grounds in the prison afterwards.  After the interview they give some salary info and basically tell you if they think you will get the job or not.  \r\n\r\nThe interviews were two weeks apart in June of 2016, I got an offer July 1, 2016, but I didn't officially start until August 17, 2016.  Their hiring process is slow and it may be frustrating but if you want the job you may have to wait at least 6-8 weeks to start after you receive an offer.", "Interview Questions": "Q: How would you handle an irate client who is refusing your help?"}, {"date": "12 Jul 2016", "title": "Counselor I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Gateway Foundation (Burnet, TX) in May 2016", "Interview Descriptions": "The interview process was pretty straightforward. They seemed mainly concerned with problem-solving ability, and most questions were \"what would you do if.....\" and \"name a time when\". I had never worked in a prison before and did poorly on these questions, hence, no job offer. I've heard Gateway is great about hiring counselors with little to no experience, but I advise making sure you go in prepared to answer specific questions about how you should react when faced with difficult situations in a prison. As a strengths-oriented counselor, I walked away feeling like I wish I'd had a chance to discuss my strengths. The questions were oriented to mistakes you'd made, people you didn't get along with, your weaknesses, and problems you might face. I wish I had gone in expecting this and considered how I might put a positive spin on the interview, as I just finished my Master's and felt I had a lot to offer.", "Interview Questions": "How would you calm down an irate client? Gain control of a counseling group who isn't paying attention? What's your greatest weakness? What would you do if you felt intimidated by an inmate?"}, {"date": "27 Feb 2016", "title": "Substance Abuse Counselor I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Gateway Foundation", "Interview Descriptions": "Met with two supervisors for first interview. They were friendly, asked basic questions about my background etc... Talked about handling stress, people having emotional crisis, and asked for experience solving problems with others. A few days later I met with a supervisor and the administrator for second interview. More of the same, this was more of a personality assessment I think. Very laid back.", "Interview Questions": "How do you solve problems?"}, {"date": "19 Nov 2015", "title": "Substance Abuse Technician/'CD' Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Gateway Foundation (Lake Villa, IL) in Nov 2015", "Interview Descriptions": "Two interviews, both went smoothly. When the first person was comfortable recommending me to the next one, the second interview was established. Five interviews if you count the reference checks, the background and credit checks, and the urinalysis/drug test.", "Interview Questions": "There were no out of the ordinary questions asked. They had a list of about three to six, and I was able to comfortably share my honest responses with them. Preparation helped, knowing their  company a little bit and being able to share about where I was currently working helped, too. I was moving from one top level organization to another in a different city and state, slighty different area of exptertise but same basic industry and same basic job. If you're going in blind, it likely would be a very difficult interview, but otherwise, there was nothing out of the ordinary that was asked of me."}, {"date": "23 Dec 2015", "title": "Counselor II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Gateway Foundation (Chicago, IL) in Aug 2015", "Interview Descriptions": "Spoke with a fake racist supervisor and she asked a lot of dumb questions, really just wanted to be friends it seemed. I thought it was a joke and when I started there I was sure it was just a joke. They play alot of games there and it seems to be a good company but they are full of it from the start.", "Interview Questions": "All dumb questions really just wanted someone to like her"}], [{"date": "17 Jun 2015", "title": "Substance Abuse Counselor I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Gateway Foundation (Springfield, IL) in May 2015", "Interview Descriptions": "They call you for an interview, say that they will call you for a 2nd interview or call you to let you know if they've decided to pursue other candidates.", "Interview Questions": "A lot of questions about group work and conflict. Typical interview questions."}, {"date": "30 Nov 2015", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Gateway Foundation (Chicago, IL) in Mar 2015", "Interview Descriptions": "The interview process consisted of two rounds of onsite interviews with two interviewers each time. Reference checks were completed following the second interview. After the offer is extended you need to pass a background check and drug screen.", "Interview Questions": "Standard behavioral-based interview questions"}, {"date": "27 Apr 2015", "title": "Talent Acquisition Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Gateway Foundation (Chicago, IL) in Mar 2015", "Interview Descriptions": "The Director of HR emailed me to set up a time for us to have a phone interview. The HR Director called me and we discussed the opportunity as well as my background. I was told they would follow up within a few days and never did. I sent her a thank you email and you would have thought she would have at least said \"Thank you for your time but we have decided to pursue other candidates at this time\". HR Director never responded back to my email which I feel was very rude and ignorant. \r\n\r\nIt was probably a blessing  not to get this job. I would like to move into a Recruiting Manager role in the near future and honestly I don't think there is room from advancement here.", "Interview Questions": "Typical just asked me about the company's I worked for and my experience."}, {"date": "7 Dec 2015", "title": "Substance Abuse Counselor I Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Gateway Foundation (Burnet, TX) in Apr 2014", "Interview Descriptions": "The interview itself was ok, but it took 4 months to get hired! The office manager was on leave, and staff misplaced my paperwork, more than once. I asked the staff for assistance in getting TDCJ clearance, but they just kept resending the same paperwork to me. Staff was hostile and dismissive before I ever started the job.", "Interview Questions": "What is the most important aspect of the job?"}, {"date": "9 Jan 2014", "title": "Substance Abuse Counselor I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Gateway Foundation", "Interview Descriptions": "Primary Interview with Program supervisor and secondary with executive director", "Interview Questions": "Why do you want to work with substance abuse clients? -they don't want to hear about personal or family exposure, be more general i.e \"the effects of drugs on a family is significant\" and not \"Drugs really impacted my family\""}, {"date": "31 Oct 2017", "title": "Substance Abuse Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Gateway Foundation (Lake Villa, IL) in Apr 2013", "Interview Descriptions": "Great experience interviewing. Interviewed with two different managers and then a second interview with the director.  Got a call offering me the job, went in to that day to complete paperwork and do drug test. Only to be unhired later that day with no explanation.", "Interview Questions": "Explain a time when you had to work with a difficult client."}, {"date": "19 Mar 2013", "title": "Substance Abuse Counselor I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gateway Foundation (Richmond, TX) in Mar 2013", "Interview Descriptions": "the interview process was pretty standard, they explained what hours would be and that you have to be available for either shift to be considered for work.", "Interview Questions": "what theories work the best for you."}, {"date": "22 Sept 2015", "title": "Counselor II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Gateway Foundation (Brownwood, TX) in Aug 2011", "Interview Descriptions": "The interview process begins with an application.  After that, the director or the assistant director will call you for a telephone interview.  Following that, the director or clinical director will call you for a face to face interview.  A third interview will follow with fingerprints and a background check.", "Interview Questions": "Q.  Why do you think that you would be a good addition to the company?"}, {"date": "9 Feb 2012", "title": "Substance Abuse Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Gateway Foundation (Aurora, IL) in Jun 2011", "Interview Descriptions": "The job described in the interview is not the job you get once you go through orientation and present for work.  Management is very dishonest with job descriptions in general.", "Interview Questions": "There was nothing difficult or unexpected asked."}, {"date": "1 Mar 2014", "title": "Substance Abuse Counselor I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Gateway Foundation (Clinton, NJ) in Jun 2011", "Interview Descriptions": "Took 3 months from initial interview to hire. Interviewed with site director and clinical supervisor. Toured facility.", "Interview Questions": "How did you solve a problem you had one time? This was really vague and no more information was given and it was difficult to answer."}], [{"date": "3 Jun 2014", "title": "Team Lead Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Gateway Foundation (Chicago, IL) in May 2011", "Interview Descriptions": "2 interviews, meeting with CFO and Directors, HR recruiting was helpful people were easy to schedule with location was easy to find timing was convenient.  Staff was helpful. feedback was quick and informative. office was bright and professional", "Interview Questions": "How do you handle difficult people"}, {"date": "13 May 2014", "title": "Clinical Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Gateway Foundation (Chicago, IL) in Oct 2010", "Interview Descriptions": "Two interviews, first was with the hiring manager.  Second was with the hiring manager and two other employees, one with management, and the other a director.  Interview process was fair.  Behaviorally-based questions.  As long as you are prepared with answers to behaviorally based questions like \"Tell me about a time when you had to resolve a conflict with a co-worker.  What did you do?\"", "Interview Questions": "There really weren't any as I was well prepared for the interviews."}]]