[[{"date": "7 Jul 2023", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Santa Monica College (Santa Monica, CA)", "Interview Descriptions": "The interview process was long, and interviewers seemed cold and unwelcoming. After a month, I recieved a response to move onto the first portion of the interview, an online assestmemt. Two weeks after completing the assessment, I moved onto the next round in the process which was a virtual interview scheduled a week out from their initial response. I recieved some worksheets on how to prepare for the interview and example responses, but this did not prepare me for how cold the interviewers would be. I was notified that a panel of 6 individuals would be interviewing me, and was only interviewed by 2 which wasn't bad. But upon starting the interview the staff gave me the feeling that they needed to interview me for the sake of the process and was already not considering me. They were cold with introductions, and most of the time were not looking at the screen when I was speaking to them. SMC discusses and promotes a non-biased interview process, but the removal of all energy and emotion from the interview made me feel unwelcomed and very distant from my interviewers. The interview was a total of 30 minutes on zoom, I was put on a list of Administrative Assistants to be moved onto the next round but will not be moving forward with the company as this was one of the most uncomfortable interviews I have had.", "Interview Questions": "How have you created and fostered relationships with your supervisor/managers/coworkers in previous positions?"}, {"date": "14 May 2023", "title": "Career Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Santa Monica College (Santa Monica, CA)", "Interview Descriptions": "Extremely offensive and elitist interview experience. Would not recommend if you want to work with an open minded team who is professional, inviting, and supportive. I really wanted to write a good review of this office, but after speaking with numerous Higher Ed professionals about my experience who all agreed it was pretty unprofessional, I had to keep it real here. Hopefully they have changed some of their practices and team dynamics since this interview, but if you get a bad feeling when you interview, trust it.", "Interview Questions": "Tell me about yourself Why are you interested in this position What is your experience in the field What is your Meyers Briggs personality type"}, {"date": "17 Mar 2022", "title": "Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Santa Monica College (Los Angeles, CA) in Mar 2022", "Interview Descriptions": "The interview was conducted through Zoom. I had 30 minutes to review questions and a teaching demo that didn't go as planned. The energy was off. I prefer in-person interviews.", "Interview Questions": "What has been a challenging or inspirational interaction with a student?"}, {"date": "29 May 2023", "title": "Peer Navigator/Intake Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Santa Monica College (Santa Monica, CA) in Aug 2021", "Interview Descriptions": "Very professional , helpful and kind. The people running it want to see you thrive and hope to have you on their team. We were put into a group interview session where we were made to do multiple exercises showing our communication, team working and quick thinking skills.", "Interview Questions": "We had the group interview"}, {"date": "25 Jan 2023", "title": "Virtual Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Santa Monica College in Feb 2021", "Interview Descriptions": "I was interview by the department head. Everyone is really nice. They asked generic questions and were really helpful and able to answer all the questions I had about the role.", "Interview Questions": "Tell me about e yourself"}, {"date": "14 Dec 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Santa Monica College (Los Angeles, CA) in May 2020", "Interview Descriptions": "Was very casual and friendly. Most of the interview was spent describing the internship and what the department did. It was over zoom and the supervisor was friendly and open.", "Interview Questions": "What is it that you would like to get out of this internship?"}, {"date": "26 Jan 2020", "title": "Full Time Faculty Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Santa Monica College (Santa Monica, CA) in Jan 2020", "Interview Descriptions": "There were two rounds of interviews. The first round was with a panel of faculty members and staff (heavily technical). The second round was with the President. Overall, it was a whirlwind, but make sure you reached out to Human Resources and ask questions because they were really helpful.", "Interview Questions": "How would serve the diverse student population at SMC?"}, {"date": "31 May 2019", "title": "SI Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Santa Monica College", "Interview Descriptions": "There are 2 rounds, first is paper test, you can select which class you want to tutor, then you are required to get 80% of the test right so you can move to second round. There will be two people interview you, the questions are not hard, basically behavior then you have few minutes to explain a question they will give you. Overall a great experience. You do learn a lot from working as a SI leader.", "Interview Questions": "how to provide extra help for needed people"}, {"date": "30 Mar 2019", "title": "Full Time Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Santa Monica College", "Interview Descriptions": "The interview was an exam! They asked me questions in my major. So this is exam NOT an interview. They put lecturers with masters degree in the committee to ask someone with a Ph.D!", "Interview Questions": "How to approach minority students?"}, {"date": "20 Nov 2018", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Santa Monica College", "Interview Descriptions": "Far too intensive/time-consuming for a technician position! The first step is a written exam offered on a single set date (Saturday). Took the morning to complete. The exam was simple enough and as expected from the job title. Then, an oral exam is conducted several weeks later. This again is on a set date (weekday) without flexibility and not leaving any room for input from you or your questions. The final step on your end is an ACTUAL interview (YAY!) that lasts less than 20 minutes and is not at all about getting to know you or your skills, rather yet another set of questions very similar to those in the oral exam.  Again, there is no time/room for input from you, which is a clear indication to me that they are not looking for a long-term employee who would really excel there. I would estimate at least 8 people (8!!) made it to the actual interview for a single open position. Overall, I was displeased with the process, and the apparent lack of interest by the interviewers. I would not recommend this process unless you are out of work and have a LOT of time to devote to a convoluted process that is stacked against you. The interview itself was pretty easy and typical of any random position, however the process itself was far too complex for a position like a lab tech.", "Interview Questions": "What would you do if you had a disagreement with a co-worker?"}], [{"date": "7 Dec 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Santa Monica College (Santa Monica, CA) in Aug 2018", "Interview Descriptions": "Email application with first round of interview with the job coordinator. Involved going over the job responsibilities, expectations and prior experience. Also discussed the job schedule followed by the job offer.", "Interview Questions": "Q) Have you ever worked in life sciences department before - if yes, what were your job responsibilities."}, {"date": "7 Oct 2020", "title": "Math Totur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Santa Monica College (Los Angeles, CA) in Mar 2018", "Interview Descriptions": "The staff were professional and kind and the facilities were great. I was a student at Santa Monica College and went through the math department there as a student. After completing most of the courses offered by the math department with a 4.0 GPA I was offered a tutoring position.", "Interview Questions": "Explain your math background and education."}, {"date": "22 May 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Santa Monica College", "Interview Descriptions": "Very lengthy process. Skills test then if you pass, move on to the screening interview which judges your qualifications and really your fit. if you pass you are put on a list of possible interviewees, then you move on to interviewing with the hiring department.", "Interview Questions": "your experience"}, {"date": "21 Aug 2017", "title": "Custodial Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Santa Monica College (Santa Monica, CA) in Jan 2017", "Interview Descriptions": "Basic custodial and work ethic questions are asked.  If you pass you'll get invited to take a performance test..then another oral interview.  All for just a 6 month temporary position.", "Interview Questions": "Do you work well with others?"}, {"date": "24 May 2017", "title": "Personnel Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Santa Monica College (Santa Monica, CA) in Oct 2016", "Interview Descriptions": "I submitted an application, then was contacted for a phone screen. After that, I did a written technical test for MS Excel along with a Skype interview. SMC was very accomodating as I was on the East coast moving west, and they let me interview and do the process remotely.", "Interview Questions": "How are your Excel skills?"}, {"date": "27 Apr 2016", "title": "Supplemental Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Santa Monica College (Santa Monica, CA)", "Interview Descriptions": "Short and not too complicated. Most questions were related to the subject you are interested in teaching. Some experience questions, as well as schedule availability. The supervisor does the interview one on one, and he is very nice and friendly.", "Interview Questions": "What experience do you have teaching?"}, {"date": "7 Nov 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Santa Monica College (Santa Monica, CA) in Aug 2015", "Interview Descriptions": "It was very simple with basic questions.The interview had lasted for about 10 minutes and then I was given a tour of the office. I then stayed a bit longer just to see how this were run.", "Interview Questions": "Have you worked in an office before?"}, {"date": "26 Apr 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at Santa Monica College", "Interview Descriptions": "face to face interview it was not that hard at all.\r\nFirst I went to the department and ask department chair to ask want to work at there.\r\nDepartment char comes out gave me the paper that fill out my information and my back ground and returned it", "Interview Questions": "Basic knowledge of general chemistry"}, {"date": "24 May 2015", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Santa Monica College (Santa Monica, CA) in Jan 2015", "Interview Descriptions": "Long process -- first an exam, which was difficult, then two interviews. The process was long and took three Saturday mornings to complete. The exam was complicated and some questions seemed unfair to me. The first interview was timed and scored on a scale of 0-100. The interviewers asked very specific questions, some of which should have required review to answer fully and completely.", "Interview Questions": "What is one of your weaknesses?"}, {"date": "4 Sept 2014", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Santa Monica College", "Interview Descriptions": "The traditional route to getting hired is long and lengthy.  I got the job in a rather more informal way because I was hired first as part of work-study.  That interview was made up of completing an exam to assess your mathematical skills.  Once you pass that then you moved on to talk to the mathlab coordinator and she told me when I could start.  \r\nIf you are going directly through the SMC website then you submit your application.  Then you receive an email in which you are assigned a date to complete an exam which consists of various math topics ranging from arithmetic - calculus.  If you pass that first phase then you continue on to the second phase which is front of a panel.  They ask you various technical questions and your method of solving such questions.  If you pass that phase then you move on to the final stage where you are asked more questions and at the end you'll be told whether or not you got the position.", "Interview Questions": "Know your trig identities very well"}], [{"date": "27 Sept 2015", "title": "International Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Santa Monica College (Santa Monica, CA) in Aug 2014", "Interview Descriptions": "Interview seemed to go well with a large group of faculty and staff members. Before the interview, I was given a series of questions (8 if I recall correctly) that I could reflect upon for 20 minutes before the actual interview. During the interview 8 out of the 12 or so panelist asked a question each. Very little follow-up questions or discussion.", "Interview Questions": "A series of committee prepared questions about previous experiences, how I may have managed a crisis in the past, and how I would engage new partners."}, {"date": "8 Mar 2014", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Santa Monica College", "Interview Descriptions": "Overall ambiance was very friendly and welcoming. Interview process was done in a timely manner.", "Interview Questions": "Skill Test - Random questions were chosen from the book by prospective supervisor for the candidate to answer."}, {"date": "22 Dec 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Santa Monica College (Santa Monica, CA) in Jun 2013", "Interview Descriptions": "One group interview with several panelists.  I met with a group of several full time faculty who asked me relevant questions regarding my teaching history and methods.  I was asked if I had experience working with students from a variety of backgrounds.", "Interview Questions": "Relevant experience and teaching pedagogy"}, {"date": "22 Nov 2015", "title": "Computer Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Santa Monica College (Santa Monica, CA) in Jun 2013", "Interview Descriptions": "I filled an application online then invited for an interview. First interview was a written test and the second one was with the lab manager. It was easy for me, because I had some experiences in this field. Mr.Lee is a great manager and he will hire you if he feels you can be helpful.", "Interview Questions": "Basic technical questions about computer and Microsoft office"}, {"date": "25 Nov 2015", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Santa Monica College (Santa Monica, CA) in Jan 2012", "Interview Descriptions": "lengthy and competitive. first if your resume meets the minimum requirements, you'll be called in for qualifying testing of your skills, only the people who pass with a high percentage score are invited back for a qualifying panel interview, if the panel believes you meet the qualifications, you will then return back for a skill test. finally, the top 3 -8 scoring people are invited back to interview directly with the manager of the department which has the opening.", "Interview Questions": "pretty basic interview questions about your background, why you're qualified for the position- all standard items you would be accustomed to in an interview."}, {"date": "26 Mar 2015", "title": "Assistant Professor Political Science (Full Time) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Santa Monica College (Santa Monica, CA) in Jun 2011", "Interview Descriptions": "I had been working as a part time lecturer at Santa Monica for 7 years before the interview.  All applications had to be through the on-line system.  A number of people were chosen for a panel interview, all on the same day.  The question and answer process was very structured.  They gave me the questions 30 minutes beforehand as they were interviewing someone else. There were 7 people in the panel.  Each person read one question and then listened to my answer.  There was very little interchange during the process.  I found it difficult to deal with such a non-responsive process.  The whole seemed to be geared towards treating each applicant exactly the same.  The second round was an interview with the president of the college, I didn't make it to that round.", "Interview Questions": "One question was how have you dealt with difficult students. "}, {"date": "11 Sept 2015", "title": "Office Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at Santa Monica College (Los Angeles, CA) in Mar 2011", "Interview Descriptions": "submit resume online, if approved go to testing, if you pass with high marks you qualify for an interview. may require a small on site/interview project then you move on to a qualifying interview by a panel. If you pass both the project and panel interview with high marks, then you qualify for an interview with the actual hiring manager. Hiring manager will tell you about the job and ask you questions- pretty basic interview stuff at that point, but as you see there are a lot of hoops to jump through to get to that point. it is very competitive to get in.", "Interview Questions": "N/A"}, {"date": "11 Jun 2015", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Santa Monica College (Santa Monica, CA) in Feb 2011", "Interview Descriptions": "Long interview process by the time you apply and you get an offer it may take up to 6 months.  You may take tests, and go in for interview after.", "Interview Questions": "Mostly education related questions, how to handle disgruntled students, parents, Ferpa, etc."}, {"date": "3 Jan 2013", "title": "Student Services Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Santa Monica College (Santa Monica, CA) in Feb 2011", "Interview Descriptions": "IAfter passing a written exam. I was selected for an interview, which consisted of 7-10 behavioral/situational questions.", "Interview Questions": "The questions are pretty easy; such as, describe your experience working in a college setting? Or, are you willing to provide services for a diverse group of people?"}]]