[[{"date": "29 Nov 2018", "title": "ABA Therapist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at The Institute of Professional Practice (Stratford, CT) in Nov 2018", "Interview Descriptions": "Initially it was a phone interview which it went well. The interviewer and I scheduled a date and time to which we both agreed on. The day of the interview it was chaos and I did not know the precise Location of which to meet the interviewer and the receptionist was no help either. There were no customer skills at all. I arrived fifteen minutes prior the set date we made.  The interviewer came after 30 minutes to start the process to which she seemed disheveled. The interview took place in a computer room to which I sat on a low chair which I  did not mind. The interviewer concern was too much on my supervisory experience than the ones pertaining to the job I applied for. The interview last five minutes and next thing she is taking me to observe a child. I was not ready for an observation or to be observe on my job performance when I have no rapport with either child even with experience . All companies do things differently. Word s of advice from managemen: that is not how you adequately get people for the job. All companies especially from different states do things differently. When I train people I give them two weeks to build rapport with individuals or clients.", "Interview Questions": "Are you sure you want to step down from your role?"}, {"date": "25 Oct 2018", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Institute of Professional Practice (Meriden, CT) in Mar 2018", "Interview Descriptions": "I was asked simple questions related to my experience. If you can relate any previous job to caring for others then you pretty much have the job. Everything else was very technical. They wanted to know if you would be alright to different background checks.", "Interview Questions": "Tell me about your previous work."}, {"date": "16 Sept 2017", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Institute of Professional Practice (Meriden, CT) in Aug 2017", "Interview Descriptions": "There is a series of interviews to begin with before the hiring process begins. Then, they do an extensive background check on you. After that, they check your 3 references you have listed on your application. Then there's a drug and PPD testing that MUST be done within a 48 hour time frame (and that's only when they decide to administer it). Finally, assuming you've passed all the prehire requirements, there's a full week of training that you must pass. If you do not pass all the training exercises and testing, YOU WILL BE TERMINATED!!!", "Interview Questions": "Are you comfortable with assisting individuals with personal Hygiene?"}, {"date": "21 Jul 2017", "title": "DSP Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Institute of Professional Practice", "Interview Descriptions": "intrerview was okay they only tell you a few things you find out about the job when u start working. the lady lied to me when she hired me", "Interview Questions": "what would you do if employee stole something"}, {"date": "17 Jun 2016", "title": "DSP Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Institute of Professional Practice", "Interview Descriptions": "HR called me. I then did a phone interview with them. After, I went in for in person interview with HR. Then got second interview in the group home. The process was drawn out.", "Interview Questions": "Do you feel comfortable restraining someone"}, {"date": "8 Feb 2016", "title": "ABA Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Institute of Professional Practice (Meriden, CT)", "Interview Descriptions": "Got a call, came in for an interview, went to the school to check out the work environment (they have you come when the kids are having breakfast/playing so you don't see the challenging behaviors and lack of teamwork), got a call from hr to get hired", "Interview Questions": "How do you feel about working in a team-environement, How do you feel about working with autistic kids"}, {"date": "23 Oct 2015", "title": "ABA Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The Institute of Professional Practice", "Interview Descriptions": "I received an email that stated The Institute of Professional Practice was interested in hiring me and was shortly after taking in for an interview. The interview was somewhat easy, but I was very nervous because I thought this was a high end job (no way is it a high end job) and the beginning of my career (nope it wasn't), that paid very well (definitely mistaken). So I really wanted to make sure I didn't mess up, which of course caused me to feel pressured. \r\nIn any rate, I got the job and my first day was about 3 weeks after the interview. \r\nHeads up: They do not tell you in the interview that you will be changing a lot of diapers, so if you have a phobia or a weak stomach for these kinds of things then run away as fast as you can. \r\nI never even wanted to change my younger sibling's diapers, let alone someone else's kid. Try taking a child, who has high level of autism, to the bathroom and see if it'll go well. \r\nPlease speak to someone who already works here before you accept the job. Ask all the questions you can because you might just run away.", "Interview Questions": "Q: What are some of your experiences with being very organized and working as a team?"}, {"date": "15 Sept 2015", "title": "ABA Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Institute of Professional Practice", "Interview Descriptions": "Lasted a month. Was a waste of time. Very unorganized. There are two interviewing steps. The job is very low pay and always need ABA therapist. If you make it to the second step to the interviewing process, don't think you got the job.", "Interview Questions": "What challenge did you face and how did you fix it? How would you handle a crying child?"}, {"date": "30 Jan 2016", "title": "ABA Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Institute of Professional Practice (Norwalk, CT) in Sept 2015", "Interview Descriptions": "Phone Interview then one on one. Interview was not difficult.  Usually I get nervous during interviews but I was not nervous. Working in this general population helped me to articulate why I want to work for this company.", "Interview Questions": "Would i have a problem working in a school environment"}, {"date": "28 Feb 2018", "title": "ABA Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Institute of Professional Practice (Brookfield, CT) in Feb 2015", "Interview Descriptions": "In school interview with supervisor. The supervisor showed me one of the classrooms I may work in. I met the student I would potential work with and spent time with him in the sensory who. We walked around the school, and then spent about an hour interviewing. She called me a few days later with an offer.", "Interview Questions": "What is ABA?"}], [{"date": "28 Nov 2015", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Institute of Professional Practice (Meriden, CT) in Aug 2014", "Interview Descriptions": "I submitted an application online and was contacted maybe two days later to come in for an interview. I had a very short interview with the human resources manager. (no more than ten minutes).", "Interview Questions": "Would you be comfortable restraining someone?"}, {"date": "6 Jun 2014", "title": "ABA Therapist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Institute of Professional Practice", "Interview Descriptions": "For the interview my resume was received and I set a date for meeting. When I arrived I was in the middle of the facility that was very active. During the interview process I was told how things work at the facility and then asked how my previous experience and personality would match. Then I was taken on a tour and asked if I wanted to fill out an application.", "Interview Questions": "All the questions were typical for the type of work"}]]