[[{"date": "11 Apr 2023", "title": "Service Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Charities USA", "Interview Descriptions": "The interview lasted about 30 min and they even gave me enough time to ask questions. The interviewer started out with describing the position and the company as a whole. They explained what the expectations are, and right then i started with my first question which was about the most challenging situation they are going through at the moment. It helped me take off the pressure by setting the tone and made the interview go smoother.", "Interview Questions": "what makes you fit for this position"}, {"date": "23 May 2023", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (Atlanta, GA) in Apr 2023", "Interview Descriptions": "The interview was very seem-less and straight to the point. The interview was on time. The interviewer was pleasant and informative about the position. The job description was provided and in detail.", "Interview Questions": "What previous experience do you have that will contribute to your current role?"}, {"date": "8 Mar 2023", "title": "Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA in Mar 2023", "Interview Descriptions": "Went well. Lots of questions. I was I interviewed by two people. They both took turns in asking me questions. They were both very nice. I believe I answered their questions well.", "Interview Questions": "How do I feel about different beliefs and different races."}, {"date": "2 Mar 2023", "title": "Avaliador De Mídia Social Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Catholic Charities USA (Broken Arrow, OK) in Jan 2023", "Interview Descriptions": "Trabalhei seis anos lá, super recomendo é um lugar maravilhoso e abençoado. Tive o prazer de fazer amizade com o chefe e tudo mais Para quem quer um emprego tranquilo lá é o melhor lugar para se trabalhar", "Interview Questions": "Como vc se chama ? Onde trabalhou?"}, {"date": "9 Feb 2023", "title": "Security Guard Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Catholic Charities USA (Brownsville, TX) in Jan 2023", "Interview Descriptions": "It was good but needed more hours started me with 84 hours weekly down to less than 40 and i need more hours over time and i need something with immediate start", "Interview Questions": "If i had worked as security before"}, {"date": "24 Jan 2023", "title": "Senior Communications Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Catholic Charities USA in Nov 2022", "Interview Descriptions": "The first step was a short screening call. This went well, but at points it seemed like the interviewer was annoyed that I didn't know every single nuanced thing about the company. Giving a top-level summary of why you wanted to work there seemed not detailed enough, even if you are only given 15 minutes to chat. A week later, I was given a writing assessment, which included a blog post, press release, and graphic. It was to be completed in 24 hours, and required quite a bit of work. I received confirmation of submission, and then radio silence for over a month. I then received a canned rejection. No feedback on the assessment was offered, which was unusual for positions like this. Additionally, I received no direct contact information for the interviewers, just the company inbox that would be \"re-routed.\" This made reaching out for updates very difficult. The interview process should be revamped and streamlined. For not a large company, it was very impersonal.", "Interview Questions": "Why do you want to work here?"}, {"date": "20 Oct 2022", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Charities USA (Dallas, TX)", "Interview Descriptions": "The process was simple. I applied online and received a call a few days later. The interview consisted of three managers and me. One of the managers called me the next morning to offer me the job.", "Interview Questions": "Name some of your strengths and weaknesses"}, {"date": "12 Sept 2022", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Charities USA", "Interview Descriptions": "The interview process was smooth and great. Wonderful company. Love the staff, very friendly. It was an experience for sure. Working in a nonprofit is rewarding and it shows. I would highly recommend applying. ", "Interview Questions": "How did you solve a problem you encountered in your past job?"}, {"date": "18 Aug 2022", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Catholic Charities USA", "Interview Descriptions": "It was pretty easy and straightforward. Just know what you’re applying to and what role is intended for. They definitely ask for specific experience related to the job position. Overall, they will also ask you personal hobby and interest.", "Interview Questions": "Tell me about yourself.  What is your educational background?"}, {"date": "13 Jun 2022", "title": "Customer Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Catholic Charities USA", "Interview Descriptions": "it was wonderful and a very professional working enviornment.\r\nAll employees were kind and curtious\r\nGood balance between work and home family life.\r\ngood working enviornment and pay.\r\nWould recomend this company to anyone", "Interview Questions": "what my experience was and how it realtes to my position"}], [{"date": "16 Jan 2023", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (Syracuse, NY) in Jun 2022", "Interview Descriptions": "I did an initial phone interview which was prescreening to check minimum requirements. Helpful information was then offered that was not included in the job listing. I then went for an in-person interview with the hiring manager and another senior team member.", "Interview Questions": "What my experience was with case management? How I felt about being out in the community and going into client homes where values will be different than mine? Knowledge about community resources?"}, {"date": "3 Jan 2023", "title": "Legal Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Catholic Charities USA (Dallas-Fort Worth) in Mar 2022", "Interview Descriptions": "Received an email for an interview after applying. The email was short and concise and after we set up a time that we were both free we did an online interview.", "Interview Questions": "Why are you interested in this position? What prior immigration experience do you have? Tell me about yourself."}, {"date": "9 Jan 2022", "title": "Marketing and Events Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Catholic Charities USA", "Interview Descriptions": "We were about 7 minutes into the interview and, though I had more experience than what they were asking for, I was demoralized for a number of things related to my experience. And made to feel inferior for ever working at a for-profit company…", "Interview Questions": "How do you explain for selling out to for-profit companies?"}, {"date": "5 Feb 2022", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (Queens Village, NY) in Jan 2022", "Interview Descriptions": "I interviewed with two individuals who both had a list of questions… it was done at the office, the Director explained the history/goals of the program and were very transparent about the barriers they also have with the program", "Interview Questions": "If you could change one thing about yourself, what would it be? "}, {"date": "30 Nov 2021", "title": "Site Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Catholic Charities USA", "Interview Descriptions": "Simply and straight to the point. The job itself has a lot of openings available. They need workers so the screening process was not difficult. It was a pleasant experience.", "Interview Questions": "What experienced do you have with coordinating a schedule? "}, {"date": "18 Oct 2021", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA", "Interview Descriptions": "The first interview went well and I was asked the common interview question. It is good to get ready and practice the interview questions before going to actual interview. And also watch the interview questions on youtube.", "Interview Questions": "Tell me the time when you dealt with a difficult client"}, {"date": "12 Nov 2022", "title": "Youth Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (Nashville, TN) in Oct 2021", "Interview Descriptions": "Very simple and straight forward since they were looking for case managers. Initially applied for regular case manager but was asked to be a youth case manager instead since it fit me more.", "Interview Questions": "Is there anything else you want to tell us?"}, {"date": "22 Sept 2021", "title": "BHH Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Catholic Charities USA (Fairfield, ME) in Sept 2021", "Interview Descriptions": "The interview was conducted in a professional but friendly setting. The staff was very competent, knowledgeable, and kind. I was never made to feel uneasy or a bother. Wonderful experience. (Fairfield, ME agency)", "Interview Questions": "Work experience examples and how I handled individual crisis. "}, {"date": "30 Jun 2021", "title": "Licensed Clinical Social Worker LCSW Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Catholic Charities USA", "Interview Descriptions": "I interviewed on Zoom and was offered a second interview on Zoom. The process was pretty straightforward and the staff was very friendly. Verbal offer, declined due to location of the office", "Interview Questions": "What experience do you bring?"}, {"date": "29 Jun 2021", "title": "Life Skills Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Charities USA", "Interview Descriptions": "Awesome and would highly recommend. Loved the team environment and mission. I enjoyed my time with the company. The interview process was not too hard however it was not easy. If you are prepared and have a passion you will be fine.", "Interview Questions": "What was the reason for applying?"}], [{"date": "4 May 2021", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Catholic Charities USA in Apr 2021", "Interview Descriptions": "- sent application in via email to the senior director\n- invited to interview\n- senior director never called/showed up for phone interview\n- sent follow up email to director to attempt to reschedule, never received a reply\nOverall, seems like a cool organization with a great mission— I'm typically very lenient when a recruiter misses an interview, however being ignored and missing the scheduled interview doesn't leave a good impression", "Interview Questions": "Not applicable since interview was missed "}, {"date": "7 Jan 2023", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catholic Charities USA (Syracuse, NY) in Mar 2021", "Interview Descriptions": "HR phone interview, and then had the interview in person with program supervisor and the program officer. Professional, allowed plenty of time for me to ask questions and share professional experiences in the field. Gave clear outline of job expectations.", "Interview Questions": "Why I want to work for Catholic Charities, a story about personal growth experience, in/out of comfort zone."}, {"date": "24 Feb 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Charities USA", "Interview Descriptions": "Submit online application and was called in for interview pretty quick. Two people interviewed me that work in the specific area I would be working. I received a lot of information about the position and the agency. Wonderful process and very quick.", "Interview Questions": "I was asked about past experience in a crisis situation. How did I handle it?"}, {"date": "3 Feb 2021", "title": "Marketing Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (New York, NY)", "Interview Descriptions": "2 phone call with Human resources dept.  \nThen I had two rounds of in person interviews with the communications department. Met 5 people total including the director and also a member of senior staff.", "Interview Questions": "What is something we are doing right now that you would change? "}, {"date": "21 Dec 2021", "title": "Secretary Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Catholic Charities USA in Feb 2021", "Interview Descriptions": "The interview went well and they were very knowledgeable and polite. They took the time to get To know me as a person instead of just a person to fulfill the job.", "Interview Questions": "What qualities do you bring to the company?"}, {"date": "7 Aug 2020", "title": "Summer Legal Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Charities USA", "Interview Descriptions": "Received an email next day after applying, scheduled interview for a few days after that. The interview was very relaxed, talked about my legal experience and interest in immigration. Afterwards, the interviewer walked me through what is expected of summer interns. The person who interviewed me ended up being the person I worked for during my internship", "Interview Questions": "Why are you interested in immigration? "}, {"date": "22 Feb 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Catholic Charities USA in May 2020", "Interview Descriptions": "The interview was very open and welcoming, they let me ask any questions I had and were very approachable. They let me know what to expect from my internship and allowed me to set my own schedule.", "Interview Questions": "\"What modality do you like to use with clients?\"\r\n"}, {"date": "25 Oct 2020", "title": "Medication Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (Long Is City, NY) in May 2020", "Interview Descriptions": "Yep different phone calls, one with HR then one with the manager of the house with the adult population who needed assistance.  The HR call was lengthy and the house manager one brief.", "Interview Questions": "Asked me why I wanted to serve that particular population. "}, {"date": "28 Feb 2020", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Catholic Charities USA (Chicago, IL) in Dec 2019", "Interview Descriptions": "My school provided the opportunity to work with these groups during the holiday season. There was no interview process. I signed up for a day then showed up and helped pack Christmas gifts.", "Interview Questions": "What school did I come from?"}, {"date": "12 Oct 2020", "title": "Volunteer Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (Cincinnati, OH) in Nov 2019", "Interview Descriptions": "Was a very pleasant experience even though it wasn't a perfect fit for me. I like their mission and calling. I met with the head of the HR department and the director of outreach and inclusion.", "Interview Questions": "Have you ever had to work with limited resources? What did you do to adapt?"}], [{"date": "29 Jul 2019", "title": "Paralegal Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA", "Interview Descriptions": "I went to an interview with my direct boss and all the team working in the immigration family.  They asked my general knowledge related to the topic and they asked about the case track programs they use to follow up a case. It did not last more than 30 minutes and almost immediately told me they want me to work for them.", "Interview Questions": "Nothing?"}, {"date": "23 Apr 2019", "title": "Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (New York, NY)", "Interview Descriptions": "Pleasant and quick. I was interviewed by four professionals during a 30 minute period. They asked general interview questions. It did not feel like a fit but it was a nice conversation. The recruiter never got back to me to let me know I would not be moving forward.", "Interview Questions": "Tell me about your fundraising experience "}, {"date": "26 Sept 2022", "title": "Career Navigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Catholic Charities USA (New York, NY) in Feb 2019", "Interview Descriptions": "I applied on line on indeed. \nI received a call where they did a Pre screen phone call. Easy questions and very nice. After wards they scheduled an in person interview.", "Interview Questions": "How did you hear about the position?"}, {"date": "15 Dec 2018", "title": "Director of Grant Writing Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (Corona, CA) in Dec 2018", "Interview Descriptions": "Received a rude text on my phone and an email.  Wanting to know what my salary requirements were. Were very patronizing and dismissive. I have written grants for over 20 years and secured over $40 million in grant funding for clients.  When I tried to neogtiate basically they wanted me to commute 30 miles and work a 50 hour week for $25 per hour.", "Interview Questions": "What was the cheapest I would work for. "}, {"date": "19 Nov 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Catholic Charities USA", "Interview Descriptions": "Very welcoming. Asked great questions and made you feel instantly comfortable. There were two people who did the interview process. They really make sure the position is not only a good fit for you but how you would integrate into their community.", "Interview Questions": "\"What are your strengths and weaknesses\""}, {"date": "1 Jan 2019", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Catholic Charities USA in Nov 2018", "Interview Descriptions": "I was called about a week after applying for my first interview almost a month later I was called for a second interview,  The interview process is very slow to say the least.", "Interview Questions": "Discuss how your previous work experience relates to the position.  What made you apply for the position?  Describe a time you disagreed with your supervisor and how did you handle it,"}, {"date": "26 Mar 2019", "title": "Staff Attorney Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Catholic Charities USA (Houston, TX) in Nov 2018", "Interview Descriptions": "There are two rounds. First round is a panel interview. They’ll ask you about you prior work experience (they’ll be reviewing your resume as they ask you questions) and why you are interested in the position. If you pass the first round, you’ll get an email (about a monh later) asking for your references to fill out a two page questionaire (it’s super long and tedious). If you don’t hear back from them after submitting thr questionnaire then you didn’t go the next round.", "Interview Questions": "Why are you interested in this position?"}, {"date": "12 Oct 2018", "title": "Receptionist for Drug Rehabilitation Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Catholic Charities USA (New Orleans, LA)", "Interview Descriptions": "Clients that completed  drug program came. To. Us for out patient My. Jon was to. Do drugs  testing and  compiled all information to bring to counselor. Also take  care of  their kids  when they were  with counselor", "Interview Questions": "To be compassion professional friendly and  commented.I.was the first person they met \r\n"}, {"date": "26 Apr 2019", "title": "Case Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Catholic Charities USA (Washington, DC) in Apr 2018", "Interview Descriptions": "The interview process is quite technical and scenario-based  for situations that case workers often face. Try to answer creatively when you do not know the answer and provide your best judgement. Make sure to show that you adhere to the mission and values of the organization.", "Interview Questions": "What would you do if a client is unwilling to work on their goals and plans?"}, {"date": "11 Feb 2018", "title": "Youth Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Catholic Charities USA", "Interview Descriptions": "A simple interview process,1 on 1, conversational and relaxed. The job, to the extent possible, is described but be ready to ask questions if you have not worked in behavioral health. It would have been beneficial to have more of idea of the scope of the program I would be working within.", "Interview Questions": "They want to know you will be able to take care of yourself emotionally."}], [{"date": "27 Apr 2019", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Catholic Charities USA (Kansas City, KS) in Jan 2018", "Interview Descriptions": "Great interview and had really good job descriptions. Also have nice environment great experience with the company over all wish they had more opportunities to move up with in the company", "Interview Questions": "What was one thing they asked you "}, {"date": "31 Jan 2018", "title": "Parent Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catholic Charities USA (Joliet, IL) in Dec 2017", "Interview Descriptions": "The interview was not intimidating and very delightful. The individuals who interviewed me were very polite and friendly. The interview was a normal interview where they would ask numerous questions about your experience and how you would handle certain situations(scenario questions).", "Interview Questions": "How do you deal with stress?"}, {"date": "14 Apr 2017", "title": "Client Advocate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Catholic Charities USA (Saint Paul, MN) in Apr 2017", "Interview Descriptions": "Submitted my resume, received a phone call and went through a brief phone interview and was invited in for a face to face interview. The interview was with a panel of two interviewers. The interview took about an hour. I called them in a few days to ask when they'd be making a decision as far as hiring and received a letter the next day saying they'd hired someone else for this position but that I was qualified and they encouraged me to apply for other open positions in the future.", "Interview Questions": "Why do you want to work for Catholic Charities?"}, {"date": "10 May 2017", "title": "Dietary Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (Baltimore, MD) in Mar 2017", "Interview Descriptions": "I applied online and they called me for a phone interview and then called me in for a interview about a week later I received an job offer. The whole process took about a month", "Interview Questions": "How do I handle a difficult patient "}, {"date": "18 Jan 2017", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Catholic Charities USA (Las Vegas, NV) in Jan 2017", "Interview Descriptions": "Interview was a panel interview with three person panel. Very professional very organized. Interview process was a long wait time interview itself only took 35 minutes waiting for the interview one hour", "Interview Questions": "What is your familiarity with nonprofit organization's"}, {"date": "14 Oct 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Catholic Charities USA (New York, NY)", "Interview Descriptions": "There were two supervisors at the interview and asked questions related to the job description. Also, there was a written test to determine case notes skills. They called reference after 2 weeks.", "Interview Questions": "How comfortable do you feel working with senior citizens?"}, {"date": "18 Sept 2016", "title": "Assistant Controller Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Catholic Charities USA (Albany, NY)", "Interview Descriptions": "There is a ceo and controller and assistant controller. You all work together 830 to 430, summer hours you dont work on Friday. You will do account payable and account receivable and bookkeeping and ach payments for cookie sales and deposits for the store. You will use excel for cookie sales. They use more than one program there.", "Interview Questions": "If i mind working with all woman"}, {"date": "1 Sept 2016", "title": "Temporary Certifier Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Catholic Charities USA (Camden, DE) in Aug 2016", "Interview Descriptions": "The interviewer asked questions based on what was on my resume and application, asked about my previous employment with Catholic Charities. They told me what was involved with the job. I was given pages of printed information to read and sign and was given a math test to determine if I could estimate a yearly income based on partial information. The first location I interviewed at only hired one person but I was called to the other location which had 4 openings and interviewed there as well. In any case, the job required two interviews before an offer could be made. At the second interview I asked when a decision would be made and was told in about 10 days and that we would be notified by phone if we had been selected or not. The interviews went well but I wasn't notified. \r\nI would apply for other jobs at Catholic Charities because it's a good place to work.", "Interview Questions": "Would I have a problem with some of the restrictions in the printed info I was given to read. These dealt with not advising clients to do actions against Catholic moral teaching."}, {"date": "25 Aug 2017", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (Baltimore, MD) in Aug 2016", "Interview Descriptions": "Phone interview, person to person interview, and then confirmation. The interview was with one manager. He asked the questions that he needed to ensure I was the right candidate. Much of the interview was geared towards my field.", "Interview Questions": "How much experience do you have?"}, {"date": "2 Aug 2017", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (Nashville, TN) in Jul 2016", "Interview Descriptions": "over skype due to living in another state. Three interviews with Supervisor of team and Director of Social Services. Each interview had questions regarding my previous experience working with at risk populations and how I went about developing those relationships. I spoke about what brought me to apply for this position.", "Interview Questions": "Describe a time you worked with a difficult client and how you navigated that relationship."}], [{"date": "12 Aug 2016", "title": "Client Care Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Catholic Charities USA (Covington, KY) in Jul 2016", "Interview Descriptions": "There were 3 different interviews, each about a week apart.  The first interview was about an hour and 15 minutes. The HR manager as well as the assistant director conducted the interview.  The second interview I was with the executive director for about an hour.  The third interview I was with the executive director again as well as a priest for about 30 mins.  All 3 interviews went very well, I was made to feel very comfortable and they were very positive and encouraging.  The interview questions were the usual but it was still stressful because there were so many questions in a series of interviews.  I did not hear back about the position, so I contacted them for an update and they apologized saying they intended to get back with me much sooner.  I ended up not getting the offer, but it was a positive experience overall, just a very lengthy process.", "Interview Questions": "How do you keep up with best practices?"}, {"date": "4 Apr 2016", "title": "Financial Stability Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Catholic Charities USA (Austin, TX) in Apr 2016", "Interview Descriptions": "Met with Program Manager of Financial Stability and Program Manager of Social Services after passing a phone interview. They did a brief screening asking questions about whether I would be comfortable working in an environment where there may be prayer or religious speech. Will have back ground and credit check done if they extend an offer. They stated that they will meet with other candidates and schedule third and final interviews within the week and extend offers within two weeks.", "Interview Questions": "How would you handle an angry client?"}, {"date": "30 Mar 2016", "title": "Staff Attorney Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Catholic Charities USA (New York, NY) in Feb 2016", "Interview Descriptions": "Two steps interview process. I did not have a phone interview. First, I met the HR Manager and Then I met the program manager on the same day. HR Manager did the screening and then send me to the Program Manager who explained the job duties, what they expect from me, Ask whether I am willing to work on some weekends and after hours etc. Overall, the interview is not difficult. I had a good experience.", "Interview Questions": "Tell me about yourself\r\nHow do you raise the bar for others?\r\nHow did you prepare for this interview?\r\nIf you have several different projects due in same day, what do you do to finish these projects on time?"}, {"date": "23 May 2019", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catholic Charities USA (Bridgewater, NJ) in Dec 2015", "Interview Descriptions": "Two interviews total were completed when I was interviewed. First was with the potential supervisor which went well. Then with higher up personnel which was more focused on expectations of the agency.", "Interview Questions": "What is your driving record like?"}, {"date": "23 Oct 2015", "title": "Youth Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA", "Interview Descriptions": "After an online application was submitted, they called me in shortly after for an interview. It was one 30 minute interview with two people. After the interview they called me a few days later.", "Interview Questions": "General questions about experience and how you handle stress"}, {"date": "17 Apr 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Catholic Charities USA (Beaver, PA) in Oct 2015", "Interview Descriptions": "It was quick.  The director seemed to want to make sure I was professional and prepared to take on the role but didn't ask a lot of detailed questions.  It was unclear to me whether or not I got the internship, and required a follow-up email with the director to confirm.", "Interview Questions": "Am I familiar with motivational interviewing?"}, {"date": "27 Nov 2017", "title": "Peer Service Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Catholic Charities USA (Brooklyn, NY) in Sept 2015", "Interview Descriptions": "I applied for months and never herd anything. It wasn't until I physically went to the home office and requested a meeting with HR that they finally looked at my resume. The representative agreed that I was well qualified and a good candidate for several positions however it still took about a month to actually connect me with the right people.", "Interview Questions": "What is your experience working with low income housing, property management,  and or social services?"}, {"date": "11 Sept 2018", "title": "Rca Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Catholic Charities USA (Las Vegas, NV) in Aug 2015", "Interview Descriptions": "Very easy. O actually applied for a job developer position which I wasn't qualified for but they saved my resume and called me back 2 months later to reapply for RCA.", "Interview Questions": "Why do you want to work with us?"}, {"date": "7 Sept 2015", "title": "Legal Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Charities USA (Spokane, WA) in Aug 2015", "Interview Descriptions": "The interview process was very pleasant. I was interviewed by the head of the legal department and the two attorneys overseeing the day to day operations. All three were very kind and welcoming. They asked behavioral based questions one at a time then finished the interview with a review of their business/work culture and their excellent benefits package.", "Interview Questions": "What is one short term goal and a long term goal of yours?"}, {"date": "14 Oct 2015", "title": "Care Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Catholic Charities USA (San Carlos, CA) in Aug 2015", "Interview Descriptions": "I interview for a care manager position in San Carlos at an Adult Day Program.  The first interview was a brief phone interview.  After, I met I did 1:1 interview with the program director.  The staff was very nice and friendly.  The questions were very easy.  From the interview, I can tell the program director really care about the population the company serve.", "Interview Questions": "Why do you want to work with older adults?"}], [{"date": "19 Jun 2017", "title": "Social Work Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Catholic Charities USA (Long Island City, NY) in Jul 2015", "Interview Descriptions": "They wanted to know that I had prior experience in the social services field. I was invited in person to interview and interviewed with two managers who had extensive experience at the work location.", "Interview Questions": "Do you have experience working with a caseload of clients?"}, {"date": "20 Jun 2015", "title": "Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Catholic Charities USA (Denver, CO)", "Interview Descriptions": "Panel interview.  My interview took place several years ago - leadership has changed.  I normally would not have accepted a \"pitch a plan\" interview; but did so because I had a strong interest in seeing the organization succeed regardless of my interview success.", "Interview Questions": "Share a communications plan (asked to research and prepare beforehand and present to the panel)"}, {"date": "25 Apr 2016", "title": "Domestic Violence Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Catholic Charities USA (Council Bluffs, IA) in Jun 2015", "Interview Descriptions": "Very Long. There was a face to face interview and then it took weeks for them to get back to me only to offer me a whole other position which I did not apply for and it was part time when I was seeking full-time.  After careful consideration, I thought the extra income would help and also get me in the door to possible get a full-time position somewhere down the line.", "Interview Questions": "What made you want to work for Catholic Charities?"}, {"date": "7 Jun 2015", "title": "Front Desk Hotel Clerk Third Shift Part Time Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (Portland, ME) in May 2015", "Interview Descriptions": "interviewed with General Manager at Marriott, downtown Portland, Maine. Interview went well and GM asked interesting questions. Interview lasted about an hour Very relaxed, one on one with GM in lobby of hotel.. Outcome of interview was they would let me know in a few weeks. Had several more candidates to interview that week.", "Interview Questions": "Why do you want to work third shift?\r\nWhat was one of the best jobs you have done in your work history and why was that job so great?"}, {"date": "27 Apr 2015", "title": "School Age Group Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Charities USA (Chicago, IL) in Apr 2015", "Interview Descriptions": "I applied online by clicking the job post and submitting my resume and cover letter to the email address provided. I received a phone call the next day and did a very brief pre-screening interview with the director. She asked why I applied and what my salary expectations were. We then set up an in-person interview for a few days later. The interview was one on one and very comfortable. During the interview, I had to fill out a standard fill in the blank application.", "Interview Questions": "What are your career goals? Why do you want to work here? I have an elementary education degree, so she asked why I was interviewing with her and not a public school. How do you handle stressful situations? What's one of your weaknesses? What are a few strengths?"}, {"date": "4 Jun 2015", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Catholic Charities USA (Oklahoma City, OK) in Mar 2015", "Interview Descriptions": "Really friendly! I enjoyed the way I was treated. They took me to a back room and asked me about my educational and work experiences. I interviewed with two different people. Both of them were really up beat and positive. I left feeling encouraged and valued.", "Interview Questions": "How can one help people and remain a level of professionality?"}, {"date": "23 Aug 2015", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Charities USA (Omaha, NE) in Mar 2015", "Interview Descriptions": "They asked a series of questions that they wrote down the answers to which included experience, education and commitment. I have experience with public speaking and thinking on my feet, which I believe really helped in the interview. I know many people would have otherwise find this interview to be tough.", "Interview Questions": "What is your experience with addiction and recovery?"}, {"date": "7 Jul 2019", "title": "Intensive Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (East Orange, NJ) in Feb 2015", "Interview Descriptions": "I applied for the new position through the employeers website. I had an interview with the Program Manager and was offered the position within a month. The Program Manager was very efficent and informed you of how the process would work.", "Interview Questions": "Case Management experience and time management skills."}, {"date": "22 Jan 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Catholic Charities USA", "Interview Descriptions": "Very relaxed initial interview with director of HR. The HR director is a very respectable and approachable woman who asks easy and fair questions. She is 100% the type to know if you're full of crap or not, so I wouldn't bother trying to BS her. The interview was around 15 minutes but went very fast because she was just a pleasure.", "Interview Questions": "What was the most serious and unexpected situation you've dealt with in the past and how did you handle it?"}, {"date": "15 Sept 2016", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Catholic Charities USA (Saint Cloud, MN) in Jan 2015", "Interview Descriptions": "Very quick.  I was called by HR, interviewed the following day by a young female. Upon completion of the interview, the interviewer let me know that she would like to set me up for a second interview at the Children's Home. I set this up very quickly. While sitting in the waiting room, the receptionist was calling former employees to find out why they quit. I thought it was sketchy, and now realize how many calls they are making because of the quick turn-over rate.", "Interview Questions": "My interests/experience"}], [{"date": "9 Jul 2015", "title": "Case Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Catholic Charities USA (New Brunswick, NJ) in Aug 2014", "Interview Descriptions": "The interview is designed to explain the position, agency mission, and open the forum for questions both ways.They are looking to your ability to work with homeless and how you conduct yourself in the interview. The Management involved in the interview process can be critical and a bit judgmental.  Be professional.", "Interview Questions": "How do you organize yourself?"}, {"date": "25 Sept 2014", "title": "Job Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Catholic Charities USA in Jul 2014", "Interview Descriptions": "Got the approval by the office director and then I had to wait for the regional director to give the ok, at the end they came to me with an offer which I accepted.", "Interview Questions": "How do you see your self in the next five years in the company"}, {"date": "8 Feb 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Catholic Charities USA (New York, NY) in May 2014", "Interview Descriptions": "During interview, it was clear that the supervisor didn't realize I was interviewing to be a volunteer. I was asked many questions but none about my volunteer experiences. The supervisor was wanting to hire me to work as an employee in a role I had never heard of. So, the interview was an overview of a job that I really didn't feel I had the know-how or the experience but the supervisor wanted me to develop the program and wanted to hire me.", "Interview Questions": "What experience do you have interacting with the community?"}, {"date": "10 Aug 2015", "title": "Support Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Charities USA (Phoenix, AZ) in Apr 2014", "Interview Descriptions": "Very easy to get through if you are working in the main office as support. Just use words that have multiple syllables when meeting with HR and you will get to the next phase of the interview. Beyond that it depends on where you work but in most cases the person interviewing you will not be paying much attention to your answers anyway.", "Interview Questions": "Tell me about yourself."}, {"date": "26 Mar 2014", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Catholic Charities USA", "Interview Descriptions": "Interviewer was very nice. Thought i was going to get the job but did not.", "Interview Questions": "N/A"}, {"date": "6 Apr 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Catholic Charities USA (Overland Park, KS) in Mar 2014", "Interview Descriptions": "very detailed and tedious;  I thought it was very comprehensive on Microsoft products. I spent a mega-amount of time trying to get every question correct.  I did well she told me, but I did not get the job.  I was very sad.  I had several interviews and was narrowed to 3.  I thought the ladies were very nice I interviewed with but I did not understand why they did not pick me.", "Interview Questions": "How I would handle someone coming in off the street."}, {"date": "1 Jan 2014", "title": "Caseworker Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Catholic Charities USA", "Interview Descriptions": "Three interviews total, two at local office and one in Manhattan with HR. Management very willing and able to answer questions about the agency. Interviewers want you to be the right candidate so they are rooting for you to do well. Don't take it personally if you don't get an offer, as positions are competitive and they are often looking for a specific type of candidate to carry out special projects. Also don't panic if they don't call you right away. The hiring process is a long one (can last 1-2 months).", "Interview Questions": "If you are in the office late on a Friday night finishing case notes, alone in the building, and hear someone banging on the door because they are going to be evicted, what do you do? "}, {"date": "5 Jan 2017", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Catholic Charities USA (Washington, DC) in Jan 2014", "Interview Descriptions": "Average group interview process. No surprise questions. It was easy to prepare with online resources. Focused more on the prior experience. Did not last more than 40 minutes total.", "Interview Questions": "Why are you leaving your current job."}, {"date": "20 Aug 2013", "title": "Financial Adviser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Catholic Charities USA in Aug 2013", "Interview Descriptions": "15 min phone interview with Finance program manager.", "Interview Questions": "Not any difficult questions in phone interview: self-introduction, why do you want to work for Catholic Charities, how could you run a project without complete information"}, {"date": "4 Jul 2017", "title": "Camp Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Catholic Charities USA (New York, NY) in Aug 2013", "Interview Descriptions": "The interview process wasn't really a traditional one. It was through Summer Youth Employment. But When the regular school year started the interview process was like a regular one. I was interviewed by the director of the program for that specific school.", "Interview Questions": "Do you like children?"}], [{"date": "7 Jan 2014", "title": "Bilingual Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Charities USA (Fort Worth, TX) in May 2013", "Interview Descriptions": "First contact after submission of my resume,I was instructed to read online the history and mission statement of Catholic Charities and then to comment/ask questions online. If they liked the comments I made I was directed to contact HR to arrange a series of interviews which included a group interview and then an interview with director. And then official transcripts and recommendations were sent to Human Resources. Salary negotiation occurred through email.", "Interview Questions": "A case study was presented and then I was asked what my plan of treatment would be."}, {"date": "2 Jul 2012", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Catholic Charities USA (New York, NY) in Jun 2012", "Interview Descriptions": "interview process was three parts. overall people were personable and easy going allowing for a smooth conversation", "Interview Questions": "what would you do to reach sales goals and bring in customers without financial assistance"}, {"date": "10 Sept 2014", "title": "Kitchen Help Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Catholic Charities USA (Saint Louis, MO) in May 2012", "Interview Descriptions": "I was looking for a job and I went to the unemployment office so they some flyers for Aarp so I decide to feel one out so that what happen . I been working every since.", "Interview Questions": "The only question that I was ask was. Am I a Resignted Sex Offender"}, {"date": "4 Jan 2016", "title": "Assistant Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Catholic Charities USA (Brooklyn, NY) in Apr 2012", "Interview Descriptions": "Quick and simple. You meet with the manager of the organization and the ask questions. Should you fulfill requirements they recommend you to the main offices and you will be notified immediately .", "Interview Questions": "If I have a cooking license?"}, {"date": "9 Jul 2012", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Catholic Charities USA (San Francisco, CA) in Aug 2011", "Interview Descriptions": "Interview was very straight forward and comfortable. Provide real world examples of experiences working with clients, demonstrate respect for the populations served. Work culture is very relaxed, but professional. Training and background in social services is highly desirable.", "Interview Questions": "How do you establish firm boundaries with clients/"}, {"date": "19 Dec 2011", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Catholic Charities USA (Cincinnati, OH) in May 2011", "Interview Descriptions": "The interviewer was very professional, and eager to give me the job because of the high case volume.", "Interview Questions": "Why I am looking to get a summer job as medical assistant when I study for Interior Designer?"}, {"date": "18 Jul 2011", "title": "A Director Role Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Catholic Charities USA (Fort Worth, TX) in May 2011", "Interview Descriptions": "I was contacted by email to schedule a short screen (about 10-15 minutes).\r\n\r\nThen a few days later I was asked to interview with a small group. The meeting with the small group was much more intense than I expected. The interviewers had a list of specific questions. The whole interview was about an hour. \r\n\r\nThen a few weeks later I asked to present and met with the CEO (about an hour). The CEO was very informal and easy to talk to.", "Interview Questions": "How would you seek buy-in from your direct-reports, who have worked with this origination for a long period of time? "}, {"date": "2 Apr 2011", "title": "Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Catholic Charities USA in Jun 2010", "Interview Descriptions": "I received a call for an interview, went in, and was ask about every item on my resume. Then the interviewer explained the job in detail and benefits associated with working at the organization.  The next day I received a letter indicating that I would not be asked for another interview. The environment was somewhat stale but the people were friendly enough.", "Interview Questions": "What's your case work experience?"}, {"date": "26 Feb 2013", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Catholic Charities USA (New Orleans, LA) in May 2010", "Interview Descriptions": "As the advertised position was a part of an emergency, temporary project, the interview process was not typical of the organization's hiring process. However, the organization responds to disasters with new programs, so this may happen again. I was referred to the project manager as someone who had the skills to fill the position and, as the position needed to be filled immediately, the manager (friendly but professional) briefly interviewed me on site and reviewed my credentials. Then, I volunteered and was trained in the position for one week before being officially hired. I had to submit documentation and proof of my education to HR.", "Interview Questions": "How would you handle difficult cases in which the clients may be angry or threatening towards you?"}, {"date": "4 Oct 2011", "title": "Disaster Recovery Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Catholic Charities USA (Houston, TX) in Sept 2009", "Interview Descriptions": "Straight forward and fair. A college degree was required and the interview process was quick.", "Interview Questions": "Name a time when you had to deal with personal loss and how did you overcome?"}], [{"date": "18 Mar 2013", "title": "Human Resources Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Catholic Charities USA in May 2009", "Interview Descriptions": "Strong, followed a set scheduled of which I was aware", "Interview Questions": "describing how the core values could be translated into day-to-day job duties"}]]