[[{"date": "15 May 2023", "title": "Social Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NatCen in May 2023", "Interview Descriptions": "It was an online interview over Microsoft teams and it wasn’t too difficult. Most of the questions that were asked was from the application form that was completed prior to interview.", "Interview Questions": "Tell me about your experience Why you want to work here How you would persuade vulnerable people"}, {"date": "26 May 2023", "title": "Field Interviewer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NatCen (London, England) in Mar 2023", "Interview Descriptions": "The ınerview process was smooth and comprehensive. But prior research about the company would be nice to be prepared. Interviewers were really friendly and approachable. I have never felt nervous during the interview.", "Interview Questions": "- How would you conduct the interview"}, {"date": "9 Feb 2023", "title": "Field Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at NatCen", "Interview Descriptions": "Zoom call just to discuss availability and suitability of the role requirements. After a 20-minute small talk, I was told to wait for an email. After receiving an email of training to be completed within 3 weeks.", "Interview Questions": "Are you able to work a minimum of 3 days?"}, {"date": "14 Jul 2022", "title": "Social Research Interviewer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at NatCen", "Interview Descriptions": "I applied for social research interviewer at NatCen. The process took about a week to have a scheduled interview. The interview itself was very brief, the interviewer did not seem interested at all of what I am saying, she did not even read my resume or CV since she asked me why I was unemployed in the past 3 years, taking into account it is very clear from my CV that I have been a full-time student since 2 weeks ago. Even though the questions were very simple and the interview lasted less than 15 minutes, I did not feel  good energy from the company.", "Interview Questions": "What are your strengths and weaknesses? \r\n\r\nWhy do you want to work at NatCen? \r\n\r\nTell me about yourself. "}, {"date": "3 May 2022", "title": "Field Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at NatCen (London, England) in Mar 2022", "Interview Descriptions": "Over the telephone. Quite informal and friendly. The process started with a friendly chat then on to some job related scenario questions. Ending with a further friendly chat about your interests and why you have applied for the job.", "Interview Questions": "How you would tackle reluctant respondent "}, {"date": "12 May 2022", "title": "Senior Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at NatCen (London, England) in Mar 2022", "Interview Descriptions": "A very short written exercise and analysis on a table with data from two different what similar surveys. Interview with head of department and HR associate. Previous experience on several topics from quantitative and qualitative data analysis  and research management questions.", "Interview Questions": "N/A"}, {"date": "27 Jan 2022", "title": "Field Interviewer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NatCen in Jan 2022", "Interview Descriptions": "Unprofessional behaviour. Repeatedly phoned late in the evening around 8pm or 9pm. Returned the phone call kindly stating that it is not appropriate to be phoned around this time on my end. Also sent an email asking to respond with a time that was appropriate to both parties. I have received no response on either. The process has been a shamble. \r\n\r\nWith more people awakening to bad companies, I feel like Natcen have already shot themselves in the foot. \r\n\r\nFrom the Field Interviewer description on the website, the details are very vague. Do you get paid per completed assignment? Are there weeks were there will be 0 hours? How much is the mileage cost as petrol has considerably increased? \r\n\r\nPlease include these details and people will come forward. I am sorry but people should not be investing time in a company that cannot be transparent.", "Interview Questions": "Competitive pay advertised on the website, what does this mean? \r\n\r\nIf you equate the traveling hours, the completion of the assignment and the mileage pay, what does this equate to?"}, {"date": "30 Sept 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at NatCen", "Interview Descriptions": "The interview was based on a range of questions on survey methods - quantitative and qualitative. It was a good environment and the interviewers were very supportive. It lasted one hour.", "Interview Questions": "Describe a time that you had to work in a team and how did you manage it. "}, {"date": "8 Jul 2022", "title": "Freelance Study Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NatCen in Apr 2021", "Interview Descriptions": "Straight  forward.  Very pleasant  experience.  Interviewer direct  and friendly  and gave all the required information.  Asked simple to follow questions and gave hints to what the ideal answer would be.", "Interview Questions": "Name a time when you faced conflict at the work place?"}, {"date": "17 Feb 2019", "title": "Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at NatCen", "Interview Descriptions": "Applied online through their website. I got an offer for an interview 3 weeks later. The interview focused mainly on research scenario questions where I was asked about how I would approach various research tasks.", "Interview Questions": "How would you approach interviews with vulnerable people?"}], [{"date": "16 Aug 2018", "title": "Senior Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NatCen (London, England) in Jul 2018", "Interview Descriptions": "I was asked about five questions about my background and experience, and then we discussed the pre-interview assessment. The interviewers were really nice and friendly, and made efforts to tease more information out of me when I wasn't giving enough information.", "Interview Questions": "Tell us about a time you worked successfully as part of team."}, {"date": "30 May 2017", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at NatCen (London, England) in Jan 2014", "Interview Descriptions": "1 interview, technical question and presentation about a research topic, no power point facilities available so handouts were used. two people in the panel, very friendly and they made me feel very relaxed and comfortable. it lasted around 1 hour. technical question was a regression exercise, questions were related to the interpretation of result. Other questions were related to different methodologies and approached used during my previous research.", "Interview Questions": "why are you interested in the possition"}]]