[[{"date": "5 Jul 2023", "title": "Research Scientist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Helsinki (Helsinki, Southern Finland)", "Interview Descriptions": "shortlisting then presentation and a final interview and assessment of candidates will be sent transparently and open for an appeal afterward. the interview is very friendly and nice with free stress. Most of the interviewers are calm and conserved", "Interview Questions": "where do you see this field in 5 years?"}, {"date": "14 Apr 2021", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Helsinki (Helsinki, Southern Finland) in Jan 2021", "Interview Descriptions": "Easy going and friendly. Asked normal questions like experience and all. Shame I did not get the job though. Too focused on subject matter experience. That was shame.\n\n Easy going and friendly. Asked normal questions like experience and all. Shame I did not get the job though. Too focused on subject matter experience. That was shame.", "Interview Questions": "Q. Tell me about yourself"}, {"date": "1 Mar 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Helsinki (Helsinki, Southern Finland) in Jan 2018", "Interview Descriptions": "a small interview by professor about background education and elective subjects. it lasted only for 30 minutes. Just prepare tell about your self very clearly including the necessary subject related to the current requirement.", "Interview Questions": "why did you chose to join here?"}, {"date": "23 Nov 2017", "title": "Postdoctoral Research Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at University of Helsinki", "Interview Descriptions": "I was asked personally if I wanted to apply as I knew the employer personally and as I wanted to enter the project I answered yes to the email. No further information there.", "Interview Questions": "no questions were asked as I knew the employer personally"}, {"date": "17 Oct 2018", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Helsinki (Helsinki, Southern Finland) in Apr 2017", "Interview Descriptions": "I was asked to be in a research project about green care. My CV asked for and was helping in the application process for funding from Norway and had my professor and dean to sign the contract.", "Interview Questions": "If I could work with a research project extending over 4 years and apply for funding myself."}, {"date": "28 Aug 2016", "title": "PhD Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Helsinki (Helsinki, Southern Finland) in Jul 2016", "Interview Descriptions": "There was first round of interview of half hour each with the professors you have chosen or the professors related to your application. All these were half hour long and they included a short description of your MSc project followed by the professors explaining their area of interest. The last or first in some cases was a panel interview with four professors starting with your presentation followed by common motivation questions and some scientific questions.", "Interview Questions": "they asked me detail of my project, and then they cross questioned me on the details of the project; How do i like writing the report and what do you think would happen if you went ahead and do more experiments."}, {"date": "5 Jan 2016", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at University of Helsinki (Helsinki, Southern Finland) in May 2015", "Interview Descriptions": "The interview was held in many stages. Panel interview, research presentation and before all of that detailed application assessment. I applied in the month of January and the final interview was in May at the university.", "Interview Questions": "What are your research goals?\r\nHow the past research links to future research interests?"}, {"date": "11 Jun 2017", "title": "Intern Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at University of Helsinki (Helsinki, Southern Finland) in Apr 2015", "Interview Descriptions": "Unformal email conversation with the PI. The skills for the job were reviewed and possible projects were gone through. Rather than interview it was more like a direct motivation test if one is able to do and perform at laboratory bench.", "Interview Questions": "What tools and abilities learned from your degree are you able to take in use when working here?"}, {"date": "29 May 2014", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Helsinki (Helsinki, Southern Finland)", "Interview Descriptions": "Open application, no interview. Applicants submit their previous study achievements and a research proposal plus citations of authored articles, plus CV. The research proposal is the most valued bit and should present a plan of action that is achievable in 3-5 years.", "Interview Questions": "Only a light interview, most of the application process is based on the application and research proposition. The interview concentrates on how well one gets along with the relevant professor / principal investigator. Things like teaching requirements may be discussed, plus maybe some clarifying questions about the research proposal."}, {"date": "20 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Helsinki (Helsinki, Southern Finland) in Apr 2014", "Interview Descriptions": "The professor will ask about your background, what you have done, what courses you have studied. Grades matters as an entrance standard. Once you are selected to be interviewed, it doesn't matter that much. What matters is whether what you have done satisfies the professor's need. It also depends on the fundings. Nowadays may be harder to get into the university since it's suffering funding cut.", "Interview Questions": "How would you find k nearest neighbors in very high dimensional space."}], [{"date": "7 Dec 2015", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Helsinki (Helsinki, Southern Finland) in Dec 2011", "Interview Descriptions": "It was really easy, very basic scientific conversation, presentation about previous work (Master thesis project), lunch with colleagues and checking if one can bound with the team. It lasted half a day in December. Nice thing was that all expenses were covered by the supervisor: flight tickets, hotel, taxi from to airport and from to institute.", "Interview Questions": "basic questions"}]]