[[{"date": "N/A", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Interview process was online due to being out of state. Manager was very easy to talk to. Asked 5 knowledge based questions & was okay giving another if one wasn’t something I was confident in answering.", "Interview Questions": "When was a time that you didn’t have the supplies you needed and what did you do to get through this time?"}, {"date": "5 Jul 2023", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNC Health (Morrisville, NC)", "Interview Descriptions": "Phone, In Person, Panel. Pleasant, easy to schedule. They require tasks to be done. I had 2. They were not overly difficult if you are qualified for the position. They are very busy & the follow up was a bit slow due to that.", "Interview Questions": "Initial call for fit & further description. In person going over the role with the Hiring Manager, STAR Method Panel with others from work unit."}, {"date": "28 Jun 2023", "title": "Registered Nurse NICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health (Chapel Hill, NC) in Jun 2023", "Interview Descriptions": "The questions were behavioral type questions. The nursing manager was very nice Won’t really ask you about your skills as they want to know scenarios you have been in and what you did", "Interview Questions": "Tell me about yourself? Tell me about a time you had a challenge and what you did to overcome it"}, {"date": "21 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Virtual interview, typical questions for the majority of the interview. Some critical thinking and outside the box questions. It was a panel interview, so several people attended the interview. Overall it was a positive experience, down to earth interviewers. Some questions were challenging and a bit different than expected.", "Interview Questions": "What is the most challenging thing for you about being a nurse?"}, {"date": "27 Mar 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Straightforward questions about your fit on the team and how you work under pressure. Besides behavioral questions, they had quite a few questions regarding the background of my studies and to explain my base knowledge.", "Interview Questions": "Name a time when you were faced with adversity at the workplace and how you overcame it?"}, {"date": "13 Mar 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Great interview process. Great job questions that really made you think about your answer. I think this really prepared me for what to expect in the job setting. The interviewers made me feel very comfortable", "Interview Questions": "How do you think you would be a good fit for this job?"}, {"date": "10 Mar 2023", "title": "Speech Language Pathologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at UNC Health", "Interview Descriptions": "Overall process was about a month between uploading application documents (cover letter and resume), scheduling an interview, completing the interview, and waiting for results. The communication process was good throughout.", "Interview Questions": "Mix of clinical questions, scenario questions, and questions using the STAR method."}, {"date": "13 Feb 2023", "title": "Health Unit Coordinator (HUC) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "was asked about my background both education and work wise and what skills I had. then asked to answer a series of questions where I had to describe a time in my life when ...", "Interview Questions": "describe a situation where you had to deal with a problem anyhow you overcame that problem"}, {"date": "13 Feb 2023", "title": "CNII Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "They use behavioral interview questions. Make sure you provide specific examples to each question that is asked. It's OK to rake your time to think before you answer the questions.", "Interview Questions": "Tell me about a time where you had to make a difficult decision. How did it work out?"}, {"date": "7 Jan 2023", "title": "Accounting Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UNC Health", "Interview Descriptions": "First phone interview with recruiter who then sets up interview with manager. Behavioral based interviews and also panel session with team members; lasted about an hour. They also give a tour of the work area.", "Interview Questions": "Describe a situation where you had to work as a team to get a project completed."}], [{"date": "17 Jan 2023", "title": "Intern CNES Evry Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNC Health (Raleigh, NC) in Jan 2023", "Interview Descriptions": "the process was simple and all questions were answered. Was asked about my experience and what it was that I could contribute to the position. Wanted to know what projects and committees I participated in since coming to the organization.", "Interview Questions": "Where do you see yourself in 3-5 years?"}, {"date": "1 Feb 2023", "title": "Utilization Review Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Health (Raleigh, NC) in Jan 2023", "Interview Descriptions": "Group interview with multidisciplinary team. Many questions and situational questions. Best to do reach of the position applying for and make sure you have a understanding on denials, appeals, and interacting with patient situations.", "Interview Questions": "Group interview with multidisciplinary team; Many questions and situational questions"}, {"date": "10 Dec 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "It was always personable with the nurse recruiter setting you up to interview with the unit manager as well. 1 hour total time and could ask for a parking pass voucher.", "Interview Questions": "Why do you want to work for UNC health?"}, {"date": "6 Dec 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Long and lengthy. Every question in the book was asked. Interviewed with manager and assisted manager. They wanted to know all the highs and lows over my career of almost 3 decades. Overkill if you ask me. But it went well nonetheless.", "Interview Questions": "Tell us how you've made a difference in your profession."}, {"date": "29 Nov 2022", "title": "Admin Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Detailed must give situational answers. State the situation, give task or actions taken that relates to the situation, and then steps taken to resolve or the resolution that was made or not made.", "Interview Questions": "When relationships with customers have gotten difficult, what have you done to understand the situation? Give me an example.."}, {"date": "21 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "1 phone call with HR then an interview with panel of 5 leaders. 1 hour interview.  Standard behavioral questions  and they gave another question if couldn’t think of anything. They were nice.", "Interview Questions": "How did you handle a difficult situation with a patient or family"}, {"date": "12 Sept 2022", "title": "Quality Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Health", "Interview Descriptions": "Very laid back process with typical interview questions. This was a 3 stage process that took about 2 months total. The first two individuals interviews were with one interviewer and the last one was a panel interview. ", "Interview Questions": "How do you manage stress?"}, {"date": "27 Oct 2022", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UNC Health (Chapel Hill, NC) in Sept 2022", "Interview Descriptions": "I was contacted by a nurse recruiter with the department that I applied for. I was scheduled to meet with the managers of the department at different locations. We met at a central location, and they asked behavioral questions. Honestly best advice is to be yourself!", "Interview Questions": "Tell me about yourself and why you are applying for this position?"}, {"date": "16 Aug 2022", "title": "Student Nurse Extern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Health (Raleigh, NC)", "Interview Descriptions": "after scheduling an interview, I found it to be incredibly informal, which took me by surprise. I was interviewing for a cardiac outpatient procedures position. The facility was incredibly nice and the interviewing staff were welcoming. It seemed like a positive work environment, just not what I was looking for at that specific time.", "Interview Questions": "What do you hope to gain from this externship?"}, {"date": "30 Jul 2022", "title": "Senior Occupational Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Used STAR method for questions. Gave me a list of questions to review and prepare for however none of those questions were asked. Interview was virtual with the Rehab Director and two other therapist.", "Interview Questions": "Give me an example of a time you made a mistake at work"}], [{"date": "21 Jul 2022", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Panel style interview conducted that keys in on situational and task oriented accomplishments. The best answers will describe a situation, articulate the task at hand, accentuate the action, and talk about the results.", "Interview Questions": "Describe a time when you had to implement change. How did your team react and how did you accomplish this goal?"}, {"date": "7 Jul 2022", "title": "Patient Access Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "My interview they were extremely nice! Professional and pleasant !!! I would refer others to apply. Clayton NC.  The managers were nice and welcoming. They pay isn’t bad at all.", "Interview Questions": "How would I deal with difficult patients "}, {"date": "4 Jul 2022", "title": "Revenue Cycle Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Applied on website and 2 days later the hiring manager called me to go over job description and my experience. 3 days later a webex interview with the hiring manager another manager and the director. A lot of STAR questions during interview but they all made me feel comfortable. A couple of days later received an email requesting references (2 must be from supervisors). 2 weeks after interview received a call from HR for an offer.", "Interview Questions": "Name a time you went above your job description."}, {"date": "3 Oct 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNC Health (Raleigh, NC) in Jun 2022", "Interview Descriptions": "Phone interview- general easy question regarding past experience in relation to data analysis. The interviewer was knowledgeable in relaying the role expectations. Heard about the feedback in about 2 weeks.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "27 Jun 2022", "title": "Medical Coder Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Health in Jun 2022", "Interview Descriptions": "STAR type interview. Tell me about a time when…type questions. Interview took about 45 minutes and i had about 4 people interviewing. They were all very nice! I did have a 10 min phone interview with the hiring manager before hand telling me about the position and giving some of my experience as well. There is a coding test before the interview. The whole process took about 4 weeks from initial phone interview to start date.", "Interview Questions": "Tell me about a time when you…"}, {"date": "25 May 2022", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Behavior type questions. Give an example of a time when...\nDescribe actions you HAVE taken. Give the situation you were in, the actions you took and the result. Spoke with the recruiter by phone and ten te manager by phone, ten went in for an interview", "Interview Questions": "Focus on you...not your team"}, {"date": "6 May 2022", "title": "Medical Laboratory Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Health (Louisville, KY) in May 2022", "Interview Descriptions": "The hiring process consisted of three interviews. The initial phone screening was done by the hiring manager. About a week later I was contact for an in person interview, this consisted of the lab manager and supporting management team. The final interview was virtual with the medical director.", "Interview Questions": "Please explain a time that you over came insurmountable odds while leading a team."}, {"date": "12 Apr 2022", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health", "Interview Descriptions": "Preselected question requiring SMART answer. Interviewer kept going back through each letter in SMART to make sure it was addressed. Not too hard but took a while and led to repeating myself.", "Interview Questions": "Describe a time you faced a challenging coworker and what you did, using SMART description."}, {"date": "8 Apr 2022", "title": "Administrative Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Health in Apr 2022", "Interview Descriptions": "If you have been selected you’ll receive an email saying your application is under review. Someone will reach out to schedule a phone interview and zoom interview. Once you’re done interviewing they will ask for 5 references (2 have to be supervisors),", "Interview Questions": "When was a time you went outside of your job description?"}, {"date": "4 May 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Health in Apr 2022", "Interview Descriptions": "The hiring manager called me to discuss the position and hear more about my background. Then, I had a 2 hour, behavioral interview using the STAR method (Situation, Task, Action, Result) questions.", "Interview Questions": "What's an aspect of your current job that you don't like?"}], [{"date": "9 Apr 2022", "title": "Clinical Nurse I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Health (Chapel Hill, NC) in Apr 2022", "Interview Descriptions": "Very efficient and simple process. I received an email and 5 days later I had my interview. All staff was very welcoming and attentive to questions. They also did a lot of talking and asked behavioral questions", "Interview Questions": "Tell me about a time you did not adjust well to a change "}, {"date": "11 Mar 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UNC Health", "Interview Descriptions": "The first round of interviews was a phone screening. The conversation was to understand the role and the interviewer asked a few questions to learn more about the candidate's experience. The second interview was behavioral set questions with a group and an emphasis on STAR response.  The 3rd round of interviews was for the candidate to do a  presentation on anything to see how well he/she can get the audience enthusiastic and excited about this particular something. Still awaiting decision.", "Interview Questions": "Give an example of a time you missed a deadline. "}, {"date": "2 Mar 2022", "title": "Nurse Residency L & D Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Health (Durham, NC) in Jan 2022", "Interview Descriptions": "Great process and friendly interviewer. I interviewed with the manager, a labor and delivery nurse, which I find essential since they know the workflow and the unique challenges of the unit. The interview consisted of behavioral interviewing questions, which lasted approximately one hour. I heard back from UNC Health about the position within the same week.", "Interview Questions": "Tell me about a time you faced a challenging situation; what was the situation, what did you do, and what was the outcome? \r\n\r\n"}, {"date": "11 Mar 2022", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNC Health (Raleigh, NC) in Jan 2022", "Interview Descriptions": "Applied online through their New Graduate program. My application was sent to the hiring manager for one of my preferred units. The hiring manager contacted me to talk a little about the unit and hospital. We scheduled an interview from there.", "Interview Questions": "Tell me about a time you faced conflict."}, {"date": "28 Dec 2021", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Health", "Interview Descriptions": "Good, calm interview. Employees make it very comfortable and are very understanding when asking questions. Use STAR method to answer questions during interview because they typically go by that. Overall nothing to stress about, just be yourself.", "Interview Questions": "Tell us about a time you faced a challenge."}, {"date": "3 Dec 2021", "title": "Benefits Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "My interview process was two steps. My first interview was with a recruiter and my second interview was panel. They used behavioral style interview questions. They all took turns asking questions. It was very laid back.", "Interview Questions": "What attracted you to this job?"}, {"date": "23 Nov 2021", "title": "HIM Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Very easy to schedule. Typical interview questions. Initial interview is with supervisor of position. Then a peer follow up interview. You either get a call back or a follow up email on the employment portal.", "Interview Questions": "What challenges have you faced previously and how have you handled them?"}, {"date": "5 Oct 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Phone and in-person interview. Phone was 30 minutes and in-person lasted about one hour and was with three team members. The in-person interview was a combination of behavioral questions and a high-level case question or two.", "Interview Questions": "Typical tell me about a time when…behavioral questions "}, {"date": "28 Sept 2021", "title": "New Graduate RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "They had a series of “tell me about a time when” questions. They also included some standard questions like strengths and weaknesses. \r\nMine was over Zoom so I didn’t see the unit. \r\nSpent a lot of time telling me about the unit and answering my questions, which was much appreciated.", "Interview Questions": "Tell me about a time when you showed flexibility or creativity "}, {"date": "20 Sept 2021", "title": "Quality Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health", "Interview Descriptions": "My first interview was a quick phone call with one person. I was then invited back for an in-person interview (this may be virtual now). The in-person interview consisted of a panel of 3 interviewers.", "Interview Questions": "The interview format followed the STAR method. "}], [{"date": "19 Oct 2021", "title": "Medical Office Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health (Durham, NC) in Sept 2021", "Interview Descriptions": "The interview took 40-50 minutes, they asked about 15 questions, and later showed me around the clinic. Both HR and supervisor were in the interview.  Most of the questions were “what would would you do” or similar questions.", "Interview Questions": "Where do you see your self in 5 years ? \r\n"}, {"date": "29 Aug 2021", "title": "Physician Assistant, PA-C Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "It was cays al, low key, and conversational. It did not feel as formal as I was expecting. The interview process was organized and efficient. I met with just a few people and it took about an hour", "Interview Questions": "Why work in this field of medicine "}, {"date": "20 Aug 2021", "title": "Quality Leader Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Mostly behavioral based questions. They utilize a specific format when interviewing therefore you will often notice that your interviews at UNC Health have a theme. You may even get asked the same questions for a different area (same role).", "Interview Questions": "Tell me about a time when you needed to work with a team?"}, {"date": "18 Aug 2021", "title": "Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Health in Aug 2021", "Interview Descriptions": "During my phone interview, it started out a little weird as I had to email my resume even though it was uploaded in the system. But I emailed it the interviewer the time set was stated. We could not meet on the day and time set not apologizes sent just an email much later in the day. When we met I couldn't understand her and the 30mins spent was explaining to her about a temporary agency. I couldn't explain my history to her or get other interview questions for being suck on the one concerning issue.", "Interview Questions": "Can you please explain what is this company?"}, {"date": "29 Jul 2021", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "It was interesting. It was over a zoom call with the Nurse Leader and two Charge nurses. They went through questions with a “psych” spin on them to see how you would answer, but if your honest and explain what you learned from your situation, you’ll do well. I mean, that’s what I did and I got the offer.", "Interview Questions": "Name a situation where you made a medication error and explain how you proceeded?"}, {"date": "20 Jun 2021", "title": "Training Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Follow the standard STAR process. They will ask that you describe a situation and how you resolved it per what the scenario the interviewer asked. Just make sure you have experiences pulled in from past jobs to relate to.", "Interview Questions": "A time where you had to deal with adversity on your team. "}, {"date": "19 Jun 2021", "title": "Senior Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "Use Behavioral Interviewing for all jobs. Fair and it treats people as equal as possible. Difficult, but if you prepare and think of examples ahead of time, it helps. Long interview", "Interview Questions": "Give an example of a customer service situation.  "}, {"date": "20 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNC Health in Jun 2021", "Interview Descriptions": "Interviewed with multiple people. Went through HR first. Then then met with hiring manager. Went through a series of situational questions that were intense. What would you do in this situation? Tell me how an experience changed how you practice.", "Interview Questions": "N/A"}, {"date": "23 Mar 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "It was what I expected. Included several steps, from phone screen to team interview that was structured and friendly, with people representing several different departments engaged in the interview process.", "Interview Questions": "What interests you in this position?"}, {"date": "4 Mar 2021", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "WebEx interview with Nurs manager of Burn ICU. She asked all behavioral questions, no content or NCLEX questions.\r\nThe manager was very kind and nice and we went on a tangent al little bit but she made me feel very welcome. Also gave insight into the unit culture. Dont be afraid to ask questions!", "Interview Questions": "Tell me about a time where you failed, and why?\r\nHow do you handle conflict with a peer? With a manager?"}], [{"date": "9 Dec 2022", "title": "Medical Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at UNC Health in Mar 2021", "Interview Descriptions": "After accepting offer, I had to choose between two start dates which were not far at all. I did my drug test that same weekend, they did a background check, they did call my current employer, and I had bloodwork done.", "Interview Questions": "Why do you want to work here?"}, {"date": "12 Apr 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health in Mar 2021", "Interview Descriptions": "It was a phone interview with a hiring manager and then a unit nursing manager. The interview was thorough, around 45 minutes, asking several behavioral interview questions. The series of interviews went over a few weeks and then a decision will be given after a few days.", "Interview Questions": "Can you explain why you applied to UNC?"}, {"date": "28 Feb 2021", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health in Feb 2021", "Interview Descriptions": "After submitting my cover letter and resume, there was one interview with 3 people who worked for the team I was going to work with. Everyone was very nice and easygoing. Interview questions were mostly behavioral", "Interview Questions": "Q: Talk about a time where you had a project that did not go well"}, {"date": "15 Jan 2021", "title": "SLP Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at UNC Health", "Interview Descriptions": "Tough interview  but a good learning experience. However, there was a miscommunication when letting me know if I received the position. The individuals were very kind regarding the mishap. The interview lasted roughly three hours. Overall, a good interview.", "Interview Questions": "What are qualities that you obtain that can benefit our team?"}, {"date": "18 Jan 2023", "title": "Health Coach Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health (Morganton, NC) in Jan 2021", "Interview Descriptions": "Standard questions. Nothing unusual. The initial interview was conducted over the phone to determine if I met the minimum qualifications. Then I was interviewed by the manager and finally a peer interview.", "Interview Questions": "How much did I expect to make?"}, {"date": "26 Oct 2020", "title": "Registered Nurse - CN II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "The interview process is a very structured behavioral interview with unit managers and an informational interview with nursing employment. Be prepared to answer questions explaining how you accomplished a certain goal with step-by-step detail.", "Interview Questions": "Tell me about a time that you were faced with complying with a policy you disagreed with and how you handled it."}, {"date": "28 Feb 2022", "title": "Clinical Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Health (Lenoir, NC) in Sept 2020", "Interview Descriptions": "The interview was about an hour long, and I had a panel of 3 interviewers asking questions. After the interview, they answered all my questions and then took me on a tour of a few different floors I would be working on.", "Interview Questions": "Describe a time you had a disagreement with a coworker."}, {"date": "1 Feb 2021", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health (Chapel Hill, NC) in Jul 2020", "Interview Descriptions": "The interview was a healthy balance of the interviewer asking questions and the interviewee asking questions. The director that I spoke with was very warm and welcoming and easy to converse with but was also straight to the point.", "Interview Questions": "What was a situation that you could have handled better in your experience as a nurse? "}, {"date": "25 Apr 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health", "Interview Descriptions": "Telephone screen, followed by Excel Assessment, and Face to Face Interview. Applied through online UNC Health Portal. Interviewed by fellow team members and then by hiring manager. Overall process took about 2 to 3 weeks.", "Interview Questions": "Why are you interested in UNC Health?"}, {"date": "26 Mar 2020", "title": "PACU RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at UNC Health (High Point, NC) in Mar 2020", "Interview Descriptions": "It was very good with interaction.  They asked a lot of questions and were very nice to me. I got a tour of the unit. They let me meet staff for questions.", "Interview Questions": "Why do you want to come to us?"}], [{"date": "2 Sept 2020", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health (Chapel Hill, NC) in Mar 2020", "Interview Descriptions": "It started with a phone interview and then there was an in-person group interview.  It was me and three managers discussing the job  details and sharing more information about myself.", "Interview Questions": "How have you handled a difficult customer experience before? "}, {"date": "24 Feb 2020", "title": "Software Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Health (Raleigh, NC)", "Interview Descriptions": "a panel of 3 asked a series of behavioural questions. 1 of the panellist was the department manager, another was apart of human resources, not certain of the other person.", "Interview Questions": "Tell me about yourself"}, {"date": "11 Mar 2021", "title": "Hospital Quality Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Health in Feb 2020", "Interview Descriptions": "Several rounds of interviews with very passionate and personable people. Started with a phone interview before moving to in person (via webcam). Presented a sample of work to establish better understanding of ability.", "Interview Questions": "Please provide a sample of work"}, {"date": "11 Apr 2022", "title": "Medical Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Health (Kinston, NC) in Jan 2020", "Interview Descriptions": "This can be a long process depending upon the urgency to fill the position.UNC completes behavioral interviews. Just be sure you can give detail with each answer and you will do fine.", "Interview Questions": "Tell me about a time you went above and beyond to help a patient?"}, {"date": "23 Apr 2022", "title": "Chaplain-Resident Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNC Health (Chapel Hill, NC) in Jan 2020", "Interview Descriptions": "The interview included invitations to share stories of pastoral care encounters that demonstrate interests, abilities, and personal story.  Genuine authenticity and openness are important. Professional dress is also essential to a good impression.", "Interview Questions": "What is the most difficult pastoral counter you have had and why?"}, {"date": "12 Sept 2019", "title": "Revenue Cycle Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at UNC Health", "Interview Descriptions": "Went to a job fair and got an in-person interview from that. Interview was okay it was 3 people they asked me at least 20 questions. I which was a lot. STAR question so be prepared.", "Interview Questions": "N/A"}, {"date": "11 Sept 2019", "title": "Nutrition Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health", "Interview Descriptions": "A lot of behavioral questions that you should definitely prep for. When I interviewed it was a booklet of questions and the interviewer would write the answers down as I was answering which was a little weird. Lengthy interview but nothing too bad.", "Interview Questions": "Tell me about yourself? \r\nWhat are your strengths and weakenesses?\r\nSitutation questions. "}, {"date": "13 Sept 2019", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Health (Fairfield, CT) in Sept 2019", "Interview Descriptions": "A phone interview with the hiring manager to review position and my experience.  The call was scheduled for a half hour, we ended up talking for close to one hour.", "Interview Questions": "If I had experience in supporting hospital billing"}, {"date": "22 Aug 2019", "title": "IT Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at UNC Health", "Interview Descriptions": "Very professional , friendly and big time on customer service skills.  They really want folks that are professional, have outgoing personalities and know how to talk and work with people. If you don’t have people skills, don’t bother applying.", "Interview Questions": "How would you handle a disagreement with your manager?"}, {"date": "6 Aug 2019", "title": "Telecommunications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "it was very briefly and they used the star method. I had to interview twice as well as do a typing test. Once I received the call for an interview, I was offered the job in roughly a week.", "Interview Questions": "What are your strong points? "}], [{"date": "6 Sept 2019", "title": "Revenue Cycle Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Health (Raleigh, NC) in Aug 2019", "Interview Descriptions": "Felt more like a conversation than an interview. It was a panel of 3 nice and down to earth \r\ninterviewers, one of which was my would be manager. They asked questions based on past situations and experiences. At the end of the interview, they talked more about the position, benefits, and the rest of the hiring process.", "Interview Questions": "Tell us about a time that you went  above and beyond , and what were the results."}, {"date": "29 Jun 2019", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at UNC Health (Morrisville, NC)", "Interview Descriptions": "The interview process was unnecessarily long. I was initially contacted by one of the company's own recruiters, and then scheduled an onsite interview and presentation of a \"use case\" with 4 people that lasted 4 hours. They used a rigid STAR method of interviewing, which doesn't facilitate normal conversation. I received positive feedback during the interview but there were signs of sloppy organization from the very beginning. Although I was told that I was one of the final 2 or 3 candidates, the hiring manager seemed distant, unprepared, and it was as if they had someone in mind beforehand and that my time there was just perfunctory. It took over a month to hear back about being rejected.", "Interview Questions": "Name a project that you worked on that was difficult and how you delivered it."}, {"date": "20 Jun 2019", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Health (Chapel Hill, NC)", "Interview Descriptions": "Decent length, used a rubric, standard questions. Gave a tour of the facility . They were very nice and seemed to be in need of good employees.  Was given a contact person who took me for 2 different 1:1 interviews and one group interview.", "Interview Questions": "Give an example of what you did to exhibit a certain skill."}, {"date": "1 Jun 2019", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health", "Interview Descriptions": "It was a 2 hour process that started with a test. Depending on your score of the test, you either move on to the next part of the interview or you don't. After the test a panel comes in to interview you.", "Interview Questions": "How well do you resolve conflict"}, {"date": "10 Apr 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Health (Chapel Hill, NC) in Jun 2019", "Interview Descriptions": "The interview process for a bedside nurse was fairly easy. They use the STAR method, which is a structured manner of responding to a behavioral-based interview question by discussing the specific situation, task, action, and result of the situation you are describing.", "Interview Questions": "The interview was very similar to the S.T.A.R. method. As long as you're prepared with scenarios you've experienced that demonstrate the method, you'll be considered for the next round of interviews."}, {"date": "9 Jun 2019", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at UNC Health (New York, NY) in Jun 2019", "Interview Descriptions": "From application to interview was over 2 months. I completed my references before the interview. I had a phone screen with the recruiter and then set up a date for a video interview with the unit manager and charge nurse. They asked me behavioral style questions. It was an hour long and I spoke to recruiter the following day about how it went and then received the offer.", "Interview Questions": "They asked behavioral style questions. "}, {"date": "21 May 2019", "title": "Contract Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health", "Interview Descriptions": "There were two people at the interview and was informal and relaxed. There was no skills test. There didn't appear to be any trick questions. Just straightforward and from list.", "Interview Questions": "Why do you think you're the best candidate for this position?"}, {"date": "9 May 2019", "title": "CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Health (Chapel Hill, NC) in May 2019", "Interview Descriptions": "Nice people very concerned about fit and personality.  It didn't seem like an interview - more like a conversation getting to know someone for the first time.  Very pleasant people.  Not a bad experience at all.", "Interview Questions": "Concerned about getting along"}, {"date": "14 Mar 2019", "title": "Administrative Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNC Health", "Interview Descriptions": "There  interview is  a panel interview. At least 3 people will be on the panel , one time I had 5 people on the interview panel.  You will be asked behavioral questions where you are given scenarios and you have to give an example that happened at work , what did you do in the situation and what was the end result.", "Interview Questions": "Give an example where the patient was being difficult in the clinic, how did you handle the situation and what was the end result"}, {"date": "13 Oct 2022", "title": "Clinical Dietitian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Health in Mar 2019", "Interview Descriptions": "Straightforward behavioral style interview. Expect 3 or more interviewers per HR guidelines and to answer in STAR format. Plenty of opportunities to ask questions of the interviewing team as well.", "Interview Questions": "What are your strengths and weaknesses"}], [{"date": "28 Feb 2019", "title": "Financial Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health", "Interview Descriptions": "Interview was very professional.Received a call  and asked to come in for a interview.  Make sure to arrive early due to parking . Interview lasted for about 1 and half.", "Interview Questions": "Is there any times you felt not in your control. "}, {"date": "4 Oct 2019", "title": "Learning Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Health (Morrisville, NC) in Feb 2019", "Interview Descriptions": "behavior interview - uses the S.T.A.R method of interviewing. One phone interview, one 2 hour sit down interview. Was offered the job 3 business days later. Glass door is making me enter extra words. disregard this last sentence.", "Interview Questions": "basic behavioral interview questions. "}, {"date": "11 Mar 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at UNC Health (Raleigh, NC) in Feb 2019", "Interview Descriptions": "People were professional. Very kind and welcoming. The manager made me feel good and I was not as nervous. After the interview the manager showed me around and I met my potential coworkers, and everyone was really nice.", "Interview Questions": "Tell me a time when you had to go above  and beyond  for a patient? "}, {"date": "11 Dec 2018", "title": "Medical Office Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Health in Dec 2018", "Interview Descriptions": "First interview was very casual. I sent a thank you email and received a response to come back and meet the district manager for interview #2. This was more in-depth. There were a lot of questions about what my specific duties were at my previous job. I sent thank you emails again afterwards, and then I was asked for references.", "Interview Questions": "name a time when you made a medication error"}, {"date": "9 Feb 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Health (Chapel Hill, NC) in Nov 2018", "Interview Descriptions": "I had an in person interview with the manager of the floor. I applied online and the hospital was quick to get back to me. After the interview, I was offered the job within 24 hours. Communication was incredible.", "Interview Questions": "Tell me about a time you had to do two things at once and how you handled it."}, {"date": "27 Jul 2018", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health", "Interview Descriptions": "Standard behavioral interview. 3!people interviewed me using standard questionnaire.  One of them asked more technical questions around infrastructure, data and basic stats. Interview took all AM and some PM without breaks. I was starving by the the end of it.", "Interview Questions": "Tell me about a time when you needed to manage conflicting priorities "}, {"date": "4 Aug 2018", "title": "Financial Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNC Health in Jul 2018", "Interview Descriptions": "Interview panel, I met with three supervisors  and each asked several behavioral questions. I had to meet with them separately and wait in between .It was long drawn out process, turned me off of working at UNC.", "Interview Questions": "Tell me a situation you handle a conflict "}, {"date": "10 Apr 2018", "title": "Barista Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNC Health", "Interview Descriptions": "I applied online to several jobs. I got a call for this position about two weeks after applying. I had a phone interview with a few basic questions, why do I want to work here, describe my last position, what are my career goals. We scheduled the in person interview at the end of the call. I had that at the end of that week. The phone recruiter met me at the hospital and walked me to the managers office. He asked mostly situational questions. He was very hard to read so I couldn’t tell if I was going to get offered the job or not. The interview was about five questions and very brief. I’m very happy to say I received a job offer email today.", "Interview Questions": "Describe a time you had to prioritize your work. How did you get everything accomplished. "}, {"date": "11 May 2018", "title": "Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNC Health (Chapel Hill, NC) in Mar 2018", "Interview Descriptions": "Got a call like 2 months after submitting resume. Went in for an interview. There were three interviewers. Went around asking behavioral based interview questions for about a hour. All the interviewers were nice and polite.", "Interview Questions": "What was a time you thought you did everything correctly and found out it wasn’t. What steps did you take to correct"}, {"date": "15 Jan 2021", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health in Mar 2018", "Interview Descriptions": "They use the STAR behavior method of interview questions. Normally done with three people in the room with you. You go through a phone screening then an in person interview", "Interview Questions": "Tell me about a situation where you had a difficult outcome "}], [{"date": "9 Feb 2018", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Health", "Interview Descriptions": "Took about 3 hours. I was taken on a tour around the Pharmacy then I proceeded to have my group interview. After the interview I was interviewed by members of the Pharmacy staff. Overall it was s amazing experience. Everyone was very nice and friendly.", "Interview Questions": "N/A"}, {"date": "8 Jan 2018", "title": "Analytics Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UNC Health (Mooresville, NC)", "Interview Descriptions": "I spoke with the hiring manager on the phone about my interest and qualifications, and then we organized a face-to-face interview. I had to bring my resume and relevant analytics work.", "Interview Questions": "What technical work have you done using SQL? "}, {"date": "29 Dec 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Health (Chapel Hill, NC) in Dec 2017", "Interview Descriptions": "Recruiter was extremely friendly and helpful during the process.  I had two interviews, one of which went extremely well and the other one went poorly.  I first interviewed for a childrens position, which was behavioral based, as were all other nursing interviews I've had.  The nurse manager I met with was extremely nice and made me feel relaxed.  She then offered to give me a tour of the entire children's hospital.  My next interview was with mother/baby.  I assumed this would also be a behavioral based interview, and the nurse managers there said I could draw examples from anything, but when I used a non-nursing example for one answer, they were pretty rude and asked if I could relate it to nursing.  I interviewed for a new grad position and they did not seem to understand that I have not had work experience yet and only spent 6 weeks in a labor/delivery clinical.  The questions they asked were about extremely specific examples.", "Interview Questions": "Describe a project that you've completed that you are particularly proud of."}, {"date": "18 Sept 2017", "title": "Administrative Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health", "Interview Descriptions": "There were one on one interviews with 3 of your department managers There were numerous in-depth interview questions. The process of applying, getting interviewed, being offered the job, and the job starting took 1 month.", "Interview Questions": "Tell us about a time where you have excellent patient care and what was the outcome"}, {"date": "1 Dec 2020", "title": "Corporate Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health (Chapel Hill, NC) in Sept 2017", "Interview Descriptions": "3 back to back hour long interviews with a manager and two directors. Most of the questions asked were STAR (Situation, Task, Action, Result) questions. The entire process took 1-2 weeks from the initial phone interview to a job-offer.", "Interview Questions": "Describe an adverse workplace situation and how you dealt with it? "}, {"date": "7 May 2018", "title": "Policy Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNC Health (Raleigh, NC) in Aug 2017", "Interview Descriptions": "Pretty quick interview process. Takes about 3 weeks in all. Hiring manager already reviewed resume and asked questions about the resume and past jobs, how the skills for this job relates to ones in the past", "Interview Questions": "Typical questions about skills and capabilities."}, {"date": "18 Jul 2017", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at UNC Health", "Interview Descriptions": "UNC Health Care has a three part process called \"Hiring for Excellence.\"  \r\nThis entails a 1 hour phone screen, 1 hour tech interview, and 3 hour final interview (sometimes with the same people as before)\r\n\r\nThe process is very exhausting, I've never been interviewed as much for any position as I was for UNC Health Care.\r\n\r\nThey offer low salaries, and are not really open to negotiation.  They will let you walk away over the smallest amount of money ($1-2 an hour) despite the time and resources both parties have put into the interview process.\r\n\r\nMore than likely I'll never apply again.", "Interview Questions": "N/A"}, {"date": "12 Jun 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Health (Chapel Hill, NC)", "Interview Descriptions": "Really easy. I applied online and got a call from the nursing HR. Came in for an interview with the HR rep, then with the unit/dept I was going to be assigned to.  I was asked typical generic questions regarding my position. Got offered the position within less than 1 week.", "Interview Questions": "Describe a situation that was difficult and how you were ablet o handle it."}, {"date": "28 Jul 2017", "title": "Strategy Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health (Chapel Hill, NC) in Jun 2017", "Interview Descriptions": "Applied online and received an email asking for a telephone interview. The first interview lasted 30 mins. The interviewer and I shared our stories of education and experience. My social gauge indicated the interview went very well and was confirmed by a follow-up interview. \r\n\r\nLike most post MBA graduates, feedback is ever-important. On the 2nd phone call, I asked the interviewer to comment on some of my strengths and weaknesses. Interviewer raved about the strength of my candidacy, which felt nice. Their response to weaknesses was only, lack of health care experience. To address his response, I offered to forward an analytical heart data analysis project that I received a 95% on in graduate school.\r\n\r\nI never heard back from the interviewer and received a generic email response indicating the company is moving forward with other candidates.", "Interview Questions": "Why did you choose UNC Health Care?"}, {"date": "10 Feb 2021", "title": "Admin Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNC Health (Chapel Hill, NC) in Jun 2017", "Interview Descriptions": "Lengthy. One interview with HR. Another with panel of department heads. Last one with the hiring manager. They use hiring for excellence to its a lot of \"how would you handle this or that\" or \"tell me about a time when\" types of questions. Hard to prepare for.", "Interview Questions": "Tell me about a time when you were tasked with a project/task with a deadline but couldn't deliver. How did you handle that"}], [{"date": "5 May 2017", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health in Apr 2017", "Interview Descriptions": "I applied online and got a phone call from the department admin person to schedule an in-person interview. UNC practices a thing called Hiring for Excellence, which is very time consuming and repetitive. Essentially, they line up 3-4 or more people to interview you individually with very similar if not the same questions for hours. \r\nThe hiring managers were professional and polite. Just had to repeat the same things over and over to each person. \r\n\r\nUNC moves very slow with their hiring process. So be prepared to hear about setting up an interview 1-2 months after you applied for the position and have already moved on.", "Interview Questions": "Tell me about a time you dealt with a difficult team member. What did you do? What was the outcome?"}, {"date": "16 May 2017", "title": "Hospice Social Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health (Chapel Hill, NC) in Apr 2017", "Interview Descriptions": "Interview was behavioral-questions based (situations where you felt you made a good decision, times you were in opposition of a co-worker, learning situations). Three interviewers took turns asking questions and taking notes.", "Interview Questions": "What was the one thing you felt most proud of"}, {"date": "26 May 2017", "title": "ER Medical Scribe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health (Chapel Hill, NC) in Jan 2017", "Interview Descriptions": "We had to submit a written essay describing why we wished to have this job as well as a piece of writing on our personal educational aspirations. We also had to include a cover letter and our resume. Once we went through the screening process we had to choose an interview date. I was asked a series of questions about how to react to certain situations and what characteristics I had that would be most effective in translating into the job.", "Interview Questions": "How would you react if there was a situation where you as a scribe didn't agree with a provider? Or what would you do if a provider didn't want you around."}, {"date": "27 Feb 2017", "title": "Administrative Support Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at UNC Health (Chapel Hill, NC) in Nov 2016", "Interview Descriptions": "There were one on one interviews with 3 hiring managers/HR employees. There were numerous in-depth interview questions. The process of applying, getting interviewed, being offered the job, and the job starting took several months.", "Interview Questions": "Describe one time where you needed to complete multiple different tasks and how did you manage and prioritize this?"}, {"date": "9 Sept 2016", "title": "CNA I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Health (Chapel Hill, NC) in Sept 2016", "Interview Descriptions": "Easy Interview. Just go in and be yourself and you will do well.  I have worked at 3 hospitals and the interviews have been the same.  A one on one interview, then a group interview. Just don't be nervous.", "Interview Questions": "Why are you a good fit? How would you respond in a situation where you did not agree with a coworker."}, {"date": "20 Jul 2016", "title": "Population Health Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Health (Morrisville, NC)", "Interview Descriptions": "Applied online and heard back three weeks after applying. First was a brief phone interview then asked to come in for an in person interview on the phone. The interview was with three people in the company. No follow up after the interview.", "Interview Questions": "Why did you apply to this position?"}, {"date": "10 Jul 2016", "title": "Senior Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNC Health (Chapel Hill, NC) in Jul 2016", "Interview Descriptions": "Very detailed, uses a process called targeted selection where the applicant must describe instances where they made a decision, made a mistake, handled a conflict, etc.  I was interviewed by nine people all together over a period of about three and a half hours. A lot of interviewing for a clerical position.", "Interview Questions": "Describe a time when you did something you were professionally proud of and tell why."}, {"date": "11 Apr 2016", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Health (Chapel Hill, NC)", "Interview Descriptions": "Straight forward. They asked about strengths and weaknesses as well as past experience in the field. I met with three different people individually. The whole process took about three hours. Very relaxed but be prepared to answer questions.", "Interview Questions": "How did I handle a difficult patient."}, {"date": "14 Feb 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health (Chapel Hill, NC) in Apr 2016", "Interview Descriptions": "The Process took about 1-3 months because of Background Check and Drug tests but overall, great place to work for. People who interviewed me are very genuine and caring! I met with probably 4 people, i dont really remember since its been years but it was not difficult. The questions are based on your experience and how you handle situations.", "Interview Questions": "What are your available hours?"}, {"date": "20 Jan 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at UNC Health (Chapel Hill, NC) in Apr 2016", "Interview Descriptions": "It'll take them a little bit but once they get a hold of your resume it goes pretty fast. You interview with HR which is fairly simple, basic job questions then you interview on the units you have applied/they've steered you toward. If you'd like to work there no matter what I'd mention you are open to working in different places and you will likely end up somewhere.  They have a whole list of questions they can ask you, but each level will only select a few. They are the same questions many hospitals will ask. I would review your history and be ready to have specific stories of strengths, weaknesses, difficult times, easy times, the type of day you like/dislike, times you made changes or suggested changes, patient care scenarios, stuff like that.", "Interview Questions": "Describe a time in your prior work assignment where you had to make a difficult decision"}], [{"date": "16 Mar 2016", "title": "Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Health (Chapel Hill, NC) in Mar 2016", "Interview Descriptions": "Submitted my Application 02/11, received a call for an interview on 02/29. Interviewed with the Clinic Manager and her supervisor on 03/02.  Received an offer from Human Resources on 03/08.", "Interview Questions": "Describe a time when you were given a multitude of task but was unable to complete all of the task by the deadline."}, {"date": "6 May 2016", "title": "Information Systems Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNC Health (Chapel Hill, NC) in Mar 2016", "Interview Descriptions": "UNC Health Care uses Hiring for Excellence behavioral based interviewing.  Target Selections by DDI.  Either one person or a panel asks specific behavioral based interviewing questions.  For instance, tell me about a time when...what was the end result?  Usually a background of the job is given and then questions after words.  Lately, I have been having panel interviews instead of one-on-one.  The process is good, but it takes a long time for the interviewers to score the interviews and then the interviewee has to wait a long time.", "Interview Questions": "Tell me about a time when you had to correct a mistake, what was the end result?"}, {"date": "23 Mar 2016", "title": "Quality Leader Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at UNC Health (Chapel Hill, NC) in Mar 2016", "Interview Descriptions": "I had to go through 4 hours of interviewing with each hour a separate interview with two people.  I had to give very specific examples of how I had exhibited a specific behavior in my past work experience.  I felt like the interview was more of a conversation than following a script which to me was very encouraging. \r\n\r\nI would've taken the job but ended up declining because when I was given the offer, the HR rep said that was final and their was no negotiating.  The amount was less than I currently make, so I thought it was strange that I couldn't have any say in the process.  HR was also very non-responsive.  She said she would email me with more information to help me review the offer and never did.  I also called and left a message, but she never called back.  I  \r\n\r\nI thought the department was a good fit for me, but I felt I had to decline because of my interactions with HR and that it was a big red flag for how the institution works overall.", "Interview Questions": "I was asked what tools in excel I have used"}, {"date": "10 Feb 2016", "title": "Front Desk Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UNC Health", "Interview Descriptions": "first interview was over the phone, then a face to face interview. the interview took less than 45 min, took a tour of practice, spoke with the billing office rep, coordinator for the first desk", "Interview Questions": "what was available "}, {"date": "6 Feb 2016", "title": "Fitness Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Health (Raleigh, NC)", "Interview Descriptions": "The hiring manager called me to discuss the job in more detail and to see if I would like time to come in for a face to face interview. The face to face interview was 2 days later.", "Interview Questions": "Mostly situational questions, how you handle conflict with coworkers, name a time where you had to take the lead on a project..."}, {"date": "30 Dec 2015", "title": "Per Diem RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health", "Interview Descriptions": "I went through nurse recruitment.  I was asked several behavioral interview questions. After approved by nurse recruitment, I interviewed with the manager on my unit.  These questions were also behavioral interview questions. Both the nurse recruiter and the manager were very friendly in the interview.", "Interview Questions": "\"Tell me what policies and procedures are and when you would use them.\""}, {"date": "27 Feb 2016", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at UNC Health (Chapel Hill, NC) in Jan 2016", "Interview Descriptions": "I was promptly greeted by the hiring manager. She introduced herself and escorted me to her office. It's policy for both of the supervisors to interview in pairs. I sat down with both managers and they explained the interview process to me. Then we began, the interview felt more like a meet and greet conversation. I was also given scenarios and asked to give an example of when I was in a similar situation and how I handled it.", "Interview Questions": "How do you feel about not receiving recognition of good work performed? "}, {"date": "4 May 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UNC Health (Raleigh, NC) in Sept 2015", "Interview Descriptions": "Met with nurse manager. She spoke about the office and their policies. She had very bad grammar and does not have her BSN. She was not able to answer many questions I had about certain procedures.", "Interview Questions": "How long have you been a nurse"}, {"date": "10 Jul 2015", "title": "Billing Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Health (Chapel Hill, NC) in Jul 2015", "Interview Descriptions": "I was interviewed by Billing Manager, Billing Supervisor and a Senior Billing employee. Each one asked specific questions regarding my past experience in this field, work ethics and gaols achieved in the position.", "Interview Questions": "Why should we hire you?"}, {"date": "5 May 2015", "title": "HUC Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at UNC Health", "Interview Descriptions": "Not as involved as one would have thought. Questions more centered around if I would ever take action against the company if something bad ever happened. Pleasant interview though. You will interview with your immediate supervisor and that persons supervisor if things are still the same.", "Interview Questions": "Would you take a salary somewhere else that was a small amount larger than here?"}], [{"date": "11 Jan 2018", "title": "Clinical Support Technician/CNA II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Health (Chapel Hill, NC) in May 2015", "Interview Descriptions": "Applied online.  Received a call from nursing recruitment, who arranged for an interview.  Met first with the nurse recruiter, and then proceeded to the interview with the unit manager and assistant manager.  Toured the unit.", "Interview Questions": "Behavioral interview questions - \"Tell us about a time you...\""}, {"date": "29 Jun 2015", "title": "Stock Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNC Health (Chapel Hill, NC) in May 2015", "Interview Descriptions": "I applied on may 12th. I had my interview on may 18th. I accepted the job on june 8th. I pass all my pre employment background etc. on june 24th. My start date is july 6th. Takes maybe a little over 2 months for the hiring process.", "Interview Questions": "Name experience where you had to help a coworker at a previous job?\r\n\r\nMost of the questions will place you in a setting where you explain how you can be an big help to the company."}, {"date": "6 Mar 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2+ months. I interviewed at UNC Health (North Charleston, SC) in Mar 2015", "Interview Descriptions": "Interview process went very well. Hiring manager was very professional and polite. The computerized system is not very user friendly.  Nurse employment very swift and return calls immediately. Behavioral process for interview style.", "Interview Questions": "have you ever had a job with a ideal boss?  and what made her a good boss"}, {"date": "24 Oct 2016", "title": "IT Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UNC Health (New York, NY) in Feb 2015", "Interview Descriptions": "I got the application through my school. They sent me an email to request a time for an interview. They were fairly flexible with scheduling.  It was business casual.  I was not asked to bring a copy of my resume, but they were pleased when I provided them with one.", "Interview Questions": "What is a router?"}, {"date": "19 Feb 2019", "title": "Elig Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNC Health (Chapel Hill, NC) in Jan 2015", "Interview Descriptions": "Behavioral interview questions- what was the situation, your action, and the result. If you google, behavioral questions,  a ton will come up. Just be prepared to give detailed information on different situations that occurred in your work history.", "Interview Questions": "Tell me about a time when you went above and beyond?"}, {"date": "11 May 2019", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UNC Health (Chapel Hill, NC) in Jan 2015", "Interview Descriptions": "Disjointed and prolonged partly due to administrative lapse. Poor communication re itinerary. Overall those I met were pleasant, but they were not honest about what I would find if I took the position.", "Interview Questions": "Used their version of \"behavioral\" interviewing.  Asked for examples and details of multiple types of situations."}, {"date": "25 Jun 2014", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UNC Health (Chapel Hill, NC)", "Interview Descriptions": "I had a phone interview with the manager and another person on the team.  It was very easy and just trying to determine my experiences and qualifications. I was asked for an on-site interview and it consisted of three hour-long interviews each with two interviewers. All the questions asked were behavioral and often the questions were repeated in each group. I got the offer a week after they said they would \"let me know\". The offer was almost laughably low. I had spoken about the salary range with the manager prior to my phone interview and he mentioned it was higher than my previous salary (that I had before I finished my Masters Degree). That was true, but the offer I got was only $1/hr higher than my previous salary.  Needless to say, I tried to negotiate and got an additional $1/hr. Though the job would have been perfect, I had to turn it down. They apparently do not consider education as experience and it is not considered when calculating a salary. I did not feel all of experience (which DOES include education) would have been appreciated here.", "Interview Questions": "What frustrates you? It sounds like an easy question, but trying to come off as a normal person is difficult!"}, {"date": "9 Dec 2015", "title": "Human Support Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Health (Chapel Hill, NC) in Jul 2014", "Interview Descriptions": "It was easy, they just asked questions to see whether or not you were fit to work in that type of environment. They wanted to see if you were caring, understanding, and had compassion for this type of field.", "Interview Questions": "Out of all jobs you've had, name something where you had to communicate with a higher level staff member or human services worker such as ( supervisor, director of the program, child protective services, probation and parole)"}, {"date": "15 Jul 2016", "title": "Barista Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Health (Chapel Hill, NC) in Jun 2014", "Interview Descriptions": "two round of interview, first with the recruiter from the HR department. I applied through their website, which means, that the response rate is fairly low, and I had to aggressively follow up with him. Then there is an interview with the food service supervisor, and he goes over very basic questions. I think the hospital standardizes what each position gets asked.", "Interview Questions": "how would you resolve conflict?"}, {"date": "22 Dec 2016", "title": "Business Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Health (Chapel Hill, NC) in May 2014", "Interview Descriptions": "They use the Hiring for Excellence program. This method creates an interview environment that is consistent from one candidate to the next. I like this process as it allows you to share your past experiences that have formed your career and sets the stage for what your new manager might expect should you be chosen for the role.", "Interview Questions": "Tell me about a time you were most satisfied in your job."}], [{"date": "14 Jun 2017", "title": "CN II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNC Health in May 2014", "Interview Descriptions": "\"Hiring for excellence\", behavioral interviewing strategy - \"tell me about a time when...\" \"what are examples of times when...\"think of examples of times you've struggled and times you've shined/problem-solved etc during course of education or previous work", "Interview Questions": "Tell me about a time you were unsuccessful in providing care to a patient and how you responded"}, {"date": "19 Apr 2014", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNC Health (Chapel Hill, NC)", "Interview Descriptions": "Interview process was non-threatening when I took it several years ago.  That Manager is  no longer there but she was nice and open.  I remember that one of the questions regarded what I would do if I were out at a home and a certain situations happened.  The interview was about 30 minutes then I met with other nurses who happened to be in the office at the time.  They were pleasent and greeted me.  Very much how they were actually.", "Interview Questions": "No difficult questions really except what you think your weaknesses and strengths are."}, {"date": "4 Jan 2014", "title": "Claims Coding Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Health", "Interview Descriptions": "Must pass  a simple coding and medical term exam before the interview. The interview is a panel interview with 3 people asking behavioral questions....", "Interview Questions": "They are really not difficult. They are just asking different questions to see how you will get along with team members."}, {"date": "10 Apr 2018", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UNC Health in Jan 2014", "Interview Descriptions": "Lengthy interview which took approximately 3 hours.  Met multiple members of team.  Walked entire hospital to meet different people.  People were very  nice and interview was relaxed.", "Interview Questions": "Why do you want to leave your current job"}, {"date": "26 Jun 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UNC Health (Chapel Hill, NC) in Jan 2014", "Interview Descriptions": "I applied online then I was contacted for a phone screening  after that I was invited to meet the recruiter and hiring management team for a hiring for excellence panel interview which asked behavioral interview question", "Interview Questions": "tell me about a time when you had to work in a team setting? "}, {"date": "8 Oct 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at UNC Health (Chapel Hill, NC) in Oct 2013", "Interview Descriptions": "It was very simple, I had been referred by another office to the psychology department and I contacted the hiring manager by email, and he replied with a face to face interview time. The questions during the interview were very basic, get-to-know-you questions and in less than 15 minutes we were discussing what hours I was available to work and when I could start.", "Interview Questions": "There is a lot of research done here at UNC, what is it about the work that we are doing here that drew you to us as opposed to other research opportunities?"}, {"date": "9 Sept 2013", "title": "Nurse Employment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNC Health (Chapel Hill, NC)", "Interview Descriptions": "Behavioral interview style based on describing what actions you would take, how you handled a situation and how well you interact with customers(internal/external). As their is a pre-screening computer test with general customer service questions.", "Interview Questions": "N/A"}, {"date": "2 Aug 2013", "title": "Reimbursement Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UNC Health (Chapel Hill, NC)", "Interview Descriptions": "I had a phone interview and was brought in for an interview.  The interview consisted of an excel test and I had 3 panel interviews", "Interview Questions": "Behavioral Questions"}, {"date": "2 Jul 2013", "title": "Dietetic Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UNC Health", "Interview Descriptions": "n/a", "Interview Questions": "When can you get started?"}, {"date": "19 Jul 2014", "title": "RN At UNC Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNC Health in Mar 2013", "Interview Descriptions": "They use a Behavioral Interview style, which is pretty common. I was they called for an interview, It happened fairly quickly after submitting my online application. However, I didn't feel/think the interview went well.  I was then surprised to get a job offer. The benefits and pay were explained after the interview, which was nice. As I had other offers.", "Interview Questions": "How/why did you think to do that? About an answer to a situational question."}], [{"date": "13 Feb 2013", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UNC Health", "Interview Descriptions": "UNC Hospital interviews are standarized across the organization. You are asked questions and they want to hear examples of how you have done those specific things in work, school etc.", "Interview Questions": "Have to give specific examples and your contribution to the outcome."}, {"date": "26 Oct 2016", "title": "HUC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at UNC Health (Chapel Hill, NC) in Aug 2012", "Interview Descriptions": "Two on one interview process with manager and their immediate superior. Asked what you would do in specific situations, i.e. Your manager tells you to do something and you are busy with something else, what do you do? A: Drop what you are doing safely and attend to managers needs.", "Interview Questions": "What do you think you would bring to this job?\r\nWhat would you do questions based on specific hospital and HIPPA guidelines"}, {"date": "25 Aug 2016", "title": "Womens and Children's Pacu Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UNC Health (Chapel Hill, NC) in Jun 2012", "Interview Descriptions": "The interview process is much different now vs what I did when I was hired. They have the full expectation posted on their website so you can go in to the interview feeling confident and prepared.", "Interview Questions": "What are some of my contributes and what are some of my weaknesses."}, {"date": "31 Aug 2016", "title": "Delivery Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at UNC Health (Durham, NC) in Jun 2012", "Interview Descriptions": "I went through 3 interviews until finally being hired. My interviewer was very straight forward & pleasant. He said it would take at least 6 wks. before I heard back.", "Interview Questions": "He asked me briefly tell a little bit of my background. "}, {"date": "18 Apr 2014", "title": "Administrative Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at UNC Health (Chapel Hill, NC) in Apr 2012", "Interview Descriptions": "Long and takes forever to get an answer back could take months.", "Interview Questions": "No questions actually related to the job in which you would be performing but only what type of person you are as a whole."}, {"date": "14 Dec 2016", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UNC Health (Chapel Hill, NC) in Jan 2012", "Interview Descriptions": "I the time I interviewed there was a panel asking typical interview questions. I remember a tour and going near the place where I would be working. Nothing out of the ordinary.", "Interview Questions": "They asked me about my previous experience making IVs in the inpatient pharmacy. "}, {"date": "21 Mar 2014", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at UNC Health (Raleigh, NC) in Apr 2011", "Interview Descriptions": "Initial Contact was face to face, observed job performance. Management was cold and unfriendly and elitist.", "Interview Questions": "Can you cut the time and pressure?"}, {"date": "23 Mar 2014", "title": "Healthcare Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UNC Health (Chapel Hill, NC) in Jul 2010", "Interview Descriptions": "I first filled out an application online in the morning and was called by HR twice that same afternoon to set up a time to come for an initial interview and take the customer service test. About a week later, I met with an HR assistant who set me up on the computer for the test. Then I met with an HR recruiter who went over pay and open job areas in the nursing department. After that, I was called back in for departmental interviews which I was fortunate to get them all on the same day. These interviews were behaviorally based and wanted to know what I would do in certain situations. Then, it was hurry up and wait for an offer.", "Interview Questions": "How can you organize folders?"}, {"date": "14 May 2013", "title": "technischer Zeichner / CAD Konstrukteur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UNC Health (Chapel Hill, NC) in Nov 2009", "Interview Descriptions": "My interview consisted of a phone interview followed by a 3-4 hour session with approximately 7 different managers and peers.", "Interview Questions": "The interview was very informal.  There was nothing difficult about it at all.  The interview process has been revamped and now goes by a prepared script and you must first answer a questionnaire to even be brought in for the interview."}, {"date": "25 Jul 2011", "title": "Anesthesia Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UNC Health (Chapel Hill, NC) in Feb 2009", "Interview Descriptions": "Questioned one on one. Tour of the institution. An offer was made.", "Interview Questions": "None were too difficult"}], [{"date": "16 Dec 2009", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at UNC Health (Chapel Hill, NC) in Mar 2008", "Interview Descriptions": "based heavily on analytical skills", "Interview Questions": "Are you good with excel, describe experience."}]]