[[{"date": "22 May 2023", "title": "Customer Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at MetroHealth System (Cleveland, OH)", "Interview Descriptions": "Long process but worth every minute, this whole process lets you understand the job and what goes on. Questions are being asked left and right. Dress nicely and be as truthful as possible.", "Interview Questions": "Where do you see you're self in the next few years? Will you be working with us still or is this just a starting point in your life?"}, {"date": "9 Apr 2023", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MetroHealth System (Cleveland, OH)", "Interview Descriptions": "Fill out an application and wait for them to call you back, then go shadow during your interview, and if they like you they'll email you with a job offer.", "Interview Questions": "I dont remember what they asked. Your basic STAR style questions."}, {"date": "14 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MetroHealth System", "Interview Descriptions": "Fast and simple yet detailed questioning, asked some star questions where they give you a scenario and you tell them how it went and your experience. It was basic information", "Interview Questions": "Don’t remember, basic questions tell them about yourself"}, {"date": "2 Jun 2023", "title": "Intern Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at MetroHealth System (Cleveland, OH) in Jan 2023", "Interview Descriptions": "It was an easy interviewing process with basic questions and a quick process. Nothing too challenging. Not much preparation was required on my part. Prepare for the basic questions and you’ll be fine. On a scale of one to 10, it was a three.", "Interview Questions": "Why do you think you’re the best candidate."}, {"date": "13 Jun 2022", "title": "Student Nurse Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MetroHealth System", "Interview Descriptions": "Relatively easy process, first interview was on the phone with the recruiter and second interview was via video chat on the computer. Entire process took a week, maybe two but was pretty quick I was not waiting long for a reponse.", "Interview Questions": "Greatest strengths and weaknesses, how you adapt to changes"}, {"date": "5 Jun 2022", "title": "Patient Care Nursing Assistant (PCNA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MetroHealth System (Cleveland, OH) in Mar 2022", "Interview Descriptions": "First I had an on the phone interview is was very good and the person who interviewed was also great. I got a phone call back after a month. And offer for me to come back in for a 2nd interview", "Interview Questions": "Why do I think I’m a good fit?"}, {"date": "7 Jul 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at MetroHealth System (Cleveland, OH) in Mar 2022", "Interview Descriptions": "Very unprofessional. No follow-up from the recruiter. One of the interviewers was late and left early.  The questions were very dismissive and disrespectful. It was very obvious that I was being interviewed as a part of the process.", "Interview Questions": "How can you go from working in \"that\" place to working here? "}, {"date": "30 Dec 2021", "title": "RN CICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MetroHealth System", "Interview Descriptions": "The interview process was very fast. The recruiter made sure to keep in touch. The manager that I interviewed with was very pleasant and all staff were welcoming. Recruiter reached back out to me very quickly with job offer", "Interview Questions": "How do you handle pressure "}, {"date": "24 Nov 2021", "title": "IRB Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MetroHealth System", "Interview Descriptions": "IT was okay.  The interviewer was very nice on the phone but didn't have all the information for the call.  It was very brief.  The job sounded very interesting, but she said she would be getting back to me and then simply did not follow up.", "Interview Questions": "Not many, interviewer wasn't fully prepared for the call."}, {"date": "27 Jan 2022", "title": "MTA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MetroHealth System in Nov 2021", "Interview Descriptions": "Basically a recruiter will reach out to you and you’ll have an interview with them. After that they will give your resume to the hiring manager, after that you’ll have an interview with the hiring manager. Before you make your decision  some of the managers will allow you to shadow.", "Interview Questions": "Straight and to the point . Just regular interview questions asked for any job in the healthcare field. Such as tell me about yourself, why do you want to work here."}], [{"date": "27 Jan 2022", "title": "Contract Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MetroHealth System in Sept 2021", "Interview Descriptions": "Met with recruiter for phone screen and then two one-on-one video interviews.  I was up front with the recruiter and hiring manager of my salary expectations from day one (along with putting in writing on my application), but the offer was about $30k less than my low end. I wish they would have been up front about not being able to meet my salary requirement prior to the interviews.", "Interview Questions": "Have you worked in healthcare"}, {"date": "8 Aug 2021", "title": "Product Owner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MetroHealth System", "Interview Descriptions": "HR Rep was 10 minutes late. Standard personality and situational questions. Nothing technical about the job. Name a time when you had a conflict with your coworker/boss and had to persuade them that you are right.", "Interview Questions": "What have you learned from helping other people?"}, {"date": "11 Jul 2021", "title": "Emergency Department RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MetroHealth System", "Interview Descriptions": "First step is a phone interview, then you go in and meet with the hiring manager. If you're getting a offer the recruiting team calls you back and presents the offer.", "Interview Questions": "What interested you in joining MHS"}, {"date": "18 Apr 2021", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MetroHealth System (Cleveland, OH)", "Interview Descriptions": "The recruiter was very disorganized and unprofessional. Completely forgot about the phone interview and after being reminded they called me over 45 minutes later than the agreed-upon time. It was clear after speaking with them for a few minutes they had never bothered to read my resume. They asked pretty typical questions overall. Never heard back from them again after multiple follow-ups.", "Interview Questions": "Why do you want to work for MetroHealth? What is your five-year career plan? What is your preferred work schedule?"}, {"date": "12 Apr 2021", "title": "SLP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MetroHealth System", "Interview Descriptions": "Straightforward, had phone call with HR first then one interview with the department I applied to.  Everyone was pleasant and friendly and made the interview process less nerve wracking. Questions were typical interview questions.", "Interview Questions": "Describe a time you disagreed with another professional. "}, {"date": "9 Mar 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MetroHealth System (Cleveland, OH) in Mar 2021", "Interview Descriptions": "I was contacted through HR through phone and was screened and was setup up an interview with the manager. I had the interview with the manager where  I felt I did good at answering but the response comes after a week  after following up twice with automated email response saying they are considering other candidates.", "Interview Questions": "Tell me about your self\nTell me your day to day routine \nTools and experience"}, {"date": "2 Oct 2020", "title": "Customer Care (STNA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MetroHealth System in Oct 2020", "Interview Descriptions": "Applied, within the next week received an invitation for phone interview.\r\nInterview with recruiter following week, time span of 30 minutes. Recruiter sends interview answers to Nurse Manager to review.", "Interview Questions": "what made you apply for metro health?"}, {"date": "30 Sept 2020", "title": "Customer Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MetroHealth System", "Interview Descriptions": "Quick HR interview. They ask a couple general questions like name a stressful situation and how did you deal with it and they tell you a little about the role.", "Interview Questions": "Name a time when you had a negative experience with a coworker and how did you handle it?"}, {"date": "9 Aug 2020", "title": "Business Intelligence Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MetroHealth System", "Interview Descriptions": "Everyone was given an analyst question and need to finish it in about have an hour, and then described my idea to the interviewer. After that,  I made a presentation about my past working experience.", "Interview Questions": "Why do you want to join us?"}, {"date": "26 Aug 2020", "title": "Health Information Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MetroHealth System (Cleveland, OH) in Jul 2020", "Interview Descriptions": "It was long but well worth the wait. About a three month process from applying to orientation. The interviews were just a lot of questions so be prepared for anything.", "Interview Questions": "What are two values you would add to metro and why?\nFive year plan?\nSchool plans? \nTell me ten words that describe you and describe why for each one?"}], [{"date": "13 Sept 2020", "title": "Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MetroHealth System in Mar 2020", "Interview Descriptions": "First, there was a phone interview with HR/ Talent Acquisition.  Secondly, there was an interview with hiring team.  The second interview too approximately 3 weeks to schedule after the phone interview.", "Interview Questions": "How do you plan to oversee a team that is experiencing discord and still working from  home during COVID?"}, {"date": "14 Jan 2020", "title": "Accounting Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at MetroHealth System", "Interview Descriptions": "The process is lengthy.  Expect it to take weeks from applying  to interview to job offer.  Also, there is once a month orientation that may effect your start date.", "Interview Questions": "Expect standard interview questions about yourself and previous employers."}, {"date": "14 Nov 2019", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MetroHealth System (Cleveland, OH)", "Interview Descriptions": "Applied on MetroHealth website and was contacted by a recruiter to set up an interview with the department heads.  Interviewed with dept heads as well as physicians in department.  Received call from recruiter and offered to choose dept in which I wanted to work in and was told he would call back with pay offer as well as orientation dates. Received call back about 4 days later by same recruiter saying he had \"bad news, the dept decided to go in a different direction without you\".  I explained I was confused and he offered no explanation of why they changed their minds so I asked about the other dept and I was told \"oh I think he already hired someone, but good luck on your future endeavors\".  In shock I just hung up.  Extremely unprofessional since I had turned jobs down and stopped interviewing with the intention of starting at MetroHealth.  Epic fail Metro", "Interview Questions": "What would your previous employer say about you?"}, {"date": "24 Mar 2021", "title": "Financial Clearance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MetroHealth System in Feb 2019", "Interview Descriptions": "Interview process was quick and easy , one phone interview and one in person interview . Great management . Positive work environment . Wonderful people ! Awesome benefits and health insurance . No out of pocket", "Interview Questions": "Easy easy easy easy easy "}, {"date": "23 Jan 2019", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MetroHealth System", "Interview Descriptions": "The interview was very detailed, quick and easy with the process of seeking the right person for the job with an eye to eye connection and an understanding of what the job intels", "Interview Questions": "What made you want to join the company "}, {"date": "25 Jan 2019", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at MetroHealth System (Cleveland, OH) in Jun 2018", "Interview Descriptions": "Had one interview, administrator was not prepared for the interview and was very rude and dismissive in asking questions and listening to responses.  Other members of the panel were conversational and reassuring.", "Interview Questions": "Discuss your experiences working with this population."}, {"date": "23 Nov 2018", "title": "Police Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MetroHealth System (Cleveland, OH) in Apr 2018", "Interview Descriptions": "Was excellent and quickly done.  This is appreciated since applying for a position is stressful.  They made the process tolerable.   The gap between the interview and hiring was reasonable.  The only delay was waiting for an agility test date, which was out of their control.", "Interview Questions": "I have a lot of experience.  \" If we offer you the job, are you going to stay?\"  The lieutenant and sergeant explained fully my duties, responsibilities, and, expectations.  They were highly respectful."}, {"date": "20 Aug 2018", "title": "Patient Observer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at MetroHealth System in Jan 2018", "Interview Descriptions": "I had a phone interview, went well. The person I interview with was very nice and easy to talk to. I now wait for the charge nurse to call me for a second interview.", "Interview Questions": "When was a time where you used integrity?"}, {"date": "25 Jun 2017", "title": "APRN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at MetroHealth System (Cleveland, OH)", "Interview Descriptions": "Cordial pleasant face to face on the first week at the time of day expected. Happy with the great work environment and the people met that day great experience", "Interview Questions": "Crisis situations reaction"}, {"date": "18 Feb 2017", "title": "Business Analytics Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at MetroHealth System (Cleveland, OH) in Jan 2017", "Interview Descriptions": "It was a grilling.  The purpose of the interview was entirely for the purpose of allowing the company to see if the candidate was good enough for them without contemplating whether the candidate might have had any reservations about working for the company.  I did poorly enough during the interview that I was not expecting an offer.  But I felt steamrolled enough that even if an offer had been forthcoming, I would have declined.", "Interview Questions": "N/A"}], [{"date": "29 Jan 2017", "title": "Internist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at MetroHealth System (Cleveland, OH) in Jan 2017", "Interview Descriptions": "Dinner meeting, convenient time. Later site tour and discussion with other providers.  Reviewed package offered.  Had opportunity to assess different locations.  All questions answered.  Pleasant all around.  Growth of Metro is allowing for more practice opportunities around Cleveland. Seems to have a structure to grow primary care.  Expected more administrative responsibilities, but these were left to others in the administration pool.", "Interview Questions": "Questions about expectations, willingness to have hospital system administration guide practice. "}, {"date": "5 Jan 2017", "title": "Specialist Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MetroHealth System (Cleveland, OH) in Oct 2016", "Interview Descriptions": "Several interviews, on multiple days, in multiple locations. The interviews often appeared informal and not standardized, leaving one to wonder how they were comparing candidates. Promises of next steps that didn't happen when they were supposed to. No follow up between interviews unless you prompt them to give you a status update.", "Interview Questions": "Do you get frustrated when you don't get your way, or things take a long time to get resolved?"}, {"date": "3 Sept 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at MetroHealth System (Cleveland, OH) in Jun 2016", "Interview Descriptions": "Met with HR, then my future supervisors, and then HR again. It was a straightforward process. Pay equity exists here at MetroHealth, which is both a blessing and a curse.", "Interview Questions": "I was asked to talk about a time where I worked with a difficult coworker and how I handled the tough relationship"}, {"date": "30 Sept 2016", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MetroHealth System (Cleveland, OH) in Jun 2015", "Interview Descriptions": "I had an interview with HR over the phone, and then they set me up with 2 nurse managers to interview with from different floors. The interview with HR was easy. One nurse manager was very easy to interview with also, and mainly just spoke about the position. The other one asked more difficult questions. I was offered a position on both floors. Getting HR to review my application was a very long process. They are not very good at responding/on top of their work. That was the hardest part of the whole process.", "Interview Questions": "Which STAR-IQ qualities do you identify with most?"}, {"date": "22 Jun 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at MetroHealth System (Cleveland, OH) in May 2015", "Interview Descriptions": "Interview with HR then with unit manager.  They always have you shadow. Often, the staff has just as much say as the unit manager. There is a background check and a drug screen.", "Interview Questions": "Greatest strength/weakness"}, {"date": "30 Sept 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 11 months. I interviewed at MetroHealth System (Cleveland, OH) in Jan 2015", "Interview Descriptions": "- Organization was quick to set up an in-person interview after the phone interview. \r\n- Once the in-person interview was over, the organization did not get back to me with feedback\r\n- No response was given on my professional follow-ups\r\n- They reached out randomly a year and a half later and asked if I was still interested\r\n- After the initial conversation, again, there was radio silence for 6 months\r\n- The actual hiring took 8 months with may be 2 email conversations between the interview and hiring\r\n- None of my questions and concerns were answered \r\n- Lack of transparency about the job and the organization", "Interview Questions": "Tell me about your past work experience"}, {"date": "22 Aug 2014", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at MetroHealth System in Jul 2014", "Interview Descriptions": "the process took about 4 months all together and was a litlle backwards. I met with the unit manager first, then about a month and a half later i met with human resources... from there it took about 3 weeks to start working. They are union so they had a description of all benefits, and the pay was already decided based on a pay grade set by the union. The staff all seemed so friendly and made me feel comfortable, and less nervous.", "Interview Questions": "The unit manager asked questions pertaining to the job description, such as how to obtain vitals and what were the norms."}, {"date": "29 Dec 2016", "title": "Behavioral Observer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at MetroHealth System in May 2014", "Interview Descriptions": "Submitted application and heard for an interview within 1 week. Interview was a two step interview, first step was with HR and the second step was with the nursing manager. After the interview got a call back after a few days.", "Interview Questions": "what was my schooling?"}, {"date": "10 Apr 2015", "title": "Medical Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MetroHealth System (Cleveland, OH) in Jan 2014", "Interview Descriptions": "Normal process. Received a call went in on the day selected and started the interview. I was interviewed by three different people and shown around the facility and introduced to various people in different departments.", "Interview Questions": "What makes you qualified for this job."}, {"date": "17 Feb 2014", "title": "Director, Strategic Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at MetroHealth System (Cleveland, OH) in Jul 2013", "Interview Descriptions": "Metro is known for its critical care and apparently crisis mode is how they function.  The director and VP were looking for work and resigned within two months of one another.  I was invited to interview by the VP.  At the second interview, did not see her; instead, interviewed with another VP who told me the interview process has been suspended.  WHY AM I SITTING HERE?  HR did not know this decision was made and shortly after meeting with the VP, HR was making me an offer--YIKES.  They are now posting the position again.  God bless whoever decides to work there.  Be prepared for crisis.", "Interview Questions": "There were no difficult questions.  "}], [{"date": "19 Mar 2017", "title": "STNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MetroHealth System (Cleveland, OH) in Mar 2013", "Interview Descriptions": "You meet with all the department heads for the interview for 30 minutes. The interviews will ask  about  previous jobs and why did you leave. Why should we hire you? What qualifies you for this job? What would your last supervisor say about your work performance?", "Interview Questions": "Why do you feel you qualify for this job?"}, {"date": "11 Aug 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at MetroHealth System (Cleveland, OH) in Jul 2011", "Interview Descriptions": "Very thorough, but slow to process. Could use more emotional intelligence and less checklist information to look for the right fit.  There should be a tour of the location and give the person a better sense of the responsibilities.", "Interview Questions": "where do you see yourself in 5 years?  Do you feel that you would work well in a system that is slow to change? Tell me about a time you overcame a challenge?"}, {"date": "19 Apr 2015", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at MetroHealth System (Grand Rapids, MI) in Mar 2011", "Interview Descriptions": "Met with lab manager for about 30 minutes and reviewed my training, and experience.  The interview was informal and pleasant.  We had a cup of coffee, and the discussion was continued in the cafeteria.", "Interview Questions": "Availability, and experience."}, {"date": "5 Apr 2014", "title": "RPSGT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 7 weeks. I interviewed at MetroHealth System (Cleveland, OH) in Feb 2010", "Interview Descriptions": "I met the department head during my clinicals and he wanted to hire me right away. He had me apply online and even called HR ahead of time to get me scheduled right away. After calling twice over a 5 day period they scheduled my interview. I went in and met with HR and they approved everything and sent it to my department. My second interview was immediate and completed within another week. After that I had to wait for my paperwork and background check to be processed - this took over a month. If the department head wasn't in such a hurry to get me in, it probably would have taken over 2 months.", "Interview Questions": "They showed different print outs of sleep stages and asked what they were"}]]