[[{"date": "14 Jan 2023", "title": "Motion Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Florida Atlantic University (Miami, FL) in Nov 2022", "Interview Descriptions": "Terrible Interview. They had me complete an animation art test for round 2, with zero guidelines or time limit and basically after I submitted it after 6 days of work. I never got response, even when I followed up with an email. Completely ghosted. The job posting was closed after my interview , only 9 applicants and then it was reopened again, with multiple duplicate lsitings on Linkedin. HR and Hiring is incompetent, a waste of time. Everyone knows aniamtion takes time and it took me days , weeks to do the animated introduction for \"Why You Want to Work At FAU? and not even a reply, a yes or no OR ANY FEEDBACK. Employers have to stop wasting our time and pay us when asking for extraneous interview materials. I don't know what they're looking for ,if they want a Disney Pixar level animator for simple online web course banners but it ain't happening. FAU will never be great if these guys are overseeing the art department.", "Interview Questions": "Submit An Animated Introduction Video, After a 30 Minute Group Call"}, {"date": "20 Apr 2022", "title": "Instructior Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Florida Atlantic University", "Interview Descriptions": "Takes a long time. People are very nice.  I had to interview with many individuals. It took a week or two between the forts interview to the next. Background check took a few weeks", "Interview Questions": "Why do you want to work at fau"}, {"date": "25 Jan 2022", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Florida Atlantic University (Boca Raton, FL)", "Interview Descriptions": "The interview was led by two people who were really friendly and made me feel at ease. They asked straight forward questions that were pertinent to the job in question.", "Interview Questions": "How do you deal with tasks that can be overwhelming? How do you act in a time of crisis? Considering you'll deal with the public, can you keep calm even if someone is being very  rude to you?"}, {"date": "12 Jan 2021", "title": "Student Fabrication Shop Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Florida Atlantic University (Fort Lauderdale, FL)", "Interview Descriptions": "Routine understanding is my experience in fabrication and technology. Based on student performance and interest in helping students and facility. They asked about why I think I would be a good fit.", "Interview Questions": "Do you know the design softwares"}, {"date": "27 Jun 2020", "title": "Certified Athletic Trainer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Florida Atlantic University", "Interview Descriptions": "Not transparent with information. Let me believe the position was something different than it ended up being. Had to withdraw due to this. Was only interviewed over the phone.", "Interview Questions": "When can you relocate?"}, {"date": "18 Jul 2020", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Florida Atlantic University (Boca Raton, FL) in Jan 2020", "Interview Descriptions": "The interview included a teleconference meeting followed by an invitation to visit the university. The interviewers asked standard questions in the teleconference meeting and then required a presentation during the campus visit. One week after the visit, I was verbally offered the position. Then they requested a background check that I was informed that I passed the check. However, the department chair retracted the position abruptly, citing a new requirement that was never mentioned in the job description or the interview or campus visit. This was an absolute waste of time of all parties. The experience with this employer was very awkward.", "Interview Questions": "The questions are about experience relevant to the position."}, {"date": "8 Dec 2019", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Florida Atlantic University (Kenosha, WI) in Nov 2019", "Interview Descriptions": "I was informed for the day of the interview by email.  I asked for the names and positions of the interviewers. Three interviewrs by phone. It took around half an hour. It was friendly and relaxing.", "Interview Questions": "Why you chose this University?"}, {"date": "6 Apr 2021", "title": "Senior Benefits Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Florida Atlantic University (Boca Raton, FL) in Sept 2019", "Interview Descriptions": "1st phone interview was the preliminary interview questions and 2nd interview was on-site with managers and Coordinator. Interview on-site was no more than an hour and friendly culture. Recieved tour around office and meet potential coworkers and recieved details on benefits.", "Interview Questions": "Describe yourself from the spelling of your name "}, {"date": "20 Jul 2020", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Florida Atlantic University (Boca Raton, FL) in Jul 2019", "Interview Descriptions": "This was a panel interview. They ask you to present a concept or topic in a 15-minute presentation. The topic may be anything in the subject that you are applying to. After teaching them your concept, you will be asked questions about the process.", "Interview Questions": "Why do you want to become a CLASS tutor?"}, {"date": "9 Dec 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Florida Atlantic University (Jupiter, FL) in Mar 2019", "Interview Descriptions": "3 rounds of interviews, panel interviews, they rotate and you may need to do a poster presentation if you are applying to the PhD program at Max Planck Florida Institute for Neuroscience", "Interview Questions": "1. Tell me about your research experience and why you are interested in this program"}], [{"date": "16 Jan 2019", "title": "FAU Online Marketing Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Florida Atlantic University (Boca Raton, FL) in Dec 2018", "Interview Descriptions": "A brief phone interview, followed by a Skype interview with three people, followed by an in-person interview with the Director. I went through and passed every step, excepted the offer, however, they then asked me to sign a contract stating that I would be working with no benefits as a student employee. I asked a question about that because they never said it was an OPS job, nor was it written on the application. They then responded nearly a week later saying the position had been put on hold. Overall, very unprofessional experience and quite sketchy. Never applying there again and neither should you. Don't waste your time.", "Interview Questions": "Describe who you are."}, {"date": "29 Nov 2018", "title": "Senior Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Florida Atlantic University", "Interview Descriptions": "The interview was very professional and conducted by panel. It was in-depth, but not too long and  covered a wide variety of topics concerning my area. I was asked to prepare a ten minute presentation in advance of the interview.", "Interview Questions": "Describe specific serial models of the client's products."}, {"date": "5 Apr 2018", "title": "Full Time Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Florida Atlantic University", "Interview Descriptions": "Very organized.  Started with telephone interview and then on campus interview.  Involved a search committee  of five who asked screening questions.  After about two weeks, there was an invitation for a campus interview which involved doing a presentation.", "Interview Questions": "What would I contribute to the institution?"}, {"date": "6 Oct 2021", "title": "Assistant Professor of Sociology Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Florida Atlantic University in Apr 2018", "Interview Descriptions": "The Skype interview was directly with the department chair.  She read from a list of questions and recorded the interview.  She promised to follow up but completely ghosted me after the interview.", "Interview Questions": "Tell us about a sociologist whose work has influenced yours."}, {"date": "1 Feb 2018", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Florida Atlantic University (Jacksonville, NC) in Jan 2018", "Interview Descriptions": "We did a Skype interview.  The sound quality was not always great.  A committee of 5 and myself.   They asked questions about my background as it related to the job.", "Interview Questions": "What attracted me to the position?  What classes could I teach?   What scholarly research did I plan to continue.  Would I work well with my fellow teachers?"}, {"date": "8 Jun 2018", "title": "Athletics Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Florida Atlantic University (Boca Raton, FL) in Aug 2017", "Interview Descriptions": "Hired without having a real interview because their turnover rate is so high because no one wants to work there so they will just hire anyone. So I just set-up a time to meet with my supervisor and she started going over the job description.", "Interview Questions": "They just went over the job description. There was no interview."}, {"date": "30 May 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Florida Atlantic University", "Interview Descriptions": "I introduced myself to the professor. The professor just asked me a few questions about my previous research, study background and what course taken. We talked about the research project how I should work on and described some basic background of the department. Everything was straight and forward. Then the professor gave me the offer.", "Interview Questions": "What program language do you use to do the simulation?"}, {"date": "11 Aug 2017", "title": "Academic Paraprofessional Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Florida Atlantic University (Boca Raton, FL) in Feb 2017", "Interview Descriptions": "The interview process was very professional and they were fairly efficient. The conversation was brief and they were very straight forward about the requirements of the position. I interviewed with three different people over the course of two interviews. There was ample communication between the interviews and the process was great overall. While I was not offered a position (based on the grounds that the job would not challenge me appropriately), I was very impressed with the professionalism and honesty of the team.", "Interview Questions": "Are you able to multitask?"}, {"date": "7 Jan 2017", "title": "Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Florida Atlantic University (Boca Raton, FL)", "Interview Descriptions": "1.Applied online in early December \r\n2.Received a phone call in mid-December to set up an interview in January\r\n3.Participated in a panel interview with 4 assistant directors and associates.\r\n4.Received a call back one week later to set up a second interview.", "Interview Questions": "where do you see yourself in 5 years?\r\nHow would you help to promote or recruit students of different races and backgrounds?\r\nAre you comfortable using Excel?\r\n"}, {"date": "9 Jun 2016", "title": "Assistant Coordinator, IT Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Florida Atlantic University", "Interview Descriptions": "A little different since I was an internal candidate- first interview with future supervisor and another senior associate, then after that a 2nd interview with director, supervisor, and senior associate.", "Interview Questions": "Strictly behavioral, very casual."}], [{"date": "10 May 2016", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Florida Atlantic University (Boca Raton, FL)", "Interview Descriptions": "Process starts with a phone screen, with is conducted by the actual hiring manager. If you pass the phone screen, depending on the requirements for the job, they may require you to go to the HR Department to take an an assessment test. If you pass the phone screen, and the assessment test (if applicable), they will call you for an interview with the hiring manager/s. At the interview they will tell you when you should expect to hear from them. If the hiring managers want to proceed with an offer, they will usually do so within 15 to 30 days of the initial application.", "Interview Questions": "Who is more important between an internal and an external candidate?"}, {"date": "9 Sept 2016", "title": "Instructor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5+ months. I interviewed at Florida Atlantic University (Boca Raton, FL) in Apr 2016", "Interview Descriptions": "Both interviews were conducted via Skype. The first round was pleasant with a committee of Professors and Instructors. They asked insightful questions, and the chair of the interview committee offered answers to all of my questions inside and out of the interview.\r\n\r\nThe second interview was with the chair of the department. It was also via Skype. His understanding of the position was completely different than the previous committee. Where the previous committee seemed interested in my film background, he mentioned that they had too many film instructors and wanted somebody with multiple disciplines, \"Graphic Design\", \"Video Game Design\", and \"Animation\". This was not listed in the job notice, if it was, I wouldn't have applied. I think it is also a lot to ask of an Instructor to have specializations in multiple disciplines for a $40,000/year position.\r\n\r\nI didn't get the job, and to this day nobody has officially notified me. I found this out when I happened to meet an instructor at a networking event. He also said that the Chair of the Department misinformed me in my interview and that there was actually a need for film instructors there. It's a red flag if the chair doesn't even know what the department needs and what faculty they have... I emailed to follow up at reasonable intervals, all with no response. I think the least they could do is notify me that they filled the position.\r\n\r\nOverall, it was a very unpleasant experience, and if you intend to apply there, be prepared to be mistreated during the interview process.", "Interview Questions": "Do you have any experience with \"Graphic Design\", \"Video Game Design\", or \"Animation\"?"}, {"date": "22 May 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Florida Atlantic University (Dania, FL) in Mar 2016", "Interview Descriptions": "sat down with hiring researcher to discuss my interest in working at his lab. Discussed about the resent and future projects and potential graduate school. Toured the research facility and explanation of all the duties as a research assistant.", "Interview Questions": "Why do you want to work (research) at my lab?"}, {"date": "22 Oct 2015", "title": "Data Entry Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Florida Atlantic University (Jupiter, FL) in Jul 2015", "Interview Descriptions": "Meet with Director, about hours and the changing schedule needed depending on enrollment times and seasons.  I would be  trained in data entry.  Very easy, but becomes boring.  You are entering names, addresses and credit card info.", "Interview Questions": "Could I work alone in data entry or  be willing to 'not be needed\" some slow days?"}, {"date": "4 Aug 2015", "title": "Student Affairs Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Florida Atlantic University (Boca Raton, FL) in Apr 2015", "Interview Descriptions": "The interview consisted of a telephone interview followed by a full- day panel and individual interviews with multiple stakeholders and departments. After the interview, it took more than a month to hear back from the search committee chair. A very long and frustrating process.", "Interview Questions": "Questions were both from a script and improvised by interview panel. Improvised questions could be unexpected and more difficult than the scripted ones."}, {"date": "11 Jul 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Florida Atlantic University (Boca Raton, FL) in Jan 2015", "Interview Descriptions": "Apply online; several short response questions about why you're applying for the job. If they like you're application you'll have to do a group interview. During the group interview you'll have to do a presentation on a topic and make an introduction.", "Interview Questions": "Why do you want to be a tutor?"}, {"date": "4 Sept 2014", "title": "Greeter Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Florida Atlantic University", "Interview Descriptions": "The hiring process is pretty straight forward. I simply walked in to inquire about open positions and was brought into the office of one of the assistant directors. They gave me a run down of the position and provided me an application.\r\n\r\nThe interview was predominantly comprised of basic interview questions regarding my resume followed by asking me to respond to \"pretend\" situations.", "Interview Questions": "N/A"}, {"date": "1 Dec 2016", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Florida Atlantic University (Boca Raton, FL) in Jul 2014", "Interview Descriptions": "The process was a bit lengthy, consisting of a 30 minute phone interview by a committee, then a face-to-face interview to another committee, where I was asked to make a presentation on a designated topic. I was also asked to write an essay on a topic provided by the chair of the interview committee. The third interview consisted of a larger committee than the first two (about 8-10 people), followed by a final interview with the director. Very exhausting and a bit daunting.", "Interview Questions": "Describe one situation where a decision I made impacted a student in either a positive or negative way."}, {"date": "13 Mar 2017", "title": "Orientation Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Florida Atlantic University (Boca Raton, FL) in Jul 2014", "Interview Descriptions": "Questions about previous experiences, life, interests were asked, giving a chance to talk about yourself as well as how/what you can contribute to the FAU community if employed.\r\nAlso, we were interviewed in groups in order to see how we all interact as a team.", "Interview Questions": "Why do you want to be an OL?"}, {"date": "21 Nov 2017", "title": "Computer Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Florida Atlantic University (Boca Raton, FL) in Jun 2014", "Interview Descriptions": "Good conversation about values and goals, not necessarily questions asked, One on one interview with supervisor of the position, may need to talk with the professor of the class you are overseeing also", "Interview Questions": "What would you do in certain situations, disgruntled student, bad behavior by another employee, etc"}], [{"date": "12 Aug 2015", "title": "Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Florida Atlantic University (Boca Raton, FL) in Jun 2014", "Interview Descriptions": "Tough, cold, unfriendly. It was very tough to get comfortable and answer questions thouroughly. By far the most intimidating interview ive had to date. I would do it again but at the same time its very tough.", "Interview Questions": "How did you manage with unfriendly coworkers?"}, {"date": "16 Oct 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Florida Atlantic University (Boca Raton, FL) in May 2014", "Interview Descriptions": "I was a bit nervous at first seeing as I was seeing other candidates going in interviews before me. I saw one girl that has a tank top and short shorts outside, turns out she was interviewing me along with 4 other people. It was way to many people interviewing and some interviews did not take it seriously.", "Interview Questions": "Behavioral questions "}, {"date": "3 Mar 2014", "title": "Student Government Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Florida Atlantic University", "Interview Descriptions": "so awkward that they are open to the public. those interviewing have never done so before and have no idea how to do so. everyone being interviewed is as experienced as those interviewing.", "Interview Questions": "N/A"}, {"date": "16 Oct 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Florida Atlantic University (Boca Raton, FL) in Jan 2014", "Interview Descriptions": "There was no interview process, just forms to fill out.\r\nThere was no interview process, just forms to fill out.\r\nThere was no interview process, just forms to fill out.\r\nThere was no interview process, just forms to fill out.", "Interview Questions": "N/A"}, {"date": "13 Dec 2013", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Florida Atlantic University", "Interview Descriptions": "The director of the school will really gauge your dedication to the faculty and listen to referrals.", "Interview Questions": "N/A"}, {"date": "21 Jul 2013", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Florida Atlantic University (Boca Raton, FL)", "Interview Descriptions": "Phone interview then an in person", "Interview Questions": "nothing out of the ordinary and nothing specific about the institution that you need to know in advance. However, keep in mind that this will vary depending on what College or department that you are attempting to work in."}, {"date": "26 Aug 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Florida Atlantic University in Jul 2013", "Interview Descriptions": "Sit down with advisers and current employees, talk about yourself, experience, answer questions. Just be yourself, be passionate about FAU. The panel of people interviewing will ask all sorts of questions depending on the position you apply for.", "Interview Questions": "What can you bring to this position?"}, {"date": "6 Sept 2013", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at Florida Atlantic University (Boca Raton, FL) in Jul 2013", "Interview Descriptions": "Filed out a paper application in April 2013 for the 2013-2014 academic year. During summer I received an e-mail requesting to schedule a phone interview. During the phone interview I was mostly asked questions about myself and as usual, a couple of what I would do during a certain scenario questions. At the end of the interview I was asked a few questions about scheduling and working preferences. The interview was rather quick and easy.\r\n\r\nTowards the end of the summer I received another e-mail saying I had been offered the job. I accepted the position and had to fill out some paperwork as well as attending a training session, but they give you a clear list with all the papers to be filled out and turned in. Once all that is done you are good to work.", "Interview Questions": "If a resident came to you saying they could not find their RA and wanted a room transfer, how would you handle the situation?"}, {"date": "20 Jun 2013", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Florida Atlantic University (Boca Raton, FL)", "Interview Descriptions": "Friendly and Detailed. Made expectations clear. Hired later that day!", "Interview Questions": "N/A"}, {"date": "26 Apr 2015", "title": "Audio Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Florida Atlantic University (Boca Raton, FL) in May 2013", "Interview Descriptions": "i was interviewed by 2 manager, they asked me about my GPA and what subject am i interested in, i told them electrical engineering, and computer science. the manager was satisfy with all the answers", "Interview Questions": "basic questions"}], [{"date": "3 Jun 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Florida Atlantic University (Boca Raton, FL) in Mar 2013", "Interview Descriptions": "There is a 3 hour long group interview in which you complete various tasks so that they can see how you work together. During this time a mix of RA's and RC/HC's are taking notes and observing. The individual interview consists of a few RA's and 1 RC or HC. They ask a series of questions, but try to make you feel comfortable, although it's difficult because it feels like an interrogation.", "Interview Questions": "Why do you think you would make a good resident assistant."}, {"date": "25 Mar 2017", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Florida Atlantic University (Boca Raton, FL) in Feb 2013", "Interview Descriptions": "Really good. Easy for people who have good people skills which is a must in this job. Theres a group interview where they study you amongst total strangers and then an individual interview infront a panel of establushed RAs and higher individuals", "Interview Questions": "How do you handle situations where youre in complwte charge?"}, {"date": "4 Nov 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Florida Atlantic University (Boca Raton, FL) in Feb 2013", "Interview Descriptions": "There was an information session about the position then followed by submitting an application.  At later date there was 3 interviews, 2 consisting of group interviews and 1 individual interview by a small group of current employees.  The process was smooth and consisted of typical interview questions.", "Interview Questions": "Why do you want to be a Resident Assistant "}, {"date": "8 Jul 2016", "title": "Director of New Media Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Florida Atlantic University (Boca Raton, FL) in Sept 2012", "Interview Descriptions": "They did a skype interview and asked me questions about my experience. I was then brought in for a in person interview. I had a background check completed and a drug test. following my final interview and offer.", "Interview Questions": "What are you doing in your current role?"}, {"date": "30 Mar 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Florida Atlantic University (Boca Raton, FL) in Jun 2012", "Interview Descriptions": "There is no interview. One applies to the college submitting the appropriate paperwork, exam scores, and transcripts, along with an essay. The minimum requirements are specified in the department website.", "Interview Questions": "Why do you want to be part of this program?"}, {"date": "17 Aug 2016", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Florida Atlantic University (Boca Raton, FL) in Apr 2012", "Interview Descriptions": "disorganized, as usual, people could not be found, no lunch provided, driver asked inappropriate questions and took me to a place where he had to do shopping, alienated environment. Fifty words is too much to ask to describe this interview. It is not worth fifty words.  I will stop here if it is not allowed to continue", "Interview Questions": "Not organized, could be anything.  Do ask about age and marriage, and children...."}, {"date": "9 Feb 2016", "title": "Budget Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Florida Atlantic University (Boca Raton, FL) in Mar 2012", "Interview Descriptions": "panel interview. Questions were pretty straight forward.  Very little behavioral interviewing. People in the interview panel held 3 different positions. The I interview was about an hour long.  They gave me a tour of the facility and the office I would have and introduced me to the professors in the department I would be working in.", "Interview Questions": "What experience do you have in this area of business?"}, {"date": "20 Jun 2015", "title": "Post Doctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Florida Atlantic University (Boca Raton, FL) in Jan 2012", "Interview Descriptions": "First there was a phone interview with several members of the lab, including current and former employees. then was invited for an on-site interview which took about half a day total. Had nice lunch with the head of the department. Also went to a presentation that happened to be on the same day. Everyone was very friendly and courteous.", "Interview Questions": "What projects do you want to work on here?"}, {"date": "8 Jun 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Florida Atlantic University (Boca Raton, FL) in Dec 2011", "Interview Descriptions": "I submitted my resume as a Graduate Student for the school database.  A few weeks later, I was contacted by a Professor who needed a team of Teaching Assistants for the upcoming semester. Due to my previous experience as an administrator and supervisor, the interview process was easy and went well. Besides the regular interview questions,  I was asked to do some problem-solving in the classroom situations.", "Interview Questions": "Problem solving in the classroom."}, {"date": "18 Nov 2012", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Florida Atlantic University (Boca Raton, FL) in Oct 2008", "Interview Descriptions": "It was a group interview.  I was already an employee in the same office.  My co-workers that were part of the interview group told me that everyone but one person - one of the managers - supported my promotion to Program Assistant.", "Interview Questions": "\"What do you like the least about your current position?\"   Since I was working in that office at the time I had to be very careful with my answer."}], [{"date": "14 Nov 2012", "title": "Senior Electronic Technician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Florida Atlantic University (Fort Pierce, FL) in Jul 2008", "Interview Descriptions": "No interview with FAU - they had subsumed my previous employer.", "Interview Questions": "Please try to be as detailed as possible regarding the technical question, business case, etc."}]]