[[{"date": "1 Apr 2023", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Mobile Infirmary Medical Center (Mobile, AL) in Feb 2023", "Interview Descriptions": "The interview process is about 30 minutes long then you are orientated to the unit. If you like it they go ahead and set you up for an employee health screening done on the campus. Followed by a computer based training called health stream which take about two hours to complete. Once complete you’ll start your orientation at the Baldwin county campus then orientated to your into the following days.", "Interview Questions": "Are you in the military?"}, {"date": "28 Aug 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mobile Infirmary Medical Center", "Interview Descriptions": "The interview process was done over Zoom and went very smoothly. The questions were to the point  and the job requirements and what was expected of me were laid out.", "Interview Questions": "What do you know about the position?"}, {"date": "3 Jun 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mobile Infirmary Medical Center", "Interview Descriptions": "Formal but still laid back. Informative and friendly! Gave all details of job description with a walk through of the unit. Pay was not discussed until HR called to offer the position.", "Interview Questions": "Where do you see yourself in five years? "}, {"date": "5 Jul 2021", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mobile Infirmary Medical Center (Mobile, AL) in Jul 2021", "Interview Descriptions": "Very easy , described what working in the facility is like and was honest about shortage of nurses which has been common due to COVID but overall quick and professional.", "Interview Questions": "Background, work ethics , hours , personality "}, {"date": "25 Jun 2021", "title": "PC Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mobile Infirmary Medical Center", "Interview Descriptions": "It was a very nice and smoothe proccess. Everybody I met was very professional and informative. They were able to answer any questions that I had. I've had several interviews in my lifetime and this company is in the top 3 best I'd say.", "Interview Questions": "They asked about how I handled challenging situations at my previous employment."}, {"date": "25 May 2021", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mobile Infirmary Medical Center (Mobile, AL) in Feb 2021", "Interview Descriptions": "Short simple easy . The process was done over Zoom to abide by COVID regulations and safety precautions. Both my Nurse Manager and House Supervisor were on the call. I was only asked a handful of questions and received my offer same day", "Interview Questions": "Asked mainly for availability and what shift I preferred"}, {"date": "5 Oct 2020", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mobile Infirmary Medical Center", "Interview Descriptions": "Pretty straight forward. Was asked please tell us about your self, what makes you a good fit for this position. Make sure you ask them questions. The next step I w", "Interview Questions": "How well do you deal with different personalities and w"}, {"date": "16 Mar 2020", "title": "Registered Nurse, Critical Care Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mobile Infirmary Medical Center (Mobile, AL) in Mar 2020", "Interview Descriptions": "I applied online, within 2 days the nurse recruiter got back to be asking when I would like to schedule my interview. The earliest spot my manager had available was for 4 days out. The interview its self went well, I interviewed with the manager and nurse leader. They were very warm, welcoming, and friendly, as well as the staff. They showed me around the unit, showed me a few rooms, and introduced me to the staff. I was there about 1.5 hours. The nurse recruiter called me a couple days later to tell me they were putting in the offer.", "Interview Questions": "Name a time you went above and beyond for a patient."}, {"date": "8 Feb 2020", "title": "Electronics Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mobile Infirmary Medical Center (Mobile, AL) in Jan 2020", "Interview Descriptions": "Interview was a series of questions followed by walking around the department getting to meet the other technicians. The went back for a few more questions and then left. Very friendly group.", "Interview Questions": "Why should we hire you?"}, {"date": "13 Nov 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mobile Infirmary Medical Center", "Interview Descriptions": "First I spoke to a couple people on the phone, and then I was brought in for a face to face interview, which was done by three different panels, as well as a couple one on one meetings.", "Interview Questions": "Tell me how you handle conflict between two staff members."}], [{"date": "23 Aug 2016", "title": "Unit Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Mobile Infirmary Medical Center (Mobile, AL)", "Interview Descriptions": "I interviewed with the manager. She gave me a tour of the unit. She then had selected staff members come in and give a brief detail of their  role was on the.", "Interview Questions": "Why did I want to work for the company"}, {"date": "13 Sept 2019", "title": "R N Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Mobile Infirmary Medical Center (Mobile, AL) in Jan 2016", "Interview Descriptions": "Asked about previous employer, current skills, certifications and job outlook. The interview process was in front of a panel of RN's and managers. After the interview was finished, you would receive a call from HR with an offer for pay with which units chose you.", "Interview Questions": "If you were a kitchen utensil , what item would you be and why?"}, {"date": "2 Sept 2016", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mobile Infirmary Medical Center (Mobile, AL) in Dec 2015", "Interview Descriptions": "First interview was with department manager and team leaders. Second interview included peer interview with team leader, 3 social workers and 2 nurse case managers.  Standard interview questions.  Nothing strange or unusual.  Shadowed a case manager for about an hour after second interview.", "Interview Questions": "How would you react to a disagreement with a coworker?"}, {"date": "14 Oct 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Mobile Infirmary Medical Center (Mobile, AL) in Sept 2015", "Interview Descriptions": "I talked to a recruiter, who asked if she could put my resume in to several additional med-surg jobs.  I agreed, and I started getting phone calls from a few med-surg nurse managers within two hours.  I then had one interview with two nurse-managers at the same time; they said they often interviewed together.  And then I had another interview with another nurse manager.  The interview was nothing out of the ordinary:  staff were polite and went out of their way to make sure I had my questions answered.\r\nI got one job offer the next day, and then another offer a few days later.", "Interview Questions": "What is your favorite part of patient care?"}, {"date": "3 Jul 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mobile Infirmary Medical Center (Mobile, AL) in Aug 2015", "Interview Descriptions": "Smooth.  Very professional.  Everyone that I met with was timely and very courteous.  Was happy when they called me for the position.  The process did not take long and every step was explained along the way", "Interview Questions": "How do I handle difficult family members."}, {"date": "2 Oct 2015", "title": "Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mobile Infirmary Medical Center (Mobile, AL) in Jan 2015", "Interview Descriptions": "Very Informative, great questions amazing staff, loved that they took the time to understand my point of view on things. politeness was a plus. went over the details of the job very plainly and to the point . expectations and such", "Interview Questions": "where do you see yourself in 5 years"}, {"date": "3 Jan 2017", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Mobile Infirmary Medical Center (Mobile, AL) in Jan 2015", "Interview Descriptions": "it was very easy and laid back it wasn't hard I was already apart of infirmary system so once I kinda figure out the process of the interview I came in with my game face and I was on the spot", "Interview Questions": "how often are you late"}, {"date": "10 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Mobile Infirmary Medical Center (Fairhope, AL) in Jun 2011", "Interview Descriptions": "It was a really quick process.  I was offered a position after the interview. but had to wait a couple of weeks to start work until a background check was completed.", "Interview Questions": "I was asked about my prior work experience and how I deal with stressful situations."}, {"date": "10 Jun 2015", "title": "Clerical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mobile Infirmary Medical Center (Mobile, AL) in Jun 2011", "Interview Descriptions": "called in for first interview with supervisor and team leaders,  later on was interviewed by coworkers.  very pleasant and not stressful at all.  was questioned on abilities to be performed within the specific department", "Interview Questions": "work history"}, {"date": "11 Aug 2012", "title": "PTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mobile Infirmary Medical Center (Mobile, AL) in Jan 2009", "Interview Descriptions": "fast to get hired, just want to know previous work related experience and why you left last job and how long you will stay. Some ask career plans, preference of work environment. Don't have to put all jobs, just ones that pertain to what you are appyling for. Most managers just want a body.", "Interview Questions": "N/A"}]]