[[{"date": "30 Jul 2022", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of California (Martinez, CA) in Jul 2022", "Interview Descriptions": "1st - computerized in interview\n2nd - zoom pane with two managers\n60 minutes were schedule for the interview however it lasted 20 minutes.\nthe interview was on a Friday afternoon\nThey will contact me in two weeks, since they are interview folks for another week, then wk  to make a decision.", "Interview Questions": "how do you communicate with clients..\ntell me about an accomplishment \nhow do you prioritize your wk when you have several items due at the same time. "}, {"date": "21 Jun 2021", "title": "Student Administrator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of California", "Interview Descriptions": "It was pretty a traditional and professional interview. It included a typical in-person segement and then a driving test. The driving test was only offered to some interview applicants after the initial questionnaire portion.", "Interview Questions": "How would you handle a situation where you were driving an upset passenger because you made them late to a midterm?"}, {"date": "15 Jun 2022", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of California in Apr 2021", "Interview Descriptions": "very structured; received questions ahead of time; staff approachable; able to interview remotely; completed online application, received an email for HR, scheduled an interview; a panel of interviewers was available", "Interview Questions": "give an example of a difficult situation and how you resolved it"}, {"date": "13 Jan 2020", "title": "Lab Assistant III Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of California", "Interview Descriptions": "They will tell you about what is required for the job and ask about how you feel completing each task. If they like you, then you would begin negotiating your salary.", "Interview Questions": "Q: How do you feel completing \"x\" or \"y\" task?"}, {"date": "22 May 2019", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of California (Oakland, CA) in Apr 2019", "Interview Descriptions": "three ppl on the panel and most interviews with the University are panel.  I felt comfortable with the interview steps.  I started as a contract employee for a year and a half", "Interview Questions": "Do you have a background in account?"}, {"date": "18 Sept 2018", "title": "ASUCLA Student Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of California", "Interview Descriptions": "The interviewer asks basic questions to get to know you better and to see if you are reliable. Because most positions on campus are for students they want to ensure that you are responsible and have good time management skills.", "Interview Questions": "How would you handle a customer that was upset?"}, {"date": "10 Mar 2018", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of California (Los Angeles, CA) in Sept 2017", "Interview Descriptions": "easy student online application and hiring process, contact with department directly, no interview, offer last for whole year, take application from spring quarter, for EE department require second year master or phd", "Interview Questions": "Auto student evaluation"}, {"date": "25 Jun 2017", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of California", "Interview Descriptions": "The interview was short. About 15-20 minutes long. They ask you common sense questions and some personality type questions. They usually take very extraverted people so as long as you are a people-person and can speak well, you're good to go. If you apply for cashier, they'll quickly and randomly throw you one small arithmetic question.", "Interview Questions": "What song describes you?"}, {"date": "23 Feb 2017", "title": "SASC Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of California", "Interview Descriptions": "You have to prepare a session on any topic or you can choose from given topics. You are in a room with three other applicants and the person holding the session. Then, you teach about any topic for a few minutes, as if you were tutoring someone. They tell you a little \"how-to\" beforehand. As long as you are interactive and remember their tips, it should be easy.", "Interview Questions": "How would you teach a topic?"}, {"date": "26 Jan 2017", "title": "Post Doctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of California", "Interview Descriptions": "Some interviews were interested in my skills others were interested in my personality. Overall they seemed very focused on advancing my career as well as finding a good fit for their research team.", "Interview Questions": "Where do I see my career in 5 years"}], [{"date": "12 Oct 2017", "title": "Assistant Art Museum Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of California (Memphis, TN) in Dec 2016", "Interview Descriptions": "I had multiple hour long conversations and tours with different members of the museum staff and campus communities over the course of a day. Interview also included a with the committee.", "Interview Questions": "Why Memphis?"}, {"date": "3 Aug 2016", "title": "Event Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of California (Santa Monica, CA)", "Interview Descriptions": "Was called without warning for a phone screening interview by the supervisor for this position. We had a brief conversation with two questions, then I was asked to schedule an in-person interview. Second interview was fairly standard, though I was warned towards the end that working with the Executive Director can be very frustrating and difficult at times. I was then asked to schedule a final interview (with pre-interview Administrative test). At the final interview, I took the admin test first and was asked to leave when I missed 2-3 errors on a proofreading test with 40 or so errors total. The Executive Director would not meet with me, though I was previously told this test was a formality. A candidate with twice the experience requested was turned away because of a few missed errors on a proofreading test. Overall, an exceptionally callous and short-sighted way to treat prospective employees. My brief glimpse of the organization tells me this is likely quite a difficult and tedious environment in which to work.", "Interview Questions": "Asked how I would handle various problematic scenarios around event management."}, {"date": "15 Aug 2016", "title": "Cooperative Extension Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of California (Hanford, CA) in Jul 2016", "Interview Descriptions": "4 steps in 4 hours (8 a.m. - noon). 1) 20 minute presentation about a program I would develop to address a need in the community 2) Formal interview 3) Tour of Facility and Meet County Directors 4) 30 minute timed writing assignment", "Interview Questions": "What is sustainable agriculture?"}, {"date": "20 Aug 2017", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of California (Los Angeles, CA) in May 2016", "Interview Descriptions": "Applied online, received a call to schedule the interview within a week. The interview lasted approximately 20 minutes. The questions were pretty basic since it was an entry level job. The questions focused on usual things like obstacles you've faced at work, conflicts with other employees, and why you want to work at that particular place.", "Interview Questions": "What is one obstacle that you've faced in a previous work environment and how did you address it? "}, {"date": "26 Feb 2019", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of California (Santa Cruz, CA) in Mar 2016", "Interview Descriptions": "I was asked to talk about my passion for food systems and it felt more like a conversation. It was nice to connect with others with similar interests. They asked me around 10 different questions in total.", "Interview Questions": "What type of change would you like to bring about in our current food system?"}, {"date": "17 Nov 2017", "title": "IT Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at University of California (Oakland, CA) in Feb 2016", "Interview Descriptions": "There were three rounds of group interviews. Some of the interviewers were in more than one round. I got the sense they were checking to make sure my responses were consistent.", "Interview Questions": "If you were thrust in a project and you heard that there was someone who was difficult to work with but you knew you had to work with them, what would you do?"}, {"date": "24 May 2017", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at University of California (Davis, CA) in Feb 2016", "Interview Descriptions": "Overly complicated, yet informal. Seems to be up to individual departments, not standardized.  You may reach out directly to principle investigators/faculty members and express your interest in their lab.", "Interview Questions": "I was mainly asked to contribute to developing ideas for and writing a grant proposal that would cover my salary. This will obviously be dependent on your area of expertise, and you should research the lab ahead of time and be prepared to contribute to their specific projects."}, {"date": "29 May 2016", "title": "Accountant Affiliate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at University of California (Riverside, CA) in Dec 2015", "Interview Descriptions": "First interview was a panel, 4 individuals, one manager, lead from our department, a general accounting representative and an individual from Human Resourses in December of 2015. The second interview was conducted because our returning supervisor came back so a second interview was conducted to include the second candidate for the position. Another set of interview was conducted for several other candidates, I did suspect that my former supervisor upon her return was given specific instructions as to what candidate should be picked for the position in line with the requirements needed to fulfill the requirements of the new open position.", "Interview Questions": "It was a structured question and something related to inter personal relations with your co-worker or supervisor."}, {"date": "6 Nov 2015", "title": "Fellowship, Postdoctoral Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of California (Los Angeles, CA)", "Interview Descriptions": "Send application directly to professors of interest.  The professor/department will recruit by inviting applicant to visit the laboratory facilities and meet others in the department.  Candidates are usually required to give a 1 hour seminar talk, describing past research, techniques.", "Interview Questions": "I was asked to give a 1 hour seminar talk on past research"}, {"date": "11 Jul 2017", "title": "PC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of California in Nov 2015", "Interview Descriptions": "It was fairly informative and easy, because it felt more like a conversation for me. I asked a lot of questions and got a lot of positive feedback and a tour of the facility after the interview. The process seemed seamless and the people how interviewed me took their time in answering my questions. I recommend doing your research and knowing what you did in your last job. Experience always helps because it adds weight to your narrative.", "Interview Questions": "What did you do in your last job? "}], [{"date": "24 May 2017", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at University of California (Davis, CA) in Oct 2015", "Interview Descriptions": "Having two rounds of interview and stressful. A postdoc position does not need to be that stressful. hh  hh  hh  hh  h h  h  h   hhh  h  h", "Interview Questions": "what have you done in your Phd?"}, {"date": "11 Apr 2016", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of California (Riverside, CA) in Oct 2015", "Interview Descriptions": "Their was no interview process I was hired by my research advisor.  There was no interview process I was given the job and all I had to do was accept it.", "Interview Questions": "N/A"}, {"date": "22 Jan 2017", "title": "SRAIII Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of California (San Francisco, CA) in Sept 2015", "Interview Descriptions": "Easy, brief, and straight to the point. Talked about what was on my CV and moved on to any interests or facts about myself that the CV cannot answer. Very basic and generic and I really don't have any more words to keep filling this out", "Interview Questions": "N/A"}, {"date": "4 Aug 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of California (Baltimore, MD) in Sept 2015", "Interview Descriptions": "Went through three rounds of interview process. In the first round I was asked mostly basic questions about my goals and earliest joining date. In second round my technical skill set and critical thinking was tested. Third round was the onsite round where I was asked to present.", "Interview Questions": "What can you bring to my lab?\r\nHow would you fit in my group?\r\nWhat are some ideas that you and I can write a grant of off?"}, {"date": "25 Aug 2017", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of California (Berkeley, CA) in May 2015", "Interview Descriptions": "group, panel interview after sending resume.  I heard about the job from a referral source who introduced us, but I did also need to file an application online.  This was a contract for a specified period, so I got a contract to sign, similar to an offer letter.", "Interview Questions": "Did I know how to use the software they track with."}, {"date": "5 Oct 2016", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at University of California (Santa Barbara, CA) in Mar 2015", "Interview Descriptions": "Group interview, 2 on 1 interview, and an application essay. Interview process was mostly about demonstrating your ability to work in a group (your teamwork dynamic) and determining your social ability (ability to empathize/emotional intelligence).", "Interview Questions": "Name a moment you're proud of."}, {"date": "20 Oct 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of California", "Interview Descriptions": "You have to do a group interview as well as a two on one interview. The group interview is about how you can work with a team and whether you can step up and also step down. The two on one interview is about your experience and problem-solving skills.", "Interview Questions": "What would you do if someone gave you the answers to a test you were stressed out about?"}, {"date": "29 Oct 2017", "title": "Videographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of California (Davis, CA) in Mar 2014", "Interview Descriptions": "I met with two department representatives, the manager and my (future) direct supervisor, for a standard interview. The whole process took roughly 30 minutes, covering the regular gamut of questions: name a time you were successful, name a time that you were challenged, how do you handle stress, what is your current (most recent) pay rate, etc.", "Interview Questions": "Tell us about a time that you failed."}, {"date": "31 Dec 2013", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of California", "Interview Descriptions": "Department was very communicative, faculty were great to speak with, students were very helpful in sharing information about the department and courses. Students were also very responsive by email. Department was very fast in making the decision and letting you know. Visit days are well-organized.", "Interview Questions": "Why do you want to do basic scientific research and why Berkeley? "}, {"date": "14 Dec 2014", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at University of California (Oakland, CA) in Sept 2013", "Interview Descriptions": "Interview was not be taken seriously.  Management panel rescheduled my interview date and time three times after they had already completed their final selection process.  I am still trying to understand the point to the process.", "Interview Questions": "No difficult or unexpected questions."}], [{"date": "24 Aug 2017", "title": "Finance Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of California (Davis, CA) in May 2013", "Interview Descriptions": "Basic questions - same one for everyone.  Students with no qualifications interview other students and ask generic questions from a piece of paper that was obviously scribbled right before the interview.", "Interview Questions": "Stupid questions like \"Think of a time when you had to overcome a situation you thought you couldn't.\" "}, {"date": "7 Mar 2013", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of California", "Interview Descriptions": "Awkward, the colleagues seemed tense as if they didn't want to work there.", "Interview Questions": "Why did you move in high school?"}, {"date": "23 May 2016", "title": "Events Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of California (Los Angeles, CA) in Sept 2012", "Interview Descriptions": "Pretty straight forward. Interview questions weren't tricky at all. The interviewers were friendly so I advise you just relax and answer the questions as best as you can. Keep it professional of course.", "Interview Questions": "Tell us about a time you disagreed with a group member or teammate?\r\n\r\nCan you lift 30 lbs?"}, {"date": "24 Jun 2016", "title": "CRC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at University of California (Los Angeles, CA) in May 2012", "Interview Descriptions": "call and then in person, interviewed by three physicians, very polite and professional, asked about the work experience related to job , asked about the ways to conduct the position", "Interview Questions": "how to manage the certain condition, how to avoid stress in work,....., expectations at the position,"}, {"date": "3 May 2011", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of California (Oakland, CA) in Mar 2011", "Interview Descriptions": "The interview process was fairly simple and professional. The interview consisted of two on site interviews. The first interview was with the Hiring Manager and another Business Analyst. It consisted of standard Business Analysis questions about requirement gathering, documentation and task prioritization. Was presented with various scenarios, technical as well as professional, to solve. The second interview was with the department's Sr. Director. Standard HR interview with questions ranging from \"Why is this a good position for you?\" to \"What will you bring to this position?\". I was also required to provide with some work samples as well as TWO professional references.", "Interview Questions": "What would be your approach to a situation for with you require some feedback and you do not have your Manager to guide you?"}, {"date": "4 Nov 2011", "title": "Consulting Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of California (San Francisco, CA) in Jan 2011", "Interview Descriptions": "They went through a series of questions.", "Interview Questions": "set up a program"}, {"date": "16 Mar 2011", "title": "Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of California (Oakland, CA) in Jan 2011", "Interview Descriptions": "Interviewers are nice.", "Interview Questions": "How do you defined job satisfaction"}, {"date": "21 May 2010", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of California (Oakland, CA) in Apr 2010", "Interview Descriptions": "Very well organized. Interview set up by phone with a detailed email - interview committee, location and interview format. Pleasant experience. I was taken aback at the number of empty cubicles and storage rooms. Still ramping up from a reorganization. Did not hear back after interview although followup was offered after the interview. Difficult to say what the office is like. Work culture I believe is - do more work with less - less resources and less time.", "Interview Questions": "Describe a time when you were in charge and the outcome was not as expected."}]]