[[{"date": "1 Jun 2023", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at SAIT (Calgary, AB)", "Interview Descriptions": "Easy, 2 interviews w the same person. Very friendly, not tense. Would recommend preparing of course, but it’s nothing stressing. Review some SAIT facts and you’ll be good to go", "Interview Questions": "Tell us about your past work experiences"}, {"date": "20 Jan 2023", "title": "Administration/Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SAIT (Calgary, AB)", "Interview Descriptions": "First contact from HR thirty minute over the phone interview questions. Next, if selected, interview with the supervisors or managers over zoom. Duration about 40 minutes. You get and email if selected or not.", "Interview Questions": "Why do you want to work here?"}, {"date": "14 Jul 2022", "title": "Software Developer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at SAIT", "Interview Descriptions": "Get phone call and email.\r\nDuring the interview,  they will  ask some tech questions to test your knowledge of the position , and ask  your experience and skills related to the job .", "Interview Questions": "Tell me about your current project"}, {"date": "10 May 2023", "title": "Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SAIT (Calgary, AB) in Apr 2022", "Interview Descriptions": "The prosess took a long time from start to finish. Pre-screen plus 2 face to face interviews. After final interview it took a long time to hear that they selected another candidate.", "Interview Questions": "Why I wanted to work in this position"}, {"date": "21 May 2021", "title": "Reporting Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SAIT", "Interview Descriptions": "Quick and efficient. The interview questions were situational and required response that described the situation, the actions you took and the results. It was a panel interview that took about an hour", "Interview Questions": "What softwares do you have experience with? "}, {"date": "11 Jan 2021", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SAIT", "Interview Descriptions": "The recruitment team contact me within a week of my application. I had 2 days notice to prepare for the interview. There were two individuals from the program area that took turns asking behavioural based questions. The interview lasted around an hour.", "Interview Questions": "There was a general conversation about my interest in the role, skills and background. All questions were behavioural based ie. \"tell me about a time when\". "}, {"date": "9 Jul 2020", "title": "CEC Instructional Design Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at SAIT", "Interview Descriptions": "Phone pre-screening\r\nAssignment must be completed prior to the in-person interview\r\n3 individuals on the interview panel and none of them seemed like they wanted to be there nor was engaged. It was a clear they already had someone in mind.\r\nExtensive interview process, and wasting people time if you already had someone in mind.", "Interview Questions": "Explain your instructional design for \"How to create a website\""}, {"date": "31 Jan 2020", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at SAIT", "Interview Descriptions": "The interview process was mostly behavioural. The questions were work specific and the interviewer knew what they were doing. I'm not so good at behavioural interviews but felt very comfortable there.", "Interview Questions": "Name a challenging situation and how you dealt with it"}, {"date": "3 May 2019", "title": "Summer Camp Counsellor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SAIT", "Interview Descriptions": "I applied online and got an offer for an interview after a few days.\r\nThree interviewers took turns asking a lot of questions about how you would deal with certain situations that might come up while leading the summer camp.\r\nA couple weeks after the interview I was offered the position.", "Interview Questions": "How would you resolve a conflict between two campers?"}, {"date": "12 Apr 2019", "title": "Fundraising Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SAIT (Calgary, AB) in Mar 2019", "Interview Descriptions": "This was one of the WORST interviews I have ever had in a professional capacity. First off they had me waiting 30 mins after my interview was scheduled to start so the panel could eat their lunch. Second they were way to focused on a course finish date that had nothing to do with the position. They had a air of arrogance about them not realizing that some of us are still employed by other companies and this is our time we are giving up to interview, I would hate to see how they treat actual employees. I will never apply to SAIT again!", "Interview Questions": "Tell us about yourself"}], [{"date": "1 Jul 2020", "title": "Community Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at SAIT (Calgary, AB) in Mar 2019", "Interview Descriptions": "Behavioural interview with panel of 5 people. Wanted lots of examples of ways I had handled things in past jobs. Interview was close to 45 minutes long. All interviewers were friendly except for one. Wish I'd come prepared with even more questions for them.", "Interview Questions": "Please give an example of a time you were innovative."}, {"date": "10 Feb 2022", "title": "Student Ambassador Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SAIT (Calgary, AB) in Jan 2019", "Interview Descriptions": "I have to say that all of the interviewer are nice and friendly , the talk was smooth and end very well, I am not stressed at all during the whole interview.", "Interview Questions": "Why do you wanna work at SAIT campus"}, {"date": "22 Aug 2018", "title": "Service Desk Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at SAIT (Calgary, AB) in Jun 2018", "Interview Descriptions": "Just a standard set of behavior questions and a few technical questions.  A conversation about goals and skills that were required as well as training that would be provided happened.  Went on to see what I was interested in and what I wanted to learn from the position.", "Interview Questions": "How would you explain DNS to a non-technical user?"}, {"date": "23 Feb 2022", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at SAIT in Apr 2018", "Interview Descriptions": "Typical HR interview style questions. Applied online and I was called for an interview within a couple of weeks . Two people present at the interview to ask questions. The process was fairly quick and standard.", "Interview Questions": "What are your strengths and weaknesses "}, {"date": "15 Jan 2018", "title": "CPM Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SAIT", "Interview Descriptions": "I got selected through the Nexen Scholarship Program in Yemen. I had the chance to join SAIT on a full funded scholarship. The interview consisted on multiple criteria such as grades, English professionalize and interpersonal skills. Once selected I received my tickets and I flew.", "Interview Questions": "Why you think you are the best Candidate ?"}, {"date": "12 Mar 2018", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at SAIT (Calgary, AB) in Apr 2017", "Interview Descriptions": "I had a Behavioral Interview where i was asked a series of questions by a  panel made up of two people.. I had a presentation Interview. The final Interview I was required to prepare a given topic and teach a mock audience for 2 hours", "Interview Questions": "How would you handle a situation where a student asked you a question you could not answer?"}, {"date": "17 Sept 2016", "title": "IT Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at SAIT", "Interview Descriptions": "Recruiter called me at a time when I said I was about to enter a meeting at my current workplace. I asked to reschedule it the following day and she agreed to call me in the afternoon... Following day came and she never called me at all. I made sure my afternoon was clear of any potential conflicts in order to ensure that I could talk to her whenever she called in the afternoon. I called and left a voicemail to follow-up and never received a call back regardless.\n\nSAIT recruiters, please be mindful when calling your selected candidates as they are also BUSY individuals who cannot sometimes answer your interview questions when you INITIALLY call. It should also be common knowledge that you should also ensure you call the specific candidate back after agreeing to it, rather than waste that person's time.\n\nI am rather disappointed by this phone interview and recruitment experience, especially since I attended SAIT years ago. The education experience was great, but I can't say the same for its managerial operations though after this experience. I was potentially looking forward to working and helping SAIT realize its mission and support for its students, but it looks like my efforts, skills, and time will be best used elsewhere instead.", "Interview Questions": "N/A"}, {"date": "7 Sept 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at SAIT (Calgary, AB) in Sept 2016", "Interview Descriptions": "Employee referer and got a phone call set up an interview, and meet-up and did general interviews. waited about a week or so and got a call asking when can I start.", "Interview Questions": "Why do you want to work with us?"}, {"date": "22 Apr 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at SAIT", "Interview Descriptions": "I had applied for a position internally as my contract was coming to an end. The recruitment specialist did not give me instructions on supplies to bring for my presentation. The hiring manager was late for the interview and he didn't make eye contact with me except when he was talking. Overall was not engaged with what I was saying and as an internal employee I thought I would even get a \"thank you for applying but we will not be moving forward and would encourage you to continue applying to positions at SAIT.\" I was promised feedback and never got even apply update!! \r\nI interviewed for another admin position and to sum it up, I got speculative looks most of the time. No matter what I said, they already made up their mind before I even interviewed. What a negative experience!!", "Interview Questions": "Describe a conflict you had in the workplace. "}, {"date": "9 Mar 2016", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SAIT (Calgary, AB)", "Interview Descriptions": "The interview process went smoothly they contacted me quickly to set up times for the interview and the location of the interview was easy to find, but they never notified me either way about position being filled, very disappointed.", "Interview Questions": "Interview questions were behavioural"}], [{"date": "8 Apr 2016", "title": "Accounting Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at SAIT (Calgary, AB) in Oct 2015", "Interview Descriptions": "I received a call from the Staffing Agency explaining the job position as well as the contract period. Post initial successful pre-screening, I had a phonic interview with SAIT Hiring Manager and was asked questions about my past experience and was given situations to gauge my behavioural responses.", "Interview Questions": "I was asked to explain my previous job experience and skills"}, {"date": "22 Jan 2019", "title": "Building Patrol Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at SAIT (Calgary, AB) in Aug 2015", "Interview Descriptions": "it was easy and fast, the supervisor who interviewed me was super nice and easy to talk to. He made me feel comfortable and he conducted a professional interview. I had no problem answering any of the questions and it went by more like a conversation", "Interview Questions": "what my experience is previously"}, {"date": "3 Mar 2016", "title": "BI Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SAIT (Calgary, AB) in May 2015", "Interview Descriptions": "1. phone screening\r\n    asked about the applying reason, experience, vision, technical level, strength and weakness\r\n2. technical interview \r\n   what is DW? what is SCD Type1 and 2?", "Interview Questions": "what is DW? what is SCD Type1 and 2?"}, {"date": "16 Jun 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at SAIT (Calgary, AB) in May 2015", "Interview Descriptions": "Easy interview process, usually a screen interview with HR and then a panel with 2-5 people for 1 hour and sometimes, if necessary another interview with the hiring Manager. The best way to get an interview is being referred by an internal employee.", "Interview Questions": "Explain a situation where you had to manage a difficult project, disagree with your supervisor etc."}, {"date": "18 Sept 2016", "title": "Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at SAIT (Calgary, AB) in Apr 2015", "Interview Descriptions": "Very easy. Set of technical and HR questions. There were 3 people who interviewed me. They asked me to rate myself in the technologies I have used. It was fairly easy.", "Interview Questions": "Tell me about a time when you had to learn something new in a short notice of time"}, {"date": "12 Mar 2015", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at SAIT (Calgary, AB) in Feb 2015", "Interview Descriptions": "Phone screen with an HR person & in-person interview with hiring manager and HR person.  The HR person was very friendly and courteous and answered all of my questions regarding pay, benefits and perks.  The in-person panel interview was stressful as all are but they made me comfortable in the interview by smiling and being very friendly.", "Interview Questions": "General administrative questions (time management, organization, teamwork)"}, {"date": "3 Mar 2016", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at SAIT (Calgary, AB) in Feb 2015", "Interview Descriptions": "The interview was in 2 processes, Typical behaviour questions, some questions about job responsible and examples of previous experiences and they related to responsibilities of the advertised position. Just prepare for interview and give lots of examples.", "Interview Questions": "Explain BA processes"}, {"date": "16 Mar 2015", "title": "Administrative Assistant I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at SAIT (Calgary, AB) in Jul 2014", "Interview Descriptions": "I applied over two weeks before I received a call, which was two days in advance of the scheduled interview. There were two people on the panel, the manager and HR person. 3 days after my interview they asked if they could call my references and I had an offer after they received responses. Reference check is via email and is very detailed, some of my references were unimpressed that they couldn't give verbal responses to questions, typing took longer. They also require that they be able to reach 3 references, so when it was summer and my references were not answering quickly I had to go back several jobs and ultimately had to give peer references because I ran out of supervisors to give them.\r\n\r\nThe big thing - when they gave me the offer they didn't tell me my hours were 40 hours per week. I (wrongly) assumed it was 35 hours per week (like most post-secondaries) and accepted my salary based on that assumption. I was not told office hours or the number of hours until after my contract was signed.", "Interview Questions": "Interview was entirely behavioural based questions"}, {"date": "15 Feb 2014", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at SAIT", "Interview Descriptions": "I was phoned for an interview within a week of submitting my application.  The interview was with one HR person and the hiring manager.  There were a series of behaviour based interview questions where I was graded on my responses.  Both interviewers took a lot of notes.  If I was unable to provide an example they allowed me to carry on to the next question, but they returned to the skipped questions at the end.  The interviewers were friendly and encouraging.\r\n\r\nThen I was asked to return for an informal meeting with the Director whom I would be supporting.  He asked me a lot of questions about my background and experience and how I envisioned supporting his department.  It was helpful to see if we clicked.\r\n\r\nA couple of weeks later I was contacted by HR with a verbal offer and to organize my start date.", "Interview Questions": "Most of the questions are typical behaviour style questions, however I strongly recommend that you read the annual report to understand SAIT's business streams as well as it's ethical principles and be prepared to provide an example of how you embody those principles."}, {"date": "7 Aug 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SAIT", "Interview Descriptions": "Basic questions. Difficult people/how do I organize / time Managment / prioritizing", "Interview Questions": "N/A"}], [{"date": "2 Aug 2017", "title": "Academic Chair Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at SAIT (Calgary, AB) in Aug 2013", "Interview Descriptions": "Six person panel interview, mainly behavioral based questions. A little intense but the panel members were friendly and encouraging.  Review the website ahead of time to gain an understanding of the structure and values of the organization, and come prepared with examples of how you have demonstrated the various competencies.  Prior to the interview, I had to complete some online personality assessments and the results were provided to the panel before I arrived.", "Interview Questions": "Tell us about a time you had to deal with a difficult employee."}, {"date": "29 May 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at SAIT", "Interview Descriptions": "I had one interview all questions were behavior questions, nothing specific about qualifications and experience", "Interview Questions": "Behavior questions can be difficult"}, {"date": "2 May 2014", "title": "PCSS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at SAIT (Calgary, AB) in Apr 2013", "Interview Descriptions": "1 interview and a panel of 6 people", "Interview Questions": "N/A"}, {"date": "11 Feb 2014", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at SAIT (Calgary, AB) in Aug 2012", "Interview Descriptions": "I was hired to fill a vacancy that arose quickly in a department. I was interviewed on a Monday and signing papers by Friday.  The whole process was quick, yet very professional as well.  I still see the people from the interview and they have remembered me which says that they paid attention during the interview. Quite pleased with the hiring and interview process.", "Interview Questions": "There weren't many unexpected questions (I have been on a number of interviews in the past) but I did need to be able to discuss conflicts and challenges from past jobs - those can be challenging to answer."}, {"date": "9 Jan 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at SAIT (Calgary, AB) in Jul 2012", "Interview Descriptions": "I only had one interview which was also on phone but second meeting was in office just to meet me and get to know me!", "Interview Questions": "just basic questions"}, {"date": "10 Feb 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at SAIT in Jul 2012", "Interview Descriptions": "It is a panel interview process. I had to prepare and deliver a class in front of a panel as if they were actual students. Then after I got questions about the class and questions about my previous experience.", "Interview Questions": "If I had taught people older than me."}, {"date": "24 Feb 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at SAIT (Calgary, AB) in Jun 2012", "Interview Descriptions": "Excellent questions that described the teaching process: questions about team work, difficult situations, and teaching philosophy. \r\nAttitude towards students and fellow teachers is important. I thought some questions were to test your judgement in regards to workload and how you handle stress\r\n.", "Interview Questions": "How do you handle difficult students"}, {"date": "5 Nov 2012", "title": "Electronic Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at SAIT (Calgary, AB) in Jan 2012", "Interview Descriptions": "Interview process was a five member panel (one HR girl).  Not only were there regular interview questions, but each technical person took a turn asking you technical questions.  Some were semi-difficult, although most were more straight forward and everyone was quite nice.  I would definitely apply to SAIT again, as it is a great school.", "Interview Questions": "\"In a non-technical area, what do you need the most help with?\""}, {"date": "26 Apr 2013", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at SAIT (Calgary, AB) in Jun 2011", "Interview Descriptions": "Small panel consisting of working group employees and human resource employ Behavioural questions with a few skills", "Interview Questions": "Performance management situations"}]]