[[{"date": "9 May 2023", "title": "Finance Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Skagit Regional Health", "Interview Descriptions": "Quite long interview.  Almost an hour with 4 people at the same time, over Zoom call.  It went quite well and the staff was very friendly.  We hit it off and I felt great about the possibility of joining the team\nGot an offer soon after which I was quite excited about, but I nearly choked when I saw the salary offered.  It was insultingly low and not at all comparative with similar positions elsewhere.  Tried to negotiate but it went nowhere so I declined.  Kept my temp job making $7 more per hour up the street.\nBeware this company pays bottom of the barrel, unlivable wages for mid-level career jobs that require a lot of skill and knowledge.  If you want to be able to afford modest rent, look elsewhere.", "Interview Questions": "Multiple questions about my accounting knowledge"}, {"date": "22 May 2023", "title": "Medical Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Skagit Regional Health in Apr 2023", "Interview Descriptions": "I applied on Indeed and was invited to a Zoom interview. The interview was pretty straight forward and started on time. They opened time up for any questions. They said that they would follow up within a week with updates and none was received. No email/call to give feedback or advise that I wasn't selected.", "Interview Questions": "Standard questions like about yourself, why you are interested in the role, how soon are you looking to start, etc."}, {"date": "2 Jan 2022", "title": "Human Resources Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Skagit Regional Health (Mount Vernon, WA) in Oct 2021", "Interview Descriptions": "Remote process- all via phones, no video.  No follow up questions or opportunities to ask questions. I wasn’t asked about my qualifications or examples of when I demonstrated expertise skills.", "Interview Questions": "Why was I interested in working for their company?"}, {"date": "6 Dec 2020", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Skagit Regional Health", "Interview Descriptions": "A lot of repetitive and typical questions pertaining to customer service. Questions about de-escalation experience are also highlighted. Knowledge about HIPAA and medical terminology is a plus. There are also questions pertaining to familiarity with the EPIC Electronic Health Record System.", "Interview Questions": "How did you handle a difficult patient?\n"}, {"date": "30 Jan 2021", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Skagit Regional Health (Seattle, WA) in Sept 2020", "Interview Descriptions": "It was an online application.  Al lot of questions.  HR later emailed with more questions.  I never received a final decision as to whether or not I was a contender for the job and whether or not I was rejected.", "Interview Questions": "What was my previous experience"}, {"date": "20 Jan 2018", "title": "HIM Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Skagit Regional Health (Mount Vernon, WA)", "Interview Descriptions": "Went into the manager’s room. Manager and supervisor asked questions about my experience for the position. The manager was very nice, the supervisor was okay. I believe they asked about 8 questions total. Took about 40 mins.", "Interview Questions": "Do you have any experience with medical records?"}, {"date": "1 Nov 2017", "title": "Referral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Skagit Regional Health", "Interview Descriptions": "The initial online application then a phone interview/screening. I had two in-person interviews as well. The first was brief with the person who was to by my direct manager and then the second was a panel interview with the practice manager, front office manager, and an employee who was currently in the position I was interviewing for.", "Interview Questions": "Each interview I was asked a version of \"How do you deal with difficult patients/situations\"? "}, {"date": "26 Feb 2016", "title": "Insurance Authorization Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Skagit Regional Health (Mount Vernon, WA) in Mar 2015", "Interview Descriptions": "I had a phone interview with hiring manager. The met with supervisor and director of the department for a short meet and greet. My final interview was with supervisor and two managers from the department for extensive panel interview. This lasted for about an hour and a half. After the final interview, I received a phone call from the hiring manager offering me the position.", "Interview Questions": "Very general behavioral interview questions. What are you strengths and weakness? How do you handle a difficult coworker? Describe a situation you went above and beyond your job description. "}, {"date": "13 May 2017", "title": "Security Guard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Skagit Regional Health in May 2013", "Interview Descriptions": "The interview was pretty relaxed; the supervisors were very polite. I did the interview and a week later I found out I had the job. It wasn't that difficult of a interview, just be ready to answer questions regarding possible scenarios and and answer as honestly as possible.", "Interview Questions": "What would you do with hostile patient?"}], [{"date": "9 Sept 2016", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Skagit Regional Health (Mount Vernon, WA) in Oct 2012", "Interview Descriptions": "Was asked questions that pertained to the job I had applied for, Very friendly duo that interviewed me. Had asked me questions about experience and personal interests. I felt very comfortable throughout the interviewing process. I was welcomed into a private room, and given a comfortable chair to sit in as the interviewers sat across from me making eye contact and smiling. They seemed cheerful and made me feel very welcome.", "Interview Questions": "What do you enjoy doing in your spare time, or have you any hobbies?"}]]