[[{"date": "16 Mar 2023", "title": "Patient Transporter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bon Secours Mercy Health", "Interview Descriptions": "They asked about all the normal stuff and availability. Tell me about yourself, how would you handle certain types of situations. Nothing to worry about, over the phone interview didn’t get to meet face to face.", "Interview Questions": "Tell me a little bit about yourself"}, {"date": "11 Mar 2023", "title": "Clinical Quality Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bon Secours Mercy Health", "Interview Descriptions": "First interview is completed by HR to ensure your experience aligns with the role and that you have an overview of the role. After that, you are connected with the hiring manager/director.", "Interview Questions": "How do you feel about working remote? How will you keep yourself engaged in that setting?"}, {"date": "16 Mar 2023", "title": "Service Desk Level I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Bon Secours Mercy Health (Cincinnati, OH) in Mar 2023", "Interview Descriptions": "Interview was rescheduled to an hour early with 4 hours notice. Recruiter was informed I was 10 minutes outside of range multiple times and still moved forward with the interview. Interview stopped once the interviewer knew I was outside the range. Interviewer spent 20 minutes being distracted and was not knowledgeable about the position.", "Interview Questions": "Interviewer didn't ask any questions pertaining to the position."}, {"date": "14 Feb 2023", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bon Secours Mercy Health", "Interview Descriptions": "Medium difficulty. It’s a panel interview with multiple staff and directors. Behavioral questions along with skilled questions are asked. It’s a series of interviews for Nurse Directors. Focus on questions that include emotional intelligence.", "Interview Questions": "Describe a time when you have dealt with a difficult coworker, how did you handle the situation?"}, {"date": "29 Aug 2022", "title": "Social Media & Marketing Content Specialist - Programmatic Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Bon Secours Mercy Health", "Interview Descriptions": "Very disappointed as I was excited about this opportunity but it’s very clear this isn’t a well run organization. They had me interview with 5 different people over the course of a month and a half only to ghost me after the final interview. A huge red flag for someone whose applying for a role which is supposed to improve their employer brand, they should really hire a reputation agency. Also, they shouldn’t emphasize how they pray before each meeting but are welcoming to people of all faith. You’re not going to get people of all faiths if you’re siloing them into YOUR faith.", "Interview Questions": "Why are you looking for a new role?"}, {"date": "14 Sept 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Bon Secours Mercy Health (Richmond, VA) in Sept 2022", "Interview Descriptions": "I used Zoom app. I received questions about my career and situation regarding conflicts with colleagues or patients. And I ask some questions to interviewer.  Interviewer was so kind and gentle. ", "Interview Questions": "introduce myself. \nMy skill.\nsituation regarding conflicts with  colleagues or patients. "}, {"date": "11 Jul 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bon Secours Mercy Health", "Interview Descriptions": "Lengthy \r\nDisjointed \r\nDisappointing \r\n\r\n4 total interviews - including one with a panel. The process took over 2 months. I was finally told I was THE finalist and required to give 5 references and take 5 assessments. My references were all contacted. I received two generic emails that said my location was a problem. The job was advertised and communicated as 100% remote and I live within 2-3 hours of the HQ.", "Interview Questions": "Standard interview questions - describe a tone etc"}, {"date": "23 May 2022", "title": "IT Field Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bon Secours Mercy Health", "Interview Descriptions": "Friendly interviewers asked basic questions.  They were happy to answer any questions I had.  I even got the job after my brain melted half way through and I completely forgot a common term.", "Interview Questions": "Who do you think you are and what gives you the right?!"}, {"date": "21 Apr 2022", "title": "Human Resources- Associate Wellbeing Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours Mercy Health in Mar 2022", "Interview Descriptions": "The recruiter in HR called me on the phone for an initial screening that was quick and productive. I then spoke on Zoom to the hiring manager for almost an hour. During this interview I learned a lot about the position and company as a whole.", "Interview Questions": "Tell me about yourself and how your experience relates to this position. "}, {"date": "28 Mar 2022", "title": "Talent Acquisition Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours Mercy Health in Feb 2022", "Interview Descriptions": "The interviewer introduced herself and talked about their org before starting the Behavioral-based questions. prepare stories from your past work experience or you'll struggle to answer this kind of question.", "Interview Questions": "N/A"}], [{"date": "13 Apr 2022", "title": "Contact Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Bon Secours Mercy Health (Cincinnati, OH) in Jan 2022", "Interview Descriptions": "Pretty easy process, I got hired through a temp agency but I also spoke to the hiring Manager and the question were very easy . I honestly feel like anyone could get the job", "Interview Questions": "Do you have any call center experience "}, {"date": "7 Mar 2022", "title": "Head of/Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Bon Secours Mercy Health in Dec 2021", "Interview Descriptions": "I was called for a phone screening with HR only a few hours after I submitted my assessment. I interviewed with HR separately for two positions, one title was \"Head of ____\" which reported to a VP and the other was \"Manager\", reporting to a director. Both roles were remote. Head of was an individual contributor role, and there were 3-4 direct reports for the manager position. The pay range was the same for both $80K-$100K", "Interview Questions": "One thing that was asked in several ways during the assessment was whether I was comfortable disagreeing with my supervisor."}, {"date": "18 Jan 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bon Secours Mercy Health (Cincinnati, OH) in Sept 2021", "Interview Descriptions": "Over the phone interview with the HR Recruiter. Then referred on to Department Manager for an interview. Then completed a peer interview with 6 colleagues. Was straightforward process. Recruiter kept me updated.", "Interview Questions": "Asked about relevant work experience for position."}, {"date": "5 Sept 2021", "title": "Student Nurse Extern Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Bon Secours Mercy Health (Toledo, OH) in Jul 2021", "Interview Descriptions": "Excellent Job fair - lots of local hospitals represented and seamless interview between sites (St. Vincent, St. Anne's, St. Charles). Every site was represented and offers were almost immediate. The HR staff paired you with the site /and or department that you were most interested in.", "Interview Questions": "What strengths can you offer us? and Why should we choose you over other candidates?"}, {"date": "8 Jun 2021", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bon Secours Mercy Health (Richmond, VA)", "Interview Descriptions": "I was emailed an hirevue to complete as my interview. I believe it was for COVID-19 purposes but it really took away from me being able to show my full potential but it was a very informative video before and great instructions.", "Interview Questions": "Why do you want to be a patient access Representative? And what does that mean to you?"}, {"date": "25 May 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bon Secours Mercy Health", "Interview Descriptions": "The interview process for this company was one of the best that I’ve ever experience overall. The interview itself was very informative and gave you a lot of information about what the organization stands for.", "Interview Questions": "One of the questions that they asked me was looking looking for something that was long-term or short-term."}, {"date": "1 Mar 2022", "title": "Systems Director Ambulatory Nursing/Continuum of Care Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bon Secours Mercy Health (Cincinnati, OH) in May 2021", "Interview Descriptions": "I first spoke with a recruiter.   She promptly scheduled me to interview with the hiring manger and several others over a series of three interviews.  Interviews were virtual.    The recruiter, hiring manager, and other interviewers were all very pleasant and asked thoughtful questions.  I was one of two finalists for the job.  I wasn't selected, but the hiring manager took the time to meet with me to discuss his decision, and encouraged me to apply for other open positions.  I eventually accepted a similar role at another health system.  But I had a very positive experience with this interview process.", "Interview Questions": "I don't recall specific interview questions due to time lapsed since interview."}, {"date": "13 Sept 2021", "title": "Workforce Data Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bon Secours Mercy Health in May 2021", "Interview Descriptions": "There was only one round. We had a short 30mins meeting with the team and the manager to discuss my past work. It was more like a chat than a technical review.", "Interview Questions": "Tell me about one of your past project"}, {"date": "1 Jul 2021", "title": "Digital Marketing Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Bon Secours Mercy Health in Apr 2021", "Interview Descriptions": "The first interview was by phone and asked basic resume based questions. The second and third interviews were Zoom calls. The interviewer was the hiring manager who was very personable and relaxed. Standard behavioral, technical, and experience  questions were asked.", "Interview Questions": "Tell us how your skills and experience make you a good fit for this role?"}, {"date": "28 Mar 2021", "title": "ED Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bon Secours Mercy Health", "Interview Descriptions": "Two-Stage interview process. Simple and straightforward questions that were concerned with teamwork and conflict resolution. The initial interview was a simple and short phone screening where they verified resume content.", "Interview Questions": "How have you handled a situation in which you disagreed with a co-worker?"}], [{"date": "20 Mar 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bon Secours Mercy Health", "Interview Descriptions": "The interview process began by submission through the corporate website, followed by an electronic assessment (general).  I then went through a series of interviews (4).  The recruiter was very nice and genuine.  The process was long.", "Interview Questions": "How would you deal with a dispute with a coworker?"}, {"date": "12 Feb 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bon Secours Mercy Health (Cincinnati, OH) in Feb 2021", "Interview Descriptions": "It was very easy as long as you prepared for it because I researched a lot about interviews and the organization so that I have a better understanding of what they are about.", "Interview Questions": "How did you find out about this job?"}, {"date": "23 Mar 2021", "title": "Activities Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Bon Secours Mercy Health (Norfolk, VA) in Feb 2021", "Interview Descriptions": "There are 3 phases. 1)  head hunter reaches out and does short phone interview. 2) You hear from hiring manager — short phone interview. 3) face to face or zoom interview (generally with two people), including hiring manager. Sadly however, even after all of that if you’re not chosen you will not hear back from them.", "Interview Questions": "What would be the hardest thing for you to do in this position? "}, {"date": "17 Dec 2020", "title": "Rehabilitation Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bon Secours Mercy Health", "Interview Descriptions": "The interview was really great and I enjoyed heard back from management promptly. The interviewers asked good questions and were affirming. Overall the interview process went well and I ended up getting the job.", "Interview Questions": "What would you say is a weakness of yours?"}, {"date": "9 Sept 2020", "title": "PCT/CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bon Secours Mercy Health", "Interview Descriptions": "the interview was very well run and the lady was easy to talk to. she asked me very general questions but all to the point of the job position. it lasted around 30 minutes which didnt seem too long", "Interview Questions": "Why do you want this position "}, {"date": "4 Jul 2020", "title": "Supply Chain Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bon Secours Mercy Health (Cincinnati, OH) in Jun 2020", "Interview Descriptions": "1.  Applied for position (external candidate with no Health Care background) in FEB 2020\r\n2.  Discussed position with Recruiter as initial phone screen\r\n3.  Conducted Phone Interview with Hiring Manager \r\n4.  Conducted On-site interview - Late-FEB 2020 at Mercy West Hospital\r\n     - Met with Direct Report Team\r\n     - Met with Peer Team (Other Departmental Directors)\r\n     - Met with Site Senior Management (Hospital CEO, CNO, CFO)\r\n     - Toured hospital with Supply Chain Executive Director\r\n5.  Didn't receive offer as they went with Internal Candidate, but was told to stay in touch\r\n6.  June 2020 - Recruiter informed me of similar position at Fairfield Hospital\r\n7.  Conducted interview again (this time virtually due to COVID-19) with:\r\n     - Met with Direct Report Team\r\n     - Met with Peer Team (Other Departmental Directors)\r\n     - Met with Site Senior Management (Hospital CEO, CNO, CFO)\r\n     - Met with COO and Supply Chain Executive Director \r\n8.  Recruiter informed me that I was not selected for position after 2nd time of full panel interviews (February and June) after many hours discussing, preparing for, and communicating back-and-forth:(\r\n\r\nEveryone was extremely friendly, professional, and courteous; however they only hired internal    candidates or those with a health care background, so I essentially wasted several vacation days and many hours in preparing for this opportunity, when they wouldn't have hired me from the get-go from the sound of everything.  \r\n\r\nSeems like a GREAT organization, but can't believe the amount of time spent on this opportunity and NOT receive an offer.  I understand you must make the right hire at all costs, but this was completely wasteful of resources in my opinion.", "Interview Questions": "Interview questions were typical:  \r\n\r\nHow have you communicated policy changes, etc. to your team, even when you didn't necessarily agree with strategy?\r\n\r\nWhat's the hardest discussion you've ever had to have with an employee?\r\n\r\nHow do you handle working with difficult people?\r\n\r\nWhat brings you to want to work in health care industry?\r\n\r\nHow can your background in Supply Chain help out our supply chain?"}, {"date": "27 Jan 2020", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bon Secours Mercy Health", "Interview Descriptions": "Had to fill out an online questionnaire before being interviewed. Then you had a screening with the recruiter and then you were brought in for an interview with the hiring manager. Also met a few people on the team.", "Interview Questions": "Asked about past experience"}, {"date": "16 Sept 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bon Secours Mercy Health (Cincinnati, OH) in Jan 2020", "Interview Descriptions": "The entire interview process was very enjoyable even though it had to be conducted online due to COVID-19. The interviewers were very laid back and made the interview into a conversation between them and myself.", "Interview Questions": "They asked a lot about my involvement in organizations "}, {"date": "8 Mar 2021", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Bon Secours Mercy Health (Cincinnati, OH) in Dec 2019", "Interview Descriptions": "Pleasant, Comfortable, some questions seemed redundant. I had no problem with the interview/interviewer. The interview room was clean, well lite. Information about the organization and its vision was presented very well by the interviewers.", "Interview Questions": "Same questions I've answered in previous interviews: my experience, how do I handle stress, etc."}, {"date": "9 Mar 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bon Secours Mercy Health (Norfolk, VA) in May 2018", "Interview Descriptions": "First a review of the job with HR assistant, next a phone interview, then an interview with the department manager and members of the unit. Finally, you are called with a offer, either the same day or the next day.", "Interview Questions": "What assets can you contribute to Bon Secours Mercy Health "}], [{"date": "17 Feb 2020", "title": "Behavioral Health Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bon Secours Mercy Health (Toledo, OH) in Jun 2016", "Interview Descriptions": "Interviewed by around 5 people that are all in the room, all different disciplines that work together on the  behavioral health units. They have  a list of questions to ask. Some specifically about how you would handle situations while working on the units and some as broad as personality traits.", "Interview Questions": "How would you deal with a situation where a patient was becoming violent?"}]]