[[{"date": "14 Mar 2023", "title": "Custodian Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MaineHealth", "Interview Descriptions": "I thoroughly enjoyed the process. I felt empowered and appreciated during this process. The hiring process felt long winded and drawn out but in the end I was glad for the process", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "12 Jan 2023", "title": "Workforce Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MaineHealth", "Interview Descriptions": "Very friendly and approachable, conversational and professional, job was a lot different from what was in the job description but actually even better. 45 minutes explained the whole process thoroughly", "Interview Questions": "Tell me about yourself, how would you handle unknowns"}, {"date": "21 Oct 2022", "title": "Associate Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MaineHealth", "Interview Descriptions": "Very Straight forward and quick response time. They were very professional and considerate about my time and were willing to give me an answer quickly. The interview was remote on a video call.", "Interview Questions": "What skills do you have that would qualify you for this job?"}, {"date": "18 Oct 2022", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MaineHealth in Oct 2022", "Interview Descriptions": "Great pay! Good interviewers who know what they are doing. They have experience doing the work that they were interviewing for. Very easy to talk to and answered questions honestly.", "Interview Questions": "What do you bring to the table?"}, {"date": "1 Jun 2022", "title": "Sr. Desktop Support Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at MaineHealth in May 2022", "Interview Descriptions": "I enjoyed my chat with the hiring manager.  She was direct and it wasn't fluffy.  I had one interview that lasted 40 minutes. The supervisor barely made a peep.  The manager did all of the talking.\n\nI was offered the position a day later and we negotiated salary but while I was waiting for an offer letter, I get an email stating that they decided to rescind the offer and give the position to an internal.  They needed someone quickly and I had a memorial/funeral to go to out of state and that seemed to be an issue.  I think I dodged a bullet if they don't feel that family is important.\n\nVery unprofessional.", "Interview Questions": "How do I feel about Customer Service?"}, {"date": "27 Apr 2022", "title": "Patient Access Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MaineHealth", "Interview Descriptions": "Was reached out to by a recruiter on Linkedin stating that this position was able to grow my career, however was unable to or didnt respond to questions on the position when I replied", "Interview Questions": "How did I feel that this position would fit into my career goals."}, {"date": "12 Feb 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MaineHealth", "Interview Descriptions": "Employees were allowed to interview candidates which would be great, except the information they give does not appear consistent with reality. Their body language does not alight with their words.", "Interview Questions": "The staff asked why I wanted to work there. That was about it, the rest was fluff. "}, {"date": "20 Jan 2022", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MaineHealth", "Interview Descriptions": "The interview process I had was short. But the person that interviewed me was very friendly outgoing and easy to talk to.  I learned a lot about the job.  Unfortunately it was not a good fit for me.", "Interview Questions": "Basic questions interview questions were asked"}, {"date": "11 Mar 2022", "title": "Practice Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at MaineHealth (Portland, ME) in Dec 2021", "Interview Descriptions": "Actual interviews were positive and people were nice.  Process took 3 months.  Hours and hours of interviews with nearly 2 dozen people   Felt like it was moving in a great direction.  Overall positive.  Negative was the amount of time the process took.", "Interview Questions": "Normal canned questions about leadership style, conflict resolution, etc"}, {"date": "7 Sept 2021", "title": "Site Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at MaineHealth", "Interview Descriptions": "I was given a phone interview where I was asked a couple of questions about me and my experience and was shortly hired after that. The process was smooth for me.", "Interview Questions": "What are some of you hobbies"}], [{"date": "17 Feb 2023", "title": "Administrative Team Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MaineHealth in Sept 2021", "Interview Descriptions": "Initial interview was via phone with the hiring Manager. Follow up interview was in-person to meet the hiring Manager and the team. An offer for the position was received the following week.", "Interview Questions": "What are your three strengths and weaknesses?"}, {"date": "30 Aug 2021", "title": "Financial Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at MaineHealth", "Interview Descriptions": "There were Three person panel interviews (3 back to back).  The total time to interview was about 2 hours with no breaks in between the interviews.  At least water was offered.", "Interview Questions": "How do you handle conflict in the workplace?"}, {"date": "21 Jul 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MaineHealth", "Interview Descriptions": "It was a lengthy interview process and they never got back to me. I had to email them to ask for a response only for them to receive  some automated email response telling me I wasn't chosen.", "Interview Questions": "How do you manage your workload?"}, {"date": "7 Jun 2021", "title": "Pateint Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MaineHealth", "Interview Descriptions": "Short, mostly informative. I applied for the emergency room clerk position. Didn't seem like you needed any experience to get the job. Since they offer professional training. The phone call was the interviewer describing the position and what it entails.", "Interview Questions": "Would you be willing to work 12 hour shifts?"}, {"date": "8 Mar 2021", "title": "Supply Chain Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MaineHealth", "Interview Descriptions": "It was very laid back and the interviewers made me feel very comfortable. I had two people interview me and they were both kind and respectful. It felt like more of a conversation at some points which I liked.", "Interview Questions": "Describe a time where you had to handle an angry customer"}, {"date": "12 Feb 2021", "title": "Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at MaineHealth", "Interview Descriptions": "Friendly and easy interview process.  Overall, slower process but worthwhile.  Would definitely consider working there again in the future. Mainehealth is good to its employees.  Two interviews were required, each with only 1 supervisor.", "Interview Questions": "What are you good at doing?"}, {"date": "3 Feb 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MaineHealth", "Interview Descriptions": "Never respond to applicants after they apply for positions. This is disrespectful to any and all applicants that take the time an effort to apply for a position. You need to really consider if you want to work for a place that doesn’t care about people before they even enter.", "Interview Questions": "No communication with applicants throughout their process."}, {"date": "2 Jun 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MaineHealth in Feb 2021", "Interview Descriptions": "3 rounds of interviews with different members of the department. Laid back, great interview and seemed very interested in getting to know me personally. Overall, extremely happy with the interview and I got the job! Very excited to work for this great company!", "Interview Questions": "Why are you interested in this position? "}, {"date": "25 May 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MaineHealth (Scarborough, ME) in Jan 2021", "Interview Descriptions": "It was the most amazing interview I had ever had. They were so calm and understanding and did not grill me the way past interviews have been. I would definitely want to work here based on the interview alone.", "Interview Questions": "What makes you want to work here?"}, {"date": "18 Dec 2020", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MaineHealth in Oct 2020", "Interview Descriptions": "Began with a pre-screen with Director,. followed by a panel interview with a variety  leaders. 3 days later I was invited to a second interview which consisted of   4h of interviews varying between department supervisors and providers. Most of the supervisors asked behavioral based questions while the providers took a more laid back approach.  I heard back about a week after that, they did go internal for the position but  encouraged me to look for other opportunities within the system.", "Interview Questions": "What does success look like to you? \n\n"}], [{"date": "10 Sept 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at MaineHealth", "Interview Descriptions": "The initial application process took some time to fall down to my manager, but once it did the interview was smooth and professional. I felt very at ease and that I could be myself. It was an individual interview.", "Interview Questions": "Why do you want to be a nurse? "}, {"date": "29 Mar 2022", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MaineHealth (Portland, ME) in Apr 2020", "Interview Descriptions": "Started with email exchange, lead to zoom interview with managers, and then a group meeting with the people that I would be working with. It could have been faster and more efficient.", "Interview Questions": "Explain a time you experience challenge"}, {"date": "9 Dec 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MaineHealth (Portland, ME) in Nov 2019", "Interview Descriptions": "2 hour interview process meeting with multiple pairs of employee from various departments. Each pair had a different perspective to offer. The best interview process I've experienced. I left feeling confident and excited at the idea of working for this company.", "Interview Questions": "Why are you interested in this job?"}, {"date": "3 Feb 2021", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at MaineHealth (Lynchburg, VA) in Apr 2019", "Interview Descriptions": "It began with application, which required both a resume and cover letter, they the person who was working in HR called for the interview, which was carried out over the phone.", "Interview Questions": "What do you feel uniquely qualifies you to work at MaineHealth?"}, {"date": "27 Mar 2019", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at MaineHealth", "Interview Descriptions": "I applied to a position online as an external applicant and it took 4 weeks to receive an interview. The interview was at the research institute and was very casual. I was not asked the typical strengths, weaknesses, etc.", "Interview Questions": "Tell me about a conflict you had with a colleague or peer and how did you handle it?"}, {"date": "4 Dec 2018", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at MaineHealth (Portland, ME) in Oct 2018", "Interview Descriptions": "I was contacted by the program manager directly via e-mail and we set up an in-person interview. I was told two other members from the team would be there and that this was the first round. The interview was one of the best I've ever had.  We were able to have more of a conversation than just bombarding me with questions. Although, I noticed some weren't writing down my answers which concerned me a little. They gave me a time frame of when they would let candidates know about a second interview which would be the following week. That week passed and I followed up via email twice to get an update as I was in the middle of looking for jobs and really wanted to know if this was still an option. Two months went by with NO ANSWER until I finally received a generic computer-generated email from MaineHealth's talent acquisition  that I was not chosen. I'm sure they chose someone internal, as they often do. It is so impersonal that the person you are in contact with cannot send you a personalized response about their decision with the option to get feedback. They get to interview a bunch of people because they can let their computer system deal with the difficult part of denying someone the position. This place feels impossible to get into unless you have a direct connection.", "Interview Questions": "What is a work place policy that you have disagreed with?"}, {"date": "4 Jun 2018", "title": "Patient Navigator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MaineHealth (Intervale, NH) in May 2018", "Interview Descriptions": "Got a phone call to arrange an interview with video meeting option; I chose to meet in person, but did not get called for a second interview (I am qualified in an overlapping professional area that the hospital does not hire full time).", "Interview Questions": "If I had any questions for them."}, {"date": "26 Apr 2018", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at MaineHealth (New York, NY) in Apr 2018", "Interview Descriptions": "I applied and was contacted within a few days regarding salary negotiations. After that, I was called about two weeks later and scheduled an interview for the day after. Very easy! I was then told I had got the position two weeks later.", "Interview Questions": "What was one experience where you were a leader?"}, {"date": "17 Apr 2018", "title": "Administrative Specialist II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MaineHealth (Portland, ME) in Mar 2018", "Interview Descriptions": "The interview process was pretty straight forward. I got a call from one of the department heads to have an initial phone interview and go over the scope of the job, she then setup an in person interview for the following week.  I met with 4 ladies, all were very nice.  Your basic questions- nothing too intense,  but I was a little confused at the end of the interview when one of the women walked out without a goodbye- I took that as a sign and assumed I probably didn't get the job: )  Obviously the job wasn't meant to be, but what gets me is when a company (especially one as large as this) doesn't have the decency to send a simple email or letter saying \"thanks for interviewing...we've gone with someone else\", that just seems like the appropriate way to handle a prospect who took the time to come in and interview.", "Interview Questions": "How do you prioritize when you're dealing with 3-4 different supervisors who all need different things done at the same time? "}, {"date": "30 Jul 2018", "title": "Tobacco Prevention Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at MaineHealth in Jan 2018", "Interview Descriptions": "A few weeks after applying for the position, I was invited for an in-person interview with the Director of Partners for Healthier Communities, a part of Southern Maine Health Care. The interview lasted about 30 minutes and consisted of questions regarding my experience and personality-based questions. When asking what the next steps would be, she said I would hear back regardless of the decision within two weeks at most. Well, I did not hear back until FIVE MONTHS later, receiving an automatic rejection email from Southern Maine Health Care. To the director and SMHC-treat your potential candidates with respect and understand that their time is just as valuable as yours. Very unprofessional.", "Interview Questions": "Why do you want to work for SMHC?"}], [{"date": "13 May 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MaineHealth (Portland, ME) in Jan 2017", "Interview Descriptions": "stringent screening, tough questions, very behavioral based interviewing techniques, lots of phone communication, 4 rounds of panel interviews, asked for several samples of previous work, need to persist with the hiring team when they do not get back to you", "Interview Questions": "how would you rate your ability to manage mul;tiple competing demands?"}, {"date": "24 Jan 2017", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at MaineHealth (Portland, ME) in Dec 2016", "Interview Descriptions": "The interview process consisted of one, in-person interview, with a three-member interview committee. It was located at MaineHealth and took about one hour. I did not have to complete a second interview. After two weeks, I received a phone call letting me know I was a finalist, then was offered the position one week after that.", "Interview Questions": "What types of method or process have you used to approach a project or problem? "}, {"date": "2 Sept 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MaineHealth in May 2015", "Interview Descriptions": "I had a Skype interview as I was unable to travel to Maine to interview in person.  Interviewers were very nice and eased my nerves.  Slight technical difficulties with Skype.", "Interview Questions": "Tell me about yourself"}, {"date": "4 Jan 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at MaineHealth (Portland, ME) in Apr 2015", "Interview Descriptions": "I had contacted MaineHealth personally and from then applied online and then had interviews with various members.  They let me know soon after and I had to attend pretty unnecessary training that had nothing to do with me, and mostly to do with Maine Medical Center employees (information about dealing with patients etc.) Overall this was a smooth interviewing process until I had already been hired and had to deal with Human Resources which was a complete disaster.", "Interview Questions": "Why do you want to work at MaineHealth?"}, {"date": "19 Apr 2015", "title": "Housekeeper Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at MaineHealth (Belfast, ME) in Apr 2015", "Interview Descriptions": "I was called for an interview the day after I saw and applied on line for this position. A week later I was interviewed. The reason they called me so soon after applying was because I had worked at my previous job for 6 years straight out of High School. I was not hired but it was because there was more to the job than I was qualified to do.", "Interview Questions": "They asked me where I saw the job advertised."}, {"date": "25 Feb 2015", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at MaineHealth (Portland, ME) in Oct 2014", "Interview Descriptions": "The first step in the process is a prescreening phone interview with a recruiter and then a phone interview with the hiring manager and two other members of the team the individual would be working under or with.", "Interview Questions": "How would I like to be trained on the aspects of the job."}]]