[[{"date": "3 Apr 2023", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Midwestern University", "Interview Descriptions": "Had a phone screen and was told I was moving on to the next step. Months went by and was then told I didn’t get the job. Not a good experience!! Just be honest up front and communicate better.", "Interview Questions": "If I was ok with the salary. They do NOT negotiate."}, {"date": "2 Apr 2023", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Midwestern University (Phoenix, AZ)", "Interview Descriptions": "organzied. They asked multiple questions about science and my aspirations. They also asked about who I am as a person and what type of medical field , interests or people I love.", "Interview Questions": "it was good since they asked many questions"}, {"date": "9 Apr 2022", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Midwestern University", "Interview Descriptions": "In person, several staff, quick, one day. I don’t have at least thirty whole words to use to describe the process. I like to keep it to the point, they were polite and professional.", "Interview Questions": "What was my future trajectory plan"}, {"date": "3 Apr 2022", "title": "Medical Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Midwestern University", "Interview Descriptions": "A holistic approach. They have variety of people ask you questions. Make sure you know your responses beforehand. They want to know why you want to attend their school. Show them that you want to be there.", "Interview Questions": "Why do you want to be part of the DO program?"}, {"date": "28 Nov 2021", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Midwestern University", "Interview Descriptions": "There are two rounds of interview, first is the Telephone round  and second is the video round on zoom. total 2 rounds and you're done. Very smooth and easy process to move forward with.", "Interview Questions": "Why do we choose you for this position?"}, {"date": "4 Jan 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Midwestern University", "Interview Descriptions": "It was a MMI style interview, 1-on-1 question you answered for a few minutes then moved on to the next person. \r\nTour of campus and clinic. \r\nFull day interview process", "Interview Questions": "Describe the qualities of a leader. "}, {"date": "26 Jul 2018", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Midwestern University", "Interview Descriptions": "Intro phone interview followed by onsite interview with HR and hiring manager. HR questions were STAR based. The hiring manager asked scripted questions, too, but our talk expanded organically through dialogue. A computer assessment was the last part of the interview. The questions ranged from basic to expert. Even if you are an advanced Microsoft Outlook, Word, Excel user, I advise that you take a sample test prior to your interview.", "Interview Questions": "Out of all our qualified candidates, why should we hire you?"}, {"date": "28 Apr 2018", "title": "Perfusionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Midwestern University (Phoenix, AZ) in Mar 2018", "Interview Descriptions": "I was asked to do some math problems at the beginning. After that I was taken into another room and two people interviewed me. At the beginning of the interview, I was asked to connect the tubes.", "Interview Questions": "why do you choose Midwestern?"}, {"date": "23 Jan 2021", "title": "Dental Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Midwestern University (Lombard, IL) in Aug 2017", "Interview Descriptions": "Interview as MMA format, everyone asked very down to earth questions and were easy to talk to. Very laid back interview. It was overall one of the most comfortable interviews I had ever done.", "Interview Questions": "If you were abducted by aliens what are three things you would teach them about humanity?"}, {"date": "16 Oct 2017", "title": "Research Assistance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Midwestern University (Glendale, AZ) in Jun 2017", "Interview Descriptions": "I was contacted about a month after submitting my application with an initial phone screening with HR, which was pretty basic and pleasant. Just verifying your information you provided and expanding on it a little. About two days later I was contacted by e-mail for an in-person interview on campus the following week.  I was instructed in the e-mail, that I would be meeting with Sarah from HR and Dr. Smith from the department. (Fake names provided for anonymity's sake but this part is rather important)  \r\n\r\nThe first interview occurred with HR and was very friendly and welcoming including rather typical interview questions. This part took about an hour and was breezy and pleasant.  Next, we traveled to the department who the position was with. I met with Dr. Smith out in the hallway and he was perfectly friendly, shook my hand, and lead me into the interview room... with 4 other individuals in it. This immediately threw me off as the e-mail made it sound as if I was only meeting with one individual, whose work I had researched and for which I was prepared for. I was completely unaware this would be a panel interview but I tried to roll with it. \r\n\r\nOf the other 4 people, one was friendly, two were neutral, and the last one was 5 minutes late and refused to introduce himself to me during introductions. They went around the room and asked questions about my background relevant to their projects, some questions were rather straightforward but there were a few that were unexpected (provided below). A few questions were about my experience in the past and what I did, some were about how I felt my skills would transfer to specifics of their research, and how I handle multiple projects at a time. Oh, except the guy who arrived 5 minutes late.  He asked me seemingly irrelevant questions that seemed to poke fun at me as a person and my intelligence rather than to evaluate me as a legit candidate. This helped increase the edge and create an awkward environment that the others seemed to be picking up on as well.\r\n\r\nHonestly, I tried to give him the benefit of the doubt at first thinking maybe it was just his demeanor or it was all in my head but as the interview progressed the condescending tone became prevalent in all his comments. I also noticed that he glared at me without breaking gaze throughout the interview which was extremely uncomfortable. At the end, he informed me that it was unprofessional that I had not researched every single PI in the room and knew exactly who they were and what work they had done before showing up. I am no stranger to the scientific community and the expectations of it, so while I absolutely agree in theory, for this situation I did my due diligence for the individual I was under the impression I would be meeting with.\r\n\r\nThe next part was a tour of the lab area. The lab manager showed me around the facility, introduced me to lab assistants and other employees and asked me a round of questions himself. He was super down to earth and relaxed so these questions were not difficult at all.\r\n\r\nI think in total, the whole process lasted about 4 hours. I have been in the professional world for 10+ years and through countless interviews on the job hunt for the majority of this year. I have never left an interview with tears of frustration before.  \r\n\r\nI was told by Dr. Smith himself, that I would be contacted about the position, no matter what the decision about my candidacy. It's been 4 months. I'm assuming I didn't get the job.", "Interview Questions": "What qualities do you appreciate in management?"}], [{"date": "16 Jul 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Midwestern University", "Interview Descriptions": "Set aside a whole day. I've never had a longer interview in my life. You will talk to HR, PIs in the department (some departments will split that part into multiple segments), and then you will also likely talk to current lab staff. It's a lot of the same questions over and over, but be prepared for several hours.", "Interview Questions": "How are you at multitasking?"}, {"date": "25 Sept 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Midwestern University (Glendale, AZ) in Jul 2015", "Interview Descriptions": "Apply on-line and hope HR picks your resume to send on to the department hiring manager.\r\nIf the hiring manager selects you, HR sets you up for any skills testing needed, an HR interview and then an interview with the department manager.  It can take weeks after you submit your resume and weeks after you interview to hear anything back.", "Interview Questions": "Describe a time when you had a conflict or disagreement with an employee or supervisor."}, {"date": "8 Apr 2017", "title": "Standardized Patient Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Midwestern University (Glendale, AZ) in Jun 2015", "Interview Descriptions": "They play games with the person seeking a job.  The jobs do not pay very well and they want you to do so many activities before you get hired.  They play so many games.", "Interview Questions": "Why would you be a good candidate?"}, {"date": "19 May 2015", "title": "Video Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Midwestern University (Glendale, AZ) in Mar 2015", "Interview Descriptions": "I walked into the interview, and I was greeted by two people in the Media Resources department, the department head and my now-supervisor. I immediately felt very comfortable with them, and they seemed to be more interested in my past work and how I can improve the position, than whether or not I was actually qualified for said position.\r\n\r\nThe first interview seemed like more of a way to gauge my personality, while the 2nd interview definitely involved some questions the put me on the spot.", "Interview Questions": "Who was your favorite and least favorite boss and why?\r\n\r\nWhere do you see yourself in 5 years?"}, {"date": "23 Oct 2019", "title": "Clinical Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Midwestern University (Downers Grove, IL) in Jan 2015", "Interview Descriptions": "Phone interview followed with interview with faculty.  Basic questions.  Conversational and very welcoming.  Had a tour of the school as well.  Met some of the other faculty and even saw the dean.  Very straightforward.", "Interview Questions": "What is your experience."}]]