[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Dynamic & entrepreneurial", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Jul 2019", "job_title": "Fundraiser in London, England", "duration": "N/A", "pros": "Street Child is rapidly growing (not least because two other charities have merged into Street Child in the past 18 months)  meaning it is highly dynamic and you get lots of new/different experiences through this.  However, despite the growth, it's still small enough that you get to be engaged with all aspects of the organisation so it's a good place to understand the bigger picture.  It's also really entrepreneurial meaning you get lots of hands on experience.", "cons": "It's not a highly structured organisation which means it isn't for everyone."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Incompetence from the top down", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Apr 2021", "job_title": "Manager in London, England", "duration": "N/A", "pros": "Amazing cause with great local partners\r\nImpact", "cons": "Zero leadership from the top \r\nNo core values\r\nNo plan/idea of how to achieve grow anything meaningful in UK\r\nTeam management and structure non-existent\r\nRunning joke that no org structure has been seen by the board"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A great place to start in development...", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 May 2020", "job_title": "Fundraiser in London, England", "duration": "N/A", "pros": "Street Child is a really dynamic and fast-paced organisation that can offer amazing opportunities to anyone looking to get their foot in the door in INGO work. \r\nYou will have the opportunity to gain a lot of responsibility quite quickly and carve out your own path, adding real value and impact.", "cons": "The organisation, like many rapidly growing companies, suffers from some management issues and staff welfare is not a huge priority so turnover is very high.\r\nThere are serious challenges with data-management and internal communications, in part due to the high staff turn-over and a succession of organisational mergers.\r\nShort-term thinking, entrenched staff hierarchies and biases are part of the challenge!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Quality staff and work poisoned by a toxic CEO.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Mar 2020", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Street Child is a UK-headed charity that provides education capacity to schools, students and families in Afghanistan, Bangladesh, Burundi, Democratic Republic of Congo, Kenya, Mozambique, Liberia, Nepal, Nigeria, Rwanda, Sierra Leone, Sri Lanka and Uganda. \r\n\r\n \r\nFirst impressions are very favourable, as at ground-level staff are so kind, hard-working and passionate, but I'd advise reading the cons section as on closer inspection Street Child has worrying blind spots that should be taken seriously if you are considering working here. I cannot recommend it if you have any pre-existing mental health problems.\r\n\r\n\r\nIts work around education has been delivered more effectively in terms of impact and cost than many other larger, better-known and better-funded charities. It has done so in some extremely challenging political, geographic and economic environments.\r\n\r\n\r\nIn-country, teams are often highly engaged, made of up passionate and very hard-working locals.\r\n\r\n\r\nThe CEO has a clear vision of the organisation's mission.\r\n\r\n\r\nEvery year, the charity organises the Sierra Leone Marathon and other large events. This is an impressive feat, especially when you consider the logistic challenges the small team face every year bringing these events to life in a crowded market.", "cons": "The CEO actively describes and treats staff as replaceable, and this filters down throughout the entire culture of the company, which at its worst is a Stockholm syndrome/siege type mentality. Discipline is sometimes delivered in aggressive and/or bullying personal emails rather than through any formal process. Staff have been expected to pay for his meals when visiting in-country when they have not even been paid on-time. People who challenge the CEO's ideas or faults are swiftly shut out or asked to leave, costing the organisation talent, diversity and skills it needs to deliver and fund its work. This has the knock-on effect on its industry reputation. Company-wide problems with culture, pay, recognition, morale, benefits, and structures are widely ignored in favour of a vision that seems focussed on expanding into as many countries as possible and raising funds, rather than realising staff are the pillars and boundaries of these efforts.  The senior management largely enables this to protect their own positions and sanity, institutionalised to the CEO's personality.  Staff have great solidarity as they need it to cope with the toxic trickle-down stress from rudderless, chaotic and demanding management trying to cope with his last-minute changes and need for control.\r\n\r\n\r\nThere is sometimes some superficial concern for staff wellbeing but the lack of any HR department shows this for the lip-service it is, and how little real change happens. There are examples of this where health and safety have become an issue, but never dealt with in a thorough enough way. This is the major factor preventing Street Child from becoming a great charity. People are not genuinely valued from the top down and this creates a  dissonance between its mission and its culture.\r\n\r\n\r\nThe charity industry exploits young people and interns, and Street Child is no exception. Young unpaid interns are kept on for months past agreed terms. International volunteers are poorly recruited (ie without suitable qualifications) or poorly managed, left to navigate vague expense systems and complex team politics with little to no formal structures or support. Turnover is high as people leave for greener pastures; those that stay can experience chronic stress or mental health problems like anxiety or depression.\r\n\r\n\r\nStreet Child is quick to champion its local teams verbally and at fundraising events, but in reality, it is telling that they are poorly paid and poorly supported by its comparatively well-paid leadership. Too often Street Child lauds itself for delivering cost-effective projects without acknowledging it is the staff who bear that burden with very low, breadline wages; the job itself is expected to be the reward, but leadership seems blind that the job needs to be well-supported and recognised to be rewarding. As a result,  in some cases, instances of corruption and chronic in-fighting have developed.\r\n\r\n\r\nAs often they are unable to find other opportunities in-country, some local staff can stay on for years disengaged and undervalued. This can affect the quality of work being delivered, as well as eroding any initiative to innovate and affect positive change. Promotions are made seemingly on goodwill rather than genuine qualification, leaving low morale that discourages staff from doing their best work. They are often expected to deliver very high standards from leadership who do not embody those standards themselves, and often this ask comes without the appropriate funds, recognition or suitable compensation. Those that can find better opportunities move on, again costing the organisation invaluable experience and skills. This is tragic as often these are passionate and well-qualified staff who care deeply about the work. Priority is sometimes given to high-profile donors visiting projects in-country rather than ensuring the capacity is supported in the first place."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Chaotic and terrible leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Oct 2019", "job_title": "Fundraiser in London, England", "duration": "N/A", "pros": "It’s a growing team and everyone tries their best", "cons": "It’s a clique, with members of the same family in the most senior positions.\r\nLeadership aren’t around much as they travel and work at home and so trying to get anything signed off is slow and painful.\r\nStaff aren’t respected or valued.\r\nStaff are mainly taken on lengthy unpaid contracts before getting employment.\r\nLong hours and constantly being set unachievable targets."}], []]