[[{"date": "17 Mar 2023", "title": "Sales Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at New Alternatives", "Interview Descriptions": "All online and no one responds so what’s the point . Or endless questions and surveys . Never ask questions or even call people back So I guess I don’t have a clue what to say", "Interview Questions": "No questions asked just nothing else"}, {"date": "5 Jul 2022", "title": "Editor/Executive Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at New Alternatives (Imperial Beach, CA)", "Interview Descriptions": "The hiring manager is very sweet, very easy interview and conversational. Unfortunately this position is a bachelor’s degree req for $20 max salary, and there is NO room for negotiations. Based on the market and current inflation-  this position is very underpaying for the amount of work you’d put in.", "Interview Questions": "Tell me a little about yourself"}, {"date": "11 May 2022", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at New Alternatives", "Interview Descriptions": "Sales and marketing professional with domain.............\r\nChannel sales marketing professional with vehicle required own two wheeler licence About self introduction to your About self introduction to your \r\nIndividual house for sale", "Interview Questions": "About self introduction to your\r\n"}, {"date": "26 Jan 2022", "title": "Sales Associate/Cashier Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at New Alternatives", "Interview Descriptions": "It went very well and they loved my energy this also wanted me to work and have many opportunities and also work with other companies and have more raised for them", "Interview Questions": "What made you want to work with us "}, {"date": "20 Jul 2021", "title": "Childcare Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New Alternatives", "Interview Descriptions": "Super laid back and funny.\r\nDon’t be afraid to show your personality!\r\n\r\nI got an interview and was hired on the spot, then once my background check was cleared I had to do a drug test and physical.", "Interview Questions": "Asked why I want to work there "}, {"date": "3 Sept 2020", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at New Alternatives", "Interview Descriptions": "Was referred to the job, had a video interview with a supervisor. Pleasant conversation, went over details of the position and the daily requirements. Was able to ask anything about the position, as well as pay.", "Interview Questions": "What is your experience working with troubled youth?"}, {"date": "11 Jun 2019", "title": "Mental Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at New Alternatives", "Interview Descriptions": "2 interviewers, group interview ask a bunch of questions fill out paperwork easy as hell. You have to fill out the background yourself and drive to mission valley to submit. They call you back once it is finished. Simple to the point", "Interview Questions": "Name a situation where you were stressed how you handled it?"}, {"date": "30 Nov 2021", "title": "Product Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New Alternatives (Bengaluru) in Jan 2019", "Interview Descriptions": "It was awesome the interviewer was so cool & friendly also .. executive also gave good support during the process, the time also very good . They value each candidate & respect theme . whether they are doing or bad at interview they treat well", "Interview Questions": "Why hr why not any other"}, {"date": "28 Sept 2018", "title": "Child Care Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at New Alternatives (Chula Vista, CA) in Sept 2018", "Interview Descriptions": "You submit your application online, get called to set up job interview, fill out paper interview, and then continue on to your in person interview.  If interview goes well you get your fingerprints live scanned and then will receive a call with a decision", "Interview Questions": "If I felt comfortable working with SED children"}, {"date": "26 Jan 2018", "title": "Behavior Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New Alternatives (San Diego, CA) in Jan 2018", "Interview Descriptions": "Arrived at the main office filled out basic paperwork. This was about an hour long interview divided into the job description, my questions regarding the job and the interviewers' questions for me. Overall good experience. Professional. Jeniffer my interviewer made me feel very comfortable anf like I could relate to her.", "Interview Questions": "What have your past employers critiqued as your strengths and weaknesses? "}], [{"date": "6 Jul 2022", "title": "Child Care Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at New Alternatives (Costa Mesa, CA) in Jan 2018", "Interview Descriptions": "Questions about educational background, experience working with children, what are your hobbies. They describe the job duties and responsibilities, if you accept they send you to get a background check, send you to orientation and train for two weeks.", "Interview Questions": "Tell us about yourself, do you have experience working with children? What are your hobbies? Educational background? "}, {"date": "10 Mar 2017", "title": "Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at New Alternatives (San Diego, CA) in Mar 2017", "Interview Descriptions": "The interview process was pretty straight forward. I was given a thorough description of the job duties and the populations served, and then was asked about my experience. The interview ended with a series of short verbal vignettes that I answered verbally, which was probably the most note-worthy part of the experience. The interviewer was kind and very personable, which was nice. Overall I would suggest just making sure you study the specifics about the agency and come prepared to show your knowledge in the vignettes.", "Interview Questions": "Describe how you have handled a crisis situation in the past."}, {"date": "5 Sept 2017", "title": "Child Care Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at New Alternatives (Chula Vista, CA) in Feb 2016", "Interview Descriptions": "The residential manager conducted the interview. An application was given that consisted of questions, situations, and developing a treatment plan (although the job has nothing to do with treatment planning).", "Interview Questions": "What have you heard about the company? What was your previous experience related to this job? What would you do in certain situations?"}, {"date": "2 Jun 2016", "title": "TBS Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New Alternatives (Chula Vista, CA) in Jan 2016", "Interview Descriptions": "Long but it has to be since you are working with children and very detailed. A lot of paper work mainly on what you will be dealing with and making sure this is what you want to work for.", "Interview Questions": "Do you live close by? since the hours available are at night. Work experience? Where did you grow up?"}, {"date": "11 Jan 2017", "title": "Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at New Alternatives (Escondido, CA) in Jul 2015", "Interview Descriptions": "The interview was for a position at the San Pasqual Academy. The interview consisted of me filling out a lengthy form (approx. 20 minutes), followed by a one-on-one meeting with the person who would have been overseeing me (approx. 40 minutes). I arrived about 10 minutes early for the interview, and was only told at that time that I needed to fill out the form, which consisted of questions about my previous work experience, credentials, etc... all of which could be found on the copies of my resume that I brought to the interview. The form seemed redundant, and it also delayed the actual one-on-one meeting, which left me feeling flustered/rushed to get through the form. New Alternatives should inform applicants ahead of time that they should arrive 30 minutes early in order to complete the form, or at least make it clear that the form is part of the interview process, so as to put applicants' minds at ease. The one-on-one meeting was fine, but I never heard back about whether I was accepted or declined. I sent a \"thank you\" e-mail within 24 hours of the interview ending, and it would have been nice to get a response of some kind.", "Interview Questions": "They asked typical questions... \"What's your theoretical orientation?\", \"What would you do if you had a problem with a co-worker or manager?\", etc."}, {"date": "25 Apr 2017", "title": "Mental Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at New Alternatives (Vista, CA) in Apr 2015", "Interview Descriptions": "it was not too difficult but they do want to know your experience with children and how you get along with co workers. Also if you are willing to work overtime", "Interview Questions": "what is your experience with kids"}, {"date": "22 Sept 2016", "title": "Child Care Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at New Alternatives (Escondido, CA) in Mar 2015", "Interview Descriptions": "Weekend pm shift is starting position. \nCasual interview. \nCalled me several times to see if I wanted the position. Seemed as though they wanted me more than I wanted to be there. \nAlso I was not told I need cook. (Other interviewees were told) \n2+ weeks of training.", "Interview Questions": "If a child is about to awol, another two are fighting, and another threatening suicide, who would you help first."}, {"date": "30 Sept 2015", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at New Alternatives (Costa Mesa, CA) in Jan 2015", "Interview Descriptions": "Program director asked specific real life situation questions. I was asked about my experience with kids and how I respond to things under pressure. I was asked about my availability and my willingness to be d team player. I was asked about previous job experience and about where I went to school and why I want to work in the social services field. I was asked other things that I can not remember now.", "Interview Questions": "How many years of experince do I have with kids"}, {"date": "9 Apr 2015", "title": "CCW Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at New Alternatives (Chula Vista, CA) in Mar 2013", "Interview Descriptions": "Make you wait for ever in lobby an some questions are really dumb interviews more staff at interview like a panel ask better questions describe the job better for the units more of the truth", "Interview Questions": "If kids fight"}, {"date": "19 Nov 2012", "title": "Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at New Alternatives (San Diego, CA) in May 2011", "Interview Descriptions": "You will usually have an interview with 2 or more staff members. They will ask you a series of questions regarding what you would do in certain situations. Just answer honestly, the questions give you a better understanding of what you might encounter on the job. If the interview goes well, you will have to complete a background check including a drug screening, fingerprinting and a dmv printout to verify you are a good driver.", "Interview Questions": "N/A"}]]