[[{"date": "21 Apr 2023", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CSU Global (Redlands, CA)", "Interview Descriptions": "Interview was straight forward - vibe was a little off. But it could be the right opportunity for the right person who wants to work remotely. Hard to read clearly but I think work is simple enough, yet challenging at the same time.", "Interview Questions": "Tell me about yourself question."}, {"date": "29 Apr 2022", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at CSU Global", "Interview Descriptions": "Easy third party. Unimpressive 2 rounds of interviews. And then a role play where you got to overcome obstacles and walk a student through the enrollment process. And then from there they sit and do nothing.", "Interview Questions": "How do you overcome student objections?"}, {"date": "23 Jan 2021", "title": "Marketing Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at CSU Global", "Interview Descriptions": "Overall, this one of the single worst interview processes I have ever experienced. I believe that interviews are a reflection of company culture, and if my experience is at all typical - RUN. Do not apply for a job here. \n\n1) I applied for a different position and was shortly notified that while that position was not a fit, they had another job for which they were \"very excited\" about me as a candidate. They asked me to apply, so I did. \n2) The first interview was a one way video recording - awkward but manageable. And online platform present questions, you answer them on video and the recording is sent to the hiring manager. \n3) Within days, I am invited for a 2nd interview. I was contacted on a Friday morning,  the interview was planned for Monday afternoon. \n4)For this, they asked me to prepare a 15 minute presentation on a marketing plan for their business. It is not easy to write a marketing plan for a business based only on outside knowledge. I spent at least 10 hours researching, writing, and preparing a presentation (the entire weekend - since I only had 2 days notice on the interview).\n5) The interview is a video call, and of the 5 people on the panel only two of them had the decency to turn on their cameras. The hiring manager did not even have his camera on. Insulting and unprofessional. \n6) I receive a follow up a few days later requesting \"letters of recommendation\". This was an odd request that I have not received from any other company. I told the HR person I would need to request those from my contacts, and then sent 4 letters within a few days.\n7) I received NO acknowledgment that my letters had been received until I followed up a week later. At that time I was told that I would hear from them withing the next week. \n8) Nothing. No calls, no contact. Its been over 2 months, and they simply ghosted me. \n\nUtter B.S. if you ask me. I understand if I am not the right fit for the job, not hurt feelings here. But TELL me that. When you ask a candidate to put in as much work as I did for an interview process, you owe them the basic human courtesy of a follow up. \n\nI strongly advise future applicants to avoid this company. The way they treat candidates is unacceptable and not a good indication that they would treat employees any better.", "Interview Questions": "Prepare a presentation for the interview panel. Other than that, questions were fairly typical of a marketing interview. "}, {"date": "12 Jan 2021", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CSU Global", "Interview Descriptions": "A virtual interview. Questions were kind of pointless and tricky, but not the worst interview. It's a very impersonal hiring process, and the software has a lot of setup required to do the virtual interview. You also only get one attempt per question as compared to other places who usually let you have at least one redo to record.", "Interview Questions": "Tell me about a time you had a problem at work."}, {"date": "11 Nov 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at CSU Global (Aurora, CO) in Aug 2020", "Interview Descriptions": "Preliminary screening begins with a video interview, then they schedule a live panel interview, and it ends with a cultural interview with VP or above. The process is complete very quickly, and you will start your job 2-4 weeks from the offer date.", "Interview Questions": "Why CSU Global is the most important one--do your homework. What motivates you? What de-motivates you? "}, {"date": "15 Apr 2020", "title": "Enrollment Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at CSU Global", "Interview Descriptions": "video response.\r\n- responding to a series of questions with a 1 minute warning, and 1-2 minute recording time, no retakes\r\n- zoom interview and mock student call, where you solve some questions student has,", "Interview Questions": "how you would dandle not meeting expectations"}, {"date": "24 Jul 2019", "title": "Associate Enrollment Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at CSU Global (Greenwood Village, Arapahoe, CO) in Jul 2019", "Interview Descriptions": "Started off like a normal process. Screening call with HR and then moved on the Mock Interview. They give you tools to prepare but it's still nerve wracking with no training. From there you move to panel interview which is an hour long where they learn more about your experience and how you handle situations. Before this you also have a mock email response you have to write up, and afterwards an online assessment. Then a final 15-30 minute video interview with the Director. Generally it was a very pleasant experience till the end. They told I'd hear back by a date and 24 hours after that passed I emailed them to check in. No response for over 24 hours. 6 hours after that I got what seems to be an automated email saying they moved forward with a different candidate. It was a very extensive process and required a lot of preparation and effort. I have nothing negative to say about that; however, they fact that it took so long for them to respond to me at the end of these 6 weeks where I dedicated my time to preparing for these steps, to get an automated response, was honestly very frustrating. It feels a little disrespectful after I put in all this time.", "Interview Questions": "What do you know about this role?"}, {"date": "19 Nov 2018", "title": "Course Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at CSU Global (Denver, CO) in Nov 2018", "Interview Descriptions": "Two versions: video and team. They could not get their online skills test to work so it was never administered. Overall, seems more like daily crisis management than an organized and productive workflow. Interview team brings laptops to the interview and they surreptitiously message one another back and forth during the meeting. Suspect there was age discrimination going on. Have also read some pretty negative reviews of this organization on Glassdoor, so not completely sure about the good health of the culture there. Lesson learned: don't ignore the red flags, and there seem to be a quite a few of them here.", "Interview Questions": "Asked what problem I had working remotely."}, {"date": "12 Oct 2018", "title": "Compliance Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CSU Global", "Interview Descriptions": "I interviewed via telephone and did a final in-person panel interview. Their expectations were unrealistic and they did not have much to offer applicants. The pay was mediocre for the expectations they had. They also were terrible at providing a decent interviewing climate. They really need to get it together. They are definitely not a company I would recommend.", "Interview Questions": "Describe your audit experience. "}, {"date": "30 Dec 2019", "title": "Enrollment Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at CSU Global (Greenwood Village, Arapahoe, CO) in Aug 2018", "Interview Descriptions": "Very extensive interview process that consisted of 1 phone interview (45 minutes), 1 performance management project, phone call review/scoring (45 minutes), 3 in-person panel interviews (60-90 minutes in length), Cultural interview (30 minutes) and performance assessment (1 hour). I have never had to endure such an extensive interview process.", "Interview Questions": "How do you deal with ambiguity?"}], [{"date": "17 Jul 2018", "title": "Enrollment Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CSU Global (Greenwood Village, CO) in Jun 2018", "Interview Descriptions": "The interview process was very in-depth from start to finish. CSU-Global had some issues when they hired enrollment counselors that were new the job without enough explanation of how involved the position was, so they have since learned their lesson and created a better interview process to make sure they were bringing in the right fit for their school and this position. I had four interviews total including a pre-qualification call, a mock phone call, a Zoom interview with the Director of Enrollment and another colleague, and a Zoom meeting with the Senior Director of Enrollment Management. \r\n\r\nCSU-Global has a bad rap on Glassdoor, and I went into these interviews very skeptical. But, they met me head on and owned the issues that they had in the past. Admissions is a fast-paced environment and it requires the right fit, especially for a remote position. They made expectations VERY clear and made sure that I knew what I would be held accountable for before even offering me the position. I have had interviews in the past that barely covered the actual job before offering me the position and that resulted in a bad outcome! Had I not been offered the opportunity to work remotely at my current position, I would have accepted this position with CSU-Global whole-heartedly. Everyone I met with was sincere, proud of their work, and transparent. I was blunt and outspoken about the issues I read about online, and that not only did NOT deter them from hiring me, but actually made them respect me more as a potential employee.", "Interview Questions": "Tell us about your experience in a high demand, high volume position? "}, {"date": "16 Apr 2018", "title": "Associate Enrollment Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at CSU Global (Greenwood Village, CO)", "Interview Descriptions": "Its an exhaustive process that can take in excess of 5-6 weeks before any affirmative decision is heard. Here is the general sequence of events:\r\n\r\nSubmit Application > HR Reaches Out/Determines Interest > Mock Scenario Call/Exercise > Panel Interview (2-3 People)> IQ/Personality Assessment > Phone Interview with Executive Management\r\n\r\nThe mock scenario consists of them sending you information and resources prior to a mock call scenario. Essentially, someone will call you pretending to be a student and you a enrollment counselor. You will be asked questions and must show good salesmanship, as well as confidence in your answers. Make sure you review all the resources and links they send you.\r\n\r\nAll other aspects of the interview process are straightforward, typical interview components. Upon completing the final interview with executive management, you will thanked for your time and advised that a decision will be made. \r\n\r\nOverall, my experience with the process wasn't pleasant. For such a lengthy process, their HR department needs to improve communications with applicants. I was told several times I would hear something by this day, or that day, but never would I receive timely notification by the deadline they provided. It really is discouraging throughout the process.", "Interview Questions": "Conducted mock phone call where an individual calls you and you pretend to be an enrollment counselor. Prior to the call, you will be sent links/resources to study the scenario for the program and school. "}, {"date": "9 Mar 2018", "title": "Enrollment Specialist Remote Interview Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 8 weeks. I interviewed at CSU Global (Portland, OR) in Feb 2018", "Interview Descriptions": "What a mess. After reading all the reviews on here and looking at some of the previous employees, I am thankful I have dodged a bullet. First off, the interview process is very out dated with a 5 steps to get hired. First you have a HR interview, then a phone call with a  manager to try and enroll a student930-45 mins long), then a video interview with 2-3 managers or directors( hour long), then an assessment, then a campus president interview.  At first I was just going to let all of this slide and be a good person and try and get through this process. Let me remind you, the position I was interviewing for was a remote position, yet the questions I was being asked had nothing to do with working from home or being able to help a student through the process of getting there education. CSU has a a grading scale they use on the interviews where you have to get 85% or you do not move forward. I was told this has never failed them , but It seems with all the turn over and people not happy with the company, the culture is the biggest issue. A score should not define ones ability to work for a company, but maybe have some ability to spot some talent and not be lazy and revert to some score or game. My 10+ years of education I was willing to take to CSU, but they sent some typo driven email to me saying they have went with other candidates for the jobs.  maybe have a little more ability to spot talent and pick it rather then use some system that is filled with many holes and disadvantages for the University. I was passionate, excited, talented, and ready to be a CSU global employee, but never got the chance to. Focus on core values, abilities, character traits and use some Gut feeling.", "Interview Questions": "Do you have day care for your children, it is required? How many dials in a day, talk time, enrollments each month I have? CSU Global operate more like a for profit with goals metrics, and numbers, is this something you are able to work with and adapt to? What is your sales Technique?  and ETC"}, {"date": "12 Jan 2018", "title": "Fully Remote Tuition Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CSU Global (Tampa, FL)", "Interview Descriptions": "I was called just to see if I would be interested in an interview and I was.  I was then told that I would be contacted by the end of the following week either way.  I never heard from anyone.  From the reviews I am seeing on this place, it looks like I dodged a bullet here though, so I am thankful for this.", "Interview Questions": "N/A"}, {"date": "13 Oct 2017", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CSU Global (Colorado Springs, CO) in Oct 2017", "Interview Descriptions": "I was asked to respond to a mock students email. Then was asked to have a phone conversation with a mock student. I was passed to the third round and received a zoom call interview. There was a panel of professionals who asked a series of questions which lasted for 30 minutes.", "Interview Questions": "Please describe a supervisor that you had that you felt was great."}, {"date": "5 Apr 2017", "title": "Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at CSU Global", "Interview Descriptions": "There was a video interview component, as well as in person.The people were very nice, it is a classy place. The whole process was pretty fast, especially for higher ed.", "Interview Questions": "Why are you interested in this position?\r\n\r\nWhat training or development have you done to prepare you for this role?\r\n\r\nPlease provide an example of a time you had to work with another department \r\n\r\nHow will you go about helping your team meet their goals?\r\n\r\nWhat questions do you have for us?\r\n"}, {"date": "14 Jun 2016", "title": "Career Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at CSU Global (Greenwood Village, Arapahoe, CO) in Jun 2016", "Interview Descriptions": "So long!  I had 3 interviews: online, a telephone mock counseling session, and then an in-person presentation, with several of the interviewers were online, put up on screens in the interview room. I was asked to present on my vision for the center, and they said I had good ideas, and good ideas don't tend to sit on the shelf at CSU Global.  Whatever that means.  The process is, honestly, pretty aggravating if you either don't get the offer or decide you don't want the job.  It's a huge investment of time.", "Interview Questions": "A time I saw a project through, from concept to execution"}, {"date": "28 Apr 2016", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at CSU Global (Denver, CO) in Jul 2015", "Interview Descriptions": "I had been brought on as a contractor, which is how CSUG hires engineers so there was no interview to speak of before my full time hire.  I had worked with the software architect at a previous position so there was no interview to speak of when I was hired as a contractor.  When I hired others developers it was really hard because I had no say in the process, I was just there to evaluate the candidates technical skills.\r\n\r\nIf you do not have a PhD your opinion does not count at CSUG.", "Interview Questions": "N/A"}, {"date": "30 Dec 2015", "title": "Associate Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at CSU Global in Mar 2015", "Interview Descriptions": "Essentially, you speak with a recruiter, then the director for a welcome call, have a mock interview with a manger, and then a third email.  They try to get a grasp of your level of commitment with education, as well as your communication skills with the students.", "Interview Questions": "Is this job sales or not?"}, {"date": "5 Aug 2015", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at CSU Global in Feb 2014", "Interview Descriptions": "3 stages with mock call.  One remote and two in person but their process has since changed.  Candidates now interview the Trainer, Enrollment Manager and Director then will meet with the VP. Mock calls are still done after an initial phone interview. All questions are geared around what you bring to the table and how you can add to the team and their culture.", "Interview Questions": "All questions are geared around what you bring to the table and how you can add to the team and their culture. They do not ask standard interview questions.  When i was applying I interviewed with both enrollment managers, 4 out of 6 of the team leads at the time, and the VP of enrollment.  Their process has since changed."}], [{"date": "18 Nov 2013", "title": "Enrollment Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at CSU Global (Greenwood Village, CO) in Jul 2012", "Interview Descriptions": "3 step process. Mock call reviewed by team leads, meet with all team leads then final interview with VP of employee engagement and HR.", "Interview Questions": "Best accomplishment outside of work."}, {"date": "24 Jun 2012", "title": "Admissions Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CSU Global (Denver, CO) in Jun 2012", "Interview Descriptions": "I applied for the job online and received a response after 2 days. I was called and we set up an interview. I only had one interview with the woman who would be my supervisor and the woman who would be my manager. They had questions that they had to ask (they had them written down on paper) and the two took turns asking questions. Everyone dressed in a corporate casual style. I didn't see people really talking to one another, everyone was working.", "Interview Questions": "How did you go above and beyond at work on your own when you weren't expected to?"}, {"date": "6 Sept 2015", "title": "Registrar's Office Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at CSU Global (Plainview, TX) in Sept 2011", "Interview Descriptions": "At the time, I was interviewed over the phone by three people. This was at the beginning of the school's opening so things were much simpler and informal. Today, the interview process would be much more complicated. The administration demands that the interview process be time-consuming and complicated. Don't be surprised if the position is eliminated or if administration sticks their nose into the process. You will probably be required to meet with the director and the president.", "Interview Questions": "They asked about organizational skills and goals. Today, you will probably be required to take a skills test and phone test. They will ask about organizational skills, etc. They will use the canned interview questions in a committee setting. I don&#039;t know how much information they will give you but it will be deceptive. The benefits are great but they will not be truthful if you ask about the office environment."}]]