[[{"date": "18 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PAM Health (Sarasota, FL)", "Interview Descriptions": "Standard process and interview. They offer referral bonuses and make the application process easy. It is a small hospital and you probably will get screened by HR then interviewed by the CNO.", "Interview Questions": "Describe your clinical skills and experience."}, {"date": "13 Jun 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at PAM Health (Austin, TX)", "Interview Descriptions": "easy process. standard questions that are expected in this role. Tell me about a time when... Tell me what you would do it this XX happened, etc. What would you do if XX happened, how would you respond", "Interview Questions": "situational questions that a nurse encounters"}, {"date": "18 Mar 2023", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PAM Health", "Interview Descriptions": "Very quick and straightforward. It wasn’t bad at all. They asked the general questions and if you’re experienced and professional you should know how to answer them. Be honest. It’s not hard if you know your stuff.", "Interview Questions": "What are your goals and this field."}, {"date": "24 Mar 2023", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at PAM Health in Mar 2023", "Interview Descriptions": "Upon arrival, I was provided with a tour of the facility. Then, I interviewed with the therapy manager, discussing reason for wanting the job, strengths, experience, and salary. It was a quick and pleasant interview.", "Interview Questions": "Why do you want to work in rehab?"}, {"date": "23 Mar 2023", "title": "Clinical Navigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PAM Health (Jupiter, FL) in Feb 2023", "Interview Descriptions": "Applied online, was called for interview for next day. Met with CEO and Director. They wanted to move forward and said I just needed to interview with Corporate. The next day, i had video call with Corporate. Then was called that i needed another interview with VP. She was three hours late calling me back and i was driving conducted interview (unprofessional) I was ghosted no call back, no reply to emails and was told they would contact me in a few days. The Corporate team were not genuine . When i asked the VP questions she gave me terrible responses, like she was trying to scare me off, well it worked. Never heard back from them any way. They should state the exact qualifications they are looking for and not waste candidates' time.", "Interview Questions": "What is your clinical experience working for and with hospitals?"}, {"date": "17 Jan 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at PAM Health", "Interview Descriptions": "Open forum , cno and Human Resources . Very easy process , they ask general questions and show you a tour of the hospital. No benefits or hourly wage discussed until an offer letter", "Interview Questions": "Name a difficulty task you have over come"}, {"date": "16 Dec 2022", "title": "Licensed Vocational Nurse (LVN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at PAM Health (San Antonio, TX) in Dec 2022", "Interview Descriptions": "I turned up a day early for the hiring fair by mistake. The nurse manager and HR rep both took the time to talk to me and conducted an impromptu interview and tour.", "Interview Questions": "How long I've been a nurse, experience from past jobs, educational goals, etc."}, {"date": "9 Nov 2022", "title": "Certified Occupational Therapist Assistant (COTA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PAM Health", "Interview Descriptions": "Applied directly through the PAM health website. Someone contacted me ~2 weeks later for an interview. The actual interview was fairly laid back- general questions about self and work experience and then was able to have a tour around the facility.", "Interview Questions": "Q: What settings/population do you have most experience with?"}, {"date": "15 Aug 2022", "title": "Rehab Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PAM Health", "Interview Descriptions": "The staff was friendly, asked me thorough questions about my experience and I received a tour afterwards! They were understanding of my medical challenges and able to accommodate me accordingly.", "Interview Questions": "What were your responsibilities as a rehab tech at your other facility?"}], [{"date": "7 Apr 2022", "title": "RRT/RCP Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PAM Health (Overland Park, KS) in Jan 2022", "Interview Descriptions": "Meet director, meet staff, talking to everyone. Everyone was pleasant, friendly. I was showed around the facility, different departments, especially the respiratory care department, the lab and xray departments. Also met CEO, CCO, ect.", "Interview Questions": "Typical questions nothing hard no pressure at all"}, {"date": "7 Dec 2021", "title": "Executive Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PAM Health", "Interview Descriptions": "the interview process was 4 stages with various members of PAM Health.  The interviewers were very thorough and inquisitive asking all the right questions to find the best fit for the position and company.", "Interview Questions": "Describe your most frustrating trait"}, {"date": "18 Sept 2022", "title": "Director of Nursing Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at PAM Health (Denver, CO) in Dec 2021", "Interview Descriptions": "Disjointed, rescheduled, and lacked professionalism. I was emailed and called, shared my availability, discussed HR process and who I would be meeting with for the interview. Previous DON was still in the position so I was asked to be discrete as they wanted to find a replacement and then abruptly remove the DON. ", "Interview Questions": "Leadership based and financial focus, primary objective was how can I as a leader work more with less due to staffing issues in healthcare today."}, {"date": "2 Aug 2021", "title": "Payroll Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at PAM Health", "Interview Descriptions": "Lacking knowledge of the company; did not provide any information that could not be read online.\nNot enthusiastic or clear\nUnable to give information on benefits\nCould not provide company goals for future.", "Interview Questions": "How do you prioritize your work?"}, {"date": "15 Jul 2021", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at PAM Health", "Interview Descriptions": "Professional, short. They were in need of therapists and I was recommended by another therapist who knew the DOR, so the basics were covered as a formality. The DOR and HR Director were friendly. It was an efficient interview.", "Interview Questions": "How do you encourage a patient who doesn’t want to work in a therapy session? "}, {"date": "8 Apr 2022", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PAM Health in Jul 2021", "Interview Descriptions": "Very laid back and comfortable, typical questions (\"What qualities make you stand out\" \"What are your expectations\") Followed by a facility tour and introduction to team members. It was a warm and friendly atmosphere", "Interview Questions": "If I had any experience working with traumatic brain injury patients"}, {"date": "10 Apr 2021", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at PAM Health", "Interview Descriptions": "The interview was in person, I met the team and the leadership/ management, and went on a tour of the facility. It was very personal and I enjoyed the experience.", "Interview Questions": "What are your strengths and weakness?"}], [{"date": "3 Mar 2021", "title": "Speech Language Pathologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PAM Health", "Interview Descriptions": "Interview included a over the phone interview with the rehab manager and then followed by an in person interview. \n\nThey asked about my specific skill set and experience with EMR.", "Interview Questions": "They asked my experience regarding modified swallow studies"}, {"date": "13 Jan 2021", "title": "Physician Navigator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at PAM Health", "Interview Descriptions": "I met with the DSI and one of the CEO s of our hospitals. It was a breif interview in a room the size of a closet. They asked how I could handle upset doctors and that is pretty much all I remember. The CEO as it turns out didnt even work for the hospital I was interviewing for. My CEO did not bother to show up to interview me.", "Interview Questions": "How would you handle physician complaints?"}, {"date": "1 Dec 2020", "title": "Communication Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at PAM Health", "Interview Descriptions": "Welcoming and easy going. They understood my situation and reassured that I’ll be okay and they’ll work with me. They showed compassion and understanding of the covid-19. They made me feel good and comfortable.", "Interview Questions": "What’s your strengths and weaknesses in the medical field."}, {"date": "28 Jul 2022", "title": "Lpn Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at PAM Health in May 2020", "Interview Descriptions": "It was ok n o thing to crazy  went wel looking forward to working there in the future seem like a great company but too far away from where Iive", "Interview Questions": "How many hours per week"}, {"date": "31 Dec 2019", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 8 weeks. I interviewed at PAM Health in Nov 2019", "Interview Descriptions": "Interview with site ceo, then corporate director, then nothing. Was told I would hear in a week (one way or another) about position but still nothing 6 weeks later. Was very interested in position and the site ceo was excited about my candidacy. Sadly corporate seems less professional.", "Interview Questions": "Typical: tell me about a time... style questions"}, {"date": "15 Jun 2019", "title": "Clinical Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at PAM Health", "Interview Descriptions": "Took a month to receive a call back to schedule the first interview and two weeks to actually get in. After that it was a quick process. \nFYI found it odd (was fully prepared as one should be in the medical field) that there was NO drug screening. After a few weeks of being an employee I learned no one is and honestly... some people probably should be.", "Interview Questions": "Are you okay working more than 40\nHours a week if needed and weekends?"}, {"date": "7 Jun 2019", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at PAM Health", "Interview Descriptions": "Quick in person interview at Human Resources with the manager of the department as well.  Very informal and welcoming I was not nervous at all and both people interviewing me gave off a positive happy energy that made me feel at ease.", "Interview Questions": "They asked me about my schedule availablity and why I like working at that type of facility "}], [{"date": "4 Sept 2019", "title": "HR Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PAM Health in Oct 2018", "Interview Descriptions": "There was a phone screening with a recruiter from Akeso.  Then, I met with the local hospital CEO.  After that, they conducted a phone interview with the Regional HR Director and members of the corporate HR and Leadership team.", "Interview Questions": "If you are mentoring other employees, what are three things you would expect from them?"}, {"date": "24 Oct 2018", "title": "Director of Organizational Effectiveness and Team Performance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at PAM Health (Penn, PA) in Oct 2018", "Interview Descriptions": "Was contacted by Talent Acquisition. Was told that my application was specifically (the only) one selected by the hiring manager...she told me I should be excited when I sounded shocked. The interview was first issued by the hiring manager. The interview went well until she told me that I was competing against someone else that was really good and it would be a difficult decision, and to come back the following week. When returning, I had a \"staggered\" interview by some of the leadership team...not all at once, but one at a time. Everyone went explicitly into what THEY did, no real questions for me pertaining to my skill set, with the exception of one person who asked me what my first 90 days would look like as well as how I would design out a training. After speaking to them all, I was a bit foggy on what exactly the job would entail, besides maybe a glorified trainer... not \"organizational effectiveness\" type of duties were heard, but told that would be the vision eventually. \r\nThe owner of the company was great and actually ASKED ME about my Ph.D. which was a \"preferred\" requirement for the position. The hiring manager did not ask me, but I voluntarily told her.\r\nI spent over 2 hours during the 2nd interview process. Everyone gave me their cards (not sure why). When completed, the hiring manager came in with both thumbs up and seemed very excited.. told me I kept everyone engaged and everyone liked me.  She AGAIN said... it would be a difficult decision (which to me, is a way of saying you're not the one), and then proceeded to say.. well I am blessed to have two great people interview so I can't lose. Very odd. I left with uncertainty and not very excited about the position due to the feeling of wasted time and energy with the decision already really being made. The company seemed like a great place to be, but the odd feeling was a bit contradictory to the excitement of the thumbs up and then the..\" well the other person is realllly good and on point etc.\"  Very inappropriate to compare how awesome (or not) other candidates are with your interviewee.  The position also posted as needing an e-learning development piece, which was never asked of me in terms of my experience. I did send a sample of what I designed ahead of time, but was just told they don't even have the software to do it... yet.", "Interview Questions": "Tell me about your consulting experience The position posted as needing e-learning development... not asked about my experience with it, just that they don't have the software yet. "}, {"date": "15 Mar 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at PAM Health (Corpus Christi, TX)", "Interview Descriptions": "Applied for the position online. The recruiter called me within the week and scheduled me for a one-on-one interview with the CNO on the same day. She was pleasant to talk to and asked basic interview questions. She then told me that I am due for a panel interview. I got forwarded to the recruiter for scheduling. I got a panel interview with the CNO, Nurse Manager, and Charge Nurse.", "Interview Questions": "strengths and weaknesses"}, {"date": "7 Apr 2017", "title": "PTA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at PAM Health", "Interview Descriptions": "I was quick to get an interview. It happened within less than a week. However, I never heard back or got an email to state I did not receive the job. Which in my opinion is slightly unprofessional since I went out of my way for the interview and I was very interested in the job.", "Interview Questions": "I was asked about experience I did not yet have and my response was that I'm more than willing to go the extra mile to learn what I dont know. apparently that was not enough."}, {"date": "22 Feb 2017", "title": "Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at PAM Health (Tulsa, OK) in Feb 2017", "Interview Descriptions": "I was called and offered an interview. We set up an appointment for the next day. The manager had a great personality and very open about the details of the job. He listened to me tentatively and told me they'd be in touch.", "Interview Questions": "What does your experience include?"}, {"date": "7 Dec 2016", "title": "Physical Therapist Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at PAM Health (Kyle, TX) in Nov 2016", "Interview Descriptions": "For me: First there is a brief phone interview that consisted basically of general info about the position and verbally verifying the info you've supplied in your resume/on-line application. you're also given a chance to ask any questions about them or the position you may have - about 10 days out from the time I applied. If you're still interested, they then forward your application & resume to the specific facility you're applying to. \r\n\r\nOnce they receive it, they then call you in for a face to face interview - about another week or so. I was interviewed by the department manager of therapy. She was very cordial and informative and I didn't feel nervous or apprehensive during our chat. She asked the usual questions and was very informative of what was expected and how things ran there. She accepted me right after we were finished talking. \r\n\r\nHR then contacts you via email, sending you their hiring paperwork (about 10 pages) that you could either scan and email back or drop off in person - about 2 - 3 business days after interview. Once they receive that, it took another 4 business days to clear background check and references but they mentioned that it could last up to 10 days after. Once that was cleared, you get informed to come in to sign certain hiring paperwork, supply certain medical records and certs, and go through a health screen (more signing of paper work). Then they set you up for the next orientation date coming up (twice a month), which is considered your first working day.", "Interview Questions": "The usual: what are your best skills, how would you handle a difficult situation, what types of diagnosis were you most familiar with, how well you work with others/on your own, questions on your work experience and how it pertains to their setting."}, {"date": "18 Feb 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at PAM Health (Tulsa, OK) in Oct 2016", "Interview Descriptions": "Just want to low ball salery  the job discription changes after hired. No training at all you are on your own to learn.  Corporate has different answer from one another", "Interview Questions": "Skills "}, {"date": "28 Jul 2019", "title": "Cardiopulmonary Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at PAM Health (Corpus Christi, TX) in Mar 2016", "Interview Descriptions": "Peer interview with 5-6 people from various departments. They each asked me different questions. They wanted to ensure I would be a good fit for the entire team. I enjoyed the interaction with members of each department and respected the fact that the entire team had to agree with who they were going to choose for the position.", "Interview Questions": "Tell us a time when you were faced with a difficult family situation and how you handled it."}]]