[[{"date": "4 May 2023", "title": "Registered Nurse, Emergency Room Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Interfaith Medical Center (Brooklyn, NY)", "Interview Descriptions": "Disorganised as interviewers come not aware of the arrangement. However turn out to have no questions. They spent time with me in conversations and ended up making me know I would get an offer.", "Interview Questions": "What is your educational background and experience."}, {"date": "24 Feb 2022", "title": "Behavioral Health Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Interfaith Medical Center (New York, NY)", "Interview Descriptions": "When I was interviewed it was at least 6-8 people asking me questions. It was very tense for me. I was asked about 10 or more questions. While people others were asked less questions.", "Interview Questions": "What option have you given that changed the way a organization performed. "}, {"date": "23 Mar 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Interfaith Medical Center (New York, NY) in Jul 2019", "Interview Descriptions": "The interview process was informal. It was more like an introduction to the hospital and the specific department. I was introduced to the staff and my assignment for my time therer.  The hiring process was conducted through a third party.", "Interview Questions": "Did I have experience doing data entry?"}, {"date": "20 Mar 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Interfaith Medical Center (Brooklyn, NY)", "Interview Descriptions": "Three people in the panel, they asked a lot of behavioral questions. The questions were pre-prepared and they took turns to ask.  I wasn't told anything about the unit and when I tried to ask questions they didn't seem very happy, wasn't given enough information.  Not given a unit tour, enough information about the unit and the patient population was not provided.", "Interview Questions": "What are you bringing in to this hospital?"}, {"date": "1 Aug 2018", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Interfaith Medical Center", "Interview Descriptions": "It was through Summer Youth so no questions were asked of me. As long s you were of age and/or qualifications, then you would received a phone call regarding the position.", "Interview Questions": "Do you have any background experience in customer service? Are you a quick learner"}, {"date": "23 Oct 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Interfaith Medical Center (Brooklyn, NY) in Mar 2018", "Interview Descriptions": "Applied through indeed, contacted by nurse recruiter who ask basic questions.  Scheduled interview with unit manager and director of said unit. Process was fairly easy, no required test or exam.", "Interview Questions": "What can you bring to us ?"}, {"date": "2 Oct 2018", "title": "Human Resources Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Interfaith Medical Center (Brooklyn, NY) in Oct 2017", "Interview Descriptions": "The interview process was standard and was formal but my interviewers were really genuine in trying to get to know me as a person not so much about what my resume said or what I could offer them.", "Interview Questions": "Why do You want to take this job?"}, {"date": "16 Nov 2017", "title": "Unarmed Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Interfaith Medical Center (New York, NY) in Jun 2013", "Interview Descriptions": "It’s cool  they need to hire staff all the time so it ain’t hard to get hired. Just be confident and u don’t have to worry they hire everyone", "Interview Questions": "If I had experience doing this before? So I told them truth I did and they had me come back again then go get my clothes to wear for work "}, {"date": "22 Jun 2016", "title": "Dietary Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Interfaith Medical Center (Brooklyn, NY) in Aug 2012", "Interview Descriptions": "Interview took 30 minutes. We talk about the food temperatures, stock, preparation of food. When receiving the truck of food we use the method known as (FIFO) First In First Out. I was ask about Diets for the patience. Another thing we talk about Fire Hazard, Codes and cleaning supplies. \r\n I was hire the same and started the job next day.", "Interview Questions": "If I knew anything about diets of the patience's."}, {"date": "6 Apr 2016", "title": "Philbotomy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Interfaith Medical Center (Brooklyn, NY) in Feb 2012", "Interview Descriptions": "It was very comfortable for me to sit in an interview because being a professional person like I am I went prepared and the person who did my interview was very professional and easy to understand she also  was my supervisor for my unit that I was hired to worked on", "Interview Questions": "Why did I choose to be in this field of work"}]]