[[{"date": "22 May 2022", "title": "Cardiovascular Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Niagara Health System", "Interview Descriptions": "was conducted VIA zoom due to the pandemic, was your typical interview, discussed job role and responsibilities, and asked questions pertaining to past experience, they were very friendly and open-minded as I was a new grad, in the end, didn't get the job because of CSCT registration pending", "Interview Questions": "Example of dealing with a difficult person and how it was combatted"}, {"date": "9 Feb 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Niagara Health System", "Interview Descriptions": "It was a long process, but with fair questions. Fair amount of time between first and second interviews. Very competitive to weed out those with little experience or skills to offer.", "Interview Questions": "Standard interview questions were asked"}, {"date": "17 Nov 2021", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Niagara Health System", "Interview Descriptions": "Interviewed for the Project Manager role but was offered a Junior Project Manager role. Was not happy with being demoted at the start of a job offer. Declined the opportunity.", "Interview Questions": "What do you know about Niagara health? "}, {"date": "13 Apr 2021", "title": "Human Resource Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Niagara Health System (Toronto, ON) in Mar 2021", "Interview Descriptions": "It was a very smooth process.  Very well thought of keeping in mind the interview process is going to be virtual. There were three panelist for in the interview session.", "Interview Questions": "Mostly questions were situational based"}, {"date": "24 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Niagara Health System (Niagara, ON) in Dec 2018", "Interview Descriptions": "Applied through Indeed; received email from Niagara health;  Scheduled interview with Unit Manager. Face to face interview with unit manager and person from HR.  Did not require a skills  interview for the position I was applying to.", "Interview Questions": "Why are you applying for this position? \r\nRelated experience.\r\nDealing with conflict. "}, {"date": "12 Feb 2020", "title": "Service Desk Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Niagara Health System (St. Catharines, ON) in Jun 2018", "Interview Descriptions": "I was working in the Niagara Health system for a different position at the time, to my application was internal. My interview was pretty simple. I got brought into the Supervisors office and was presented with a package of behavioral questions. After they were complete, we spoke a little about the role and was told I would hear from them within the week.", "Interview Questions": "Tell us about a time you had a lot of responsibilities at once, and how did you determine what to do first?"}, {"date": "17 Sept 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Niagara Health System (St. Catharines, ON) in Jan 2016", "Interview Descriptions": "Review of qualifications and scenario-based skill questions. Questions involved situation-based use of nursing knowledge. I was asked how I would perform nursing care in a given set situation. I also was asked to provide an example of how I performed nursing care in a specific way. Review of my resume was very brief and most of my interview was focused on answering questions", "Interview Questions": "In a situation where a patient of sound mind is refusing a medical treatment, how would you attempt to convince the patient otherwise?"}, {"date": "24 May 2015", "title": "Anything Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Niagara Health System", "Interview Descriptions": "Had to do a math test, answer personal questions, have some kind of job experience with cash. Asked what I would like as pay? Where do I see myself with this company in 5 years?  When can I start?  Explain a situation that happened at work I had to fix.", "Interview Questions": "What would you do if this senerio happened?"}, {"date": "6 May 2015", "title": "Casual Then Part-time RN Position Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Niagara Health System (Saint Catharines, ON)", "Interview Descriptions": "The office of the manager was difficult to find. I was Interviewed by the manage the department in their office. The interview lasted less than 30 minutes. The interview was very low key foscused mainly on psycho-social questions, less on critical care issues for job.", "Interview Questions": "how I would resolve conflict between staff, MD or client?"}, {"date": "6 May 2015", "title": "Dietary Food Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Niagara Health System (Welland, ON) in Jan 2013", "Interview Descriptions": "The Process was very thorough but yet comfortable. Two Supervisors interviewed me. One asked about my experience and the other asked more about situations and how would I handle them, personal and professional.  Very professional!", "Interview Questions": "Why do I want to work for the NHS"}]]