[[{"date": "24 Apr 2022", "title": "Special Events Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Iona College (New Rochelle, NY) in Apr 2022", "Interview Descriptions": "I had a phone interview and in person interview where the same questions were asked. Definitely could have been condensed and then a potential on campus interview. Only met with one person, initially seemed like the whole department would be there.", "Interview Questions": "How my experience related to the job description."}, {"date": "16 Nov 2021", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Iona College", "Interview Descriptions": "It was long but, its very comfortable to work with. Good family life style. it has many benefits and days off. The interview was long and they had a background check but i was able to go through it.", "Interview Questions": "How well do you work with a team player. "}, {"date": "28 Aug 2021", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Iona College", "Interview Descriptions": "Good, it seems like a nice environment to work\r\nA lot of smart people \r\nYou have to be prepared, very specific questions about your field. They make you feel comfortable during the process", "Interview Questions": "How old are you? Why Iona College?"}, {"date": "23 Jul 2021", "title": "Faculty Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Iona College", "Interview Descriptions": "Attended campus interview. The interview went ok, but the offer letter that was received was horrible and did not reflect what was previously discussed. For example, there was a discrepancy regarding starting salary, relocation expenses, and opportunities for growth/development.", "Interview Questions": "What my salary expectations were"}, {"date": "12 Aug 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Iona College (New Rochelle, NY) in Jul 2018", "Interview Descriptions": "The process began with a phone interview, in order to get to know candidates. From the phone interview that was conducted a month ago, the director of this office gave me very little comfort that I would be seriously considered. Despite what the job description lists, she indicated that she’s looking for a candidate with several years of experience. The new hire is someone she hopes can take over her responsibilities with little to no supervision. The director also mentioned that she does not want to train the new hire. To me, this describes more of an Associate Director, which I am capable of doing. However, the description of the role is very entry level. The director also challenged my education, insisting that anything earned through online effort does not compare to hands-on experience. I didn’t expect to proceed further after the phone interview, but I received an invite for a face-to-face based on my eagerness to join Iona. Once again, the director challenged my education and made the determination then and there that I was not going to be her best choice for the role. I was bummed, thinking how I could have convinced her better. But I realized the red flags about this director later. Coupled with the negative views on the DSHE program, she’s dishonest with what she seeks in a candidate and stubborn about her views. Knowing that I was not her best choice from the phone interview, it’s also inconsiderate of her to invite me in for a face-to-face, which took me away from my day job.", "Interview Questions": "What is an emotional support animal?"}, {"date": "6 Jan 2020", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Iona College (New Rochelle, NY) in Jan 2018", "Interview Descriptions": "I applied online, I received a phone call about a week later. I talked to HR for about 30 min. Then I was invited to an on-site interview. The on-site interview was one of the easier job interviews I have had.", "Interview Questions": "What's your biggest strength? "}, {"date": "9 Aug 2017", "title": "Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Iona College", "Interview Descriptions": "I had to give a lesson to a class on a subject I selected. The class was an undergraduate class and I used PowerPoint .  Students asked questions.  No handouts.", "Interview Questions": "Why do you want to teach?  Why did you get into this subject?   How do you handle technology in the classroom?  What do you do if you find a student cheating?"}, {"date": "6 Mar 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Iona College (New Rochelle, NY) in Feb 2016", "Interview Descriptions": "Submit application in January, hear back around Feb for an interview, offer in March. Very easy interview where it was more of a discuss with the Dean. Rank you based on GPA and that is how you are selected for an interview.", "Interview Questions": "Why should we hire you"}, {"date": "5 Feb 2015", "title": "Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Iona College (New Rochelle, NY)", "Interview Descriptions": "One whirlwind afternoon. No follow-up whatsoever. Dead silence, despite three polite requests to the Department, Dean and Provost for updates over the course of as many months. No reimbursement for travel, though hotel was covered.", "Interview Questions": "How much did you earn in your previous job? \r\n(I answered forthrightly). \r\nTheir answer, stated with cackles of laughter: We could never pay you that much."}, {"date": "17 Oct 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Iona College (New Rochelle, NY) in Aug 2014", "Interview Descriptions": "It was very quick and simple, since I was applying for a simple desk job for work-study. My employer just asked a couple simple questions and that was it.", "Interview Questions": "General receptionist questions about abilities and organization. "}], [{"date": "16 Aug 2016", "title": "Residence Hall Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Iona College (New Rochelle, NY) in Jun 2014", "Interview Descriptions": "Phone interview followed by a full day interview on campus. Hotel and meals covered by the college. Pretty standard for the field. Received an offer within 24 hours and was able to ask follow up questions then.", "Interview Questions": "How would you integrate the mission of the institution into your work?"}, {"date": "8 May 2014", "title": "Lecturer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Iona College (New York, NY) in Jan 2014", "Interview Descriptions": "Simple, not exhaustive. They want to make sure you exist. Very friendly, collegial. Very small campus; a surprisingly large number of students reside on campus. Decent library. Faculty quality appears to be all over the map. Very few public transportation options.", "Interview Questions": "N/A"}, {"date": "21 Jul 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Iona College (New Rochelle, NY) in Sept 2013", "Interview Descriptions": "Begin by applying on Iona College Student employment website. Once you hear back from the supervisor they will most likely set up an interview and ask about work-study. Simple and easy process.", "Interview Questions": "What are you looking to achieve in this job experience?"}, {"date": "19 Apr 2017", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Iona College (New Rochelle, NY) in Aug 2013", "Interview Descriptions": "The interview was based on my skill set at the current time. The CFO was a new hire and was unaware of the major overhaul of the financial system that was necessary. The job turned out to be very different that was projected.", "Interview Questions": "My experience in Public Accounting"}]]