[[{"date": "2 Jun 2010", "title": "Vice President Info Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Kaiser Permanente (Oakland, CA) in Oct 2009", "Interview Descriptions": "Initial phone communications were good.  Had basic screening interview over the phone.  Weeks went by with no communication.  Then invited to on-site interview.  Offices were nice, location was downtown Oakland (ok during the day, not so sure about off-hours).  Interviewers were arrogant but asked average questions.  Received no further feedback or communication after repeated attempts.  Don't recommend KP IT.", "Interview Questions": "Knowledge of KP history; knowledge of HC industry"}, {"date": "4 Aug 2011", "title": "Membership Services Represetative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 12 months. I interviewed at Kaiser Permanente (Corona, CA) in Oct 2009", "Interview Descriptions": "The interview process was long. The HR depatment takes a very long time to get back with you because so many people in the call center try to get relatives hired. Once youre finally in, you take multiple skills assesments, have to pass a background check, and get invervied by two managers. The questions are simple  and within a day i accepted an offer.", "Interview Questions": "Have you worked in a call center environment before and so was it a union?"}, {"date": "31 Oct 2009", "title": "Principal Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 8 weeks. I interviewed at Kaiser Permanente (Pleasanton, CA) in Sept 2009", "Interview Descriptions": "1. Initial communication from a recruiter - \"we found you on  the web\".  Recruiter conducted a 15 min phone screen\r\n2. 30 min A phone interview withe the hiring manager\r\n3. 1 hr face to face interview a week later with the hiring manager and another director\r\n4. Another 1hr phone interview with another director a week later\r\n5. Nothing for several weeks - then \"no thanks\" from the recruiter.", "Interview Questions": "Describe a project where things did not go according to plan, and how you recovered from it"}, {"date": "2 Dec 2009", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kaiser Permanente (Oakland, CA) in Sept 2009", "Interview Descriptions": "Applied for job online.  Was called by representative from Kaiser for first interview.   Called in for 1:1 interview.  Interviewed by 2 different people.  Office was cubicles,  Work culture was casual and impersonal. Be aware of your surrounding and have a positive attitude.", "Interview Questions": "What was a bad experience you had at your prior company."}, {"date": "6 Sept 2013", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kaiser Permanente (San Jose, CA) in Sept 2009", "Interview Descriptions": "Initial interview with Director of department, who then provided an opportunity to job shadow her interim Assistant Manager. Following this a group interview was set up with seven staff members who conducted a pre-written interview question and answer session.", "Interview Questions": "Where do you see yourself in five years"}, {"date": "27 Oct 2011", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Kaiser Permanente (Oakland, CA) in Aug 2009", "Interview Descriptions": "I was contacted by a Kaiser recruiter if I would be interested for a Senior Analyst position. I didn't apply to the position originally but I think she found my profile from the KP site. The interview process was pretty clear. The recruiter that found me was very helpful. She offered tips for my phone interview so I can advance to the next interview process. The interview was composed of a phone interview, a face-to-face interview with a Senior Manager and a Senior Analyst, a skills test, and lastly a face-to-face interview with a Senior Consultant and Executive Director. After a couple of days, I was offered the position. The entire process was pretty straight forward.", "Interview Questions": "Give an example of a project that you consider as the most challenging."}, {"date": "7 Dec 2013", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Kaiser Permanente (Oakland, CA) in Aug 2009", "Interview Descriptions": "informal and disorganized", "Interview Questions": "none... very conversational"}, {"date": "30 Jul 2010", "title": "Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Kaiser Permanente (Burbank, CA) in Aug 2009", "Interview Descriptions": "The KP recruiter contacted me in regards to this position, we spoke briefly about the role and then discussed my qualifications.", "Interview Questions": "Specific questioning about timelines of my work history"}, {"date": "20 Nov 2013", "title": "IRB Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Kaiser Permanente (Portland, OR) in Aug 2009", "Interview Descriptions": "Communication was great from the beginning. I was able to contact the hiring manager immediately and so was able to present my information effectively in addition to navigating the HR job portal. There was an initial phone interview and I was flown in from out of state for the interview.", "Interview Questions": "The posting was somewhat broad: However, they were looking for someone with the ability to manage workflows, smart forms, and other specifications for an electronic system which was under development. The project manager was very pointed in her questions about whether I would be able to undertake the duties."}, {"date": "24 Sept 2009", "title": "Marketing Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at Kaiser Permanente (Oakland, CA) in Aug 2009", "Interview Descriptions": "I was on time for my interview but the interviewer was almost 20 minutes late with no explanation or apology.  On our way to the interviewers office she stopped and and had a conversation with a colleague and made no introduction or acknowledgment of my presence.  It was odd and uncomfortable.  She pulled in an second interviewer, who clearly was put on the spot.  Neither had read my resume and at one time during the process, began arguing with each other.  It was obvious by a few of their passive aggressive remarks that inter-company communications is a huge issue there. I left the interview feeling very uncomfortable and misled about what the actual job would entail.", "Interview Questions": "Have you never heard of Power Point?"}], [{"date": "14 Jun 2013", "title": "Strategy Planner Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Kaiser Permanente (Oakland, CA) in Aug 2009", "Interview Descriptions": "I  was contacted by phone to schedule 30 min phone interview with the recruiter. After a week the hiring Manager called me and requested to meet me in person.", "Interview Questions": "Can you describe examples of your earlier experiences in developing strategy?"}, {"date": "1 Aug 2013", "title": "Account Administration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Kaiser Permanente (San Diego, CA) in Aug 2009", "Interview Descriptions": "I was hired through a staffing company which is where my particular position gets 95% of their staff. They very rarely hire from outside unless you are going straight into management. Basic interview questions...when was the last time you gave great customer service, Name a time when you could have done something better, where do you see yourself in 5 years, why do you want to work for this company...", "Interview Questions": "What type of animal would you be and why?"}, {"date": "13 Aug 2009", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaiser Permanente (Mission Viejo, CA) in Jul 2009", "Interview Descriptions": "I submitted my application online using theirs career website, which was very user-friendly.  About a week later, I received a phone call from a recruiter to set up an \"interview\" at the main recruitment office for my region.  I waited about 45 minutes for my so-called interview which lasted less than five minutes.  A recruiter asked me for the same information and resume I had submitted online previously (like my availability and what facilities I am willing to commute to) without even looking me in the.  I felt like this company treated me like a number and had no interest in me.\r\n\r\nAfter about one month I was asked to interview for an open job at a specific location.  I was hesitant to meet with them again but agreed on an appointment after they offered to work around my schedule and assured me that managemnet was eager to meet with me.  The MIssion Viejo administration team was amazing.  They treated me with repect and made me feel comfortable during the interview (it consisted of a series of clinical skills assessment, questions about previous work experience, and a detailed explanation of the position.  I was told I would hear from them by the end e of the week.  Two days later, I was offered the position. The staff who assisted me with the hiring process beyond that point was friendly and helpful.", "Interview Questions": "Tell me of a recent difficult situation in the workplace and how you handled it,"}, {"date": "2 May 2013", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Kaiser Permanente (Oakland, CA) in Jul 2009", "Interview Descriptions": "Online application process is inefficient.  Got the interview after an employee referral and resume sent directly to manager.  The interview was with a panel of peers and managers, about 6 people total.", "Interview Questions": "Describe an ethical dilemma you faced and how did you respond."}, {"date": "21 Jan 2011", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Kaiser Permanente (Roseville, CA) in Jul 2009", "Interview Descriptions": "It was a very simple process. Staff is very friendly and helpful at Kaiser Permanente. Sine my interview the process has changed so be sure and check in with Human Resources.", "Interview Questions": "What do u have to offer Kaiser?"}, {"date": "7 Jul 2009", "title": "Senior Staff Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Kaiser Permanente (Walnut Creek, OH) in Jun 2009", "Interview Descriptions": "Submitted resume to HR for Senior staff Assistant position.  HR contacted me two weeks later to give me the name of the person scheduling the interviews. One week later contacted me for scheduling.\r\n\r\nFour person panel interview, consisting two nurses, clinical education trainer, and the Senior Staff Assist. The interview was only for 30-minutes and did not allow for extra time. There were four questions, one question from each interviewer.  \r\n\r\nI really wish I would have taken notes during the interview. At the conclusion of the interview, I asked for business cards from each of panel participants. No one had cards. I felt really bad at that point, since I did not have the names (could not remember all of them) to send follow-up letters. I did ask the panel I someone could send me an e-mail with the contact names and the Staff Assistant said she would. Two days after the interview, I left her a voicemail gently reminding her to either call me so I could get the name or if she could send me an e-mail. Did not get a voiceamil. On the third day, I left another message. On the fourth day, I sent a letter addressing the Senior Staff Assist only, since she was the person who contacted me for the interview. I tried to address each of the panels questions in the letter and felt it was a good letter.\r\n\r\nI think the Senior Staff Assistant was mad at me for not taking the names down in the interview and was put off by me asking her to contact me. I would have to say that was not very professional of me, but I did not know what to do at that point.\r\n\r\nI felt the interview went well. I had all the skills required for the job. Each one of the panel said they were impressed with my skill set. I think I blew it by asking for the names and they may have thought I was over qualified for the position.", "Interview Questions": "Have you ever worked with a difficult person before and how did you handle it?"}, {"date": "9 Sept 2011", "title": "Unit Clerk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Kaiser Permanente (Hayward, CA) in May 2009", "Interview Descriptions": "I submitted my resume on the Kaiser Permanente website and selected from the available openings. I was later contacted by the hiring manager and was asked to meet the following day for a one on one interview. The lady that I was talking to then gave me directions on how to get to the emergency department and gave directions to talk to the security guard and tell them that I was there for an interview.", "Interview Questions": "How do you expect to contribute to our company?"}, {"date": "27 Jan 2010", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 3+ months. I interviewed at Kaiser Permanente (Oakland, CA) in May 2009", "Interview Descriptions": "Patience is key because it took a while to hear back after the first telephone screen to 1:1 interview with manager and then to the panel interview. In between while waiting, was some questionnaire I had to fill out as well as an online application form with background information. people were friendly - but you can tell this is a bureacratic work environment.", "Interview Questions": "where do you see yourself in 5 years?"}, {"date": "13 Sept 2013", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Kaiser Permanente (Los Angeles, CA) in Apr 2009", "Interview Descriptions": "First contact was by phone scheduling a phone interview. During phone interview I was inquired about my work history, why I chose Kaiser, how I would benefit the company and such. Slight confusion because it was typical questions from a face to face interview. Scheduled an in person interview after the phone one, the phone interviewer was easy to talk to and nice. The in-person interview started off with me waiting in the waiting room with patients facing the pharmacy watching the out-patient pharmacy. After 20 minutes past scheduled interview time, a pharmacy staff personnel approached me and asked me to follow her inside. Weird. The interview was tense and dry. Almost feeling as if she wanted to find any reason to NOT hire me. Different from what I was accustomed. No friendly, personable interaction at all. I decided then I didn't want to work for the company. They want work horses, not employees.", "Interview Questions": "What did you see while waiting in the waiting room? "}, {"date": "25 Jul 2010", "title": "Auditor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Kaiser Permanente (Pasadena, CA) in Apr 2009", "Interview Descriptions": "positive but slow experience. quick phone interview. small group interview. 1 on 1 interview. skills test.", "Interview Questions": "don't remember any questions. nothing too difficult though. pretty standard stuff. no case or analytical questions."}], [{"date": "5 Feb 2013", "title": "Director, Medicare Marketing Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaiser Permanente (Oakland, CA) in Apr 2009", "Interview Descriptions": "Phone interview with the recruiter, then a very brief phone interview wit the hiring manager. I then met with the primary stakeholder (a.k.a. internal client), as well as the hiring manager. It was a surpisingly easy process for a high-paid, high-visibility position. I think the internal client interview was longer and more difficult than the interview with the hiring manager; the interview was scheduled for 45 minutes but lasted for 90.", "Interview Questions": "They asked a lot of questions regarding change management and process improvement, and revealed that my first task was going to be to lay off 5 people. "}, {"date": "5 May 2009", "title": "Registered Outpatient Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaiser Permanente (Portland, OR) in Apr 2009", "Interview Descriptions": "The initial interview phase included a patient care manager and two registered team leader nurses who had almost 40 years combined experience. The atmosphere was very professional, but not intimidating.  I was really happy to see how they valued their nursing staff's opinions and included them int he interview process. The questions were inclusive of the standard questions ie: Why did you leave your last position? What are your strengths? Weaknesses? What did you dislike or like most of the last job you had? Tell us a positive and a negative experience related to________ (in my case it was an experience where you needed to advocate for the patient) and what was the outcome of both cases? Tell us a verbal history of the jobs you had in the past.  The one question that caught me off guard a little was : We can see you have a very long list of skill sets, tell us what TALENTS you have. Some basic personality questions and scenarios.\r\nOverall, very professional, though relaxed and smoothly managed. I enjoyed that interview which is rare !!", "Interview Questions": "N/A"}, {"date": "2 Sept 2009", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Kaiser Permanente (Oakland, CA) in Mar 2009", "Interview Descriptions": "I already knew the hiring manager from another Project Manager position at another company where we had worked together.  I had a simple phone interview with her intially, then an in-person 1 on 1 interview with her, then a group interview with the three project managers who worked for her.  The company culture seemed casual, friendly and inclusive and the project managers seemed to have a good deal of autonomy in their structure.", "Interview Questions": "Describe the most difficult project situation you every encountered and how you handled it"}, {"date": "1 Feb 2013", "title": "Senior Elearning Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Kaiser Permanente (Emeryville, CA) in Mar 2009", "Interview Descriptions": "I started as a contractor. My initial interviewer was not an experienced manager and so the questions were generic. The lateral move to my current position did not involve an interview. I simply started performing the job function and my job title and status was eventually changed. In my department things have changed somewhat, in that presentations are sometimes called for.", "Interview Questions": "Questions were generic. Nothing unexpected."}, {"date": "7 Jul 2013", "title": "Ultrasound Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Kaiser Permanente (Los Angeles, CA) in Mar 2009", "Interview Descriptions": "I submitted my resume to HR services, locally.  I was contacted for an interview about a week later. In the interview the DA, Chief Radiologist and Lead Technologist were present and asked me questions about my previous experience. I was then offered a chance to \" audition\" for the U/S position.  I scanned for about 3 hours in their U/S department and was hired the same day. It was an interesting and educational experience for me, I learned a great deal about what they expected of me from the audition.", "Interview Questions": "The most challenging question I think, was when they asked me to compare my previous experience at the clinic I worked for with the expected work load at their facility."}, {"date": "6 Apr 2013", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Kaiser Permanente (Seattle, WA) in Mar 2009", "Interview Descriptions": "One interview, usual process.", "Interview Questions": "N/A"}, {"date": "29 Apr 2009", "title": "Imaging Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Kaiser Permanente (Atlanta, GA) in Mar 2009", "Interview Descriptions": "Hiring was to contact me, that didn't happen. Position was filled internally.", "Interview Questions": "What skills do you possess that would qualify you for this position?"}, {"date": "4 Apr 2009", "title": "Procurement Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kaiser Permanente (Pleasanton, CA) in Mar 2009", "Interview Descriptions": "First round consisted of a phone screen with the recruiter. 2nd round consisted of behaivoral interviews and a case study presentation with the hiring manager, peer, and director. People seemed to enjoy working there and committed to the success of the company. The planning of the interview was handled professionally and the overall interview experience was fair.", "Interview Questions": "Why do you want this job?"}, {"date": "9 May 2009", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaiser Permanente (Maryland City, MD) in Mar 2009", "Interview Descriptions": "i was searching around for a non retail compay to work for and came across kaiser, which was also recommended to me by a friend. i submitted my resume online and was later contacted and interviewed. I like the benefit package offered to me and will be starting work soon with them.", "Interview Questions": "What are your visons at Kaiser?"}, {"date": "22 Jul 2013", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Kaiser Permanente (Huntington Beach, CA) in Feb 2009", "Interview Descriptions": "Had a one on one interview while still in school to obtain my position as an extern and applied for a position that was open to the public at the end of my extern. Interviewed with the DA and ADA during my last week at my externship and was notified the following week that I been hired. Went to the business office to complete new hire forms and then completed the new employee orientation before I could begin work in the clinic.", "Interview Questions": "N/A"}], [{"date": "26 Nov 2013", "title": "Public Affairs Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kaiser Permanente (Modesto, CA) in Feb 2009", "Interview Descriptions": "Very streamlined process that took about 30 days from start to finish. Contacted by recruiter and found job posting on local crags list. Participated in a panel interview and then had 1 on 1 with director. Was offered the job and negotiated salary.", "Interview Questions": "There was a scenario where they asked me if I could design a process on the fly that would speed up the time it took a member to get from the first floor to their destination on the 4th floor without speeding up the elevator. Trying to see if you can think quickly on your feet and what type of critical thinking skills you have."}, {"date": "23 Feb 2013", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Kaiser Permanente (Los Angeles, CA) in Feb 2009", "Interview Descriptions": "The recruiters screen application and conducts initial telephone interview. If they like they forward app to hiring manager for interview. Hiring manager calls and schedules interview.", "Interview Questions": "What can you offer me and the organization that 50 others can't and who are willing to do it for a fraction of the cost. "}, {"date": "17 Dec 2010", "title": "Senior Learning Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Kaiser Permanente (Emeryville, CA) in Feb 2009", "Interview Descriptions": "Interview was casual and well organized.  Time was not wasted on boilerplate interview questions, but focused on areas pertinent to the job.  Much I believe had to do with the particular hiring manager, because I have heard of other interviews going other ways in different departments within the organization.  That said, several of the other interviews I took part in for other positions went well.  Positions that were to manage many people had great representation of the types of people to be managed on the hiring committee and interview panel.", "Interview Questions": "What makes you uniquely qualified for this position?"}, {"date": "9 Apr 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Kaiser Permanente in Jan 2009", "Interview Descriptions": "The hiring process was fairly easy when I joined. This is back when RNs really being hired left and right.  Interviewed with the Nurse Manager, Director, and Assistant Manager.  Was asked several clinical questions that pertain to the unit you are interested in.  Once I was hired, the training began.", "Interview Questions": "N/A"}, {"date": "8 Sept 2010", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Kaiser Permanente (Oakland, CA) in Jan 2009", "Interview Descriptions": "Contacted by recruiter and put in touch with hiring manager", "Interview Questions": "Question on Peoplesoft and Benefits Application experience"}, {"date": "27 Feb 2011", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaiser Permanente (Oakland, CA) in Jan 2009", "Interview Descriptions": "I applied online, and got a call within a few days to come in and interview. I interviewed with two people and was offered the position the next day. The interview process was fairly painless, but mine was the exception. As a rule most of the interviews I have heard of involve at least one or more panel interviews along with some sort of skills testing.", "Interview Questions": "What is your weakness?"}, {"date": "11 Sept 2012", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kaiser Permanente (Oakland, CA) in Jan 2009", "Interview Descriptions": "The screening process that HR does is a joke.  Most hiring managers have to skirt around the system and post their own since the best and right candidates rarely get filtered to the manager.  As a result, it takes forever to be seen and interviewed.  They tend to have everyone and their brother interview the person and then leave them hanging", "Interview Questions": "Not a difficult question perse but rather a really good and insightful one.  'What would make you leave this role?\""}, {"date": "14 Aug 2009", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at Kaiser Permanente (Oakland, CA) in Dec 2008", "Interview Descriptions": "The hiring manager called in 15 candidates and conducted a group panel interview with all 15 candidates at the same time. They decided who would move to the next round and selected 3 candidates. Everyone else was told to go home. The three candidates were given in-person interviews.\r\n\r\nIn my opinion, the 3 weakest candidates, who showed no originality of thought, were selected to go through.", "Interview Questions": "How would you measure performance of a new program?"}, {"date": "1 Apr 2009", "title": "Director of Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaiser Permanente (Oakland, CA) in Nov 2008", "Interview Descriptions": "After applying I heard back from the HR recruiter within 3 hours.  I participated in an initial discussion (i.e., screening interview) where we determined that I should meet with the hiring manager.  I met with the hiring manager the following week and we discussed next steps and setting up time with the senior executives the role would be supporting.  After a couple of follow up emails back-and-forth, I provided work samples and completed the formal application.  Unfortunately, I learned two weeks later that they had elected to \"pursue other candidates.\"", "Interview Questions": "Tell me about a work experience where something didn't go as planned and how you responded?"}, {"date": "18 Mar 2009", "title": "Management Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Kaiser Permanente (Pasadena, CA) in Nov 2008", "Interview Descriptions": "The interview process was very similar to other management consulting interviews.  There are 3 rounds of interviews, 1) meet with 2 staff consultants, 2) meet with a Sr. Manager and a staff consultant, 3) meet with the managing director.  Both first rounds are very similar in that you discuss your resume in greater detail, they ask you clarifying questions, and then you go into a brief case study.  I would not stress about the case study if you have either worked as a management consultant before or you have prepared yourself by doing case study prep work.  Compared to my two previous employers which were a Big 4 consulting firm and the management consulting department in a large healthcare company, I found this case study on the easier end of the spectrum.  The third round consists with meeting the managing director which is more of a personality and fit based interview.  The style is more of an informal conversation than an interview.  \r\nI would recommend that you make sure you can speak clearly and concisely about your previous work or school experience and that you have prepped well with case studies and you should be fine.", "Interview Questions": "They give you a brief business issue and ask \"How would you frame the approach you are going to use to solve this business issue?  Please describe why you think this is a good approach.\""}], [{"date": "20 Mar 2009", "title": "KPIT Communications Consultant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Kaiser Permanente (Oakland, CA) in Oct 2008", "Interview Descriptions": "I first had a screening interview with a recruiter which led to a phone interview with the hiring manager. From there I had a panel interview with the hiring team followed by a second interview with the hiring manager. Then I had an interview with a VP from another department and finally an interview with the EVP I would support. I interviewed them as much as they interviewed me. The culture seemed very hierarchical and political and most that I interviewed with confirmed that.", "Interview Questions": "On a scale of 1 to 10, how interested are you in the position?"}, {"date": "11 May 2009", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 8 weeks. I interviewed at Kaiser Permanente (Pasadena, CA) in Oct 2008", "Interview Descriptions": "The recruiter was very enthusiastic and forthcoming at first. However, she did not return calls after the interview and it took me many weeks to learn that I was not even being considered.", "Interview Questions": "N/A"}, {"date": "17 Jul 2012", "title": "Member Service Representative Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Kaiser Permanente (Corona, CA) in Sept 2008", "Interview Descriptions": "I interviewed at their own clerical job fair.  I had to wait in line to apply with me bringing my resume.  When I got to the table, they looked at my resume and told me I was qualified for the member service rep.  I waited about 20 minutes for the one on one interview, the recruiter just asked me easy general questions.  The recruiter called about 2 weeks later and was offered the job pending health immunizations.", "Interview Questions": "The most difficult question was a behavioral question.  She asked \"how would you deal with an irate member.\""}, {"date": "12 Apr 2009", "title": "Licensed Practical Nurse  Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Kaiser Permanente (Springfield, VA) in Sept 2008", "Interview Descriptions": "I had been a member of Kaiser when I was younger, and I though that working with those who took care of me would be great. I got to tour the floor in which I would be hired for. I got to meet the nurses and doctors. They welcomed me with open arms. The Clicnical coordinator who interview me was very profession al and gave me a complete run down on what to expect in the position. She was impressed with my skills and offered, and I accepted.", "Interview Questions": "How did you handle a situation with an irrate patient?"}, {"date": "16 Nov 2010", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Kaiser Permanente (Oakland, CA) in Sept 2008", "Interview Descriptions": "Interview for an analyst position back in 2008. A recruiter at HR contacted me in regards to the position. She arranged a phone interview for me with the hiring manager. HR and hiring manager were friendly. No offer at the end though.", "Interview Questions": "Why do you want to work here instead of other companies?"}, {"date": "19 Aug 2010", "title": "Teleservice Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Kaiser Permanente (Stockton, CA) in Aug 2008", "Interview Descriptions": "First I received a phone call to take an aptitude testing consisting of reading comprehension, computer literacy, and typing speed.  If you pass the aptitude test then you fill out an application.  They called me the next day with a brief phone interview and then scheduled an in person interview.  I had two individual interviews with two supervisors.  The second supervisor I met with told me the pay and benefits offered with the position.  I received a call two days later from the recruitment offering me the position.", "Interview Questions": "What is your weakness?"}, {"date": "28 Apr 2009", "title": "Administrative Specialist III Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kaiser Permanente (Pasadena, CA) in Aug 2008", "Interview Descriptions": "I applied online, it was simple enough.  A couple of weeks later, I received a phone call from the company asking if I could talk regarding the position.  We talked for about 20 minutes about the position, my qualifications, etc.  It didn't seem negative or positive, just matter of fact.  She thanked me and that was it.  There was no indication that they were or weren't interested.  I figured, oh well.  Then, a week later, I get an email, not a phone call, just an email saying that I had been scheduled for an interview the following week.  I arrived at the interview on time, and waited.  Finally I was called in to meet with three people.  That interview seemed pleasant enough, I answered their questions and asked a few and it was a good interview as far as I thought.  They said I should hear back in a few days, following the background check, and seemed rather positive about the results.  I had submitted my information for the background check, received an email that it was received and they would begin.  I then receive a call, two days later that I had failed the background check.  I asked how and was told that I would be notified by the company doing the background check with the details.  That was it, no further details.  I waited a week, no information.  I called asking when I would receive the information.  No response other than the information was in the mail.  I waited, nothing arrived.  I sent an email to the in-house recruiter, no response.  I then sent an email, including several of the people that I had interviewed with and then got a voice message from the in-house recruiter saying to contact him.  I sent an email, asking for details by email, but got another voice message asking me to call.  I called, left a message for him to email me with the details.  Nothing.  I gave up.", "Interview Questions": "There were no difficult questions.  The process was the difficult part."}, {"date": "22 Oct 2010", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Kaiser Permanente (Pleasanton, CA) in Jul 2008", "Interview Descriptions": "The process was pretty straight forward. There's an HR policy in place regarding how many candidates the hiring manager shall consider, and who should participate in the interview. The overall process is fairly quick once the ball gets rolling. It appears most positions filled are through some kind of referrals.", "Interview Questions": "Why do you want this position?"}, {"date": "31 Dec 2012", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Kaiser Permanente (Oakland, CA) in Jun 2008", "Interview Descriptions": "Had to go for several interviews with a variety of different people.  Overall the people seemed to be nice.  Questions were fairly straight forward and not that difficult. Overall perception was good .  Nice people.", "Interview Questions": "They seemed to ask a lot of behavioral based questions.....so be prepared to answer questions about your past job experience where you've exhibited the quality you are talking about.   Need to be prepared to answer most any question like this."}, {"date": "16 Sept 2010", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Kaiser Permanente (San Francisco, CA) in Jun 2008", "Interview Descriptions": "Meet with other colleagues that will be working with you, to determine whether there is good fit with personalities, work ethics", "Interview Questions": "Why do you want the job"}], [{"date": "19 Sept 2012", "title": "Senior Staff Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Kaiser Permanente (Oakland, CA) in Apr 2008", "Interview Descriptions": "Interview and hiring process was very smooth.  Encountered problem with agency providing background check, who do to name changes, had difficulty accessing correct information.", "Interview Questions": "N/A"}, {"date": "17 Aug 2012", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Kaiser Permanente (Pasadena, CA) in Mar 2008", "Interview Descriptions": "Submit to the hiring manager if possible. You will be contacted by a recruited and may have a phone interview. You will meet with at least two people or panels for a series of inerviews on the same day to assess skills and fit with the group.", "Interview Questions": "No suprises, just the basics. Whatch for behavioral questions"}, {"date": "4 Sept 2012", "title": "Chief Operating Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Kaiser Permanente (Los Angeles, CA) in Feb 2008", "Interview Descriptions": "Was a multi-day, multi-person interview experience.  Because the organization is so large and so complexed, there were many people involved, some with conflicting wants and demands of the position.  Some interviewers were very skilled, others were clunky, a couple embarrassingly so.", "Interview Questions": "Questions that went into details regarding internal operations were difficult inasmuch as one would need to have access to more information -- data, culture, history, outcomes desired -- to be able to appear intelligent.  "}, {"date": "4 Apr 2009", "title": "Admitting Rep. Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Kaiser Permanente (Antioch, CA) in Feb 2008", "Interview Descriptions": "well my story is a little different then everyone else (maybe).... okay my interview was during the mid-day, you have no idea i was so excited. So i got there like 30mins to 45mins early so i decided to waiting in the car until about 20 mins before my interview started i got there and asked the security three in the front were the conference rooms were. they told me that it was one the 4th floor in A3 so i go up there and im already to answer all the questions i knew it was going to be a panel interview so i was kinda nerves about that already. So im waiting and waiting and waiting it gets down to me the lady comes out after about 10-11 mins of already waiting and says, \" what are you here for\", i responded, \" im here for a interview for the admitting position\" she the stated, \" this is not the admitting interview, sorry\", right there i was sweating bullets and crapping on myself.. im like omg what im i support to do??? so i go back down to where the security were on the first floor i got security people asking all there supervisor and stuff where i am suppose to go. the next thing that happened i here thesupervisor  say its in Deer Valley well the main hospital is called Sand Creek so already im late dont know what to do i get escorted back to where im suppose to be at and my new current boss and a panel of people were just looking at me and im already going crazy so i get in there do my interview and walk out a Kaiser Employee... YES", "Interview Questions": "why should i hire you?"}, {"date": "27 Mar 2010", "title": "Project Manager II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Kaiser Permanente (Downey, CA) in Feb 2008", "Interview Descriptions": "Interview held with 3 managers from the department. Had to take different types of skill assessment tests. Along with presenting a case for persuasion. The people and the office are very welcoming and friendly. A good vibe was given, which lead to more interest in the position.", "Interview Questions": "How would you get someone to see your perspective of an issue?"}, {"date": "5 Jan 2010", "title": "Director of Operations Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Kaiser Permanente (San Francisco, CA) in Jan 2008", "Interview Descriptions": "I was interviewed forst by phone, three times in person, and then had further interviews with members of the Board of Directors. They all liked me but I could see the dysfunctional aspects of the job. If that many people need to interview me, chances are that number of people will need to decide my raises, evaluations, and perhaps question my decisions. As a Director of Operations, it would be a hoorible situation. I am a prefessional and should not need to got through a \"gauntlet\" just to get a job.", "Interview Questions": "Can you work work well with veterans who might scream at you due to trauma."}, {"date": "18 Mar 2009", "title": "IT Consultant/Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Kaiser Permanente (Walnut Creek, CA) in Nov 2007", "Interview Descriptions": "Interview process was casual and focused on the technical skills needed for the position. The hiring was protracted due to an ongoing reorg.", "Interview Questions": "why do you want this job verses job xyz that you would be perfect for"}, {"date": "12 May 2009", "title": "Senior Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Kaiser Permanente (Los Angeles, CA) in Oct 2007", "Interview Descriptions": "When I was scheduled for the interview, I didn't realize it would be a panel interview but when I arrived, I was surprised to find 6 management personnel in the conference room.  Initially the Director asked questions like What do you like about your current job? What is challenging about your job?  Then the remaining management staff each asked one question specific to the job and how I would handle a given situation.", "Interview Questions": "How have you dealt with a difficult co-worker?"}, {"date": "6 Jul 2009", "title": "Admitting Clerk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kaiser Permanente (Suisun City, CA) in Jun 2007", "Interview Descriptions": "I had applied for the position through the website. It took approximately two weeks to receive an interview.  At the interview, after introductions, the interviewer referred to me by someone else's name. I politely corrected her and she turned red in the face and told me the interview was over. I attempted to ask her if I had done something wrong and she told me she was uncomfortable with the way I corrected her. Those weren't her exact words but that's the jist. \r\n\r\nI wasn't expecting a call back.", "Interview Questions": "I did not get to this step in the interview process."}, {"date": "22 May 2009", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Kaiser Permanente (Oakland, CA) in Jan 2007", "Interview Descriptions": "Recruited through a staffing agency. First stage of inteview process was a panel phone interview with 4 people and me (the employee I'd be replacing, an employee who shared the position, and their two managers). After passing this phone screen, I was called in for an in-person interview with the same group (2 in person, 2 on phone). One week later I received an offer to take the position as a contractor. I contracted full time for almost 1 year then \"interviewed\" for the permanent full time position. I met with my coworkers for this interview which was rather informal since I'd already been working with them all for almost 1 year. \r\n\r\nThe interviews were standard. A lot of behavioral type questions about how I would handle certain situations. A lot of involvement from the interviewers telling me more about the position so I could hypothetically respond to how I would react. \r\n\r\nThere is no one work culture at KP; it differs from department to department, so no overall advice. In general though, I do think they they like to practice what they preach in re the Thrive branding messaging. They do like to see that future employees have a good work/life balance and are passionate about good health and the mission of KP.", "Interview Questions": "What do you like doing in your free time? "}]]