[[{"date": "3 Jan 2023", "title": "PMr Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cambridge Health Alliance (Boston, MA)", "Interview Descriptions": "Great perfect easy efficient and it was easy and good and prefect and effiecient. Easy negotiation for pay. Do your research and everything will flow easily. The interview process is as is and there should be a horing freeze soon so be dure to interview", "Interview Questions": "What are you strengths and weakness"}, {"date": "2 Dec 2022", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cambridge Health Alliance", "Interview Descriptions": "Fast & efficient - friendly. Quick responses by the group. Zoom interview less than 30 mins. Like the people and the mission. Could be a bit more clear about the next steps.", "Interview Questions": "What are the best parts of your current job?"}, {"date": "18 Nov 2022", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cambridge Health Alliance", "Interview Descriptions": "I enjoyed my interview and felt I was well respected and learned a lot. They expressed clear interest in my experiences and what I was looking for in a job and answered many questions", "Interview Questions": "Describe a time you worked with a coworker from another discipline"}, {"date": "25 Nov 2022", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Cambridge Health Alliance (Cambridge, MA) in Oct 2022", "Interview Descriptions": "Phone interview, very relaxed and easy. Interviewer was personable and conversation flowed easily. Interviewer said he wanted to have a “conversation “ rather than an “interview”. We talked for about 30 minutes.", "Interview Questions": "Talked to me about what I did during the lockdown that was new for me"}, {"date": "17 Nov 2022", "title": "Integrated Behavioral Health Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambridge Health Alliance (Boston, MA) in Jul 2022", "Interview Descriptions": "The interview process was coordinated and smooth. The first interview was a phone screening with the hiring manager, the second with colleagues on the team. The last interview would have been with the medical director.", "Interview Questions": "Share a situation where you advocated on behalf of a patient to the primary care team."}, {"date": "2 Mar 2022", "title": "Program and Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Cambridge Health Alliance", "Interview Descriptions": "It has been very lengthy; two months so far and just now to the offer discussion. But everyone has been very kind. I felt like my questions were answered well. A timeline of expectations would have been helpful though.", "Interview Questions": "What interested me most about the job."}, {"date": "25 Jan 2022", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cambridge Health Alliance", "Interview Descriptions": "Multiple emails, then multiple interviews. Very nice manager and team. A very long process but to me that means that they are looking for the right candidate for their team to mesh well within their current needs and for future growth.", "Interview Questions": "What is a project you have been on that you felt was very successful for you. "}, {"date": "22 Dec 2021", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cambridge Health Alliance", "Interview Descriptions": "Talk with office manager and meeting with two staff nurses in primary care clinic. Easy going and casual conversation. Nice staff and took the time to answer my questions. Overall good experience.", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Oct 2021", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cambridge Health Alliance", "Interview Descriptions": "I was selected to interview for Clinical Research Coordinator. I interviewed a total of 3 times. I met with 4 individuals who's teams I would be assisting with as well as the director. \r\n\r\nWas asked different questions across the three interviews.", "Interview Questions": "What is your experience with diversity and how is it important to you? "}, {"date": "15 Sept 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cambridge Health Alliance", "Interview Descriptions": "Pretty straight and to the point overall. 2 phone interviews with talent acquisition representatives, followed by a formal interview with nurse manager. The whole hiring process took approximately 3-4 weeks.", "Interview Questions": "Why do you want to work in this specialty (psych)? "}], [{"date": "4 Jun 2021", "title": "Performance Improvement Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambridge Health Alliance in Jun 2021", "Interview Descriptions": "It was great and precise, very neat interview process. They answered my questions about the organization and it was a great discussion. It really felt like a discussion not as an interview", "Interview Questions": "Tell us about your experience and why that makes you a good fit?"}, {"date": "29 Mar 2021", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cambridge Health Alliance", "Interview Descriptions": "Online application then a phone call interview with Human Resources then scheduled a Google Meets interview with nurse managers.  Interview typically lasts 30-45 minutes depending on length of responses. Then wait a couple days for results.", "Interview Questions": "Why are you interested in CHA"}, {"date": "14 Dec 2020", "title": "Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Cambridge Health Alliance", "Interview Descriptions": "Very professional. I enjoyed meeting many of the staff. It was a multi person interview. Very relaxed. Felt like I was making nice connections even if it didn’t turn into a job. Took a bit of time to hear back so I ended up taking another job.", "Interview Questions": "Typical rehab questions. Pleasant and conversational."}, {"date": "8 Feb 2022", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Cambridge Health Alliance (Cambridge, MA) in Aug 2020", "Interview Descriptions": "It was just like any other nursing interview but via google meet. Met with the manager and was asked the typical  questions based on your specialty. I did psych Rn", "Interview Questions": "Why should we hire you? \r\n\r\nTell us about a difficult time you had with a patient or colleague and how did you resolve it?\r\n\r\nTell me about yourself? \r\n\r\nWhat are your strength vs weaknesses? \r\n\r\nWhat is your 5 to 10 year goals? \r\n"}, {"date": "22 Dec 2020", "title": "Emergency Department Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambridge Health Alliance (Everett, MA) in Nov 2019", "Interview Descriptions": "Interviewed with the former Nurse Manager of the department. The interview was straightforward; had to answer questions like what my former roles looked like, why I wanted to work there, what I can bring to the position, etc. Was offered the position after a day or two and was pleased to accept. The job itself was alright- good pay, consistent scheduling, and room for overtime. However, this hospital system is not for the weak. Managing all kinds of personalities and having strong interpersonal skills are necessary if you want to last long in your role.", "Interview Questions": "We serve an underprivileged community. How will you care for all kinds of patients? "}, {"date": "27 Jul 2019", "title": "Registered Nurse Case Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Cambridge Health Alliance (Cambridge, MA) in May 2019", "Interview Descriptions": "Interviewer spoke only about herself.  Pertinent questions about the job itself was limited.  Interviewer overshadowed the ability for the rest of the panel to ask pertinent questions.  Limited time was allowed for me to ask questions with clarification.  Follow up was long and delayed where I literally lost interest in the position.", "Interview Questions": "What makes you the best"}, {"date": "17 Apr 2019", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambridge Health Alliance", "Interview Descriptions": "Phone screen, waited to be called back about an interview, interviewed with manager, and then a panel of staff. Heard back later that day with an offer. Really fun and easy process to go through!", "Interview Questions": "Experience in the field, education, experience within the population."}, {"date": "18 Jun 2018", "title": "Advanced Practice Provider Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambridge Health Alliance", "Interview Descriptions": "Laid back process. Everyone was very friendly and more interested in ensuring I was informed about the position and in getting to know me as a potential future colleague than in grilling me.", "Interview Questions": "What would a former supervisor say are your biggest strengths and weaknesses?"}, {"date": "6 Apr 2018", "title": "ER Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Cambridge Health Alliance", "Interview Descriptions": "Applied online and heard back in about a week or two. Had an in person interview with the nursing manager and nursing educator. Both members were very nice and made me feel welcomed. About a week and a half later I got a phone call from HR offering me the job and spoke with them about my prehire physical and orientation.", "Interview Questions": "What’s your least favorite type of patient?"}, {"date": "11 Nov 2020", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Cambridge Health Alliance (Boston, MA) in Jan 2018", "Interview Descriptions": "first they had a phone interview,  talked for about half an hour and then they were pretty quicked and made an offer. The offer was fair and started in 2 weeks.", "Interview Questions": "How would you implement a web site from scratch?"}], [{"date": "28 Dec 2017", "title": "Grants Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cambridge Health Alliance (Cambridge, MA) in Nov 2017", "Interview Descriptions": "The process was very informal and straightforward, more of a 2-way conversation instead of the usual interview \"test questions\" interviewers usually ask.  Hiring managers were very kind and sincere, provided a clear explanation of the work involved and the potential opportunities for growth at CHA and why they enjoy working there.  They seem more interested in getting to know you as a person to work with than seeing how well you can answer standard interview questions, which reflected well on their workplace culture and values.", "Interview Questions": "If I knew certain Microsoft Office program."}, {"date": "22 Mar 2017", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Cambridge Health Alliance", "Interview Descriptions": "I went in to interview for an RA position at a research institution under CHA. This was the second round. I talked to the two directors, 30 min each, and completed an hour-long writing assignment.", "Interview Questions": "Standard questions like why our program? What makes you interested in research? Where do you see yourself in 5 years?"}, {"date": "14 Jan 2017", "title": "Recruitment Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cambridge Health Alliance (Cambridge, MA) in Dec 2016", "Interview Descriptions": "It was a wonderful interview process! I met with the HR team and the Director of Talent Acquisition. We talked about the company, the team and the position and it was a really great conversation. Everyone really seemed to enjoy what they do and who they work for. I truly enjoyed the experience. I found that they created a really genuine, low stress, but very informative interview overall.", "Interview Questions": "What interested you in the position?\r\n\r\nWhat is your background in HR?"}, {"date": "8 Aug 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Cambridge Health Alliance (Cambridge, MA) in Jul 2016", "Interview Descriptions": "Great questions asked by the employer. Asked about my past experiences and where do I see myself in 5 years. Also my past educational experience. The lady that interviewed me was very pleasant and made me feel very welcomed.", "Interview Questions": "Where do I see myself In 5 years."}, {"date": "29 Aug 2016", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cambridge Health Alliance (Somerville, MA) in Sept 2015", "Interview Descriptions": "The interview process consisted of two interviews, one with your direct managers, and the second second with the head of the department. If your managers like you and have mentioned good things about you to the head of the department the second interview will go well and be more like a conversation then an interview.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "5 Feb 2016", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Cambridge Health Alliance in Aug 2015", "Interview Descriptions": "Comprehensive Interview with various groups from the practice.  Good communication from HR regarding the process and very timely responses to questions regarding next steps.  The interview was three rounds that ended with a group/panel interview with various stakeholders/members of the staff.", "Interview Questions": "They asked me questions about my experiences and greatest challenges."}, {"date": "24 Jun 2018", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Cambridge Health Alliance (Cambridge, MA) in Feb 2015", "Interview Descriptions": "easy, did not seam very interested in me as a candidate.  Interviewer yawned a few times and that kind of turned me off.  Also slaray offered was really low for the time", "Interview Questions": "where do you see yourself in 3 years"}, {"date": "19 Apr 2019", "title": "Patient Access Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Cambridge Health Alliance (Cambridge, MA) in Jan 2015", "Interview Descriptions": "It was quick and to the point.  Met manager and he brought me back, asked a few questions. He kept asking me more questions. After he asked me more questions. Then after he asked me more questions.", "Interview Questions": "How do you adapt quicky? How was your last job? How was the previous job?"}, {"date": "12 Aug 2014", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I interviewed at Cambridge Health Alliance", "Interview Descriptions": "Interviews tend to be the group model.  No real structure to them as far as an official format.  Other than a few standard interview questions, the interviews specifically in the IT department tend to be more relaxed and informal. Focus on work experience/knowledge base as well as how a personality will fit in with this dynamic group hold equal weight.", "Interview Questions": "Do you work best as part of a group or would you rather work alone?  "}, {"date": "10 Jun 2014", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Cambridge Health Alliance", "Interview Descriptions": "The hiring process took three months. HR is very very slow. Interviewed over webcam, then went in to tour the lab. I also had to get a physical and drug test.", "Interview Questions": "N/A"}], [{"date": "11 Feb 2014", "title": "Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Cambridge Health Alliance", "Interview Descriptions": "Mine was an internal hire. My boss offered me the position without a process but I asked him to \"put it through the process\" because I needed my team to feel they got the person they wanted. While it seemed like a pretty straightforward request, it then took him NINE MONTHS to make it happen, meanwhile I was doing 2 jobs for the entire time.", "Interview Questions": "n/a"}, {"date": "9 Dec 2016", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Cambridge Health Alliance (Cambridge, MA) in Jan 2014", "Interview Descriptions": "Given a detailed itinerary by recruiter, met with everyone from division, including chief of medicine, took tours of the facilities, drove to different sites to meet everyone. Everyone was very friendly", "Interview Questions": "N/A"}, {"date": "4 Aug 2017", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Cambridge Health Alliance (Cambridge, MA) in Jan 2014", "Interview Descriptions": "Manager was flexible in meeting with me. Overall the department itself want highly train employees with experience. HR/Occupational health is very slow with the hiring process. Overall everything was straight forward", "Interview Questions": "How many prescriptions could you type? "}, {"date": "29 Oct 2015", "title": "Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Cambridge Health Alliance (Everett, MA) in Sept 2011", "Interview Descriptions": "1 hour interview with Nursing Supervisor. Discussed skills, goals, work experience, education- the normal interview questions. After the interview I received a tour of the unit. I was able to ask staff questions and see the pt population. It was a good experience.", "Interview Questions": "I was asked about my training/education and where I would like to be (career-wise) in the future."}, {"date": "30 Sept 2011", "title": "Per Diem Occupational Medicine Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Cambridge Health Alliance (Somerville, MA) in Sept 2011", "Interview Descriptions": "Employer put out information for a part-time occupational medicine physician and request a CV. on the occupational and environmental medicine listserve. I responded with an attached CV and they arranged an in person interview.", "Interview Questions": "I don't remember any question that is difficult."}, {"date": "21 Dec 2012", "title": "Health Educator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Cambridge Health Alliance (Cambridge, MA) in Jun 2011", "Interview Descriptions": "It is a quick process interview. You just have to prove that you have experience in the field.", "Interview Questions": "Nothing out of the ordinary"}, {"date": "26 Jun 2014", "title": "Pediatric Staff Neuropsychologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Cambridge Health Alliance (Medford, MA) in Sept 2010", "Interview Descriptions": "Interviewed 2-3 times. First with sr. neuropsychologist in this particular building. Wasn't even aware I was interviewing. I was just attending a seminar she ran - I hadn't even been looking for a job. One day she told me that her supervisor wanted to speak with me. I figured that perhaps the company didn't want  outsiders participating in in-house activities. He and I spoke very easily and casually about a shared mid-West connection, what I liked to do with the children we saw, and other basic schools of thought in terms of neuropsychological theory. I remember being absolutely stunned when he told me they were hiring and would I like to be on their staff.", "Interview Questions": "N/A"}]]