[[{"date": "1 Apr 2022", "title": "Project Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at MakeWay(Canada) in Jan 2022", "Interview Descriptions": "Got a random call from HR wanting to do the phone screen screen on the spot. I wasnt available and asked for a scheduled call. I received the call and answered all questions. I also asked questions to which the person provided vague answers or said they didn't know. Then after some time, I got another random phone call asking me for the first interview. I didn't have my calender infront of me so asked them to send me an email with timeslots to fix a time. the person said that they would do that. on the same call, I asked about the interview process and stage. There were several rounds. After the phone call ended, I never received the email that to schedule the interview which the person said they would. \r\n\r\nAll this is extremely unprofessional. There is no respect for the candidate. HR has no sense or tact how to talk to candidates or how to do basic scheduling. There is no consideration for the other person's time. \r\n\r\nit seems that they call people up and reject them based on their accent or their boldness to ask questions. Every candidate has a right to know what they are signing up for. Good organizations know what they want and they demonstrate good behaviour. They dont dance around with candidates, play games, or make them prepare for endless round of interviews. Endless round of interviews doesn't guarantee that a person is going to stay in that role for long. What makes people stay is seeing good values being practiced (not preached). What makes people stay is being treated wirh respect and consideration and none of this was practice in my experience. \r\n\r\nI just can't understand why the person calling would say on the phone that they would just email dates and time for the interview and never follow up. This shows a lack of credibility and that MakeWY only preaches and not practices their values of equality and yada yada. \r\n\r\nGood thing is that the job market is becoming more of a job seekers market and behaving in such. way would never attract talent.  Employers who behave poorly forget that their reputation travels too, tables turn, and those who you treat poorly today can tomorrow become your most critical stakeholder.", "Interview Questions": "Basic phone screen questions \r\n\r\nWht did you apply etc "}, {"date": "16 Nov 2021", "title": "Director, Shared Platform Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at MakeWay(Canada)", "Interview Descriptions": "I received a call from someone in HR who wanted to do a phone screening on the spot. I wasn't available so we scheduled a time for the phone screening (which should have been the case in the first place). Then she said she would contact me by the end of the week to update me on the process. It's been over 3 weeks and I haven't heard from her. I don't even have an email address to follow-up. Overall, didn't come across as professional.", "Interview Questions": "General questions like what do you know about Makeway, why did you apply for this position, etc..."}], [], [], []]