[[{"date": "27 May 2021", "title": "Crisis Line Worker MHP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Association for Individual Development", "Interview Descriptions": "Simple and informative. Employer engaged with future candidates with questions and answers for a position. I was able to engage with co worker as well throughout the interview to ask them questions as well.", "Interview Questions": "Tell me about yourself, and how can you apply it to our listed position? "}, {"date": "19 Oct 2020", "title": "Accountant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Association for Individual Development (New York, NY)", "Interview Descriptions": "I was contacted by email by the CFO .  We setup an interview time.  She told me about the job and department.  She asked if I would be flexible regarding job duties.", "Interview Questions": "What salary range am I interested in?"}, {"date": "11 Nov 2021", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Association for Individual Development (Aurora, IL) in Oct 2019", "Interview Descriptions": "The interview process will be easy. Very flexible options and they will work with you. They will be interested in knowing which site you would fit best at. The interview is probably 10-15 minutes.", "Interview Questions": "Tell us about a time you helped navigate a problem for a client"}, {"date": "20 Apr 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Association for Individual Development (Aurora, IL) in Aug 2017", "Interview Descriptions": "Long online application, two interviews, very long time taken to verify references, do drug screen , complete background check, finger printing, etc. This was the longest hiring process I've ever had to go through.", "Interview Questions": "Prefer working in nursing or human services?"}, {"date": "3 Nov 2016", "title": "MHP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Association for Individual Development (Aurora, IL)", "Interview Descriptions": "Interview took 30 minutes, very straightforward and friendly. Once I got there I was instantly greeted and the interview started immediately. The interviewer was very friendly, straightforward and understanding.\r\n\r\nPros: Friendly, Understanding about start date\r\nCons: Pay doesn't match job requirements", "Interview Questions": "Why do you want to work in the Mental Health field?"}, {"date": "24 Feb 2016", "title": "MHP Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Association for Individual Development (Aurora, IL) in Feb 2016", "Interview Descriptions": "Interview took 30 minutes. Interviewer gave a good overview of company and expectations of position. I was given a chance to ask questions at the end. Position entails training, full time position entails 4 day work week (10 hr. days) including every other weekend, and room for growth. AID promotes from within. Positive experience. Waiting for call back for a possible 2nd interview.", "Interview Questions": "Do you feel comfortable transporting clients in your car to their respective appointment?"}, {"date": "19 May 2017", "title": "MHP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Association for Individual Development (Aurora, IL) in Feb 2016", "Interview Descriptions": "Interview process was quick and set up at the job fair I attended. The interview was super easy and clear.  I attended a job fair, completed the application and submitted my application ( always bring a copy even if you emailed it) and was called in for an interview. I was called after the interview to be informed that I would be offered a position. I then accepted.", "Interview Questions": "Why do you think you would be good at this position?"}, {"date": "26 Aug 2015", "title": "Residential QIDP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Association for Individual Development (Aurora, IL) in Jan 2015", "Interview Descriptions": "Asked questions about my work history and how that experience would help benefit in the role as a QIDP.  They asked about my job history. The interview questions were what anyone would expect in an interview. They asked how many clients I have served in the past. They asked if I have ever taking clients to doctors appointments.", "Interview Questions": "How I prioritize my work responsibilities?"}], []]