[[{"date": "17 Jun 2023", "title": "Cardiovascular Sonographer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical City Dallas (Dallas, TX)", "Interview Descriptions": "Tech seemed unfocused and seemed to never have done an interview before. When I checked in a few days later via email. I got a response 48hrs later and was told that I should received an email (I did not) that I did not get the job", "Interview Questions": "What studied can I do?"}, {"date": "24 Apr 2023", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Dallas (Dallas, TX)", "Interview Descriptions": "Very quick, good simple questions, and very informative about the position. No trick questions good interviewer loved the experience. About 5 questions and you don’t have to answer all of them perfectly.", "Interview Questions": "Name a situation they was very stressful and how you handled it?"}, {"date": "7 Jun 2023", "title": "New Grad RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Dallas (Lubbock, TX) in Apr 2023", "Interview Descriptions": "I applied online and immediately after got a text saying i can pick a unit from a selection for an interview. The interview was at a convention center and there was multiple interviews going on around me so it was hard to concentrate on what my interviewer was saying. It was a very unprofessional environment. Even signing in, a lady went to every person to sign them in and kept skipping me.", "Interview Questions": "Why do you want to be a nurse and why the specific unit"}, {"date": "24 Jan 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Medical City Dallas (Dallas, TX) in Jan 2023", "Interview Descriptions": "i went to a convention and got to have two interviews with two units. they had recruiters that would call your name and bring you to whichever table your unit was sitting at.", "Interview Questions": "what is one of your strengths and weaknesses? why do you want to do pediatric oncology or L&D? what is one clinical experience you had where you play an essential role."}, {"date": "17 Nov 2022", "title": "Occupational Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Dallas (Dallas, TX) in Nov 2022", "Interview Descriptions": "Firstly, HR will call you and confirm some information. She is so nice. After that, you will have another interview. During the interview, you will be asked a lot of scenario questions.", "Interview Questions": "How to collaborate with co-workers. How to deal with some difficulty patients."}, {"date": "13 Oct 2022", "title": "New Graduate Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical City Dallas", "Interview Descriptions": "In person interview with 2 managers and it went well. Interviews took place in hospital lobby with other interviews going on around you. It was a relaxed environment and got an in person offer that day.", "Interview Questions": "How would you handle taking care of multiple patients when you do not have a lot of time that you can spend with them?"}, {"date": "8 Jul 2022", "title": "Patient Safety Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Dallas", "Interview Descriptions": "Professional and informative. The questions asked were general question as about what you’re looking for in a job.  The interviewers made you feel comfortable and answered all the questions asked.", "Interview Questions": "Why did you pick Medical City?"}, {"date": "17 May 2022", "title": "Staff Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Medical City Dallas (Dallas, TX) in Mar 2022", "Interview Descriptions": "BEWARE---Had an interview here and it was one of the most unprofessional experiences in my career. First, the \"hiring manager\" was extremely young, not that a young person couldn't perform the job, but her lack of experience definitely showed. I don't have a problem with tattoos, piercings etc. but her winged eyeliner was extremely tacky and unprofessional. She was late for the interview, then she decided we chat in the cafeteria which was loud and very difficulty to hear or speak in, she didn't ask much as if she already had her mind made up. The next day I was sent a rejection letter without a reason. The good thing is I didn't get set-up with their unsafe ratios. They are trying to push nurses to have 8 patients on med-surg!! There definitely needs to be federal law instituting mandated nurse-patient ratios. Med-surg needs to change to no more than 4-5. With ratios like these they are asking for patient deaths .", "Interview Questions": "If I could use one word to describe this interview it would be stupid. "}, {"date": "28 Feb 2022", "title": "Patient Access Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical City Dallas", "Interview Descriptions": "Panel interview with leadership...Pretty easy questions to answer your typical questions you would expect. Everyone had positive attitudes and introduced themselves with their name and title. I was able to ask questions needed and also provided a salary I would like to receive which was offered to me.  The interview went well overall!", "Interview Questions": "Name a time you dealt with a difficult patient? How did you resolve the issue?"}, {"date": "28 Sept 2021", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical City Dallas", "Interview Descriptions": "Short 15 minute interview with two interviewers. Due to covid, the interview was online through Webex. Found out the result of my interview within a timely manner. Interview process went smoothly.", "Interview Questions": "Tell me about a time you had to work with a difficult patient."}], [{"date": "2 Aug 2021", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Medical City Dallas (Dallas, TX) in Aug 2021", "Interview Descriptions": "Communication with recruiters was prompt and professional. Interviewer asked me behavior and verbal questions. They were professional and light. Seems like a front like most management, but I am open minded and will protect myself as a new graduate nurse", "Interview Questions": "How do you place a NG tube in a patient?"}, {"date": "7 Aug 2021", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Medical City Dallas (Frisco, TX) in Jul 2021", "Interview Descriptions": "great interview good questions. The interview flowed very well. Felt like we made great connections. Be prepared to answer difficult questions that make you think.  The interview was short which was fine with me lol.", "Interview Questions": "How do you handle time management "}, {"date": "10 Apr 2022", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical City Dallas (Dallas, TX) in Jul 2021", "Interview Descriptions": "Easy process, met with the supervisors and the department coworkers.  It takes about 1 or 2 weeks to receive a call back from HR and they later send an email with offer.", "Interview Questions": "They asked about how what was my availability and my prior work experince"}, {"date": "23 Feb 2021", "title": "Nursing Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical City Dallas", "Interview Descriptions": "Process was simple and straightforward, there is a screening interview first and then leadership interview. If you do well you will get a peer interview and an optional additional interview with your speciality department.", "Interview Questions": "Tell me about a time you had to collaborate to meet a goal"}, {"date": "22 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Dallas", "Interview Descriptions": "It was pretty straightforward. Nice and professional is what I would use to describe the process and the manager who interviewed me. I didn’t run into any issues. Contacted by email.", "Interview Questions": "Scenario questions were asked mostly."}, {"date": "15 Nov 2020", "title": "Nurse Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical City Dallas", "Interview Descriptions": "Get two interviews, one is 15 minutes by phone, and the other is an on-site interview with the nurse manager and peer interview. Most questions are behavioral questions. Will get the result back in 1-2 days through email.", "Interview Questions": "Tell me a time you have to take care of a difficult patient and how did you handle it."}, {"date": "18 Mar 2020", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Medical City Dallas (Dallas, TX) in Mar 2020", "Interview Descriptions": "I attended the intern bash and was contacted by a recruiter to interview about a month after. The interview was about 45 minutes total. The first half was with a panel of managers and the second half was a peer interview.", "Interview Questions": "How to insert NGT "}, {"date": "24 Feb 2020", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical City Dallas", "Interview Descriptions": "At the Medical city intern bash you RSVP and send in your resume and unit preferences. Then if any of the units are interested in you, they contact you for an interview. At the interview I had 3 people interviewing me but it can range from 2-3 people interviewing you. You are put in a room with different units, but each have their own table. It's somewhat distracting, but I was able to tune other people out.", "Interview Questions": "basic behavioral questions"}, {"date": "16 Jan 2020", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical City Dallas (Dallas, TX) in Jan 2020", "Interview Descriptions": "2 part interview. 1st part with the coordinator and then with a panel. Was kind of intimidating with the panel because it was 4 people interviewing me at the same time in a small room. But overall they were all really sweet and  made me feel really comfortable.", "Interview Questions": "How do you manage stress at your job?"}, {"date": "7 Jun 2020", "title": "Nurse Resident Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Medical City Dallas (Dallas, TX) in Dec 2019", "Interview Descriptions": "Had a very difficult time getting into contact with recruiters in general and did not get any interviews at my first choices. I was offered an interview in an area I hadn’t applied to. It was an interview with a 4 person panel. Was offered job the next day.", "Interview Questions": "Describe a time you disappointed someone and how you handled it \r\n\r\nHow would you handle an angry family member? \r\n\r\nIf you had a set of described patients, who would you see first? "}], [{"date": "10 Oct 2019", "title": "Nurse Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Dallas (Dallas, TX)", "Interview Descriptions": "I signed up for an intern bash that would have multiple locations represented. I then received an email to set up a 15 minute interview at the event. I showed up and checked in, then went into a room and had a brief interview with you employees.", "Interview Questions": "Tell us about a time you had to think quickly on your feet"}, {"date": "27 Aug 2019", "title": "Nurse Resident Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical City Dallas (Dallas, TX)", "Interview Descriptions": "Received a phone screen from HR. Invited to interview on this phone call. Went in to interview a few weeks later.  Met with unit manager and a few others. Both were very pleasant and were receptive to my answers. They asked their questions from a packet and wrote down notes from my answers.", "Interview Questions": "What is one difficult situation you have had and how did you handle it?"}, {"date": "10 Apr 2019", "title": "Nurse Resident Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Dallas", "Interview Descriptions": "It was like a hiring mixer where you get a 15 min interview with the hospital and unit you want to work for. Could also have an opportunity to interview with other hospitals in the HCA system if they had an opening.", "Interview Questions": "Tell me a time about when you experienced a difficult patient? "}, {"date": "28 Jan 2019", "title": "Telemetry Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Medical City Dallas (Farmers Branch, TX) in Dec 2018", "Interview Descriptions": "I applied for tele tech PRN as it would fit with my other part time job at a medical clinic. I was offered an interview after applying online and went to DMC farmers branch to talk to the nurse supervisor in charge of the ICU. She was pleasant, but made it seem like I was hired on the spot. We took a tour of the Med Surg and general ward floors and I was able to meet tele techs on duty. When I inquired further about when I would hear back,  she said I would get an offer within a week. After a week of no contact, I sent a follow up email which also got no response. The follow up to this entire process was horrible on their side, and I wouldn’t recommend it if you’re trying to be treated professionally.", "Interview Questions": "Years of telemetry experience? Which rhythms are you experienced with ?"}, {"date": "31 Oct 2018", "title": "Supply Chain Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical City Dallas", "Interview Descriptions": "Interview was simple, basic questions, took a tour around the facility. Once job offer was made a urine drug screen followed. Process from start to finish was very lengthy, HR is very slow when processing your paperwork.", "Interview Questions": "How do you deal with tough situations?"}, {"date": "20 Sept 2018", "title": "Emergency Department RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical City Dallas (Dallas, TX)", "Interview Descriptions": "I applied online and was contacted via email by a recruiter to set up an initial phone screen. The phone screen was basic questions regarding my personal background and gathering more information about the position. The on-site interview occurred first with the manager, followed by a peer review.", "Interview Questions": "Roughly stated, but an example of a time when you had to multitask"}, {"date": "15 Mar 2018", "title": "Nurse Resident Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Medical City Dallas (Dallas, TX) in Feb 2018", "Interview Descriptions": "2 Part interview -> Panel interview with 4 hiring managers, combo of \"get to know you\" and NCLEX style questions, lasted approx. 30 mins.  2nd part was 5 staff nurses who asked various situational questions, lasted approx. 30 mins as well.", "Interview Questions": "Explain a time when you had a difficult patient and how you handled it and what was the outcome. "}, {"date": "29 Jan 2019", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Medical City Dallas (Dallas, TX) in Dec 2017", "Interview Descriptions": "I attended a job fair at a local restaurant and had a conversation with the managers that felt much more casual than a job interview.  It was the least stressful interview I've ever been through.", "Interview Questions": "Tell us about your nursing career."}, {"date": "23 Jun 2017", "title": "Multi Skilled Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical City Dallas (Dallas, TX) in Nov 2016", "Interview Descriptions": "interview process was very pleasant. Managers were extremely nice and explained the job details thoroughly. Even from the first handshake they were extremely nice and started small talk before the interview had even started. This definitely helped calm my nerves and be more confident about the interview process.", "Interview Questions": "Tell me about a time you and a coworker have had a disagreement and how it was resolved. "}], [{"date": "11 May 2016", "title": "Oncology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical City Dallas (Dallas, TX) in Apr 2016", "Interview Descriptions": "An online interview consisting of recording videos of my answers to questions was first. Then, i was called in for a 1-on-1 with the unit mgr. I was asked questions from a computer generated list prepared from a personality questionnaire I had taken when I applied online. After a brief tour of the floors, I sat down with 2 employees for a peer interview. The peer interview was very relaxed.", "Interview Questions": "Tell me about a time you questioned if nursing was the right field for you."}, {"date": "18 Feb 2016", "title": "Pediatric ER RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Medical City Dallas (Dallas, TX) in Dec 2015", "Interview Descriptions": "Panel interview. Was about one hour in length. Very friendly. A lot of priority scenario questions asked. Personality traits asked, and weaknesses. Overall it was a nice experience. I had not graduated yet or taken NCLEX, makes me wonder if I would have received an offer now if I had an interview. They have a 3 year contract stating that you will receive your BSN within the time frame.", "Interview Questions": "Do you prefer working worth adults or pediatrics?\r\nWhy?"}, {"date": "18 Dec 2018", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Medical City Dallas (Dallas, TX) in Jul 2014", "Interview Descriptions": "I was ask questions on how long do it take to clean and disinfect a patient room and do i know what to do if the chemical get in my eyes and how to respect the patients upon going into their room by greeting them and introducing yourself and asking if its ok to clean their room or should i come back at a later time", "Interview Questions": "Have i ever did this kind of eork before"}, {"date": "28 May 2014", "title": "RN Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Medical City Dallas", "Interview Descriptions": "Targeted selection panel and one on one, intimidating and scary, not organized, took a long time to call back, were not very friendly, not tour of unit, disorganized, was not happy with process", "Interview Questions": "why here?"}, {"date": "23 Feb 2012", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Medical City Dallas (Dallas, TX) in Jun 2011", "Interview Descriptions": "On the phone, interviewer asked several questions.  One of them was the current pay rate and what is my expectation?", "Interview Questions": "What is the ultimate goal?"}, {"date": "9 Mar 2011", "title": "Multi-Task Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Medical City Dallas (Dallas, TX) in Jan 2010", "Interview Descriptions": "Initial HR phone interview then a long personality-based online test. Then interviewed in person by HR. Then interviewed by unit manager, lead nurse, and supervisor together, (I hear they are doing peer-review interviews now) then skills test, then drug test.", "Interview Questions": "Describe what you would do if you had a problem with a coworker?"}]]