[[{"date": "13 May 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Franciscan Health (Indianapolis, IN)", "Interview Descriptions": "It was a telephonic interview through microsoft teams. It was not hard. Interviewer was approachable and friendly. Not to intimidating. Overall it was easy. Very smooth interview. Cons: The manager was later for the interview. Has to wait in teams for more than 30minutes", "Interview Questions": "Tell me how you handle difficult situation"}, {"date": "17 Apr 2023", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Franciscan Health", "Interview Descriptions": "Initially took a long time to respond to application. When I did get an interview, I didn't hear from them for several weeks. Then got a second interview and again, didn't hear anything for a few weeks and then got an offer.", "Interview Questions": "How to deal with difficult situation? Difficult patient? How did I handle a misfill situation?"}, {"date": "9 Feb 2023", "title": "Resident Physician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Franciscan Health", "Interview Descriptions": "met with two members of faculty at a time for twenty five minutes, five minutes down time between meetings. There are 3 separate meetings. Then meet with residents for one hour for questions", "Interview Questions": "What are your strenths and weeknesses?"}, {"date": "28 Oct 2022", "title": "Patient Care Nursing Assistant (PCNA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Franciscan Health (Indianapolis, IN) in Oct 2022", "Interview Descriptions": "It was great, they were super nice and thorough with their interview questions. But didn’t make it seem like they were intimidating. I recommend working here for a tech starting out.", "Interview Questions": "Why I want to work here"}, {"date": "1 Aug 2022", "title": "Scheduler Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Franciscan Health (Indianapolis, IN) in Jul 2022", "Interview Descriptions": "3 weeks to call for an interview. \nUsed a head hunter to find me. \nSpoke with headhunter then they set up the interview.  \nThen I spoke with my future Supervisor.", "Interview Questions": "Why did you apply for this position?"}, {"date": "3 Jun 2022", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Franciscan Health", "Interview Descriptions": "Interviewed with two managers from the department mediated by human resources.  Received a call from human resources with job offer after approximately one week.   Accepted the offer shortly after the interview.", "Interview Questions": "Tell me a little about yourself"}, {"date": "24 Feb 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Franciscan Health", "Interview Descriptions": "Applied, had all credentials, rich experience, excellent references — even held the job previously— and was never contacted by anyone. I had a referral and reference from someone currently employed.", "Interview Questions": "Was never contacted by anyone"}, {"date": "11 Nov 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Franciscan Health (Indianapolis, IN) in Jan 2022", "Interview Descriptions": "Very simple. Very common questions were asked. Consisted of one virtual interview for around 20 minutes. Laid back setting and very friendly. Be prepared to ask questions yourself so you come off as prepared.", "Interview Questions": "Why are you interested in our company?"}, {"date": "13 Jan 2022", "title": "Polysomnographic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Franciscan Health in Jan 2022", "Interview Descriptions": "Interviewed during Covid so process was all online or over the telephone. Applied and it took about 3 days for HR to send me an email inviting me to either Zoom or phone interview with the Sleep Lab manager. I did the call-in option and my phone and it was mostly chit-chatting with lots of questions about my resume, why I thought I would be a good fit at Fransiscan, etc. I thought that it was a bit difficult since it lasted for 1 1/2 hours, but I also hadn’t interviewed in a long time. Invited for a second interview via email about 2 days later which was another Zoom or phone option. 3 different interviewers present asking more questions from a packet that were similar to the ones posted on here. Reading through as many questions as you can and coming up with some things you might say will help greatly!", "Interview Questions": "Tell me about a time you dealt with a difficult or angry customer? Was the issue resolved?\r\n\r\nTell me about yourself?\r\n\r\nTell me about a time when you made an error in judgement? \r\n\r\nCould you tell me about the gap years in your resume?\r\n\r\n"}, {"date": "1 Jan 2022", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Franciscan Health", "Interview Descriptions": "On-time and pleasant. The interviewer asked a lot of questions, but I was prepared. It was a great experience. The application process was not too long. I think it will be a great place to work.", "Interview Questions": "What would make you a great candidate to work here?"}], [{"date": "14 Oct 2022", "title": "Medical Billing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Franciscan Health (Indianapolis, IN) in Dec 2021", "Interview Descriptions": "Easy, 2 interviews total. Interview with potential supervisor. Phone interview then 2 supervisors inter view you on teams call. Process took a couple of weeks start to finish. Very easy process Communication was good.", "Interview Questions": "Basic questions regarding medical claims etc"}, {"date": "19 Oct 2021", "title": "HR Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Franciscan Health", "Interview Descriptions": "First, I did the phone interview with HR manager to move forward to the second round interview. After about 2 weeks, I was offered to come in for in-person Interview. Second round interview last about 45 minutes with behavioral questions.", "Interview Questions": "Tell me about time when you made a mistake and how did you solve the issue? "}, {"date": "1 Oct 2021", "title": "Trainer Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Franciscan Health (Indianapolis, IN) in Sept 2021", "Interview Descriptions": "Start with introductions of all those on the interview panel.  Then they gave me time to ask questions of my own.  Then they moved on to behavioral interview questions based on the values and mission of Franciscan Health.", "Interview Questions": "Give an example of a time when you had to deal with a difficult client?  What did you do?"}, {"date": "30 Jun 2021", "title": "Certified Surgical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Franciscan Health", "Interview Descriptions": "You meet one time with 2 managers. Very easy going to talk to and fun conversations. They answer questions perfectly and make sure to really make you comfortable. its as if you've known them your whole life.", "Interview Questions": "they ask questions about surgery and what equipment you've worked with."}, {"date": "4 Jun 2021", "title": "Engagement Center Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Franciscan Health in May 2021", "Interview Descriptions": "Very nice and engaging interview. Took about six weeks from interview to offer. Started with HE recruiter responding to my online application. Then scheduled for a group interview with Manager, Director abd another supervisor. Very relaxed yet professional. Asked several scenario questions.", "Interview Questions": "How did\r\ndid you handle a difficult employee."}, {"date": "3 Apr 2021", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Franciscan Health", "Interview Descriptions": "Long process, call, interview then waiting. During the interview they ask you various questions. Then you need to wait for the hr department to get back to you. Then you sit through a presentation of the hospital.", "Interview Questions": "tell me about yourself.\r\nWhy are you interested in this job?"}, {"date": "15 Jun 2021", "title": "Patient Account Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Franciscan Health in Feb 2021", "Interview Descriptions": "Email response that asked for times that were convenient for phone interview. Brief interview over the phone that asked typical questions. They were kind and didn’t try to trick me in asking silly questions.  Made me feel comfortable.", "Interview Questions": "What is your greatest weakness"}, {"date": "26 Dec 2020", "title": "Health Screener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Franciscan Health", "Interview Descriptions": "Simple,  one interview. Then physical started three weeks after. Had to wait for clearance. Longest wait ever to start work. Orientation was online because of the virus. Simple orientation online allotted eight hours.", "Interview Questions": "Tell me a little about yourself?"}, {"date": "23 Jul 2022", "title": "Home Health RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Franciscan Health (Indianapolis, IN) in Aug 2020", "Interview Descriptions": "First a screener called me and asked a few questions and set up the interview with the clinic manager. It was a zoom interview with the clinic manager with standard questions for nurses. She was nice and professional and we laughed a lot because the picture kept glitching leaving us with funny faces frozen on the screen.", "Interview Questions": "How do you prioritize your day and they also asked about challenges  you identified and overcame."}, {"date": "16 Mar 2020", "title": "Food Service Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Franciscan Health", "Interview Descriptions": "Process took 2 weeks, first interview then online stuff. then orientation ( one day) then 3 days of “training”. Was very simple just was alot of back and forth with hiring management", "Interview Questions": "Working under pressure?"}], [{"date": "18 Feb 2020", "title": "Applications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Franciscan Health (Indianapolis, IN)", "Interview Descriptions": "Online application with link to submit resume and cover letter submission.  Then received email to  complete Predictive Index and submit 5 references. References are emailed reference questionnaire and are sent reminders until completed.   2 weeks later phone interview took place.", "Interview Questions": "Phone interview  was about 30 minutes, described position and then finished with a few questions.\r\n1.  What is your management style?\r\n2. What is your proudest accomplishment?\r\n3. How many staff have you managed?"}, {"date": "31 Mar 2020", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Franciscan Health (Greenwood, IN) in Feb 2020", "Interview Descriptions": "I was required to submit 5 references when applying for the position, which required links to be sent out to your references and then wait for them to fill out. My references responded quickly. Also was required to take the Predictive Index before the interview.\r\nAfter applying, I received a call to set up a phone interview. The phone interview was scheduled eighteen days in the future. The phone call lasted one hour and went well. It was with the hiring manager and a technical analyst. Hiring manager even said interview went well on the phone before we hung up. Was told the next steps were to setup an in person interview the following week. \r\nI followed up the following week and hiring manager said that she just had not gotten to scheduling it. I followed up again via email and never got a response. I did not even get a system response of they selected another candidate, or the position was froze, just ghosted completely. And that is sad, because I spent a good amount of time researching Franciscan and the hiring manager and she had an impressive history with the hospital and had held many executive level positions in the company. I respected her and the accomplishments and her servant leadership. \r\nEveryone is busy but shouldn’t ever be too busy to communicate a simple thanks but no thanks. People can handle rejection, but when companies and hiring managers, at the least someone in HR, refuse to communicate at all, it is unprofessional! \r\nEven their applicant portal does not update.", "Interview Questions": "No unexpected questions, truly felt like more a conversation where information came out, without it being a standard interrogation for answers"}, {"date": "3 Dec 2019", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Franciscan Health in Nov 2019", "Interview Descriptions": "After applying, I received a call to set up a screening interview.\r\nBefore the screening interview could take place, I was required to submit 5 references.\r\nThis was a red flag; a normal application wouldn't ask for references until later in the process.\r\nScreening interview was scheduled as a 30 min call.\r\nThere were 11 mins of her asking me questions, and she gave me no opportunities to ask about the job, the company, or the environment.\r\nShe ended the call with \"we might call in you a week or two, but maybe not. Check our candidate profile page if you want more information.\"", "Interview Questions": "All questions were pretty straight-forward for a phone-screening. The interview was remarkable in it's lack of personality, empathy, conversation..."}, {"date": "20 Dec 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Franciscan Health", "Interview Descriptions": "Short. Very comfortable. They had me talk about myself rather than ask questions about me. Very open to having me ask questions about their unit. I liked how descriptive they were in their replies.", "Interview Questions": "What shift would I be applying for?"}, {"date": "1 Oct 2019", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Franciscan Health (Indianapolis, IN) in Dec 2018", "Interview Descriptions": "Met at Career Fair. Phone Interview few weeks later. In person interview at company in Indy another few weeks after that. Very behavioral, friendly, and candidate oriented. Heard back very quickly", "Interview Questions": "Tell me about conflicts on a team"}, {"date": "29 Nov 2018", "title": "PSR Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Franciscan Health", "Interview Descriptions": "Put in several applications. About a month later received a phone call from HR and did a phone interview. Had face to face interview with HR, practice manager, and operations manager the following week. Offered me the position the same day.", "Interview Questions": "How would you deal with an angry patient?"}, {"date": "4 Jan 2019", "title": "Collections Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Franciscan Health in Nov 2018", "Interview Descriptions": "First was a phone call to set up a phone screening.  A phone screening was set up for weeks later, which went great.  Then a few days later they called to schedule an in-person interview, weeks away.  When interview day finally arrived, I was kept waiting for nearly an hour past my set interview time, which was fairly early in the morning. Finally got in and met with 3 people. They asked basic questions and asked for examples from my work experience. I had good answers for all and conversed easily, as I was over-qualified for the position but was looking for a better work-life balance with a PT job. They thanked me and said I would hear either way in a couple of weeks.  Never heard a word and my status online never changed.  I followed up with them after a month and finally received a response to my inquiry on New Years Eve that they didn't want to hire me.  I'm fine with not working there, particularly after learning that they charge Part Time people extra for insurance and I would be required to take it and term my enrollment on my husband's much better & cheaper plan, but feel they were disrespectful of my time and my investment in never getting back to me as they stated they would.  The whole thing ended up taking 3 whole months.  Total waste of time.", "Interview Questions": "What does EOB stand for?\r\n"}, {"date": "31 Oct 2018", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Franciscan Health", "Interview Descriptions": "Very laid back yet informative, received a thorough tour of the facility and was able to interact with the friendly staff in doing so. The interviewer was very honest and transparent in all aspects of the job, the commute, etc.", "Interview Questions": "Tell me a little about yourself."}, {"date": "27 Jul 2018", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Franciscan Health", "Interview Descriptions": "Very positive,  great feedback.  Great environment.  Touching a lot of lives. Making decisions for patients safe discharges. Great team members needed.  collaboration with several kinds of disciplines is a must .  Hours vary. Emergency room experience is a plus.", "Interview Questions": "Are you able to accept criticism,  how do you react when your given feedback?"}, {"date": "6 Jul 2018", "title": "Clinical Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Franciscan Health", "Interview Descriptions": "Applied online and contacted shortly thereafter for an interview.  Phone interview was conference style with several managers.  Inquired about next steps and assured I would here something within a couple of weeks.  Followed up again and given another timeframe for follow up.  Emailed and kept being given a myriad of excuses of why the position was not moving forward.  No honesty where follow up is concerned.  The whole process was very disjointed.", "Interview Questions": "Why do you think you’d be a good fit for this position?"}], [{"date": "10 Jul 2018", "title": "EVS Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Franciscan Health (Michigan City, IN) in Jun 2018", "Interview Descriptions": "I was called by the manager and set up interview .  We met in the HR department that wasn't to far from the EVS Office.  Everyone was polite.  I believe they were looking for someone a little closer than I was as for location.", "Interview Questions": "What was your most challenging experience?"}, {"date": "30 Mar 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Franciscan Health (Olympia Fields, IL) in Mar 2018", "Interview Descriptions": "I went to an Open House, where there were multiple managers from various units. I interviewed for telemetry floor and medical surgical floors. It was about 4 weeks later when I was contacted. They did give me an update after two weeks to inform me that I am still in the running. Each manager was different. One simply asked me to tell them about myself, the next manager asked me about myself and a few other questions, but for the most part she talked about the unit. Finally the last manager asked me the standard strength/weakness, Describe a conflict between a boss and  difficult patient.", "Interview Questions": "Tell me about yourself. "}, {"date": "18 Mar 2018", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Franciscan Health (Lafayette, IN) in Feb 2018", "Interview Descriptions": "Group interviews with behavior based questions after screening interview. There were people from several functions present at the interview. Very informative process upfront. Although it did not work out for me, this is a very good company to work for.", "Interview Questions": "Describe you had to work with a difficult co-worker. What was scenario and how did you address it?"}, {"date": "9 Feb 2022", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Franciscan Health (Olympia Fields, IL) in Feb 2018", "Interview Descriptions": "HR will contact you, you’ll interview with unit manager! HR can be unprofessional as far as follow up, however staff is nice enough. Standard interview questions such as , “why do you want to work for the organization?” They need nurses so they are not looking for the most in depth answers.", "Interview Questions": "Tell us about yourself, please "}, {"date": "6 Feb 2018", "title": "Cardiac Cath Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Franciscan Health (Lafayette, IN) in Nov 2017", "Interview Descriptions": "Interviewers and Supervisors got back to me very quickly.  It was an overall pleasant experience. They used both email and Phone calls to keep in touch with me and the interview was about 1 hour long.  It was more of a conversation.  I got 2/3 jobs I applied for at this hospital.", "Interview Questions": "Q: will you be able to work on call?\r\nQ: Give me an example of when someone in the workplace did something you didn't like. How did you respond?"}, {"date": "3 Oct 2017", "title": "Advanced Practice Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at Franciscan Health", "Interview Descriptions": "No interview was performed for the position as it was Franciscan acquiring the current facility I work for. It was very chaotic and diaorganized. It makes me very disappointed as I was looking forward to working for Franciscan again.", "Interview Questions": "Company acquisition "}, {"date": "7 Feb 2019", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Franciscan Health in Sept 2017", "Interview Descriptions": "they are all for advancement and you can tell with the questions they asked about pursuing school. I really felt comfortable enough to express my plans to do so and to advance within the company.", "Interview Questions": "will you be furthering your education"}, {"date": "1 Oct 2021", "title": "Billing Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Franciscan Health (Olympia Fields, IL) in Aug 2017", "Interview Descriptions": "They are very thorough in interview process.  Be prepared. They want to make sure they are picking the best candidate. They used many open ended questions to get to know you and understand your decision making skills.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "27 Oct 2021", "title": "Speech Language Pathologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Franciscan Health (Indianapolis, IN) in Jun 2017", "Interview Descriptions": "Two step. First step included a phone interview with general questions. Second interview included more situational questions and a better understanding of job expectations. Overall fairly generic and typical interview questions", "Interview Questions": "How would you handle… etc."}, {"date": "26 May 2017", "title": "Food Service Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Franciscan Health (Indianapolis, IN) in Jan 2017", "Interview Descriptions": "Very in depth. Everything I brought up got checked. The interview was lengthy but pleasant. They explained the job accurately and did not promised me a rose garden. They answer all the questions I asked, this helped me on making the decision to work there.", "Interview Questions": "What were my primary demands from a job"}], [{"date": "6 Jan 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Franciscan Health (Indianapolis, IN) in Dec 2016", "Interview Descriptions": "Very friendly they had such questions about certain situations and what you would do also asked you about your experience then they give you a tour and if they like you they'll ask you to do a shadow", "Interview Questions": "What would you do with an angry patient and or employee? "}, {"date": "29 Dec 2016", "title": "Collections Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Franciscan Health (Greenwood, IN) in Dec 2016", "Interview Descriptions": "I was hired through an employment agency for this position. I met with the management a few days after speaking with Aerotek. The interview was comfortable and straight to the point. Management was nice to speak with. They do require a flu shot, background check, and drug test. After the interview, I was offered the position in about 24 hours.", "Interview Questions": "What is an EOB?"}, {"date": "11 Aug 2016", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Franciscan Health (Indianapolis, IN)", "Interview Descriptions": "Started with a telephone interview by HR to assess general information.  Interview was approximately 45 minutes that involved explanation of company and benefits and about 10-12 questions about my interests, future plans, skills and strengths and weaknesses.", "Interview Questions": "What do you feel you can contribute to this position that makes you more valuable than other candidates."}, {"date": "8 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Franciscan Health (Indianapolis, IN) in Jul 2016", "Interview Descriptions": "I met with the recruiter in the lobby before my interview who was very kind and spoke with me some about the hospital. She then took me to who I would interview with who was also very kind. They asked some of the basic questions then answered any questions I had. After this came the unit tour - very informative.", "Interview Questions": "Tell me a little about you. "}, {"date": "7 Jun 2016", "title": "Patient Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Franciscan Health", "Interview Descriptions": "Sat with HR and manager in interview. It was really easy going. They were both kind and not too intimidating. Just come off like you're excited for the opportunity and have examples of going out of your way for customers/ guests/ patients.", "Interview Questions": "They were really focusing on questions that had to do with customer service."}, {"date": "14 Sept 2016", "title": "Sales Lead Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Franciscan Health (San Mateo, CA) in Jun 2016", "Interview Descriptions": "Applied for the job on a Monday. Talked to a recruiter on Wednesday. Interviewed in the office on Friday. Had a job offered given to me on Monday. Given the week to accept, ended up taking another job at another firm. Overall the interview process was laid back and they were very chill during the whole process.", "Interview Questions": "Why Sales?"}, {"date": "30 Aug 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Franciscan Health (Michigan City, IN) in May 2016", "Interview Descriptions": "The interview was very relaxed, management asked a lot of  questions about level of skills and education background. Management was also informative on what the position entails as well as what is expected of the potential employee.", "Interview Questions": "how fast can you type? "}, {"date": "8 Nov 2018", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Franciscan Health (Crown Point, IN) in Apr 2016", "Interview Descriptions": "Simple, standard questions about experience and job duties. Hiring process took a few days, an offer was made, then I had to complete some online forms. The longest portion was waiting on the background check to come in.", "Interview Questions": "Describe a time when you messed up, how did you handle it, what did you do to fix it or make amends. "}, {"date": "23 Jul 2016", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Franciscan Health (Indianapolis, IN) in Mar 2016", "Interview Descriptions": "They meet me and arranged the interview, had an interview then never contacted me again, to tell me that I got or did not get the position.  The recruiter is too busy to answer calls or follow up.", "Interview Questions": "The provider that would have been my collaborator did not even ask a question, it was as if he was being forced to attend the interview."}, {"date": "22 Mar 2016", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Franciscan Health (Chicago Heights, IL) in Feb 2016", "Interview Descriptions": "First step was an phone interview. HR calls and asks a few question, they then called me in for a formal interview with HR to discuss the position. Afterwards I met with the manager in the department of the hospital I'd be working at and got hired on the spot. They seemed to really need people.", "Interview Questions": "What's your weakness?"}], [{"date": "23 Dec 2016", "title": "Trainer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Franciscan Health (Hammond, IN) in Jan 2016", "Interview Descriptions": "Phone interview with HR \r\nIn-person interview with Director and Team Lead \r\nIn-person interview with a couple team members \r\n15 Minute Training Presentation -  topic of my choice; had to teach/train a group of would-be peers", "Interview Questions": "A few, \"tell me about a time questions\"."}, {"date": "25 Feb 2016", "title": "Internist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Franciscan Health (Indianapolis, IN) in Nov 2015", "Interview Descriptions": "Had a meeting with the director and discussed the position along with what I was hoping to gain from the internship. She was very nice and answered all the questions I had during the process.", "Interview Questions": "Why I was interested in corporate wellness?"}, {"date": "2 Aug 2017", "title": "Nationally Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Franciscan Health (Indianapolis, IN) in Oct 2015", "Interview Descriptions": "I had two interviews, one with the operational manager and the manager over the techs after the drug test and background check. Overall the process was very easy. I would recommend wearing business casual clothing.", "Interview Questions": "How would you handle taking a phone call from an angry doctor or nurse?"}, {"date": "14 Sept 2015", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Franciscan Health", "Interview Descriptions": "I had a great interview experience. I was asked thoughtful and original questions and follow up questions based on my answer. My interviewer was very pleasant and easy to talk to.", "Interview Questions": "Have you had experience dealing with a difficult customer? Describe the situation and how did you solve the issue?"}, {"date": "8 Mar 2017", "title": "Fitness Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Franciscan Health (Chicago Heights, IL) in Jul 2015", "Interview Descriptions": "The interview process consist of a general interview based on experience and education. The interview to follow consist of a demonstration of whatever your specialty i; personal training, group fitness instruction, etc. overall the interview process was very laid back.", "Interview Questions": "Where do you see yourself in the next 5 to 10 years."}, {"date": "18 Jul 2015", "title": "Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Franciscan Health (Olympia Fields, IL) in Mar 2015", "Interview Descriptions": "unorganized, lacking information and two of the three interviewing were unprofessional and well, strange. I did not get a good feel for the job, the appearance given seemed fake and forced. I was not comfortable and glad I did not hear from them. I assume they hired another person who would have enjoyed working for two incompetent people.", "Interview Questions": "So what kinds of journal entries are you familiar with? it was a strangely worded question and vague in relation to the position. "}, {"date": "1 Jan 2016", "title": "Unit Clerk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Franciscan Health (Dyer, IN) in Feb 2015", "Interview Descriptions": "Applied with resume I came in was told they picked someone else. No questions , no conversation\r\nJob was given to someone with less experience. Some people that applied were not even interviewed", "Interview Questions": "N/A"}, {"date": "23 May 2017", "title": "Physician Liaison Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Franciscan Health (Indianapolis, IN) in Feb 2015", "Interview Descriptions": "Interviewed with peer and manager in a conference room setting after a phone screen with recruitment and several follow up emails. The interview was just a Q&A and the peer was really the one deciding if she could work with me, she had previously already been doing the job herself for 15+ years and needed help, however already gone through another person that she didn't like.", "Interview Questions": "What was my experience working with Cardiac Physicians?"}, {"date": "21 Nov 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Franciscan Health", "Interview Descriptions": "This occurred too long ago to remember the details.  Nothing was unexpected about the process.  Everything is online now which can make it difficult to get in the door for an interview.", "Interview Questions": "I don't recall any difficult or unexpected questions during the interview process"}, {"date": "20 Oct 2014", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Franciscan Health", "Interview Descriptions": "The interview process was great. The HR director was on time and very kind. Was asked most of the usual questions. Went over application and was asked about previous employment. Went over what the job entailed. Wanted to make sure that I was able to work nights, weekends and holidays even though I mainly worked the 1st shift. I had to take a typing test and had to make 40WPM with few or no errors. If you didn't pass it you had about 3 tries to do so. You had to be able to pass a drug screening and background check.", "Interview Questions": "N/A"}], [{"date": "16 Sept 2015", "title": "Regional Clinical Quality Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Franciscan Health (Munster, IN) in Oct 2014", "Interview Descriptions": "Called in for initial interview.  Pretty standard.  Reviewed hospital closing process.  Took a long time from initial interview to start date.  Probably six weeks.  Hiring needs a lot of approvals from various boards and management.  No odd interview questions.  Didn't feel that they were trying to evaluate my thought processes.", "Interview Questions": "How familiar are you with hospital statistics reporting?"}, {"date": "14 Mar 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Franciscan Health (Hammond, IN) in Sept 2014", "Interview Descriptions": "Very detailed  with lots of information  about  about the position and the foundation of the facilities and franciscan alliance values and mission . It's a three step process ,and a great company", "Interview Questions": "What makes you a great candidate for this position "}, {"date": "27 Jul 2015", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Franciscan Health (Indianapolis, IN) in Sept 2014", "Interview Descriptions": "The conversation was very laid back and easy to converse with the interviewers. Good experience overall. Prior healthcare experience or a health related education is valuable. I had no healthcare experience when interviewed, but I utilized my strong academic background to answer most of the questions.", "Interview Questions": "Describe a situation when you and an employee did not agree on something? How was it resolved?"}, {"date": "18 Oct 2016", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Franciscan Health (Indianapolis, IN) in Jul 2014", "Interview Descriptions": "The interview process was with the manager of the unit as well as a couple of the shift managers or PCCs. Overall it was your standard interview and I believe I heard from them after two weeks. After the interview they had me come in and shadow and have the staff evaluate me. After this they offered me the position.", "Interview Questions": "The standard questions except for they asked if you could have your own build board and could use 3 words to describe yourself, what would they be?"}, {"date": "10 Mar 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Franciscan Health", "Interview Descriptions": "Applied for a job position online, called about position about 3 months later.  Took a telemetry strip test and medication test first, then met with HR. Interview took about an hour total.  HR set up next appointment to meet manager of the floor which was about a week later.  Met with manager a week later, another round of basic interview questions, was taken around floor, introduced to staff.  Received a job offer 2 days later.", "Interview Questions": "How would you deal with a difficult patient?"}, {"date": "23 Jan 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Franciscan Health in Mar 2014", "Interview Descriptions": "Total time for process 2.5 weeks. Applied for specific unit/floor online. Interviewed first with HR representative to assess basic components. Then went on to meet with specific unit manager. Interested in prior experience and qualifications, and if I would be ready to meet demands of unit.", "Interview Questions": "What has been the most difficult obstacle you've overcame?"}, {"date": "16 Apr 2018", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Franciscan Health (Hammond, IN) in Jan 2014", "Interview Descriptions": "first step wa HR interview. After few weeks got call for interview with manager. Typical interview questions. Relaxed friendly atmosphere. Second step was group interview with current employees.l again friendly relaxed atmosphere", "Interview Questions": "10 yr goal"}, {"date": "6 Jul 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Franciscan Health in Jan 2014", "Interview Descriptions": "Lengthy, almost gave up on the job, but they called and everything seemed to proceed well till the interview, then waited about 2-3 weeks before recieving a call.", "Interview Questions": "Do you handle surprises well?"}, {"date": "17 May 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Franciscan Health (Olympia Fields, IL) in Aug 2013", "Interview Descriptions": "A quick meeting with HR and then an interview with Hiring Manager.  There is also a med test and an EKG test.  The entire process took approximately 2 hours.", "Interview Questions": "What are your strengths?"}, {"date": "15 Feb 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Franciscan Health (Indianapolis, IN) in Jul 2013", "Interview Descriptions": "You are granted a interview with management first and the one with peers and or other employees.  The process benefits both sides and gives a overall better picture of the job.  The impact seems to give new employees more confidence in the beginning of the job.", "Interview Questions": "Tell a time when you used x value to drive your daily work and how that impacted the customer."}], [{"date": "22 Nov 2016", "title": "Reaspiratory Therapy Departemt Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Franciscan Health (Hammond, IN) in Jul 2012", "Interview Descriptions": "I met with the Medical Director, Department Director and all Supervisors of the department and was asked questions related to the supervisor job description. In addition I was presented with scenarios of potential problems a supervisor may face and asked how I would handle the particular situations. Next I was taken on a tour of the hospital facility by a supervisor detailing what my particular role would be.\r\nThe Medical Director described major department needs and asked how would I address and improve their needs especially in writing/developing patient care protocols. I had 1 on 1 private interviews with the Department Director to discuss benefits and salary and how important it was to get up to speed on the computer skills. Lastly, I interviewed with Supervisory and ancillary staff in a round table type Q & A session. I felt I handled the questions well and admitted what I did not know, remained honest and professional and enthusiastic about becoming an integral part of the changes the department was facing. I wanted to lead as a change agent with lots of ideas and experience.", "Interview Questions": "Why did I choose to work there? What could I do to make a difference? Would I be able to meet the needs facing the department?"}, {"date": "29 Dec 2015", "title": "Rehab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Franciscan Health (Lafayette, IN) in Jun 2012", "Interview Descriptions": "I had two interviews scheduled mainly due to my difficult schedule to work around, but they were very accommodating and willing to hire me to work even a few hours a day. Basic questions were asked about my patient care experience and leadership experience.", "Interview Questions": "Do you have any patient care experience?"}, {"date": "11 Sept 2015", "title": "Applications Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Franciscan Health (Beech Grove, IN) in Mar 2012", "Interview Descriptions": "Phone then face to face with hiring manager. Didn't get to interview with associates. Panel interview with another person also on the phone. They paid for me to travel to them which was nice. Felt rushed during interview. Was unclear what position or team I was interviewing for.", "Interview Questions": "Tell us about a time when...."}, {"date": "16 Sept 2015", "title": "Several Office Positions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Franciscan Health (Beech Grove, IN) in Feb 2011", "Interview Descriptions": "in person interview with a few members of staff; secured building, very, very nice staff- make you feel like you are part of the family during the interview so it really adds to the disappointment when you don't get it. You really think they like you. \"And the Oscar goes to...\"", "Interview Questions": "typical behavioral questions- nothing original"}]]