[[{"date": "27 Jun 2023", "title": "Knowledge Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at WES", "Interview Descriptions": "Applied, got an email to set up an interview and came to the office for the in person interview. Interview was about 30 min. Heard back from them about one week later.", "Interview Questions": "Behavioral and how does your past experience help with the current work."}, {"date": "25 May 2022", "title": "Program Evaluation Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at WES", "Interview Descriptions": "I was invited to participate in a phone interview by email, about one week after applying. I provided my availability in response to an email, and then heard back days later, “can you interview today [in next four hours]?” I obliged because I was still available. The interviewer was from HR initially said, “please be brief in your responses, this interview is only 45 minutes long and we need to get through the entire set of questions.” I responded concisely, barely expanding upon my experience and the interviewer still interrupted me, making me feel like I needed to rush to get through all the questions. Interviewer was also speaking so quickly, I needed the question to be repeated and I felt like the interviewer wasn’t paying attention. After all that, the interview lasted 15 minutes. If I get selected to move on to the next interview, I plan to turn them down.  The process was too unprofessional and I don’t think I would feel comfortable working here. I was told the next step after this preliminary HR interview would be to complete an assignment, then participate in a panel interview.", "Interview Questions": "What does World Education Services do?"}, {"date": "14 May 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at WES (New York, NY) in Apr 2022", "Interview Descriptions": "I applied to the position and was contacted after two months for an interview via email. I was very excited and had two consecutive interviews the same week. First was a screening phone interview with a recruiter in which I explained that my unemployment gaps because of COVID and I decided to switch my career path (hence, that’s why I am applying to jobs). The person was unprofessional when I spoke about what I was doing while I didn’t  have a full time position for over year. I explained that I work as a freelancer on projects and volunteer my time while extensively looking for a job. Frankly, I was disappointed but still wanted to continue with the interview. Looking for a job in 2021 and then now 2022 has been emotionally draining and everyone seem to be ghosting candidate (at least my experience so far). I kept my cool and then they contacted me the next day for a meeting for the following day with the hiring manager and I was very excited speaking to them and moving forward within the process. The interview went well from what I can say, they seemed  to be impressed with my background and career. The hiring manager informed me that I should hear back in two weeks since they were other interviews scheduled with other candidates (fair enough). I expressed my enthusiasm and I didn’t followed up until two weeks after the interview. I followed up with the recruiter and they  told me that they haven’t heard anything from the hiring manager and they will keep me posted. I was never contacted for an update and basically they’ve ghosted me. I understand that I might not be the right candidate for everyone but I am a person who took time out of my schedule to apply, speak to the employer over the phone, and prepared for the interview. The very least they could do is keep me updated after the interview. After this experience, I wouldn’t be interviewing or applying anymore to this company. Thanks for another useless waste of my time.", "Interview Questions": "They kept asking about the gaps in my resume. They didn’t care about my skills or personality. Every question led to my unfortunate gap in my resume. "}, {"date": "25 May 2021", "title": "IT Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at WES in May 2021", "Interview Descriptions": "Online application, phone interview, video interview.\n\nThe recruiter was late for the phone interview. The most important question is what your salary requirements are. Asked me a few times and lowballed me (way BELOW average). Could not answer technical questions, questions were answered with “it is in the job posting”. Scheduled second round, took 4 days to get the confirmation. Second person was on time, but the conversation felt like pulling teeth.\n\nFollowed up a week later, did not get a response. In the meantime, received an invitation for first round of interviews again, after pointing out the mistake I received a rejection email.", "Interview Questions": "What are your salary requirements?"}, {"date": "23 Mar 2022", "title": "Associate Software Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at WES (New York, NY) in Jan 2021", "Interview Descriptions": "It was 2 round interview. 1 round with a panel of 2 engineers, easy LC level coding questions. 2nd with bigger group mostly behavior questions. Overall experience was pretty good. Process was quick and everyone was friendly.", "Interview Questions": "Write a program that iterates up to  n number, prints Fizz when number is divisible by 3, Buzz when 5 and FizzBuzz when 15 (divisible of both 3 and 5)"}, {"date": "29 Nov 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at WES in Jan 2021", "Interview Descriptions": "Went through 4 rounds of interviews and work project over 6 weeks to be told they decided to reconfigure the position and hire internally. Recruiter was fairly communicative until the end, when they must have changed their mind and then it took several emails to get a response.", "Interview Questions": "Why are you interested in our organization?"}, {"date": "1 Sept 2020", "title": "Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at WES", "Interview Descriptions": "Interviewed over Skype. I was interviewed by the Hiring Manager and the Director of the department, both were very knowledgeable and informative about the position and company. Overall, great interview and it even ended a bit earlier than anticipated. Follow up after was relatively fast.", "Interview Questions": "Why do you want this job?"}, {"date": "18 Sept 2019", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at WES", "Interview Descriptions": "During the early stages of the interview process, I felt that the HR team at WES was very professional and prompt in their responses. I had an initial phone interview with a member of the HR team then was contacted about a Skype interview with the head of the department I would be working with along with another team member. While I was often told one thing about the timeline, it tended to take longer than they estimated. I finally did a writing task as part of a final round and was told they would make their decision after that. \r\n\r\nI was shocked to receive an email after going through all three rounds of the interview process that the hiring manager had decided to \"restructure the role\" and closed the posting.  I'm really questioning their professionalism and preparedness to hire a new employee if they decided after going through the complete interview process that they wanted something totally different.", "Interview Questions": "What do you know about WES and why are you interested in working for this organization?"}, {"date": "2 Aug 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at WES (New York, NY) in Jul 2019", "Interview Descriptions": "The interview itself was very informative and just basic questions about yourself and career goals. I sent a follow up email thanking them and 2 weeks later was rejected. When I emailed them again asking what I could improve on, I never receieved an response back despite the interviewer saying that she would love to give me feedback on how I did..", "Interview Questions": "Why Wes?"}, {"date": "31 Oct 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at WES (Research Triangle Park, NC) in Jan 2017", "Interview Descriptions": "Took two days but people were friendly.  I enjoy working here and am glad I received an offer. There is an on-site gym and daycare and paid maternity and paternity leave.", "Interview Questions": "Do you see yourself working here in 2 years."}], [{"date": "7 Jan 2016", "title": "Marketing Team Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at WES (New York, NY) in Dec 2015", "Interview Descriptions": "phone interview --> in-person interview \r\n\r\nI put \"no offer\" because I never heard anything from them after my in-person interview. I was disappointed by this because WES seemed like a very professional group of people, but I guess I was wrong. Also could explain why their Glassdoor ratings are so low and their employees leave after 6 months for greener pastures.", "Interview Questions": "Q: what are your long-term career goals?"}, {"date": "9 Dec 2015", "title": "Logistics Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at WES (New York, NY) in Nov 2015", "Interview Descriptions": "The interview took about two hours, an hour asking questions and another taking a required test, the test purpose is to test how well you pay attention to details. The test has three part, the first part test your detail skills, the second reading a passage and answering questions, and the last looking to find errors in foreign school transcripts.", "Interview Questions": "What is your best professional quality?"}, {"date": "13 Mar 2016", "title": "Mail Processor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6+ months. I interviewed at WES (New York, NY) in Nov 2015", "Interview Descriptions": "There was no interview process while working at WES. It was a contract position and work started at the same day. i was explained what the tasks were going to be and I did them", "Interview Questions": "N/A"}, {"date": "30 May 2015", "title": "Credential Evaluator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at WES (New York, NY) in Apr 2015", "Interview Descriptions": "Process overall took a short time. There is no reception so you have to ask a random person in the hallway to guide you to your HR contact. Interview took 30/40 minutes. Very straightforward questions. Couple of people in the room, but only 1 or 2 ask questions. Friendly atmosphere. Job description online was very much what was discussed in the interview.", "Interview Questions": "Are you okay with repetitive tasks?\r\nAre you able to put very close attention to detail?"}, {"date": "26 Mar 2015", "title": "International Credential Evaluator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at WES", "Interview Descriptions": "panel interview with group manager and other evaluators. Questions from really one person, the rest just sat there like they were mandated to interview me. Interviewer is the assistant director who is nice, however you will not work with him directly. Depending on the group you are assigned to will determine your overall stress level for the job. Some managers are nice and will do what they can but power is very limited for everyone who is not one of the 3 bosses.", "Interview Questions": "Do you pay attention to detail? Do you mind doing monotonous work?"}, {"date": "18 Aug 2014", "title": "Credential Evaluator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at WES", "Interview Descriptions": "Tell a little bit about yourself and how you qualify for this position, Language skills that you have. How detail oriented are you? How well you work in a group or you prefer working individually.", "Interview Questions": "Are you comfortable with doing repetitive work for a long period of  time?"}, {"date": "8 Nov 2016", "title": "International Credential Evaluator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at WES (New York, NY) in Mar 2012", "Interview Descriptions": "Simple. Straightforward. 2 interviews. One with HR and group manager. Next one with Director and group manager. There was a test afterwards on education credentials and how to find them online. Not sure if they still do this test.", "Interview Questions": "Strengths, why do you want to work here. Questions may have changed since years ago."}, {"date": "21 Aug 2012", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at WES (New York, NY) in Feb 2011", "Interview Descriptions": "Pretty structured and professional. Went through an initial interview, where I was given authentic documents in another language to review and answer questions correctly. I was interviewed by the people I was going to work with. During the second interview, I was interviewed by the department head and the group manager.", "Interview Questions": "N/A"}, {"date": "8 May 2010", "title": "Education Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at WES (New York, NY) in Sept 2008", "Interview Descriptions": "I've waiting for an interview for a few months. However, I was offered the job right after the interview.", "Interview Questions": "Why WES?"}]]