[[{"date": "16 Feb 2023", "title": "Refuge Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Refuge ", "Interview Descriptions": "a mix of simple competency and DV specific questions which lasted 1 hour + 30 minute writing task. Interviewers introduced the role and organisation and made you feel relaxed and at ease.", "Interview Questions": "could you tell us about a piece of legislation related to DV."}, {"date": "29 Nov 2022", "title": "People Development Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Refuge  in Nov 2022", "Interview Descriptions": "50 minute virtual interview with a panel of 3. No niceties, met with silence when attempted a basic 'nicety' of \"Nice to meet you all\". 10 min presentation on a pre-prepared topic with no questions from the interviewers. They then ping-ponged through mainly competency-based questions that they were asking all the candidates. I was asked \"What makes you the best candidate against the others\" which is a terrible question as we all know! Was allowed to ask 2 questions at the end, with only a few minutes to go before the end of the interview as their timings didn't allow for any time to reflect on my answers. As it was a 'one-and-done' interview, I asked if they had any reservations about my experience or answers that I could answer, to which I received a very hostile refusal to answer such a question. I knew there and then that I wasn't going to get the job! In this day and age, it's a very usual question! I received a generic 'unsuccessful' email a few days later offering feedback if I wanted it. It's been nearly 3 weeks and my request for feedback has been completely ignored.", "Interview Questions": "Do you currently manage a team?"}, {"date": "10 Oct 2022", "title": "Child Support Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Refuge  in Oct 2022", "Interview Descriptions": "The 30 minute test is using Microsoft Word, and you need to send the file before the interview starts. \r\nAfter submitting the answer, the 30 to 60 minutes of interview is taken.", "Interview Questions": "Could you explain the different forms of domestic violence?"}, {"date": "22 Sept 2022", "title": "Refuge Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Refuge ", "Interview Descriptions": "Lovely panel, online interview, they asked ten questions after completing a test. Really kind, the panel took the time to pause and digest what was said, then asked engaging follow up questions. Also the interview started with a  five minute get to know chat which was great.", "Interview Questions": "Tell me about yourself? \r\nHow do your experiences make you suitable for this role? \r\nHow would you deal with [X] scenario?"}, {"date": "23 May 2023", "title": "Fundraising Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Refuge  (London, England) in Sept 2022", "Interview Descriptions": "Video call interview, but despite that interviewers were really friendly and engaging. Asked typical questions about experience and expected me to have a strong understanding of the charity and what they do to support women.", "Interview Questions": "What previous experience do you have that would make you a good fit for this role?"}, {"date": "19 Sept 2022", "title": "Domestic Abuse Helpline Volunteer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Refuge  in Aug 2022", "Interview Descriptions": "Contacted with a week or so of application deadline closing, and offered a wide range of options for interview timings.    Interview was 45 mins via zoom.  Interviewers were very friendly and informative about the role", "Interview Questions": "Why do you want to work for Refuge?\r\nWhat do you know about the different types of domestic abuse?\r\nWhy do you think you'd be suited to this role?\r\nHow will you practice self-care?\r\nWhat are the causes of domestic abuse?"}, {"date": "14 Jun 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Refuge  (London, England)", "Interview Descriptions": "2 step process with first stage task. Competency based questions in stage 1 and time to ask them questions. Task given before interview and due 3 days after interview demonstrating inclusivity and seeking to get the best from candidates.", "Interview Questions": "Tell us about your experience and why this would make you a strong candidate for this position. "}, {"date": "31 Mar 2022", "title": "Group Work Facilitator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Refuge ", "Interview Descriptions": "- Applied for the job, it had a specific interview date I had to tick to say I could attend\r\n- Had an offer of interview after this date\r\n- Spent time creating a  presentation as requested \r\n- Booked time out to allow for this/arranged childcare etc\r\n- Interview was on the Monday, I was told at interview I would hear the outcome on or before the Friday of that week\r\n- Chased up after this date with no response\r\n- Received an email 4 weeks later letting me know I was unsuccessful with no feedback", "Interview Questions": "Previous group work knowledge and experience"}, {"date": "1 Mar 2023", "title": "Refuge Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Refuge  in Feb 2022", "Interview Descriptions": "Not very friendly, didn’t feel like the questions were tailored to me and I was asked to describe things that were clearly not on my CV. Interviewers we’re not very welcoming which put me on edge.", "Interview Questions": "Describe a time when you assisted a victim of violent behaviour"}, {"date": "18 Feb 2021", "title": "Call Handler Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Refuge  (London, England) in Feb 2021", "Interview Descriptions": "lengthy application process\r\nin depth questions\r\ngive examples of incidents\r\ndiscuss\r\ncurrent role\r\npersonal\r\nexperiencws\r\ntalk about  charity work abroad\r\nwhy I applied\r\nexperience with charities\r\ndiscuss laws \r\ndiscuss how you work\r\nwith teams and management\r\nsalary\r\nsocial media\r\nmaintaining professionalism and being non judgemental", "Interview Questions": "questions displaying experience and skills"}], [{"date": "18 Jan 2021", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Refuge  in Nov 2020", "Interview Descriptions": "Quick turn around from application to interview, around 1 week.  Invited to interview via zoom with panel which was pleasant and normal expected questions, staff were friendly and responsive. Was told a week later after chasing that was unsuccessful. Requested feedback in November and chased several times and still not had any reply.", "Interview Questions": "How would you deal with a difficult colleague\r\nHow do you like to be managed"}, {"date": "17 Jun 2020", "title": "Refuge Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Refuge  (London, England) in Jun 2020", "Interview Descriptions": "Interview was nice.  It was a lot of questions about safeguarding and job managing. (40 min, 12 questions).  Two people interviewed me and each person had 6 questions.  They listened very carefully and if I did not understand something they explained me.", "Interview Questions": "Why you want work for our company? How to build trustful and supportive relationships with clients?  What DV law acts do you know? Describe your previous working experience with women? What is the main root of DV? "}, {"date": "7 Oct 2019", "title": "Support Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Refuge  (London, England)", "Interview Descriptions": "Formal interview which took long to schedule and reschedule.\r\n\r\nHowever i did the test and interview the same day.\r\n\r\nThe test was technical but irrelevant to the subject\r\n\r\nThe questions were general and the panel showed no enthusiasm", "Interview Questions": "1. Why would you work for this charity\r\n\r\nWhat is your understanding about our cause ie Domestic Violence\r\n\r\nThey asked briefly about previous experience.\r\n\r\nThey ask a lot of details about personal background. Watch out"}, {"date": "1 Nov 2018", "title": "Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Refuge ", "Interview Descriptions": "They provided the interview questions on arrival, and allowed for some time in advance of the interview to read them and prepare a reply. I thought that was really positive way to conduct an interview that enabled the best response.", "Interview Questions": "Asked about sponsorship"}, {"date": "9 Jul 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Refuge  (London, England) in Feb 2018", "Interview Descriptions": "Clear outline of the process and how to get to the building.  Very friendly panel and the test was clearly explained.  The presentation was communicated in good time and the impression of the organisation was positive from the moment I arrived to leaving.", "Interview Questions": "Why would I want to work for Refuge "}]]