[[{"date": "13 Nov 2022", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at EvergreenHealth", "Interview Descriptions": "Kinda of a joke. Clear they have their “quotas” they need to meet. Very impersonal. Generic. Based on their hiring process, definitely not a company I want to work for.", "Interview Questions": "Generic. Elementary. Their just going through the required motions but not actually looking for decent candidates."}, {"date": "10 Oct 2022", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at EvergreenHealth", "Interview Descriptions": "Online application, call with a hiring manager, in person panel interview. Typical interview questions. Some specific questions about how to problem solve patient care needs. Received an offer within a couple days of interviewing", "Interview Questions": "If a patient was having repeat falls at home, what would you recommend?"}, {"date": "6 Nov 2022", "title": "ARNP Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at EvergreenHealth (Kirkland, WA) in Sept 2022", "Interview Descriptions": "The recruiter was helpful and friendly. Good organization to be in. Interview process was smooth, interviewer were straightforward with what they are looking for. Overall good experience. I will try applying for a new position.", "Interview Questions": "Why do you leave your current job? What are your strength and weaknesses? What do you like about this position? What relevant experience? Can you tell us one example of difficult patient and how you handle it?"}, {"date": "3 Oct 2022", "title": "New RN Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at EvergreenHealth (Kirkland, WA) in Sept 2022", "Interview Descriptions": "Recruiter contacted me vial email to schedule an interview with all the managers accepting RN residents although I only applied to one unit. During interview, they made me feel pretty comfortable. I had a panel of 3 med-surg managers interview me for about 15-20 min and then time for questions. All three units offered me a job later that afternoon", "Interview Questions": "Tell us about yourself and why Evergreen?"}, {"date": "31 Jul 2022", "title": "Customer Support Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at EvergreenHealth (Everett, WA) in Jul 2022", "Interview Descriptions": "Had three seemingly great interviews.  First was filter with recruiter. 2nd with leadership of department. 3rd panel interview. Got a verbal offer then they threw a request for 5 references. Whatever came back caused them to with no details rescind the offer.  Given this part can basically tank you chances for a job it seems odd to have it at the rear end of the process.  Either way very disappointed to have gone through a month of time only to get denied for reasons I do not know.", "Interview Questions": "Have do you handle intense calls."}, {"date": "11 May 2022", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at EvergreenHealth in May 2022", "Interview Descriptions": "It was very easy. I was handed a application form which I filled out. They then asked me what shift I was looking for and what days. I told them my preferences and they had a opening. They checked on the pay scale and informed me how much I would make etc", "Interview Questions": "What shift do you look for"}, {"date": "21 Aug 2022", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at EvergreenHealth (Seattle, WA) in Apr 2022", "Interview Descriptions": "I submitted an application and I received a phone call to schedule an onsite interview. After the interview I was given a tour of the lab and instructed to request my professional references complete an online survey. I bowed out from the process due to another offer.", "Interview Questions": "What is an example of when you used creativity to solve a problem?"}, {"date": "21 Feb 2022", "title": "Operator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at EvergreenHealth in Jan 2022", "Interview Descriptions": "very rushed unprofessional not worth it, will be promised one thing and another will happen and the hours are not family friendly at all. treated like a nobody all the time. and not worth it. \na", "Interview Questions": "why here with us here"}, {"date": "23 Dec 2021", "title": "Patient Services Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at EvergreenHealth in Dec 2021", "Interview Descriptions": "Got to interview via phone within less than one week of applying. The interviewer asked some easy questions. Discussed situational questions related to customer service and maintaining work flow. Then discussed about skills and pay.", "Interview Questions": "How do you handle a long line?"}, {"date": "15 Oct 2021", "title": "Pharmacy Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at EvergreenHealth", "Interview Descriptions": "The interview was about 10 questions long and lasted 15 minutes. Some of the questions they asked were my personal strengths, why I'm interested in the position, and why EvergreenHealth.", "Interview Questions": "Why do you want to work at EvergreenHealth?"}], [{"date": "7 Oct 2021", "title": "Compensation Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at EvergreenHealth", "Interview Descriptions": "Two phone interviews and an in-person interview with a panel of 7 people. I was surprised they wanted in-person during covid-given they are a hospital. Asked for 5 references- which they either texted or sent emails.", "Interview Questions": "There were questions surrounding \"what would you do if you didn't like your manager \" which felt like a red flag."}, {"date": "23 Aug 2021", "title": "Home Health Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at EvergreenHealth (Kirkland, WA) in Aug 2021", "Interview Descriptions": "5 years nursing experience. Talked about my experience as well as why do I want to pursue home health. Got a job offer but did not accept only because I found a better fit for me. Overall seemed like a great opportunity.", "Interview Questions": "What drives you to home health?"}, {"date": "24 Jun 2021", "title": "Population Health Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at EvergreenHealth in Jun 2021", "Interview Descriptions": "Video interview where the entire interview is to record your answers and send the video to the recruiting team.No interviewer will ask questions. The questions will appear on the screen", "Interview Questions": "What is your weakness and strength?"}, {"date": "1 Jan 2020", "title": "Staff RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at EvergreenHealth (Seattle, WA) in Dec 2019", "Interview Descriptions": "went to their website and applied  it . about one month, you will receive an email for in person  interview. it was panel interview with at least 6 people from different units. They will ask you about 10 questions  and got the result after one week.", "Interview Questions": "Why you want to work in this unit?"}, {"date": "3 Feb 2021", "title": "Unit Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at EvergreenHealth (Kirkland, WA) in Oct 2019", "Interview Descriptions": "I applied online. There were two step  interview process with basic questions.It was a panel interview. First was online, then actual interview with group of nurses. They talked about your experiences.   It took 3-4 weeks for onboarding.", "Interview Questions": "Tell me about a time when you had to address an angry patient?"}, {"date": "12 Feb 2019", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at EvergreenHealth (Seattle, WA) in Feb 2019", "Interview Descriptions": "it was an excellent interview and my interviewer was very satisfied and her feedback was great and I was very comfortable to answer all the questions  and she told to me she is very happy to hire me", "Interview Questions": "what are your favorite meds in the ICU"}, {"date": "27 Aug 2018", "title": "Clinical Informatics Specialist II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at EvergreenHealth in Jul 2018", "Interview Descriptions": "I was brought in by the hiring manager, who had not created a formal structure for the interview. I was placed into a room with 9 team members, which immediately set an intimidating precedent.\r\n\r\nI was asked questions in a manner that made me feel unwelcome and unqualified, despite possessing a doctorate, and my interview team mostly consisted of clinical staff below a doctorate level.\r\n\r\nThe process itself lasted approximately 1 hour, with no formal structure or questions, with each team member firing off questions as they thought of them.\r\n\r\nThe team itself presented as an in-group, and emphasized repeatedly that they were a \"family\" looking for a \"good fit.\" While this is standard for most small-team interviews, it came off as hostile within this environment.\r\n\r\nAfter the interview, I was sat down with the hiring manager and we talked for about 30 minutes. I was told that I would be brought it for another interview the following week, and this had not been explained to meprior. The interview was to consist of several people outside of the clinical informatics department; specifically members of departments within my clinical specialty that were not member of the clinical informatics team. The reason for this was not clear, considering that the other departments were not involved in the hiring process. Since this department hires throughout the clinical spectrum (MA, RN, RT, PharmD, MD), I got the sense this was an ad libbed step tied into the internal politics between departments.\r\n\r\nAfter not hearing back from the hiring manager after 2 weeks of waiting, I sent an e-mail to check in, and received no response.\r\n\r\nOverall the entire process was very unorganized, unprofessional, and I got the sense this team does not know what they are looking for. Additionally there are possibly unseen internal politics in-play that work hard to keep thishealthcare system incestuous.", "Interview Questions": "\"We normally only hire from within Evergreen -- why should we consider an outside candidate?\""}, {"date": "21 Jun 2018", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at EvergreenHealth", "Interview Descriptions": "Everything moved very quickly. I applied and got a call the next day, arranged an interview the vet next day with lead and manager. I was asked for\r\nreferences the same day and received an offer the day after that. Everyone was really nice and the process was smooth.", "Interview Questions": "Why Evergreen?"}, {"date": "31 Jul 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at EvergreenHealth in Jun 2018", "Interview Descriptions": "Applied on Indeed. Three interviews, first a phone screen, then two in-person. First in-person was with two managers, second was with five other leadership staff. Very positive, huge focus on culture and maturity", "Interview Questions": "How do you provide feedback to staff?"}, {"date": "28 Sept 2018", "title": "Physician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at EvergreenHealth in Jun 2018", "Interview Descriptions": "Lots of starting and stopping, But this could be explained as the physician recruitment was in transition during the process.  A bit of confusion as I came in to interview for a position that I learned during the process were no longer open.  For some reason I did check back.  Perhaps the process will be smoother with new recruiter.  I will say for me, it was not well organized and I seemed to do more of the communication between groups than the actual employees.  It is not a good feeling to show up to an interview and realize the medical director for the clinic took the day off.", "Interview Questions": "Do you have any ideas on how to do a lot with very little resources?"}], [{"date": "30 Nov 2017", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at EvergreenHealth (Kirkland, WA) in Oct 2017", "Interview Descriptions": "Though I'd only been in contact with the MC team supervisor, the interview was actually with the whole coding team. It was held conference style, with the supervisor asking a few general questions and each team member having prepared one or two questions. It was notable that none of them asked the traditional questions (tell us about yourself, etc) and since they had such specific questions it was easier to answer. After the interview portion, they gave me a skills test that had sections for general coding questions (mainly on guidelines), medication names and purposes, abbreviations, medical prefixes and suffixes, and medical terminology.", "Interview Questions": "What was an occasion where you had to manage an issue with a coworker and how did you handle it?"}, {"date": "6 Sept 2017", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at EvergreenHealth in Aug 2017", "Interview Descriptions": "Was offered a one way video interview. 10 questions with an unlimited think time and two attempts to record. I did mine on my iPhone! I got an in person interview offer email the next day.", "Interview Questions": "Name a time you received harsh criticism on your work and how did you respond to it?"}, {"date": "8 Apr 2017", "title": "Medical Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at EvergreenHealth (Kirkland, WA) in Apr 2017", "Interview Descriptions": "I was invited for a Webcam video interview where they post a question and give you an unlimited amount of time to think about the question, then you answer the question with one retake option.", "Interview Questions": "Out of all the required skills for this position, name which one is your weakest skill and why."}, {"date": "12 May 2017", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at EvergreenHealth (Kirkland, WA) in Feb 2017", "Interview Descriptions": "I was contacted by a consultant company for a position in evergreenhealth. The interview was 15 minutes with very common questions like tell me about yourself, what would you do if you do not like anything about your peers at work? how do you manage stress? Tell me about previous experience?", "Interview Questions": "How do you describe yourself?"}, {"date": "23 Apr 2016", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at EvergreenHealth (Kirkland, WA) in Mar 2016", "Interview Descriptions": "During the application, I had to do a personality survey. I was contacted via email by a recruiter. Then I had a phone interview with a recruiter, followed by an in person. Then I met with the other physicians in the practice. Next, they requested references", "Interview Questions": "Why Evergreen"}, {"date": "30 Jun 2016", "title": "PFS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at EvergreenHealth (Kirkland, WA) in Mar 2016", "Interview Descriptions": "Long period. Took three weeks to inform me the second step. Took other two week for the reference check which is the second step. Then background check, drug test, vaccine... Almost two months in total for the whole process.", "Interview Questions": "Why do you think you fit this position?"}, {"date": "10 Apr 2016", "title": "Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at EvergreenHealth (Kirkland, WA) in Mar 2016", "Interview Descriptions": "The interview process was a panel with multiple people consisting of nurses and nurse managers from the unit I was interviewing to work on.  I went through two interviews. These two interviews were two weeks apart. The interviews were not too difficult. However, it is important to be prepared for the interviews.", "Interview Questions": "Describe a situation where you had a conflict with your boss and how did you handle it?"}, {"date": "9 Jan 2016", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at EvergreenHealth (Kirkland, WA) in Jul 2015", "Interview Descriptions": "2, 1 hour interviews with large groups of people. One session was a technical interview covering specific questions mostly take from Peoplebooks. If you know your stuff it was not too bad of interview. The second interview was a functional interview and this one was harder as a technical person since it was outside of my area of expertise.", "Interview Questions": "What does PIA stand for"}, {"date": "12 May 2016", "title": "Senior Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at EvergreenHealth (Monroe, WA) in Jun 2015", "Interview Descriptions": "Was brought in for a group interview with the CEO, CFO, CNO, CQO. Each officer asked a  handful of questions. Then I was given the opportunity to ask my own questions. Following the interview I was allowed to speak in private with my boss if granted the position. There she was able to ask me a few questions and then I was able to ask some more of my own. Following the interview I received and email a few days later with an offer.", "Interview Questions": "Tell us about a time when you solved a problem?"}, {"date": "7 Apr 2015", "title": "Medical Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at EvergreenHealth", "Interview Descriptions": "I received a phone call requesting I call back for a phone interview.  I called back two hours later and left a voice mail.  I called back the next day and left another voice mail.  Four days later while at the company website I saw that I was no longer being considered for the position.  Very poor customer service not returning the calls.  I received a call seven days later that I was no longer being considered for the position.", "Interview Questions": "N/A"}], [{"date": "10 Mar 2015", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at EvergreenHealth (Kirkland, WA) in Feb 2015", "Interview Descriptions": "Applied online, was contacted by HR for an initial phone screen, followed by a phone interview with one of the marketing directors. Shortly after, I was scheduled an on-site tour and panel interview (which ended up being two separate interviews - one with the marketing directors/managers and the second round with the rest of the marketing team) of around 7-10 EvergreenHealth employees.\r\n\r\nThe on-site interview process took about 2.5 hours and consisted of the typical interview questions, and marketing/events specific questions as well. Following this interview, I was emailed with a request for 5 references (including 2 managers/supervisors) to complete a third-party survey with questions about my skills, qualifications, etc. and this site then aggregates the data into a report on the candidate. I thought surely after asking 5 professional references to complete this tall order and submit the survey within a 24-hour deadline, and feeling very confident that all of these references would give me a great score, I would be offered the position.\r\n\r\nI was wrong. Instead, I heard NOTHING back from anyone for a week. No automated thank you but we've chosen a different candidate. No response to my follow-up emails. Radio silence. FINALLY, over a week later, after I sent a second follow-up email, I received a phone call a few days later from the HR contact informing me that they decided to offer the job to another candidate. No reason or explanation and very impersonal.\r\n\r\nJust beware of the reference step of this process -- it looks like I'm not the only person this has happened to. Asking for 5 references to complete that task in such a short time without being serious about a candidate puts a bad taste in my mouth, but maybe that's just me.", "Interview Questions": "Describe a successful marketing campaign you worked on from start to finish."}, {"date": "18 Feb 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at EvergreenHealth (Kirkland, WA) in Feb 2015", "Interview Descriptions": "Three female managers interviewed me at a huge table in a conference room. The questions were pretty typical-nothing out of the ordinary. They told me they would be choosing the finalist in two weeks; however, out of curiosity, five days later I checked the status of my application online. The status basically stated that I was not hired. The next day I received an automatic reply type email thanking me for applying, but that they'd chosen someone else. It was about one and a half weeks earlier than they'd indicated in the interview. It seems they had someone picked out already and it was just a formality to interview me.", "Interview Questions": "What do you see yourself doing professionally in the future/next five years?"}, {"date": "21 Aug 2016", "title": "Denial Management Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at EvergreenHealth (Seattle, WA) in Feb 2015", "Interview Descriptions": "I was initially contacted by an associate in the HR department and screened. Then I was called by the supervisor who arranged the interview. In person, I was interviewed by both my future manager and supervisor. It was very laid back without many pre-qualifying questions. It was more of a conversation with a good flow.", "Interview Questions": "Tell me about a time you solved a problem at work."}, {"date": "6 Sept 2014", "title": "RN Staff Nurse Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at EvergreenHealth in Aug 2014", "Interview Descriptions": "Beware that the request for references does not mean that a job offer can be expected. After an interview, I was contacted to submit references through SkillSurvey.com.  I contacted 9 people for references because I do not have much nursing experience.  SkillSurvey compiles their responses and supplies the employer with a report of the comments and ratings, all of which are anonymous.  It appears that EvergreenHealth uses these reports as a way to evaluate candidates and not simply to make sure that the chosen candidate has been truthful about work history.  It is misleading and can jeopardize your current employment if you ask your current employer for a reference. EvergreenHealth does not warn people of this.  It is a bad system because your current employer may provide the best information on you but you should not feel comfortable giving permission to EvergreenHealth to access this information.  In this way, EvergreenHealth is not playing fair.", "Interview Questions": "For telephone triage interviews, a piece of paper with over a dozen scenarios is presented to the applicant who is asked to speak aloud the thought process for deciding which patients have priority issues. Typing test too."}, {"date": "11 Aug 2016", "title": "EVS Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at EvergreenHealth in Aug 2014", "Interview Descriptions": "I applied online (all the shift available ) I can work with. Finally, I've got a call for interview then they asked for referrals through online they said I need to complete the survey from my referral then computer test ability when I passed I get hired.", "Interview Questions": "if you were given a task and it's out of your jurisdiction will do it?"}, {"date": "26 Mar 2014", "title": "HIM Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at EvergreenHealth", "Interview Descriptions": "Panel interview with HIM manager and team of analysts. Usually about 6-8 of them. They have a set list of questions and they go down the list asking each one. The questions are your typical strength/weakness, challenging situation type questions. Nothing unexpected it's just intimidating being in front of a panel of people", "Interview Questions": "What is one thing not on your resume you think we should know about you?"}, {"date": "1 Feb 2014", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at EvergreenHealth in Jun 2013", "Interview Descriptions": "You have to take a test and pass the test before you are consider for an interview. the company will do a back ground check so if anything negative comes up you will not be hired. The DON does all the hiring it is cut and dry either you get hired on the spot or you can forget about them calling you. This not a good job if you just graduated", "Interview Questions": "They give a test and you better be up on your labs."}, {"date": "29 May 2017", "title": "Home Health/Hospice Medical Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at EvergreenHealth in May 2013", "Interview Descriptions": "I met with the manager initially and then had a very pleasant panel interview with the manager and the clinical directors of home health and hospice.  I was the perfect fit for the job so it was mainly a love fest.  They were interested in beefing up their hospice coding process and I had already done that in my previous job so they were very happy with that.", "Interview Questions": "What would you do if you did not have enough information to code a chart"}]]