[[{"date": "5 Jul 2023", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stratford University (Tysons Corner, VA)", "Interview Descriptions": "Company really struggled during its time. They were not realistic with the ideas. Hopefully the students were able to find somewhere to land to continue their education. The upper management was difficult to handle.", "Interview Questions": "My vision for my career was a big piece."}, {"date": "17 Feb 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stratford University", "Interview Descriptions": "Process did not take long at all. Phone screening + 2nd round interview within two weeks of each other. Received offer a couple days later. They were ready to bring someone onboard immediately.", "Interview Questions": "How will this position help you achieve your career goals?"}, {"date": "8 Nov 2019", "title": "Student Services Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Stratford University (Falls Church, VA) in Feb 2019", "Interview Descriptions": "A friendly environment where the recruiters was very friendly and open to any question.\r\nThe ISO manager and his assistant asked for a brief presentation of my career path and asked me few questions.", "Interview Questions": "Have you worked in a multi diverse environment before?"}, {"date": "12 Jan 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Stratford University (Fairfax, VA) in Oct 2017", "Interview Descriptions": "Very lengthy with several interviewers either together or separate. Some interviewers are not knowledgeable about the job you may be interviewing for.  HR is overly optimistic about the company and position and once hired...the job is very different. However, you can interview with many different people from a campus level to the corporate level.", "Interview Questions": "How do you handle coworkers you don't like? "}, {"date": "6 Apr 2017", "title": "Student Accounts Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stratford University", "Interview Descriptions": "By the book 3 part application, phone, and interview process and questions. In front of a panel of 2/3 people. Basic interview questions that you can google online to practice how to answer. Answers should be based on your own experiences and perspective.", "Interview Questions": "What do you know about the Financial Aid Process?"}, {"date": "2 Mar 2019", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Stratford University (Newport News, VA) in Jan 2017", "Interview Descriptions": "Classroom setting. interviewed by different departments  in a class setting. Then you do a class presentation .\r\nThen you they let you see the building , walking you over the whole campus to view it. the campus is one one floor so you will be ok.", "Interview Questions": "How do you deal with a disruptive student?\r\nHow do deal with student  who have different learning ranges in a class?\r\nHow do you assess students?"}, {"date": "4 Dec 2014", "title": "Career Services Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stratford University (Glen Allen, VA) in Nov 2014", "Interview Descriptions": "I applied online through an internal recruiter. He contacted me first via email to discuss relocation possibilities since I am not a local candidate, then conducted a phone interview.  The phone interview went really well, and he moved me on to a 1:1 video interview with a higher up.  Prior to the video interview the recruiter said \"you're going to make me look like a rock star\".\r\n\r\nNext was the first video interview that went very well. Lasted about 90 minutes and I got the impression that I was the only candidate at that time. I was then contacted for a second video interview with the COO. This one didn't seem to go as well. The video cut out about halfway through and we conducted the rest by phone, so it was a harder to read his body language after that.  He was pretty vague and seemed uncomfortable answering any of my questions [remember, an interview is a 2-way street ESPECIALLY if I'm going to relocate]. I think I may have offended him when I asked about the reputation of management (read employee reviews on Glassdoor - seems there's some unprofessional behavior going on with the President and other members of management).\r\n\r\nThe next thing I know I received one of those standard \"thank you for applying, we'll keep your resume on file\" emails. *Kanye shrug*", "Interview Questions": "No questions were too \"out there\" or remarkable. It was all pretty standard"}, {"date": "16 Oct 2014", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Stratford University", "Interview Descriptions": "Not competitive of an interview process. Had to wait to be interview for 45 minutes before anyone called me inside. Interview lasted about 30 minutes. Questions had nothing to do with the position.", "Interview Questions": "N/A"}, {"date": "2 Sept 2015", "title": "Digital Content Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Stratford University (Fairfax, VA) in Jun 2014", "Interview Descriptions": "The interview process was long. Very long. I believe my first interview with them was in June and it wasn't until August that I got the position. In retrospect, I do understand why. This was a new position, a new direction and I was a gamble. My future boss wanted to be sure I was the right guy.", "Interview Questions": "What do you think of the current direction of Stratford's social media?"}], [{"date": "1 May 2014", "title": "Junior Java Web Developer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Stratford University", "Interview Descriptions": "Talk confidently, site examples and be explicit", "Interview Questions": "questions get difficult when you were not prepared for the interview"}, {"date": "5 Apr 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Stratford University (Newport News, VA)", "Interview Descriptions": "Email, then phone call to set up interview, then interview at campus.  At the campus, there was a panel interview that included the campus dean, campus registrar, and a full-time faculty member.  Everyone introduced himself or herself and then proceeded to ask designated questions.  After you're done answering the specific questions, you're given the opportunity to ask questions you may have.", "Interview Questions": "Describe your teaching style."}, {"date": "31 Mar 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Stratford University (Falls Church, VA)", "Interview Descriptions": "Quick interview with Dean.  They were desperate to hire someone to teach upcoming classes, so the interview was essentially: 1. give a teaching demo and 2. do your qualifications pass accreditation standards.", "Interview Questions": "None.  Standard adjunct faculty questions."}, {"date": "18 Apr 2015", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Stratford University (Richmond, VA) in Mar 2014", "Interview Descriptions": "It was mid-level, asked about previous job experience and people skills. The interview was about 30 minutes and 2 involved 2 stages. first was with HR and assistant  managers, second was with the Unit Manager. Basically asked questions regarding skills, passion, attitude to work. Feel much emphasis was placed on personality and rather than answers. i felt i was being studied", "Interview Questions": "What would be the first thing you would do when we take you on board this project"}]]