[[{"date": "18 May 2022", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fortis College", "Interview Descriptions": "Had three rounds of interviews and felt really good. Emailed them to follow up and they said they were still deciding. Never contacted me to tel me they went with someone else.", "Interview Questions": "Questions were very average like most places. "}, {"date": "11 Jul 2021", "title": "Clinical Coordinator Xxx Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Fortis College", "Interview Descriptions": "My first interview was a screening interview on the phone.  I was then invited to an in person interview.  This was with a panel of 3 other administrators. Within a couple days of the interview I was called and offered the position.", "Interview Questions": "Why are you looking to change?"}, {"date": "19 Apr 2021", "title": "RN Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Fortis College (Norfolk, VA)", "Interview Descriptions": "I Sat in with Director and Assistant Director of Nursing Program. They asked me various basic interview questions. Tell them about myself and asked me to give them an example of a teaching scenario. How i would teach a student in the real world.", "Interview Questions": "What do you know about Fortis "}, {"date": "16 Apr 2021", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Fortis College", "Interview Descriptions": "I had a quick interview with the director of education and the president of the school. I got the job offer a few days later via email and accepted it.", "Interview Questions": "What are some of your strengths ?"}, {"date": "18 Jan 2021", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fortis College", "Interview Descriptions": "Very fast paced. Not too many intricate questions. Everyone was friendly. Company does have financial issues though. I interviewed in the middle of an audit. There seemed to be a lot of confusion", "Interview Questions": "Are you able to multitask"}, {"date": "16 Oct 2020", "title": "Dentist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fortis College", "Interview Descriptions": "The director was very responsive via email. She scheduled my interview right away. The Interview was via Zoom. The person who interviewed me was very courteous. I hope I get the job. They were willing to be flexible with my hours.", "Interview Questions": "The interview was a typical one. She didn't ask anything unusual. I will update this later."}, {"date": "27 Aug 2019", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fortis College", "Interview Descriptions": "Interview brief and informal. Spoke with director of education as well as the other st instructors. The interview process was very easy going. They made it feel like an informal discussion", "Interview Questions": "N/A"}, {"date": "4 Jun 2019", "title": "Receptionist/Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Fortis College (Baton Rouge, LA) in May 2019", "Interview Descriptions": "I want to start off by saying that the people that were leading the interview process were very nice, but their technique was extremely flawed. It was a group interview, but I did not anticipate to walk into a room with over 20 candidates. We each got 30 seconds to introduce ourselves, which is impractical. They also made us spend 5 min with a partner, and then we had 30 seconds to tell them why they should hire our partner for the position. They didn’t really allow us anytime for them to get to know us. I doubt with the combined 1 minute of information they learned about us, they were even able to keep track with 20 other girls in the room. Towards the end of this process we find out that they were only filling one position. So it made no sense to have that many women in a room for one position. They definitely should’ve narrowed it down drastically before wasting everyone’s time. I say everyone, because they reposted the job application a few hours after our interview on indeed. Very inconsiderate.", "Interview Questions": "You guys each have 30 seconds to introduce yourself, tell us your name and something about yourself"}, {"date": "10 Sept 2021", "title": "Front Desk Receptionist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fortis College (Virginia Beach, VA) in Aug 2018", "Interview Descriptions": "Interviewed with the manager  in charge of the front desk reception employees.  Then the manager of the entire staff and payroll came in to ask some questions. Discussed hours as mine would have had to be shifted slightly.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "3 Sept 2018", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Fortis College (Westerville, OH) in Jul 2018", "Interview Descriptions": "At first my experience seemed promising; I was contacted via Indeed email by an individual representing the college. She/he emailed after looking at my resume and was very interested to meet. We briefly emailed back and forth and settled on later that week. Once the day came, I arrived at the school and waited to meet w/ a panel of individuals. The interview went VERY well, which was followed by a campus tour. At the conclusion of the interview & tour (roughly 1.5 hours), I was told they had a few more interviews and I would hear from them in a week.\r\n\r\nA week later, I received a call from one of the people that was in the interview...one of the employees who wasn't there in the panel interview wanted to meet with me. We met later that week! The interview went so well, I thought I'd be offered the position on the spot. I was escorted back to the main office where I had my background check done and they gave me directions for where to go to do my drug test. SUCCESS....or so I thought! \r\n\r\nBefore leaving, again I'm told it would be a week so I waited. After a week, I emailed to follow-up and make sure they had everything they needed as I also had to do an online assessment. With my application file complete, I wait and wait to hear about their decision. NO response. So I call and leave a voice message, again no response.  I email my contact who I had been talking with through this whole process and basically say since they had not contacted me I assumed they went with other candidates and wished them well...only to receive a response, she/he was soo swamped and they had still not made a decision but they would by the end of week. \r\n\r\nI'm sure I don't have to tell you, I still  haven't heard from them. Such a waste of my time and their money. So unprofessional on so many levels. Just respond with a \"No\" I'm a big girl I can handle it.", "Interview Questions": "Walk us through your resume!"}], [{"date": "11 Aug 2018", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Fortis College (Indianapolis, IN) in Mar 2018", "Interview Descriptions": "I submitted my resume to Fortis, and almost immediately received a phone call from the Regional Director of Admissions, who happened to be visiting the local college.  The job posting said \"Bachelor degree preferred.\" I let him know that I did not have a degree, and he let me know that my experience trumped a degree, and scheduled me for a F2F the next morning.  I arrived to my appointment five minutes early, but the office I was to go to was locked. After waiting by the door for a few minutes, an instructor showed up and was able to let me in the office. The receptionist finally came out from a back office, and asked me what I was there for. After telling her I was there to interview, the Campus President came out, and again confirmed why I was there, and then disappeared into the back office. Finally, about 10 minutes after my scheduled interview, the CP came back out and told me that the person I was to interview with wouldn't be there that morning, but he would meet with me. He told me, as well, that experience trumped education, however, throughout our conversation, he kept insulting me by mentioning the fact that I was \"uneducated.\" After we spoke for roughly 15 minutes, he ended the interview, and said that he had a meeting to go to, but that the Director of Admissions would be calling me to schedule another appointment. After not hearing from the DOA, I emailed the CP to inquire about the status of my next interview. He replied that the DOA had another \"route\" in mind, and that I would not be scheduled for another interview. The entire time I was at my original appointment, and after receiving the email from the CP, I feel like they never had any intention of seriously considering me for the position, and that my trip to their location was a complete waste of my time, and gas. The whole thing was handled very unprofessionally.", "Interview Questions": "Why didn't you graduate from college? (He seemed to dwell on the fact that I didn't have a degree. I don't know why I was scheduled for an interview, if having a degree was so important to the management)."}, {"date": "17 Mar 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Fortis College (Forty Fort, PA)", "Interview Descriptions": "Initial phone screen, followed by a one on one interview, group interview, then last interview was with the campus president. Standard basic interview questions were asked.  The process entailed 5 interviews total", "Interview Questions": "Basic questions from previous work experience "}, {"date": "13 Mar 2017", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fortis College (Pensacola, FL)", "Interview Descriptions": "It was a group interview with 7 other candidates in the same setting. We all got the information about the company and then were told to stand up one by one describing ourselves and why we were the perfect fit.", "Interview Questions": "Who knew this was a group interview?"}, {"date": "14 Nov 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fortis College (Greenwood Village, CO) in Jan 2017", "Interview Descriptions": "one face to face very informal interview then 2 phone interviews with upper management asking the same questions. Was very direct, nothing about it stood out.. was just an interview to fill the seats, wasn't like they were looking for an asset to add to the operation.", "Interview Questions": "why would Fortis be a good place to work?"}, {"date": "4 Jan 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fortis College (Dothan, AL) in Oct 2016", "Interview Descriptions": "A series of three interviews, first was a group interview where I had to give a 5 minute presentation about myself in front of other applicants and a panel of three interviewers, then I was brought back for a more personal interview with campus President and dean of Admissions, and third interview was with the regional director of admissions", "Interview Questions": "Tell me about a time that you were part of a successful teams d what was it about the team that made them successful "}, {"date": "27 Feb 2018", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fortis College (Greenwood Village, CO) in Aug 2016", "Interview Descriptions": "Multiple phone interviews, an in person interview, and an online 10 minute test for personality and skill set. When I decided to no longer interview for the admissions role, I was then interviewing for an Online Advisor role which was a similar process.", "Interview Questions": "How would you best support an at-risk student?"}, {"date": "1 Aug 2016", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fortis College (Harrisburg, PA) in Jun 2016", "Interview Descriptions": "First, the initial phone interview with a corporate recruiter.  Second, phone interview with the campus director.  Campus Director then set up the appointment to come to the school for a face to face interview. Interviewed with both the DOA and the Director.  The whole process to less than a week from start to finish.  Once the interview was complete, it took another week for the decision.", "Interview Questions": "Describe one success story that sticks with you."}, {"date": "20 Apr 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fortis College (Baltimore, MD) in May 2016", "Interview Descriptions": "The person who interviewed me did not seem interested in talking to me nor did they go through a complete description of the job. They passed me off on the course of a couple of days just to see would I come back.", "Interview Questions": "What is your religion?"}, {"date": "20 May 2016", "title": "Nursing Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Fortis College (Columbus, OH) in Mar 2016", "Interview Descriptions": "A recruiter contacted me. I had numerous interviews. My first interview was with a small panel that included mostly directors and assistant directors. I was asked to complete a drug screen and background check at the completion. I was called several days later and asked to return to complete a 20 minute teaching presentation. I presented in front of approximately 10 faculty and 20 nursing students.  Several days later, I received another call that they were very impressed by my teaching presentation and asked me to do a skills demo. I came back for a third time and \"taught\" IV insertion and Foley insertion. Again, I was told they were very impressed and asked me (again) to complete a background check and drug screen. I was told I had already completed them and they were both green lighted for hiring. The assistant dean told the dean was out of office but I should hear back in several days with a formal job offer. I never heard from them again and all attempts to call and e-mail have been ignored. It's been approximately 2 months since my final interview.", "Interview Questions": "I was just asked about my history, how I got to where I am now, my job history, and why I am interested in this current position."}, {"date": "29 Aug 2015", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Fortis College (Dayton, OH) in Aug 2015", "Interview Descriptions": "It was a relaxed setting with the interviewer explaining the expectations of the job as well as a tour of the facility.  There were not a series of scripted formal questions inquiring about hypothetical situations.", "Interview Questions": "Why are you considering this postion?"}], [{"date": "9 Jan 2016", "title": "Nursing Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Fortis College (Columbia, SC) in Mar 2015", "Interview Descriptions": "I was hired \"on the fly\" by an interim dean after a big lay-off partially due to small class sizes and low passing rates on specialty exams. The interview was short, to-the-point, and did not include many of the standard discipline-oriented questions. My salary request was met, therefore I was asked to teach 3 courses per quarter and the next quarter started one week after the interview. Orientation was per intranet and very little guidance was  provided. There was no peer interview.", "Interview Questions": "How many years of teaching experience do you have and in what field?"}, {"date": "9 Oct 2015", "title": "College Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fortis College in Jan 2015", "Interview Descriptions": "Phone screening, hiring manager and team in personal setting--- people were nice and professional.  Open to questions and employee input for ideas and team-building. Interview process was helpful in understanding the organizational culture and gave me a good idea about if my skillset and personality was a good fit", "Interview Questions": "Experiences with difficult students"}, {"date": "3 Nov 2014", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Fortis College", "Interview Descriptions": "Applied online. Interviewed with DOA and Campus Director. After initial interviews, interviewed with regional director.The regional interviewed and I was called in to take a tour and then negotiated the salary. From that point, I submitted my salary requirements and they accepted.", "Interview Questions": "Is your glass half empty ir half full."}, {"date": "28 Nov 2014", "title": "Part Time Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fortis College (Cincinnati, OH) in Nov 2014", "Interview Descriptions": "I was told to prepare a 15 min teaching demo. My interview was with a the dean of education and a program head. First we went over my resume and work history. They asked a situational questions, \"Describe a time when you were faced with problems or stresses at work that tested your coping skills. What did you do? Tell me about a time you had a disagreement at work?\" etc. They also asked about how to deal with students, for example, \"What would you do if a student did not like you?\"\r\nThe interview process was expected to last 1 hour, but they liked me, so I got a tour. It took about 2 hours total.", "Interview Questions": "I was not expecting situational interview questions. "}, {"date": "16 Sept 2014", "title": "Financial Aid Planner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fortis College", "Interview Descriptions": "You're required to attend a group interview first and then you will be contacted for a one on one interview if you were selected. It can be a little scary if you're not used to talking in front of a group of people, but at least you get an opportunity to see who you're competing with.", "Interview Questions": "The questions were very basic, not difficult at all"}, {"date": "7 May 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Fortis College", "Interview Descriptions": "Called and asked me to come in, explained position to me, showed me around the building, introduced me to upper management and hired on the spot - There were no interview questions.", "Interview Questions": "N/A"}, {"date": "10 Feb 2014", "title": "Program Chair for College Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Fortis College", "Interview Descriptions": "Interviewed with campus president, DoA and the DoE. Had to do technical presentation with the DoE. Typical stress and behavioral interview with the DoA and camps president. Know your story/background/abilities and make sure to turn every negative experience into a positive (i.e. what you learned from it).", "Interview Questions": "Watch for body language. Don't be a stiff if you see the interviewer is relaxed and wants to chat. Sometimes, they just want to get to you know you better. "}, {"date": "15 Jan 2014", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fortis College (Orlando, FL) in Dec 2013", "Interview Descriptions": "Went through 3 interviews..1 with director, 1 with senior VP, and then sat down with a manager to review calls. Was told I would be offered the position by both the manager and director. Was told there would be an offer letter within a few days, only to be called back a week later to be told there was no budget to hire me.", "Interview Questions": "Will ask sales related specific questions "}, {"date": "7 Dec 2013", "title": "Assistant Instructor/Lab Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Fortis College (Wayne, NJ) in Oct 2013", "Interview Descriptions": "Conducted a mock class, met one-on-one with department head, drug test and background check, online application.", "Interview Questions": "All questions were relevant except: are you intuitive"}, {"date": "5 Dec 2017", "title": "Massage Therapy Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Fortis College (Wayne, NJ) in Oct 2013", "Interview Descriptions": "mock teach in front of a group of Fortis instructors and a personal interview with the chair of the massage therapy department.  I had to teach the basics of sports massage with both lecture and techniques", "Interview Questions": "to teach sports massage"}], [{"date": "15 Dec 2017", "title": "LRC Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Fortis College (Centerville, OH) in Jan 2013", "Interview Descriptions": "There was not much of one.  I was given a tour of the facility and asked some very basic questions about my education and work history.  I asked them simple library related questions; none of which they could answer.  Was called a month later and asked to start the following Monday.", "Interview Questions": "What is your educational background?"}, {"date": "23 Nov 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Fortis College (Indianapolis, IN) in Jun 2012", "Interview Descriptions": "Interview with direct supervisor first, then with the district admissions director. A phone screen is also done by recruiter.", "Interview Questions": "This was not a difficult interview if you have sales experience. "}, {"date": "20 Oct 2013", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Fortis College (Dayton, OH) in Mar 2012", "Interview Descriptions": "I felt the interview process was very pleasant and friendly.  There was no sense of pressure or nervousness.  The Department Head and the Director of Education were both friendly and open as to the nature of the job and its challenges.  I was grateful to learn that there were no mandatory \"retention meetings\" as there are at other institutions where I'd taught previously.", "Interview Questions": "There were no difficult or trick questions.  A rare, pleasant experience."}, {"date": "23 Oct 2013", "title": "HVAC/Electriction Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Fortis College (Dothan, AL) in Oct 2011", "Interview Descriptions": "Long and stressful and a lot of running arround", "Interview Questions": "What do you see yourself doing in ten years"}, {"date": "16 Sept 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Fortis College (Baton Rouge, LA) in Apr 2011", "Interview Descriptions": "Laid back and easygoing. My interviewer didn't make me feel as though I was under a microscope. We had a nice conversation where we discussed whether this particular position was of both of our best interest if I were to be hired. My interviewer was also very straight forward as to what the job entailed. There were questions I had asked, and my questions were answered in a nice friendly manner.", "Interview Questions": "Why should we consider you for this position"}, {"date": "9 Apr 2014", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Fortis College (Dothan, AL) in Aug 2010", "Interview Descriptions": "Three part interview with Campus President, Regional VP, and Regional Admissions Director.  This is done in person and by phone.", "Interview Questions": "N/A"}, {"date": "21 Nov 2013", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Fortis College (Columbia, SC) in Apr 2010", "Interview Descriptions": "Provide a short demonstration of teaching with a topic of the classes you will be teaching", "Interview Questions": "What are your goals five years from now?"}, {"date": "14 Jun 2014", "title": "Program Chair for College Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Fortis College (Scranton, PA) in Apr 2010", "Interview Descriptions": "Being hired at Fortis is more a matter of who you know rather than your qualifications. Most questions had nothing to do with qualifications. Salary was non-negotiable and no tour of the campus was offered at any time. only was able to meet with the HR director, not allowed to speak to any other instructor or senior staff.", "Interview Questions": "On a scale of 1 to 10, what do you think of the President of the US?"}, {"date": "17 Jun 2012", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fortis College (Dothan, AL) in Mar 2008", "Interview Descriptions": "Called into for face to face interview, I was asked normal interview questions, got offered a job immediately becuase I was over qualified. I was offered 55 a year during interview but when I was called to work I was offered 40 a year.", "Interview Questions": "How do you feel about buying you own training equipment and supplies?"}]]