[[{"date": "23 May 2021", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Everglades University", "Interview Descriptions": "1st interview was over the phone with the Director. Lots of questions were asked, so be prepared.  Second interview was virtual with the VP.  It was straight forward and more laid back. Overall, it was good experience. Everything was very professional and communicated information early on.", "Interview Questions": "How would you greet a potential student?"}, {"date": "5 Feb 2021", "title": "Director of Student Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Everglades University (Boca Raton, FL) in Sept 2020", "Interview Descriptions": "Very kind, very professional and most importantly, for me, the person who interviewed me was interested in learning more about what I have to offer and experience.  I was not interviewed to simply fill a spot.", "Interview Questions": "What experience do you have that can benefit our institution?\nWhat do you know about our institution?"}, {"date": "4 Nov 2019", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Everglades University", "Interview Descriptions": "The interview process is as followed, you get a group interview and one on one meeting with the vice president and Director of Financial Aid if you represent yourself well. Once you're approved, they proceed with a background and credit check.", "Interview Questions": "What are your weaknesses?"}, {"date": "25 Apr 2019", "title": "BURSAR Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Everglades University (Orlando, FL) in Apr 2019", "Interview Descriptions": "1. face interview w/ 2 males, 2. face interview with the same 2 males plus 1 woman, 3 phone interview with a woman. The women are nasty interviewers. they attack you not sure if they would conduct themselves this way if the candidate was a male.", "Interview Questions": "Being that it is a billing collector position they will ask you question about handling all types of clients/students?"}, {"date": "1 Oct 2015", "title": "Instructor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Everglades University (Boca Raton, FL) in Feb 2014", "Interview Descriptions": "Meet with the dean in charge of hiring. Present resume. Discuss goals and discuss knowledge of the school.Discuss past employment in the field of expertise and provide examples of experience in the field of instruction. Provide reasons for wanting the position and discuss current or past employment.\r\nProvide some personal background information.", "Interview Questions": "why do you want to come back to higher eduction."}, {"date": "31 Jan 2014", "title": "BURSAR Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Everglades University", "Interview Descriptions": "They interviewed about 20 people, the questions were run of the mill.", "Interview Questions": "Not alot of difficult questions, just wanted to know my background in accounting."}, {"date": "16 Feb 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Everglades University in Oct 2013", "Interview Descriptions": "Bait and switch interview.  Promises never kept and then it was too late!  They will lie in the interview about EVERYTHING!.  Make sure you get any promises in writing.   But, of course they won't give you that.", "Interview Questions": "I was promised many things that went out the window as soon as I started working there."}], [{"date": "3 Oct 2013", "title": "Director of Student Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Everglades University (Boca Raton, FL) in Sept 2013", "Interview Descriptions": "Last minute calls, \"can you come in today?,\" then three interviews for which I was kept  waiting each time by over a half hour.  One interview was scheduled against a meeting, so after waiting a half hour, the interview had to be cut short.  No return call or follow-up email after the final interview and attempts on my part to follow-up.  This is serious dysfunction and no one there looked happy, so it must be the norm. Stay away.", "Interview Questions": "Make sure you interview them.  Dig deep and trust your gut."}]]