[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Lifefull", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Jun 2020", "job_title": "Co-director in Indo", "duration": "N/A", "pros": "The flexibility with volunteers is very good.", "cons": "miscommunication sometimes because of the timezone differences."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "DON'T TRUST CAROLENA SASAKI. SHE'S A LIAR AND MANIPULATOR.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 May 2021", "job_title": "Co Director in Karangasem", "duration": "N/A", "pros": "The best thing is all the volunteers and children who are willing to contribute to this organization. I wouldn't be able to survive three months working with a hideous CEO if not for my fellow volunteers.", "cons": "1. A TERRIBLE HORRIBLE CEO\r\n2. There's no upper management in this organization, it mainly run by a one and only dicator, Carolena Sasaki\r\n3. The only and biggest problem is micro-management from the CEO herself. She called the center every single day, texted us on midnight, called us on our days off even if she knew exactly that we had our days off. She has this sort of control management issues. My mental health was deteriorating when I was working with Carol. I cried every single day. She manipulated me into thinking that I did my job wrong. She gaslighted me. I was burned out because I had to manage a center with an unreasonable amount of work without getting paid. It took me months to heal from this trauma. I just wish whoever applying to this organization don't have to experience what I experienced. But the best advice you can get for me is RUN while you have the chance. Just find a better place to work/volunteer."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Humanity Works", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Jan 2022", "job_title": "Site Manager in Jakarta", "duration": "N/A", "pros": "Teaching experience, connection with locals", "cons": "Too much unnecessary meetings and tasks, employees are underpaid, too much pressure."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "You will learn a lot", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Oct 2019", "job_title": "Global Director Leadership in Singaraja, Bali", "duration": "N/A", "pros": "I started to work for IHF as an At Home Volunteer but I faced the real challenges when I joined the IHF Center. This structure is run by 100% of volunteers and this is what I admire a lot. 100% of donations are given to the benefeciaries. You will learn a lot and more you have responsability more you are confident and more you feel that you learn a lot in a short time. Everyday we should keep in mind one thing : Why we are working for IHF ? And when you start to think about the children, you start to feel that you are overwhelmed by a motivation to push your limits. I give my contribution, my help to IHF because this structure deserves it more than any other ngo.  Personnally, when I see that a child is not yet sponsored I can't let things like, my duty is to do my maximum to sponsor as much children as we can to fight against this ignorance which leads to unfair situations. Join IHF you will learn not only a lot about yourself but also about how we run an NGO in whatever aspects. This is interesting when you have on you a humanitarian spirit and you want to organize it and develop it more.", "cons": "Nothing to add in that section except that work is the key for success and self confidence"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "The exposure makes it worthwhile - Transparent donation w/ minimal admin costs", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Jul 2015", "job_title": "Director, Bali & Fundraising/Marketing in Karangasem", "duration": "N/A", "pros": "Allows flexibility for immersion, direct contact with locals/children and a chance to make a substantial difference if your aspirations are to do so. The stipend allows for some flexibility, as long as you bring some of your own investment. The network you can build, both with community and with the more experienced Directors and volunteers has longevity. \r\n\r\nDonations reach the children 100%, and that is a big focus in the Foundation and a credit to management for reducing the admin trails that usually deduct from donations.  \r\n\r\nThe children and local community are a gift that can not be quantified: they make it ALL WORTH IT - every penny, bead of sweat and hard work invested!", "cons": "Some of the repetitive work is not conducive to productivity and growth of the Foundation. Promote more supportive, less controlling environment."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Outstanding experience!!", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Jun 2018", "job_title": "Volunteer in Candidasa", "duration": "N/A", "pros": "IHF gives you the opportunity to help in the most wonderful environtment, surrounded by wonderful people and amazing children. Althought it is intended you to teach the children, most of the tiemes they are the ones to teach you something about their culture, their country...even about yourself.\r\nMy time in Bali Centre it was incredible and Gina, Centre manager, is a very caring person who is always there to support you. The volunteers there (also the managers, Nicole and Gina) were my family the time I was there and still in contact with all of them,", "cons": "More help is required to keep the Centres alive. So do not hesitate and join!"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "A challenging experience that allowed me to surpass myself and to know I was made for humanitarian work!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Oct 2016", "job_title": "Co-director in Jakarta", "duration": "N/A", "pros": "By joining this team, I learnt how to handle an education center where 200 kids from the nearby slum areas come to study every week for free. I helped to link them with international sponsors so the poorest could continue attending local schools. I organised fundraisings, events for the kids, campaigns. I learnt everything on the field.\r\nAdditionally, I also got a good understanding of the functioning of a NGOs at the administrative level too, by handling the HR team for example. This is often a part that is forgotten but every international NGO needs them to exist! \r\nI challenged myself, I discovered a new country, Indonesia and its amazing culture, I made new friends that I miss dearly and with whom I still chat regularly. This experience changed me, and I am very thankful for all that I have learnt at IHF.", "cons": "Yes, working at an IHF center is hard, but you don't join the team to go on a vacation! Some people tend to forget that because of the places we live in, Indonesia, Kenya, Thailand. This job is definitely not for slackers or people who like to stay in their comfort zone. Be ready to give everything, but don't worry you will get much more back. \r\nSome tasks might be a bit repetitive but it's part of a normal job and if you know how important they are for the functioning of the organisation, it becomes essential to you too. There is room for improvement, but I always felt that my direct manager was very welcoming of new ideas to change the system for the better. \r\nThe PDG is definitely special, but she is not involved in daily decisions anymore and you can learn how to handle her, another exercise to improve your diplomacy skills. Moreover, based on my experiences with NGOs, you have to understand that many people who dedicate their lives to the benefit of others often struggle with personal issues."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "The dragon has awakened", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "24 May 2017", "job_title": "Co-director in Jakarta", "duration": "N/A", "pros": "The children and the bonds you develop with them.", "cons": "I have never, in my entire life, EVER seen and personally experienced such rudeness, lack of basic respect and incompetency by management. More specifically, from the CEO or rather the founder now as she likes to be called nowadays as she has retired only by name. Let's just say one mess led to another, and she is now more active in all aspects of the organization than ever before. She runs the organization like a crazed and disillusioned dictator. You will be micromanaged, berated and there will be no regard for your opinion, much less general wellbeing. When I look back at my experience and remember the things done to my coworkers and I, the more outraged and simply appalled I am by the sheer stupidity, arrogance and callousness of this woman who may once been a nice person but is now far, so far, from it. Why does this post seem to be so personal? Because Carol will try to dictate and control both your work and PERSONAL life while you work for her. You are seen as property, or a \"resource\" which is a nicer word they use from time to time. Not a human being who can or will suffer human consequences for the honestly terrible decisions they make which is usually based on emotion and no logic. Before you even consider joining this truly toxic organization, ask the people hiring you one question: is Carol Sasaki involved in any way with the organization and will I have to interact with her? If the answers are both yeses, run. For the sake of your mental and physical health, do not join. It's not worth the stress, frustration and anger for the volunteer pay you receive and the minimal impact you have on the children's lives. In such a poorly-run organization, it's hardly possible for you to make a true, long term impact. Respect the children enough to realize that they aren't fragile flowers that are withering away, and the ways IHF tries to help them is of poor quality. In truth, based on Carol's decisions, it has become apparent that she does not care about the children and communities she claims to serve. Its about her. Her ego and her \"legacy\". So please do yourself and those that care about you a favor, and abort all thoughts of joining this mad dictatorship."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Volunteer", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Mar 2018", "job_title": "Volunteer Coordinator in Denpasar", "duration": "N/A", "pros": "Beautiful place, beautiful people, fell in love with everyone around the center and especially the children. If you want to volunteer at a dream destination IHF Bali is the place to be", "cons": "In my 5 months there ere absolutely no negatives. My description of this place is little heaven"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to learn and volunteering", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Oct 2019", "job_title": "Volunteer in Medan, North Sumatra", "duration": "N/A", "pros": "The folks are very friendly like a family, many children come to study, the team is solid.", "cons": "Need to be more progressive to look for sponsorship, to improve the programs"}]]