[[{"date": "27 Oct 2022", "title": "Home Health Aide Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Munson Healthcare", "Interview Descriptions": "Easy nice people. Considerate Didn’t ask a lot of questions. Like the job Hours are flexible and wage seems good and good benefits I think I will like working here", "Interview Questions": "When can I start and how much notice"}, {"date": "6 Feb 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Munson Healthcare (Traverse City, MI) in Jul 2021", "Interview Descriptions": "Easy interview process, manager and assistant manager involved and inquisitive. Generally a good experience. No concerns with this company at all. Process was easy and flowed well. But this review requires at least 30 words.", "Interview Questions": "Why do you want to work for us?"}, {"date": "21 Jan 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Munson Healthcare", "Interview Descriptions": "This was for the critical care residency program for new grads. First there was an interview with a recruiter and then I got asked to come in for a panel interview with 6 nurse managers.", "Interview Questions": "1. Describe a difficult patient and how you handled it.\r\n2. Describe a conflict that you had with a co-worker and how it was resolved.\r\n3. What is your proudest achievement?\r\n4. What do you do to cope with stress?\r\n5. Why nursing?\r\n6. Why critical care nursing?"}, {"date": "23 Jan 2019", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Munson Healthcare (Traverse City, MI) in Jan 2019", "Interview Descriptions": "Online App, the app itself  takes a while to use.  Make sure y ok finish everything they ask you to do.  It took a week to hear back.  Very friendly and easy to talk too.", "Interview Questions": "Baseline questions.  "}, {"date": "23 Dec 2018", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Munson Healthcare", "Interview Descriptions": "HR, Unit and with staff. Toured the unit, manager was friendly but not very professional . Felt like there was an urgency to hiring.  The staff seemed unfriendly, didn't offer eye contact or a smile. Seemed like an unhappy atmosphere.", "Interview Questions": "why do you want to work at  MMC?"}, {"date": "17 Jun 2018", "title": "Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Munson Healthcare", "Interview Descriptions": "They had multiple people asking questions that included people that would be my equivalent.  They talked negatively regarding some of the software that they currently used. I think they had already picked a candidate before my interview.", "Interview Questions": "Asked why I wanted the position"}, {"date": "30 Nov 2021", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Munson Healthcare in Jan 2018", "Interview Descriptions": "splendid and the group was welcoming. I had a good time but in the end did not accept the offer because I had a change of heart to accept the offer from another company right after school", "Interview Questions": "Where do you see yourself in 5 yeaars?"}, {"date": "2 Nov 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Munson Healthcare", "Interview Descriptions": "HR and manager interviews the prospective employee and asks a multitude of questions.  Would have liked to have a panel interview and meet staff, be able to talk to other staff about how they like working there. obviously it would be one sided but would like to have had an offer to spend some time in the organization to see first hand how people work together.", "Interview Questions": "Why do you want to work here? "}, {"date": "13 Oct 2017", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Munson Healthcare (Traverse, MI)", "Interview Descriptions": "You are interviewed by HR and then again by the department manager and her 2nd in command. The HR is more general questions and the department interview is a lot quicker to see if they like you.", "Interview Questions": "Tell me about yourself."}, {"date": "12 Apr 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Munson Healthcare in Oct 2017", "Interview Descriptions": "I had an initial phone interview with a recruiter. Next wad an in person interview with the floor's manager. Everyone was professional, forthcoming and kind. They offered me the position that day.", "Interview Questions": "How will your experience contribute to our organization. "}], [{"date": "29 Aug 2017", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Munson Healthcare", "Interview Descriptions": "Starts with an HR interview, this can take a very long time to hear back on.  Just because you've interviewed with HR does not  mean you are coming in for a job interview in the near future.  Once the second process starts with the actual job interview the process is very quick!  Munson is excellent at getting back with the interviewee", "Interview Questions": "Are you a team player?  DO you function well in high stress environements?  Can you adapt easily to change?"}, {"date": "5 Oct 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Munson Healthcare (Traverse City, MI) in Aug 2017", "Interview Descriptions": "Straightforward, friendly HR phone interview.  Lasted about an hour.  2d phone interview with VP position reports to.  Friendly and professional.  That was over 7 weeks ago and have not heard from anyone.  HR won't return emails asking for status.", "Interview Questions": "Why Munson?"}, {"date": "21 Jan 2019", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Munson Healthcare (Traverse City, MI) in Jul 2017", "Interview Descriptions": "I basically went to meet with the manager of my floor and wasn't asked any specific questions. I was just told what the responsibilities of the position were, and then asked if I wanted the job.", "Interview Questions": "Why would you like to be a nurse assistant?"}, {"date": "13 Jan 2020", "title": "Interface Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Munson Healthcare (Traverse, MI) in Jan 2016", "Interview Descriptions": "Two phase interview, panel interview could be overwhelming for some candidates but it's a good way to weed out fragile personalities, overall good process and good experience. Enjoyed having non traditional questions", "Interview Questions": "If you could be any animal, what would you be?"}, {"date": "30 Oct 2015", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Munson Healthcare", "Interview Descriptions": "organized , nice and welcoming, took a test prior to interview online, people that interviewed me seemed to be a good team,  when I walked through the building - everyone seemed friendly, smiled at me.  person that set up interview was nice and flexible.  good process.  no complaints.", "Interview Questions": "How would your co-workers describe you"}, {"date": "8 Aug 2015", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Munson Healthcare (Traverse City, MI) in Aug 2015", "Interview Descriptions": "Questioned in regards to past medical experience...She also asked me who I worked for, different types of situations i may have had to go through(patients and employee wise) and pros and cons.", "Interview Questions": "What type of medical background do I have?"}, {"date": "10 Sept 2015", "title": "Associate Help Desk Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Munson Healthcare (Traverse City, MI) in Apr 2015", "Interview Descriptions": "Interview was done initially by phone contact and brought in for a series of team-based interviews. Also met with the director of Information Services and eventually the Chief Information Officer.", "Interview Questions": "Specific questions about IP and DNS."}, {"date": "24 Feb 2015", "title": "Chief Budget Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Munson Healthcare (Leavenworth, KS) in Feb 2015", "Interview Descriptions": "Two board members and four additional members dialed in.  Hiring official seemed preoccupied during the process and was difficult to get feedback from, very matter of fact.  The questions were expected for the position but a few scenario questions were vague and left much to be desired.", "Interview Questions": "Give an example of time when you were really stressed and had difficulty coping?"}, {"date": "24 Sept 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Munson Healthcare", "Interview Descriptions": "Positions are posted to the HR website. Although there is a delay between a unit's need and approval to have the replacing positions from HR. Translation if you are on a short unit it will take a while especially at end of fiscal year (June/July).  Best bets have been to contact the hiring manager directly instead of waiting for HR.", "Interview Questions": "Standard interview."}, {"date": "28 Sept 2016", "title": "RN - ICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Munson Healthcare (Traverse, MI) in Sept 2014", "Interview Descriptions": "The application submission online was user friendly.  Response was prompt. Multiple managers interviewed me at one time. The managers all had different qualities they were looking for. They did not ask me the same questions repeatedly as they were all involved in the process and attentive the whole time.  It was one of my most comfortable interviews.", "Interview Questions": "They asked why I chose their facility and unit to apply to."}], [{"date": "28 Apr 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Munson Healthcare in May 2013", "Interview Descriptions": "Submitted application after working on a unit for clinical rotation. Interview was straight forward, short and long term goals. Describe a time you overcame a difficult situation etc. A simple process.", "Interview Questions": "Describe how you managed a difficult situation"}, {"date": "26 Jul 2017", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Munson Healthcare (Traverse City, MI) in Jan 2013", "Interview Descriptions": "After being introduced by a family friend and long-term employee, I was able to meet with the unit manager for the specific floor I was applying to. After our first meeting ,HR was contacted and asked to speed up the hiring process. Met with HR about a week later. Quickly following word from the HR department, I was asked to have a formal interview by my manger, where the resource clinician was also present.  They asked fairly standard questions, no curve balls were thrown. Received job offer. Accepted job offer. Began training within the following two weeks. Training was 2-3 weeks long. Oriented to unit with a precepting nursing assistant for three weeks prior to being scheduled for a solo shift.", "Interview Questions": "How did you overcome an obstacle you were faced with in the past? Please provide an example. "}, {"date": "24 Apr 2015", "title": "Staff Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Munson Healthcare (Traverse City, MI) in Jan 2011", "Interview Descriptions": "Two interviews on the same day. One was with upper level accountants. The second was with Senior Management. The upper level accountants asked questions with regard to my skills. The Senior Management interview was quite laid back, the three gentlemen gave me more information than I was asked. They wanted to give me insight into the culture of the department and a sense of how well eveyone worked together. It was refreshing and appreciated.", "Interview Questions": "Questions were based on how I handled problems, what was my greatest weakness, how I interacted with co-workers, and what level of experience with excel, access, SQL and any other software or coding I had."}]]