[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great part time job!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Mar 2023", "job_title": "Concessions in Red Deer, AB", "duration": "N/A", "pros": "Work with good people, lots of interesting events, flexible schedule, fair pay.", "cons": "Bit of a hike from the bus stop in the cold"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Low stress but don't trust upper management and HR for a second!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Feb 2021", "job_title": "Parking Attendant in Red Deer, AB", "duration": "N/A", "pros": "Parking supervisors and direct manager were great to work for. Fun and low stress job. They were able to work within my restrictions.", "cons": "New CEO started holding meetings talking about how we were all part of the team and Park values but didn't acknowledge our department. When HR was approached by staff, they were either ignored or told that it was an \"overlook\" and that they were keeping the parking department. Accounting (payroll)  department doesn't keep proper records for government records. When I required a statement of hours worked and taxes removed, the guy at payroll told me they didn't keep those forms on hand (because the software is too old) and he could just talk his way out the problem with my contact. Needless to say, he couldn't just talk his way out of it, and I was penalized because they didn't keep records of taxes being withheld, etc. The hockey team dictates EVERYTHING that happens in that venue. I was being told by customers about the owner bragging at parties that they no longer had to pay for parking. When I questioned management, I was told that wasn't the case. When the hockey team began posting  on social media that there was no longer paid parking at the Park, and I questioned what was going on, again I was told that wasn't the case. Westerner Park publicly acknowledged that they would no longer have paid parking at their events, recently. This was their way of telling 30 people they no longer had a job. None of us were told by HR, they just posted on social media that paid parking was gone."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Decent", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Jan 2020", "job_title": "Parking & Security Coordinator in Red Deer, AB", "duration": "N/A", "pros": "Family feel non profit organization.\nGood people to work with.\nFull or Part time available. \nHours of operation. \nParking pass.", "cons": "Cutbacks. \nOver spent on a unnecessary building.\nSpent too much on CFR.\nIn debt.\nHours."}]]