[[{"date": "19 May 2023", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Salvation Army (Erina)", "Interview Descriptions": "It was ok 👍 3 interviewers were there and they were nice with smile. Even when I asked the question again, they were nicely repeated for me. Questions were a lot.", "Interview Questions": "How would the dementia patient's life?"}, {"date": "18 Apr 2023", "title": "Insight Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Salvation Army", "Interview Descriptions": "Got phone interview first, then ms teams interview, asking about the job but didn’t get very clear with the job requirements , not too much to share with, hope others good luck", "Interview Questions": "question about my working experience and the data analysis projects I did"}, {"date": "29 Mar 2023", "title": "Service Delivery Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Salvation Army (Burwood, Victoria) in Mar 2023", "Interview Descriptions": "Good, professional, welcoming, the GM and Director were friendly and to the point and go through a series of questions to understand how better the candidate can contribute to the TSA", "Interview Questions": "Self-introduction How would you explain the importance of having AD to a non-technical stakeholder? How long would you stay with this company? What is your management style? How do you engage with stakeholders? How do you measure stakeholder satisfaction? How To Deal with Difficult Employees? What KPI’s were used to measure team performance? Why was the reason for leaving? Would you leave TSA at the end of the contract and explore new opportunities? How do you balance your priorities when working with stakeholders? Describe your communication style. Tell me about a time you convinced someone to understand your perspective in the workplace What methods do you use to gather feedback from stakeholders? When taking calls or handling tickets, how would you manage the priority of the issue at hand? How would you support a person that says my laptop is dead and not working?"}, {"date": "18 Jul 2022", "title": "Property Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Salvation Army (Sydney)", "Interview Descriptions": "The process leading up to the interview was positive. I received a call promptly after applications closed and was invited for an interview. \r\nNo response since despite follow-ups reflects poorly on the organisation.", "Interview Questions": "Tell me about experience relevant to the RD"}, {"date": "29 May 2022", "title": "Finance Business Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Salvation Army (Melbourne) in Mar 2022", "Interview Descriptions": "Answering key selection criteria \r\nPhone screening \r\nTeam’s interview \r\nPanel interview with hiring manager and hr business partner.\r\nI was able to speak to my strengths and abilities and how this aligns to the values of the organisation.", "Interview Questions": "People management skills\r\nTime management skills"}, {"date": "18 Jan 2022", "title": "Shop Volunteer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Salvation Army", "Interview Descriptions": "The interviewer emailed and asked for my availability to set up an interview. I gave a time, then they set up a zoom meeting. The interview was short and easy", "Interview Questions": "What is your availability? Describe how you work in teams\r\n"}, {"date": "20 May 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Salvation Army", "Interview Descriptions": "Expressed my interest to become a volunteer, they rang me a few days after to come in for a interview, simple questions like what I know about the salvation army and about my availability", "Interview Questions": "About my availability"}, {"date": "3 Jun 2021", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Salvation Army (Sydney) in May 2021", "Interview Descriptions": "Great communication from part of the hiring manager.  Easy and straightforward process.  The people on the panel were very friendly. they ask clear questions and were happy to answer my questions at the end of the interview in a helpful manner.", "Interview Questions": "Tell me about yourself?\r\nWhat are the biggest challenge someone in this position will face?"}, {"date": "21 Jan 2021", "title": "Sales Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Salvation Army in Jan 2021", "Interview Descriptions": "Initial phone call to set up interview included a few questions. Asked the exact same questions during the interview as they did on the phone. I had the area manager and the store manager, store manager didn’t say a word the entire time. Said they’d contact me within a week and did not.", "Interview Questions": "How would you handle a difficult customer."}, {"date": "9 Oct 2020", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Salvation Army", "Interview Descriptions": "A quick chat and introduction to store. Manager interviews you and asks about if you want to help with stock, be on store floor and what day and time you are available", "Interview Questions": "What do you know about Salvation Army's mission?"}], [{"date": "12 Aug 2020", "title": "Youth Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Salvation Army", "Interview Descriptions": "Asked few questions about the role. That's it. Then asked few questions on self care. The whole process was easy and the interviewer made it easier too.  I was worried in the beginning but felt very relaxed later.", "Interview Questions": "What is trauma informed care?"}, {"date": "20 May 2023", "title": "Care Service Employee Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Salvation Army (Rockhampton) in Dec 2019", "Interview Descriptions": "Just be honest to your answer and always let them know you have experience and your happy to start as soon as possible. Smile and be polite always when speaking to the manager.", "Interview Questions": "Do you have experience working in aged care ?"}, {"date": "3 Jun 2019", "title": "Payroll Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Salvation Army (Melbourne)", "Interview Descriptions": "Interviewers were friendly and nice. They had a list of questions, and would ask you one by one, even some of them have overlaps. But the interview questions weren't too tough, general questions, and it lasted about 30 mins.", "Interview Questions": "Tell Me About An Accomplishment You Are Most Proud Of?"}, {"date": "28 Feb 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Salvation Army", "Interview Descriptions": "I applied online and the store manager called me. She asked me when I can start and gave me the job immediately. She didn’t ask for a police check or working with children check. Very straight forward.", "Interview Questions": "When can you start"}, {"date": "2 Mar 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Salvation Army (Melbourne) in Feb 2018", "Interview Descriptions": "O it was very easy just went to ask for the vacancy they gave me a form n ask to submit them.I filled the form and submitted it within 2 days.they checked my form asked relared questions and gave me intro about the volunteer role and asked me to come in tomorrow.", "Interview Questions": "Related questiins to form"}, {"date": "31 May 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at The Salvation Army (Melbourne) in Apr 2017", "Interview Descriptions": "I came into the store and spoke to the manger and told them about my interest in volunteering. She told me to come into the store a few days later so that we could discuss further.  I wore nice clothes and presented myself when I came in for the interview. It was very relaxed.  We spoke about wear she saw me in the store and told me about the type of job she saw me doing, which was cashier/customer service work in the store.  She asked me why I was interested in volunteering and whether I was still in school and what days I wanted to work. It was very calm and relaxed. Very easy to get a volunteer job at the salvos.", "Interview Questions": "Why are you interested in volunteering? "}, {"date": "3 Feb 2020", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Salvation Army (Melbourne) in Aug 2016", "Interview Descriptions": "Face to face interview with management including the chaplain who is usually on a power trip and has no clue the type of employee is needed. Questions asked at the interview were irrelevant to the position.", "Interview Questions": "Why do you want to work for the Salvation Army"}, {"date": "20 Aug 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Salvation Army (Melbourne) in Apr 2016", "Interview Descriptions": "It was thorough and overall it was a positive experience. It was my first phone interview which I prefer to be face to face, but that's fine. The questions were somewhat predictable but I have experienced similar interview questions so that probably helped.", "Interview Questions": "How would you use the experience you've had in your previous role in this new role."}, {"date": "24 Apr 2017", "title": "Client Services Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Salvation Army (Melbourne) in Mar 2016", "Interview Descriptions": "Panel of 3, mixed gender. Each member took times in asking questions. The interview took place on the premises. I don't think that the process illicited enough of the information that I would have wanted in their place. Culture is very important to this network and unless you are of a particular bent you will not last or enjoy your time there as the network doesn't like change and finds it difficult to accept new ideas.", "Interview Questions": "Why are you applying for this job?"}, {"date": "13 Jun 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Salvation Army (Sydney) in Jun 2015", "Interview Descriptions": "I was asked some difficult questions. Standard questions were there as well. It is highly recommended to know other NGO organizations that offer similar services to Salvation Army. Referral questions were asked.", "Interview Questions": "What would you do when we don't have enough vouchers or material aid to provide a clients or families"}], [{"date": "30 Dec 2015", "title": "Job Coach Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Salvation Army (Perth, Western Australia) in Apr 2015", "Interview Descriptions": "Very disorganised.\r\nCommunication was one sided to follow up on interview times, places and interviewers. Confirmations were not sent through and had to be followed up.\r\nInterviewed for a position I hadn't actually applied for.\r\nJob offer was made but not actually given to me, again had to follow up when asked when I was starting.", "Interview Questions": "Why didn't you apply for other role in organisation? (they were recruiting for multiple positions)"}, {"date": "7 Aug 2017", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Salvation Army (Brisbane) in Apr 2015", "Interview Descriptions": "Interviewed by manager and Melbourne rep. Interview about an hour. Offered job a week later. Process was quite easy and questions were not difficult. I think most people who get interviewed are offered job as very high turnover.", "Interview Questions": "N/A"}, {"date": "23 Nov 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Salvation Army (Melbourne) in Jan 2015", "Interview Descriptions": "Very easy. Just asked what times I was available and why I wanted to be a volunteer. Managers are very nice and eager to help at all times, so you just need to be honest with them. They take in all types.", "Interview Questions": "Why did you want to volunteer?"}]]