[[{"date": "6 Apr 2023", "title": "Foster Care Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bethany Christian Services", "Interview Descriptions": "Two people interviewed virtually, straight to the point, asked the usual common questions, heard back within a week, easy going conversation, looking for experienced people, and the interview was between 15-20 minutes if that.", "Interview Questions": "What job related tasks have you done previously?"}, {"date": "19 Oct 2022", "title": "Medical Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bethany Christian Services (Grand Rapids, MI) in Sept 2022", "Interview Descriptions": "My supervisor interviewed me for the first interview for mainly a \"get-to-know-you\" type of interview. The second was with my supervisor and the area's overall med coordinator. That one was also getting to know each other and also included how I think I fit in the company and they asked me about my main social justice passions, which was cool.", "Interview Questions": "Where do you see yourself in five years? What is one issue in social justice that you're most passionate about?"}, {"date": "26 Aug 2022", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bethany Christian Services", "Interview Descriptions": "Question and answer with two employees, one Who would be my manager, one who I would work alongside with. Quite informal. I did bring a number of questions with me.", "Interview Questions": "Why do you think you would be a good fit? "}, {"date": "10 Mar 2022", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bethany Christian Services", "Interview Descriptions": "Two rounds of interviews for case management. Make sure to ask questions! It can be intimidating as they are all supervisors. Manage your emotions and it should go well! Currently there are a lot of roles open. So if you feel like it is not a good fit feel free to ask about other open positions and they will be happy to redirect you.", "Interview Questions": "The classic, tell me about yourself. "}, {"date": "13 Feb 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bethany Christian Services", "Interview Descriptions": "I submitted resume. Received a phoned call within one week. They did a pre screening over the phone and then I was scheduled for an interview with the hiring manager. The entire process was simple standard questioning. Nothing stood out as different or out of the ordinary. Interview was easy and comfortable.  During the interview they offered me the position and had me fill out paperwork immediately.", "Interview Questions": "Why are u applying for this job"}, {"date": "27 Sept 2022", "title": "Education and Employment Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Bethany Christian Services in Jan 2022", "Interview Descriptions": "I was brought through three interviews: two over the phone and one in person. The in person interview was with a panel of six people, and they asked me very in depth questions about my values and beliefs. They very much implied the job was mine but the next week I got an autogenerated message saying I had not gotten the job.", "Interview Questions": "How do you deal with conflict?"}, {"date": "30 Nov 2021", "title": "Director of Refugee Resettlement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bethany Christian Services", "Interview Descriptions": "Great people and clear communication. It's an expanding organization trying to do it's best to meet the challenges if the day. They explained this clearly and with transparency. They're Human Resources department was very pleasant to deal with.", "Interview Questions": "How would your experiences translate to the position. "}, {"date": "10 Oct 2021", "title": "Mental Health Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bethany Christian Services", "Interview Descriptions": "The first interview is done by the clinical supervisor over the telephone.   Thereafter, you may or may not be invited to an in-person interview.   The second interview process involves a panel of five interviewers representing the multidisciplinary supervisory team.  Each supervisor pitches a detailed oriented  question involving client care and the approaches needed to engage, assess, treat, document on complex cases.", "Interview Questions": "How would you approach multiple youths in crisis and complete the reporting requirements in a timely manner? "}, {"date": "29 Mar 2021", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bethany Christian Services", "Interview Descriptions": "Two interviews with HR  and supervisor and and lot of background checks, fingerprints and DCF checks. The on boarding is super dense as there are a lot of trainings to take.", "Interview Questions": "Do you have experience doing this job?\nWhat are your main weakness and strength? "}, {"date": "11 Feb 2021", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bethany Christian Services", "Interview Descriptions": "It was pleasant, staff is very nice. After applying I got an email questionnaire and then followed two rounds of interviews.  1st interview around 1-2 hours, 2nd interview about 30-40 minutes. They do emphasize they are faith based.", "Interview Questions": "Describe a time you handled a crisis ?"}], [{"date": "2 Feb 2021", "title": "Content Writer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bethany Christian Services", "Interview Descriptions": "Typical phone, zoom, and panel interview followed by a writing assignment. The process was quite long, possibly due to the holidays, but it wasn’t terribly intensive. The interviewers were kind and gave me opportunities to ask questions.", "Interview Questions": "What is your typical writing process? \r\nHow do you manage your time?"}, {"date": "17 Jul 2020", "title": "Foster Care Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bethany Christian Services in Jul 2020", "Interview Descriptions": "Phone interview lasted about 40 minutes said they would get back to me in about a week regardless of if I get the job. Interviewer was nice felt more like a conversation.", "Interview Questions": "How can you demonstrate resiliency in this position?"}, {"date": "21 Mar 2020", "title": "Foster Care Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Bethany Christian Services (Grand Rapids, MI) in Mar 2020", "Interview Descriptions": "Had the phone interview then was called for an in person interview.  There were 5 people on the panel asking me questions.  Some which were provided ahead of time.  Then met with those currently in the position.  \r\nWhat I found odd was the panel of interviewers didn't even have ink pens to write down my answers.  Never got back to me on the status of the hiring decision.  Some of the interviewers seemed pleasant others seemed like I was wasting their time being there.  They cut me off asking questions when meeting with the panel.", "Interview Questions": "Define what trauma is."}, {"date": "19 Feb 2020", "title": "Regional Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Bethany Christian Services", "Interview Descriptions": "Initial telephone interview to review resume, past experience, and match qualifications.  Some information provided about current situation, recent developments, possible next steps.  Not too difficult.   Interview consisted of a 30 minute telephone call.  Easy to schedule.  Friendly interviewer.", "Interview Questions": "Why would you be a good fit for this position?"}, {"date": "11 Jun 2018", "title": "Pregnancy Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Bethany Christian Services", "Interview Descriptions": "After completing essay questions, phone interview, and a ridiculous assessment HR ignored me for a month and 1/2 and finally had the decency to say they went with someone else", "Interview Questions": "What are your strengths"}, {"date": "2 Dec 2017", "title": "Therapist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bethany Christian Services (Savannah, GA) in Dec 2017", "Interview Descriptions": "The interviewers were very thorough. The interviews dissected my resume and questioned about every position numerous times. Almost to the point of redundancy. It was almost like an interrogation. It could feel intimidating to some people.", "Interview Questions": "The interviewers wanted detailed, specific information about every aspect of my resume. "}, {"date": "26 Aug 2017", "title": "Foster Care Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Bethany Christian Services (Detroit, MI) in Jun 2017", "Interview Descriptions": "One interview. General interview questions such as work experience. For me it was an open interview and easy flow of conversation. I didn't feel intimidated. I felt they were very detailed and thorough about the job position.", "Interview Questions": "Work experience"}, {"date": "26 Apr 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bethany Christian Services (Nashville, TN)", "Interview Descriptions": "They were quick to respond to the application and scheduled the interview to fit my availability.  The original phone interview included questions both pertaining to skill level and long term goals.  The questions were also designed to get to know a person.", "Interview Questions": "Excellent questions to get a thorough overall feel for the candidates.  The interviews are group interviews.  There were many questions in regard to 'what would you do if' and 'give an example of a time when you...'  they were well planned out."}, {"date": "3 Dec 2017", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bethany Christian Services in Feb 2016", "Interview Descriptions": "Detailed, includes group interview, Bethany is a Christian agency, and employees will be asked of they prescribe to Christian values/faith, and if they would be comfortable in an employment situation where a meeting might open with prayer ect.", "Interview Questions": "Name a difficult situation that occurred between you and another employee, how did you resolve it?"}, {"date": "29 Mar 2016", "title": "Licensing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Bethany Christian Services (Grand Rapids, MI) in Mar 2015", "Interview Descriptions": "It was very simple. I interviewed with two supervisors who asked me typical questions about my role as a social worker and what I knew about Bethany Christian Services. Nothing tricky or unusual was asked. They got back to me within a couple of weeks after the interview to offer me the position.", "Interview Questions": "What are your career goals?"}], [{"date": "2 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Bethany Christian Services (Knoxville, TN) in Mar 2015", "Interview Descriptions": "They made sure I was going to be a good placement on their team. They had me pray over being part of the company for my internship. They today are still good about when I walk in the door to talk to me and acknowledge me. They emailed me and then had a in person interview.", "Interview Questions": "Are you a believer of Jesus Christ?"}, {"date": "24 Sept 2015", "title": "International Services Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Bethany Christian Services (Grand Rapids, MI) in Jan 2015", "Interview Descriptions": "There were 4 interviews in totalThe first one was a phone call with an HR person, as well as a number of emails exchanged with a vice president's executive assistance.  After a few weeks, I was scheduled for one interview with supervisors, which was done in a group format.  After that, I was called back to interview with a group of employees, many of whom were doing the position I was interviewing for.  Finally, they called me back for a final group employee interview.  I wasn't told the process would be that long or intense, each interview lasted at least a hour, expect the phone call.", "Interview Questions": "What is your biggest area of struggle?"}, {"date": "31 Aug 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Bethany Christian Services in Jan 2015", "Interview Descriptions": "I submitted my resume after having contact with them. They called me for an interview a few weeks later and they set up an interview. I was interviewed by one person. The interview was fairly easy.", "Interview Questions": "Why do you want to intern here?"}, {"date": "9 Jan 2015", "title": "Adoption Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Bethany Christian Services in Dec 2014", "Interview Descriptions": "I applied and heard back in about a week for a first interview. Cindy, who interviewed me, was genuine, gracious, easy to talk to, and godly. She gave me a lot of information about Bethany and what I would be doing specifically, then sent me a packet to fill out for references. \r\n\r\nOnce I submitted it, they set up a second interview with Cindy and Sharon, who is the Assistant Director. Both were funny, genuine, and deeply cared for the work they were doing. It was inspiring to speak with them. They told me to expect a call at the end of the week if there was an offer involved. \r\n\r\nAfter deciding to accept an offer elsewhere, I called Cindy to let her know and tell her how much I enjoyed meeting with her and Sharon. She called me back and told me it was a blessing to meet together and that the door was open for me in the future. I was flabbergasted at how gracious and kind she and Bethany was even when I had decided to go elsewhere.\r\n\r\nI highly recommend this company for its staff and mission! I hope that I am called to work at Bethany in the future.", "Interview Questions": "I was asked to do a writing sample, which I was surprised by. However, it was not difficult."}, {"date": "4 Dec 2015", "title": "Clinician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bethany Christian Services (Atlanta, GA) in Sept 2014", "Interview Descriptions": "The interviewe was good. I was promise a position if all my paperwork came in. Paperwork was sent in but disorganiaztion of office  caused a delay. I was told I was not hired because a reference was not sent back. When  I asked which reference they could not tell me then said one reference came in late even though they were  still hiring for the position.", "Interview Questions": "  What  did I do to relax?"}, {"date": "31 Aug 2016", "title": "Intake Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bethany Christian Services (Saint Louis, MO) in Jun 2014", "Interview Descriptions": "The interview process included just one interview and a personality quiz. They did take a LONG time to get back me and and cancelled the interview the first time. The interview itself was pleasant enough, but they're lack of communication was frustrating.", "Interview Questions": "Q: what are 5 words you would use to describe yourself?\r\n\r\nQ) how did you hear about Bethany Christian services?"}, {"date": "7 Sept 2015", "title": "Pregnancy Counseling Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Bethany Christian Services (Madison Heights, MI) in Jun 2014", "Interview Descriptions": "Asked a lot of questions about religious faith and social work background. They were very friendly and did not seem intimidating at all. They asked a lot about my professional background and educational history.", "Interview Questions": "How does your faith influence your work in the field?"}, {"date": "12 May 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at Bethany Christian Services (Elkins Park, PA) in May 2014", "Interview Descriptions": "I felt very comfortable asking questions and presenting my concerns to the interviewer. The respond time was very short and the interviewer kept me informed at all times. The interview lasted for about one hour. Interviewer seemed knowledgeable about school requirements. The interviewer explained in details about position requirements and skills that I will learn working at the agency.", "Interview Questions": "What is your learning goals?"}, {"date": "29 Jan 2014", "title": "Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bethany Christian Services (Lancaster, PA) in Jan 2013", "Interview Descriptions": "I applied through my schools career center and did not have much knowledge about the company. When I went in for the interview they started off with introducing themselves and them we prayed. It was very comforting and made me less nervous. Then they asked me a few questions on why I felt I was the right person for the job. Then they hired me and I started the following week.", "Interview Questions": "N/A"}, {"date": "13 Jan 2016", "title": "Youth Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Bethany Christian Services (Grand Rapids, MI) in Sept 2012", "Interview Descriptions": "The interview process was conducted by two program managers, and was so friendly and easy. All was about youth experience, activities, different situations and how to handle problems that might face the candidates for this position. The interview time was a total of 30 minutes with no waiting time, and got the result within few days.", "Interview Questions": "How did you handle a disagreement situation?"}], [{"date": "30 Jun 2015", "title": "Adoption Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Bethany Christian Services (Madison Heights, MI) in Jun 2011", "Interview Descriptions": "I was able to interview via skype due to the distance. I was asked questions about my education background, what licenses I currently have. I was asked about why I am interested in adoption, since by background was primarily in counseling. I was asked what difficulties have I experienced in the mental health field, and what qualities would I bring to the company.", "Interview Questions": "Experience in the social services and mental health field."}, {"date": "18 Apr 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Bethany Christian Services (Grand Rapids, MI) in Dec 2010", "Interview Descriptions": "Standard:  Strength/weakness, where do you see yourself in 5 years, why Bethany, etc", "Interview Questions": "What do you look for in a supervisor?"}]]