[[{"date": "3 Apr 2023", "title": "Eye Bank Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OneLegacy (Azusa, CA)", "Interview Descriptions": "Straight forward interview. Good vibes with all the staff. Really easy onboarding process. They start you off as a class for orientation so you are not alone and HR communicates well.", "Interview Questions": "What does HP stand for?"}, {"date": "14 Mar 2023", "title": "Family Care Center Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 days. I interviewed at OneLegacy (Azusa, CA)", "Interview Descriptions": "You must provide business references who are sent a survey to complete about working with you. The in-person interviewed is approx 2 hours. One hour to complete an online assessment and then one hour for an interview with two managers. Unfortunately the hours for the position were not provided until the interview.", "Interview Questions": "What major breakdowns occurred at your previous job and how did you handle it?"}, {"date": "12 May 2021", "title": "Family Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OneLegacy", "Interview Descriptions": "So far the interview has been nice the assessment is personality and math; I haven't taken the assessment yet Glass Door won't let me view other reviews unless I put my own so here it is.", "Interview Questions": "What do you like to do for fun"}, {"date": "16 Jan 2021", "title": "Eye Bank Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OneLegacy", "Interview Descriptions": "Interview was about 45 minutes long and was asked a variety of questions. Questions on background, knowledge, and company. The interview was done remotely with 2 staff members (one MD and one supervisor).", "Interview Questions": "Medical terminology questions: What does COPD stand for?"}, {"date": "30 Jul 2020", "title": "Donor Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at OneLegacy", "Interview Descriptions": "General phone screening with an HR representative then in person interview with multiple people. Overall it seemed pretty standard as far as the process as a whole. They do ask you to confirm if you have a valid drivers license and auto insurance.", "Interview Questions": "What interests you in OneLegacy"}, {"date": "15 Nov 2019", "title": "Donation Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at OneLegacy", "Interview Descriptions": "Phone interview followed by an in-person interview and a 2 hour online test conducted on-site on personality, word association, and math. Everyone was very helpful and willing to answer questions along the way.", "Interview Questions": "Where do you see yourself in 3-5 years?"}, {"date": "26 Mar 2020", "title": "Donation Development Coordinatorinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OneLegacy (Los Angeles, CA) in Aug 2019", "Interview Descriptions": "Application process, initial screening, and in person interviews were all positive experiences. At each step of the way, the managers were expressing an increase in the load of the position. By the time I received an offer, I realized what they were offering was not comparable to the amount of work they expected. The HR person was not willing to negotiate at all, so in the end it was their loss. When you can easily see the salaries of executives at this organization, it would behoove them to prepare an offer comparable to the amount of work they expect of a person.", "Interview Questions": "Give a 1 minute elevator pitch on any topic. "}, {"date": "25 Oct 2018", "title": "Donation Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at OneLegacy (Los Angeles, CA) in Oct 2018", "Interview Descriptions": "The interview process moved quickly.  I was contacted by their HR department after they saw my profile on a jobboard.  A phone screen with the HR Manager was scheduled two days later.  The phone screen was fairly straightforward and informative.  It was great to deal with the company directly and not through a recruiting agency with limited information.  We scheduled a face to face interview with the Supervisor and Department Head six days later at their downtown Los Angeles office.  That interview lasted just under an hour and I was told they would be interviewing other people over the next week and I should expect a response about the next step (in office assessment followed by an interview with the VP) within two weeks.  I sent a thank you note the following week, but received a \"thanks, but no thanks\" email shortly after.  The whole process took 15 days, and they were professional and polite every step of the way.", "Interview Questions": "\"Name an occasion where you dealt with a difficult client\"\r\n\"How would you build relationships with clients?\""}, {"date": "20 Aug 2018", "title": "Special Events Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OneLegacy (Los Angeles, CA) in Aug 2018", "Interview Descriptions": "I applied online and had a phone screening. During the screening which lasted 6 minutes, the first thing the recruiter said, \"The job pays $21 dollars an hour, you must work during the Rose Parade (Dec-Jan) and you are required to dress professionally. Are you still interested?\"\r\n\r\nI was offered an in-person interview that lasted approximately and hour. The ladies were friendly but serious. Concluding the interview, they talked about how great the benefits were and even gave a fancy folder with benefit information, job description, and more company information. I received an email 45 minutes after the interview to say they were not interested. I have never received a rejection so quickly which I thought was rather rude...but I guess at least they got back and did not string me along?", "Interview Questions": "All of the basic interview questions: Strength, Weakness, Why would you want to work here, Tell us a time that you had a difficult situation, etc. "}, {"date": "9 Jul 2018", "title": "Event Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at OneLegacy", "Interview Descriptions": "I applied through their website and was contacted by phone to start their process. I went through the first screening interview via phone.  I was scheduled for a second interview in the office but elected to pursue other leads that were heating up. The phone interview was very thorough and they were very clear about salary, schedule, office policy expectations and other things that might be “dealbreakers.” In addition to interview type questions it was a true screening to see if a further meeting is worth having.", "Interview Questions": "What do you know about the organization and the mission?"}], [{"date": "3 Sept 2020", "title": "Donor Information Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at OneLegacy (Los Angeles, CA) in Feb 2018", "Interview Descriptions": "It was a great experience to get to know the hiring managers. The questions they asked were very straight to the point and allowed time to deliver the answer. They also provided some time to ask question and were very engaging in answering my questions.", "Interview Questions": "What was your greatest achievement?"}, {"date": "12 Jan 2018", "title": "Accounting Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at OneLegacy (Los Angeles, CA) in Nov 2017", "Interview Descriptions": "Submitted application online, initial phone interview with HR, first round in person with department management (2 individuals), took two screening IQ/personality assessments on-site, second round in person with CFO and COO, submitted additional information for background checks and references.", "Interview Questions": "Tell us about your experience managing people."}, {"date": "22 Aug 2017", "title": "Helpdesk Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at OneLegacy (Los Angeles, CA) in Jul 2017", "Interview Descriptions": "It was smooth and interesting. Lots of technical questions. They have a very welcoming team and the people that conducted the interview are patient and understanding. I went through a phone interview first then was invited for 3 face to face interviews in their office.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "29 Jun 2017", "title": "Surgical Recovery Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OneLegacy (Los Angeles, CA) in Mar 2017", "Interview Descriptions": "The process was very professional.  They provided me with all the amenities to make the interview as pleasant as possible.\r\nThe organization schedules the entire interview process according to my needs.", "Interview Questions": "General questions based on your education and work experience.  \r\n\r\nThese questions are never missing: your  weaknesses and strengths. "}, {"date": "28 Oct 2017", "title": "Surgical Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OneLegacy (Los Angeles, CA) in Feb 2017", "Interview Descriptions": "2 Step interview process. FIrst via phone, and second with team personnel. After these comes the sit-down with the COO and other members of the company.  They all typically asked the same questions. I accepted another job offer and didn't elect to go through with the company.", "Interview Questions": "Plans for the next 3 to 5 years, how you cope with stress, experiences, strengths and weaknesses. Very easy and straight forward"}, {"date": "16 Oct 2019", "title": "Procurement Transplant Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at OneLegacy (Los Angeles, CA) in Oct 2016", "Interview Descriptions": "First interview is with managers, then there is personality testing another day, followed by another interview with upper management. Sometimes peers will be present but it’s rare bc they have to come in on days off and it’s unpaid.", "Interview Questions": "What makes you think you’re smart enough to do this job?"}, {"date": "12 May 2016", "title": "Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at OneLegacy (Los Angeles, CA) in May 2016", "Interview Descriptions": "The process is standard. Phone interview, followed by an interview with one person that tells you that if you pass that one interview you have to go back for another interview with the VP and then another interview with the CEO. As if it is easy for you to find 5 hours a day to spare. Traffic around their building is horrible.", "Interview Questions": "They read the same questions 80 % of the companies ask. \"Where do you see yourself in 5 years (it would be 10 but I'm old and there was a chance I would answer - RETIRED)\"\r\nAnother question: \"what attracted you to apply for One Legacy?\" I was asked that question twice and I was trying to say that I had never heard about One Legacy before until I saw their job posting on the top of the list of Indeed website, in a polite way, but the interviewer could not understand and kept asking.\r\nFurther questions: if we have a problem getting vaccines and if we have any problems with working with the latest technologies. (Based on what I saw and heard their technology is not so advanced)."}, {"date": "5 Dec 2015", "title": "Donation Development Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OneLegacy (Los Angeles, CA)", "Interview Descriptions": "Three steps to interview process\r\n1) Phone Interview-completed with direct supervisor. \r\nIn Person Interview with direct supervisor and other management staff.\r\nIn Person Interview with Upper Management staff.\r\nThe interviews were comfortable and professional. They were held at the corporate office in downtown Los Angeles. \r\nThe in person interview was followed by some personality testing and logical reasoning testing at the corporate office. I found both of these to be standard as I had experience taking tests like these in the past.", "Interview Questions": "Are you available to work on call at any hour of the day?"}, {"date": "19 Feb 2017", "title": "Donation Development Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OneLegacy (Los Angeles, CA) in Oct 2015", "Interview Descriptions": "Phone Interview first, In person interview next with director supervisor. This was a panel interview with three people asking questions. 2nd interview after taking personality test with Senior leadership.This was with two senior leadership managers.", "Interview Questions": "How do you work with people who are difficult?"}, {"date": "29 Oct 2014", "title": "Communications Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OneLegacy (Los Angeles, CA)", "Interview Descriptions": "Applied for job from online application. Received a phone call several days later to set up interview at downtown Los Angeles office. I was interviewed by a single manager. The interview lasted around 45 minutes of was not stressful. The manager was engaging and really seemed interested in what I had to say. I was asked to complete a second interview at one of their remote locations and was interviewed by two people, also both very personable. They asked my typical questions such as \"Tell us about yourself,\" \"What makes you the best candidate for this job?\" \"How do you handle stress,\" etc. I was called the next day and offered the job.", "Interview Questions": "I can not think of any really difficult or unexpected questions. The one I like the least is \"What difficulties have you encountered in past projects and how did you solve the problems?\""}], [{"date": "4 Aug 2014", "title": "Surgical Recovery Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at OneLegacy", "Interview Descriptions": "I put in an application and received a message to be available at X date and time. I actually got the call a month later. After that call an interview was set up the following week. I was left alone to fill out paper work while the interviewer went out and did something else. I was finished and had to wait 20 minutes for her to check back on me.", "Interview Questions": "What are your 2 greatest weaknesses? A great deal of technical question on tissues be prepared."}, {"date": "30 Jul 2014", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OneLegacy (Los Angeles, CA)", "Interview Descriptions": "Very easy process.  I only met with two people and was made an offer a few days later.  The manager was friendly.  The vacancy was due to a promotion.  The previous person was in the interview as well.", "Interview Questions": "No difficult questions."}, {"date": "20 Oct 2016", "title": "Donor Information Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at OneLegacy (Los Angeles, CA) in Sept 2012", "Interview Descriptions": "Received a call from the Donor Information Manager who stated she saw my resume online and inquired if I would be interested in their organization, and specifically the Donor Information Coordinator position. I was scheduled for an interview the next day. I was interviewed by the Donor Information Manager and another manager from a different department. After the interview, she asked me to immediately meet with the COO and another director (who were located in a different office at the time). She asked me to call her after my meeting with the COO, in which she offered me the job right then.", "Interview Questions": "Do you have any experience with medical abbreviations? What does MI mean? H&P? CA? Etc."}, {"date": "13 May 2011", "title": "Information Technology Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OneLegacy (Los Angeles, CA) in Mar 2011", "Interview Descriptions": "This is a strange organization.  Particularly as a non-profit, they appear to possess an extremely high ego, and demonstrate that 'outsiders\" (applicants, non-employees) cannot possibly be of the same mission-driven caliber as they.  Too busy protecting their internal domain, than to seriously consider any real talent presented to them, their business challenges go unaddressed -- apparently these are too important for anyone else to resolve.\r\nInitially I was introduced to them by an external recruiter who had presented multiple applicants.  OL rejected one after the other, until finally appearing to accept one, perform background check, etc; and then never followed up.  They ended up firing the recruiter after she diplomatically advised that they were unreasonable in their expectations, including wanting a high-level, business-minded IT Director who could also be a complete backup for any number of technicians.\r\n\r\nI later responded directly to an ad they ran.  Surprisingly, I was called in quickly for an in-person interview (no phone screening.)  I met with the hiring manager -- holder of three (3) principle titles.  I was seated at his desk in a chair, adjusted noticable lower than his.  He was distracted by phone calls which he accepted; and offered no apology to me.  He began the interview and simultaneously scanned  and studied my resume, as if not seeing if before.\r\n\r\nNonetheless, he appeared interested; even arranging later that day for an interview with a peer manager to occur the next business day!\r\n\r\nI met with the peer manager as scheduled.  This was quite a condescending experience.  This manager was arrogant and more interested in my qualifications addressing his issues, rather than my primary functions in a liaison role with his responsibilities.  He went on to indicate that “they received numerous resumes, and they must select the most qualified candidate.”  Really?  I never realized that was the recruiting and hiring objective.  After fishing a bit, I was finally able to crack him, whereby he virtually admitted that the hiring manager was probably on an unrealistic quest, but that it would be his hiring decision.  Despite this manager’s ‘embarrassment’ of their inferior technical systems and capabilities (his words), he seemed well trained in the prevailing self-righteous, high superiority culture.  He did however in the process, tell of the low level of customer service and general 9 to 5 attitude of the internal staff – completely contrary to the story I was being sold.", "Interview Questions": "Tell me about yourself..."}]]