[[{"date": "12 Oct 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at College Hospitals (Cerritos, CA) in Oct 2022", "Interview Descriptions": "The interview was more like a pop quiz. They ask you a lot of questions about medications, restraints, scenarios, etc. They told me I couldn’t see the unit but wanted my to accept an offer which was concerning and the main reason I won’t be accepting. Seems like there is a high turnover rate because there are 5 new nurses every week.", "Interview Questions": "What are side effects of chemical restraint medications"}, {"date": "25 Dec 2021", "title": "Mental Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at College Hospitals (Cerritos, CA)", "Interview Descriptions": "Applied Online through indeed and was contacted almost a month later. I got to meet with the director of my unit, it was definitely more of a meet and greet instead of an interview.", "Interview Questions": "What experience do you have in mental health? "}, {"date": "26 Jun 2021", "title": "Patient Registration Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at College Hospitals (Costa Mesa, CA) in Jun 2021", "Interview Descriptions": "Interviewed with the Director of Patient Admissions and the Director of Human Resources. They asked fairly simple questions like how you handle pressure, why you want the job, do you work well with others, etc.", "Interview Questions": "Tell me about yourself?\nHow do you handle pressure?\nDo you have an experience that can relate to the job?\nWhy do you want the job?\nDo you work well with others?"}, {"date": "13 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at College Hospitals (Costa Mesa, CA) in Jun 2021", "Interview Descriptions": "It was a easy process. It probably took about 20 minutes, but it was relaxed and calm. You will go into the intake room in the very front. It’s a little distracting with people walking by, but I felt it made it more relaxed.", "Interview Questions": "Simple and Basic interview style questions. "}, {"date": "6 Nov 2020", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at College Hospitals", "Interview Descriptions": "It was pretty straightforward. I was asked to give a description of my work history. I was also asked about my strengths, how I problem-solve, why I am interested in the position.", "Interview Questions": "Name a conflict you encountered and how you overcame it."}, {"date": "15 Sept 2020", "title": "Staff RN I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at College Hospitals (Cerritos, CA) in Aug 2020", "Interview Descriptions": "I was interviewed by a very skilled and knowledgeable nurse manager.  He was very nice and conducted a very thorough interview.  I had me on my heels a couple of times, but overall, the interview was a very positive, learning experience.", "Interview Questions": "They asked me a couple of med questions for pscyh patients. "}, {"date": "21 Nov 2020", "title": "Mental Healthcare Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at College Hospitals (Cerritos, CA) in Jan 2020", "Interview Descriptions": "Amazing company, wonderful staff, interview was a breeze! Interviewer was a very pleasant man, I did not feel intimidated. I walked away with confidence that I would be receiving positive news.", "Interview Questions": "If you walk in a room and someone is on the floor pale and sweating what do you do?"}, {"date": "3 Mar 2019", "title": "Patient Registration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at College Hospitals", "Interview Descriptions": "One person interview set up with dept. manager.  Manager was nice and not intimidating.   Asked standard interview questions if I can remember and did not take too long.", "Interview Questions": "Tell me about yourself"}, {"date": "15 Mar 2019", "title": "RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at College Hospitals (Costa Mesa, CA) in Jan 2019", "Interview Descriptions": "Disorganized .  I came early to interview,  they provided with a test before interview,  and they called to be interviewed before my appointment  time , which it rushed to finish my test.", "Interview Questions": "What would you say to a patient that comes and tell you that he doesn't like you earrings?"}, {"date": "4 Oct 2022", "title": "Mental Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at College Hospitals in Sept 2018", "Interview Descriptions": "The interview is very casual and doesn't take too long. The hospital has a high turnover rate so whatever you do not know they will teach you. As long as you seem interested in the job and have a willingness to learn you will most likely get hired.", "Interview Questions": "gives scenerios and put them in order of priority. ex a patient who is diabetic is calling for help, a patient is about to fall, and a patient is yelling, who do you go to first? Do you know how to take BP? VS? What does the blood pressure indicate?"}], [{"date": "17 Jun 2021", "title": "Activity Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at College Hospitals (Costa Mesa, CA) in May 2018", "Interview Descriptions": "Interview process was laid back. Was interviewed by a few different staff members. They mainly ask a lot of fun questions since the department is about art & games. As long as your personality matches well with the group, you'll be fine.", "Interview Questions": "Favorite holiday? How do i feel about dressing up?"}, {"date": "25 May 2018", "title": "Med/Surg Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at College Hospitals (Costa Mesa, CA) in Dec 2017", "Interview Descriptions": "1:1 interview with unit manager scheduled the day after application was submitted. I scheduled the interview the week after. Some applicants have had to interview 1:1 with the DON. Drug test on psychotropic meds included. However, my manager said this was simply a test of my knowledge to improve on, since I was a new graduate nurse without experience at the time. After the test, the manager gave me the most common meds given in the unit for me to study prior to unit orientation.", "Interview Questions": "\"What are your strengths/weaknesses?\"\r\n\"How good are you with computers?\""}, {"date": "6 Oct 2017", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at College Hospitals (Signal Hill, CA)", "Interview Descriptions": "The interview was very straightforward and staff are very friendly. I felt welcomed by the staff and questions were related to the job. It was about a 30 minute interview.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "8 Nov 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at College Hospitals (Cerritos, CA) in Oct 2017", "Interview Descriptions": "Positive and friendly staff. Manager seemed short staffed that day and seemed overbooked. The manager was attentive, friendly, and understanding of the circumstances. Interview was around 20-30 minutes and the manager provided a tour at end.", "Interview Questions": "What class of medication do you give to a patient who is having a mental breakdown?"}, {"date": "6 Sept 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1+ week. I interviewed at College Hospitals (Irvine, CA)", "Interview Descriptions": "I sent my resume and they called the next day to set up an interview. I interview the day after and got a call from HR offering the job 6 days later.", "Interview Questions": "What are the 3 criteria as to put someone on a 72 hour hold?"}, {"date": "5 Jul 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at College Hospitals (Norwalk, CA) in Jun 2017", "Interview Descriptions": "Applied online, received a callback in about 1 week, interviewed with hiring manager. Asked many psych quiz questions. Make sure to study up on some common psych disorders - schizophrenia, bipolar disorder, 5150 patient", "Interview Questions": "What are signs and symptoms of bipolar disorder?"}, {"date": "14 Oct 2017", "title": "Purchasing Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at College Hospitals (Cerritos, CA) in Feb 2017", "Interview Descriptions": "You go in and talk about your experience and the job applied for and briefly answer questions regarding previous job experiences or how to handle situations,etc. Really simple and friendly so no need to be nervous", "Interview Questions": "How would you handle a situation at a job that might be a bit stressful?"}, {"date": "5 Oct 2016", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at College Hospitals in Jun 2016", "Interview Descriptions": "-You turn in an application then they call you. They have a few centers in Los angeles that you can come in to. The process is very easy. The people are very nice.", "Interview Questions": "-They ask basic stuff like why you want to work for them. Very easy."}, {"date": "14 Nov 2016", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at College Hospitals (Cerritos, CA) in Mar 2016", "Interview Descriptions": "Upper management ask good and direct questions that aren't beating around the bush. They allow employees to be present which was weird. It is also a group interview which makes it unnecessarily competitive. The staff maintained a light hearted feeling throughout the process and allowed for personal questions to be answered at the end of the process. They seemed more interested in your personality and whether or not it would be a good fit for the company.", "Interview Questions": "Why did you enter the field of mental health?"}, {"date": "8 Jun 2015", "title": "Patient Accounts Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at College Hospitals (Cerritos, CA) in Jun 2015", "Interview Descriptions": "It was fairly quick.  I put in an application on May 20th and I was contacted on May 21st to have an interview on May 22nd.  Unfortunately, on that day, they called to say that they filled the position.  I always appreciate when an organization tells you right away, instead of wasting time.  They called again in an hour saying that they felt that I could fit into another position (Patient Admitting Representative) and I was given an interview within the hour.  They liked me and asked me to have another interview with their Director of Patient Accounts on May 29th.  I thoroughly enjoyed interviewing with her and it felt more like a conversation to see if we both fit in with each other's needs.  The environment felt very relaxing and I knew that the company was a perfect fit for me and I was a perfect fit for the company.  I was offered the position on June 4th.", "Interview Questions": "What do you look for in a supervisor?"}], [{"date": "22 Jul 2017", "title": "Patient Care Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at College Hospitals in Mar 2014", "Interview Descriptions": "Three step process of interviews that involved human resource and management and a set of questionnaires. I also had to deal with a given scenario and asked how I would deal with it", "Interview Questions": "Experience, Scenarios and a set of questionnaires in form of a text."}]]