[[{"date": "11 Jun 2023", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Purdue Global (Lafayette, IN)", "Interview Descriptions": "Fast and communicative process. Overall good candidate experience. Nice people and good mission. Working with adult students to help them choose academic and training tracks to reskill and upskill for careers.", "Interview Questions": "Tell us a time when you had to balance a large caseload of advisees."}, {"date": "4 Nov 2022", "title": "Associate HRBP Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Purdue Global", "Interview Descriptions": "Initial Interview was a video and also had to give written responses via email. Second interview was a panel interview with basic information and questions. They want to know why you want to work for Purdue Global.", "Interview Questions": "Why do you want to work for Purdue Global?"}, {"date": "23 Nov 2021", "title": "Learning Management Systems Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Purdue Global", "Interview Descriptions": "From when I applied, it took them awhile to review my application and get back to me. I did one video interview with them-- I can say abundantly that the two interviewers lacked professionalism. eg. they continued to mispronounce my current institution's name despite my telling them specifically how it's pronounced. For those who don't know, Purdue Global was once a private ed company (that Purdue now owns). A lot of the employees that Global has came from private sector jobs and aren't used to jobs in education. This interview mad that clear.\r\n\r\nAfter the interview was completed, I never heard back from them or their HR rep. Quite frankly, I'm glad. This isn't a place I'd want to work anyway.", "Interview Questions": "What's your favorite thing about Brightspace?"}, {"date": "27 Sept 2021", "title": "Curriculum Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Purdue Global in Aug 2021", "Interview Descriptions": "A week after I applied I got an email from HR asking me to complete a pre-screen, which was answering a set of questions via email. I submit my responses, which was on a Wednesday, and the next day (Thursday) I get an email around 9:45pm from HR asking if I was available to interview the following day (Friday) at 9am. I was unavailable during that time (I also didn't like be given less than 24 hours notice) so I gave the HR rep my availability and asked if any of the other days/times would work. I didn't hear back from her so I followed up that following Monday and we got an interview scheduled for that Thursday. It was a virtual interview and I met with 3 people. The interview was different from others I've been on. 1 person would ask all their questions (maybe 5 questions), and then after they asked their questions would move on to the next person. The interviewers who weren't asking questions would turn their camera off, as if they weren't \"in the room\". Honestly, it didn't seem personable and kind of rude. At one point one of the interviewers lost connection and left the interview while I was answering a question (that she asked), and that really threw me off. The other two interviewers sat their silently with their cameras off, since it wasn't their set of questions, and we waited for the other interviewer to get back online . At the end of the interview when asked, \"Do you have any questions for us,\" 2/3 of the interviewers were nice (though one kept their camera off) and answered my questions. The other interviewer seemed like she had already made up her mind that I wasn't right for the position and was very short in her responses or just didn't answer at all. She was also the one who lost the connection, so maybe she was upset about that; but overall she came off pretty rude. I was told I'd hear back from HR about next steps, but it's been over a month since I interviewed and I haven't heard back. I'm assuming I didn't get the job, but that's fine because I've since accepted a much better job.", "Interview Questions": "Talk about a project where you used a project management cycle."}, {"date": "18 Jul 2021", "title": "Student Services Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Purdue Global", "Interview Descriptions": "Pretty straight forward.2-3 rounds of interview sessions. First met with HR for an interview, 2nd round was with the hiring manager.  Both intervewers were friendly and extended flexibility. My schedule was challenged so they worked with me in order to meet.", "Interview Questions": "Give an example of a time you made an achievement"}, {"date": "17 Jul 2021", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Purdue Global (Orlando, FL)", "Interview Descriptions": "Very short, quick and to the point. But you have to show that you are a master sales professional. They ask questions about how you would persuade someone to do something by giving them solutions to obstacles.", "Interview Questions": "How would you sell me this pen?"}, {"date": "19 May 2021", "title": "Online Adjunct Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Purdue Global (New York, NY)", "Interview Descriptions": "Video interview with three to four timed responses and three written questions. The second interview was with the Department Chair and the Ast Chair.  They asked four to five questions.", "Interview Questions": "Why did you apply to this job?\nWhat Skill do you have that would contribute to our organization?\nHow would you assist a student who was having trouble with the class content? "}, {"date": "16 Mar 2021", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Purdue Global", "Interview Descriptions": "Met with two managers to discuss my previous job experience and what those roles entailed. I was also asked behavioral questions to gain more knowledge on how I would handle different situations.", "Interview Questions": "Tell us about your previous work experience"}, {"date": "10 Mar 2021", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Purdue Global", "Interview Descriptions": "The first interview was strictly a question and answer session via computer, with no live people. Multiple choice answers and untimed, open-ended questions. The second interview was done via Google Chat with the Department Chair and Assistant Department Chair.", "Interview Questions": "How I planned to coordinate a full-time job with teaching online. "}, {"date": "13 Jan 2021", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Purdue Global", "Interview Descriptions": "Very simple and straight forward. Just be yourself, ask questions if necessary. Answer every question honestly and make eye contact with the recruiter. The process will be smooth if all directions are followed", "Interview Questions": "Tell me more about yourself"}], [{"date": "11 Jan 2021", "title": "Partnerships Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Purdue Global", "Interview Descriptions": "Human Resources reached out to set up the interview over the phone. Met with hiring manager  for the next round. Final round was meeting with the next level of leadership.", "Interview Questions": "Pretty status quo about background and past experiences."}, {"date": "6 Feb 2022", "title": "Vice President Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Purdue Global in Jan 2021", "Interview Descriptions": "Met with the university leadership virtually over a series of days in individual and group sessions to discuss my background as well as learn more about the position and the university's plans for future", "Interview Questions": "Reason for applying and information about my background"}, {"date": "21 Dec 2020", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Purdue Global", "Interview Descriptions": "The interview was a three step process, online filmed automated interview, written activities, live zoom call. Pretty fast and streamlined. Easy interview. Doesn't take much time. Don't hesitate to do it if invited.", "Interview Questions": "Why do you want to work here? "}, {"date": "22 Sept 2020", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Purdue Global (Fort Lauderdale, FL) in Jan 2020", "Interview Descriptions": "The interview process was easy and the management staff interviews you directly. You got a tour and  met some staff. It was a nice experience overall. I am just typing now to fill 30 words", "Interview Questions": "How to deal with time management?"}, {"date": "28 Mar 2022", "title": "Online Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Purdue Global in Nov 2019", "Interview Descriptions": "I had to make a video recording of myself answering questions that would appear on my computer screen. I had a time limit to answer each question. I could not start over/resubmit. It was very strange to interview in this way without facing or conversing with an actual person.", "Interview Questions": "I don't recall all of the questions, but one was about how I would handle a situation with a student who was being difficult or was not doing well. "}, {"date": "31 Oct 2019", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Purdue Global in Oct 2019", "Interview Descriptions": "Spoke with recruiter, was then moved onto the next step in the process.  Panel interview and another interview with HR.  They were very open about what to expect with the position.", "Interview Questions": "Role Play"}, {"date": "8 Feb 2021", "title": "Career Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Purdue Global (Miami, FL) in Jun 2019", "Interview Descriptions": "Behavioral-based questions. Applicant will be required to provide examples and scenarios relative to the position.  You will also be asked about your past experiences with handling difficult situations in working with students.", "Interview Questions": "Briefly Tell me about yourself? "}, {"date": "25 Apr 2019", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Purdue Global", "Interview Descriptions": "Make sure you know sales techniques, especially understand the features and benefits of any type of product.  They first call you to screen you and make sure you are the right candidate. They want to see you have done your research. Once selected you will meet with the managers and an HR person, they will all ask you questions.", "Interview Questions": "How did you handle a difficult situation in the past with a client?"}, {"date": "20 Nov 2018", "title": "Assistant Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Purdue Global in Nov 2018", "Interview Descriptions": "The interviewer was EXTREMELY unprofessional and over an hour late for our call. He rushed me through the interview and was very discombobulated. There needs to be more professionalism in the recruiting of this \"university\". Complete and utter waste of time. Corporate needs to look into the hiring practices of this place.", "Interview Questions": "Why did you leave your last job?"}, {"date": "21 Sept 2018", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Purdue Global (Fort Lauderdale, FL) in Sept 2018", "Interview Descriptions": "The interview process involved various steps such as an online questionnaire, Phone Interview, face to face interview with a panel of department  Management( Director and assistant-Director), followed by 3rd Phone Interview with the Team Manager ( Associate Director).", "Interview Questions": "What was your most memorable situation handling a difficult situation and how did you solve it?"}], [{"date": "1 Nov 2019", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Purdue Global (Fort Lauderdale, FL) in Jun 2018", "Interview Descriptions": "First was the phone interview with the representative from human resources,  a week later was invited for in person interview, it was 1:1 interview with Director of Admissions,", "Interview Questions": "imagine and describe what would you do in certain situation. "}, {"date": "10 Oct 2019", "title": "Student Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Purdue Global (Chicago, IL) in Apr 2018", "Interview Descriptions": "The interview process was pretty straightforward. I applied online and was contacted by HR for the screening interview. After that, I was invited to an interview with 3 people (managers) at the school (located in West Loop). The interview was straightforward as well; the interviewees made it pretty comfortable so it went smoothly. Then after a week (I believe), I was contacted by HR TA again and was given an offer.", "Interview Questions": "Tell Me About Yourself"}, {"date": "1 Nov 2018", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Purdue Global (Orlando, FL) in Apr 2017", "Interview Descriptions": "Very short, situation based questions with multiple managers. Applicants should expect to interview with the individual that will more likely over see their day to day work. The climate of the interview is profession, while the general office culture is not.", "Interview Questions": "Q: Describe a professional experience  where you were held to a strict metric system."}, {"date": "15 Oct 2020", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Purdue Global in Jun 2016", "Interview Descriptions": "Excellent.  I met with people who were talented and caring.  I felt they knew their jobs and what they were looking for.  They had many courses and opportunities available and were conveniently located.", "Interview Questions": "My expertise in Spanish necessary for the job"}]]