[[{"date": "18 Jan 2022", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Art Gallery of Ontario", "Interview Descriptions": "The interview process was standard and comfortable. Just went in during my time and answered some questions about my past work and volunteer experiences. No really tough things mentioned or asked. You need to work with people in previous experiences. Staff was friendly.", "Interview Questions": "What was your previous experience in role related to dealing with youth?"}, {"date": "3 Mar 2022", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Art Gallery of Ontario (Toronto, ON) in Jan 2022", "Interview Descriptions": "Pretty easy interview of mostly behavioural questions which was supposed to be followed by a written exercise (but got cancelled).\n\nInterview was not bad, but the interviewers were very dismissive and weren’t paying attention - all together I left the interview not excited to continue as it felt very representative of company culture. Their communication afterwards was not great either.", "Interview Questions": "Tells us about one of your favourite sponsorships"}, {"date": "28 Jan 2021", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Art Gallery of Ontario", "Interview Descriptions": "The interview process was fairly easy, all coordinated via a member of the HR team. They cancelled the position after one round of interviews but the hiring manager called to give me feedback anyway, which I appreciated.", "Interview Questions": "The interview consisted of a round of questions followed by a writing exercise, which was done independently in their offices. "}, {"date": "3 Mar 2019", "title": "Customer Service and Sales Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Art Gallery of Ontario", "Interview Descriptions": "HR sent me an email asking to come in for a group interview. There were about 10 other candidates there and it was an easy-going environment. My reference got called after the interview.", "Interview Questions": "What's your past retail experience?"}, {"date": "13 May 2019", "title": "Visitor Services Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Art Gallery of Ontario (Toronto, ON) in Mar 2019", "Interview Descriptions": "Very smoothly handled - easy process. The HR team was great and made sure everything was well prepared. However that did make the process go a bit more slowly", "Interview Questions": "Why are you interested in working here?"}, {"date": "20 Feb 2022", "title": "Design Studio Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Art Gallery of Ontario (Toronto, ON) in Mar 2018", "Interview Descriptions": "1-hour interview + portfolio review. Basic interview about the previous experience if applicable, followed by a portfolio review where we talked through a single project in detail. After the initial interview and portfolio review and offer will be made wishing the next month.", "Interview Questions": "What project did you enjoy the most in your studies?\r\nWhat do you expect to bring to the team?\r\nWhat are your expectations for this role?"}, {"date": "20 Dec 2017", "title": "Attendant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Art Gallery of Ontario (Toronto, ON) in Dec 2017", "Interview Descriptions": "group interview of approximately 20 people - presentation followed by a brief 1-on-1  'rapid-fire'question and answer period with one of the three staff leading the session. This was then followed by interaction with group members where we were given a scenario, had to discuss it with a partner and then present our handling of it to the group.", "Interview Questions": "Why the position appealed to you?\r\nHow would you deal with the public?"}, {"date": "29 Jul 2019", "title": "Front of House Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Art Gallery of Ontario (Toronto, ON) in Oct 2017", "Interview Descriptions": "A series of interview questions consisting of knowledge of the organization and behavioural questions. Two hiring managers then came in and took turns asking me questions. They then followed up with me to confirm I had the skills I listed on my resume.", "Interview Questions": "How would I deal with an angry patron"}, {"date": "18 May 2017", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Art Gallery of Ontario (Toronto, ON) in Sept 2016", "Interview Descriptions": "Email received for interview, First interview with three people one from HR and Two from relevant dept.  Received email from HR for offer. Given time to accept the offer. Received photo ID and other details. Police clearance taken and references are checked. Call for Job.", "Interview Questions": "1) Tell me about yourself\r\n2) What I know about the Job\r\n3) Why I choose to work at AGO\r\n4) Weaknesses and Strengths \r\n5) Took the excel test  "}, {"date": "15 Jun 2016", "title": "Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Art Gallery of Ontario (Toronto, ON)", "Interview Descriptions": "Relatively easy. Met with sous chef and front of the house manager. Nice people. I did not have to wait long to be seen by them.  We were in a room that was very quiet and they offered refreshments before we began. It was a very nice interview and if I could do it again I would. Did not need to do a cooking test. Just an extremely nice environment with nice people.", "Interview Questions": "Why did I apply for the position ?"}], [{"date": "5 Feb 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Art Gallery of Ontario (Toronto, ON) in Sept 2015", "Interview Descriptions": "Was made to feel very comfortable by the interviewer (two staff, on HR person). The questions that were asked were in a way that they wanted you to give real examples from your professional experience. There were mostly practical, skills based questions (focus your preparation on matching your experience with the job description), but some behavioural questions - primarily around dealing with conflict and how you deal with a situation when you disagree with the way things are being done.", "Interview Questions": "How would you deal with a situation when you don't feel like your expertise is being acknowledged?"}, {"date": "4 Jun 2017", "title": "Sales Associate/Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Art Gallery of Ontario (Toronto, ON) in Aug 2013", "Interview Descriptions": "It was a group interview, which can be difficult for introverts as we were expected to shout over each other to impress the interviewers. While that aspect was a little intimidating, the questions were quite easy. Anyone with retail experience would have been able to answer them sufficiently.", "Interview Questions": "What's one thing that's important to know as a sales associate?"}, {"date": "14 Mar 2013", "title": "Retail Sales Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Art Gallery of Ontario (Toronto, ON)", "Interview Descriptions": "The first part of the hiring process is trying to reach the H.R. person, who I am told never answers the phone. If you have an email address, use that. \r\n\r\nThis HR person will meet you in the gallery foyer. Don't expect a smile. I don't know if the lack of enthusiasm from the HR person is a sign of things to come.\r\n\r\nWear muted colours, as the actual interviewers seem to like black, white, and grey. \r\n\r\nQuestions you will be asked are the typical ones, such as give an example you've had an angry customer, what did you do? Give an example you gave outstanding service. But then also be prepared to answer questions you may expect to see in a college retail course, such as, \"What is the purpose of skew numbers and the importance of punching them in correctly?\" Or, \"What do you feel is the most important aspect of retail.\" \r\n\r\nInterview lasts around 15-30 min.\r\n\r\nPositions as a sales associate are generally part time/seasonal. Hours can range from 3-24 hrs a week. I asked how you would know which end of that spectrum you would get. It seemed like the way they decide who they want on the floor is based on who they like the best. \r\n\r\nGood Luck!", "Interview Questions": "What is the most important aspect of retail? "}]]