[[{"date": "8 May 2023", "title": "Admissions Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Post University", "Interview Descriptions": "Great and attentive interview process! The two individuals I interviewed with asked intentional questions and were kind to speak with. I did select another role due to salary, but loved my experience interviewing at Post.", "Interview Questions": "Describe one strength and one weakness."}, {"date": "30 Apr 2023", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Post University (Waterbury, CT) in Mar 2023", "Interview Descriptions": "I applied for this position in January 2023 and I was informed that they decided to go with another candidate. A few months later I was contacted to see if I was still interested in the position. I scheduled a phone interview which was pretty standard. I was told that I would be contacted for a second interview which would be virtual face-to-face interview. The second interview asked questions related to past positions in sales, leadership, and accountability.", "Interview Questions": "What previous work experience would make you best suited for this position?"}, {"date": "21 Dec 2022", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at Post University", "Interview Descriptions": "Technical interview - interview lasted an hour. Questions asked were techinical questions. Interview was a panel interview. The interview consisted of two interviews, including senior executives. Very laid back interview process.", "Interview Questions": "not applicable. questions pertained to technical applicaitons."}, {"date": "22 Nov 2022", "title": "Instructional Design and Reference Librarian Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Post University (New Haven, CT) in Sept 2022", "Interview Descriptions": "Interviewed twice for the position. Staff was friendly, interview was structured well. Unfortunately, the offered an abysmal salary - insulting even. It was the lowest 10% of salaries offered for the position. I would have accepted the position if they intended on paying me what I was worth.", "Interview Questions": "Tell us about a time where you experienced adversity in the workplace and tell us a bit about how you overcame it."}, {"date": "15 Aug 2022", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Post University", "Interview Descriptions": "Very pleasant employee, shared job description with great detail. The only thing is they expected a lot of work for less than normal salary. From the interview it seems like you will be over worked and not fairly compensated.", "Interview Questions": "How would you handle a student wanting to defer acceptance?"}, {"date": "7 Jun 2022", "title": "Remote Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at Post University in May 2022", "Interview Descriptions": "30 Minutes long a lot of open ended questions. Sales oriented questions. I interviewed with 3 different people. But I was offered the job not long after. Training lasts for 5 weeks. It is a remote position and they come to your home to set up the equipment.", "Interview Questions": "Think of a time where you had to make an uncomfortable decision "}, {"date": "11 May 2022", "title": "Admissions Advisor ADP Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Post University (North Las Vegas, NV) in May 2022", "Interview Descriptions": "I submitted an application on April 15th. I had a phone interview around May 6th. There wasn't any plan for the phone interview. They called me and I happened to answer the phone. The interview was pretty neutral. I liked the person that was interviewing me. The only downside was the fact that the interview process took a long time and if I wasn't going to be hired at the end I wonder, \"What was the whole point of doing even a phone interview?\" I don't know. It (being the interview) seemed unnecessary and a waste of time.", "Interview Questions": "What do you know about Post University?"}, {"date": "12 Mar 2022", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Post University in Mar 2022", "Interview Descriptions": "Lengthy phone interview. Very transparent that it is mostly a sales position and lengthy training process. Next, was a 1:1 with Senior Admissions Advisor. More sales talk. Pay is low for the amount of work and responsibility.", "Interview Questions": "Do you have any sales experience?"}, {"date": "15 Mar 2022", "title": "Financial Aid Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Post University in Feb 2022", "Interview Descriptions": "Started with a phone interview where I was basically told I was not qualified but was going to send me to the next process anyway. Told me I had to be \"super exciting\" to attract the team. I had the interview which went great, but then was completely ghosted for over a month. I had to email many times to get any sort of answer, most of which I was ignored. Finally, I called HR and received a call the next day saying they were still looking at candidates. Fast forward another two weeks and still nothing. Had to reach out AGAIN to get a call, where the woman basically told me she forgot to reach out to me earlier letting me know that they moved forward with other candidates. The whole experience was so beyond unprofessional.  If you work in HR it is your JOB to follow up, you don't just \"forget\". As a student myself, I do not recommend going through this nightmare. If this is how they treat potential employees, I can't imagine students.", "Interview Questions": "Describe yourself, a difficult situation"}, {"date": "27 Jan 2022", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Post University in Jan 2022", "Interview Descriptions": "Long phone interview. Followed by video interview. Asking about sales experience. Your goals, if you reach goals, how you execute goals. They tell you about the posistuon ask how much you’d like to be paid. Tell you about poat", "Interview Questions": "Tell me about a time you reached a goal? "}], [{"date": "15 Nov 2021", "title": "Military Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Post University", "Interview Descriptions": "overall okay, informative, direct and courteous. Did ask some scenario questions, and had to be quick on your feet. Payscale seems a little a low for the responsibilities of the position", "Interview Questions": "why do you want position"}, {"date": "28 Oct 2021", "title": "Academic Success Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Post University", "Interview Descriptions": "The interview was easy but I was interviewed with over seven people. Please let interviewees know if a lot of people will be in the interview so they can prepare.", "Interview Questions": "Heavy emphasis on customer service"}, {"date": "14 Mar 2023", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Post University in Jul 2021", "Interview Descriptions": "Professional meetings with each of the three individuals for three different encounters beginning with HR. The challenge was a long wait after job offer and actual start date with little communication of engagement. Outreach to confirm job offer still existed. Once reconnected, all was well and transition was good.", "Interview Questions": "Customer service skills over the years"}, {"date": "6 Mar 2021", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Post University (New Haven, CT) in Feb 2021", "Interview Descriptions": "Smooth, efficient, transparent.  I was told what I could expect and I didn't have to wait long to hear back on their decision.  Everyone I met was very friendly and informative and the process was great.", "Interview Questions": "How do you handle rejection?"}, {"date": "22 Jul 2021", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Post University (Waterbury, CT) in Mar 2020", "Interview Descriptions": "Completed online application, was followed up with phone interview a week later and then a 2:1 Video Interview a couple days after. Called by the Assistant Director of Admissions next day for job offer", "Interview Questions": "What precious work experience would make you best suited for this position?"}, {"date": "15 Nov 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Post University (Waterbury, CT) in Mar 2020", "Interview Descriptions": "This was a panel interview with three people that lasted about half an hour. Then I was either accepted or denied my position or given an alternate position. They asked many situational questions and character questions.", "Interview Questions": "What would you do if your friends were in a room that was getting in trouble?"}, {"date": "4 Jul 2022", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Post University in Feb 2020", "Interview Descriptions": "Easy interview process, very personalized.  Allowed for a lot of room to share experience and customize the interview to highlight personal strengths. They look to see if you know how to overcome objections.", "Interview Questions": "How do you overcome the hurdle of someone saying they’re not sure if they want to go back to school? "}, {"date": "17 Jan 2023", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Post University (Middlebury, CT) in Jun 2019", "Interview Descriptions": "interview was over the phone and second interview was in person. easy interview. this was a few years ago, interviews are probably done by video chat now. interview was basic, no questions were different than any other interview i had before. similar to a retail job interview.", "Interview Questions": "strengths and weaknesses. how to deal with unruly customers."}, {"date": "18 Mar 2019", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Post University in Mar 2019", "Interview Descriptions": "Had a phone interview but did not get any further in the hiring process. The human resource person was very nice. She answered my questions about the position. They let me know about a week later that I wasn't chosen for the in person interview.", "Interview Questions": "Tell me why you want to work here."}, {"date": "2 Nov 2022", "title": "Advising Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Post University (Waterbury, CT) in Dec 2018", "Interview Descriptions": "Apply, Interview, Offer. No second interview. Overall not a complex process, and easy to understand. HR also does a good job of making the process understandable and easy. 1. Tell me about yourself? 2. Why do you want to work for us? 3. What are your strengths? 4. What’s your biggest weakness? 5. Where do you see yourself in 5 years’ time? 6. Why do you want to leave your current job? 7. When have you delivered excellent customer service? 8. What would you do if you didn’t get on with someone in your team? 9. How do you handle pressure? 10. Why should we hire you?", "Interview Questions": "1. Tell me about yourself? 2. Why do you want to work for us? 3. What are your strengths? 4. What’s your biggest weakness? 5. Where do you see yourself in 5 years’ time? 6. Why do you want to leave your current job? 7. When have you delivered excellent customer service? 8. What would you do if you didn’t get on with someone in your team? 9. How do you handle pressure? 10. Why should we hire you? 11. When have you worked as part of a team? 12. What didn't you like about your last job? 13. What three things would your last boss say about you? 14. What are your salary expectations? 15. Can you give me an example of a difficult situation you faced in a previous job and how you dealt with it? 16. Explain the gaps in your employment history? 17. What’s your greatest achievement to date? 18. What would you do in the first 30 days of starting? 19. When have you had a disagreement with your manager? 20. What motivates you? 21. Do you have any questions?"}], [{"date": "25 Sept 2018", "title": "Academic Success Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Post University", "Interview Descriptions": "Quick, efficient interview process. A phone interview was followed by an in person panel interview with various team leaders and department members. A Question and answer session with Deptarent Director immediately after panel interview.", "Interview Questions": "Give me an example of a time when you had to follow protocols even if you didn’t agree with them? "}, {"date": "6 Feb 2018", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Post University (Waterbury, CT) in Nov 2016", "Interview Descriptions": "I have been working for Post University for over a year now and I have never felt more at home! When I first applied they called me for an interview and then I was interviewed by an Assistant Director in Admissions. When you work for Post - You are joining a team! A family! They go above and beyond to make each employee feel comfortable and they train their employees very well! Have you ever wanted a career in which you wake up every morning excited to go to work? A place that is full of fun, loving and caring co-workers that become great friends? Post is that place!", "Interview Questions": "To be honest, I do not remember the questions. "}, {"date": "12 May 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Post University", "Interview Descriptions": "There was an initial phone screening followed by an interview in the offices of the Online Education Institute. The questions were guided toward past related experiences and how they related to the Admissions Counselor position.", "Interview Questions": "What are some of your strengths?"}, {"date": "19 Apr 2016", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Post University (Waterbury, CT) in Jun 2015", "Interview Descriptions": "The interview itself was quick and easy -- I just talked about my research, and they were like cool, you're on board. Everything else was slow, confusing, and frustrating. The amount of paperwork they required was extensive; I had to pay to have transcripts sent even from institutions I attended over 10 years ago. The worst, however, was a week-long online training that was tedious, patronizing, and at times disquieting (it seemed like they were trying to figure out how to get as much out of instructors as possible without paying them any additional income). It was just hoop after hoop, and then with days until the semester started, they came back to me and said they did not actually have anything for me to teach. They have contacted me a couple of times since then, but I basically said \"thanks but no thanks.\" It was a weird experience -- they technically did hire me/offer me a position, but when it actually came down to it, there wasn't an actual position. I just had done all this training and paperwork for no real reason.", "Interview Questions": "Tell us about your experience working with non-traditional students and/or students from diverse backgrounds."}, {"date": "14 Apr 2015", "title": "Tuition Planner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Post University", "Interview Descriptions": "Extremely friendly process. Was called directly from HR after submitting resume online. Talked mostly about resume and experience. Was interviewed by both Director of financial aid as well as the assistant director. After first interview was given offer by HR department about two week later.", "Interview Questions": "Why do you want to work here ?"}, {"date": "27 Jul 2015", "title": "Adjunct Faculty Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Post University (Middletown, CT) in Feb 2015", "Interview Descriptions": "Sent resume; talked to faculty director on phone. Interviewed on phone. Easy interview. She was very nice and professional. She ran a good department. Found the classes that I'd be teaching to be agreeable as well. Offered job, but declined based on the unpaid traininng involved.", "Interview Questions": "What is your educational philosophy?"}, {"date": "2 Jun 2014", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Post University", "Interview Descriptions": "casual conversation with a few resume questions. They look for teachers that have experience with minorities. Had a brief phone conversation and then a group interview. It was very casual and quite easy.", "Interview Questions": "Why drew you to higher education?"}, {"date": "14 May 2014", "title": "Admissions Counselor OEI Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Post University (Middlebury, CT)", "Interview Descriptions": "I applied online and 1 week later received a phone call from HR. The HR conducted a phone interview in which she asked 5 questions about my resume, past experiences, and why would I want to work at an Online University rather than a real one. Was also asked salary range but was informed it's capped at $35000. I then got setup for an in person interview that week. I met with this lady with a spray tan and another with a ponytail so tight I could read her mind. They kept emphasizing this is more of a sales job but that there are no quotas...They also asked how competitive I am, though I don't see how trying to help students get an education is a competitive sport. Lastly, they asked about my personal life and explained it's because there are cliques and groups in the department and they want to know which social circle they would stick me in.", "Interview Questions": "N/A"}, {"date": "4 Feb 2018", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Post University (Waterbury, CT) in Feb 2014", "Interview Descriptions": "Direct and to the point, with one exception.  They will tell you that they do not have sales goals - that is because by law, the educational industry is forbidden to define what they do as \"sales\" - HOWEVER, they do have an expectation as far as how many students you bring in.\r\n\r\nThat aside, the interview was direct, polite, and personable, asking relevant questions about your experience and expectations.", "Interview Questions": "How important do you consider higher education?"}, {"date": "2 Oct 2013", "title": "Business Management Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Post University (West Palm Beach, FL)", "Interview Descriptions": "hoping to get an IT degree in business management and currently getting a degree in business management but hope to change that for an IT, or CIS degree depending on what the school offers in its classes.", "Interview Questions": "payment of bills do to lack of funs for classes."}], [{"date": "16 Feb 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Post University (Waterbury, CT) in Aug 2013", "Interview Descriptions": "They brought me in through a temp agency and interviewed me. I arrived there and 3 people interviewed me in the conference room. They had my typing information and quizzes I took at the temp agency and my resume.", "Interview Questions": "What I knew about the company. "}, {"date": "20 Jun 2013", "title": "Student Accounts Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Post University (Waterbury, CT)", "Interview Descriptions": "Interview with the director and assistant director of the students accounts department. Just be professional, honest, and have a can do attitude with a decent resume and you should be in good shape.", "Interview Questions": "How are you with handling other peoples finances? "}, {"date": "24 Jun 2016", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Post University (Waterbury, CT) in Jun 2013", "Interview Descriptions": "Brief phone interview and then in person interview with HR and 2 managers.  Not an overly welcoming environment when interviewing.  Standard inside sales type questions were asked with a couple tough ones thrown in.  I answered them thoroughly and with a lot of thought, but did not get an offer.  They did also mention that the position requires at least 100 outbound phone calls per day.  Sounded to me like more of a high pressure sales job than admissions.", "Interview Questions": "What would I do to change someone's mind about enrolling."}, {"date": "27 May 2014", "title": "Residence Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Post University (Waterbury, CT) in Jul 2012", "Interview Descriptions": "The interview was casual and low-key.  The Dean of Students was friendly and easy to interact with.  She was communicative, but the waiting process was a little drawn out and longer than expected, leading to anxiety.", "Interview Questions": "What will you find most challenging about being a residence director?"}, {"date": "22 May 2012", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Post University (Waterbury, CT) in Mar 2012", "Interview Descriptions": "I went through a staffing agency, they placed me and I got an interview that week. Two hours after my interview they gave my staffing agency an offer who told me if I would like I could start in two weeks. Overall it was a very simple hiring process. Simpler if you go direct through Post's HR and not a staffing agency.", "Interview Questions": "Why do you want the job?"}, {"date": "24 Apr 2012", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Post University (Waterbury, CT) in Jan 2012", "Interview Descriptions": "Contacted via email regarding unexpected opening - wanted to know my availability.  I was.  Both interviewers were the \"management team\" I would be working for.  Lots of talk about we don't spoonfeed our kids but they need lots of special attention.  They were both friendly enough and asked on point questions related to teaching style, integration within their system.\r\n\r\nAdvice: Just be yourself", "Interview Questions": "How would you adjust your teaching to our students who don't read the books?"}, {"date": "24 Nov 2015", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Post University in Jun 2011", "Interview Descriptions": "I had a phone interview then came in to the office. I met with different people in the department. It was a very long interview and lasted about 3 hours. It was more of a conversation than asking direct interview questions. It was not very organized. HR didn't know I was being interviewed and were not prepared to hire me. I was offered the job on the spot.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "27 Mar 2013", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Post University (Waterbury, CT) in Jun 2011", "Interview Descriptions": "The interview process for me was very laid back.  I was contacted just a few days after submitting my application.  I spoke with the HR rep for a few weeks via phone before I could make it to campus.  Once I arrived, I interviewed with one of the Assistant Directors.  We talked about hobbies, my career goals, and a little bit about the culture of school.  My second interview was a bit more formal with some harder work-related questions.  From the moment I walked in each time, I saw smiles on faces and everyone said hello.  It seemed like a buzzing environment.", "Interview Questions": "Why should I hire you?"}, {"date": "18 Feb 2014", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Post University in Jan 2011", "Interview Descriptions": "Interviewed with the head of the department which I was qualified to teach for. Was an excellent process. Asked me to go through all my experiences, and what made me think I was the right fit for the position.", "Interview Questions": "Most difficult question, what I thought I could bring to the University."}, {"date": "24 Jul 2010", "title": "Teaching Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Post University (Waterbury, CT) in Jun 2009", "Interview Descriptions": "I floated my resume to several universities in the area.  I was called in to present a teaching demonstration for a panel of teachers and students.  I was called that same day to confirm my appointment as an adjunct.  The staff was very friendly and accommodating.", "Interview Questions": "No questions, just a presentation, but they included a panel of students and a very specific criteria for rating that I did not see beforehand."}]]