[[{"date": "9 Apr 2023", "title": "PCFA Operations Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at IMD - International Institute for Management Development (Lausanne)", "Interview Descriptions": "I had 2 interviews, one with HR and one with line manager. The interview was easy, they asked very general questions. I got the job but declined / low salary offer", "Interview Questions": "How do you organise yourself"}, {"date": "14 Apr 2023", "title": "MBA Recruitment and Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at IMD - International Institute for Management Development in Apr 2023", "Interview Descriptions": "After applying online, I was contacted to participate in a 30-minute Zoom interview. During the interview, I was surprised to find that there were 3 interviewers. This was my first direct interaction with the company, and I felt that it was unusual to interview with so many people right off the bat. The questions asked were straightforward and informal, but the interview went on for too long, leaving me with little time to ask my own questions on the role and the team. However, the biggest disappointment for me was receiving a generic rejection email (i.e., a very automatic/standard one) with no opportunity to respond and seek feedback. Given that I not only applied online and considering that only few people were shortlisted, I was hoping for a more personalized response. As a result, my overall candidate experience was unsatisfactory.", "Interview Questions": "Tell me about yourself? Why would you like to join IMD? What kind of programs do we offer? How would you convince me to apply to our programs (i.e., case-scenario)? Can you tell me about a difficult situation? What are your strengths and a weaknesses? And why? How do you cope with stress? Can you give a practical example? How have you solved a difficult situation? Why would you be suitable for the position? What is something that caught your attention of IMD?"}, {"date": "16 Nov 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at IMD - International Institute for Management Development", "Interview Descriptions": "There were general questions about my years of experience, research skills, and publications. I also submitted a writing test on a teaching case. I had two rounds of interviews with several managers and faculty.", "Interview Questions": "What are your research strengths and interests."}, {"date": "23 Nov 2020", "title": "MBA Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at IMD - International Institute for Management Development", "Interview Descriptions": "Fair, on-site and fully verbal, lasting 1.5 hours in total and with 3 different people, on average 20 30 mins each targeting different areas about your past experience and current aspirations.", "Interview Questions": "All sort of questions about your background, motivations"}, {"date": "15 Dec 2020", "title": "Career Development Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at IMD - International Institute for Management Development (Lausanne) in Nov 2020", "Interview Descriptions": "Entretien avec la RH suivi d'un entretien avec 2 directrices.\r\nLes questions  étaient claires et précises.\r\nPredictive index test en ligne.\r\nProcessus très bien organisé.\r\nRéponse par email après une semaine.", "Interview Questions": "Pourquoi ce poste m'intéresse?\r\nMes expériences précédentes"}, {"date": "25 Jan 2023", "title": "Marketing Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at IMD - International Institute for Management Development (Lausanne) in Feb 2020", "Interview Descriptions": "It was a traditional process with phone and in-person interviews. The questions were standard and very general. Not much was asked about the company. I liked the people I met. Interviews between 30 and 60 minutes", "Interview Questions": "Strength and weaknesses challenging situation and how dealt with"}, {"date": "27 Aug 2019", "title": "Legal Counsel Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at IMD - International Institute for Management Development (Lausanne) in Jun 2019", "Interview Descriptions": "I have been contacted by an agency and I had a first discussion with the recruiter. After that, I had an interview with a HR representative and the future manager. It was also planned to have a second round.", "Interview Questions": "How do you manage conflicting situations with professors?"}, {"date": "30 May 2023", "title": "Content Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IMD - International Institute for Management Development (Lausanne) in Apr 2019", "Interview Descriptions": "It was a long time ago and it was fine. I no longer work there and neither does the interviewer. It was very nice. The team was great but none of them are there any longer.", "Interview Questions": "What is your previous experience?"}, {"date": "15 Nov 2018", "title": "PC&FA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at IMD - International Institute for Management Development (Lausanne) in Apr 2018", "Interview Descriptions": "First Cover letter was sent then was asked to come in for 3 interviews: one with HR, one with our Head of Operations and one with two team members that have had a lot of experience in the role. They were all very nice, easy to talk to, comfortable environment. Just talking about past experiences in event management, challenges you've faced, how you solved a problem, how you work with different cultures etc. After I left and they said they would contact me should I get the job, I got the reply within 1 week.", "Interview Questions": "What is the biggest challenge you've had to face? How did you solve it?"}, {"date": "4 Jan 2018", "title": "IT Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at IMD - International Institute for Management Development (Lausanne) in Dec 2013", "Interview Descriptions": "Friendly and professional with plenty of opportunities to ask questions and meet with the staff. Two rounds of interviews and verification of references. The process was very simple and speedy, I guess having some internal references would have made it even faster.", "Interview Questions": "They asked about my experience working in a multicultural environment and how do I feel when dealing with cultural differences in the world of business."}], [{"date": "25 Jul 2016", "title": "Program Coordinator and Faculty Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at IMD - International Institute for Management Development (Lausanne) in Jul 2012", "Interview Descriptions": "First with HR on the phone, second with HR in person, third with the head of department, finally with two colleagues within the department. Both in English and French.", "Interview Questions": "Resistant to stress, how do I react in X situation"}]]