[[{"date": "22 Aug 2022", "title": "Healthcare Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Joe's", "Interview Descriptions": "The interview was so very awesomely pleasant. I just loved this process so much. I’m so glad I chose to do it. Best interview ever. It was very easy and a great interview", "Interview Questions": "Who are you’re parents the most like?"}, {"date": "4 Oct 2021", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Joe's", "Interview Descriptions": "Before the interview, there was one phone call. Then, the interview was at the hospital and conducted by three people. The manager and two therapists were the interviewers. The questions asked were regarding scenarios as well as the typical \"tell me about yourself\" questions.", "Interview Questions": "One thing they asked was a question about good qualities in a team, and why a team might not be functioning well. "}, {"date": "7 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Joe's", "Interview Descriptions": "Mostly talked about job description. Some about salary, and a few basic questions.  Extremely laid back and simple but make sure you are prepared with questions of your own! Good luck and make sure you dress to impress and arrive early", "Interview Questions": "What is your biggest weakness?"}, {"date": "1 Sept 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at St. Joe's (Livonia, MI) in Aug 2020", "Interview Descriptions": "I spoke with the nurse manager over the phone and he gave me specific directions on which floor and unit I was being interviewed on. All workers were very friendly. I was interviewed by both the nurse manager and the charge nurse. Words cant explain how comfortable they made me because normally interviews are very nerve-wrecking but the process was absolutely outstanding!", "Interview Questions": "Why do you want to be a patient care technician?"}, {"date": "29 May 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at St. Joe's (Pontiac, MI) in May 2018", "Interview Descriptions": "The interview was quick and easy . It was a group style interview with the unit nurse manager and all the other RN's on the floor . They were really nice asked a lot of question about my experience and where I wanted to go career wise.", "Interview Questions": "Why you wanted to work at St Joe ? "}, {"date": "9 May 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at St. Joe's (Detroit, MI) in Feb 2018", "Interview Descriptions": "It was short and sweet. Interviewed by about six people. It was not super stressful. Handled it fine. Was offered the position afterwards.  Casual attire. Friendly atmosphere.  Lasted about 20 mins.", "Interview Questions": "Tell me about yourself "}, {"date": "22 Jun 2019", "title": "Teleme Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Joe's (Livonia, MI) in Sept 2017", "Interview Descriptions": "Just like any other application process.  Had to apply to the position online.  A written telemetry test was administered where you have to identify the common rhythms with rates (A.Fib, Sinus Rhythm, Sinus Tach, V.fib, V.tach, asystole....PACs, PVCs)", "Interview Questions": "What would you do in the situation where a nurse needs to be notified about a change in patient status and you cannot get a hold of the nurse. "}, {"date": "2 Oct 2016", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at St. Joe's", "Interview Descriptions": "Brief phone interview with hiring manager to discuss the position and my background. Face to face interview with manager and someone from the department. Basic hr questions asked. More detailed info about the job discussed. To see if I was a good fit for where things were at in the department and if this was something I was interested in.", "Interview Questions": "Explain three of your strengths. And three of your weaknesses."}, {"date": "23 Jan 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Joe's (Pontiac, MI) in Oct 2016", "Interview Descriptions": "Applied online, called back by HR within 2 days. Submitted online reference form that emails 5 references to fill out a form, called by nursing manager on floor, live interview, hired.", "Interview Questions": "Name a time when you had a difficult patient and what did you do"}, {"date": "15 Jan 2017", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Joe's (Bloomfield Hills, MI) in Mar 2016", "Interview Descriptions": "My interview was pretty standard. After asking my permission, my interviewer asked me a few person questions. I was also asked a series of technical questions and asked how I would respond in certain situations. Overall, the feel was fairly relaxed. I was offered the position on site and contacted by an HR representative within a day or two.", "Interview Questions": "Give some examples of how your are empathetic. "}], [{"date": "17 Nov 2019", "title": "Nutrition Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Joe's (Grand Rapids, MI) in Mar 2015", "Interview Descriptions": "Phone interview and in person interview. Just asked basic behavioral questions and past experiences. Overall a pretty basic interview process for an entry level food service position. They seem to hire most people as long as their schedule fits with their current needs.", "Interview Questions": "What is a strength/ weakness?"}, {"date": "13 Jul 2015", "title": "Cardiac Monitor Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at St. Joe's (Grand Rapids, MI) in Sept 2014", "Interview Descriptions": "One phone interview and one face to face interview. Phone interview took about an hr, and the face to face interview took about 45 minutes, asked normal interview questions. Once interview was over I was shown around the facility.", "Interview Questions": "Why I was interested in the job?"}, {"date": "23 May 2014", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at St. Joe's (Pontiac, MI) in Sept 2012", "Interview Descriptions": "Participated in combined management and peer therapist group interview.  Was a great opportunity to meet potential fellow co-workers and exchange information to determine whether both sides feel there is a good fit!  Was alittle intimidating at first, but they quickly make you feel at ease.  The position was contingent upon drug and background check which I liked, because it tells me that they have high standards and expectations of conduct with their employees.", "Interview Questions": "As a new therapist, what do you feel you can offer patients and fellow therapists?"}]]