[[{"date": "13 Jun 2022", "title": "Emergency Medicine Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Monument Health", "Interview Descriptions": "I thought the interviewer I spoke with was very friendly and positive. I felt they genuinely wanted to get a feel for if applicants would be a good culture fit. Great interactions with all staff and interviewers.", "Interview Questions": "Tell us about yourself and your background"}, {"date": "14 Oct 2021", "title": "Clinical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Monument Health in Oct 2021", "Interview Descriptions": "It was a very smooth and easy going. I met with a nurse and another employee as they described the job requirements and asked me about myself. I was given scenarios and job related questions.", "Interview Questions": "How do you handle a fast paced setting, and how do you multitask?"}, {"date": "17 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Monument Health (Rapid City, SD) in Mar 2021", "Interview Descriptions": "Group interview with 3 supervisors/managers. Informed all about hospital, their mission, CEO, and about their cardiovascular unit. After talking was given a tour of the potential new unit of employment.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "1 Jan 2022", "title": "IT Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Monument Health (Rapid City, SD) in Feb 2021", "Interview Descriptions": "He asked me questions and explained the job position. He reassured me that I have the opportunity the success after failure. He took the time to understand my unique situation.", "Interview Questions": " Are you able to work as a team?"}, {"date": "19 Nov 2019", "title": "Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Monument Health (Rapid City, SD)", "Interview Descriptions": "I was interviewed by both supervisors. They made me feel relaxed, and the interview was short and sweet. Basic interview questions were asked. Practicing popular interview questions online should prepare you enough.", "Interview Questions": "What would you do if you were having a problem with a co-worker?"}, {"date": "27 Sept 2019", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Monument Health (Rapid City, SD) in Sept 2019", "Interview Descriptions": "The interview was very easy going. I was nervous being a new grad but the process was awesome. They asked very good questions that definitely made me use select wording according to the question to be honest yet show my worth.", "Interview Questions": "Tell me about your experience"}, {"date": "29 May 2019", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Monument Health", "Interview Descriptions": "Phone screen, in person interview.  They asked many behavioral-based interview questions which seemed to repeat themselves or were similar in nature.  It sounded like they had some issues in the past with inter-personal conflicts among co-workers.", "Interview Questions": "Why do you want to work here?"}, {"date": "20 Jan 2018", "title": "IT Helpdesk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Monument Health (Rapid City, SD)", "Interview Descriptions": "I was called and then did 2 part interview. First one was with a couple of people, second one two weeks later was with 3 different people asking the same questions.", "Interview Questions": "How can you find an IP address on a PC?"}, {"date": "8 May 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Monument Health (Rapid City, SD) in Mar 2016", "Interview Descriptions": "The department called to set up an interview. The interview was comfortable and easy to talk with the departments director and also the department supervisor. This process was very simple everyone made it feel as though you were already part of their team. Made the process that much easier. The process was great.", "Interview Questions": "Why do you want to work for RCRH?\r\nWhy do you feel you are an asset to RCRH?"}, {"date": "17 Feb 2016", "title": "Marketing Communications Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Monument Health in Jan 2016", "Interview Descriptions": "Regional Healths' process was not unlike other interview and application processes. It starts with an HR recruiter conversation, then HR hiring manager, then in this case on to an interview with the interim VP of Marketing. After a round with each individual, the time it took to get a response on a next step grew increasingly. The last interview, which felt unapologetically like a, \"lets throw 'er a bone\" type of group interview came and went with little to no response from the HR representative. It took a variety of emails for them to even acknowledge that the last of 4 fairly intelligent interviews even took place. Its clear that the organization is currently undergoing a great amount of change and that can always cause a certain amount of chaos. However, it looks bad from an outsiders perspective if you string along a candidate due to internal turmoil, lack of organization, or rather for any reason. I'm sure they will eventually transition to this new identity but I can't say they won't tarnish their brand even more along the way.", "Interview Questions": "What are your best attributes, and why would they help in this role?"}], [{"date": "13 Nov 2015", "title": "Environmental Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Monument Health (Rapid City, SD) in Aug 2015", "Interview Descriptions": "Fill out an application online. Get called for an interview. Run over here for a drug test, run over here for a blood test. Youre supposed to get vaccinations (including flu shot) when hired but they ignored that for me even though i brought it up several times.", "Interview Questions": "Are you okay working with hazardous waste?"}, {"date": "11 May 2015", "title": "Front Office/Receptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at Monument Health (Rapid City, SD) in Apr 2015", "Interview Descriptions": "At the interview I was asked about my ambitions and experiences. The I was told what the job detailed. I had opportunity to ask questions several times through the interview. I was told they do hire people with some experience and some with little to no experience. Interview went well but I assume that  I did not answer questions as they had expected to hear. I did not receive a call back or the job offer.  I have tried staying in touch with Human Resources, but they tell me there is no shadowing available to get more experience than I have.", "Interview Questions": "How I would handle others that were not doing their part of the job"}, {"date": "11 Feb 2019", "title": "EVP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Monument Health (Spearfish, SD) in Mar 2015", "Interview Descriptions": "Timely and professional asked questions in a none robotic manner also allowed and encouraged interview from the applicant.  Gave clear expectations of position and pay.  Follow up and timeframes clearly laid out and followed", "Interview Questions": "How long of a waiting period"}, {"date": "21 Dec 2015", "title": "New Grad Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Monument Health (Rapid City, SD) in Aug 2014", "Interview Descriptions": "The hiring process was very straightforward - HR called to set up an interview and give me details of location/time. I met the director of the unit I was applying for in the lobby and went to her office for the interview. After questions I met the other nurse managers and some of the staff on the floor, and received a tour of the unit and an overview of floor routines/processes. Gave me a wonderful idea of what working there would be like! Received an offer shortly thereafter and dealt with HR for drug testing/orientation set up, etc.", "Interview Questions": "What do you do in your spare time?"}, {"date": "5 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Monument Health (Rapid City, SD) in Nov 2013", "Interview Descriptions": "There was a phone interview for about an hour. Easy communication with hr and manager. The director was easy going and passionate about the unit. The offer was made the same day of the interview. They were also accommodating with the start date. Relocation was also reimbursed.", "Interview Questions": "Tell me about yourself"}, {"date": "24 May 2016", "title": "Desktop Support Services Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Monument Health (Rapid City, SD) in May 2013", "Interview Descriptions": "One hour interview consisting of pre-made questions with a manager and a few of the other techs. No HR was present. On a side note, the times for the initial interview were miscommunicated to me, but I was able to reschedule the interview. They value planning, and technical knowledge. If you had a good attitude, you weren't cynical (as many IT personnel are), and you could prove knowledge, then you should be fine.", "Interview Questions": "Explain what DNS is?"}, {"date": "20 May 2016", "title": "Exercise Physiologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Monument Health (Rapid City, SD) in Aug 2012", "Interview Descriptions": "Interview consisted of 3 current employees: department coordinator and 2 other exercise physiologist. Upon submission of an application a brief phone interview followed by on site interview. Consisted of questions and tour of facility.", "Interview Questions": "What makes you want to work in this field?"}, {"date": "13 May 2013", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Monument Health (Rapid City, SD) in Apr 2012", "Interview Descriptions": "Easy hiring process; I applied, interviewed, and get a phone call within a couple days saying they would like to offer me a job.", "Interview Questions": "What is your worst quality as an employee?"}, {"date": "8 Jun 2015", "title": "Front Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Monument Health (Custer, SD) in Nov 2011", "Interview Descriptions": "Typical interview process. Phone call asking me to come in. The supervisor and HR rep were in a room with me. They asked about my experience, we talked about my prior work history, and was offered a job on the spot.", "Interview Questions": "Why do you feel you would be good in this position?"}]]