[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Good place to work for an important cause", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Jul 2023", "job_title": "Anonymous Employee in Birmingham, England", "duration": "N/A", "pros": "Flexible working hours with mostly remote/home work which helps a great work life balance, friendly and positive colleagues all working towards a shared goal.", "cons": "Honestly few and far between, the only issue I had was inheriting bad, expensive and lengthy contracts for services that were incredibly difficult to get out of from predecessors."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Disappointing", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "15 May 2023", "job_title": "Anonymous Employee in Birmingham, England", "duration": "N/A", "pros": "Working with a team of people sharing a collective vision. Cycle to work scheme.", "cons": "This is somewhere where well meaning, like-minded individuals will apply in order to work to further a cause they believe in, however the reality is disappointing. Senior leadership didn’t feel supportive and opportunities to progress were minimal. Lots of talk within the society of bullying, micromanagement, lack of mental health support and discriminatory comments. EDI strategy felt like it could be worked on. Please Google to find out more about the investigation regarding racism allegations against their board of trustees. If you are the type of person that says no to unfair expectations or if you like to stand up for yourself, you may want to reconsider applying. Please Google to find information about the last set of redundancies."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "If you're thinking about joining here, don't.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 May 2023", "job_title": "Anonymous Employee in Birmingham, England", "duration": "N/A", "pros": "Your co-workers are vegan, kind and compassionate individuals.", "cons": "Your managers exploit the kindness for all the energy and capability you've got for little in return besides 'furthering veganism', which is absolutely not what this charity does. The charity only exists on the whims of a racist leadership board, an under qualified senior management team and to the detriment of the vegan movement. There are no opportunities for you, you will be paid poorly, you will receive very few benefits and you'll be pushed to do up to five people's equivalent job until you say no, and then you'll be gaslit and bullied until you silently leave."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A great organisation to be a part of!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Feb 2021", "job_title": "Communications Manager in Birmingham, England", "duration": "N/A", "pros": "-Inclusive, progressive and welcoming culture. As a black woman, I felt fully valued in my role and was promoted to a management position after a year of working there.\r\n-Supportive senior management. I felt my manager had a genuine concern for my wellbeing, as well as the wellbeing of the rest of the team. Our ideas and suggestions were encouraged and valued.\r\n-Passionate and cause-focused team. I felt very lucky to work with so many who cared so deeply about their work.", "cons": "Relatively small organisation so staff shortages are felt heavily. The size also means that there may be less opportunities for career progression (although when opportunities do arise, senior management are generally good at recruiting internally).\r\n\r\nTrustees can sometimes be overbearing and stifle the work of employees."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "At the forefront of the good fight - fantastic place to work!", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Nov 2020", "job_title": "Media and PR Officer in Birmingham, England", "duration": "N/A", "pros": "I had such a brilliant time working for The Vegan Society in the communications department. You're surrounded by a great, capable support network of staff who are all passionate about ushering in a new dawn for veganism. There's an important emphasis on work/life balance, and they're flexible on start/finish hours which is an added bonus. There's a lot of plates to juggle, but the varied nature of the role means you'll be kept on your toes. Having worked in various communications departments over the last few years, I can safely say that TVS have offered the best working environment by a long way. A really positive organisation that treats its workers well. An easy commute also as it's right next to Snow Hill station (although COVID has put an end to that for the time being).", "cons": "Nothing really springs to mind!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Positive collaborative atmosphere", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Mar 2021", "job_title": "Communications in Birmingham, England", "duration": "N/A", "pros": "I have been a member of the team for two months and I am thoroughly enjoying my employment. \r\n\r\nI have been provided with good quality home working equipment, there are plenty of opportunities for my voice to be heard, excellent training from my line manager and interesting webinars and training courses to take part in.  \r\n\r\nMy colleagues have been welcoming and friendly.", "cons": "The current lack of managers to take my ideas forward - however, these roles are currently being recruited for."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A paradise for passionate vegans", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Jan 2020", "job_title": "Media Officer in Birmingham, England", "duration": "N/A", "pros": "The Vegan Society is hands down the best place I've worked at and I look back at my time there very affectionately. The job itself is of course what drew me to the organisation the most, particularly because in my role as Media Officer I had a unique opportunity to be a powerful voice for the animals in the media. Anyone passionate about veganism and issues surrounding it will find it a rewarding place to work. \r\n\r\nStaff are lovely, pay is very generous for the charity sector and there's some flexibility around working hours which is great if you are (or aren't!) a morning person. The organisation is very valuable for the vegan community because of its campaigns, legal and nutrition work, and I was very lucky to be able to promote this. I also gained very valuable professional experience and skills thanks to the training I had been getting.", "cons": "Honestly, nothing worth pointing out!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Positive long-term experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Oct 2018", "job_title": "Sales Manager in Birmingham, England", "duration": "N/A", "pros": "Working at TVS was a dream role and my first in the Charity sector. The people who work at TVS are all working to achieve the same mission and targets and this was recognised through our strategy and objectives. Senior Management were mainly positive throughout my time there and they proved to drive the charity forward to exceed my expectations and transform themselves into a modern workplace. Staff were always friendly and the work atmosphere was enjoyable.", "cons": "High staff turnover was an issue during my time at TVS from 2012 - 2016, and it could prove difficult to forge relationships and really drive the charity towards its targets when some staff could become burnt out easily. This was minimised by the time I moved on with staff enjoying longer periods and benefits that allowed them to work positively in a supportive environment."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "It was the best of times, it was the worst of times", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Feb 2017", "job_title": " in Birmingham, England", "duration": "N/A", "pros": "Being with compassionate people working hard to be a positive influence in the world. Sharing ideas and connecting with people at events across the UK and overseas. Being in work that fits well with personal values.", "cons": "Increased risk of compassion fatigue and burnout from wanting to give as much as possible to the role, and added stresses of dealing with high turnover of staff experiencing those/other issues. Frustrations if feeling employees' dedication and work ethic were being questioned instead of their legitimate concerns (e.g. about understaffing and workload) being acknowledged and support offered."}], [], []]