[[{"date": "N/A", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "The process was very easy, all completed through zoom. I first had an interview with my unit manager and then completed a peer review with potential coworkers. Maybe a day or so after the peer interview, I received an offer from HR.", "Interview Questions": "Basic interview questions. Mostly hypothetical scenarios."}, {"date": "28 Jun 2023", "title": "Certified Nursing Assistant (CNA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "The interview process went well. It was in person and they ask you questions to get to know you better as a person. Definitely don’t be scared to ask questions.", "Interview Questions": "Have you encountered a difficulty with a patient, if so, how did you handle it?"}, {"date": "6 Jun 2023", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health (Monroe, NC)", "Interview Descriptions": "Simple, cordial & informative. Interviewer was open with information and needs required to fill position. I was interviewed more than once. By phone and in person. To filter out applicants but overall simple usual questions", "Interview Questions": "What is One of your downfalls"}, {"date": "9 May 2023", "title": "Patient Serives Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "Went wonderfully, was very professional and timely. I felt comfortable to speak about all topics that were discussed. They were very outgoing and understanding and answered all of my questions with ease.", "Interview Questions": "Why do you believe you are a fit candidate for this role?"}, {"date": "7 May 2023", "title": "Clinical Pharmacy Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Novant Health (Winston-Salem, NC)", "Interview Descriptions": "Standard process for interviews with round table interview discussion. Able to ask questions and answers. Also was able to tour facilities and meet team members throughout the day. Overall was a very good interview process", "Interview Questions": "Asked to do clinical presentation"}, {"date": "6 Apr 2023", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "It was an initial phone interview then you meet with the director and interview with the director. Interview was straightforward and was not hard at all. After meeting with director they discuss salary and pay sends job offer.", "Interview Questions": "Why do you want to work at Novant"}, {"date": "27 Mar 2023", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health", "Interview Descriptions": "It started with a email invite to a zoom interview. The zoom interview was mostly describing the job description and seeing if I was interested. I was also asked about 3 basic interview questions. The whole process took about 1 hour. It started with me waiting about 20 minutes for my interview started. Then I was taken back to the pharmacy room where NINE, yes NINE people were sitting in a circle around a chair where I was meant to sit. I was like “wow.” I wasn’t used to or prepared for that. Everyone had a clipboard and was making notes about me the entire time. It was a bit daunting at first. The start by introducing themselves. Who they are and how long they have been working there. Then they pick a strange question to “open” the room up and make it more causal and less stressful, and then it’s your turn. Once the prices starts, it’s not too bad. I felt it was a basic interview, except I had nine people staring at me. I think I did well, or at least as well as I could have. When it was over I was told a recruiter would contact me in 1 week because they had another interview. I’m going on week 2, so it’s safe to say I was ghosted. But it’s good to practice interviews, so it wasn’t a pointless endeavor.", "Interview Questions": "1. Tell us a little about yourself. 2. Tell me of a time you felt you could have handled a situation better? 3. Why do you want to work for Novant 4. Why are you interested in this position 5.Tell me a time you were in a challenging position? -this question I stumbled on, and possibly gave a bad example. Be prepared for this one just in case. 6. What kind is most important to you in a work environment? 7.what is your ideal boss?"}, {"date": "24 Mar 2023", "title": "Senior Paralegal Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health (Charlotte, NC)", "Interview Descriptions": "The HR person was very unprepared knew very little about the position. When I asked follow up questions she didnt know the answer, everything was “im\nNot sure”. Recieved a call to schedule 2nd interview I followed up, then she ghosted me.", "Interview Questions": "Why do you want this position?"}, {"date": "3 Mar 2023", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health in Mar 2023", "Interview Descriptions": "My interview is tomorrow with a recruiter. I am not sure if it is a formal phone interview or just a screening call. Any input would be great. They will probably ask about myself, my experience, my work ethic and how I can see myself benefitting the company.", "Interview Questions": "They will probably ask about myself, my experience, my work ethic and how I can see myself benefitting the company."}, {"date": "20 Feb 2023", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "The interview was over zoom. It was easy going and the lady was very sweet. I was very nervous but she made me feel super comfortable and answered any questions that I had.", "Interview Questions": "Why nursing, what are your strengths"}], [{"date": "17 Feb 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "the interview process was pretty easy. They had an open interview with multiple staff per unit. would call each candidate in at a time and would ask them the needed questions for the interview.", "Interview Questions": "how would you handle a difficult situation"}, {"date": "5 Feb 2023", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "Good and drug test. Don’t forget you can not get hired if you fail drug test. Also, job was good and I liked it a lot. Glad I interviewed for job.", "Interview Questions": "Drug test? Yes there is one"}, {"date": "3 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "The Interview was with management and co-workers in a panel style. It was very standard. They asked questions and allowed me to ask questions also. Open dialogue. Explained what the job entailed and what would be expected. Days and hours required for the job were discussed as well.", "Interview Questions": "Why are you looking to change jobs."}, {"date": "12 Feb 2023", "title": "Certified Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Novant Health (Kernersville, NC) in Feb 2023", "Interview Descriptions": "Got a tour of the facility, met with staff. Everybody was friendly and the hospital is very nice and clean. Waiting to hear back. Apparently it takes 1 week to hear back", "Interview Questions": "What was a difficult time you encountered and how did you handle it?"}, {"date": "23 Jan 2023", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Novant Health", "Interview Descriptions": "The interview process was an overall good experience. I was interviewed by the director and the manager of the department. The interview was about 30 mins long nothing to crazy.", "Interview Questions": "Why do you want to work at Novant Health?"}, {"date": "4 Jan 2023", "title": "Administration Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Novant Health", "Interview Descriptions": "In person interview with multiple people. We then walked through where you would be working and met some of the people. They make you memorize medical questions that you will be asked for in the interview.", "Interview Questions": "To memorize questions they email you before hand."}, {"date": "26 Jan 2023", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Novant Health (Green Bay, WI) in Jan 2023", "Interview Descriptions": "I started with a phone interview with complete information about the position as well as the company. I was then offered a in person interview. My in person interview was one of the best I’ve ever had. It was more about the geared towards the actual position and how I would fit not the normal questions that do not gage you as a individual but more as a number.", "Interview Questions": "Do you know about nova"}, {"date": "5 Dec 2022", "title": "Patient Service Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health", "Interview Descriptions": "The recruiter as well as office management were very pleasant. Every one was very pleasant. Upon arrival management offered a office tour. Interview was not too long or too short.", "Interview Questions": "Previous job title and duties"}, {"date": "8 Jan 2023", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC) in Nov 2022", "Interview Descriptions": "Initial phone screen followed by in person meeting with a Human Resources Manager. Said he liked my resume but was worried the position was \"less\" than my abilities. Said he would get back to me and never did.", "Interview Questions": "To describe my ideal job."}, {"date": "31 Jan 2023", "title": "Technical Support Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health in Oct 2022", "Interview Descriptions": "It was a phone call that asked very little about technical knowledge. Basically just wanted to know if I would be willing to work the schedule. They are going through a bit of a transition at the moment.", "Interview Questions": "Are you willing to work second shift?"}], [{"date": "30 Aug 2022", "title": "Administrative Specialist II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Novant Health (Charlotte, NC)", "Interview Descriptions": "The total process took about 4 weeks. I was selected for an offer by one interview with the hiring manager. The recruiter called me the same day with the offer.", "Interview Questions": "Tell me about a time you faced a challenge and overcame it."}, {"date": "3 Aug 2022", "title": "Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "Over phone first interview then in person with two interviewers in the meeting. Both department managers of the department of over one hundred employees, very pleasant and friendly personalities that made the interview process less stressful and enjoyable", "Interview Questions": "Why should we hire you?"}, {"date": "11 Aug 2022", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Novant Health (Wilmington, NC) in Jul 2022", "Interview Descriptions": "Don't waste your time and energy. I was contacted via Indeed by a Novant recruiter as a potential match for their open recruiter role. Had the initial phone screen with the recruiter, which was a great conversation, and then was quickly set up with a panel interview with three members of the Wilmington team. Interview took place on Monday and went well. I was asked all of the typical interview screening questions by each of the individuals on the zoom call. I was told I could expect to hear back from the team before the end of the week. Friday arrives with silence from BOTH recruiters I had worked with throughout the process. I reached out for feedback or next steps, even a simple \"sorry we went with someone else\" and am still waiting for a response. The panel interview was 2.5 weeks ago. \n\nAs a recruiter, who has several years of experience with what goes on behind the scenes of the interview and hiring process, I get things happen, there are other candidates in process, etc. But at the very least, send your candidates the stale \"thanks, but no thanks\" email.  Don't just ghost them.", "Interview Questions": "How do you prioritize tasks and stay organized? "}, {"date": "18 May 2022", "title": "Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "The interview process was great! We interviewed via Zoom, and I feel as if it was amazing. I'm hoping to hear back really soon. I can't wait to start my career there.", "Interview Questions": "Why is Novant the best fit for you? "}, {"date": "24 May 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Novant Health (Mount Airy, NC) in May 2022", "Interview Descriptions": "Lengthy, minimal contact. I have been waiting 3 weeks since my interview and they've yet to hire an employee.  I had already waited two weeks for an interview call, and turned down an additional offer in order to take the interview.", "Interview Questions": "They asked what I thought my Strengths and Weaknesses were.  "}, {"date": "26 Apr 2023", "title": "Early Intervention Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Novant Health in May 2022", "Interview Descriptions": "It begins with a One on One interview with supervisor and then you have an interview with your potential team members. The team sees if you're a good fit then after that you will hear from HR if you are moving forward.", "Interview Questions": "How do you handle conflict with a coworker?"}, {"date": "24 Apr 2022", "title": "PGY1 Pharmacy Resident Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health", "Interview Descriptions": "This is a 3-hour interview process with 3 different panels including the RPh, administrator, and clinical preceptors. A small presentation was also offered at the beginning. The staffs were great and welcoming.", "Interview Questions": "Why did you choose us?"}, {"date": "14 Mar 2022", "title": "Clinic RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Novant Health (Charlotte, NC) in Mar 2022", "Interview Descriptions": "Interview process was amazing and very down to earth. Only one session of interviews with the office manager and hiring manager. Shadowing experience was offered. Looking forward to working with the company.", "Interview Questions": "Tell me about yourself and your experience."}, {"date": "18 Feb 2022", "title": "Pharmacy Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "Interview with  four  pharmacist online question and answer  not that hard just a waste of time. about 10 question. mostly asking about how you interact with groups. trying to see if you can work well with others", "Interview Questions": "What was something you did that had a lasting  impact to you organization?"}, {"date": "28 Jun 2023", "title": "HR Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health in Feb 2022", "Interview Descriptions": "Phone screen with recruiter. Then scheduled for interview with hiring manager. Virtual interview was relatively easy and laid back. Interviewed with two supervisors at once; one was the hiring manager and other was for support. Basic situational questions.", "Interview Questions": "Basic situational questions and general conversation about experience"}], [{"date": "3 Jul 2022", "title": "Leadership Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health (Charlotte, NC) in Feb 2022", "Interview Descriptions": "There was a preliminary interview, followed by a phone call by the hiring manager and then a group video call.  They did a good job of keeping me informed and it was a fair evaluation process.", "Interview Questions": "Several questions based on my background and the way it connected to the job requirements."}, {"date": "28 Jan 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "Quick. Efficient. Pleasant and informal. \r\n\r\nHowever, did not  allow any time for appropriate questions. Left interview with very many questions I had intended to ask but interview was cut almost as soon as they had the information they needed. Felt very one sided for an interview.", "Interview Questions": "What experience do you have"}, {"date": "19 Jan 2022", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Novant Health", "Interview Descriptions": "Interview process was smooth and prompt. I applied, had 2 interviews, and was offered a position within 9 days. First interview was with hiring manager and second was a peer interview. The interview was relaxed and I was able to freely ask questions about the role.", "Interview Questions": "Question about conflict resolution with team mate"}, {"date": "23 Jan 2022", "title": "ADT Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Novant Health (Winston-Salem, NC) in Jan 2022", "Interview Descriptions": "HR will call you after you apply if they are interest in interviewing you. If that telephone interview with HR goes well they will then forward your resume to the hiring manager. The hiring manager will select your resume and contact you to set up an interview if they feel like you are a good candidate to fill the position. With covid they are now doing in person interviews using zoom on your computer or phone. If the hiring manger wants to make you the job offer HR will call you and make you an offer. If you accept, HR will send you an acceptance letter and a list and directions of how to upload forms they need for onboarding. You will also sign up for an employee health physical and drug screening. After that you make an appt to get your badge made. After the background check, drug screen, forms and physical and all is good, they will tell you the friday before estimated start date time.", "Interview Questions": "Standard. What made you apply to this position. What are your strengths and weaknesses. Described a situation where you had to handle a disgruntled patient or family member and how you handled it and what the outcome was. Tell me about yourself. "}, {"date": "10 Jan 2022", "title": "HRSC Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Novant Health", "Interview Descriptions": "Had a zoom video with two interviewers with one being a manager for the position posted.   They both took turns asking questions and allowed me to ask questions, too.  The interview lasted nearly an hour.", "Interview Questions": "What would be one word that others would describe you?"}, {"date": "7 Jan 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "It was a group interview and everyone was able to take turns on their answers. This usually gave a lot of time for people to think about their answers and give a well spoken response.", "Interview Questions": "Why do you want to work here"}, {"date": "18 Dec 2021", "title": "Associate General Counsel Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Novant Health (Charlotte, NC) in Dec 2021", "Interview Descriptions": "I went on four interviews with the legal department of this company.  The process was standard in the sense that the recruiter does a screening.  Then I interviewed with the hiring attorney, and 6 lawyers ....several of whom had 6+ years of experience less than me and did not appear to understand employment law.", "Interview Questions": "Questions were not well thought out and were pretty standard interview questions that most employer's ask.  You can tell the lawyers interviewing don't interview much.  Expect your routine questions you can google.   I think interviews are a chance for both parties to ask and answer questions, which I don't think these lawyers appreciated.  Things I was able to discern from the lawyers who interviewed me were that the company is very reactive, not proactive; translation = you'de be dealing with cleaning up mess from employees who are not trained on standard employment/hr policies and that don't minimize risk; the HR department is new and doesn't know much, resulting in more questions to the legal department; there are only 3 employment attorneys servicing 37,000 employees; translation - possible burnout;  the legal department specifically does not have a process in place to implement its core values, including the value of compassion and treating employees like family; the legal department lacks diversity and (most) of the lawyers were very impersonal / stiff; one lawyer stated that what she liked least about the organization was that she was always moving at lightening speed; translation = heavy work load, possibly alot of meetings, and not enough people to do the work.  Finally, 1 out of 6 lawyers mentioned work life balance, and 1 lawyer did not directly answer the question regarding how the department implements its core values.   Finally, after 4 rounds of interviews, the legal department did not have the courtesy to let me know I did not get the position.  I don't think this reflects the company's core values and shows that the department does not value other people's time.  I think this company and in particular the traditional legal departments may want to reflect as a business on the changing shifts that are occuring in business and what modern day workers are looking for in companies if they want to attract qualified candidates and increase retention rates of skilled employees. "}, {"date": "2 Nov 2021", "title": "Unkonwn Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health", "Interview Descriptions": "The interview process was a pain in my rear. Communication is scattered and took far too long to get the process started. Once given a position, it took another month.", "Interview Questions": "What days are you available ? "}, {"date": "26 May 2022", "title": "Ccma Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Novant Health (Charlotte, NC) in Nov 2021", "Interview Descriptions": "My interview process went very smoothly. I was asked my strengths and weaknesses, what I could bring to the team, and how I would do so. They also brought me around to speak with the rest of the team which was great. Overall great experience.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "21 Sept 2021", "title": "Patient Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "Great questions and answered compiled by select group of peer’s  conducted in professional setting. Post drug test and extensive training  were all part of the process. Fabulous company to work for!", "Interview Questions": "Why do you believe you would be a good fit with this team?"}], [{"date": "3 Sept 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Novant Health", "Interview Descriptions": "The interview process was quick. Applied heard back within two weeks, interviewed and was hired a week later. Interview was quick and laid back. The interviewer created a welcoming environment.", "Interview Questions": "Basic, why you want to be a nurse and work at novant "}, {"date": "19 Sept 2021", "title": "Phlebotomist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Novant Health (Winston-Salem, NC) in Sept 2021", "Interview Descriptions": "My first one was on zoom! I thought  it was nice. It felt more personable than a today's new \"normal\" interview because I was at home with no mask and they could see my expressions. I was interviewed by multiple lab and phlebotomy supervisors and technicians. I have a 2nd interview soon!", "Interview Questions": "They asked about my experience and if I minded alternating holidays."}, {"date": "3 Oct 2021", "title": "Cerified Phlebotomist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Novant Health (Winston-Salem, NC) in Sept 2021", "Interview Descriptions": "Standard situational questions, how would I handle friction between a co-worker and myself was one question. Laid back, the supervisor, managers and leads made me feel relaxed.  They were open and honest about being short staffed right now.", "Interview Questions": "How I would handle unexpectedly encountering a trans gender patient who would like to be addressed by the pronoun that they identify with instead their birth gender."}, {"date": "27 Apr 2023", "title": "Senior Public Relations Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Novant Health (Charlotte, NC) in Aug 2021", "Interview Descriptions": "The interview process was smooth. The interviewer(s) thoughtful and considerate. The questions focused on how interviewee would respond to situations, as well as the interviewee's experience. The interview lasted about 45 minutes. Follow-up from the interview came in less than two weeks.", "Interview Questions": "Describe a project that you are proud of and explain why."}, {"date": "29 Jul 2021", "title": "EMR Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC) in Jul 2021", "Interview Descriptions": "Great interview experience.  Very laid back and comfortable.  All questions were scenario based.  Nothing  out of the ordinary.  Interview was conducted onsite instead of via Zoom.  I felt confident about my interview experience when I left.", "Interview Questions": "The usual - Tell me about yourself.\r\n"}, {"date": "8 Jun 2021", "title": "Humam Resource Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health", "Interview Descriptions": "The interview process was described as:\n1. Interview with head of dept and member of talent acquisition\n2. Interview with the team\n3. Interview with the head of dept (again) and another rep\n\nThis info is based on the 30 minute initial interview with 2 individuals", "Interview Questions": "1. Tell me about yourself\n2.  What are your strengths?\n3.  Tell me about a project you worked on that you were most proud about\n4.  What would your current or most recent supervisor say your strengths are?\n5. If you could be any animal or kitchen appliance, what would you be and why?"}, {"date": "23 Jun 2021", "title": "Registered Respiratory Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Novant Health (Charlotte, NC) in Jun 2021", "Interview Descriptions": "Got a call for an interview the day after I applied. Asked if I could come in the next week for the interview.  It was way faster than I expected.", "Interview Questions": "What makes you a good candidate for the position?"}, {"date": "26 Jun 2021", "title": "CNA I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Novant Health (Charlotte, NC) in Jun 2021", "Interview Descriptions": "I applied to one position, did the virtual interview but was not chosen because of the gap in my experience. The recruiting team contacted me and told me to apply to another position.  Two days later, I was invited to do a virtual interview. I completed the interview by 3:30pm and received a call from HR at 6:30pm with an offer. This was a very quick and easy process.", "Interview Questions": "The questions were set to gauge personality."}, {"date": "25 May 2021", "title": "Certified Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Huntersville, NC) in May 2021", "Interview Descriptions": "applied for the position and the next day was contacted for an in person interview. Then the second interview was a week later with the provider who then decided to go with another candidate", "Interview Questions": "how do you handle conflict "}], [{"date": "22 Apr 2021", "title": "Supervisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire", "Interview Questions": "Questions will vary based on department and leader."}, {"date": "19 Apr 2021", "title": "Guest Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "The interview process was very smooth, no pressure just conversation. The best experience I’ve had with any employer. Novant Health is the best healthcare facility , when it comes to employees, patients, and guests.", "Interview Questions": "What made me want to work for Novant? "}, {"date": "4 Apr 2022", "title": "Caregiver, CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Novant Health (Winston-Salem, NC) in Mar 2021", "Interview Descriptions": "Very basic, ask questions about your self and your experience. Also wants to know how you can contribute to the team and what skills you have to offer. Overall very easy and straightforward.", "Interview Questions": "Q: why do you want to work for novant?"}, {"date": "30 Jan 2021", "title": "Licensed Practical Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "Straightforward and virtual. The interviewing staff was nice. They answered all of my questions and made me feel confident. Seems to be a simple process for a good company. I interviewed for the LPN position. Thank you.", "Interview Questions": "Tell me about a difficult situation at work"}, {"date": "15 Jan 2021", "title": "Cardiac Sonographer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health", "Interview Descriptions": "Scheduled interview, however, the hiring manager canceled my interview and decided to pursue someone else they thought was more qualified. I have never had a job before I am fresh out of college, but for some dumb reason, glassdoor keeps asking me to give them salary information and an employer's name like it's none of their business. for your information, I don't have any to give you. so you can leave me be and let me look for a job.", "Interview Questions": "We've decided to cancel your interview, and look for someone we think is more qualified, were not even sorry for getting your hopes up, then dropping you like a sack of potatoes."}, {"date": "22 Jan 2021", "title": "Director, Talent Management - Learning and Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Novant Health (Charlotte, NC) in Jan 2021", "Interview Descriptions": "Recruiter reached out via email and sent over a Word doc with 10 very basic questions.\r\nInterview via Microsoft Teams with Hiring Manager.\r\nThe HM asked only one basic question and then she looked off in a direction away from the camera. It was obvious she was bored and not interested or listening and subsequently I felt the same. She actually looked pretty miserable and never smiled once throughout the entire 30 minutes that she afforded me. All I heard from her was how fractured healthcare is and how dated their systems and processes are. Clearly isn’t a happy or progressive  place to be. This was a VP who interviewed me and if this is what leadership behavior in HR is like with a candidate,  I can’t imagine what it’s like to work here.", "Interview Questions": "Hiring Manager asked  only one question “Tell me about your background and experience.”"}, {"date": "21 Mar 2022", "title": "New Grad Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC) in Jan 2021", "Interview Descriptions": "Great interview process. Did zoom call. They were very easy to talk to and communicate with during the interview. They did ask.some tough questions but they were all very fair. I really liked the whole process.", "Interview Questions": "What is one thing your friends would say about you?"}, {"date": "31 Jan 2022", "title": "RMA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at Novant Health (Charlotte, NC) in Jan 2021", "Interview Descriptions": "Smooth and easy going. They ask the basic questions. They ask me what could I offer the company, the medical team, the patients and what my ambitions were at the moment and in the future.", "Interview Questions": "my straight and my week points"}, {"date": "25 Nov 2020", "title": "CNA I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health", "Interview Descriptions": "Quick interview with nurse manager. Asked straight forward questions and took the time to ask me questions too. Be able to explain why you want to be CNA and your goals for patient care.", "Interview Questions": "Why do you want to work at Novant?\nHow can you help the patients here?\nWhat made you want to go into the medical field? "}, {"date": "11 Nov 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Novant Health (Morganville, NJ) in Nov 2020", "Interview Descriptions": "It was an online interview. We spoke about myself, the work I have done before. The role and responsibilities of the position. It was a very positive experience. We also spoke about the future onboarding process if I get selected for the job. The interviewer was very friendly.", "Interview Questions": "I was asked about my previous work experience. How this work experience would help in this job. "}], [{"date": "20 Oct 2020", "title": "Director of Learning Experience Design & Delivery Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health", "Interview Descriptions": "I was informed via email that I had selected for the next level.  I was asked to complete a writing assignment to determine if I would be selected for the next round.  After spending over an hour on the assignment, I submitted the assignment and never heard back from the recruiter.  Very unprofessional after having been asked to complete this activity.", "Interview Questions": "Tell me about a time when you created a dialogue with your team that developed trust\nand transparency? How was it received and what were the results?"}, {"date": "30 Sept 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "I interviewed for the nurse residency program. Overall, it was a good experience. It first started with brief orientation about the program, then the interview started. Staff were nice and friendly.", "Interview Questions": "Why do you wanna be a nurse? "}, {"date": "24 Mar 2021", "title": "Therapist I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health in Oct 2020", "Interview Descriptions": "Laid back process. I wasn’t  asked many questions. The only question was “tell me about yourself” and “what are you looking for ”. First interview with manager and then second interview with coworkers. Mostly informational interview.", "Interview Questions": "Tell me about yourself and career goals "}, {"date": "7 Sept 2020", "title": "Student Nurse Externship Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "The interview was over skype. The interviewer was really nice and the questions were not too hard. In addition to questions, she asked me which hospitals I would be interested in working in and which floors I preferred.", "Interview Questions": "Why did you choose nursing"}, {"date": "3 Sept 2020", "title": "CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health", "Interview Descriptions": "I applied to thier PRN CNA job and heard back within a few days. I then had a phone interview that was a few questions and a face to face. Im waiting to hear back", "Interview Questions": "Can you tell me about yourself?"}, {"date": "14 Apr 2020", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "Very brief. Basically already had the job because they needed nurses so badly at that time. Met with the manager and coordinator and they let me know I would be recieving a call offering me the job.", "Interview Questions": "Nursing experience, icu experience "}, {"date": "5 Mar 2021", "title": "Educator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Novant Health (Charlotte, NC) in Mar 2020", "Interview Descriptions": "Communication was terrible. I interviewed with a total of four people and kept being told I was going to be hired only to be told I was not because I finally called them.", "Interview Questions": "Interviewer just talked about herself. "}, {"date": "15 Mar 2022", "title": "Physician Assistant, PA-C Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Battleground, AL) in Feb 2020", "Interview Descriptions": "The process was efficient and was organized well.  Compared to other interviews, this went well.  Open dialogue and good discussion.  No problems here.  Nothing bad to say about this company .", "Interview Questions": "Q: why do you want to work here?"}, {"date": "23 Sept 2020", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC) in Jan 2020", "Interview Descriptions": "2 zoom interviews with product managers and program managers, lots of ad hoc conversations, plenty of time to ask questions and very informal.  Being a zoom interview it was difficult to hear much of the time and people often talked over each other but everyone was very polite and I would say this is a formal organization.", "Interview Questions": "What is the top qualification for a good business analyst."}, {"date": "31 May 2021", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health (Concord, NC) in Jan 2020", "Interview Descriptions": "Brief, asked about experience and other details related to current position and typical questions during an interview. Interview was straightforward and concise. Did not have many questions following. Encourage to read on company and come informed and with questions", "Interview Questions": "What is your expectation of youre role"}], [{"date": "9 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health (Charlotte, NC) in Dec 2019", "Interview Descriptions": "I submitted an application through HR. I received an email from a hiring manager for an interview. 2 managers showed up. Then I had a peer interview. 4 nurses attended.", "Interview Questions": "If you could change one thing about your current place of employment, what would it be and why?"}, {"date": "21 Nov 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Novant Health (Winston-Salem, NC)", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire.", "Interview Questions": "if you were a fruit what would you be"}, {"date": "4 Oct 2019", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "Very pleasant and relaxed. Met with hiring manager then lead psr. Took longer than expected but was very down to earth. Asked a lot of questions and went over benefits and hours etc", "Interview Questions": "What was a difficult work situation and how did you deal with it?"}, {"date": "2 Oct 2019", "title": "Guest Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Novant Health (Salisbury, NC) in Sept 2019", "Interview Descriptions": "Very laid back interview, hiring manager was very nice and down to earth. The interview was very conversational. Super sad that I didn't get the position, this seems like a great company to work for.", "Interview Questions": "N/A"}, {"date": "16 Sept 2019", "title": "Senior Talent Acquisition Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at Novant Health (Charlotte, NC) in Aug 2019", "Interview Descriptions": "Terrible experience and terrible talent acquisition team, interviewed over 5 weeks ago and they dragged their feet around to make a decision. Unorganized human resources group when I asked for feedback.", "Interview Questions": "Recruiter experience "}, {"date": "22 Jul 2019", "title": "Radiologic Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Novant Health (Winston-Salem, NC) in Jun 2019", "Interview Descriptions": "Had a phone interview and then an in person interview. Was told I would hear back the following week for sure. If I didn’t hear back to just email. I sent two emails and they wouldn’t respond. Been three weeks and looks like sending a no is too hard to do. If you do not know someone that works here, you will not get the job.", "Interview Questions": "Why hire you ?"}, {"date": "24 Jun 2019", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Novant Health (Charlotte, NC) in Apr 2019", "Interview Descriptions": "Interview was not well planned.  Interviewer was late.  Hardly asked any questions.  NEver followed up after the interview or after phone calls.  Not good at all.  no follow up is disrespectful.", "Interview Questions": "\"How do you do with kids?\""}, {"date": "6 Mar 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Novant Health (New York, NY)", "Interview Descriptions": "Received a phone interview  within the week of applying. Interviewed with 2 people, hiring manager and a CRA. It was a little disoriented as if they didn't fully read my resume to understand my experience and background. Surprisingly, landed an in person interview a week after the phone interview and it was nerve wrecking. I interviewed with the entire team and they asked the very same questions during the phone interview. It was very redundant. The interview lasted 1.5 hrs long. A week after the in person interview I was asked for my references and got rejected 2 weeks later. They did not contact my references either so it was a bit of a disappointment.", "Interview Questions": "What type of clinical trials have you done?"}, {"date": "8 Oct 2019", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Novant Health (Manassas, VA) in Mar 2019", "Interview Descriptions": "You are contacted by the head RN of the office to come in for an interview.  If they offer you a position, you will receive a call from North Carolina, the headquarters (for the official offer and to discuss starting pay).  Then you go through occupational health for drug testing/labs/vaccines. Then a week long orientation for EPIC and to learn about the companies \"Core Values\" ....Heavy air quotes.", "Interview Questions": "Do you participate in drama?"}, {"date": "25 May 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Novant Health (Matthews, NC) in Mar 2019", "Interview Descriptions": "Pretty straightforward. My interview was between me and the unit manager. I was early but some how her assistant forgot about my interview. So when I got there, they weren’t expecting me. The interview was roughly 30 minutes to an hour. She later gave me a tour of the into and introduced me to other employees.", "Interview Questions": "Name one of your quality about yourself that requires improvement."}], [{"date": "30 Jan 2019", "title": "Telemetry Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health", "Interview Descriptions": "In-person interview with multiple attendees. After interview, observed telemetry techs in room and then brought back in to the office and asked whether the job would be a good fit.", "Interview Questions": "Why do you want to work in this department?"}, {"date": "13 Jun 2019", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Novant Health (Charlotte, NC) in Jan 2019", "Interview Descriptions": "the interview process is just like any other interview at another company. There are some standard questions and then an opportunity for you to sell yourself for the position. Take advantage, do your homework, have references in your pocket, and get the job. simple.", "Interview Questions": "name"}, {"date": "14 Jan 2019", "title": "Patient Services Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Novant Health (Thomasville, NC) in Dec 2018", "Interview Descriptions": "The interview was very intense. I was asked a lot of unusual hard questions that stopped you in your tracks! So I advise one to be very prepared to go into an interview!", "Interview Questions": "What are your weaknesses?"}, {"date": "11 Dec 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Novant Health (Winston-Salem, NC) in Nov 2018", "Interview Descriptions": "There was only one round for interviews. I was interviewed by 2 managers within the supply chain department. They both were very friendly and asked the standard interview questions. The interview did not last longer than 30 minutes and I was hired on the spot. Really great place for an internship and even for potential employment! Everyone in the department was nice and understanding of the fact that I was a student at the time. I never felt out of place and was always comfortable enough to ask questions and learn from them. The teams worked really well together and there was always great communication across the board throughout the department.", "Interview Questions": "Tell me about yourself"}, {"date": "23 Dec 2018", "title": "Data Scientist Co-op Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Novant Health (Boston, MA) in Nov 2018", "Interview Descriptions": "Applied for this position through university job board around September 2018. Received an invitation for an interview that was to take place at Boston and not in Charlotte, NC. Interviewed at Boston in November 2019 with 3 interviewers. All 3 them were equipped to throw in both business and technical scenarios/questions. \r\n\r\nThe interviewers were very polite and engaging which made the interview slightly less formal and more of a conversation. The interview was conducted in rounds with each interviewer spending about an hour with each candidates (there were multiple candidates when i interviewed) \r\n\r\nOverall experience was very good.", "Interview Questions": "Do you know what regular expressions (regex) is?\r\n\r\n"}, {"date": "1 Jul 2019", "title": "Corporate Public Relations Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Novant Health (Charlotte, NC) in Nov 2018", "Interview Descriptions": "There was a brief telephone interview for the first round. The second round consisted of an in person interview followed by a writing assignment. The last round was another panel interview with a few more members of the team.", "Interview Questions": "What is public relations to you?"}, {"date": "13 Sept 2018", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health", "Interview Descriptions": "The interview process was very laid back and comfortable. The interviewer asked questions that were common sense questions. The time frame from the day of the interview  to official call was two weeks", "Interview Questions": "Why do you want this job? "}, {"date": "11 Sept 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Novant Health", "Interview Descriptions": "The interview process was informal. I asked to shadow as part of my experience. I would recommend doing that so that you can speak with current employees and see the work environment.", "Interview Questions": "How do you handle conflict?"}, {"date": "6 Nov 2018", "title": "Payor Credentialing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health (Winston-Salem, NC) in Sept 2018", "Interview Descriptions": "Had my one on one interview with the hiring manager within a few days of applying. She was so personable and made me feel at ease. Then the next week I was asked back for a team interview...then a couple days later I was offered the position.", "Interview Questions": "Tell me about your previous experience?"}, {"date": "30 Jun 2019", "title": "Ekg Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health (Charlotte, NC) in Aug 2018", "Interview Descriptions": "It was a pretty easy interview. The supervisor was really nice and seemed down to earth. I was not nervous and it went pretty good. Yep, pretty good. I am glad I did it.", "Interview Questions": "What experience do you have?"}], [{"date": "14 Jan 2022", "title": "Radiologic Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Novant Health (Winston-Salem, NC) in Aug 2018", "Interview Descriptions": "Interviewer was professional and explained all the duties and responsibilities of the position. They also showed a great deal of interest in both my professional life, but also things I do outside of the medical field.", "Interview Questions": "If I was a superhero, what superhero would I be and why? "}, {"date": "24 Aug 2018", "title": "CNA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Novant Health (Greensboro, NC) in Aug 2018", "Interview Descriptions": "Brief interview with the department manager it was a interview Bliss she asked typical interview questions and spoke about the company and explained the simple life of working in that department", "Interview Questions": "Why would you like to be apart of the NOVANT health care team?"}, {"date": "20 Jul 2018", "title": "CSSO RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Novant Health", "Interview Descriptions": "It took about 1 month to get a call for an interview. Was interviewed by 2 managers. I felt like they asked me negative questions and didn't really ask about positive experiences about myself. They did read me from style questions off of a questionnaire. Was told that they are interviewing other candidates and will hear something within 2 weeks to a month.", "Interview Questions": "Describe a situation where a patient's requests were unrealistic? How did you handle it?"}, {"date": "7 Jul 2018", "title": "Regional Operations Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Novant Health", "Interview Descriptions": "Telephone interview/screen  with director level, in person panel style  interview with director and other regional managers.  No touch questions asked, very basic interview. Not as professional as I would have expected from a large successful healthcare organization.", "Interview Questions": "What are your strengths and weaknesses? "}, {"date": "13 Jan 2021", "title": "Personal Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health in Jul 2018", "Interview Descriptions": "Extremely thorough. Had to present in front of a panel as well as sit to interview same day. Everyone was very kind.  If you put in the work and show you’re eager, it will work in your favor", "Interview Questions": "What are three strengths? Why do you want to work as a trainer?"}, {"date": "28 Jun 2018", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Novant Health (Charlotte, NC) in Jun 2018", "Interview Descriptions": "I was first called and answered some quick questions over the phone that lead me to be invited to a hiring event. I picked a 30-minute time slot on the day of the event that worked for me. There were multiple tables there that were holding interviews for various positions and units. I interviewed with a director of the unit I was applying for and she asked me a few questions about myself, why I wanted to be cna, and what my availability was. She then proceded to tell me about the normal day to day activity of the unit and the work schedule. After asking a few questions of my own she thanked me and went to another table to speak with some other people. She then came back and offered me the position on the spot.", "Interview Questions": "Tell us of a time when you had an issue or problem with a coworker? What did you do?"}, {"date": "6 Jul 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Novant Health in Jun 2018", "Interview Descriptions": "2 Months from Interview to Possible hiring. Just to come to tell you that they now have to abide by new HR rules and good candidates that were already selected are now not being considered. I would be careful interviewing there. Huge waste of time.", "Interview Questions": "What is your weakness?"}, {"date": "6 May 2018", "title": "Advanced Practice Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Novant Health (Winston-Salem, NC)", "Interview Descriptions": "Thankfully their process was through the actually people I will be working for and with. I did not have to go through a recruiter for an interview. The lead clinician contacted me directly by email 2 months after I applied. Now the long and slow process of credentialing starts! Definitely worth it for the benefits and pay they offered!!", "Interview Questions": "What do you like about your current position?"}, {"date": "10 Apr 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Novant Health", "Interview Descriptions": "Open house with short 5-10 minute interviews. You choose the specialty that you preferred and had an interview with nursing managers. Then you were required to have an interview with a manager for a medical surgical floor.", "Interview Questions": "Why did you choose this specialty?"}, {"date": "24 Apr 2018", "title": "Nuclear Medicine Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Novant Health (Charlotte, NC) in Apr 2018", "Interview Descriptions": "I had a phone interview, then a face to face interview a few weeks later. The phone interview took place a couple weeks after applying for the position. The whole process took approximately one month.", "Interview Questions": "What does teamwork mean to you?"}], [{"date": "16 Aug 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Winston-Salem, NC) in Feb 2018", "Interview Descriptions": "3 weeks to hear back for an interview. Starts with a phone interview. A week later went in for a second interview in person at the hospital. Heard back from them in a couple of weeks with the notice", "Interview Questions": "What are your weaknesses and strengths? "}, {"date": "29 Oct 2017", "title": "RN Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Novant Health (Charlotte, NC)", "Interview Descriptions": "The Management team will interview. There may be two people in the room during the interview. You will stay in the interview room until two peers come in to interview you. The peers are there to see if you will be a good fit for the group and you will be able to ask peer interviewers about the position so you can see what a typical day will consistent of and you can ask them questions about what they like/love about the job and/or coworkers. There is a brief tour of work environment.", "Interview Questions": "What is something that has or is frustrating about your current/former job and how did you handle it?"}, {"date": "2 Apr 2018", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at Novant Health (Durham, NC) in Nov 2017", "Interview Descriptions": "The interview was easy and it was mostly about how you deal with problems you encounter. They want to know about your problem solving skills. As long as you know how to deal with people, you will be just fine.", "Interview Questions": "What is a difficult situation you encountered and how did you deal with it"}, {"date": "12 Oct 2017", "title": "Patient Services Coordinator IV Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC) in Oct 2017", "Interview Descriptions": "The hiring manager was extremely informative about the position and she was pleasant. She didn't ask the standard questions that most hiring managers ask. She focused on what the position entailed.  She also introduced me to the 2 providers that are in need of a patient services coordinator.", "Interview Questions": "Are you able to run an entire front desk on your own?"}, {"date": "6 Nov 2017", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Novant Health in Oct 2017", "Interview Descriptions": "Telephone interview with a panel of a healthcare team. The position was described in great detail, and there were lots of scenario questions were asked. I Was told that I would be called in a couple of weeks, was never contacted. No letter or email of declination either.", "Interview Questions": "What skills can you have to bring to this company?"}, {"date": "12 Sept 2017", "title": "Applications Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health", "Interview Descriptions": "1 interview through a recruiter, a phone interview with a Novant Higher up, and an onsite interview. \r\n\r\nThe onsite interview was with someone else that I wouldn't be working for, due to the other person being on military leave.", "Interview Questions": "What do you like about the role"}, {"date": "22 Oct 2017", "title": "Senior Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC) in Sept 2017", "Interview Descriptions": "Phone interviewed directly with the hiring manager.  We discussed salary ( of course, they always want to know that right up \r\nfront ) my experience and skill set.  He was enthusiastically agreeing that the position was a great fit for me.  I felt confident, based on his responses and fully expected to hear back from HR on the next step in the process - the manager assured me he would get with them with a compensation package range the very next day.  That was months ago.  I have sent two emails following up and I still hear crickets. No response!  Nothing - not even get lost! I am certain they have proceeded with another candidate, but why not just say so?  It seems to me, today's corporate world is full of ill-mannnered,  boorish, disrespectful children who mislead, misrepresent and have lost the professional ability to treat candidates like people.", "Interview Questions": "What my salary requirements were"}, {"date": "10 Nov 2017", "title": "Administrative Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Novant Health in Sept 2017", "Interview Descriptions": "There is an initial application period followed by a phone interview then an onsite interview. The phone interview was only 25 minutes and was with the current fellows. Overall the interview seemed easy, but the competition was steep.", "Interview Questions": "Biggest accomplishment?"}, {"date": "23 Aug 2017", "title": "Nurse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Novant Health (Greensboro, NC) in Aug 2017", "Interview Descriptions": "Interviewed by two senior staff members. Both asked questions. Email or call will say if employment is offered. After background check, drug test, and immunization have been verified you will then have orientation with the company. Following that will be orientation with your department.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "13 Jul 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC) in Jul 2017", "Interview Descriptions": "Pretty standard. Interviewed with three different people in the room. Was comfortable, everyone was very nice, and were able to answer any questions I may have about the unit and facility practices.", "Interview Questions": "General question information: Describe a situation you handled well in your experience, some negative stuff you had to deal with, covered the standard questions."}], [{"date": "19 Jul 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC) in Jul 2017", "Interview Descriptions": "I applied to several positions that I qualified for, online. The HR representative contacted me, asked me several easy preference questions, then offered to setup interviews for me. The first group that I interviewed with (a group of 4 from one unit) made me feel really comfortable and asked very valid questions pertaining to the acuity of the unit. One nurse manager from the unit called me hours after the interview and told me they had chosen me for the position. HR contacted me the very next day with an offer, we negotiated, I accepted the offer. I was extremely impressed.", "Interview Questions": "Strengths. What is your typical day at work for you like now. How would you handle this PR issue..."}, {"date": "11 Sept 2017", "title": "X-ray Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC) in Jun 2017", "Interview Descriptions": "Interview was short and the interviewer was not able to tell me much about salary since HR normally does this.  Manager was very nice and seems pleasant to work with.  HR called weeks later and offered me the position", "Interview Questions": "They asked about my Xray experience"}, {"date": "7 Apr 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health", "Interview Descriptions": "Had a phone call asking if i was sitll interested a week later had a relaxed interview, she asked me to tell her about myself and then asked the basic \"tell me about a time questions\", got an email saying i was offered the position and the starting salary, then 2 weeks later have a background check and drug test and  2 weeks after that have orientation", "Interview Questions": "tell me about a time you went above and beyond what was required of you"}, {"date": "3 Apr 2017", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Novant Health (Kernersville, NC)", "Interview Descriptions": "The whole interviewing process is lengthy. I interviewed with the office I was hired at two times. Near the very end of the interview the manager told me to stay close to my phone. About two weeks later I received a call from Novant Health Talent Acquisitions​ offering me the job. From the first interview to the job offer it was about four months.", "Interview Questions": "Can you multitask or do you only focus on one thing at a time?"}, {"date": "27 Apr 2017", "title": "Account Executive Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Novant Health (Charlotte, NC) in Apr 2017", "Interview Descriptions": "It was very descriptive about  job opportunities and what was expected of job applying for.  The benefits were layed out in great detail as well as expectations.  Possible to get promotions once hired", "Interview Questions": "What was I looking for in a new career opportunity?"}, {"date": "9 May 2017", "title": "Registered Medical Assistant In A Non-hospital Practice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Winston-Salem, NC) in Apr 2017", "Interview Descriptions": "Very straightforward.  Interviewer was polite, friendly, and the staff was very pleasant.  It made me comfortable to picture myself on the team.   When I called to follow up, the staff was again friendly and professional, the practice manager that I had interviewed with was wonderful.  They called for a second interview with the physicians the following week.  The physicians were delightful and really made me want to work for them.  It was a very positive experience and put me at ease from the very beginning of the process.", "Interview Questions": "Tell me what a normal day was with your previous employer"}, {"date": "3 Apr 2017", "title": "Psychiatric Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health (Charlotte, NC) in Mar 2017", "Interview Descriptions": "It was very scattered, unorganized, I had to wait for 45 minutes for the main nurse, got tour however, confused if I am getting job. Very annoyed. Was given business card. Was asked questions by multiple people, was there for over 2 hours however, told when I come back what elevator to use and that they were excited for me. still unsure whether I got the job.", "Interview Questions": "Why psych?"}, {"date": "22 Nov 2017", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Novant Health (Manassas, VA) in Mar 2017", "Interview Descriptions": "They called me in for an interview with the Clinical Admin. I met with the hiring manager and discussed the position. I also discussed what was being asked for in the position.", "Interview Questions": "Past Work Experience "}, {"date": "8 Apr 2017", "title": "Respiratory Therapist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Novant Health (Myrtle Beach, SC) in Mar 2017", "Interview Descriptions": "It was professional and it was concise. We talked about procedures and policies.  After that was a tour through the hospital to meet some of the staff.  I  think it was a good interview.  Things could not have been better", "Interview Questions": "They didn't they just said that we would be doing respiratory therapy treatments and patient care.  They looked at my experience and asked about equipment and procedures. "}, {"date": "26 Mar 2018", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Novant Health (Manassas, VA) in Feb 2017", "Interview Descriptions": "Received a call from HR in regards to my application. We then set up an interview with the unit supervisor. Went in for the interview and received an email from HR about 1-2 weeks later that I got the job.", "Interview Questions": "What made me apply for this job.  What kind of experience did I have.  Give an example of a personal time when a patient was irate. How did I handle a team member in the past where you did not agree on something"}], [{"date": "1 Jun 2017", "title": "CSA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health (Muskogee, OK) in Jan 2017", "Interview Descriptions": "it was very simple and they asked basic interview questions. They also give scenario questions and ask a time when you went above and beyond in the workplace. blah blah blah blah blah blah blah blah blah blah", "Interview Questions": "N/A"}, {"date": "6 Aug 2017", "title": "Staff Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC) in Jan 2017", "Interview Descriptions": "The interview took place with multiple pharmacists. The questions were not too difficult and the atmosphere of the pharmacy department was pleasant. Definitely seems like a good company to work for.", "Interview Questions": "What experience do I have?"}, {"date": "20 Feb 2017", "title": "Mulitple Positions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC) in Jan 2017", "Interview Descriptions": "Apply on line, there is an option to create your own account to review the status of your applications.  Does not really explain anything, just states if it is in review status, declined, withdrawn.", "Interview Questions": "Where do you want to be in 5 years, the basic interview questions that really give a vague insight to the person you are"}, {"date": "5 Dec 2016", "title": "Research Clinical Data Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Novant Health (Charlotte, NC) in Nov 2016", "Interview Descriptions": "Phone interview with preliminary online questionaire. All done through online and text. Very lengthy and at end after hired was asked to pay for my equipment and software with \" understanding\" that I would be reimbursed. Refused job and reported as a possible scam.", "Interview Questions": "About my work ethic"}, {"date": "8 Jan 2019", "title": "End User Computing Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Novant Health (Manassas, VA) in Nov 2016", "Interview Descriptions": "When scheduling the interview I was provided an address, but they neglected to mention that it wasn't in the main building.  I called my contact from the lobby of the hospital and he told me to drive to another building in the back.\r\n\r\nPretty basic interview.  Very few technical questions and everyone was very friendly.  At the end of the interview I was told that they had one more person to interview and they would let me know in about a week.  I called the hiring manager 10 days later because I hadn't heard back.  He sounded very irritated and told me they were still interviewing.  I never heard anything after that and took another offer.  I was also irritated that the job posting said Manassas, but in the interview he said the position would be in Haymarket.", "Interview Questions": "Q: What is a thin client?"}, {"date": "20 Oct 2016", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Novant Health", "Interview Descriptions": "It is very hard to get an interview if you are an external or even an internal candidate that works in a different department. You basically have to know someone who can get your resume to the hiring manager since HR doesn't do a very good job of identifying the right candidates. \r\n\r\nThe interview questions themselves are a list of about 20-30 situational questions produced by HR and I've found that most hiring managers do not stray from those, which I find odd since those questions are generic and do not specifically address the questions you may need to ask a potential employee to assess if they have the skills necessary for the job.", "Interview Questions": "N/A"}, {"date": "3 May 2017", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Winston-Salem, NC) in Oct 2016", "Interview Descriptions": "I received an email to come in for my interview, as well as directions to get to the unit. Once I arrived for the interview, it was a panel setting with 1 CNA, 3 nurses, the the night shift supervisor.", "Interview Questions": "What are three things you could work on about yourself?"}, {"date": "5 Oct 2016", "title": "Staffing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Novant Health in Oct 2016", "Interview Descriptions": "A phone interview was conducted with a panel of 3. The manager spoke about the position and aloud me to talk about my background. One panel member spoke about what they do on a daily basis, but was interrupted by the manager to tell me they are looking to fill position fairly quickly and if I have any questions to call the number back or the HR dept. I was not given the chance to ask any questions. Manager cut it short and it seem like they were trying to meet their interview quota for the position.", "Interview Questions": "Tell me about your background?, \nI was not able to ask any questions"}, {"date": "31 Aug 2020", "title": "Physical Therapy Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Novant Health (Charlotte, NC) in Oct 2016", "Interview Descriptions": "The application and hiring process was simple and quick. The one tricky part is that each company refers to this position as a different title. The interview for this position was rather informal, short, and about what I expected. The rehab supervisor at the time was phenomenal and very friendly, which is what made this interview such a good experience for me.", "Interview Questions": "What personal skills or traits would make you a good member of our team?"}, {"date": "26 Sept 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Novant Health (Charlotte, NC) in Sept 2016", "Interview Descriptions": "I met with the nurse manager of the unit.  Sat and talked with nurse manager one on one in the office. I was offered beverages and made to feel comfortable.  After an hour plus of talking, I was given a tour of the unit.  Very comfortable atmosphere and welcoming staff.", "Interview Questions": "History of schooling, experience in previous jobs, why I wanted to apply for the position.  Nurse manager shared with what the company has to offer it's employees."}], [{"date": "10 Sept 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Novant Health in Aug 2016", "Interview Descriptions": "Applied and received a call from the hiring manager 1 week later. I went to the interview and it went really well but the next day saw that the online site stated \"not accepted.\" This was a glitch in the website but I did get an offer that I accepted. Interview was pretty standard and the hiring manager was great but HR takes a while to respond.", "Interview Questions": "Tell me about a time you had to deal with a difficult patient/coworker."}, {"date": "5 Jun 2017", "title": "Pharmacy Technician CPhT Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health (Winston-Salem, NC) in Jul 2016", "Interview Descriptions": "It took nearly 4 months to be hired.  The interview process was very unpolished and unprepared. 1 telephone interview and 2 in person interviews. After not hearing from them for a month I called and was told they were glad I called because they forgot to call me!", "Interview Questions": " Why do you want to work for Novant?"}, {"date": "14 Jun 2016", "title": "Administration Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at Novant Health (Charlotte, NC)", "Interview Descriptions": "I was referred by an employee of Novant, I had my interview and it went awesome. He explained the job to me and asked if it was something I would be interested in doing.", "Interview Questions": "I was asked how comfortable I was with people "}, {"date": "10 Jun 2016", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Novant Health (Huntersville, NC)", "Interview Descriptions": "Called by HR to setup interview, scheduled next day w/ radiology manager. Interview was easy going. She told me about work culture, benefits, and advancement. Was asked about myself. My current position was asked in detail. She asked about my team and how we worked together. Also told me of the gentlemen who left and how he fit very well in the group.", "Interview Questions": "Tell me about yourself?"}, {"date": "23 Aug 2016", "title": "Assistant Vice President of Pharmacy Operations Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Novant Health (Winston-Salem, NC) in May 2016", "Interview Descriptions": "The phone interview was relaxed and positive.  I spoke with the recruiter several times over the phone, then set up a formal interview.  We had a very good back and forth during our conversations. I was able to ask the questions I had prepared, and the Novant rep was able to do the same.  Overall I thought the interview went very well.", "Interview Questions": "What were my expectations of this position"}, {"date": "29 Mar 2016", "title": "Patient Services Coordinator II Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2+ months. I interviewed at Novant Health (Huntersville, NC)", "Interview Descriptions": "I applied in December 2015 got a phone interview then was set up for a face to face interview in Jan  then another interview for mid Jan I didn't hear from them until mid February 2016 they have very poor communication skills they took forever to answer my emails and calls. I wouldn't want to work in a place that.", "Interview Questions": "What do you know about novant?"}, {"date": "27 Apr 2016", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Novant Health in Apr 2016", "Interview Descriptions": "Interview process was good. I applied on 4/15 and sent a email on 4/22 to set up interview. I interviewed on 4/25 with the Director. Was very comfortable with interviewer and she was very extremely knowledgeable of company which is what I liked. Was told I may be scheduled for second round interviews in a week or so. Fingers crossed, as I believed the Director was impressed with me. I have not been made an offer yet, which is why I selected the No Offer tab for now. I will update once I hear something.", "Interview Questions": "Looking back on the past, name one person who you wanted to grow up to be like and why, including one person you didn't want to be like and why."}, {"date": "24 Feb 2016", "title": "Medical Office Assistant/Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Novant Health (Louisburg, NC)", "Interview Descriptions": "one on one with manager of the clinic, introducing to doctors and staff, wanted  tell you about job your applying for, ask why should we hire you, telling me about there company what there requirements and what they expect of the position I'm applying for, discuss salary, hour time of work, 8 am- 5 pm they explain how you might not getting off work sometimes at work, discuss taking a drug test and back ground check talking with some of the doctors you will be working with", "Interview Questions": "tell them alittle about yourself"}, {"date": "20 Jan 2016", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Novant Health (Charlotte, NC)", "Interview Descriptions": "multiple interviews at multiple locations on multiple days, some were in person, some were on phone, very poor follow up, never heard from anyone at the company, only found out from a rumor", "Interview Questions": "Behavioral Based"}, {"date": "27 Jan 2016", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health (Charlotte, NC) in Jan 2016", "Interview Descriptions": "The interviewer was extremely nice and was very friendly. Overall the interview was laid back with typical interview questions. Nothing that was unexpected. She also gave me a tour of the unit. Most questions were based on background and how past experiences will help you with the current position being applied for.", "Interview Questions": "Why do you want to work in healthcare?"}], [{"date": "4 Jun 2016", "title": "PSC III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Novant Health (Charlotte, NC) in Jan 2016", "Interview Descriptions": "The interview went very well as expected.I was early for the Interview and this was helpful to the Office  Team Manager. I was in and out within 30 minutes. The office environment was welcoming and I'm glad i choose Novant Health to work for.", "Interview Questions": "N/A"}, {"date": "21 Dec 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health (Winston-Salem, NC) in Dec 2015", "Interview Descriptions": "Applied online, was called to set up a interview day and time, went in was told about the position what I would be doing, they looked over my resume and stated I was more then qualified and they would reach out to me the following week, the gave me a tour around the unit, and the following week I received a e-mail stating I was hired for the position", "Interview Questions": "Why do I want to work for Novant?"}, {"date": "3 Aug 2017", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Lexington, NC) in Dec 2015", "Interview Descriptions": "The interview process was pretty long, even thought I had worked for the company before, they asked a lot of generic questions, and I think the hold up in my starting date was HR. The orientation was long and boring.", "Interview Questions": "Where do you see yourself in 5 years with the company?"}, {"date": "11 Nov 2015", "title": "Patient Service Coordinator III Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Novant Health (Charlotte, NC) in Nov 2015", "Interview Descriptions": "The overall interview process was positive. The staff was friendly. I enjoyed the overall atmosphere of the office. Office manager as well as the office coordinator made me feel comfortable during the interview process.", "Interview Questions": "What stands you apart from the other applicants?"}, {"date": "9 Jul 2016", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health (Charlotte, NC) in Nov 2015", "Interview Descriptions": "I applied online. I got a call a few weeks (thinking it was two weeks) later to set up an interview. The interview was what I expected and the person interviewing me really made me feel like she was very interested me. She was very pleasant and welcoming to help me feel relaxed, so I could be myself during the interview.", "Interview Questions": "So explain to me what it takes to plan an event?"}, {"date": "21 Oct 2015", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2+ months. I interviewed at Novant Health", "Interview Descriptions": "They use pure behavior questions that seem to differ from person to person. Be prepared with detailed examples of real experiences that you can apply in their environment. Smart people that see through fake answers. Be genuine.", "Interview Questions": "tell me about a time you had disruptive trainees how did you handle it?"}, {"date": "19 Sept 2017", "title": "Physician, Family Practice Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Novant Health (Charlotte, NC) in Sept 2015", "Interview Descriptions": "Group interview over lunch with people coming and going. Disorganized.  Random questions led by 2 VPs, without about 15 people in the room listening,  No individual interviews with a variety of people.", "Interview Questions": "Why are you applying for this job?"}, {"date": "18 Sept 2015", "title": "Practice Manager III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health (Charlotte, NC) in Sept 2015", "Interview Descriptions": "Good interview\r\nI applied for the job online on August 12, 2015. I received a email on August, 29 to schedule a interview on September 2nd.\r\nI Met with the Regional Manager first and it was an awesome interview.\r\nThree days later I met with the VP and it was another great interview.\r\nOne week later I met with three Physicians and Im still waiting on an offer", "Interview Questions": "Do you have budgeting experience?"}, {"date": "8 Sept 2015", "title": "Medical Unit Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Novant Health (Charlotte, NC) in Aug 2015", "Interview Descriptions": "I applied to the job online through novant on 8/10 and received a call to interview 2-2.5 weeks later. The interview was very laid back compared to previous interviews. I interviewed with the head nurse/manager and another nurse in the L/D dept. The interview last approx. 30-40 minutes. They both asked me a total of 10 or so questions. The following day I sent my thank you email.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "20 Jul 2015", "title": "Adjunct Professor Anatomy and Physiology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Novant Health", "Interview Descriptions": "I was assessed by other professionals including the the academic adviser to demonstrate my teaching skills. I did show and lectured on the EKG. With a view that I was delivering to students. asking questions and answering questions as the interview went on I was considered legible for the position and I was employed.", "Interview Questions": "previous experiences I have encountered. What i would do with difficult students that includes slow learners or trouble shooters."}], [{"date": "9 Jul 2015", "title": "PAS/ED Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Novant Health", "Interview Descriptions": "It was truly a very difficult and trying process... there isn't much more I can add to this at this particular juncture.  The process was one which needs much preparation both physically and mentally not to mention emotionally.", "Interview Questions": "N/A"}, {"date": "29 Dec 2016", "title": "Trauma Response Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC) in Jun 2015", "Interview Descriptions": "Interview was welcoming, panel of peers and supervisors, comfortable. I was put at ease with warm personalities. I really wanted it to go well and was a bit nervous, but they eased me into questions and got to know who I am. I also got a look into each person's uniqueness and leadership styles.", "Interview Questions": "Who would be your priority patient in  pregnant trauma situation?"}, {"date": "10 Apr 2015", "title": "Tier I Help Desk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Novant Health (Indian Land, SC) in Mar 2015", "Interview Descriptions": "The managers were really pleasant and fun to talk with; they really wanted the personality and skills.  It was more on being able to work as a team with different backgrounds and methods to solve or at least have the ability to directed the issue to the correct department.", "Interview Questions": "Do I get stressed easily?"}, {"date": "3 Aug 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Novant Health (Charlotte, NC) in Mar 2015", "Interview Descriptions": "The same questions are asked at every interview when trying to switch within the company. Basically they want to know why you want to move within the company. They have a list of preprinted questions they will ask you. They vary between supervisor and managers being in the same interview to save time. More often than not, it is a behavioral interview.", "Interview Questions": "Why did you leave your last position."}, {"date": "18 Mar 2016", "title": "Safety Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Novant Health (Charlotte, NC) in Feb 2015", "Interview Descriptions": "go in and talk with a Nursing Supervisor, they ask a couple of behavioral interview questions, and ask a lot of questions to get to know you, if they show you around the hospital after the interview you basically got the job", "Interview Questions": "was there a time where you dealt with a upset customer, how did you handle them?"}, {"date": "1 Nov 2019", "title": "Cna1plus Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Novant Health (Salisbury, NC) in Jan 2015", "Interview Descriptions": "Up to 8 people to interview you in a closed office and review the floor after. Meeting the employees and get to talk to them about the hospital.  Then you get a second interview talking about salary and getting the job offered to you", "Interview Questions": "What do you love about the cna position "}, {"date": "27 Oct 2015", "title": "Referral Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Novant Health (Kannapolis, NC) in Nov 2014", "Interview Descriptions": "questions as to wanting to know if you are a quick learner and able to jump in to do referrals once being trained. what  made you want to transition to this position and will you want to transfer back to the bedside?", "Interview Questions": "experience that you have and what experience do you have in referrals and how familiar are you with the referrals process?"}, {"date": "23 Feb 2017", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Novant Health in Nov 2014", "Interview Descriptions": "My initial contact during the interview process was by email. After emailing for a while, a phone interview was set up. We mainly discussed my background and I spoke to only one person. Then another phone interview was arranged, this time with a group of people. The third and final interview was in-person. Each interview lasted approximately 30 minutes.", "Interview Questions": "Why are you interested in this position? Where do you see yourself in 5 years? On a scale of 1-10, how interested are you in this position? "}, {"date": "2 Jul 2015", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Novant Health (Winston-Salem, NC) in Nov 2014", "Interview Descriptions": "Pleasant and professional atmosphere and welcoming interviewers.  I met with over 15 employees, approximately 3-5 at a time for around 30 minutes each.  They asked tough, but relevant questions and explained the duties of the position in great detail.", "Interview Questions": "How would you handle a confrontation without immediate access to a supervisor or manager?"}, {"date": "26 Oct 2015", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Novant Health (Atlanta, GA) in Oct 2014", "Interview Descriptions": "I discussed my experience and the needs of the organization with Rev Cycle training manager and current HIM ID for ROI.  They asked about my experience with Epic materials and the Credentialed training process which I have a great deal of experience with.  I understand that I would work on the upgrade lessons, training CT and preparing for training end users while the new HIM ID would attend Epic classes and complete her certification.  This worked out well because I was able to help her prepare for her HIM ID role while learning more about Novant Health.", "Interview Questions": "How would you handle users who need extra help."}], [{"date": "12 Sept 2014", "title": "Patient Service Coordinator III Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Novant Health", "Interview Descriptions": "A Novant health practice Coordinator contacted me by telephone to request an in person interview. I was contacted approximately five business days after I completed an online application for this position. An in person interview wad scheduled within three business days and a follow up interview with another management team nine days later.", "Interview Questions": "why I chose Novant  health. More specifically why I chose that practice and it's specialty."}, {"date": "3 Aug 2014", "title": "Patient Services Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Novant Health", "Interview Descriptions": "I applied to Novant Health online and within a week received a phone call from the clinic that had the opening.  I was asked if i could go in that same day.  The interview went well, I was asked the basic questions.  \"where do you see yourself in 5 years?\" \"what appeals to you about this positions?\"  etc.", "Interview Questions": "Why do you want to work for us"}, {"date": "20 Jun 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Novant Health (Winston-Salem, NC) in Aug 2014", "Interview Descriptions": "After applying was approximately  2 months before called to interview. After the interview however, recieved an offer within the week. Was unable to start right away because corporate orientation only 2 times a month. A little disorganized with computer training class. Sent to the wrong  location twice. And  training in a different location everyday.", "Interview Questions": "What strengths will you bring to our organization"}, {"date": "25 Oct 2018", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Novant Health (Salisbury, NC) in Aug 2014", "Interview Descriptions": "Asked me basic interview questions. Then I was asked to provide relatable experiences in my life. The hiring manager stated that she was drawn to my personality so she selected me to be a part of the Float Pool.", "Interview Questions": "When was a time that you experienced with a difficult co-workers"}, {"date": "31 Jul 2014", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Novant Health in Jul 2014", "Interview Descriptions": "The hiring process took about a month from the time I applied to when I received a call back.  Once I received the call from the hiring manager, I had an interview right away, which was easy.  I received an offer three days later.", "Interview Questions": "Scheduling"}, {"date": "18 Jun 2014", "title": "Patient Services Coordinator III Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health (Huntersville, NC) in Jun 2014", "Interview Descriptions": "I've actually interviewed with this company 5 times, and the interviews are not too bad. Usually you meet with the Manager first, and then peer interview to follow with 2-4 peers. Just frustrated and sad that I can't get an offer after 5 interviews and 132 applications submitted. I've been told I interview well and I'm qualified for the positions I apply for down to a tee. Feels like a waste of time, sometimes.", "Interview Questions": "How do you deal with a co-worker that is not easy to get along with?"}, {"date": "30 Apr 2015", "title": "Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Novant Health (Charlotte, NC) in Jun 2014", "Interview Descriptions": "Took a while for the manager to get back to you.  Process went smoothly afterwards.  I had a phone and a skype interview.  I met with the team the first day on the job.", "Interview Questions": "Are you willing to relocate"}, {"date": "8 Jul 2015", "title": "Pcs Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Novant Health (Winston-Salem, NC) in Apr 2014", "Interview Descriptions": "Went on line and applied got a call the next day for the interview process. Went in for interview and had to wait 20 minutes they did apologize for the wait. Interview process was fairly easy and they made me fill at ease. Never got a call back", "Interview Questions": "Have you ever put quanity before quality"}, {"date": "1 Apr 2014", "title": "Secretary/NA I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health (Salisbury, NC) in Mar 2014", "Interview Descriptions": "I interviewed for a Secretary/NA I position in Critical Care, but during my interview was asked if I would rather interview for a position in Behavioral Health. They scheduled an interview the next day where I met with the Clinical Nurse Lead for the unit.\r\n\r\nThe interview consisted of questions that were mainly testing my crisis management skills, ability to work through issues that may arise in the work place, and why I wanted to work with the company.", "Interview Questions": "What skills have you gained from you experience?"}, {"date": "24 Feb 2014", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at Novant Health", "Interview Descriptions": "Two months after I applied for a position, I was called by a recruiter to do an initial phone interview.  The recruiter forgot our appointment, I had to call her after waiting 15 minutes after our scheduled time.  During the phone interview it was obvious the recruiter was doing something else besides engaging in a conversation.  An good example, I stated I supervised 21 people, she interrupted and asked me if I had supervisory experience.  Obviously someone was not listening at all!\r\n\r\nTwo weeks later I got an email about scheduling a second interview in person.  I responded to the recruiter’s email about my availability.  It has been two weeks since I have heard back from the recruiter and a week past when the interviews were supposed to be held. If the company chose not invite me to a second interview, that is fine, but have some courtesy and let a candidate know instead of leaving them dangling.", "Interview Questions": "The most difficult issue I had with the interview was the person conducting the interview.  I was less than impressed with her ability to communicate effectively, not to mention her lack of professionalism."}], [{"date": "14 May 2014", "title": "Patient Access Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health (Haymarket, VA) in Feb 2014", "Interview Descriptions": "Applied online.  Received a phone call from the hiring manager within one week.  Had 2 telephone interviews and asked me to come in for face to face interview.   I could not do the face to face interview on the managers chosen day, she promised to call back with alternate dates.  She left one message and never returned any of my calls.", "Interview Questions": "How do you deal with difficult people."}, {"date": "19 Jan 2014", "title": "Nurse Navigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Novant Health", "Interview Descriptions": "Once your application had been screened by recruiters in Human Resources it is forwarded to the hiring manager who then contracts you for an interview. Your offer for employment comes from the HR Department and they also conduct salary negotiations.", "Interview Questions": "I began my tenure with the organization in an entry-level, non-clinical role. During my interview fir the Nursing position I currently hold, I was asked, \" What did you learn on that first job that you can apply to this role?\" I thought that was an excellent question."}, {"date": "31 Oct 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Novant Health (Charlotte, NC) in Jan 2014", "Interview Descriptions": "I was an HR intern for six months and the Supervisor gave a lot of behavioral questions-such as give me an example of a time when you impressed a customer with your service? Another question was give me an example of a time when you handled an angry customer. The interview had 2 phases: one interview with the Manager of Talent Acquisition and one with a recruiter. Overall, it was an easy interview. The team was very warm and welcoming.", "Interview Questions": "Give me an example of a time when had to break the rules in order to achieve a goal. "}, {"date": "2 Nov 2013", "title": "CNAI Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health in Oct 2013", "Interview Descriptions": "After applying a million times I finally got a call to do an interview. I went in and the only questions I was asked were why did I want to work at novant and what did I do at my last job. We never even went into much detail with either, the nurse basically started a conversation with me about how they were revamping the hospital and how she was trying to get her staff on board and how she had to fire some folks to make way for ones with better attitudes.  Then we went on a tour. She let me know her expectations for her staff and i thought she was the kind of person i would like. Im glad she didnt ask me too many questions anyway, i can always do without the stress. After that I had to go to hr and do a background check. Once it was completed I got the offer. Im assuming that by as many applications I have sent there in my whole life, which I would estimate upwards 1000,  the fact that I only got one call means they probably already knew they wanted to hire me. I didnt know anyone in novant so ive never been able to get a hookup in getting on even though I have been a cna for 11 years and a steady employment history and pretty good resume. I think someone had mercy on me and actually looked at my application for what it was without being told to by someone internally. Thank goodness, finally.  I have heard this practice happens in most hospitals.  You have to know someone to get on!", "Interview Questions": "why do you want to work at novant"}, {"date": "22 Mar 2015", "title": "Central Scheduling Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Novant Health (Winston-Salem, NC) in Oct 2013", "Interview Descriptions": "The interview was pretty cut and dry it was all of the supervisors interviewing me.  They asked me questions like why do you want to leave your current job and what kind of relevant experience do you have for the positon.  They gave me a tour of the facility.", "Interview Questions": "Why do you want to leave your current position?"}, {"date": "9 Jul 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Novant Health (Charlotte, NC) in Oct 2013", "Interview Descriptions": "The interview process was short. This was for an entry level position, therefore I didn't go through various rounds of interviews which would have happened if I were applying for a clinical position or a position that required more experience.", "Interview Questions": "What is it your looking to accomplish by working here?"}, {"date": "9 Sept 2013", "title": "Operational Improvement Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Novant Health (Winston-Salem, NC)", "Interview Descriptions": "Interview process was good.  HR processes were poor, they did not understand that people from outside healthcare had different benefits.  PTO was poorly explained (I had no idea that holidays were not paid, but covered under PTO, relocation package was laughable, and I was not treated as a professional in the offer process.", "Interview Questions": "N/A"}, {"date": "1 Sept 2013", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Winston-Salem, NC)", "Interview Descriptions": "Applied online, got called for an interview. Was interviewed by a peer panel, was told to let me know next week, but was never called or heard from ever again.", "Interview Questions": "All questions were basic, kinda what you expect during any other interview. None were difficult."}, {"date": "20 Jul 2017", "title": "Operations Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC) in Sept 2013", "Interview Descriptions": "The interview process was a waiting game. But once the interview was scheduled it moved smoothly. I sat down in a panel style interview and the directors were extremely nice and welcoming.", "Interview Questions": "Tell us of a time you had to go against the norm and eventually have a process changed?"}, {"date": "26 Oct 2014", "title": "Safety Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Novant Health (Bolivia, NC) in Sept 2013", "Interview Descriptions": "Just basic behavioral questions, mostly ethical type questions. A few can be: tell me about a time you failed & how you handled it, tell me about your proudest achievement, you make a serious mistake on the job -- what do you do to rectify the situation?", "Interview Questions": "Tell me about a time you failed and how you handled it"}], [{"date": "28 Apr 2015", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Novant Health (Winston-Salem, NC) in Sept 2013", "Interview Descriptions": "I was an internal hire. So, I'm sure It's different. I applied, talked to the talked with the manager and landed an interview after getting referrals. First round was the manager and fellow coworker; I had second round of interview with the P.I. and afterwards got hired.", "Interview Questions": "name a time where you had to deal with a  difficult boss or coworker. how did you handle it."}, {"date": "4 Dec 2013", "title": "Pct Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC) in Sept 2013", "Interview Descriptions": "Long process took over 5 months to be contacted for interview after application was recieved", "Interview Questions": "N/A"}, {"date": "17 Oct 2015", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health (Haymarket, VA) in Aug 2013", "Interview Descriptions": "When you get called in for an interview, you are interviewed by all the department's managers. I was interviewed by about 5 different people. It may not be so many since a lot of them left for other opportunities...They all will take turns asking you interview questions. Then they call you about 2 weeks later to offer you the job and let you know when orientation starts. The training is about 1 month or more I don't really recall. But it's EXTENSIVE.", "Interview Questions": "Tell us about a time you had to deal with a difficult patient?"}, {"date": "1 Aug 2013", "title": "Surgical Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Novant Health", "Interview Descriptions": "The hiring process is lengthy.  You may have more than one interview and the second interview is likely to be a peer interview with several staff members.  The screening process is very thorough which is good.  Once an offer of employment is made, you will be scheduled for a urine drug screen and then scheduled for your first day in orientation.  The initial orientation is about 2 days depending on your job.", "Interview Questions": "I always have a tough time answering the question:  Why should we hire you?  Or, what are your strengths and what are your weaknesses?"}, {"date": "18 Dec 2014", "title": "Sec/Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Novant Health in Aug 2013", "Interview Descriptions": "I thought the interview went well. I was offered the same salary that I had been making however a year later my salary was cut 10% because although my duties were added on to in some areas they were decreased in one other. At times I did not feel as though the person was listening to me as an individual but instead just a run of the mill warm body to fill a spot. I have excellent references and work ethics and am proud of them.", "Interview Questions": "I did not feel that I was asked a question too difficult. I felt very prepared for interview."}, {"date": "21 Aug 2013", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health (Winston-Salem, NC) in Jul 2013", "Interview Descriptions": "The 'job fair' was like speed-dating; you had just a few minutes to grab a nurse-manager's attention and get them to invite you back for an 'in-depth' 15-minute interview later in the day.  The nurse-managers/units that chose to be involved were at tables in a large room; the 100-odd candidates scattered & stood in line to give our pitch to our chosen units.  We had about 45 minutes to talk to as many as possible.", "Interview Questions": "There wasn't really time for them to ask questions."}, {"date": "21 Nov 2015", "title": "Allied Health Professional Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Novant Health (Winston-Salem, NC) in May 2013", "Interview Descriptions": "Interview was very rushed, was told I had the job in the first 5 minutes of the interview. Manager was very personable, but could tell she was overwhelmed by department, duties, etc. Was in an office that I could tell need severe updates.", "Interview Questions": "What opportunities are you expecting to attain within your first year, if hired?"}, {"date": "20 Apr 2014", "title": "Phlebotomist/Processor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Novant Health (Huntersville, NC) in Mar 2013", "Interview Descriptions": "Manager is fair and equitable. He always brings peers in to get their input and also expects demonstration of skills.", "Interview Questions": "Where do you expect do be in three years?"}, {"date": "16 May 2016", "title": "Materials Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Novant Health (Manassas, VA) in Mar 2013", "Interview Descriptions": "Went great! Everyone was very nice and friendly. Did not \"scare\" me away. Questions that were asked we not hard at all. I received a tour of the hospital during my first visit. During my second interview I received another tour and meet the rest of the employees in the department.", "Interview Questions": "Why did I choose this type of job?"}, {"date": "24 Jan 2013", "title": "Practice Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health", "Interview Descriptions": "Initial interview was with Director of Ops and Special Ops rep. Reviewed my qualifications and overall job requirements and responsibilities. Never mentioned the issues with the provider and that I would be the 5th manager in less than 2 years- this definitely would have been a red flag for me to RUN as fast a a could from accepting the position if offered.", "Interview Questions": "Very interested in my knowledge if the corporation as I lived in Greensboro and the main offices were located in Winston Salem. I was glad I did my research prior to the interview."}], [{"date": "3 Dec 2012", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Charlotte, NC)", "Interview Descriptions": "slow, took forever for them to get act together", "Interview Questions": "none, they wanted me, just could not get their stuff together "}, {"date": "16 Aug 2016", "title": "REG NURSE Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Novant Health (Matthews, NC) in Oct 2012", "Interview Descriptions": "very nice experience no computers, it was face to face.It did take several weeks and many phone calls later to get an interview. back the there were not computers you did everything by paper and fax machines. I was lucky that I had a friend that worked there and she helpped me get my foot in the door and get an interview with the charge nurse in the OR.", "Interview Questions": "they asked about my extensive OR expirence"}, {"date": "8 Aug 2015", "title": "Coding Education/Auditing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Novant Health (Charlotte, NC) in Jul 2012", "Interview Descriptions": "Brief, talked about barriers, fairly new department. Sat with VP and newly hired manager to discuss job ideas . Process was frustrating overall, however pay was good. I was not impressed with the interview, staff seemed desperate to fill positions.", "Interview Questions": "How would I handle a difficult trainee?"}, {"date": "3 Sept 2013", "title": "Anesthesia Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Novant Health (Manassas, VA) in Jun 2012", "Interview Descriptions": "Interview Went Smoothly as expected. they asked mainly about patient care and first response in an emergency situation . ask about mainly the task at hand.", "Interview Questions": "How Would You Deal With Diversity. "}, {"date": "18 Apr 2015", "title": "Radiology Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Novant Health (Charlotte, NC) in Nov 2011", "Interview Descriptions": "Very professional and informative. A good process that had a clear job description and did not waste time. The supervisor took me on a tour of the facility, I met other employees, and observed the workplace. I learned a lot and was able to easily transfer positions within the company.", "Interview Questions": "Describe an area where I had a conflict with a co worker and how did I handle it."}, {"date": "6 May 2015", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Novant Health (Winston-Salem, NC) in Mar 2011", "Interview Descriptions": "Not a good one, people were rude, quick to judge, did not list to answers.  They were wanting to get out as soon as possible and some did leave.", "Interview Questions": "How many children do you have, how old are they, are you married, where did you go to school"}, {"date": "5 Sept 2011", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Novant Health (Charlotte, NC) in Oct 2010", "Interview Descriptions": "It went quick.", "Interview Questions": "Tell me about your experience."}, {"date": "6 Aug 2010", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Novant Health (Charlotte, NC) in Jul 2010", "Interview Descriptions": "It was very short.   I was an employee referral.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "28 Dec 2013", "title": "Patient Registration Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health (Manassas, VA) in Aug 2009", "Interview Descriptions": "2 phone interviews.  In person interview with 5 interviewers (2 of which would have worked for me).  Panel interview lasted closed to 90 minutes\r\n\r\nAfter the panel interview I was instructed to go to a different building to take a couple of tests.  (behavioral, trustworthiness etc.)  That was another 2 hours of time.\r\n\r\nI received a call the next day and was asked if I could return.  When I asked about a time frame, the interviewer asked why I would care how long it took.  I explained that the 5 hour interview the day before left me wondering what else could possibly be required.  Needless to say, we parted ways at that point.", "Interview Questions": "I was asked about my desired salary while in the interview with 2 subordinates.  I recall saying, \"I am happy to discuss a salary commensurate with my experience should an offer be intended,\" The panel insisted on a salary and I was really thrown off-guard by that when considering 2 of my staff would know my salary"}, {"date": "23 Apr 2013", "title": "Buyer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Novant Health in Jul 2009", "Interview Descriptions": "Initial interview with HR. Typical interview, typical questions, engaging interviewer and easy to talk to - know the company and its mission before walking in. Be prepared for behavioral questions and answers and be able to specifically defend resume with valid real life examples and numbers.  Second interview with hiring manager, did not say but a few words as she talked the entire time. She had canned questions, on a form she created, asked questions and wrote down answers on sheet. Easy second interview.", "Interview Questions": "By hiring manager, not HR - \"how do you cook a hot dog?\""}], [{"date": "8 Sept 2012", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health (Charlotte, NC) in Oct 2008", "Interview Descriptions": "Completed application online, was sent generic response the a call came to set up a time to come in and take a test. After that was called a few days later for an interview with the recruiter, then a second interview was scheduled with the managers - 5 at once.  Said they would contact me if interested in hiring..call came a few more days later with an offer.", "Interview Questions": "Nothing unusual, just a bit nervous interviewing with 5 managers at once."}, {"date": "31 Aug 2012", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health (Winston-Salem, NC) in Feb 2008", "Interview Descriptions": "They called for interview, I went. Interview went well, they said they'd be in touch in a couple of days. They said I had the job. 3 weeks went by, nothing. I talked to a nurse friend of mine that worked there and she asked them why they hadn't hired me. They said I had withdrawn my application. I finally did get the job tho.", "Interview Questions": "Why do you want this job? "}]]