[[{"date": "29 Nov 2021", "title": "Cosmetology Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Virginia College", "Interview Descriptions": "Teaching for Staff, License up to date and Interview with Director and President . Being able to attend a training in designated location. Be sure to be aware of all duties that are required for the position and able to meet all deadlines for needed materials.", "Interview Questions": "Why you want to work here"}, {"date": "1 Jul 2019", "title": "Nursing Program Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia College (Telephone, TX) in Dec 2018", "Interview Descriptions": "It was a telephone interview asking about my educational background and experience. It also asked how to deal with difficult students. How to diffuse conflict in the classroom. This interview also focused in on how the process of classroom management", "Interview Questions": "How to handle struggling students?"}, {"date": "1 Nov 2018", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia College", "Interview Descriptions": "Phone interview, Face to face with Program Director, Subject related teaching presentation, interviewed with campus president, completed phone screening,  submitted official documentation of credentials, campus tour was provided, and invite to return to complete paperwork", "Interview Questions": "What is your overall teaching style?"}, {"date": "1 Oct 2018", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Virginia College (Knoxville, TN) in May 2018", "Interview Descriptions": "The director made me very comfortable during the process. He stayed in constant contact through the entire process and gave adequate updates on my processing. I meet the Dean and the President and they were super people.", "Interview Questions": "Describe your teaching style?"}, {"date": "2 Nov 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Virginia College", "Interview Descriptions": "The process is Ideal  interview process. Personnel was  Straight forward and inviting. I had three interviews total including a Meet-n-Greet with the Campus President. Professional Atmosphere with Great Employees.", "Interview Questions": "Name a time when you had to be assertive."}, {"date": "21 Mar 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia College (Greenville, SC) in Mar 2017", "Interview Descriptions": "Very formal. I met with the Admissions Manager for the first interview. The second interview I met with the Regional Manager and the Campus President. They are upfront about their expectations, and the position. Great atmosphere, and the staff made you feel welcomed while you waited and during the process.", "Interview Questions": "I was asked about My Previous Position, Experience, and how it would help me be successful in the position in which I applied. Very Formal Interview. "}, {"date": "22 Apr 2017", "title": "Career Development Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia College (Greenville, SC) in Mar 2017", "Interview Descriptions": "Good initially bad 2nd interview with a distracted president whose phone kept ringing. Didn't seem interested so I got nervous. No follow up or return calls and they communicate via email during interview", "Interview Questions": "What would you tell people about VC?"}, {"date": "28 Dec 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia College in Dec 2016", "Interview Descriptions": "I was hired at my first interview from my resume. The interviewer did most of the talking. It was the easiest interview of my career. I don't think I was asked anything other than what my availability was.", "Interview Questions": "When can you work?"}, {"date": "24 Oct 2016", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia College (Lubbock, TX) in Oct 2016", "Interview Descriptions": "Applied online a week prior to being call in for an interview. Went in for the interview and found that it was a group interview. We were given information about the company and position. The group interview was fine but we were all told that everyone would be contacted for individual interviews the next day. No phone call came and I received a generic email from VA College stating they were not moving forward with me. Please be honest and don't tell people that they will have the opportunity  to have a one on one interview if it isn't true.", "Interview Questions": "They asked if anyone knew the history of Virginia College"}, {"date": "21 Sept 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia College (New York, NY)", "Interview Descriptions": "Had a phone interview.  Was then asked to come for a formal interview and to teach a mock class with some of the other professors.  After the presentation, feedback from the professors in the mock class, and we reviewed logistics of the position and potential schedule.", "Interview Questions": "Why would you like to teach here?"}], [{"date": "20 Jun 2016", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia College (Pensacola, FL) in Jun 2016", "Interview Descriptions": "Completed on line application followed by a phone interview followed by the interview sending an email link. Email link contained  an inventory to be completed. Interviewer provided a number to contact the main office if I had any question prior to the date they reported they would be contacting me back with results within the next 14-21 days.", "Interview Questions": "Discussed and question history working as a counselor working with schools.\r\nInquired about working with difficult customers and problem solving.\r\nInquired about education history and degrees."}, {"date": "3 Sept 2020", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia College (Birmingham, AL) in Mar 2016", "Interview Descriptions": "The interview process was not traditional and was done with a representative that I would not be working closely with who did not understand the job requirements nor the position. Unfortunately, there is no doubt that VC did not handle employees nor students well as they are no longer in business.", "Interview Questions": "Are you able to work on holidays and weekends, although no one will be in the office? "}, {"date": "23 Jan 2016", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Virginia College", "Interview Descriptions": "The hiring process was simple. I met with the Director and discussed my experience and briefly discussed the position in which I was applying for. The manager made me feel comfortable. We discussed my decision why I was leaving the company I was working for at the time. I also met with other employees in which they conducted Peer interviews. I was able to discuss with the employees additional things go that I did not discuss with the manager to have a more personalized experience.", "Interview Questions": "How well do I work under pressure to meet goals."}, {"date": "9 Oct 2015", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at Virginia College (Charleston, SC)", "Interview Descriptions": "After recruiter contacted me, it took 3 months and 3-4 interviews to make a decision. I had several phone interviews with several people. They were wanting to fill the position in by a certain date, but was not concerned about me having to relocate and time to find a place to live.", "Interview Questions": "Tell me about yourself?"}, {"date": "26 Feb 2017", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at Virginia College (Huntsville, AL) in Oct 2015", "Interview Descriptions": "I received an email from the Academic Dean asking if I was still interested in the position - she was new and I had applied months earlier and heard nothing.  She then asked me to teach a \"trial lesson\" - about 10 minutes covering a Sociology topic of my choosing.", "Interview Questions": "The \"interview\" was basically a trial lesson in front of 4 of the campus leaders.  They took notes, asked questions about the lesson as well as my approach to teaching."}, {"date": "12 Sept 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Virginia College (Jacksonville, FL)", "Interview Descriptions": "Met the president for 5 minutes talked more about himself then passed me on to a program director which led to a demo teach. I got awful reviews and later learned the panel consisted of non health related people. After getting hired I found out that no one gets good reviews during that process and the program director says to staff \"they need people for a demo teach but we don't want to hire them anyway\"", "Interview Questions": "I was asked if I was a sports fan specifically a football fan?"}, {"date": "20 Aug 2015", "title": "Admission Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia College (Austin, TX)", "Interview Descriptions": "I had to complete three interviews. One was a one on one with one of the Manager's the next was a group interview and the final interview was with the president.", "Interview Questions": "Basic interview questions were asked. "}, {"date": "11 Aug 2015", "title": "Campus Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia College (Jacksonville, FL) in Aug 2015", "Interview Descriptions": "First I got an email requesting a phone interview. The person who interviewed me was the one who held the position previously. She was very pleasant and first asked me to describe myself and my experience. Then she explained a lot of the responsibilities that the position requires. At the end of the conversation we set up a face to face interview with the campus President. This interview started out about the same, asking me to describe myself and my experience. Again the position was explained to me and I was asked if it was something I was up to. There were none of the typical \"what would you do in this situation\" interview questions. I simply filled in while the position was explained on the experience and qualities I had that aligned with the job. Afterwards I sat down with the Dean of the college and basically went over my experience again. Everyone was extremely pleasant and had positive attitudes. I never felt nervous or uncomfortable talking to anyone. The entire process was great and made me feel very positive about a potential future with the company and the people I would be working with.", "Interview Questions": "The main question asked by everyone was, \"Tell me about yourself and your experience.\""}, {"date": "8 Jun 2016", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia College (Savannah, GA) in Jul 2015", "Interview Descriptions": "Short telephone interview, followed about a week later by an interview in person with the Librarian (about 45 minutes). We discussed my job history/education and the Librarian outlined the job for me, also discussing my thoughts/reactions to the job. We were then briefly joined by the Dean of Academics.", "Interview Questions": "How did I feel about the College's aim to change the world one student at a time."}, {"date": "18 May 2015", "title": "Learning Center Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Virginia College", "Interview Descriptions": "After my phone interview, I interviewed with the previous Learning Center Manager and then met with the Academic Dean.  The entire hiring process took about a month.  I called once a week to check on my status until I was told I got the job.", "Interview Questions": "\"Tell me a little about yourself\""}], [{"date": "9 Nov 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Virginia College (Chattanooga, TN) in Apr 2015", "Interview Descriptions": "Three interviews, one with the campus president, one with a regional director, and one with the current career specialist to see about personality fit. The one with the campus president was on campus. The one with the Regional Director was a video conference. The one with the career specialist was also on campus.", "Interview Questions": "How do you define success?"}, {"date": "17 Apr 2019", "title": "Director of Programs Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Virginia College (Huntsville, AL) in Mar 2015", "Interview Descriptions": "Recruiter contacted me to explain the opportunity and the several locations that were available or coming available.  Extensive phone interviews at Corporate and Campus levels ensued over the next six months.  Oral psychological testing.  Two Campus interviews resulted.  I declined first location (Huntsville, AL) due to inappropriate questions by Campus President.  I accepted offer from second location that included relocation allowance.  Travel to both interviews were reimbursed.", "Interview Questions": "Would your wife be willing to move?"}, {"date": "20 Oct 2014", "title": "Work Student Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Virginia College", "Interview Descriptions": "Very intense interview with specific questions on timeliness. Performed in a professional manner. Friendly and professional greeting followed by a series of questions. Once the onboarding process began and the paperwork was complete I was made to feel right at home.", "Interview Questions": "Tell me a little about yourself."}, {"date": "3 Oct 2014", "title": "Financial Planning Officer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia College", "Interview Descriptions": "1) Apply online\r\n2) Phone interview with 3rd party\r\n3) Interview on site with department management\r\n4) Background Check\r\n5) Offer Letter through e-mail\r\n\r\n(For me specifically, Step 2 was scheduled but never happened, so I stopped by the office to introduce myself and inform the hiring manager that I never received a call. I had an impromptu interview with her as well as a tour of the facility, then later has the phone interview with the 3rd party. After passing the phone interview an on-site interview was scheduled where I spoke with the hiring manager and her supervisor.)", "Interview Questions": "Give an example of a time when you dealt with a difficult customer/client."}, {"date": "26 Apr 2015", "title": "Academics Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Virginia College (Birmingham, AL) in Sept 2014", "Interview Descriptions": "I submitted my application online.  They called me about a week or so later.  They scheduled me for an interview.  I went in to interview.  I did well in the interview.  I followed up with the interviewer who stated HR should have submitted my offer letter by now.  I waited and received an offer letter about two weeks later.", "Interview Questions": "how would you handle an irate customer"}, {"date": "6 Aug 2014", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia College", "Interview Descriptions": "The interview process took about a week. The supervisors seem to look for personality than other things. The process is not hard they are looking for people they can communicate with on a daily basis. Further, they want someonet that will present a positive role-model for the students. If you fit this category apply for a position with Virginia College!", "Interview Questions": "What do you plan to do within the next year?"}, {"date": "23 Oct 2018", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Virginia College (Columbus, GA) in Aug 2014", "Interview Descriptions": "very relaxed and wanted to ensure you were a good fit. Asked a variety of different questions that pertain to dealing with a variety of people. It was not intimidating at all.", "Interview Questions": "give example where you had a difficult situation"}, {"date": "3 Jul 2015", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Virginia College (Jacksonville, FL) in Jul 2014", "Interview Descriptions": "I was called in for an interview by the Enrollment Coordinator and had an interview with the Director of Enrollment. There was also a phone screening after the face to face interview. After a few days, I had to meet with the Campus President for another face to face interview.", "Interview Questions": "How do you think you would do with driving your own business?"}, {"date": "7 Mar 2016", "title": "Student Finance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Virginia College (Columbia, SC) in Jun 2014", "Interview Descriptions": "The interview process was fairly  smooth once started. I received  a call on a random  day (Sunday) to set up an phone interview. Once this time was set, I received  a call on that scheduled  date and time. The interview  lasted an hour. This was followed by a face to face interview that was with one person.", "Interview Questions": "What are your weakness?"}, {"date": "14 May 2015", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Virginia College (Austin, TX) in May 2014", "Interview Descriptions": "First there is a phone interview (personality questions) full of what if scenarios from corporate.\r\nIf you pass that, then you get an in person interview with the Director of Enrollment and a brief introduction to the campus and the President (who is great at the Austin campus I might add).", "Interview Questions": "How you would relate to a student who has been in foster care all of their life and they really have just decided that now is a good time to start school?"}], [{"date": "9 Apr 2014", "title": "Adjunct Networking Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia College", "Interview Descriptions": "I applied online and got a call the next day to come in and do a \"practice teach\" later on that week. I did my presentation on my certifications in front of the lead instructor, program director, and another person from a different department. Next, I did an insight phone interview where they asked situational questions and guaged my willingness to help students that are falling behind and generally working with difficult students while still teaching other students who are on track. The next time I came in, I was expecting to watch the instructor teach to get a feel for the environment and expectations however, the syllabus had my name on it and that class was my class. The lead instructor did teach my first two classes and help me get the resources I needed to get started. I think it went so fast because I am a previous employee from a different department.", "Interview Questions": "How would you handle teaching students from varing skillsets such as where some students work in the field and others do not know how to turn on a computer?"}, {"date": "21 Feb 2016", "title": "Dean Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia College (Birmingham, AL) in Apr 2014", "Interview Descriptions": "Interviewed with several corporate level academicians. Questions on investment in education, leadership skills and styles, integrity, accreditation, and instructional experience. Next was an interview with HR, which consisted of a verbal situational and personality type test. This process has been replaced by something electronic called the Berke. After the HR portion, an interview with the campus president occurs on the campus or via teleconference, depending on location.", "Interview Questions": "Why do you want to work in career education? "}, {"date": "9 Dec 2014", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Virginia College (Knoxville, TN) in Apr 2014", "Interview Descriptions": "It was the basic interview process plus recommendations from faculty and Program Director. It was an informal interview. More of a behavioral and also examination of my academic success and work ethic associated with academic success.", "Interview Questions": "How do you see your skills applying to the Position"}, {"date": "29 May 2014", "title": "Adjuct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Virginia College (Tulsa, OK) in Mar 2014", "Interview Descriptions": "Several interview, one including a class audit where the class rated me. Verified all past academic degrees and was very thorough in the entire process. They were sensitive about conflicts with my current employer.", "Interview Questions": "There really wasn't one. The best was the class audit where the students asked me questions."}, {"date": "27 Apr 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Virginia College (Columbia, SC) in Mar 2014", "Interview Descriptions": "Process was fairly quick and deliberate. Ended up placing an application in January and I was hired on in April. Went through several phone interviews, a multiple question assessment and and live instructional opportunity.", "Interview Questions": "There were no unexpected questions. I prepared a lesson for the benefit of the current Dean so they could assess my potential to teach at Virginia College. This is my first time teaching."}, {"date": "26 Feb 2015", "title": "Adjunct Business Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Virginia College (Spartanburg, SC) in Mar 2014", "Interview Descriptions": "The interview was normal until after when I gave a finance presentation (my specialty) one of the two people who were present, was invited to attend as a staff member (the college site compliance person, among other responsibilities he has as I came to understand later), walked out whispering and chuckling..couldn't tell why he couldn't act professionally for few minutes).  Later on during the semester he harassed me over an overseas transcripts from 30 years ago which were permanently out of reach of course.", "Interview Questions": "They asked me if I could teach an additional course."}, {"date": "2 Apr 2014", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Virginia College (Birmingham, AL) in Feb 2014", "Interview Descriptions": "went through face-to-face interview with admissions director then phone interview with their HR consultant and never heard from them again-- very unprofessional considering I'd already come in personally", "Interview Questions": "would I be able to make the transition from outside sales"}, {"date": "17 Apr 2015", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Virginia College in Nov 2013", "Interview Descriptions": "went smooth. was interviewed by director. while in lobby , was discouraged from position by other employees. Felt very secure going in. Used online site to gain more insight and information about what the company represented. Feels as though I was sold a position to change lives, but instead the position was to harass people about coming to school.", "Interview Questions": "What is your personal experience in their work environment?"}, {"date": "14 Jan 2017", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Virginia College (Biloxi, MS) in Nov 2013", "Interview Descriptions": "Long interview. I was introduced to team members and given a tour. I sat with another admissions rep and was allowed to ask questions. The hiring process was very lengthy and drawn out. It was 2 months before they called me for an interview", "Interview Questions": "Why are you a good fit for the position"}, {"date": "7 Apr 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Virginia College (Augusta, GA) in Oct 2013", "Interview Descriptions": "It took 3 interviews in person and one phone interview. They interviewed twice and afterwards there was at least 8 weeks before they called back; this time for another interview. Afterwards they scheduled a phone assessment/interview. The entire process took over 3 months, I had been looking elsewhere at the same time. I took both jobs and dropped with this one after working for a short time due to bad overall working conditions and lack of consideration for the student experience on the part of the school. I should have known from the unnecessarily lengthy interview process that is was not cut out to be very positive.", "Interview Questions": "How would you keep students from dropping out "}], [{"date": "14 Jun 2016", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Virginia College (Richmond, VA) in Oct 2013", "Interview Descriptions": "I was interviewed during the startup phase. I was asked to do a teaching demonstration in a tiny conference room with minimal equipment. Then I responded to a number of questions from a script while the Dean typed out notes on her computer.", "Interview Questions": "What is a difficult situation you have had to deal with and how did you handle it?"}, {"date": "30 Sept 2015", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia College (Jacksonville, FL) in Jun 2013", "Interview Descriptions": "Submitted an application online. They contacted me to take a phone personality profile evaluation followed by a phone interview. Finally a face-to-face interview with key management. The overall experience was positive. The interview questions and phone evaluation were easy. I did not find any of the questions difficult and I'm not that great at interviews.", "Interview Questions": "They each asked questions you would expect covering what interest you have in the job your applying for and what experience you have."}, {"date": "14 Feb 2016", "title": "Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Virginia College (Augusta, GA) in Jun 2013", "Interview Descriptions": "I interviewed with 10 people to get I job I didn't really want.  Wasn't on the top of my list of companies at the time. I really didn't want to move to Augusta but I was up for the adventure.  I had 3 face to face, 6 teleconference and 1 phone interview.", "Interview Questions": "mostly leadership questions; ironically"}, {"date": "9 May 2013", "title": "Student Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia College", "Interview Descriptions": "Good", "Interview Questions": "How long do you see yourself with the company?"}, {"date": "8 May 2013", "title": "Admissions Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Virginia College (North Charleston, SC)", "Interview Descriptions": "The interview process was lengthy and given by \"professionals\" across the country.  The first phone interview was a random call, unscheduled.  Then I was emailed a written assessment test.  After the written assessment test, there were two more SCRIPTED phone interviews, another being an oral assessment test very similar to the written.  \r\n\r\nAfter \"passing\" those, I was scheduled an in-person interview with the Director of Admissions and the President of the North Charleston location.  I had to reschedule my interview for an unexpected issue and after numerous calls and emails to the Director were not returned, I realized that this for-profit college was not a place that I desired to work.  I felt the Director was very unprofessional with no follow up call or email.  Reading other online reviews, I assured myself that it was only a telemarketing position with unattainable goals.", "Interview Questions": "What would make you unsuccessful?"}, {"date": "31 Mar 2013", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Virginia College", "Interview Descriptions": "3 step. 1st call came at 9:20pm to set up an interview call and that surprised me", "Interview Questions": "Written test on personality "}, {"date": "14 Sept 2015", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Virginia College (Tulsa, OK) in Mar 2013", "Interview Descriptions": "The interview process was long.  First i attended a group interview.  It was very odd.  Then I was called for a face to face interview.  It was a normal interview.  Then there was a phone interview that you had to do.", "Interview Questions": "Can you relate to different types of people."}, {"date": "15 Nov 2017", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Virginia College (Columbia, SC) in Feb 2013", "Interview Descriptions": "Interviewed with the campus president, very friendly and informative. Took me on a campus tour and introduced me to the college leadership. The campus was very nice and the job duties described interested me more in the position.", "Interview Questions": "How well do you work with non traditional students "}, {"date": "9 Jul 2014", "title": "Communications Adjunct Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia College (Florence, SC) in Feb 2013", "Interview Descriptions": "Very standard, had to present and teach for a few minutes. It was overall basic, had to take a personality test ect. that was challenging, but overall it wasn't very bad and it was worth it.", "Interview Questions": "Why did I want to work there."}, {"date": "30 Jan 2013", "title": "Admissions Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Virginia College", "Interview Descriptions": "It was fairly easy. An initial phone interview with a 3rd party company with basic questions, then on campus interview that was standard. Nothing out of the ordinary.", "Interview Questions": "They were fairly standard. "}], [{"date": "25 Jan 2013", "title": "Student Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Virginia College", "Interview Descriptions": "The interview was very standard and brief. No tricky questions.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "17 Jan 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia College (Austin, TX) in Dec 2012", "Interview Descriptions": "There was a group interview and a tour. We were asked questions about why we wanted to do this job. They seem like they really like go getters and people who are going to have a solid work ethic. I was asked about my sales experience and how I like to deal with people.", "Interview Questions": "Are you a competitive person who likes a challenge?"}, {"date": "5 Feb 2016", "title": "Academic Dean Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Virginia College (Birmingham, AL) in Sept 2012", "Interview Descriptions": "During the time I was there the interview process just exploded into this extensive testing and evaluation procedure. There is some value in this method but I was there when one of the tests were being developed and the employees that were chosen as the \"base\" for the desired responses were not choices I would have made. The employees were selected based on their relationship with the senior management at the time instead of the desired traits being measured.", "Interview Questions": "Behavioral questions were the norm when I was hired"}, {"date": "11 Mar 2013", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia College (Richmond, VA) in Jun 2012", "Interview Descriptions": "Two Interviews, One Demonstration with Program Director and 2 other instructors.  Pretty basic, you have to demonstrate your competency to deliver a quality instruction to the students.", "Interview Questions": "How would you handle a fight in the classroom?"}, {"date": "25 Jul 2015", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Virginia College (Orlando, FL) in Apr 2012", "Interview Descriptions": "Generic Interview, with testing in MS Office proficiency for managers.   Psychological testing to determine if better suited for management or faculty. Several follow-up conversations with management at the local and corporate levels.", "Interview Questions": "How would you resolve a dispute between students and faculty?"}, {"date": "1 Apr 2015", "title": "Admissions Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia College in Apr 2012", "Interview Descriptions": "There was a group interview to narrow down the large quanitity of applicants. We were interviewed all together in a hotel conference room by a hiring team not directly related to the campus or position we were applying for. They asked basic interview questions and asked how we would handle various scenarios.  A few days later I was notified that I was selected for a phone interview which was handled by an outside contractor and consisted of the basic personality questions and several open-ended questions to elicit a response to various scenarios.  Finally, I was notified that I was selected for a one-on-one interview with the actual director of the department I was applying for and with one of the hiring individuals from the group interview.  The director of the department was very nice and easy to interact with, and it was a good opportunity to try to make myself stand out from the long list of other applicants.  Overall, it was very organized and fast, with only a couple days passing between each of these interviews.", "Interview Questions": "What does change mean to you?"}, {"date": "1 Feb 2012", "title": "Accounts Receivable Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Virginia College (Savannah, GA) in Jul 2011", "Interview Descriptions": "I applied online. It took a month for them to contact me. I was contacted by the manager of the department and not by human resources, which doesn't really exist here. I interviewed with the manager, she asked me standard questions about my background, she described the position to me and told me about the hours (which she hadn't decided on just yet). Then she asked me if I could handle this sort of position (more like collections). After the interview she had me fill out more paperwork for a background check. Then after a week, I was called to interview with the President of the college. I spoke with him and he asked me some questions about my personality and background, trying to get some insight and then he asked if I had any questions. Four days later, I was contacted and offered  the position. No one is hired unless the President of the college approves; he doesn't decide the salary and hours (Manager does) but he has to approve it.", "Interview Questions": "How would you perform these duties if you were to be hired today?"}, {"date": "24 Aug 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Virginia College (Columbia, SC) in Mar 2011", "Interview Descriptions": "I submitted a resume' and did an online application, followed by a phone interview and a teaching assignment ( I had to present a topic to several members of the faculty. the dean, program director and some administrators). it was a good experience and after teaching the lesson I had to field questions from the panel.", "Interview Questions": "N/A"}, {"date": "3 Sept 2014", "title": "Nursing Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Virginia College (Pensacola, FL) in Jul 2010", "Interview Descriptions": "Describe what areas of healthcare you have worked in.  How many years have you been a nurse?  Do you have teaching experience?  The interview process was overall nonstressful due to the fact that I had already been working as an adjunct instructor.", "Interview Questions": "When was there a time that you had a conflict with a co-worker  and how did you resolve it?"}, {"date": "27 Apr 2010", "title": "Admissions Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Virginia College (Tampa, FL) in Oct 2009", "Interview Descriptions": "online application & test, 3 separate 1-on-1 interviews, 2 weeks training, 90 day probationary period", "Interview Questions": "Why should I hire you?"}], [{"date": "18 Dec 2013", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Virginia College in Aug 2009", "Interview Descriptions": "Phone interview with HR. Panel interview,  if you pass all of that they will invite you to a testing", "Interview Questions": "testing can be difficult its not like your regular personality test"}, {"date": "26 Jun 2013", "title": "Lead Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Virginia College (Huntsville, AL) in Jan 2009", "Interview Descriptions": "I was hired with one interview", "Interview Questions": "Where do you see yourself in five years?"}]]