[[{"date": "24 Jul 2019", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Lakeland Health (Saint Joseph, MI) in Jul 2019", "Interview Descriptions": "Hiring process was quick and efficient, however, initiation was tedious and dawn out. Life is interesting, we all share the same needs, however, nobody is promised tomorrow. It is because of this we must reach for the stars and achieve as much as we can.", "Interview Questions": "Problems encountered on previous jobs."}, {"date": "1 Feb 2019", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Lakeland Health (Saint Joseph, MI)", "Interview Descriptions": "Applied online and received a call from the recruiter soon after. She asked basic questions about why I was interested in the position and my previous work experience. She told me she would pass me along to the unit manager. Received a call from the unit manager within a few days and set up an in person interview. Toured the unit and then the manager explained the position and asked a few interview questions after I explained my previous work experience. Received a call the next week to set up a peer interview, similar to the unit manager interview.", "Interview Questions": "Strengths/weaknesses"}, {"date": "7 Jan 2019", "title": "Customer Service Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Lakeland Health", "Interview Descriptions": "I'm not sure but I think that I have more than enough time working with the hospital and my background is very good I have spent a lot of time working with the public I have good relations with people in general I would like to have some time to sit down and talk with you about how I believe that I would be a good fit in the lakeland family.", "Interview Questions": "can I work full-time"}, {"date": "16 Nov 2018", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Lakeland Health", "Interview Descriptions": "There wasn't a long process. This is a volunteer position. They were just looking for dependable people who enjoy giving back to the community. Just asked a couple questions then they give you a packet, you sign some papers and that's it.", "Interview Questions": "Why do you want to work at Lakeland"}, {"date": "3 Sept 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Lakeland Health", "Interview Descriptions": "Simple. Had a phone interview and then an interview with the practice manager and another MA. Both were nice and easy to talk to. The practice manager gave me a tour around the clinic.", "Interview Questions": "Tell me about yourself"}, {"date": "19 Oct 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Lakeland Health (Saint Joseph, MI)", "Interview Descriptions": "Professional and welcoming.  The interviewer was not intimidating.  She appeared that she wanted me to become an employee with Lakeland.  I enjoy the process.  I would recommend anyone to this company.", "Interview Questions": "Why did you choose Lakeland? "}, {"date": "4 May 2017", "title": "Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lakeland Health (Saint Joseph, MI)", "Interview Descriptions": "The application is somewhat lengthy but I was able to save throughout so I came back to it. After submission I received a call within 2 days which I was very happy about to schedule an interview. Whole process took roughly 2 weeks. Loved meeting with the team, really solidified I wanted the job.", "Interview Questions": "About my background, work experience along with some situational based questions regarding past employment"}, {"date": "5 May 2017", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Lakeland Health", "Interview Descriptions": "Behavioral Event Interview process.  Initial interview via phone with HR followed by interview in person with manager and possibly interview with the team.  Can be a long process.", "Interview Questions": "Ask questions about situation and how you handle them."}, {"date": "5 May 2017", "title": "Coordinator Students & Observers Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lakeland Health (Saint Joseph, MI) in Aug 2016", "Interview Descriptions": "Since I was a current Lakeland employee at the time of my application for this position I only went through a two step process of  a manager interview and then a team interview. When a new candidate applies at Lakeland they will have to go through a three step process of phone interview, manager interview, and then a team interview.", "Interview Questions": "Tell me about a time you made a mistake, how did you handle it, and what was the outcome?"}, {"date": "17 Jun 2015", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lakeland Health (Saint Joseph, MI)", "Interview Descriptions": "There are three main steps- a phone interview, a one-on-one interview with management, and a peer interview. The phone screening is conducted by an HR representative and the peer and management interviews are conducted by lab personnel. The lab interviews are performed on the same day, along with a short skill assessment and tour. The whole process from application to offer was less than a month.", "Interview Questions": "Tell me about a time a supervisor put you in charge of a project."}], [{"date": "18 Jan 2015", "title": "Ultrasound Technologist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Lakeland Health (Benton Harbor, MI) in Nov 2014", "Interview Descriptions": "Had initial phone interview with HR. Then had followup peer interview with ultrasound dept. Asked multiple situational questions. Was never notified when position was filled, found out from outaide source.", "Interview Questions": "What are your future goals?"}, {"date": "15 Oct 2014", "title": "Hospitalist Physician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Lakeland Health (Saint Joseph, MI) in Jan 2011", "Interview Descriptions": "standard speak with recruiter then call a physician then site visit then job offer.  contract is take it or leave it...no room for negotiations.  very rigid leadership structure let me know what the work there would be like.  take it or leave it attitude: you are a drone!  Senior leadership was nice and professional in a very non-personal way.  Corporate culture was \"blah, blah rah rah let's all be happy together\" with no substance to the statements.", "Interview Questions": "none, very low-key and easy at the physician level"}, {"date": "27 Dec 2011", "title": "Client Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Lakeland Health (Saint Joseph, MI) in Jan 2011", "Interview Descriptions": "Interview consisted of the hiring manager talking mostly with the exception of asking pre-defined quesitons that were required.  Seemed as though hiring manager was interested in hiring his friends rather than the most qualified individual.  Also got the impression that this organizations offers very low compensation - would rather have high school graduates with little experience and pay them $10 and hour.", "Interview Questions": "Describle a time when you had to change your priorities to reach a goal."}]]