[[{"date": "23 May 2023", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Canadian Institute for Health Information (Toronto, ON) in May 2023", "Interview Descriptions": "I submitted an application online, HR reached out and gave me 24-hour notice for an interview, had one interview with department heads, and received an offer just a few days later.", "Interview Questions": "Most complicated data analysis you have done. Three qualities important to this role and how you present them. Example of working with multiple individuals/teams. Steps to analyze/interpret multiple indicators when you don't have a lot of direction."}, {"date": "10 Jul 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Canadian Institute for Health Information in Jun 2022", "Interview Descriptions": "Had a short screening call with the recruiter.  There was a written test that had to be passed in exactly 30 minutes right before the interview. I was interviewed for two positions without prior heads up. After 3 weeks I emailed twice to be informed of the decision without any feedback.", "Interview Questions": "Normal background question, nothing technical. "}, {"date": "6 Apr 2022", "title": "Research Analsyt Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Canadian Institute for Health Information", "Interview Descriptions": "The interview process started out promising. after final round they did not follow up for 3 weeks despite me emailing them several times.  There was an interview and then a written test. Once I submitted written test, no follow up. Weeks later an automated response of decline. No feedback.", "Interview Questions": "They asked both behavioral and technical questions. Written exam had questions on code"}, {"date": "22 Jun 2022", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Canadian Institute for Health Information (Ottawa, ON) in Jan 2022", "Interview Descriptions": "General questions about why you want to work there, your experience, and some follow up questions about your experience. 20 minute interview, also leaves you time for your own questions", "Interview Questions": "Tell me about your experience"}, {"date": "5 Dec 2021", "title": "Senior Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Canadian Institute for Health Information", "Interview Descriptions": "Standard interview questions, then a SAS/data analysis test which was not particularly difficult but it was one of those SAS tests where instead of trying to see if you think/can logic your way through a problem, they want to know if you've used a very particular procedure. If you have, then the test is super easy, if you haven't, you're out of luck.", "Interview Questions": "Explain your background, why are you interested in this role, walk us through a complex data analysis you've performed, Do you have experience with this and that. "}, {"date": "29 Nov 2021", "title": "Policy Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Canadian Institute for Health Information (Toronto, ON) in Nov 2021", "Interview Descriptions": "Submitted application on their website in July 2021, was contacted in Sept and interviewed in Oct. after six weeks of no contact and no replies I interviewed  again in Nov.", "Interview Questions": "What do you think are the immediate priorities are for this agency."}, {"date": "11 Jul 2021", "title": "Software Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Canadian Institute for Health Information", "Interview Descriptions": "technical round had 3 parts in total lasting about 90 mins.\n1st part was based on general technical questions about java web application development. 2nd part was about solving logical brain teasers and 3rd part was about solving some technical programming questions..i would say these questions were not too hard compared to what i had to face with bigger companies in the past.", "Interview Questions": "during first part, they asked about knowledge of spring dev and it was wide-ranging in scope so you had to know or had have good experience developing with spring."}, {"date": "11 Jun 2021", "title": "Communications Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Canadian Institute for Health Information (Ottawa, ON) in May 2021", "Interview Descriptions": "Due to COVID-19 restrictions, the interview took place over the Teams. The team was professional and asked situational questions based on past experience. The panel asked questions focused on traditional and social media experience. The role would work with both the media team and the digital team. \r\nBe prepared with examples of your experience and how you overcome any challenges. \r\nThe panel was fun, friendly and great to interact with.", "Interview Questions": "What is your experience working with different social media tools?"}, {"date": "23 Mar 2021", "title": "Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Canadian Institute for Health Information", "Interview Descriptions": "Easy standard questions friendly panel. There were 3 hiring managers. They asked questions related to the role. They were friendly and open to answering my questions as well. I would recommend applying here.", "Interview Questions": "Tell us about yourself and your qualifications for this role?"}, {"date": "5 Apr 2021", "title": "Application Architect Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Canadian Institute for Health Information (Toronto, ON) in Mar 2021", "Interview Descriptions": "The Interview was on videos call. The interviewer was an veteran architect of CIHI and his  Manager. There were no hands on technical question. There were not much technical questions too as such.", "Interview Questions": "Tell us about your experience with Redshift"}], [{"date": "16 Feb 2021", "title": "HR Generalist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Canadian Institute for Health Information", "Interview Descriptions": "A 15 minute phone prescreen and  1 hour interview . Interview panel of three, one was on a video call which caught me off guard. Interview overall went ok, they asked fair questions relevant to the job posting.", "Interview Questions": "What do you know about CIHI?"}, {"date": "13 Jan 2021", "title": "Resarch Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Canadian Institute for Health Information", "Interview Descriptions": "30 minute phone call with HR rep, to go over resume and skills. Standard behavioural questions to learn more about your data analysis skills and interest in CIHI. HR rep provided an overview of the job expectations and work environment, and stipulated that pending the managers review there would be a second more technical interview/test for the next step.", "Interview Questions": "Describe a situation where you managed a problem, and how you mitigated it?"}, {"date": "24 Sept 2020", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Canadian Institute for Health Information (Ottawa, ON) in Aug 2020", "Interview Descriptions": "The interviewers are very friendly. They don't ask too many professional questions, they expect me to ask them a lot of questions. So I asked about the work environment, what skills do I need to master", "Interview Questions": "what SQL software you are using"}, {"date": "13 Aug 2021", "title": "Solutions Architect Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at Canadian Institute for Health Information in Jun 2020", "Interview Descriptions": "The first hour is to have a technical written exam consisting of multiple choice questions and architectural diagrams on cloud technology\nThe second hour is to have face to face interview with the hiring managers via Microsoft Teams", "Interview Questions": "Behavioral interview question such as how to choose enterprise software.  Draw enterprise architectural diagram within 30 minutes"}, {"date": "9 Sept 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Canadian Institute for Health Information (Toronto, ON)", "Interview Descriptions": "Emailed application and heard back after 1 month. Had an in person interview and then heard back two weeks after that. In person interview was with 1 person IRL and 2 on Skype because of location of departments.", "Interview Questions": "Describe a challenge you've had previously executing research, what you learned, and how you overcome that challenge currently."}, {"date": "7 May 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Canadian Institute for Health Information", "Interview Descriptions": "Well organized, not too intimidating.  There was a writing test before that became the basis of the interview which was a great way to let the Candidate explore the themes they developed.", "Interview Questions": "What was one thing that I regretted in my past job performance. "}, {"date": "7 Jan 2019", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Canadian Institute for Health Information (Ottawa, ON)", "Interview Descriptions": "I had a initial phone interview followed by an in-house interview.  For the in-house interview the HR manager Skype in from Toronto.  The interview was simple enough and very straight forward, no surprise questions.", "Interview Questions": "Ask how you would handle difficult conversations, ask how you would describe integrity."}, {"date": "14 Mar 2018", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Canadian Institute for Health Information (Toronto, ON) in Jan 2018", "Interview Descriptions": "Interview was done via skype with the researchers in Ottawa (which was uncomfortable from the start).  Received an email and then less than a week later the interview was scheduled. Also had to do a test for SAS (one small aspect of the job posting so I was blindsided by this when I was invited for the interview- Silly because anyone can learn a software). Had to pay for parking at the Toronto office ($20).  I did not receive the rejection email for 3-4 weeks.", "Interview Questions": "How would you present technical content to a non-technical audience. "}, {"date": "18 Jun 2017", "title": "Programmer Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Canadian Institute for Health Information (Toronto, ON) in May 2017", "Interview Descriptions": "General situational and behavioral questions. prepare to backup with the  experiences. Its a pretty basic interview with general questions. But the process is really slow they don't reply back easily.", "Interview Questions": "a situation where you resolved conflict"}, {"date": "26 May 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Canadian Institute for Health Information (Toronto, ON) in Apr 2017", "Interview Descriptions": "Received a call from the recruiter, she confirmed if I am a right fit for the position or not. After that,  she organized an interview with the hiring manager.  It was a panel interview with the hiring manager and peers.", "Interview Questions": "1. Zero in about your project management experience.\r\n2. How would you convince the management about the importance of PM role"}], [{"date": "14 Jan 2018", "title": "Senior Analyst PICB Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Canadian Institute for Health Information (Toronto, ON) in Feb 2017", "Interview Descriptions": "Was invited for an interview standard behavioral and situational questions. Nothing really outstanding basically about experience. One should be careful I was interviewed there twice and I think they do \"fake\" interviews with a candidate internally selected already. Always ask about the circumstances why the position was open and why the internal candidates are not selected.", "Interview Questions": "Tell us about the time when you had to analyze big data"}, {"date": "27 Apr 2016", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Canadian Institute for Health Information in Apr 2016", "Interview Descriptions": "Interview was a panel of three individuals. The direct manager, the director of the program, and another individual involved in the project. Standard situational questions, asking for specific examples of times that I used certain skills. A couple of the skills that they asked me to account for were not mentioned in the job posting.", "Interview Questions": "Describe your experience using data models"}, {"date": "6 May 2015", "title": "Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Canadian Institute for Health Information (Toronto, ON)", "Interview Descriptions": "30 minutes HR interview was followed by one hour long in-person interview with the hiring manager. Resume was reviewed for experience. Offer was made after the salary had been negotiated informally.\r\nFinal negotiated salary was added to the formal offer letter. Interview process was good. I wish I had asked more questions about the working environment.", "Interview Questions": "Why do you want to join this org.?"}, {"date": "28 Apr 2015", "title": "Senior Java Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Canadian Institute for Health Information (Toronto, ON) in Apr 2015", "Interview Descriptions": "60 minutes test screening of people. 4 tests. Two logical tests with 5 questions each. Two technical tests. 60 minutes test screening of people. 4 tests. Two logical tests with 5 questions each. Two technical tests.", "Interview Questions": "Logical tests were basically word trick questions. Nothing to do with logic at all. It's like a game. You play a lot with these types of questions then you get better with it. If done first time it'll take you around 40 minutes for both tests. Technical questions were for someone who's in community college taking Java course."}, {"date": "28 Dec 2014", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Canadian Institute for Health Information", "Interview Descriptions": "There was just one interview - two people interviewed me. Variety of questions about statistical methods (i.e. standardization), epidemiology terms (sensitivity, specificity...) and leadership/situational questions. Asked about past research and work experience. Followed by a short SAS test (multiple choice, identify issues in code).", "Interview Questions": "N/A"}, {"date": "8 Aug 2016", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Canadian Institute for Health Information (Toronto, ON) in Jan 2015", "Interview Descriptions": "One hour interview on standard situational, behavioral, and technical questions, asking for specific examples (e.g., teamwork, writing experience), and one hour on SAS test (e.g. basic coding- finding errors and fixing).", "Interview Questions": "Questions regarding teamwork."}, {"date": "19 Dec 2012", "title": "Java/J2EE Permanent Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Canadian Institute for Health Information (Toronto, ON)", "Interview Descriptions": "I was informed 1hour written test on technical on java followed by 1 hr panel interview. In the written,it startd with a section of 13 tough logical reasoning questions(it was a surprise), and remaining on java.", "Interview Questions": " I scored only 45% in logical reasoning(unexpected section) and 70% in java. so they did not proceed to face2face interview as I scored less that 50%.  I did not like their attitude."}, {"date": "25 May 2014", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Canadian Institute for Health Information (Toronto, ON) in Oct 2012", "Interview Descriptions": "Rapid hiring process. Two interviews - first with two managers, then with the manager and the director. Asked to create an impromptu presentation (prep time was about 40 minutes). Kind and professional attitude.", "Interview Questions": "Impromptu presentation was challenging but keeping senses on the shoulders is a good strategy. "}, {"date": "20 Apr 2012", "title": "Senior Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Canadian Institute for Health Information (Toronto, ON) in Mar 2012", "Interview Descriptions": "Contacted by HR person. Had a short phone interview and was called for in-person panel interview consisting of 3 people (2 managers and the HR). Usual competency questions; asked to provide a lot of examples from past experiences. After the interview, I was given 1-hour skill test requiring to analyze in-house data. The interview was rather easy, but the test was difficult (was not familiar with the type of analysis I was asked to perform - its proficiency was not required in the job posting).", "Interview Questions": "How would you define a good team?"}, {"date": "1 Aug 2012", "title": "Software Developer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Canadian Institute for Health Information (Toronto, ON) in Jul 2011", "Interview Descriptions": "Interview comprised of two steps: An assessment test and an in person interview. First you will be invited to CIHI to complete an assessment test based on the job role. My Assessment test was based on Java and J2EE. After the test, depending on whether you pass or fail, you may be invited for an in-person interview with a technical staff and hiring manager.", "Interview Questions": "Mostly behavioral as asked by HR staff."}], [{"date": "9 Nov 2015", "title": "Senior Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Canadian Institute for Health Information (Toronto, ON) in Apr 2011", "Interview Descriptions": "Phone interview followed by computer test and in person interview.  The computer test is tricky but the in person interview is not difficult.  The in person interview consisted of mostly behaviour questions.  The process is really slow and it took two months from the day I got a call from them and the day I was offered a position.", "Interview Questions": "How did you deal with a  situation when there's a conflict between you and your coworker"}, {"date": "10 Aug 2010", "title": "Research Associate-type Position Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Canadian Institute for Health Information (Toronto, ON) in Sept 2009", "Interview Descriptions": "Interviews were easy enough, but the questions asked indicated that the interviewers did not really understand statisitcs or experimental design. \r\n\r\nThe skills test was kind of odd. It was a good idea, they provided some data and asked you to write up your impressions of it. But the data set was poorly selected, in that there wasn't much to be said about it. It was demographics on birth rate, but there were no outliers or patterns that invited speculation or interpretation.\r\n\r\nAgain, I'm not sure about the hiring managers' understanding of research.", "Interview Questions": "Why do you think your background makes you suitable to be a researcher at cihi?"}]]