[[{"date": "9 Mar 2023", "title": "Program Account Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mt. San Antonio College (Walnut, CA) in Mar 2023", "Interview Descriptions": "Written Exam (was asked to create a simple Excel chart) I was handed interview questions 30 minutes prior to interview. 45 min interview was with a panel of 4 people who took turns to ask the questions.", "Interview Questions": "1. What would you do if you witness a coworker offend another coworker."}, {"date": "16 Apr 2022", "title": "Non-Credit Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Mt. San Antonio College", "Interview Descriptions": "Interview in person, counseling method with four or five people on the panel for the first interview. The second interview was with the president. The Dean and Vice President pretty much knows who they are hiring at this time.", "Interview Questions": "N/A"}, {"date": "13 Oct 2022", "title": "Horse Trainer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mt. San Antonio College (Walnut, CA) in Apr 2021", "Interview Descriptions": "The interview process was very through. They asked a lot of questions regarding my knowledge and experience in the horse industry field. Overall I felt it was a very fair interview.", "Interview Questions": "Describe the steps you could take to evaluate the temperament of a horse to determine whether they would make a good candidate for the program."}, {"date": "4 Sept 2020", "title": "Writing Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Mt. San Antonio College", "Interview Descriptions": "Simple process - they ask you questions regarding who you are and how you feel about tutoring. They ask you to write an essay in 1 hour.  The interviewer was super sweet and understanding.", "Interview Questions": "What would you say to a student that is anxious about a class?"}, {"date": "28 Jun 2021", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mt. San Antonio College in Apr 2020", "Interview Descriptions": "Interview process included creating a visual aid or writing assignment and, to my surprise, getting the interview questions 30 minutes beforehand to prepare and write notes or responses to help me during the actual interview. Very big on equity and diversity so make sure you prepare for that one! Great experience!", "Interview Questions": "How has your past experience prepared you to be effective in an environment that values diversity and equity?"}, {"date": "6 Jan 2023", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Mt. San Antonio College (Walnut, CA) in Jun 2019", "Interview Descriptions": "The first part of the interview was an exam to test the applicant on knowledge of the subject they signed up to tutor. After the exam is graded, the applicant is taken into a room where three hiring managers ask him/her questions on how they would deal with certain scenarios with students. Lastly, one of the hiring managers tests your tutoring skills by acting as a student that needs help and you must help them through a problem.", "Interview Questions": "\"If a student got angry with you during a tutoring session how would you respond?\""}, {"date": "25 Jul 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mt. San Antonio College in Jan 2019", "Interview Descriptions": "It was more qualitative questions. They did not ask for past work experience. Focus on having stories that relate to your being a student and wanting to help out.  Do not be too worried because usually they are looking for candidates who can be professional.", "Interview Questions": "Do you work well with students?"}, {"date": "17 May 2018", "title": "Fiscal Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mt. San Antonio College", "Interview Descriptions": "First you must come in for a written test. Before the interview they will give you an excel test. Be prepare to do a simple v-lookup, sub total, pivots, ect\r\nPanel of 4 people\r\nOne-on-one with direct supervisor", "Interview Questions": "I can't remember the questions at this point, it has been a long time. Mostly to describe situations and how to handle them."}, {"date": "29 Oct 2018", "title": "Student Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Mt. San Antonio College (Walnut, CA) in Feb 2018", "Interview Descriptions": "Fill out paperwork with campus work program, secure a position, go for an interview where you meet with the employer to go over skills, department policies, and class schedule for availability.", "Interview Questions": "Why do you think you are good for this job?"}, {"date": "20 Apr 2016", "title": "Faculty Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Mt. San Antonio College (Walnut, CA)", "Interview Descriptions": "My interview involved three different stages scheduled over multiple days:\r\n\r\nStage 1: (a) Wrote a short essay on a discipline related topic (30 minutes); (b) read the committee interview questions and took some notes (30 minutes); (c) answered committee questions (50 minutes); (d) asked my own prepared questions (10 minutes).  [Positive experience]\r\n\r\nStage 2: Delivered a 25 minute teaching demonstration to 40-45 students in a campus classroom.  The committee assigned the topic in advance.  [Positive experience]\r\n\r\nStage 3: Met with two faculty members from the original search committee and an administrator via Skype (30-45 minutes).  [Negative experience]\r\n\r\nNote: You had to be advanced from one stage to the next.\r\n\r\nHere's what bothered me about interviewing at Mt. SAC:\r\n\r\n1. I don't think the administrator conducted herself in a professional manner during the third stage.  Instead of exploring my qualifications, she asked some tangential questions that came off like she wanted to find something wrong with me instead of getting to know me.  Next, when I spoke about relevant work experiences  that I believe the college would benefit from (e.g. course development), she appeared rather disinterested (e.g. looking away from the screen).\r\n\r\n2. Human Resources contacted my current supervisor before they decided who they wanted to offer the position to (note: this happened between stages two and three).  Needless to say, this created an awkward situation for me at the school where I currently teach.\r\n\r\n3. When Human Resources initially called me, they never mentioned that I would have to visit the campus twice.  Luckily, they made other arrangements to use Skype for the third stage (which I totally appreciated), but I had to inquire multiple times to confirm this would happen.  Also, I communicated with at least four different people in HR and I don't know how well they communicate with each other.\r\n\r\nTakeaway:\r\n\r\nI clicked with the search committee and my teaching demonstration went over well with the students, but I sense that the administrator made the final decision.  What's odd about this is that she never saw me teach a lesson.  You'd think that someone who's so concerned about students would want to see you in action.  Overall, I had a good experience with most of the people I encountered at Mt. SAC.  That said, I can't say I would apply if they have another opening because the leadership left me with a bad feeling about the whole process.", "Interview Questions": "Samples:\r\n-What about your education and experience prepares you for the position?\r\n-How do you stay current in your field?\r\n-What kinds of themes are important in the classes you teach?"}], [{"date": "18 Oct 2017", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mt. San Antonio College (Walnut, CA) in Mar 2016", "Interview Descriptions": "I applied online, and got a letter after 3 weeks to interviews. Interview place was in an officer. An interviewer came ask questions and about 30 mins.   A lot of people were on this interview.", "Interview Questions": "Tell me about your weakness. \r\nTell me about yourself. why do you think you would do well at this job?What motivate you to do the best on the job?What is your greatest strength? \r\n"}, {"date": "27 Oct 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mt. San Antonio College", "Interview Descriptions": "It was a typical interview process where I applied online and went on campus for the interview. It was a one round interview face-to-face and they gave me a call back within 1 week. It was a routine interview as it would be for any other tutor place. Keep in mind though that the student assistant position was for students with disabilities so they do like people who have a relevant experience towards interaction with these students.", "Interview Questions": "What is your greatest strength?"}, {"date": "1 May 2015", "title": "Student Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Mt. San Antonio College", "Interview Descriptions": "Basic interview questions dealing with group interactions, communication skills, and other basic skills. I had a one on one, but co-worker had a group interview. Come prepared and professionally dressed.", "Interview Questions": "What are your education/career goals?"}, {"date": "11 Sept 2014", "title": "Student Assistant III Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Mt. San Antonio College", "Interview Descriptions": "Process was very smooth. The supervisor looked at my resume and asked me several questions regarding my major of interest and what my future goals were. The supervisor was very friendly and we got along really well because he graduated from the school I was looking to apply after my time at Mt. SAC.", "Interview Questions": "Nothing too difficult, just basic behavior and leadership questions such as how will your current experience help us?"}, {"date": "28 Jul 2018", "title": "ESL Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Mt. San Antonio College (Walnut, CA) in May 2014", "Interview Descriptions": "you hear first hand about hiring from the managers of the program or a friend who works there who then encourages you to apply. then you will apply and be called in for an interview. after the interview you will be let known if you are offered a position.", "Interview Questions": "tell me a bit about yourself"}, {"date": "8 Jul 2017", "title": "International Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Mt. San Antonio College (Los Angeles, CA) in Mar 2014", "Interview Descriptions": "It is a group interview and almost all the interviewees are hired except one or two students. There were two persons in the room asking questions and interviewees answered the questions one by one. Questions are simple.", "Interview Questions": "What will you do if someone ask a question that you do not have the answer during a phone call?"}, {"date": "29 May 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Mt. San Antonio College (Walnut, CA) in Feb 2014", "Interview Descriptions": "I happened to have a family friend who worked for the counseling office which made obtaining the interview easy. Nevertheless, they still expect a level of quality from those whom they employ, so prior preparation is necessary.", "Interview Questions": "What level of customer service experience do you have?"}, {"date": "16 Aug 2013", "title": "Student Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mt. San Antonio College (Walnut, CA) in Aug 2013", "Interview Descriptions": "Applied online, received a call a week later for a one one one interview. Asked me what subjects I felt comfortable tutoring. Got a call the next morning and was offered the job.", "Interview Questions": "No hard questions really"}, {"date": "24 Sept 2015", "title": "Student Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Mt. San Antonio College (Walnut, CA) in Jun 2011", "Interview Descriptions": "They first contacted me through email and set up an appointment to interview in the LAC. I was interviewed by one person and then a second person came in. They asked questions why I wanted to be a tutor and how to explain some concepts. The questions involve how you would answer a question for a student rather than the actual content. Although it is necessary to have the knowledge of the material, it must also be conveyed in a way that is easy to receive.", "Interview Questions": "How would you explain the concept if a derivative to a student? Please show an example."}, {"date": "6 May 2015", "title": "Student Senate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Mt. San Antonio College (Walnut, CA) in Feb 2011", "Interview Descriptions": "4 hours community service then a 3 question interview. This specific job was a student senate position and they want to see that you are dedicated and committed to serve the students. Remember that you are representing the students and this is not a position of power, this is a position of service.", "Interview Questions": "What role did you apply for?"}]]