[[{"date": "7 Jun 2023", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at J-PAL (Bengaluru)", "Interview Descriptions": "There was an online application, after which I was invited to take the stata and case study tests, and then an interview with the Principal Investigators. It takes about a month for the entire process.", "Interview Questions": "Why do you want to join J-PAL?"}, {"date": "10 Jul 2023", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at J-PAL (New Delhi) in May 2023", "Interview Descriptions": "For an RA position at J-PAL SA, there might be a screening call first to understand whether you are ready to relocate to the project location and what would be your earliest joining date. Following this, a STATA/R test depending on project requirements, along with a case study on randomised evaluations will be sent to you on a mutually agreed day. You’ll have to solve these and send back within 48-72 hours. Following this, there would be a technical interview with the Research Manager, and then a final interview to understand fit with the Principal Investigator.", "Interview Questions": "1. Why RCTs? 2. Why J-PAL? 3. What are your plans for the next few years? 4. How would you randomly evaluate a nutrition scheme for school children in an Indian state? Which parameters would you use, at what level would you randomise and how would you determine the sample size."}, {"date": "9 Feb 2023", "title": "Training Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at J-PAL (New Delhi)", "Interview Descriptions": "There are 3 Rounds.\n\n1. Application test: 4 hour long test with written and technical assignments (based on RCTs and written communication)\n\n2. 2 Interviews: Fit round, why J-PAL, why training team, etc.\n\nTechnical Round: RCTs, weaknesses, explain it in simple words, convince someone to use an RCT", "Interview Questions": "why J-PAL, why this team"}, {"date": "31 Dec 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at J-PAL (New Delhi) in Dec 2022", "Interview Descriptions": "Stage 1: CV shortlisting Stage 2: Stata test and Case Study Analysis (This includes questions that test your knowledge of experimental research, RCT, data analysis, and communication skills) Stage 3: Interview with the Research Manager (some technical questions and motivation for the application) Stage 4: Interview with one/more than one PIs (some technical questions and motivation for the application)", "Interview Questions": "-Tell me about yourself and your background. -Why do you want to join J-PAL and why the development sector in general? -How has your past work/academic experiences nurtured you for this role? -Some case study questions. -Some research design questions based on contexts. -Some basic stata codes for data merging, t-test, string to float, etc. -What are your medium and long term plans? -How would you deal with issues like personal data loss during field survey?"}, {"date": "22 Mar 2022", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at J-PAL", "Interview Descriptions": "There were 4 rounds. Each interview was of one hour. It was a grt experience. The interviewers were quite nice and experienced people. Overall everything was good. It was great and the company is super cool.", "Interview Questions": "Why do you want to join it??"}, {"date": "4 Mar 2022", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at J-PAL in Feb 2022", "Interview Descriptions": "The selection process consisted of a statistics based test, and a case study. The statistics test was fairly lengthy, asking candidates to perform operations on a dataset. They asked to use STATA for the exam, but welcomed the use of other language(s).", "Interview Questions": "Data cleaning\r\nData operations\r\nRegression analysis\r\nCase Study"}, {"date": "15 Nov 2021", "title": "Field Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at J-PAL", "Interview Descriptions": "interviewer was polite, and the interview process went well and good ,nice job  if you live near office. if questions are just about our knowledge about the company.interviewer was polite, and the interview process went well and good ,nice job  if you live near office. if questions are just about our knowledge about the company.", "Interview Questions": "where you live?\nwhat is your qualification?"}, {"date": "21 Oct 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at J-PAL", "Interview Descriptions": "Terrible. Rude interviewer with wrong information about topics. Interviewer was also judgemental, kept interrupting, and asked personal questions. Also told me to consider switching my career path. Happy to say I now have a job in the same career path and didn't need to switch. Terrible individual, unsurprising that the position has been vacant for 8 months.", "Interview Questions": "Asked why don't you consider being a journalist instead?"}, {"date": "6 Sept 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at J-PAL (Mumbai) in Oct 2021", "Interview Descriptions": "Two rounds of interviews - one with the manager and the other with the PIs. The one with the manager is detailed whereas the one with the PIs - they want to know more about why do you want to do this job, etc.", "Interview Questions": "How is piloting different from the main survey? "}, {"date": "18 Sept 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at J-PAL", "Interview Descriptions": "Very very extensive interview process. Be willing to spend up to 3-4 months waiting for a hiring confirmation. Org is also quite hierarchical which reflects in the interview process as you proceed upwards. Overall they focus on excellence but slightly too picky.", "Interview Questions": "Depends on the role being hired for "}], [{"date": "7 Sept 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at J-PAL", "Interview Descriptions": "Was interviewed but didnot receive any intimation on whether I was selected for next round or not. Even after writing to them, did not receive any reply. Very unprofessional of J-PAL.", "Interview Questions": "N/A"}, {"date": "17 Apr 2021", "title": "Policy/Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at J-PAL", "Interview Descriptions": "The interview process in India was extensive. One round of panel interview with a junior member of the team and a fairly senior member. Thereafter an outgoing employee holding the position. A written test that went on for a couple of hours, and after that an interview with the Director of the unit. The thing is they were not clear about the number of interviews they will take or how long the entire process will last, and that was not conveyed. The HR seemed equally clueless. They never got back on the application rejection either, which was very disappointing given the amount of time spent on the entire process.", "Interview Questions": "The interview questions were fairly typical. Some were related to previous job experiences, others technical on J-PAL's work. \r\n\r\n"}, {"date": "9 Mar 2021", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at J-PAL", "Interview Descriptions": "Mainly 3 rounds. First up is a call by current RAs asking about the background and general interest. Then after the initial screening, one or more RAs ask questions about RCTs, econometric methods, few situational questions. In most of the interviews I gave, the RAs would rarely show any sort of interest and seemed to be just doing the interviews as some sort of compulsion .", "Interview Questions": "Internal vs external validity, identification strategies, RCT pros and cons et al."}, {"date": "26 Jan 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at J-PAL", "Interview Descriptions": "Phone interview, followed by case study and coding exercises. Phone interview had both technical assessment as well as personality test. There were also situational questions involved. Technical questions were about applied econometrics and development economics. Tell me about yourself question was obviously part of it.", "Interview Questions": "Tell me about yourself, case studies and development economics questions"}, {"date": "23 Mar 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at J-PAL (Tiruppūr) in Jan 2021", "Interview Descriptions": "Basic details about RCT, and behavioral questions. The interview was of average difficulty, but easy to prepare as the materials to do so are provided on the J-PAL website. The interviewer was very polite and went over the process in a cordial manner.", "Interview Questions": "N/A"}, {"date": "8 Jul 2019", "title": "Senior Manager, Policy and Research Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at J-PAL (New Delhi) in Jul 2019", "Interview Descriptions": "Two members on the interview panel, one policy and one research expert. Seemed more like peers than potential supervisors for the job. Hour-long interview. Questions mostly on fit for the job, broad understanding of the role, and several scenario questions to test skill in responding to different work situations; \r\nInterview was by Skype.", "Interview Questions": "Talk to us about interest in the role\r\nHow would you convince a senior govt person about research and policy\r\nScenario: meeting with senior govt. person who is disinterested in the work; how would you convince them?\r\nScenario: govt. person is transferred and their replacement is not interested in our line of work; how would you convince them?\r\nScenario: team members complain about another team  member not doing their work; how would you respond?\r\n"}, {"date": "16 Jan 2019", "title": "Intern Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at J-PAL", "Interview Descriptions": "I applied online. They took very long to respond. I was invited for a telephonic interview two months after I applied, and then it took a another two weeks for them to get back to me for a second interview, and then two more weeks for a final interview -- all over the phone. Questions were asked on RCTs, surveying etc. The interviewers were all friendly, helpful and wanted me to get the answer right. Much of it was like a conversation. I was told that I'd have to work for 6 days in a week, 9 hours (or longer) a day -- which I found ironical for an organization that conducts experiments on poverty and behavioural economics; they ought to have known just how much this affects employee performance and productivity.", "Interview Questions": "\"Explain some of the research projects you've done at college.\""}, {"date": "14 Jan 2021", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at J-PAL (Chennai) in Jan 2019", "Interview Descriptions": "Applied to a research internship process on their website, after two telephonic interviews, I was invited to a video interview with the team in the city I applied for. I got selected after this.", "Interview Questions": "What do you understand by RCTs?"}, {"date": "5 Sept 2016", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at J-PAL (Chennai) in Jul 2016", "Interview Descriptions": "Generally simple interview process. Began with 2 minute description of my resume, followed by questions on my basic knowledge of field research and data collection. This was followed by creative questions ie \"have you ever handled a problem In a creative manner?\" And questions on how I would handle certain scenarios. Interview concluded with any questions I had for the interviewers.", "Interview Questions": "What is a kernel? What is an enumeration?"}, {"date": "15 Apr 2017", "title": "Policy Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at J-PAL (New Delhi) in Jun 2016", "Interview Descriptions": "2 rounds of interview were conducted. The first round of interview tests the understanding on RCTs. The second round was a personal interview in which all the other details were covered", "Interview Questions": "knowledge about RCTs\r\nprevious work experience\r\nwhy J-PAL\r\nquestions on hobbies"}], [{"date": "17 Jan 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at J-PAL (New Delhi) in Dec 2015", "Interview Descriptions": "J-PAL follows a three month hiring cycle. \r\nSubmission of resume and case study followed by telephonic interviews by other research managers in Delhi.\r\nfollowed by interview with Principal Investigator of the study", "Interview Questions": "Are you familiar with stata?"}, {"date": "23 Jun 2018", "title": "Field Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at J-PAL (Patna, Bihar) in Feb 2014", "Interview Descriptions": "First check qualification certificate and take simple written test. If pass the written test then they take oral interview by their panel ( Mostly three person) after the interview they also brief about their organization and their work", "Interview Questions": "Tell me about your self "}]]