[[{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Good place to grow", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Jan 2022", "job_title": "Registered Nurse in Woodstock, IL", "duration": "N/A", "pros": "Nice people and very academic", "cons": "Salary could be far better"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "idiots run it", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "9 Aug 2022", "job_title": "Behavioral Health Specialist in Woodstock, IL", "duration": "N/A", "pros": "The medical staff hustles and is kind and helpful.", "cons": "any other floors operation outside of the psych floor, and is crass to everyone else. She acts week but is fake as ever. \nThe when you go downstairs there's some lady from an agency that they promoted. She's constantly crying over someone she slept with there and no work gets done. I guess they promote the idiots that will just say yes."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Salary", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "17 Mar 2022", "job_title": "Registered Nurse in McHenry, IL", "duration": "N/A", "pros": "Great team work with coworkers", "cons": "Frequent manager changes, required overtime, hard to get vacation time- had to find own coverage"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Feb 2022", "job_title": "Employee Wellness Coach in McHenry, IL", "duration": "N/A", "pros": "hours were flexible and great team", "cons": "greatly overlooked by corporate and higher ups"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Stay away", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Sept 2021", "job_title": "Customer Service Representative in Huntley, IL", "duration": "N/A", "pros": "None that I can think of", "cons": "Abusive management and lack of benefits."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "20 May 2021", "job_title": "Patient Registrar in Woodstock, IL", "duration": "N/A", "pros": "Good job, work was enjoyable, some of the people were great to work with", "cons": "Sometimes it felt like middle school. If someone said something about you, you'd get in trouble true or not. Couldn't trust management. Only advancement if you were in with the crowd"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Centegra Health System, corporate greed.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "29 Aug 2014", "job_title": "Medical Records in McHenry, IL", "duration": "N/A", "pros": "I worked for Centegra for almost 10 years.  In the beginning, it was great.  They gave fair raises, had pretty decent benefits and I was a satisfied employee.   It was really a dream job for the first couple of years.", "cons": "As time has gone on, upper management has slowly eroded what made it a smooth running, friendly place to work.  The bottom line, profit, has become the one and only purpose of Centegra, not patient care.  They have sacrificed patient care and the morale of their employees, all so the executives can pay themselves exorbitant bonuses.  They dissolved the entire medical records department and sold us, in toto, to a low paying, service rather than doing the right thing by paying us severance and unemployment."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Great Place", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Nov 2020", "job_title": "Budget Manager in Chicago, IL", "duration": "N/A", "pros": "Great people to work with", "cons": "Restructuring and an acquisition created uncertainty"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Centegra supports management that bullies and degrades their employees.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Dec 2013", "job_title": "Registered Nurse in McHenry, IL", "duration": "N/A", "pros": "I participated in many councils and led a system wide one. Had an impression this hospital was for their nurses....", "cons": "A new manager who was promoted to the role, dislike some of the current staff. Took advantage of the role by bulling and harassing employees. I was bullied frequently and ultimately fired (with my children present, which they knew would be with me) for \"not managing up the unit\", when I informed another employee I was unable to get a hold of anyone able to cover my lunch so I was going to run down and be right back. I was called in and harassed for 1 hour. HR was always made aware of each interaction. I was worked for more 15 days before I was called in on my vacation to be terminated for the above incident. I fought for unemployment and won. The judge agreed I was fired for reason other than what was on my termination paper. They appealed and again lost. Many others have be terminated and resigned for similar issues."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Run away . . . fast!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Jan 2016", "job_title": "Health Club Employee in Crystal Lake, IL", "duration": "N/A", "pros": "I worked at the health club facility of Centegra and the members are wonderful!  They made it worth working there each day.  A lot of the staff there were also friendly, helpful, and made working there fun!  I miss being there and all the people!  Also, a very generous PTO accrual each pay check!", "cons": "Management.  If you love being at work and not having a family or social life, then this is a place for you. Family doesn't matter to Centegra - work is the only thing that matters!  You have all this PTO and you can't even use it!  So at the end of the year, it's added to your  paycheck because you'll lose it if  it's not used.  The benefits stunk, too!  Expensive and not worth it!  You are  actually better off going on your own!  Also, if you want to make it there, you need to  do a lot of  brown-nosing to your manager!  If not, you are over-looked for job opportunities . . . regardless of whether  you are better qualified or have more seniority.  In the end, you put all this time and effort into your job, it's still not  good enough!  It's all about stroking egos!"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "MSN/FNP", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Sept 2017", "job_title": " in McHenry, IL", "duration": "N/A", "pros": "Taking care of my patients, sharing stories and making them smile", "cons": "THE EPITOME of nepotism cliques and :climbers: Its no surprise they are ^0,000 in the hole. They don't care about their employees- Magnet was a joke. They fired over 50 seasoned critical care nurses and replaced them with new grads. I wonder how much of those millions are lawsuits. Yet Mike Eesley gets paid > one million and thats w/o all his perks. He and his cronies have taken a hospital whose employees fought to provide excellent care and was again looked up to by the community, to being one of the worse hospitals in 4 counties in Northeastern Il. I have had my family members in as pts and  everything seemed to be a bother. Crappy attitudes, poor salaries ,poor knowledge base overall. Must be comforting to CHS that they supposedly have a low turnover rate- wonder what the real numbers show,,,,,HMMMMM Get rid of the current board, top heavy execs. Sound familiar  . The bullying techniques are bar none for at least 30 yrs. Trump"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Registered Nurse", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "9 Apr 2017", "job_title": "Registered Nurse in McHenry, IL", "duration": "N/A", "pros": "Pay is average for this area, tuition reimbursement plan is generous, easy commute from home, wonderful nurses and physicians to work with", "cons": "This is a very top heavy organization, many layers of upper management and plagued by blatant nepotism.  Building Huntley hospital was the CEO's pet project.  Now the health system has spent an exorbitant amount of money to build it and it still is operating well under capacity while the McHenry campus is busting at the seams.  Management asks for feedback (loves to send out multiple surveys, mailers and posters reminding you to take the surveys) but doesn't want to hear or address the negative feedback.  Many of us saw the opportunity to merge with Northwestern as a great thing but it seems to be on indefinite hold."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Disheartening to say the least.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "27 Mar 2014", "job_title": "Medical Records in McHenry, IL", "duration": "N/A", "pros": "I have been an employee for nearly 15 years.  I really have nothing good to say.  I really cannot think of any pros to share.  It was not like that 15 years ago.  \r\n\r\nThe upper management does not live the company values.  Compensation has gone down the tubes.  Perks, what perks?", "cons": "Outsourcing department(s) so you can save money... Really?  How does management define patient care?   All of you suits need to get out from behind those desks and see what it means to work.  You bring in people to cut jobs and destroy lives while you collect your big salaries.  Do you know how many  lives  ]you are destroying? You are  running the hospital into the ground at the expense of the patients and to the detriment of your employees.  I don't know how they look at themselves in the mirror every day.  They do not care at all about patient care. They do not live the values of the hospital."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Administration does not care about employees or safety of patients.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "18 Nov 2013", "job_title": "Registered Nurse in Woodstock, IL", "duration": "N/A", "pros": "It is close to home. There are caring employees that are trying to do the best for patients with the limited resources given to them by management.", "cons": "This company is very top heavy with administration. There is enough money for management bonuses and excessive administration salaries but not enough money for safe staffing and a computer system that works well.If any employee speaks up against unsafe practices ,their job will be in jeopardy.Nursing has no voice in decisions made by administration.Patient safety is extremely comprised while management claims to want to help the community and patients. Administration seems to only be concerned with padding their own pockets. I have worked here for a long time and I am very disappointed with the direction the company has taken.I can only describe the administration as corrupt.  I still work here only because it is close to where I live."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Administration", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Mar 2016", "job_title": "Anonymous Employee in McHenry, IL", "duration": "N/A", "pros": "McHenry County is limited in job opportunities.  This facility may offer a short drive for many people.", "cons": "As you have read by the many other reviewers , this facility has the worst management.  If you are intelligent and capable you will NOT want to send your resume here.  They are 10 years behind in technology and have no interest in investing in this facility.  The senior  management is a network of family and connected friends.  The COO reports to her daddy, the CEO.  That should say it all.  She hardly has to be competent because she certainly won't be fired.  Nepotism and the \"good ole boy\" network is the culture and style of Centegra.  That accounts for the high turnover and poor morale.  The business culture is full of  inefficiencies, poor decision making, discrimination, poor skill sets, and lack of motivation.  Run in the other direction--do not consider this place for employment. Check the ratings of other local hospitals and you will see a huge difference.  I am so glad I am no longer in the oppressive environment."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Constantly changing, not always for the better.", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Dec 2010", "job_title": "Data Analyst in Woodstock, IL", "duration": "N/A", "pros": "Company has the best/ sincere intentions to provide quality healthcare. They appear to be a financially stable company offering competitve salaries, aggresive growth plans generally leads to job security.", "cons": "Inconsistent senior managment. and aggresive growth results in tense work enviroment. Due to growth job responsibilites are constantly changing, and additional job responsibilites are constantly being added. while job descriptions and wages remain unchanged.\r\nTraining/educational opportunities are rare, making it difficult to keep up with all the changes.Cost cutting measures like the outsourcing of the IT dept, and freezing associate wage increases for six months have also lead to associate dissatisfaction."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Went Downhill Very Fast !", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Jun 2014", "job_title": "Patient Business Services in Woodstock, IL", "duration": "N/A", "pros": "The best thing about Centegra Health Systems, were the immediate people I worked with every day. The low on the totem pole type, the ones that did the work.", "cons": "The flexing of hours changed and you could only flex when it would benefit them. Ex: your dept is extremely busy for two or three days during the week, rather than PAY Overtime they MADE you leave early on another day. All that would do is make it worse for your co-workers on the day when you had to leave. Not right - Pay The OT - too cheap. For a NON-PROFIT Organization they would write off a lot of financial charity, but were also too cheap to pay OT. Too concerned about there bottom line and NOT the employees."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Making progress but need consistency", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Apr 2016", "job_title": "IT Services in McHenry, IL", "duration": "N/A", "pros": "Friendly work culture among Associates leads to developing strong bonds with co-workers.  Generally good opportunities for advancement assuming you are in a position where growth is part of that job profile.", "cons": "As other reviews has mentioned, too much of a perceived \"good ole boy\" network.  Sometimes hard to break into the \"club\" that typically forms in certain departments.  However, that awareness of being on the outside is not just specific to Centegra.  It just seems more pronounced that other places I have worked."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Registered Nurse", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "22 Nov 2016", "job_title": "Office Nurse in Marengo, IL", "duration": "N/A", "pros": "During the years I worked for Centegra, I was able to work hours that allowed me to accommodate  the needs of my family.  I feel that I was fairly compensated with my pay.", "cons": "CPC - Woodstock:  Over time, the emphasis in the office setting went from the patient to the computer, and what information could be obtained/entered into the computer.  The goal, however, was to spend as little time with the patient as possible, while requiring more and more data.  Rooming for more than one busy physician, was expected, but not reasonable.   Expected to do some jobs that I was not trained for, and in some instances when trained for, not given enough hours of work to maintain the skills learned."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Patient Care Tech", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Mar 2017", "job_title": "Patient Care Technician in Crystal Lake, IL", "duration": "N/A", "pros": "Great benefits, tuition reimbursement, and most of the other staff is willing to help. The unit I work on has a great atmosphere usually. We work as a team (mostly).", "cons": "Heavy work load and always short staffed. Can't seem to keep the people we hire. If you have a problem the manager makes it your fault. High expectations for the hard workers and little to no expectations for the lazy workers... in fact they neglect their patients and get away with it. Need more accountability for the lazy staff that does absolutely nothing ..."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "They don't follow their own mission statement, serving w empathy and compassionate care", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Jun 2014", "job_title": "Registrar in Woodstock, IL", "duration": "N/A", "pros": "They have a great tuition program for full time employees attending college.", "cons": "Management is cruel, and could careless of their employees. If you have any health related issues this is not the company for you. They have no empathy for the sick, even though they are a hospital, if you get sick say good bye to your job. There is a lot of bullying and cattiness. It's a terrible work environment. By far my worst experience at any job."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Centegra is a Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 May 2013", "job_title": "Anonymous Employee in McHenry, IL", "duration": "N/A", "pros": "Leadership takes a sincere interest both personal and professional growth. The work atmosphere is full of change and excitement, with a lot of opportunities. I feel that my job has meaning and it shows. Leadership recognizes accomplishments of Associates, and I have received hand written Thank You cards from Leadership (including the CEO) on several occasions\r\n\r\nCompensation and benefit programs are very competitive too.", "cons": "I cannot say anything negative about the organization. The healthcare industry is facing a rapidly changing environment, but I view it more of an opportunity than a negative."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "If you're family, friend or can kiss butt, you're golden here!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Dec 2015", "job_title": "Associate in McHenry, IL", "duration": "N/A", "pros": "Market comparison salary, ATO accruement for full-time employees", "cons": "Unless you are family, friend or a two-faced butt kisser...don't expect to be treated fair. \r\nThere are salary based associates who will work exactly 8 hours even when task/projects are not completed and that's ok while there are hourly associates who bust their butts to complete tasks and are plenalized for OT!\r\nAll the gossiping and back stabbing between employees in All departments...and this includes managers.\r\nThis healthcare system is trying to keep up with others by taking overnight online certifications, what a joke!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Great Place to Work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Jun 2011", "job_title": " in McHenry, IL", "duration": "N/A", "pros": "Pros--Strategic direction by senior leadership...we have certainly expanded since Mike Eesley came on board...and for the good!\r\nWe are focused on the main thing:  The PATIENT. \r\nWork Life Balance--I am able to take off the necessary time in order to maintain work life balance which I am sure cannot be said for some of our other competitiors", "cons": "Opportunities for promotion...its hard when you are a clinical person to seek other job opportunities which would increase your wages unless you decide to go into management. Unfortunately those opportunities are not always available.   That is not really a fault with Centegra per se, but with healthcare in general."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Organization is lead by fear & intimidation", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "8 Apr 2016", "job_title": " in Woodstock, IL", "duration": "N/A", "pros": "Great associates to work with.", "cons": "Administration is punitive & has totally unrealistic expectations as far as demands on associates.  Zero respect from Administration, they have totally lost touch with reality.  As they are making exorbitant salaries...associates are offered meager raises that don't keep up with the economy & due to raising benefit costs, we often actually make less than the previous year even with the paltry raise!  There are way too many layers of Sr. VP's & VP's....absolutely ridiculous!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Happy to be a Centegra Associate", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "22 Sept 2014", "job_title": "Anonymous Employee in McHenry, IL", "duration": "N/A", "pros": "Centegra's Associates, Physicians and other providers are very committed to providing the best care to community members close to their homes. They invest in advanced technology and Associate education so we can give our best to our friends and neighbors.", "cons": "It's a tough time to work in health care. Centegra has carefully planned to meet the needs of the community while adjusting to changed reimbursements. The new rules are making us all better, but there is a lot of change in the industry right now."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Woodstock ER Tech", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 Aug 2015", "job_title": "Senior Nurse Tech", "duration": "N/A", "pros": "A few nice people to work with.", "cons": "Very predatory environment as dictated by mid to upper level managers. Patient care is of very little concern, which one might think to be unusual in a healthcare environment. Nurses are gossipy and back-stabbing, and are more concerned with department politics and covering their butts. Nurses and nurse managers are like schizophrenic bullies, and play favorites to create a discriminatory, preferential environment where the good perish, and the politicos are held in high esteem."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Passionate and caring Associates", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 May 2013", "job_title": "Human Resources in McHenry, IL", "duration": "N/A", "pros": "Working for an organization that literally lives their values on a daily basis is not just motivating, inspiring but creates a great enviornment. It's refreshing to work with a team that cares so deeply about the community they serve. Being apart of something truly special and unique in McHenry County is totally AWESOME!", "cons": "I can say anything negative. Every place has it's \"hiccups\" but when people are committed to the same end goal it makes for a great place to work!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "losing sight of mission", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "16 Sept 2014", "job_title": "Physician in Woodstock, IL", "duration": "N/A", "pros": "smaller system\r\ntrying to anticipate the changes in healthcare\r\nfriendly, hard working staff on patient care levels from nurses and aids to janitors and cafeteria people", "cons": "inbred, top heavy administration\r\nafraid of criticism/ hires \"yes\" people\r\noverextended/ financially unstable"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "NOT THE RITZ", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "2 Dec 2013", "job_title": "Medical Assistant in McHenry, IL", "duration": "N/A", "pros": "I was employed with Centegra / NIMC for 14 years. I was a rehire because I love what the nurses and the physicians and the techs do. I enjoyed all the associates that I worked with and they all enjoyed me as well", "cons": "Centegra s managers are making poor decisions for patient care. They are short staffing and nipping at the heals of senior nurses and such to the degree that some of these seasoned nurses are quitting due to stress. Not from the care but from the harassment these managers are throwing at them."}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Not the best, not the worst.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "11 Aug 2014", "job_title": "Registrar in Woodstock, IL", "duration": "N/A", "pros": "I came into Centegra as a temp, and was hired on in the scheduling and pre-reg department. I was there a total of 5 years. The benefits were amazing, the pay was fantastic. I was not a fan of working the night hours but it was a job. My co-workers were good people to work with. The job itself was not bad, it could be stressful, but I had a high degree of satisfaction from my work.", "cons": "We worked in a closed basement room. Which meant, if one person got sick, EVERYONE got sick. The air quality was terrible down there. Because of this, I was sick EVERY 8 WEEKS. It was terrible. And of course, if I got sick, I brought it home to my kids. It was not just me, other employees had the same issues. Maintenance came in and did air quality readings and said the air flow was fine, but it really was not. Because of the constant illness, I missed a lot of work, something that never happened at my previous jobs. Another con was that upper management liked to spring new things on us. It was constant adding departments we were scheduling and then taking them away, and it never felt like we had enough real training to schedule certain department. There was also no real room for advancement. You could transfer into a different department, but it meant taking a hefty pay cut. So, you were stuck where you were."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Nurse", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Jun 2017", "job_title": "Nurse in Woodstock, IL", "duration": "N/A", "pros": "The people  are the strength of this system. They care about their patients and each other.  Nursing strives to give good patient care when staffed adequately to do so.", "cons": "Upper management is top heavy and does not seem to understand or care about the bedside care givers.  The decisions made are based on reimbursements and if that is reflective  of patient satisfaction then it is a priority  otherwise no. it's as if we are a factory making widgets."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Medical imaging", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "5 Oct 2017", "job_title": "X-Ray Technologist in McHenry, IL", "duration": "N/A", "pros": "Lower and mid level managers really do care about the employees and try to do their best but often are blocked by upper management", "cons": "Much of what we are supposed to focus on is irrelevant and meaningless (numbers, percentages, etc). It's like you throw common sense out the window and ignore the obvious to focus on what upper level management dictates ... almost feels like they're justifying their existence"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Overall decent place to work", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Aug 2012", "job_title": "Nutrional Aide in Woodstock, IL", "duration": "N/A", "pros": "Direct manager was very excellent in their job (who worked for the hospital), very helpful when dealing with issues between people in the workplace. Pay was adequate for duties and responsibilities. Tuition assistance available to full time employees who want to pursue further education.", "cons": "Outside corporation was involved in management process and did not like to promote from within. Outsourced despite having qualified candidates in house. Specifically, I worked in the kitchen and there was a very distinct clique of employees that tried to overrun and rule the work atmosphere outside of management. Health insurance premiums I felt ran high."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Run far away!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "10 Oct 2015", "job_title": "Revenue Cycle in Woodstock, IL", "duration": "N/A", "pros": "Fair pay,  decent insurance benefits. Amazing coworkers for the most part. Employees truly care about the work they do.", "cons": "Nepotism, abrasive managers who don't know their job, unfair promotions that were not posted for others to apply for, micro management, high employee turnover due to low morale, unable to trust leadership because they lie."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Nurse", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "11 Mar 2016", "job_title": "Registered Nurse in Woodstock, IL", "duration": "N/A", "pros": "Working for Centegra has been a great experience. Having had worked at 4 other places before Centegra, I can say Centegra has values that match my own. Friendly work environment, decent pay, and great patient outcomes .", "cons": "The biggest negative is listening to others complain about the organization and leadership. Thise who leave the organization should take a moment to reflect on the experience and use that experience to grow as an individual."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Good place to work, not much opportunity to grow.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Nov 2013", "job_title": "Anonymous Employee in Woodstock, IL", "duration": "N/A", "pros": "Great peers, different hours to work, and useful benefits. The employees have a good synergy and try to work together through different situations.", "cons": "Not much room to grow in the company, very stagnant. Some managers are passive and not very proactive with department. Evaluation of employees is tough as no one is considered high performer but there are many upper middle performers without much guidance on how to move up."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "It is wonderful to work with people who are motivated to make this a great place.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 May 2013", "job_title": "Anonymous Employee in McHenry, IL", "duration": "N/A", "pros": "People at all levels are kind and respectful and pleasant.  The medical benefits are good.  There is a sense of community in the department.  My boss is the best!  Pay is appropriate. Time-off plan is way generous. I am recognized for my work.", "cons": "There is a two-year waiting period to receive a match on my 401K."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Group Fitness Instructor", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "5 Sept 2017", "job_title": "Group Fitness Instructor in Huntley, IL", "duration": "N/A", "pros": "Well managed company, diverse with offering a wide variety of health and wellness programs. Great teams who work well together across multiple departments.", "cons": "Can't think of anything they could do better"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Former rn with 17 years of employment", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "1 Oct 2014", "job_title": "REG NURSE in McHenry, IL", "duration": "N/A", "pros": "Dedicated care professionals at the bedside/hands on level. Management in the department I worked in was professional, experienced, approachable and not afraid to pitch in and had good to exceptional understanding and ability to perform any task/ job in the department.  Most workers give 150% and that should be recognized as the reason this system has survived. Direct care providers have not lost their dedication to providing excellent care.", "cons": "The significant abrupt change in the last three years in the approach of executive management from a caring patient focused, experienced team to  key leaders having little to no experience in departments they are leading, targeting more experienced if they don't begin to conform to the click's attitude is emotionally and professionally draining. Nepotism should have no place in a health care company unless you bring the experience and knowledge with you.  Structural changes have caused many fine dedicated people to leave or be forced out. Adequate staffing should balance experienced team members with newer grads to continue with good patient care while continuing to build a solid team for the future.  The rush to get an EMR so you can take advantage of government funds has likely cost the company a lot. The inadequacy of those who were handed the responsibility to build it has caused a number of unsafe practices, tedious work to even get the right information about patients, errors or negligent care and showed a complete lack of understanding of daily work processes and impact on care. Revamping teams that require certain skills and medical experience  with inadequate experience or no experience and who don't understand their role, are not qualified  and are defensive doesn't solve anything."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Staff RN", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "3 Sept 2016", "job_title": "Registered Nurse in Woodstock, IL", "duration": "N/A", "pros": "Great group of people to work with on night shift. Decent benefits. Hospital offers opportunities for free CEUs.", "cons": "Nurse to patient ratios keep going up. Less support staff (CNAs, HUCs). Keep adding more/repetitive charting that takes away time spent with patients. Short staffing is an issue. Charting software is horrible!"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Overworked Medical Assistant", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Feb 2018", "job_title": "Medical Assistant in Huntley, IL", "duration": "N/A", "pros": "The patients were fabulous and the Physician I worked for was great and taught me so much. The company does have a new beautiful hospital and some new beautiful medical offices.", "cons": "A lot of times needing help and being promised it the entire time I was there. Poor management. There was no coverage for me; I had to come into work even when my child was in the hospital. Management didn’t even know what I did in my job."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "It's my home away from home!  Every day I truly enjoy working for this company.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Jul 2013", "job_title": "Supervisor in McHenry, IL", "duration": "N/A", "pros": "Centegra has a feeling of family they live up to their values of genuine respect passionate caring and a joyful spirit.  Management trusts associates in doing a job well done.  All associates greetnd welcome patients as if they were their own family.  It's a pleasure working for Centegra Health System.", "cons": "Health insurance through employer has a high deductible and out of pocket."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "No one really cares about the lower positions, do your job and keep your mouth shut", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Dec 2013", "job_title": "Anonymous Employee in Crystal Lake, IL", "duration": "N/A", "pros": "it's hard to think of any pros at this point, there are some good people who work there", "cons": "pay is horrible. upper management doesnt really care about the lower positions. you work hard and you get paid the same as what the people who do bare minimum gets paid."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "My experience changes on a daily basis...", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Jan 2014", "job_title": "Anonymous Employee in McHenry, IL", "duration": "N/A", "pros": "My fellow coworkers are amazing (they are just leaving at an alarming rate)....helping the patients", "cons": "morale is real low right now...everyone is watching their back."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "lack of diversity", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Nov 2013", "job_title": "Registered Nurse in McHenry, IL", "duration": "N/A", "pros": "competitive pay. if you are young and inexperience, you will will fit right in.", "cons": "People dread coming to work.  The working environment is very stressful.  And the management is very brutal with the way they treat their employees."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "I have been used and manipulated by management.  I was bullied, lied to, and then betrayed.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "29 Mar 2014", "job_title": "Medical Records in McHenry, IL", "duration": "N/A", "pros": "Honestly, I have nothing positive to say about Centegra.  If you were to ask me this question 9 years ago when it was Northern Illinois Medical Centegra, I would have something positive to say.  Since Centegra Health System bought both hospitals,  patient care has gone downhill.   That's what happens when greedy thugs get involved in healthcare.", "cons": "The people who run this health system are greedy takers, living off of the backs of the workers, who work their hearts out and only get stabbed in the back by management.  The people of this community need to understand that Centegra does not care about patient care, like they like to brag that they do, but all they care about is the almighty dollar and they treat their employees like dirt, all the while lining their own pockets with the profits that the hospitals make.  They are even building a third so they can make more of a profit.  They even got their employees to help in the approval process for them to do so, and then turned around and started axing people out of their jobs."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Centegra's top dogs think very highly of themselves. They are going to fail miserably if they keep things going this way", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "11 May 2014", "job_title": "Anonymous Employee in Woodstock, IL", "duration": "N/A", "pros": "Some of the benefits are good.", "cons": "Terrible management- there are managers who are very immature they make choices as if they were still in high school. Favoritism and nepotism are rampant. Decision making done with very little thought about the outcome."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Registered Nurse", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "27 Jan 2017", "job_title": "Registered Nurse in McHenry, IL", "duration": "N/A", "pros": "The nurses and techs make this place. Always friendly and willing to help each other.  There is room to move and grow within the company.", "cons": "Always understaffed and mandatory overtime because of it is BS. If you get injured be prepared to lose your job. I got hurt on the job and couldn't work the floor. Within 6 months I was fired or so they say 'temporary permanent disability' or you can be employed but we aren't giving you any hours to work."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Could be better, could be worse", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Dec 2016", "job_title": "Anonymous Employee in Huntley, IL", "duration": "N/A", "pros": "Pay is good, benefits are ok, commute for me is decent.  Good team working environment.", "cons": "Typical healthcare BS.  Huntley opened and McHenry has even more patients now!  Patients transferred over from Huntley hate the cramped double rooms."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Centegra; my home away from home", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "7 May 2013", "job_title": "Senior Organizational Development Specialist in McHenry, IL", "duration": "N/A", "pros": "Centegra has provided me growth opportunities, enjoyable people relationships, and the flexibility I require for family/work life balance for many years.", "cons": "There are no cons to working for Centegra. I often wonder if people understand how complex and difficult it is to run an health system."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "You can do much better.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Dec 2015", "job_title": "Anonymous Employee in Woodstock, IL", "duration": "N/A", "pros": "Coworkers are great and many are dedicated.", "cons": "Management is terrible and very uncaring. Any suggestions fall on deaf ears, in fact, they are held against employees. Bad employees are promoted to management positions. Their procedures are not current -- very 1980's. Patients and employees alike have no confidence in billing system and are leaving to go to more up-to-date facilities."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Concerned for the long term success of this hospital as an experienced nurse", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Feb 2014", "job_title": "Registered Nurse in McHenry, IL", "duration": "N/A", "pros": "Generally speaking, employees live the values and coworkers are pleasant", "cons": "Nurses overworked and understaffed, low staff morale, many experienced nurses fired or quit, high volume of new graduate nurses, constant floating to staff other units"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "negative management team", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Nov 2010", "job_title": " in McHenry, IL", "duration": "N/A", "pros": "wonderful,  positive supportive staff--providing excellent care", "cons": "poor senior mangement team-the general attitude is \"your not happy, find another job\"  negative rather than positive approach to  the work enviorment--the only up side is your coworker support--the slogan joyful spirit they use should be implemented by ALL--everyone should be respected and treated with dignity"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Loved working there", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 May 2014", "job_title": "Transcriptionist in McHenry, IL", "duration": "N/A", "pros": "This company is totally growing.  It is building a new hospital in Huntley right now that will be able to take care of this side of town all the way to Del Webb", "cons": "My dealings with the patients was something that I was not able to do.  I wanted make them feel better and of course as a secretary that was beyond my abilities."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Sept 2016", "job_title": "Patient Care Technician in Woodstock, IL", "duration": "N/A", "pros": "Good benefits, work environment, and opportunity for overtime.  Great incentives for working extra hours or shifts", "cons": "Company does not work around school schedule, however it is very easy to work with other employees to cover shifts, and if all else fails, there are ample vacation days one can take."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Therapist", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "9 Aug 2016", "job_title": "Technologist in McHenry, IL", "duration": "N/A", "pros": "Centegra is a good company to work for.  We have freedom and trust that we are getting our jobs done.", "cons": "The benefits could be better. Our current  management is not good. The past management has been better. I have worked with other managers and directors who are great!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Incompetent Management in way over their heads.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "6 Sept 2014", "job_title": "Technical in McHenry, IL", "duration": "N/A", "pros": "Like most places the front line staff do an admirable job with the minimal tools and training that they are given", "cons": "Blatant incompetence at many levels of management. Several high level management positions which require quantitative expertise are done by \"business\" types.  Too many nurses doing technical IT / IS tasks or in charge of high technology."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Not a top hospital.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Nov 2014", "job_title": "Medical Technologist in McHenry, IL", "duration": "N/A", "pros": "Some people were friendly and I enjoyed the community. Pay was ok for the job.", "cons": "Bad management, poor quality of care for the patients and dirty. If I was seriously ill I would take the risk to avoid this hospital."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Scheduler", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "12 Jan 2017", "job_title": "Scheduler in Woodstock, IL", "duration": "N/A", "pros": "Tuition reimbursement, ability to advance, generous PTO plan", "cons": "Some department managers like to be overly critical while others are overly lax, which makes it a confusing atmosphere"}], [{"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Poor nurse to patient ratio.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Mar 2015", "job_title": "Staff Nurse in McHenry, IL", "duration": "N/A", "pros": "Great co-workers, teamwork, good nurses', opportunity for growth, and continued education.", "cons": "poor staffing, high acuity with poor support, poor management-looks more at numbers than the acuity, not enough equipment"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "RN", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "16 May 2014", "job_title": "Registered Nurse in Woodstock, IL", "duration": "N/A", "pros": "There are some really great people that work there and love their job.", "cons": "Always short staffed. Upper management makes all rules without consulting staff and during meetings says \"if you do t like it, there's the door.\" Does not care about patient safety."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Registration", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Jun 2016", "job_title": "Scheduler/Registration in McHenry, IL", "duration": "N/A", "pros": "The pay was above average and I really enjoyed some of the people I worked with.", "cons": "Work environment was one based off of fear and intimidation. Very immature managers who would openly gossip about other employees. Uneducated and unprofessional employees who would constantly back stabbing employees. A lot of nepotism and meager raises, (i.e. 30 or 40 cents)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "A hospital system with potential", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Aug 2015", "job_title": "Anonymous Employee in McHenry, IL", "duration": "N/A", "pros": "New hospital being built, high salary for area", "cons": "Difficulty adjusting schedule to accommodate school"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Love/Hate relationship", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 May 2016", "job_title": "Wellness Technician in Crystal Lake, IL", "duration": "N/A", "pros": "Open communication, welcoming upper management, family oriented treatment of patients and employees", "cons": "Communication gets lost between employees, transition periods are flawed and choppy, reviews are based on popularity more than actual performance"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Uncertain future", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 Oct 2017", "job_title": "Anonymous Employee in McHenry, IL", "duration": "N/A", "pros": "Decent benefits, friendly and dedicated staff.", "cons": "Administration is top heavy, to many relatives of the CEO collecting high salaries. Recent lay offs and oursourcing creates an environment of insecurity."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 Oct 2014", "job_title": "Administrative in Woodstock, IL", "duration": "N/A", "pros": "Great place to work.  Managers and supervisors are very communicative, helpful and work with the employees.  Growing organization.  Great place to work", "cons": "None that I can see"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "xray technologist", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "17 Jul 2017", "job_title": "X-Ray Technologist in McHenry, IL", "duration": "N/A", "pros": "Decent benefits and amount of paid time off; 401k offered but company does not match it; tuition reimbursement", "cons": "Generally short-staffed, some departments are worse than others"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 1, "Senior Management": 5, "review_title": "Love the job but hate the pay.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Jun 2018", "job_title": "Medical Assistant in Crystal Lake, IL", "duration": "N/A", "pros": "Very nice patient base. Good benefits. Discount on fitness center. Very good communication from leadership.", "cons": "Pay is very poor. Annual raises are minimal and 401K is not matched by employer."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Not a great place to work", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "28 Oct 2013", "job_title": "Registered Nurse in McHenry, IL", "duration": "N/A", "pros": "Love people I work with.", "cons": "Not a great place to provide quality and safe care.  Short staff all the time. Nurses have no voice in decisional making.  Very morale through out the organization."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Rough to say the least", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "28 Oct 2014", "job_title": "Registered Nurse in McHenry, IL", "duration": "N/A", "pros": "The people I worked with until they all started being fired or left out of fear of being terminated", "cons": "Heavy handed administration. All Related to each other.  Environment of fear. Mike E Makes more than all of the advocate CNO combined."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Hopefully becoming part of Northwestern Medicine will increase the overall rating", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "2 Jun 2019", "job_title": "Health Unit Coordinator in McHenry, IL", "duration": "N/A", "pros": "Great coworkers, sense of teamwork", "cons": "Not much support from management in regards to job promotion within the system"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Changing Work Environment", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "9 Oct 2017", "job_title": "Infection Prevention Data Analyst in Woodstock, IL", "duration": "N/A", "pros": "Good staff to work with", "cons": "It is going through major changes and not for the better"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Registered Nurse", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Jan 2018", "job_title": "Registered Nurse in McHenry, IL", "duration": "N/A", "pros": "I work with a few special coworkers.", "cons": "Overworked, understaffed, scary Nurse:patient ratio,  poor management"}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Personal trainer", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Jun 2018", "job_title": "Personal Trainer in Crystal Lake, IL", "duration": "N/A", "pros": "Excellent staff - plenty of work available- interested and varied populations of members.", "cons": "Long hours. Low floor wage pay."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "New grad RN", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Apr 2016", "job_title": "Registered Nurse in McHenry, IL", "duration": "N/A", "pros": "nurse to patient ratios, tuition reimbursement, great new grad orientation", "cons": "small community hospital limited to McHenry county"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Manager of the facility", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "22 May 2016", "job_title": "Manager in Lake in the Hills, IL", "duration": "N/A", "pros": "Great place to work. Great bosses", "cons": "Need to offer fulltime with benefits to certain positions"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Lead", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "21 Sept 2017", "job_title": "Anonymous Employee in McHenry, IL", "duration": "N/A", "pros": "Location atmosphere friendly associates and physician", "cons": "Uncertain of stability No room for growth"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Enjoy the staff and clients", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "30 May 2019", "job_title": "Senior Personal Trainer in Crystal Lake, IL", "duration": "N/A", "pros": "Great trainers to work with", "cons": "New management stinks..cutting salaries..treating staff inappropriately"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "RN - urgent care", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "6 Dec 2015", "job_title": "Anonymous Employee in Crystal Lake, IL", "duration": "N/A", "pros": "It is close to where I live", "cons": "The long hours 12 hour shifts"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "icu", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "22 Oct 2016", "job_title": "ICU Patient Care Technician in Lake Villa, IL", "duration": "N/A", "pros": "friendly co workers,  good training, work/life balance", "cons": "mostly understaffed, manager keep on changing"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Phlebotomist", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Nov 2017", "job_title": "Anonymous Employee in McHenry, IL", "duration": "N/A", "pros": "The continuing updates are good for the hospital", "cons": "Pay structure is less than desirable and mostly running on a skeleton crew."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Low pay", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "30 Oct 2019", "job_title": "Patient Registrar in Woodstock, IL", "duration": "N/A", "pros": "Cool coworkers Easy job liked to help people", "cons": "Strict bosses Worked in very old building"}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Ok place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 May 2017", "job_title": "Clinical Manager in Woodstock, IL", "duration": "N/A", "pros": "Great co-workers and flexible schedule", "cons": "Servant leadership philosophy is not practiced by all leaders."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Manager", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "8 Feb 2016", "job_title": "Anonymous Employee in Geneva, IL", "duration": "N/A", "pros": "Excellent work environment and organizational culture", "cons": "Variety of locations throughout McHenry County"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good employer.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "24 Apr 2020", "job_title": "Registered Nurse, BSN in Huntley, IL", "duration": "N/A", "pros": "Good teamwork, fair, family -like environment.", "cons": "Everything was great. Good experience."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "PCT", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 May 2017", "job_title": "Pct in McHenry, IL", "duration": "N/A", "pros": "Allowed to pick up extra hours", "cons": "not flexible with  work scheduling"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "horrible", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jun 2019", "job_title": "Certified Personal Trainer in Huntley, IL", "duration": "N/A", "pros": "I can't think of any pros to working with Centegra.", "cons": "Creates unsafe work environment. Management is so unorganized. They don't care about their staff or co-workers. Understaffed, overworked, and underpaid."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "hey  help the employees that get hurt instead of firering them.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Jun 2008", "job_title": "Nothing Now in McHenry, IL", "duration": "N/A", "pros": "only good thing are the other employees", "cons": "upper management dont care about the lower employees"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not a great place to work", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "19 Nov 2014", "job_title": "Registered Nurse in Woodstock, IL", "duration": "N/A", "pros": "Fellow nurses are great to work with.", "cons": "Nurses are not respected or valued by management."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "CT tech", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "29 May 2015", "job_title": "CT Technologist in Woodstock, IL", "duration": "N/A", "pros": "Great and supportive coworkers to work with", "cons": "Does not support employees, cares more about the numbers than employees."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Clerical Specialist", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "3 Oct 2017", "job_title": "Anonymous Employee in McHenry, IL", "duration": "N/A", "pros": "Good environment. Reliable co-workers. Patient oriented.", "cons": "Some of the jobs are outsourced."}]]