[[{"date": "30 Jun 2023", "title": "Summer Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Royal National Lifeboat Institution", "Interview Descriptions": "5 min interview with standard questions you are sent ahead of time. Followed up with a selection day of fitness tests; 400m times swim 50 under/over times swim, sprint timed, run-swim-run, bpard rescue, tube rescue and first aid questions.", "Interview Questions": "What 2 RNLI values do you think are most relevant to the job?"}, {"date": "7 Jun 2023", "title": "Entry Level Fundraisers Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Royal National Lifeboat Institution (North Cornelly, Wales)", "Interview Descriptions": "A few questions and a role play in how you would complete the fundraising task. General interview style questions about why you want the role and what you would bring", "Interview Questions": "Imagine you’re a fundraiser, how would I sign up with you"}, {"date": "26 Mar 2023", "title": "F2F Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Royal National Lifeboat Institution (Poole, England) in Mar 2023", "Interview Descriptions": "Was a relaxed interview with 2 members of staff that asked a total of 5 questions. One question was a role play that you had 10 minutes to prepare for. One questions was about examples of working as a team and how you would use your teamwork in this role and another questions on examples of your work where you have had to stay motivated.", "Interview Questions": "Talk for one minute about something you are passionate about"}, {"date": "30 Nov 2022", "title": "Human Resources Business Partner HRBP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Royal National Lifeboat Institution (Poole, England)", "Interview Descriptions": "Great communication from the recruitment team, clear process with presentation brief. Face to face interview with opportunity to see environment. Quick updates following the process which was appreciated. First 10 minutes pre prepared presentation followed by a set of competency based questions.", "Interview Questions": "Competency based questions with presentation relevant to role"}, {"date": "16 Mar 2022", "title": "Costal Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Royal National Lifeboat Institution", "Interview Descriptions": "Panel of two with questions on behaviours and scenario based assessment. Took place at a lifeboat station and so was introduced to the work undertaken and the role applied for", "Interview Questions": "Describe a scenario where you have persuaded others to do something they didn’t want to do"}, {"date": "24 Jun 2022", "title": "Head of Region Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Royal National Lifeboat Institution (London, England) in Dec 2021", "Interview Descriptions": "Interiew was conducted through a recruitment agency. Remote video call for 60 mins. Explanation of the role, location, benefits etc. Feedback provide upon request went above and expectations and delveried in person.", "Interview Questions": "Standard question on background, experience and why one would be suitable for the position. "}, {"date": "16 Mar 2022", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Royal National Lifeboat Institution in Jul 2021", "Interview Descriptions": "You are asked a series of real life situation questions.  There is a 400 meter swim fitness test and a 1 minute CPR test. And some getting to know you type questions.", "Interview Questions": "What are the RNLIs four core values?"}, {"date": "18 Apr 2021", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Royal National Lifeboat Institution", "Interview Descriptions": "Role play situation followed by a pre prepared presentation related to the job. Followed by several questions. Interview was with a panel of three people and was relaxed and conducted in a positive friendly manner.", "Interview Questions": "Explain how you would deal with a difficult volunteer"}, {"date": "16 Feb 2021", "title": "Supporter Experience Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Royal National Lifeboat Institution (Poole, England) in Sept 2020", "Interview Descriptions": "Done on Zoom. Very similar to Customer Service type interviews I've had in the past, and despite being on Zoom I felt made very comfortable and listened to. Explained the role in a lot more depth and were very open about how the interview would go, no trick questions etc", "Interview Questions": "Give us an example of when you have gone over and above for a customer"}, {"date": "8 Nov 2021", "title": "F2F Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Royal National Lifeboat Institution (Belfast, Northern Ireland) in Mar 2020", "Interview Descriptions": "Informal, long interview. questions about your experience or what would you do scenarios. Role play was involved and a break in-between the interview to project numbers and analyse them. Three people interviewed me at once, but it was all quite friendly", "Interview Questions": "What would you do if a colleague felt frustrated or deflated?"}], [{"date": "1 Apr 2020", "title": "FACE To FACE FUNDRAISER Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Royal National Lifeboat Institution in Feb 2020", "Interview Descriptions": "Applied online through the website, received an interview date. Interview lasted 45 minutes on video call and contained a role playing exercise. Received a phone call 2 days later with an offer.", "Interview Questions": "Why is being passionate an important value to fundraising"}, {"date": "25 Jul 2019", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Royal National Lifeboat Institution", "Interview Descriptions": "Role play being a fundraiser with a member of the public and assessing your communication skills, confidence, interpersonal skills and ability to inspire. Competency based questions. They made me feel very relaxed.", "Interview Questions": "What are you passionate about?"}, {"date": "6 Nov 2019", "title": "FACE To FACE FUNDRAISER Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Royal National Lifeboat Institution in Feb 2019", "Interview Descriptions": "Pretty relaxed interview with two managers on Skype. Good conversation and easy to go through. consisted of 5 questions, one being a role play on how you would go about having a conversation with a father and his two children on the beach.", "Interview Questions": "You have 60 seconds to inspire me on any topic/ thing. "}, {"date": "14 Jun 2021", "title": "FACE To FACE FUNDRAISER Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Royal National Lifeboat Institution (Falmouth, England) in Feb 2019", "Interview Descriptions": "really chilled out. Very laid back. It was remote as i could not get down to wear they interviewed and very easy. was with 2 senior people and they asked me to role play what i would do on the beach", "Interview Questions": "Talk about something you're passionate about. "}, {"date": "23 Oct 2018", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Royal National Lifeboat Institution (Poole, England) in Oct 2018", "Interview Descriptions": "Written exercise - handwritten, no use of keyboards. Followed by a group role play - where everyone had to compete with each other in a short space of time. It was a very unrealistic role play - unlike any meeting I've been to. It was quite a gladitorial setting.", "Interview Questions": "N/A"}, {"date": "17 Feb 2021", "title": "IT Service Management Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at Royal National Lifeboat Institution (Poole, England) in Oct 2018", "Interview Descriptions": "phone interview then a face to face chat with two team members a competency task\r\nwent on for around and hour, was very similar to other interviews that I have had in the past and wasnt particularly tough.\r\nNo HR rep just the team i would be working with", "Interview Questions": "about me & previous job experience "}, {"date": "4 Dec 2022", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Royal National Lifeboat Institution (Rhyl, Wales) in May 2018", "Interview Descriptions": "Formal, strict and professional interview (wear a suit). Maybe a bit of a shock if a teen applies it isn't like a Saturday job so be prepared for more serious interview akin to a full time job. Remember RNLI values", "Interview Questions": "RNLI values Scenarios at work"}, {"date": "19 Jun 2019", "title": "F2F Fundraiser Level I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Royal National Lifeboat Institution in Mar 2018", "Interview Descriptions": "Phone call informing you have been successful for an online interview had the online interview after an email confirming the dates/times. Had to role play in the interview. A week or so later I had a phone call saying I had been accepted and they told me all the dates.", "Interview Questions": "How did you hear about the job?"}, {"date": "17 Oct 2022", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Royal National Lifeboat Institution in Jan 2018", "Interview Descriptions": "Round 1 consisted of fitness competencies, group selection, run-swim-run, CPR, first aid competencies. Round 2 was a 2:1 interview with lifeguard supervisors asking a mix of motivational and competency based questions.", "Interview Questions": "How do you stay alert whilst on the job?"}, {"date": "12 Apr 2019", "title": "Senior Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Royal National Lifeboat Institution (Chichester, England) in Jan 2018", "Interview Descriptions": "Breif but rewarding and great interview experience. I was asked questions on supervising the running of the busy  lifeguarded beaches, helping and advising those who use the beach or enter the water and providing or coordinating rescues if people find themselves in trouble.", "Interview Questions": "What would you do in this situation?"}], [{"date": "21 Sept 2021", "title": "Corporate Trainer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Royal National Lifeboat Institution (Poole, England) in Jun 2017", "Interview Descriptions": "A meeting with three members of the team including simulating part of a training session. They were professional and welcoming people and the interview process was as described. Lasted around  hour.", "Interview Questions": "Talk to us about your approach to planning "}, {"date": "11 Dec 2016", "title": "FACE To FACE FUNDRAISER Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Royal National Lifeboat Institution (Poole, England) in Apr 2016", "Interview Descriptions": "Unlike other applications you do not need to submit a CV. \r\n\r\nBefore you are offered an interview you must first record two videos answering two questions from your laptop, tablet... \r\n\r\nMake sure you are in a well lit room, neutral walls, natural light is the best if possible. \r\nFor extra kudos include something in the background that makes you stand out ie; surfboard or a lifeboat. \r\n\r\nIf successful you'll be invited to interview usually the closest location to you, if you havent stated otherwise. \r\n\r\nThe Interview day consists of a group/ panel debate and a 1:1 interview with competency questions  and role play.", "Interview Questions": "I was asked to speak passionately for 5 minutes about a topic from a list given. The list ranged from candles to sport activities. I choose travel. "}, {"date": "17 Feb 2020", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Royal National Lifeboat Institution (Poole, England) in Mar 2016", "Interview Descriptions": "I applied for the job, they asked me some questions, I provided some additional information and they offered me the job. I accepted and the rest is history as they say..", "Interview Questions": "Can I swim?"}, {"date": "1 Jul 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Royal National Lifeboat Institution (Poole, England) in Nov 2015", "Interview Descriptions": "Set script of questions with 2 interviewers.  Questions regarding knowledge of RNLI as an institution and values.  Competency questions according to job profile. \r\nYour application is screened and scored against a matrix by the recruiting manager.  Read the job profile carefully and make sure you highlight the competencies and experience you have which apply.  Some roles do require tests but they do tend to notify you of this in advance when you are invited to interview.", "Interview Questions": "Can you describe a time when you were courageous?  Can you tell me about a time when you improved a process or exceeded expectations etc."}, {"date": "22 Jan 2018", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Royal National Lifeboat Institution in Apr 2015", "Interview Descriptions": "You go through a week of training and then you are invited for an interview which you are perfectly ready for. Questions are pretty easy and interviewer are friendly, mostly because you met them during the training week", "Interview Questions": "What are the RNLI values?\r\nHow would you manage with *type of an incident*?"}, {"date": "6 Mar 2018", "title": "Communications Placement Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Royal National Lifeboat Institution (Poole, England) in Mar 2015", "Interview Descriptions": "Fairly long online application (no CV needs to be submitted), followed by half-day interview in Poole. Written exercises relevant to the role and phone task.  Interview with three staff members. Lunch served and eaten together.  Group prioritisation/deadline task.", "Interview Questions": "Why do you want to work for a charity/the RNLI? How do you align with RNLI values? "}]]