[[{"date": "31 Mar 2023", "title": "Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Valley Medical Center", "Interview Descriptions": "Video interview, mostly just chatting, not high pressure. Very friendly. Two people interviewed me and described the next steps of being hired. It was actually fun. Also, I got the job!", "Interview Questions": "Please tell me about yourself"}, {"date": "9 Mar 2023", "title": "ICU Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Valley Medical Center in Feb 2023", "Interview Descriptions": "Limited parking spaces and huge facility. Needed to arrive the place around 1 hour earlier. Open space, a lot of interviewers, followed by online preference department. interviewing by each department managers at each booths.", "Interview Questions": "Why do you want to be a ICU nurse?"}, {"date": "30 Mar 2023", "title": "Health Care Worker Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Valley Medical Center in Jan 2023", "Interview Descriptions": "Very slow process, unresponsive recruiting team. As a health care professional with multiple qualifications and experience in multiple specialties I was interviewed at multiple other locations with more organized and responsive recruiting teams. \nGiven the current shortage and need for health care workers I ended up looking elsewhere and was offered much better position with much better salary and benefits.", "Interview Questions": "Tell me about yourself and why do you want to work at Valley Medical Center?"}, {"date": "9 Sept 2022", "title": "Clinical Applications Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Medical Center", "Interview Descriptions": "Panel interview but great experience.  Each person asked a question. Welcoming atmosphere.  Standard behavioral interview questions. They had donuts. Told me I'd hear back in a few days. Then they offered the position.", "Interview Questions": "What is your favorite part of Epic?"}, {"date": "7 Jan 2023", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valley Medical Center (Renton, WA) in Oct 2021", "Interview Descriptions": "The interview process was very smooth. I felt comfortable the entire time. There was a preliminary interview done over the computer, an in-person interview and job shadow, and then a practical interview.", "Interview Questions": "Most of the questions they asked were about my resume and all my experience and how I will apply those experiences into my practice as PT."}, {"date": "24 Mar 2021", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valley Medical Center (Renton, WA)", "Interview Descriptions": "I was invited to the interview after submitting my application. The interview lasted for about 30 minutes. The interviewer was friendly and welcoming.  I heard back from them about 1 week later and was offered the position.", "Interview Questions": "Describe a time when you run into a conflict and how you resolved it "}, {"date": "9 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Medical Center", "Interview Descriptions": "Personality Based Questions. Asked about what the mission statement is. Not difficult, just be yourself and answer to the best of your ability. Know the difference between health equity and equality.", "Interview Questions": "Health Equity versus Health Equality."}, {"date": "6 Mar 2023", "title": "Patient Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Valley Medical Center in Jan 2021", "Interview Descriptions": "First there was a phone interview, then a second phone interview, and finally a panel interview. It was intimidating with so my faces to answer questions to. They were all friendly and answered my questions thoroughly. Note: they liked that I came prepared with a notebook to recite my questions/ write down notes.", "Interview Questions": "What is your biggest weakness?"}, {"date": "12 Jan 2021", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valley Medical Center (Renton, WA) in Oct 2020", "Interview Descriptions": "My interview was very casual. The head therapist and the rehab  supervisor described the position and asked very few questions. The questions were quite basic. The entire interview was about one hour long.", "Interview Questions": "What do you like and what do you not like about the acute care setting?"}, {"date": "9 Sept 2020", "title": "Or RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Valley Medical Center", "Interview Descriptions": "I was hired through The NW periop consortium. The educator contacted me for an initial phone screening. There was a panel interview with director, Clinical coordinators, educator, and staff nurses. It was about a 20 minute interview.", "Interview Questions": "How do you deal with difficult situations? How do you manage multiple tasks?"}], [{"date": "26 Apr 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Medical Center (Renton, WA) in Aug 2020", "Interview Descriptions": "Group interviews were done. There are about 5-6 people you interview with you all answer the same questions. We were then asked to take a timed test to test our accuracy and speed with numbers.", "Interview Questions": "What made you go into nursing? "}, {"date": "12 Aug 2020", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Medical Center (San Jose, CA) in Aug 2020", "Interview Descriptions": "multi panel interview, with similar situation type questions. Be prepared to talk for about 30min max. Also have some questions of your own prepared to ask the panel. Do your research on the company and also be prepared to respond with feedback that shows that you have done your work in advance. Also be on time, and give yourself a few minutes to find parking and the location/place where the interview will take place.", "Interview Questions": "My ability to think fast on my feet and my skills"}, {"date": "7 Oct 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valley Medical Center in Nov 2019", "Interview Descriptions": "1st interviews are with hiring manager, then panel of individuals in clinic. Each location differs based on clinic or hospital setting. Smooth process from HR to Employee Health. Very responsive via email and organized with onboarding.", "Interview Questions": "What brings you to Valley?"}, {"date": "19 Sept 2019", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Valley Medical Center", "Interview Descriptions": "ACP recruitment is fantastic.  Contacted for 30-minute phone screen.  I then was offered the opportunity for an in-person interview.  The in-person interview consisted of meeting with 9 different people, for clinical staff, physicians, COO, and CEO.  Intimadating, but very thorough process", "Interview Questions": "What do you know about Valley's mission and community involvement?"}, {"date": "24 Apr 2019", "title": "Speech Language Pathologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Valley Medical Center", "Interview Descriptions": "It was pretty standard, but they use some of those strange automatic scoring tools and asked follow up questions because I didn’t fit the right category on the tool. As a professional with a specialized degree, I found this a little insulting — they were more interested in a standardized tool than my experience and organic responses.", "Interview Questions": "N/A"}, {"date": "24 Apr 2017", "title": "Intake Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Valley Medical Center (Renton, WA)", "Interview Descriptions": "I applied online and then received an email to schedule an interview. The interview was about 45 minutes and consisted of information about the position and questions about how my personal experience pertains to the job duties.", "Interview Questions": "Describe a difficult work experience and how you handled the situation. "}, {"date": "1 Feb 2017", "title": "ER Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Valley Medical Center", "Interview Descriptions": "They do a group interview and ask you some standard questions which they expect you to answer as short essays.\r\nThey never informed me if I got the job or not. Their silence however is enough for me to know that I did not get an offer. To not informed the applicants if they got a job or not is highly unprofessional and disappointing.", "Interview Questions": "Standard"}, {"date": "2 Jun 2016", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Valley Medical Center (Renton, WA) in May 2016", "Interview Descriptions": "I applied online and received a call to set up a phone interview with a clinic that had a position open. I went into the clinic and met with the managers and they were very informative and helpful.", "Interview Questions": "They asked what was my initial impression of the clinic. "}, {"date": "3 Jun 2016", "title": "Executive Director Admitting Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valley Medical Center (Renton, WA) in Mar 2016", "Interview Descriptions": "I applied for the ED admitting position online on their website. It took around about 2 weeks to call me and set up and interview. Set up an interview about 3 days later. Interview was quick. Admitting manager and the lead ed amitting was in the interview. They asked normal interview questions. Have to pass a typing and terminology test.", "Interview Questions": "how would you get to work in snow"}], [{"date": "5 Mar 2014", "title": "PSR Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at Valley Medical Center", "Interview Descriptions": "Applied online and heard back within 2 weeks.  Interviewed and was offered a position in 2 days.", "Interview Questions": "Tell me about a situation with a hostile patient "}, {"date": "25 Aug 2017", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Valley Medical Center in Mar 2014", "Interview Descriptions": "It was brief and not stressful. Lasted approx 20-30 min. No intense respiratory related questions asked. After the interview, i believe it was a few days before I found out I got the job then a couple weeks until orientation started", "Interview Questions": "What is your biggest strength and weakness? And how do you deal with your weakness"}, {"date": "17 Feb 2014", "title": "Admitting Registar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valley Medical Center", "Interview Descriptions": "Did application online and was contacted via email the next day with questionnaire. Once I completed the questionnaire I was emailed later that day requesting an interview.  About a week after HR department contacted me via email with an online assessment.  This took about 30 minutes to complete. The next day I was contacted requesting my references.Two days later I was contacted with a job offer.", "Interview Questions": "What quality makes me most qualified for the position? "}, {"date": "9 May 2017", "title": "Medical Surgical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Valley Medical Center (Renton, WA) in Jun 2013", "Interview Descriptions": "Took a basic pretest, interviewed with management. Asked some standard interview questions. Some people had group interviews. Overall not a super intimidating process. Was able to get questions answered and also got a tour of the department.", "Interview Questions": "Tell us about a time you were in a difficult situation at work and how you handled it. "}, {"date": "25 Jan 2015", "title": "Business Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valley Medical Center in Jan 2012", "Interview Descriptions": "Human Resources contacted me (phone or Email) to schedule an on-site interview with the hiring manager. It was a straight forward process. Interview was one-on-one. Not a structured interview.", "Interview Questions": "Tell me would your work experience. "}, {"date": "28 Jan 2014", "title": "Health Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Valley Medical Center (Renton, WA) in Jul 2011", "Interview Descriptions": "Received call from clinic director and scheduled interview. Know the company/clinic populations", "Interview Questions": "What is the COHE? "}, {"date": "30 Oct 2015", "title": "Volunteer/ Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Valley Medical Center (Kent, WA) in Jun 2011", "Interview Descriptions": "I was contracted/hired thru my college (Green River) so it went really well. There was about 5 students who did their internship at Valley Medical Center so we all sat down in a conference room with a supervisor who explained what was expected and what we were going to learn. After that they handed out pamphlets and told us what clinics each of us were going to help in.", "Interview Questions": "When are you ready to work and what times?"}, {"date": "23 May 2015", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Valley Medical Center (Renton, WA) in Jun 2011", "Interview Descriptions": "Organized, respectful, quick. As is pretty typical with interviews in my field, the manager was eager to hire an experienced therapist and much of the discussion was intended to convince me that this was a good choice for me. I chatted with another worker later who asked me a few questions And I asked her a few as well.", "Interview Questions": "number of hours/schedule I wanted to work"}, {"date": "15 Jun 2011", "title": "ER Nurse Residency Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Valley Medical Center (Renton, WA) in Apr 2011", "Interview Descriptions": "The position is for 2 ER residency RN position, which over one hundred applicants.  The interview was divided into 2 stages.  First stage consists of 4 groups interview.  Each group consists of a panel interviewers and 15 interviewees.  Interview begin with a personality test, followed by a test for multi-tasking ability (3 pages of 30-40 lines of numbers.  Six sets of numbers (3-8 digits) in each line and 2 of the 6 numbers set are identical) you circle the 2 identical numbers.  In 10 minutes you circle as much as you can.  Next is the essay question.  I don’t remember the exact wording but the question is asking what cause the ER to overflow in hospital and how can you address this problem.  They give you 10 minutes for the essay.  The next part is more questions.  They give each interviewee a package (5-7pages) of questions.  And ask you to choose 4 number from 7 -20 and write on the front of the packet.  You must answer all of the first 7 questions, and 4 more question which ever 4 number you wrote on the front of the packet corresponding to the questions.  You have 20 minutes to answer the 10 questions.  Most of the questions are open-ended essay question which I believe no one was able to finish all 10 questions. I only remembers a few questions: “Why you want to be ER nurse?”  “If you can’t be an ER nurse what is the second choice?” “Why work for Valley?”  “How did you deal with a difficulty situation, and if you encounter it second time what would you do?”", "Interview Questions": "“If you can’t be an ER nurse what is the second choice and why?”"}]]