[[{"date": "8 May 2023", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Crohn's & Colitis Foundation (New York, NY) in Apr 2023", "Interview Descriptions": "Had an initial Phone Screen with a recruiter followed by a Zoom Panel interview. The time from the phone screen to the zoom was about 2-3 weeks with total interview process taking a month.", "Interview Questions": "What motivates you to do this work? How do you see your past work experience benefitting you in this role?"}, {"date": "9 Sept 2022", "title": "Database Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Crohn's & Colitis Foundation", "Interview Descriptions": "Had a first round with a recruiter then met with a couple of directors.\n\nInterview was almost too laid back, they said they were having trouble finding someone which is a red flag to me.  There is a ton of talent and often employers need to look in the mirror.  Stop waiting for the perfect candidate.\n\nI was told I was a finalist and would hear back in a month. Followed up around that time and was ghosted.", "Interview Questions": "What is your experience with SQL?"}, {"date": "31 Mar 2022", "title": "Volunteer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Crohn's & Colitis Foundation", "Interview Descriptions": "Very friendly telephone interview, asked me a variety of questions regarding my past experiences and about myself in general. Overall was a great process and would definitely interview with them again.", "Interview Questions": "A bit about yourself & recent volunteer experience"}, {"date": "17 Jan 2022", "title": "Fundraising Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Crohn's & Colitis Foundation", "Interview Descriptions": "After weeks of online applications, checking all my references, multiple interviews, pulling my credit report, asking me how I would “hit the ground running” and getting a detailed 90-day fundraising plan from me, (along with a year’s worth of funding strategies), I was offered the job on a Friday afternoon. I happily accepted. \n\nI left that meeting with a verbal offer of employment including the salary I negotiated, with an on-going discussion about how I would be compensated for hitting the fundraising quotas we established as parameters for employment. Dollar amounts, dates, the whole first year was in play. I had committed to raise more money than anyone else ever had at that chapter. And I could have. \n\nThe executive director, my new boss, said to look for my offer letter in email. I started on Wednesday. \n\nSaturday and Sunday - nothing. Monday no email, plus no returned phone calls from E.D. Now I’m calling “corporate office” to find out if he’s out sick. Could someone get back to me please? I start in two days! That night I get an email from HR stating they decided not to fill the position. \n\nTuesday still not a word from the man who hired me. I call corporate and argue with the worst human I’ve ever spoken to, who claimed to be “head of human resources” but whose voice did not convince me. Getting no satisfactory answers OR A SINGLE APOLOGY from anyone at CCF, I gave up. \n\nI’d already lost out on other lucrative job offers. Do I think they took my ideas and hired someone with half the experience at half the cost? Infuriated I wrote the whole ordeal out, including important details based on the meticulous notes I take in real time. I sent this saga to the handsomely paid CEO Michael Osso directly. \n\nA mentor and professional reference of mine, who knew Michael, agreed Osso had the right to know what happened. How I was treated by CCF was traumatizing and cost me greatly - and they should NEVER do that to anyone ever again.\n\nUnfortunately Osso didn’t respond to my email. He received and read it, but did not reply. Our mutual friend, who was copied on the long and sordid email, did however. No one should ever be deceived like this. Knowing the CEO condones this behavior, I’ll never again trust or support CCF.", "Interview Questions": "How would you increase funding opportunities in Omaha?"}, {"date": "18 Sept 2022", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Crohn's & Colitis Foundation in Jan 2022", "Interview Descriptions": "Interview process occurred over the course of about 3 weeks with 5 different virtual interviews. Interviews were pleasant and informative. The questions were on par with basically every other interview I’ve had. Didn’t feel like I was being grilled or asked impossible questions. I was very impressed how quickly each interview was followed up with via email. This was one of the better interview experiences I've had.", "Interview Questions": "Describe your project management experience."}, {"date": "28 Jul 2021", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Crohn's & Colitis Foundation", "Interview Descriptions": "The interviewer seemed nice and the conversation was going well. It looks like the interviewer decided to give more hard questions to throw me off. I suspect this was because they didn't want to hire me and made the interview harder to make it seem like I didn't do well in it?", "Interview Questions": "Asked about my previous work experience and the excel functions I use the most. Asked if we know about the company. Some technical questions."}, {"date": "15 Sept 2017", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Crohn's & Colitis Foundation", "Interview Descriptions": "I applied online on August 25th, received an email on September 7th requesting to schedule a 'introductory phone interview' through a scheduling website and due a combination of HQ being in the East Coast time zone, my current unavailable hours, and HR's unavailable days - the interview was scheduled for September 18th.\r\n\r\nI received an email on September 14th that my interview was canceled as someone had already been hired for the role and to let HR know if any other open positions caught my interest so they could review my credentials.", "Interview Questions": "N/A"}, {"date": "2 Sept 2020", "title": "Executive Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Crohn's & Colitis Foundation (Pittsburgh, PA) in Mar 2017", "Interview Descriptions": "Very positive and straightforward, they were responsive and got back to me in a timely fashion when they said they would.  They asked fair questions and the levels of interviewers proceeded in a logical way.", "Interview Questions": "Would you be willing to travel for training?"}, {"date": "8 Feb 2018", "title": "Development Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Crohn's & Colitis Foundation (Los Angeles, CA) in Jan 2017", "Interview Descriptions": "The interview was brief and focused mainly around the mission of the foundation. Not too much was shared about the position until I asked specific questions. The focus was on the mission and what kind of a difference I wanted to make.", "Interview Questions": "What’s your connection to either of the diseases?"}, {"date": "10 Sept 2016", "title": "Development Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Crohn's & Colitis Foundation (Baltimore, MD)", "Interview Descriptions": "I submitted my resume online. I was contacted to say that my salary requirement were higher than their budgeted range for the position and could I please give them my \"real\" salary requirements. I replied that my state requirements were very much real. They proceeded with the process anyway. a few weeks later there was an initial phone screen. Then an in-person interview was scheduled. I found the process pretty tedious since they gave me days and times within 48 hours and I was not able to make it. I accepted another time and the HR office did not confirm in time. Without her confirmation, I had no idea of knowing if the interviewer was expecting me, or even where the interview would be. Another interview was scheduled and as I was paying the parking meter I got a call to cancel. Again, an interview was scheduled. The offie was tiny and cluttered. The interview itself seemed disorganized. Possibly because in such a small space the only place available for an interview was the ED's office. But there wasn't enough room for everyone so I met with 3 people 2 at a time. I got the impression that there had been a lot of turn over in the position and that they possibly had some unrealistic goals. They also made it clear that even though the job was meeting with sponsors and donors I was expected to spend most of my time in the office. Frankly, I didn't even see where I might find workspace in the office aside from a table in the middle of the open room. There was only a couple of desks and they were already occupied.", "Interview Questions": "They asked me what kind of appliance I would be."}], [{"date": "25 Sept 2015", "title": "Campaign Manager (Endurance Manager) Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Crohn's & Colitis Foundation", "Interview Descriptions": "I was emailed a few days after I applied online to have a video call to screen for the position. It all seemed very average until I was asked what I was paid in my last positions. Once she noticed that this position (even though the title of manager is much higher than my previous) paid significantly less than I anticipated she basically told me that I did not want this job and ended the interview promptly", "Interview Questions": "How my past positions will help me with this position "}, {"date": "18 Aug 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Crohn's & Colitis Foundation", "Interview Descriptions": "two phone interviews, one face to face with board member and upper level management; it was very easy I felt like by the second interview I was actually leading it as opposed to the other way around  The person that did the phone interview was over 28 minutes late in calling me.", "Interview Questions": "What motivates you? What three things do you see as your biggest strengths? They ask a lot of questions about past events and volunteer development - be prepared to bring samples in"}, {"date": "8 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Crohn's & Colitis Foundation (New York, NY) in May 2015", "Interview Descriptions": "I applied for the job online, got an email couple weeks later for a skype interview, then went in for a in person interview. Got hired two days later. The process took about 3 weeks.", "Interview Questions": "A lot of behavior questions."}, {"date": "25 Jan 2017", "title": "Development Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Crohn's & Colitis Foundation (Kansas City, MO) in Feb 2015", "Interview Descriptions": "Had one in person interview. Then came into the office to meet with the chapter. Then a week later I had a phone interview. Did't hear back for about 3 weeks that I got the job. Seemed like the entire process took and unnecessary amount of time. Asked to take time to think about the offer but was asked to make a decision on the spot probably because the process took so long, someone was certainly dragging their feet.", "Interview Questions": "Why do  you want to work here?"}, {"date": "18 Nov 2015", "title": "Director of Stewardship & Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Crohn's & Colitis Foundation (Sheboygan, WI) in Feb 2015", "Interview Descriptions": "Board and personnel committee of approximately 8 individuals from different committees of organization.\r\nSecond Interview was with Overall Leader 1:1\r\nThird was my follow up and finally a job offer with some negotiation involved.", "Interview Questions": "Why they should choose me."}, {"date": "7 Dec 2014", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Crohn's & Colitis Foundation in May 2014", "Interview Descriptions": "Initially found job posted on and internship site, and i applied online. heard back in a matter of days via email, and we set up a phone interview. After being asked about my interest in the field and my past experience, we set up a time to meet in person. I was interviewed about a week later at their office. Got the offer a few days afterwards.", "Interview Questions": "where do you see yourself in 5 years"}, {"date": "27 Mar 2014", "title": "Development Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Crohn's & Colitis Foundation", "Interview Descriptions": "Started with a phone interview. The in-person interview was laid back. They wanted to make sure I was a go-getter and a hard worker.", "Interview Questions": "N/A"}, {"date": "5 May 2016", "title": "Senior Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Crohn's & Colitis Foundation (New York, NY) in Jan 2014", "Interview Descriptions": "Lengthy and involved more than 3 people. Had 2 rounds of in-person.\r\nHad to fly for one interview. Some staff are remote so they flew in for interviews.\r\nDid not meet local staff, just national staff throughout the process.\r\nInterviews were under 1 hour typically.", "Interview Questions": "most were situation questions and required you to describe a specific instance."}, {"date": "12 Sept 2013", "title": "CCFA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Crohn's & Colitis Foundation", "Interview Descriptions": "Quick response to my application with a phone interview. Two in person interviews. I started work about 10 days after submitting my application.", "Interview Questions": "N/A the interview process was incredibly informal and relaxed. Felt much more conversational than most interviews I've been on. Do make sure you know about Crohn's Disease and ulcerative colitis however, and if you have a personal story to share which illustrates your connection to the cause be sure to share. "}, {"date": "27 Sept 2012", "title": "Walk Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Crohn's & Colitis Foundation", "Interview Descriptions": "Within a week of sending my resume and cover letter I got a call back for a phone interview.  Interviewed twice on the phone with different levels of manager/directors.  In person interview was a breeze.  I came prepared and I left feeling that I had the job.", "Interview Questions": "What are your salary expectations?"}], [{"date": "24 Sept 2012", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Crohn's & Colitis Foundation (New York, NY)", "Interview Descriptions": "the interview process was great. the person who eventually became my manager was well prepared, asked questions that were specific to my experiences, and was very thoughtful. it was because of her that i became more excited about the position.\r\n\r\ni did a second interview with the VP of my dept and that was a different story. she was more scattered and all she wanted to do was make sure that i understood that this position involves basically being her secretary as well though it was not included in any part of the job description.", "Interview Questions": "she told me that even though she saw the position as one that someone could outgrow in 2 years would i still stay a few years after that even though there would be no potential for growth within the organization. "}, {"date": "12 Apr 2016", "title": "Endurance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Crohn's & Colitis Foundation in Aug 2012", "Interview Descriptions": "Had an in-person interview with Executive Director and National Manager, and was asked to create a marketing plan for future position. After marketing plan was created, I completed a phone interview with an Endurance Manager as a peer interview. Was then offered the position, and had to undergo a background check.  Was able to negotiate salary by $4,000 higher than initial offer.", "Interview Questions": "Do you have a connection with Crohn's & colitis? "}, {"date": "18 Feb 2016", "title": "Endurance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Crohn's & Colitis Foundation in May 2012", "Interview Descriptions": "The interview process involved 1 phone interview with the campaign manager, followed by an in person with the same person.  Then I met with the National Director and finally had a call with the local Executive Director. The questions were similar at each stage, but they asked about my past fundraising and sales experience and also how I would manage working remotely and organizing wearing many different hats.", "Interview Questions": "They asked me to pitch the fundraising program to a prospective participant. "}, {"date": "23 Mar 2016", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Crohn's & Colitis Foundation (New York, NY) in Apr 2012", "Interview Descriptions": "The review was very easy and consisted of 3 rounds. Just practice in the mirror a few times and I always give myself a pep talk in the bathroom mirror when I get to the interview. You will be interviewed by 2 or 3 members of the Sr. Management team. Just remember to relax.", "Interview Questions": "Standard Google interview questions.\r\nWhy do you want to work here? Strengths and weaknesses? Give me an example of a difficult situation, how did you handle it? Etc.."}, {"date": "6 Jun 2012", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Crohn's & Colitis Foundation in Mar 2012", "Interview Descriptions": "Seemed very unorganized. Asked questions on experience but could tell from the start they weren't interested.", "Interview Questions": "Describe your special event experience"}, {"date": "6 Sept 2010", "title": "Education & Support Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Crohn's & Colitis Foundation in Mar 2008", "Interview Descriptions": "I was first interviewed by phone by the National Patient Education Director. Within one week, the VP of Patient & Professional Education interviewed me by phone as well. Finally, the local Executive Director asked me to come in for an in-person interview.", "Interview Questions": "Tell us about yourself and your interest in this position."}]]