[[{"date": "21 Jun 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "The interview process consists of 3 interviews. It was pretty easy-going. Just be yourself. But I will say it's easier to get hired through and agency first then be offered a permanent position.", "Interview Questions": "Where do you see yourself in 5 years? Why do you want to work for the company? Etc."}, {"date": "18 Jun 2023", "title": "Senior Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "There are multiple interviews and the process can take weeks. They seem pretty thorough and you may need to travel to complete pre employment tasks. Seems like a great place to work.", "Interview Questions": "How would you handle a difficult patient?"}, {"date": "7 Jun 2023", "title": "Operational Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Human Resources interviewer was rude and adversarial. Shocking behavior from a gatekeeper. \n\nAn automated email initiated scheduling of my virtual interview with human resources rep within a week of submitting my application.", "Interview Questions": "Asked about my background and its application to the role."}, {"date": "4 Jul 2023", "title": "Research Technician I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2023", "Interview Descriptions": "It was 2 rounds of interview, first was with the Lab supervisor, then the second one was with the head of Clinical Research. It was overall very relaxed, they talked about their ongoing project.", "Interview Questions": "Tell me about yourself, Why are you interested in this position?"}, {"date": "21 Apr 2023", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "Terrible, long, bias, antagonist to POC. After four interviews, I still didn’t get chosen. I spoke to a recruiter, two managers, a Vice President, and a doctor. Even the VP said that the doctor was a piece of work. Very insulting to my time and experience.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "10 Apr 2023", "title": "Information Technology Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Talked with the initial recruiter, then got ghosted. Seems like a common theme of them just ghosting you. Never got a chance to talk to the team. I got assured that I would hear back, then after my follow up I never heard back.", "Interview Questions": "basic HR stuff questions, nothing out of the ordinary."}, {"date": "23 May 2023", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Weill Cornell Medicine (Upper East Side) in Apr 2023", "Interview Descriptions": "This is my experience as someone who works a for the hospital. You apply online, follow up by emailing the recruiter, a interview is extended to you by the service department", "Interview Questions": "To describe your experience? How do you feel about a role that will evolve in its expectations of workflow"}, {"date": "24 Mar 2023", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Multiple interviews with multiple departments and it took a long time. Might vary with your role within the company. My experience took a few months. Many different hands in the pot.", "Interview Questions": "What would you do in this situation?"}, {"date": "11 Mar 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Not going to lie, it was pretty typical. I did a lot of talking, which I don't normally do but I felt very much confident in my answers. I did get in and it was a great experience.", "Interview Questions": "Tell me about yourself? Why are you interested in WCM?"}, {"date": "23 Feb 2023", "title": "Grant Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "the process is fast and to point, the process from 1st interview to first day of job took 2 months. Interview questions are reasonable, just friendly chat with direct manager and HR", "Interview Questions": "Why are you interested in this position??"}], [{"date": "5 Feb 2023", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "One weekend, stay at the Bentley hotel, very well planned out and engaging. Graduate students seemed happy and productive in the program, which is always a good sign. The program is very competitive with others in the New York metro area, but student housing options leave a bit to be desired. Students can choose between hundreds of labs at MSK and Cornell, which is a huge bonus. Overall 5/5.", "Interview Questions": "Many questions from PIs on previous research and future research interests."}, {"date": "17 Feb 2023", "title": "Development Officer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2023", "Interview Descriptions": "Micro aggressive: I was told my thank you notes were not using the correct, formal tone and was reminded multiple times that Cornell holds Ivy League status. \n\nUnprofessional: During my interview with the hiring manager’s boss, she answered a text/email while I was in the middle of speaking. \n\nWriting Sample: submitted and never received feedback yet received feedback on thank notes \n\nUnnecessarily Long Process: I had a screening with HR, 1 on 1 with hiring manager, 1 on 1 with hiring manager’s boss and panel interview with lateral team members.", "Interview Questions": "Tell me about a time you built a relationship with a donor that lead to a positive outcome."}, {"date": "21 Feb 2023", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Weill Cornell Medicine in Jan 2023", "Interview Descriptions": "I contacted the PI directly and went in person to chat with them and numerous people in the lab. After all the one-on-ones (lasted about 5 hours total) they talked to my references and I received an offer through HR. They asked me about my background, future goals/interests, and previous projects.", "Interview Questions": "Do you have any questions about the lab?"}, {"date": "17 Jan 2023", "title": "Medical Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2023", "Interview Descriptions": "Interview process was pretty smooth Questions were straight forward. I would recommend this organization because the quality of care is five starts. They have good customer service within the H.R dept.", "Interview Questions": "common questions: how many yrs for experience? Do you enjoy working with patients?"}, {"date": "10 Nov 2022", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "It was quick, maybe 15 minutes. They asked about my experience in that past and gave me situations to see how I would handle them. The process was easy and the people were nice,", "Interview Questions": "How would you handle 2 of your bosses asking for different things?"}, {"date": "26 Oct 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2022", "Interview Descriptions": "The interview consisted of two rounds. I was interviewed by the head of the lab first, then by the other Ph.D. students and research assistants later. Everything was done online through Zoom.", "Interview Questions": "Describe one of my research experience. What techniques can I use? What techniques am I interested in? What projects in the lab am I interested in?"}, {"date": "5 Jan 2023", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Weill Cornell Medicine in Oct 2022", "Interview Descriptions": "It was swift and to the point. They asked basic interview questions regarding productivity. They were very friendly and asked the basic interview questions. I was allowed to ask a few questions at the end.", "Interview Questions": "Please tell me about yourself?"}, {"date": "20 Sept 2022", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "(1) Recruiter; (2) Peers; (3) Management.\nInterviews went well but never heard back from them after third interview. I should have contacted them in retrospect in order to get some feedback.", "Interview Questions": "All the questions were pretty typical and straightforward."}, {"date": "18 Feb 2023", "title": "Research Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Weill Cornell Medicine in Sept 2022", "Interview Descriptions": "A recruiter reached out after I applied via Indeed, and we discussed my goals and previous experience. They put my resume in for another position, but there was a long gap in time between our initial conversation and any follow up. Eventually interviewed over three separate times with different members of the team.", "Interview Questions": "Do you have any previous research experience? Greatest Strength?"}, {"date": "17 Aug 2022", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Easy interview process and quick call-backs. They had me go through 3 interviews for the Radiology department but after the first one, the remaining two are really for formalities and to see if they like you on a social scale.", "Interview Questions": "Are you able to work nights and weekends? How would you deal with difficult patients or why do you want to work at Weill Cornell. "}], [{"date": "5 Aug 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Pretty straight forward. After submitting app, there's a phone screen. You then meet with members of lab in a panel style interview. Then you meet with each PI individually. Not stressful at all", "Interview Questions": "How do you manage time and prioritize things on a daily basis?"}, {"date": "7 Jul 2022", "title": "Research Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Met with multiple people in the lab. I got opportunity to ask many questions as well! I appreciated this because it helped me learn more about the fit, culture and types of work i would be doing", "Interview Questions": "- Why this lab ? "}, {"date": "22 Jun 2022", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "I interviewed for multiple rounds for multiple labs which lasted about a month. The first round was an interview with a recruiter back in December who then told me I had to wait until April to start applying again because I would be a new grad. The next round was a Zoom call with the PI, and then a Zoom call with the current research assistant. I’m not sure if there were any rounds after that because I was ghosted by all the labs I talked to without any information about next steps.", "Interview Questions": "What are three words rear describe you?"}, {"date": "17 Jun 2022", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Straight forward interview process with seminar and meetings with departmental heads and researchers. Received feedback as well as an offer on the same day. Seminar was well attended with focus on application of knowledge to new areas", "Interview Questions": "Long term goals in scientific field"}, {"date": "28 Jun 2022", "title": "Patient Access Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2022", "Interview Descriptions": "It was a very friendly interview. I was asked about my experiences and learned about the positions from the hiring managers. It felt not too intimidating as I was expecting and overall just a friendly exchange", "Interview Questions": "Describe one of your difficult situations with a patient. "}, {"date": "19 Aug 2022", "title": "Senior Compensation Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine in Jun 2022", "Interview Descriptions": "The experience with the recruiter was the worst I've experienced. Most recruiters are easy to talk to, approachable, and good listeners. When asking this recruiter questions, he/she laughed sarcastically and said that WCM is non-profit and that they don't offer what I had asked. When explaining the benefits, he/she assumed my age and referenced a specific dollar amount which I later realized was an error on her part and that I wouldn't be eligible for. When I was made an offer, I countered the offer and the response was that it's unlikely the dept would agree. There was no communication for a few days whether or not he/she would ask the dept. Her/His emails were three words with terrible punctuation.  She/He was responsive once I declined the offer, at that point she/he called and emailed multiple times. \n\nThe interviewers were all great. Pretty straight forward questions, some about my background and others were behavioral/situational.", "Interview Questions": "Why do you want to work for WCM?"}, {"date": "5 Apr 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "The interviewers were very straightforward, friendly, and open to questions. I felt comfortable despite it being my first job interview as a soon to be college graduate.  They're very understanding.", "Interview Questions": "How does this fit into your future career aspirations?"}, {"date": "21 Jul 2022", "title": "Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Weill Cornell Medicine in Apr 2022", "Interview Descriptions": "Quality questions and job description. Interviewers made sure to give me a sense of my day-to-day and responsibilities. Also gave me the opportunity to ask my own questions. I was able to go over every part of my resume that I believe would help me in this position.", "Interview Questions": "What strengths can you bring in?"}, {"date": "23 Sept 2022", "title": "Research Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2022", "Interview Descriptions": "Calm, simple, conversational, learned a lot about the role. The PI was really nice, but I'd imagine that the interview would be dependent on the PI. Would recommend to all of my colleagues. ", "Interview Questions": "They asked me about my research experience. "}, {"date": "16 Feb 2022", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "The interview process was seamless and very tailored to the lab you are interviewing for. Questions are specific to the PI/lab you are interested in. Onboarding was really fast after the offer was given.", "Interview Questions": "Something about preparing dilutions and other lab associated questions"}], [{"date": "15 Oct 2021", "title": "Outreach Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "It was very comfortable, less stressful, allowing free flow of thoughts. They really encouraged an environment for continuous learning. I was a small part of a big team, I was made aware of my roles in our first meeting itself. They allowed me enough time to consider and think about getting on board, as it was an unpaid internship.", "Interview Questions": "Q: What are your future goals?\nQ: How do you see yourself in next 2 years?"}, {"date": "14 Oct 2021", "title": "Senior Patient Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2021", "Interview Descriptions": "The interview was standard, my interviewer was nice, informative and attentive to my questions. There will be multiple rounds of interviews with physicians and ultimately resume will be sent to HR for background check and references. Unfortunately due to low compensation, I decided to not move forward.", "Interview Questions": "Tell me about yourself and do you have any questions for me?"}, {"date": "8 Oct 2021", "title": "GMP Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2021", "Interview Descriptions": "Had an in person interview first. They talked about the position and asked me to share about my experience. After that, one of the employees gave me a tour around the facilities, showing the work environment, labs, commons areas, etc.", "Interview Questions": "How long I would be able to commit to the job, asked me for my experience and expectations. "}, {"date": "21 Oct 2021", "title": "clinical research database specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 months. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2021", "Interview Descriptions": "Took three months to get a call for an interview. Went through two rounds, one with the supervisor and one with the assistant director. The first interview wasn't bad, they were honest about the job and respectful. The second interview was pretty condescending. It was obvious that the second interviewer was not interested and was asking some pretty rude questions and was dismissive at times.", "Interview Questions": "Do you have regulatory experience?"}, {"date": "23 Oct 2021", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2021", "Interview Descriptions": "Interviewed with managers second interview with director 3rd with HR for credentials also for benefits review. The interview process is fairly easy just be yourself. Interview was held over zoom which made it even easier.", "Interview Questions": "Tell me shout your medical background? "}, {"date": "9 Sept 2021", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Met with 2 CRCs. About 30 minutes long, basic traditional questions. Not too friendly, and completely ghosted after the interview. Not even a rejection email. Very unprofessional in my opinion.", "Interview Questions": "Q. What are your strengths/weaknesses."}, {"date": "13 Mar 2022", "title": "Patient Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Sept 2021", "Interview Descriptions": "The interview process went very well. I was interviewed twice. I was asked the basic questions and I definitely did my research before the fact. The questions weren't challenging but it's always always recommended to ask more questions to the interviewer.", "Interview Questions": "Q: Why do you think you'll be a great fit into the department?"}, {"date": "17 Aug 2021", "title": "Extern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Very informative and detailed process. Employers were on time for the interview. I thoroughly enjoyed learning more about the people who worked there Salary was discussed without issue. I enjoyed speaking with all the team members and was offered a tour of the department. Great experience.", "Interview Questions": "Tell me about yourself?\nWhat were your other externships like?"}, {"date": "25 Aug 2021", "title": "Insurance Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Weill Cornell Medicine (New York, NY) in Aug 2021", "Interview Descriptions": "Straight to the point via zoom. interviewers were kind and professional. Questions were outdated and redundant (2 seperate interviews and they both asked the same exact questions on 2 different days ) and I don't think the questions helped to get a better understanding of me and if I was a good fit but the conversation went alright. It's been 2 weeks and still no word.", "Interview Questions": "Tell me about a time you had an angry customer"}, {"date": "27 Nov 2021", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in May 2021", "Interview Descriptions": "It was basically three rounds of interviews. The initial one was with the division admin and lab manager, the second was with the main principal investigators and the last was with the Chief of the Division.", "Interview Questions": "How long do you see yourself in this position?"}], [{"date": "4 Aug 2021", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Weill Cornell Medicine in Apr 2021", "Interview Descriptions": "Several interviews with both the team and directors. After the last interview with the director, there was no more correspondence. Reached out twice to follow-up and never received a response. Unprofessional if you ask me.", "Interview Questions": "What do you think you would bring to the team?"}, {"date": "12 Mar 2021", "title": "Office Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "A few questions with department manager and then a meeting with the MD you will be working with. Everyone was very nice and it was super easy and relaxing environment.  They ask very basic questions and kept the interview casual", "Interview Questions": "What is your past experience?"}, {"date": "9 Mar 2021", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "The first round was with the hiring manager for about 30 min, who will go through your resume generally. You have to be familiar with every experience on your resume, and prepare for questions about your salary expectation and some questions for the organization.\nThe second round interview will be with the director/supervisor in the lab/department for about 1 hour. You may be asked about \"what's your long-term career goal?\", \"What can you bring to the lab's project?\", and specific questions regarding your previous research experience details.\nAfter it, you may have another meeting with other team members.", "Interview Questions": "What's your salary expectation?\nWhy are you interested in the lab?\nWhat's your long-term career goal?\nWhat can you bring to the lab's project?\nQuestions about your previous research experience (in detail)"}, {"date": "4 Mar 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "After applying online the PI reached out to set up an interview. The interview itself was pretty comfortable and it was mainly an introduction to the lab and the lab members.", "Interview Questions": "Do you have any research experience? "}, {"date": "4 Mar 2021", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Interview was laid back and easy. Asked specific questions about my experience and nothing that stumped me. I felt comfortable and my interviewer was kind and friendly.  One of the best interviews I've ever been invited to attend.", "Interview Questions": "What made you want to be an MA?"}, {"date": "19 Sept 2021", "title": "Clinical Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at Weill Cornell Medicine (New York, NY) in Feb 2021", "Interview Descriptions": "EFFICIENT  GROUP INTERVIEW. Was given the opportunity to ask questions and the interviewees were gracious and professional although slow to follow with scheduling. The interviewers were encouraging, did not try to give me a hard time and staightfoward.", "Interview Questions": "What is your leadership style?\nWhat is your position on diversity?\nHow would you handle specific situations?\nWhat is your most challenging issue for you in dealing with working on a treatment team?"}, {"date": "1 Feb 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "interview with bosses.  Then an interview with Human Resources.  Then I waited several weeks to hear back from human resources.  the whole process seemed drawn out and  uncoordinated likely because or COVID.", "Interview Questions": "why did you leave your previous position"}, {"date": "14 Jan 2021", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "The process took a week. I met with the clinical trials coordinator, her supervisor, and finally the head of the clinic. The process was rather quick with typical behavioral interview questions. All were very nice and clear about the position and expectations.", "Interview Questions": "Do you have any research experience? "}, {"date": "13 Jan 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "The interview process was pretty easy. The person who took my phone screen was friendly and then the scientists who took my technical interview were pretty on point and asked me about my lab skills", "Interview Questions": "Tell me about yourself and your research experience"}, {"date": "11 Feb 2021", "title": "Senior Patient Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2021", "Interview Descriptions": "I interviewed via telephone first , then a zoom interview and in person interview with the same exact questions. Then I interviewed with senior operations. My interview with the chief admin was canceled. Not understanding why. I went through 4 interviews.  I loved the team and their questions. I don’t think the senior operations did not like me as much which resulted to my chief admin interview getting canceled", "Interview Questions": "Tell me a time when you dealt with an angry patient "}], [{"date": "15 Jun 2021", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2021", "Interview Descriptions": "about an hour long, typical questions and they seemed nice enough .   They made a mistake and scheduled me for the wrong time but were nice enough to still make time to meet me the same day.", "Interview Questions": "How do you deal with difficult co-workers? "}, {"date": "8 Dec 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2021", "Interview Descriptions": "I had three interviews and they said that there are three interviews in total for this position and they would contact me in a week. I had a preliminary interview with a current research assistant, a second interview with a researcher, and the third interview with the the project manager I believe. They wanted to see how interested I am in their studies and how similar my previous research assistant jobs were to this one. They said that they required a 2 year commitment to the study as a research assistant and they were looking for a \"best fit\" candidate, they weren't in a hurry to fill the position.  Each interview was pretty long and they asked a lot of questions because they really wanted a research assistant that's interested in that specific area of psychology research, and my previous experience was in a different area of psychology research.", "Interview Questions": "1. Why I was part of the research study that I previously worked in\n2. Why I stopped working at my previous research job\n3. If I had experience with this demographic "}, {"date": "26 Dec 2020", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "I first met with nursing manager of department first and then had interview with administrators and then members of department and then the head of department and HR last interview.", "Interview Questions": "If they were to ask ask people I work with to describe me, what would they say about me? "}, {"date": "31 Aug 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "It was overall easy and all the questions were expected. I had to do a writing sample just for general grammatical checks. I did not meet with many people, just three.", "Interview Questions": "Tell me a little bit about why you are interested in this position"}, {"date": "23 Sept 2020", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Aug 2020", "Interview Descriptions": "Three Round Interview meeting with office staff over zoom due to COVID restrictions. Took about a week in between rounds to hear back that I made it to the next round.", "Interview Questions": "Tell me about yourself and why you want to work here. "}, {"date": "29 Aug 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Weill Cornell Medicine (New York, NY) in Jul 2020", "Interview Descriptions": "Multiple interviews within a couple weeks of each other. First interview is a basic interview with recruiter where they give you a brief idea of the position, following interviews can be with 2-3 different people in the lab to see how well you fit with the atmosphere of the lab.", "Interview Questions": "Q: Why are you interested in this position?\r\n"}, {"date": "31 Aug 2020", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Jul 2020", "Interview Descriptions": "Interview was with ancillary staff and medical attendings.  I had 6 people total interview me. They never got back to me about whether I had the job or not. I found that to be extremely unprofessional and rude.", "Interview Questions": "Q: What made you apply for this job?"}, {"date": "31 May 2020", "title": "Administrative Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Long process as institutions require lots of screenings And they also require a several day orientation in which you are tested post class / orientation.  This is probably one of the most important aspects of the orientation. You will be using this software that you are receiving orientation & testing on.", "Interview Questions": "What was a difficulty you overcame? "}, {"date": "7 Jan 2021", "title": "Research Technician I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine in May 2020", "Interview Descriptions": "Applied online and was contacted by the PI via email for an interview about a week later.  The interview was done over video call and lasted about half an hour.", "Interview Questions": "Tell me about yourself\nWhat is your biggest weakness?"}, {"date": "20 Jun 2020", "title": "Applications Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in May 2020", "Interview Descriptions": "Pretty simple interview process. Phone interview with recruiter. If successful then you have a interview with managers. Pretty standard. However their return time to get back to you is non existent. Process took a good 2 weeks to have interviews but no response back on if you get the job. You will have to reach out to them.", "Interview Questions": "Describe why this role best fits you"}], [{"date": "8 Apr 2020", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Feb 2020", "Interview Descriptions": "Introduce myself than go through my resume. Then they asked me if I have any available Android Studio products to show them. After that, they asked me how much do I know about their research and asked me if I read the paper.", "Interview Questions": "What do you know about relational databases and Android Studio? "}, {"date": "8 Oct 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2020", "Interview Descriptions": "Phone screen was typical. Describe your background, experience, skills, etc. Hires depend on what previous lab experience you have and what the PI is looking for. However, no insight was provided about the next step in the interview process.", "Interview Questions": "Why do you want to work for Weill Cornell?"}, {"date": "24 Feb 2021", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Weill Cornell Medicine in Jan 2020", "Interview Descriptions": "3 interviews with PI, lab manager, and post-doc. Pretty casual. Expect to be asked in detail about skills and career goals. The facilities are very nice and it was a great place to work. Very strong, collaborative research community.", "Interview Questions": "Describe your experience working with cell culture"}, {"date": "28 Mar 2020", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2020", "Interview Descriptions": "Very formal, entirely reference based, all about HR connections. Prefer older individuals with experience, everything you think of when you hear the name Cornell. Seems like a very posh institution, \"willing to train\" and take all minorities of people. Pretty mediocre experience but not very humbling to say the least.", "Interview Questions": "What is one weakness that you could say  about yourself?"}, {"date": "18 Dec 2019", "title": "Business Analyst Research Administration Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Two panel interviews, one with team leads and another with managers. Plenty of open-thinking questions, previous experience related questions, and behavior questions. Overall a good experience with very smart individuals. The interview process can take several weeks to get an answer.", "Interview Questions": "How do you prefer to communicate?"}, {"date": "6 Dec 2019", "title": "Account Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "It was thru skype. overall a pleasant interview . asked all\r\nthe basic interview question like other interviewer. being really accommodating for virtual interview since i am out of town   .", "Interview Questions": "expected salary"}, {"date": "5 Dec 2019", "title": "Medical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "I applied for the position on 8/5/19. I received an email inviting me for an interview by the administrative manager the second week of November. I decided to write this review to show that you shouldn’t give up hope when applying to major hospitals in NYC. In my experience the process is always a long one. \r\nThe interview with the manager was standard, mostly questions about my background, why I thought I was a good fit and an explanation of the position. It went well.  I sent a thank you email the same day and received a reply within an hour to set up the second interview. \r\nI had a phone interview with the department supervisor the following week.  Again, the interview went well and I received a call that same day to set up the final interview with HR. He asked if I can meet with him that same week and I said yes. \r\nThe final interview with HR they went over salary and benefits. Everything was explained and I was told  that he was going to negotiate salary for me but it was based on my experience and what others in the same role were being paid.  Less than a week later I received a call with an offer. \r\nI accepted and am now in the process of on boarding.  Weill Cornell requires two ppd tests, so that alone takes two weeks. A little over a month from the first interview to my start date.", "Interview Questions": "What is something you need to work on?"}, {"date": "20 Oct 2019", "title": "Medical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Panel interview with divisional supervisor. The panel interview lasted for about 30-45 minutes. The panel asked questions to learn more about your skills and past experience while also gaining insight on how the skills would transfer to the medical secretary job description.", "Interview Questions": "What are one of your weaknesses? "}, {"date": "24 Oct 2019", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2019", "Interview Descriptions": "My recruitment process took one day shy of an entire month. I had 3 separate interviews with 3 different groups of individual(s).\r\n\r\nInitial phone screening 9/23\r\n\r\nFirst interview- 9/25: meet with my direct supervisor and her assistant.\r\n\r\nSecond interview- 10/11: panel interview meet with the head of department, operations manager and a practice manager.\r\n\r\nThird interview- 10/15: meet with an HR representative.\r\n\r\nCalled back on 10/17 to provide professional references.\r\n\r\nOffered position on 10/24 \r\n\r\nNone of the interviews were extremely hard, my advice is to be your self and have confidence.. all three interviews I was asked to discuss my resume from bottom to top. Give real life scenarios regarding your resume. They want to be able to relate to you and where you have came from within your professional background. \r\n\r\nEven though this was the longest interview process I have ever had, it makes sense on why WC went through so many selection processes to ensure you are the correct fit for the department and company.", "Interview Questions": "what is something you think you will have difficulty achieving in this role?"}, {"date": "1 Jan 2020", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2019", "Interview Descriptions": "Questions about your experiences that would help you in your position, both on resume and not listed on resume.  Asked about your five year plan and a walk thru your resume", "Interview Questions": "Five year plan? "}], [{"date": "15 Nov 2019", "title": "Biller Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine in Oct 2019", "Interview Descriptions": "20 mins asks questions about details and background. Past experiences. Describe a difficult situation. Where do you see yourseld in a few years. Describe yourself. Wanted to hire asap. Interview was good.", "Interview Questions": "Experince in billing "}, {"date": "6 Sept 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "Very enjoyable and quick process. Within two weeks I met with the research team, managers, principal investigators and HR. Meetings were somewhat informal, going over my resume and describing the position.", "Interview Questions": "Talk to us about your previous research experience. "}, {"date": "17 Aug 2019", "title": "Senior Patient Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 5 weeks. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "I’ve been interviewing for a senior patient coordinator position. So far, I’ve had four interviews. \nToday, I met with an administrator and my God was her attitude disgusting. \nI couldn’t believe it, because everyone else that I’ve met with were so warm and welcoming. She kept going at me as if I were some kind of convicted criminal and I was very offended by her “I know it all” nature. She even picked on my resume and tried to argue with me over the words “assistants” and “assistance.” Also, she implied that I “run from things” because I didn’t accept a part time offer from a doctor that I interned with. I told her I’m not obligated to accept a job offer because I wasn’t employed at the time. I explained to her that the commute was very expensive, so I was basically working to afford transportation to work and her response? Oh but still you weren’t working so why not. How ignorant. \nI even cried when I got home as to how horrible she treated me. I’ve worked at hospitals before and even at a bank and I’ve never been spoken to like this before. \nI’m going to be reporting this woman. Not sure how she got her job!", "Interview Questions": "What would the doctor you interned with say about you?"}, {"date": "1 Aug 2019", "title": "Practice Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Interviewed with ten people over the course of about eleven  days- the ninth and tenth (Human Resources and Practice Administrator) declined based on it not seeming that I was planning on furthering my education. This was a bit disappointing seeing as there was no evidence for those individuals to make that assessment, furthermore, the decision was made the day of my final two interviews, to which I can't help but to wonder why take up one hour, thirty minutes of my time after rearranging my interview schedule less than twenty-four hours prior if you already had your mind made up that I was not a good fit? Terribly disappointing, monumental waste of time, I felt lied to, ultimately, as I was told my degree  status was a non-issue for this role during the interview.", "Interview Questions": "Tell me about yourself."}, {"date": "11 Jul 2019", "title": "Research Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "The interview was held via Skype with the postdoc and the PI. They talked a little about their research and then went on to ask me questions. The interview lasted for about 45 minutes. They sent out a rejection email about one week later.", "Interview Questions": "Describe your research experience"}, {"date": "12 Jun 2019", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2019", "Interview Descriptions": "Weill Cornell held a Job Fair for Administrative Assistants and Medical Secretaries, and several recruiters joined together in interviewing applicants in a group session, explaining the positions and responsibilities  for positions offered.", "Interview Questions": "Tell me a little bit about yourself, and why are you interested in this position?”  "}, {"date": "3 Apr 2019", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "After submitting an application via email, I received a call about a week or two later asking me to confirm my interest in the job. Then I had a 30 min video chat interview, followed by another about a week later. Still waiting for the decision.", "Interview Questions": "What is something that you are struggling with internally? "}, {"date": "13 May 2019", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Apr 2019", "Interview Descriptions": "Three sets of interview met with five people in total. Everyone was very friendly and wanted to get to know me as a person. Last person I met with was HR, then got a call the next day, reference check, background check and medical screening.", "Interview Questions": "What are you career goals?"}, {"date": "18 Aug 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Apr 2019", "Interview Descriptions": "It was a group, speed dating style interview. Three possible candidates would enter the conference room at a time and have approximately 15 minutes with a representative from a different department of the hospital. Then each would switch and answer relatively similar questions. Most spent a lot of time looking over my resume and not asking questions.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "1 May 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2019", "Interview Descriptions": "Applied via career website and sent resume to PI. Got interview two days later, had to come back to meet PI the following week. After that, HR called and had to go in for an interview--HR interview is essentially a formality, just asked about start date, etc.", "Interview Questions": "What is your greatest professional strength?"}], [{"date": "20 Mar 2019", "title": "Research Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine in Feb 2019", "Interview Descriptions": "I was contacted by a PhD student in one of the research labs. Had a skype interview a few weeks later that asked about my resume and if I knew basic info about what the lab was studying. At the end of that interview I was then invited for an in-person interview two weeks later. There I met members of the lab and at the end of the interview was asked to give a few references. Three weeks went by and I heard nothing  from the person I was initially contacted by. I decided to send an email asking about the status of the position and received a response saying I was a top candidate but they went with someone who had more prior research experience than me. I am annoyed and irritated that they didn't even bother to contact me to let me know that I didn't receive the position. If I didn't email them I would have never gotten a response back. Also this was an entry level position with no experience required. I just didn't like how they acted and it was not professional at all to drag someone along like that waiting for a response for weeks after a second interview.", "Interview Questions": "What is your 5 year plan?"}, {"date": "2 Jan 2019", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Multiple interviews \nFirst with Pi, most concerning on the previous lab experience, and I was asked to submit a reference letter from my previous boss. then interview with senior labmates and HR. Finally I was invited to their lab to do a presentation about my previous work. Notifying me to get the job offer later", "Interview Questions": "Previous lab experience and pretty stick on your CV"}, {"date": "14 Mar 2019", "title": "Senior Medical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2019", "Interview Descriptions": "I applied to the position and received a call for an interview a week after. Once I went in for the 1st interview, I was called in for a 2nd interview, 2 weeks after my 1st interview. I received the job offer and I accepted.", "Interview Questions": "What past experience do you have with obtaining prior authorization for procedures and surgeries?"}, {"date": "10 Jul 2021", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2019", "Interview Descriptions": "Three interviews with professors and one with a grad student. Each 30 minutes, from background knowledge to personal questions all included. overall not very stressful but more like a test if it is a good overall fit.", "Interview Questions": "What is the research about you are currently working on? "}, {"date": "24 Jul 2019", "title": "Senior Medical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Weill Cornell Medicine in Jan 2019", "Interview Descriptions": "Applied online and received a response a month later. The hiring manager reached out through email to schedule the interview. I met with her and the physician. The interview went really smooth.", "Interview Questions": "Why are you looking for another job?"}, {"date": "15 Jan 2021", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2019", "Interview Descriptions": "Not many questions, pre arrival screening and also just wanted to get to know you as a person and why you want the specific job. Facilities were nice and staff was friendly.  About twenty five minutes long, but many candidates waiting for similar positions.", "Interview Questions": "Why do you like weill cornell medicine?"}, {"date": "25 Dec 2018", "title": "Compliance Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "Definitely was not easy but was not challenging either. Had to think on the spot for some questions but majority were interesting questions. They asked a lot of situational questions", "Interview Questions": "Name a time when you made a mistake and how did you fix it"}, {"date": "29 Jun 2021", "title": "Senior Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Weill Cornell Medicine (New York, NY) in Dec 2018", "Interview Descriptions": "Was very clear and scheduled well. There was a clear chain of command and the process was very smooth. They were accommodating as initially I was away and were able to schedule virtual interviews.", "Interview Questions": "How do I deal with difficult personalities in the workplace? "}, {"date": "28 Nov 2018", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "Presented CV, was invited for an interview and talk. Was required to give a  research seminar to the group prior to the interview. The proceeded to a one on One intreview.", "Interview Questions": "N/A"}, {"date": "21 Nov 2018", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Weill Cornell Medicine (New York, NY) in Nov 2018", "Interview Descriptions": "The interview process took about a month. In one day I met separately with 2 managers and a hiring supervisor of the department. They asked pretty general questions and told me the next step in the process is meeting with a few executive level staff, they told me it could take a while to meet with executive staff due to their schedules but I heard back an hour after I left asking if I could meet with them the next day.  The interviews with the executive staff are very brief, I guess they just like to have a role in the process. An hour after I met with them I got a call from HR to come in for an HR interview the next week. I met with HR, she told me I had to wait for the job listing to be up for 5 days before they can extend a formal offer. 5 days later they contacted my references and I got a call that I got the job!", "Interview Questions": "Strengths and weaknesses "}], [{"date": "6 Oct 2018", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2018", "Interview Descriptions": "Couple sessions Done through FaceTime . If candidate meet their job requirements, then the next step will be to meet face to face with their Human Resources, if the candidate succeeds, then candidate will be invited to meet the team and the last step is to meet with the NP team", "Interview Questions": "Senarios \r\nWhat makes the candidate stand out from other members "}, {"date": "20 Sept 2018", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Long interview process from applying to finding out if your their top candidate.  Over 3 hour interview. Seems as if this could have been shorter.  The staff were very friendly and courtesy. Parking is a downfall and traffic coming into Ithaca isn't great but welcome to Cornell.", "Interview Questions": "Questions weren't difficult.  Reflect and be honest. General interview questions . They want to know your general interest in your desire to work their.  "}, {"date": "20 Aug 2018", "title": "Research Technician I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Weill Cornell Medicine in Jul 2018", "Interview Descriptions": "First I had a phone interview with the HR manager and after a week, I got called in for a skype interview. The overall interview process was pretty standard.  I did not get any response after the skype interview so I assumed that I did not get the job.", "Interview Questions": "They asked me about my resume and past experiences."}, {"date": "31 Aug 2021", "title": "Regulatory Affairs Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2018", "Interview Descriptions": "The interviewer was 40 minutes late. Did not even provide a chair, after finally waiting for the interviewer for almost an hour, she showed up and kept on eating. \n\nVery unprofessional way of interviewing. After the interview I decided to not work with the team.", "Interview Questions": "I was only asked to tell them about me and my experience for the role. "}, {"date": "13 Jun 2018", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2018", "Interview Descriptions": "Applied online and was contacted by the PI a few weeks later. He asked for transcripts and a few letters of recommendation which were promptly set. Met with him in person for a short interview before he gave a lab tour and introduced me to his lab.  Currently waiting to hear back.", "Interview Questions": "Tell me about yourself"}, {"date": "24 Jul 2018", "title": "Research Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2018", "Interview Descriptions": "I received a quiz testing basic math and laboratory techniques. The interview lasted about 45 minutes and he mainly talked about his own research during that time. He was supposed to email me after a week with a decision, but I never received any such email. I found this discourteous and unprofessional.", "Interview Questions": "Why are you interested in working here? "}, {"date": "18 Apr 2018", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Two interviews. Very pleasant environment. They spent some time explaining my responsibilities and the overall work routine and then asked a few questions about my experience and future plans. The interviewer was very nice and answered all of my questions.", "Interview Questions": "What are your plans for the next few years"}, {"date": "26 May 2021", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Apr 2018", "Interview Descriptions": "Applied online, within a couple weeks I had an interview, and then was hired. The interview itself was with HR and they went over the basics of working at Weill Cornell and discussed benefits and hours.", "Interview Questions": "What brings you to Weill Cornell?"}, {"date": "14 Jan 2021", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Apr 2018", "Interview Descriptions": "Phone screen followed by multiple interviews HR screening, Administrator screening, management screening, leadership screening, faculty screening , offer followed and the entire process took about 3 weeks. The position needed to be filled quickly . Very thorough", "Interview Questions": "Why do you want to work here? How can you make a difference?"}, {"date": "22 Feb 2018", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Horrible experience from the moment I walked in.  It was extremely evident that the hiring manager did NOT want to be apart of the interview. She didn't ask me any questions, didn't not offer details regarding the position and played in her hair and looked at the ceiling the entire 10 minutes I was there.  Extremely disappointing to say the least.", "Interview Questions": "Name a scenario where you had to deal with a difficult patient?"}], [{"date": "28 Feb 2018", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Very basic research oriented interview with questions about publications. Discussion about the lab research and their path forward. Talk with the lab members and their research. The hiring process was quick but the HR was very slow with the benefits and the necessary clearance required. I had to wait a few days to start my work as I still had documentation to do which i was not told about.", "Interview Questions": "What types of projects I would like to work on from the lab ongoing projects ?"}, {"date": "30 Mar 2018", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2018", "Interview Descriptions": "Superb interview. It went smoothly and was very informative. We discussed projects that are ran in the lab and all the future possibilities. In addition, we discussed about how life is in NY in a perspective of a postdoctoral researcher and my future career goals.", "Interview Questions": "Techniques I was familiar with, when I would be available to assume the position and my research interests"}, {"date": "27 Jun 2019", "title": "Senior Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Feb 2018", "Interview Descriptions": "Got an interview through a staffing agency, which got me an interview. They emailed my resume to a manager and I got a call later that same day for an interview the next day. The manager on the phone mentioned to bring extra copies of my resumes because I might be meeting with other managers. Never mentioned that I would be walking to different sites all over the Upper East Side. I was under the impression it was all in the same building. My first interview was in the 55th street location, then he told me to meet with another manager on 61st street, then she sent me to 70th street. Never had an experience like that. I believe they should just have all interviews at one location otherwise they need to provide some bus fare or something to go to the other sites. All interviews were the same: questions about experience from resume, why I want to work for the company, etc. The final site I interviewed with one manager who, after our interview, told me I would be meeting with another person and had me wait in the waiting area for over 15 mins until they came back and told me I had to come in another day to meet with the other person. Okay fine. Overall, the process took way longer than I had expected. They should be more transparent about the duration of the interview process.", "Interview Questions": "Why do you want to work for Cornell?"}, {"date": "22 Nov 2018", "title": "Environmental Health and Safety Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Feb 2018", "Interview Descriptions": "The interview was broken into two parts. Two one hour long interviews with a fifteen minute break in between. The first section was with the direct manager and the second was with the current staff. Interview questions were generic and focused mainly on lab safety. Did not get the job but i wish the staff there would have acted more professional. I expected more from the staff in a big institution, to at least have the decency to inform the candidates if they didn't make the cut. I left the interview with a good impression but ended up ghosted by the whole department. \"We will have HR send over employment forms by the end of the week\" turned into HI ITS BEEN 6 MONTHS NOW WHERE ARE THE FORMS!!!", "Interview Questions": "Name one time you under performed on your last employment."}, {"date": "12 Jan 2018", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 5 months. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "After an email, in which I stated my interest to join the team. I was invited to send my CV and contacts of references. After that I was invited to a personal interview. During the personal interview day, I presented my research and got to meet several other members of the team.", "Interview Questions": "If you could cure one disease, which one would you choose?  And why?"}, {"date": "6 Jan 2018", "title": "Legal Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "I applied online and reached out to contacts who referred me to relevant personnel, went through a few people until the right person came up; initial phone screen; in-person interview; written skills assessment; behavioral questions; in-person panel interview;", "Interview Questions": "Qs: Substantive legal questions and exercises on IP,  licensing, sponsorships, partnerships, corporate transactions; behavioral questions on negotiation tactics, work style, team roles\r\n"}, {"date": "13 Jun 2022", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Weill Cornell Medicine in Jan 2018", "Interview Descriptions": "I applied online and recieved a call from HR. Then had several phone interviews and eventually went in person. I enjoyed meeting everyone there and think it was a great fit.", "Interview Questions": "Tell me about your self"}, {"date": "11 Mar 2018", "title": "Creative Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Dec 2017", "Interview Descriptions": "Applied online and had an interview the following week. Interview went great but the hiring manager said that the whole creative department may be moving to a new space.  All seemed well, have all the qualifications but never heard back from her. Been 4 months. Felt like the interviewer needed to fill interview quotas.", "Interview Questions": "Tell us about yourself."}, {"date": "31 May 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Dec 2017", "Interview Descriptions": "5 rounds of Interview, I was called in too many times. But I was offered the job soon after, all that ends well is well I guess. It was a very critical process, lots of questions. I think it's rare, my current boss is an extremely renowned professor.", "Interview Questions": "Technical experience based"}, {"date": "14 Nov 2017", "title": "Senior Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "After applying online I received a called from the dept practice manager for a in person interview. It took about 3 days to hear back from her and she advised that I will have a final interview with the HR recruiter. After having that interview I was offered the job. The whole process too k about 21/2-3 weeks.", "Interview Questions": "Why do i want to leave my current job?"}], [{"date": "3 Nov 2017", "title": "Patient Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "I first heard about the position through a friend. I emailed and got a response for an in-person interview. First interview was easy-going and friendly. The following interview with HR was incredibly brief.", "Interview Questions": "What makes you a good fit for this role? What are your longterm goals? "}, {"date": "10 Nov 2021", "title": "Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Nov 2017", "Interview Descriptions": "I applied online after a week or so I got called in for an interview. After my first interview with Human resources I got an interview with the hiring manager at the location where I would start working at.", "Interview Questions": "What are your strengths and weaknesses?\nWhere do you see yourself in 5 years?\nWhy do you want to work for Weill Cornell?\n"}, {"date": "3 Nov 2017", "title": "Practice Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2017", "Interview Descriptions": "Had numerous interviews for this particular role took a total of 3-4 weeks.  In all I had five great interviews and each one made me love the dept even more.  After my last interview I received a call from HR with a job offer.", "Interview Questions": "Have you ever been in a difficult situation at your previous job? How did you handle it? "}, {"date": "27 Nov 2017", "title": "Senior Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2017", "Interview Descriptions": "Greeted well and basic questions that pertained directly to the job at hand. Touched base with background and how it can be contributed to the job and allowed to discuss a little more about your self . All smiles and great edicate", "Interview Questions": "What would you say your strengths and what are your weakness"}, {"date": "31 Aug 2017", "title": "Patient Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "The interviewer seemed outwardly tired, and the interview was very short.  It was difficult to fully answer at least one of the questions asked before the interviewer interjected, preventing elaboration.  I was then made to wait to see if someone else could meet with me, but ultimately nobody did.", "Interview Questions": "Why do you want to work in healthcare?"}, {"date": "27 Oct 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Sept 2017", "Interview Descriptions": "It was a very friendly interview experience. All my interviewers were warm and detailed on what they were looking for in the position. Considering I was applying for one particular department, the interview process could have been a little different than the standard proceedings. I had gone in to interview three times with different people in the department. (One was a group  interview) and a final interview with HR where I received my offer.  When interviewing for this place, just be prepared to go in for interviews multiple times.\r\n\r\nOnce you accept the offer you have to go do blood work and other medical exams at their affiliated clinic and go into their office to set up an appointment for your On-boarding process to receive your Photo ID/Security Pass.", "Interview Questions": "Name a time where you had to deal with conflict in the office and describe how you dealt with the situation."}, {"date": "5 Aug 2017", "title": "Data Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Three phases in the interview process. The first interview involved interviewing with the director of the department. The second interview was with the physician involved with the department of interest for the clinical trials and then the third was with HR, which is the only department that can formally extended a job offer to you. The interview process took a full month before I found out I got the job.", "Interview Questions": "why did you apply for this position?"}, {"date": "26 Nov 2018", "title": "Account Coding Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jul 2017", "Interview Descriptions": "the process was straight forward and went as planned. The HR rep was very nice and patient. She made me feel a lot more calm about the process. When meeting with the team they seemed like a great place to work!", "Interview Questions": "What are my goals?"}, {"date": "11 Feb 2018", "title": "Director, Program Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2017", "Interview Descriptions": "Rapid and initially professional, until they visibly changed their mind through the process and decided to modify the job description, which meant that I was overqualified. It was a big disappointment to me but also indicated they really had no clue what they wanted. 80% staff turnover in that team since.", "Interview Questions": "How do you deal with stress?"}, {"date": "1 Jan 2018", "title": "Development Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2017", "Interview Descriptions": "The interview was very formal, there were many questions asked right after another and a lot of information. I interviewed with two people for 30-40 minutes each.  Then I came back for a panel interview with peers.", "Interview Questions": "Why WCM?"}], [{"date": "16 May 2017", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "I applied directly with the PI (Principal Investigator) and was called in for an interview about a week later. Trying to apply through HR is a complete waste of time. I met with the PI only, and the interview revolved around my undergraduate coursework and prior research experience. I brought a copy of the paper where some of the research I contributed to had been published.\r\n\r\nBut the PI wanted a minimum two year commitment to the position. There was also the expectation that I share his level of interest in the research, meaning working nights and weekends. And since Research Technician positions are grant funded, the low salary being offered was all I would be paid. With all the expected overtime, it would basically work out to minimum wage. And since Research Technician positions are grant funded, the PI couldn't guarantee me job security even if I wanted to stay two years. If his future grant proposals were rejected by NIH, NSF, etc., there would be no money. There were no promotions or decent salary increases in the pipeline either. It was basically a terminal position with small cost of living increases at the most.\r\n\r\nI received an email from the PI about a month later letting me know the position had been filled. But I knew from the interview that it wasn't going to work out. The job description doesn't exactly advertise it, but it basically only works if you intend to go to medical school in a few years. And you need to come from a rich family, because the non-negotiable salary isn't enough to live on in New York City.", "Interview Questions": "Can you make a two year commitment?"}, {"date": "26 May 2017", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in May 2017", "Interview Descriptions": "Was contacted about a month after I applied via email. After answering a few introductory questions, I was called in for an interview. Met with PI and several members of the lab. All were very kind, and the conversations were mostly about the research being done at the lab. I followed up, and about two weeks later the PI let me know the position had gone to someone else.", "Interview Questions": "Walk me through your resume."}, {"date": "12 Jun 2017", "title": "Bioinformatics Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in May 2017", "Interview Descriptions": "Someone from the lab I was interested in contacted me about a phone call. We called a few days later. The whole process was very relaxed and informal. We discussed interest in the job and what the position would entail.", "Interview Questions": "Why would you like this job?"}, {"date": "8 Jun 2021", "title": "Senior Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Weill Cornell Medicine (New York, NY) in May 2017", "Interview Descriptions": "Everyone was very friendly, and the process was easy and quick. Received offer right away after the reference contact went through. Highly suggest to work for the company if you like fast-pace environment", "Interview Questions": "Tell me about yourself and why this company?"}, {"date": "4 May 2017", "title": "Senior Patient Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Apr 2017", "Interview Descriptions": "This was an absolutely horrible experience.  They invited me for an interview, and then it turned out it was actually several interviews.  Also, the only interview that they actually asked questions for was a position that I never even applied for.  Or was warned that I would be interviewing for so I could prepare. All three of the people interviewing me for the actual job I wanted just gave me a job description and asked if I had any questions for them.  I got a call later that night that I didn't get the job.", "Interview Questions": "Do you have any questions for me?"}, {"date": "7 Nov 2018", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Apr 2017", "Interview Descriptions": "The interview process was in two parts:\r\n- a one-to-one interview with future supervisor, discussing research projects and fit in laboratory, \r\n- a scientific presentation to be given at the local lab meeting, also meeting future colleagues.", "Interview Questions": "Motivation to work in academic research setting and willing to do long days/hours/be flexible."}, {"date": "11 May 2017", "title": "Patient Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Apr 2017", "Interview Descriptions": "I applied online, they first did phone screen and then gave me a date for interview. They also send me an email to confirm the interview. Sometime, there's also second round of interview for same position.", "Interview Questions": "Do you have anymore question?"}, {"date": "27 Apr 2017", "title": "Senior Patient Care Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Weill Cornell Medicine (New York, NY) in Apr 2017", "Interview Descriptions": "I applied through a staffing agency. The HR emailed me the description of the position and contacted me within the same day I responded with my availability to have a brief phone interview. They called me later the same day as the phone interview to schedule an in-person interview.", "Interview Questions": "Why did you leave your previous job?"}, {"date": "9 May 2017", "title": "Medical Records Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Weill Cornell Medicine (New York, NY) in Apr 2017", "Interview Descriptions": "First Interview with Manager, asked basic questions and asked to wait for them to contact me for next interview with Practice Manager. Waited for 4 weeks and got call back for interview. Interview with Department manager was brief and only asked a few questions. Now waiting for them to contact me for another interview with Chairman.", "Interview Questions": "What make you apply this position?"}, {"date": "28 Apr 2017", "title": "Senior Patient Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2017", "Interview Descriptions": "It was very brief since the recruiter did not ask any questions. Waste of time. The recruiter went over my resume just like in the phone interview, that was it. (Keep in mind they only have two recruiters one hispanic and caucasian). It was hard to focus  because the recruiter had very bad case of herpes simplex. She told me it can take up to a month to hear anything but encourage me to keep applying online. I listened to her advice and it turns out she and only one other person are the ONLY recruiters so of course she denied any other position I would apply too. This facility is RACIST and barely hires miniorites. The office speaks for itself. She knew from the moment she saw me she would not ask me any interview questions. Other miniorites applied the same day and also got the same response. Go figure.", "Interview Questions": "N/A"}], [{"date": "26 Mar 2017", "title": "Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine in Mar 2017", "Interview Descriptions": "The entire process took about 3+ weeks ... I was contacted by a HR recruiter to go over my resume, qualifications, and answer questions about what type of positons I was interested in.\r\n\r\nI was then asked to come in for an 1:1 meeting with the recruiter and she scheduled me for a panel interview with one of the departments within Weill Cornell Medicine. \r\n\r\nAfter a week I was asked to come in for a 2nd interview to meet with the doctor and then contacted by the recruiter the next day to confirm my references. I was called with an offer later that evening.", "Interview Questions": "Why are you looking to leave your current positon? \r\nWhere do you see yourself in five years?\r\nWhat would you do if the phone was ringing, a patient needed help, and you had to respond to an email?\r\n"}, {"date": "23 Feb 2017", "title": "Clinical Trials Administrator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "The structure of their HR department is a mess. I was contacted by them regarding a position, and they actually thought they were calling someone else. The interview process was so so, their research program isn't very structured.", "Interview Questions": "Why do you want this position"}, {"date": "9 Apr 2019", "title": "Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2017", "Interview Descriptions": "First I sent my curriculum vitae and my cover letter, it took two or three weeks until they asked my to do and interview by skype as I wasn't in the city, and then I had an interview it last 20 minutes or more.", "Interview Questions": "Why do you want this job?"}, {"date": "5 Mar 2017", "title": "Data Control Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Weill Cornell Medicine in Jan 2017", "Interview Descriptions": "1st interview with Assistant program manager after 2weeks of application, 2nd interview the week after with Program Manager, PI, n HRM. Asked great questions and they were impressed by my experience and conversation. They asked my reasons for changing jobs, career goals, Oncology experience, research practice of GCP,ICH regulations. I had search some info about the company and asked some relevant questions", "Interview Questions": "Why do you want to leave your current job?"}, {"date": "20 Feb 2017", "title": "Senior Medical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2017", "Interview Descriptions": "I applied in December 2016 for the position online. About 3 weeks later, i received an email stating that i am in consideration for the position and will get a follow up soon. Next I received an email stating i needed to have a phone interview with HR. After the phone interview, I had an inperson interview first with two  Assistant supervisors and then the Call Center Manager and Main supervisor . I was asked a lot of behavioral questions and the standard tell me about yourself questions. I also asked lots of question which they seemed to like. About a month after my interview I received my offer letter.", "Interview Questions": "How do you multitask at your job?"}, {"date": "18 Apr 2018", "title": "Senior Contracts Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2017", "Interview Descriptions": "Panel style interview with department heads and a few of the other contracts specialists. Each interviewer explained what they did within the group and then proceeded to ask ask a few questions that were relevant to the position. At the end I was given the opportunity to ask each of them questions relevant to their specific job within the department.", "Interview Questions": "What kind of experiences have you had with negotiation?"}, {"date": "4 Jan 2017", "title": "Telecommunications Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Weill Cornell Medicine (New York, NY) in Dec 2016", "Interview Descriptions": "Thorough look into my past experience as well as testing me on my knowledge with networks, PBX and Avaya work environment. tested me on my knowledge of Avaya equipment, SIP, Voice Portal, SNC, AES, CM and CMM.", "Interview Questions": "Can you prepare a network scheme involving 2 or more PBX's connecting to a  Primary location?"}, {"date": "10 Feb 2017", "title": "MA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through a staffing agency. I interviewed at Weill Cornell Medicine (New York, NY) in Nov 2016", "Interview Descriptions": "interfviuew was great i ws interviewed by three people and they all asked me question that wasnt hard was nice and smoothe fell inlove the first time i step into that place and was praying i gt the job and god answer my prayer and i did get a call back 2 days after", "Interview Questions": "why did u leave previous job"}, {"date": "15 Nov 2016", "title": "Patient Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2016", "Interview Descriptions": "I applied online for a few different positions and less than a week later was contacted via e-mail by a recruiter asking if she could schedule me for brief telephone conversation. After the telephone conversation she asked to meet for a in person interview where we discussed my resume and the different positions that were open that I'd be a match for. She  was polite and said she would pass my resume to the hiring managers for the positions that matched my resume experience and if anyone is interested that they would either contact me directly or she would. She said I could be waiting anywhere from two weeks to a month for a response but if I didnt hear from her within a month to contact her and follow up. Well its been two weeks and I haven't been contacted however I did reach out to the recruiter to update her on my new contact info, so that I wouldn't miss any possible job opportunities but unfortunately she has not responded but I'm sure thats due to her busy schedule. Im now reading that waiting for a response and they interview process can't be a very lengthy dragged out process but all the best to those during the waiting period.", "Interview Questions": "Explain your skills and previous job responsibilities ?"}, {"date": "16 Nov 2016", "title": "Research Aide Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2016", "Interview Descriptions": "Applied one month ago and had a phone interview  4-5 Weeks later for 15 minutes. Discussed experience and work abilities. Went through the resume with HR recruiter. She discussed my goals and my ability to perform patient care activity as well as prior research experience. Very brief phone interview and now waiting on to hear back for an in person interview.", "Interview Questions": "What are your future goals?"}], [{"date": "2 Feb 2020", "title": "MD PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2016", "Interview Descriptions": "Typical for md phd interviews, mostly with scientist, one for the actual med school. You will interview at each of the institutions and you have some choice of interviewees, but not all requests are honored.", "Interview Questions": "What would you do if you don't get into an md/phd program?"}, {"date": "7 Mar 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2016", "Interview Descriptions": "they went over my resume with me. Asked me about my years of experience and what I offer to the job. They also asked about my future career goals, my strengths and weaknesses.", "Interview Questions": "What is one of my weaknesses?"}, {"date": "29 Mar 2017", "title": "Account Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2016", "Interview Descriptions": "The people I interviewed with were sweet and friendly. They asked many questions in regards to the job that I was interviewing for. Some questions were technical others were from past experiences from my previous jobs.", "Interview Questions": "Do you like to work in a team Environment?"}, {"date": "21 Jan 2017", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2016", "Interview Descriptions": "Very straight forward and simple conversation about my research experience and what it is I want from the job. The representative was very friendly making it easy to maintain conversation.", "Interview Questions": "What is my 5 year plan?"}, {"date": "20 Sept 2016", "title": "Financial Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "Applied online and was contacted within a week or two. Had a quick 15 minute phone interview going over basics of my interview. Had an in person interview about a week later. A couple behavior questions but mostly questions based on experience and teamwork", "Interview Questions": "Have you worked part of a team to complete a goal? What was the task? What is your best accomplishment at your current job"}, {"date": "19 Sept 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "Regular interview questions asked, but overall the interview process took to long since they took long to get back with a time to meet. Multiple interviews, HR person, and two other from lab.", "Interview Questions": "Tell me about a difficult time you encounter with a patient?"}, {"date": "22 Dec 2016", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Weill Cornell Medicine (New York, NY) in Sept 2016", "Interview Descriptions": "Multiple phone and in person interviews. Time consuming process due to the number of on-site interviews required. Everyone on the teams I spoked to seemed knowledgeable and like good people to work with. Most had been there for years. The actual interviews went well which made overlooking the logistical issues of the process possible.\n\nThe problem is their internal communication amongst each other (HR, teams, Directors) is poor. For example one is completely unaware that you've already been on-site to interview multiple times.\n\nI had interviews rescheduled on me for which i took vacation from my job for and I wasn't notified until shortly before the scheduled interview. They are not intentionally inconsiderate but just too preoccupied to be aware of the fact that you have a job and need to allocate money and time to meet with them.\n\nAdditionally they were not on the same page in terms of the salary they were willing to offer for this position. Which led to confusion come offer time as the range discussed on two separate occasions two months prior was never even feasible despite it being conveyed that the manager was aware and ok with the range.  And we are talking a 30% differences from the bottom end of that range to the offer. This resulted in me being led to believe there was a lot more money to be offered then was and as a result, led to both sides basically wasting each others time interviewing in the first place.\n\nLastly, after complimenting all of those I met with and the organization I was treated rudely by the HR recruiter (i literally just complimented that person as well) who became upset when I rejected the offer and proceeded to explain all the reasons why they were unable to offer more which was basically a list of reasons not to work there. I was not upset that they could not offer more. The market for the position is what it is. what bothered me was that this could have all been avoided. I tried to convey that in hopes it would provide a change in their process so someone else could avoid this problem but it was not heard as like I said the HR recruiter was too upset to listen. I ended the call professionally once this happened and that was that. A lot of time wasted, and if they had their internal communication better organized we could have stopped the process after the first call.\n\nAgain I will reiterate that the people on the teams seemed like good people to work with. I would recommend anyone interviewing verify the potential salary early on and confirm that the person you are talking to is in fact knowledgeable of the salary range and has authority to communicate that range. Because I did on two occasions and then come offer time was disappointed and felt as if my time was wasted.", "Interview Questions": "General interview questions related to job tasks, and why you are looking to move."}, {"date": "10 Dec 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Sept 2016", "Interview Descriptions": "The process takes a while. Often times there's a posting online that they created for HR purposes so that someone who was already offered the position internally has something to initiate the transfer process and you're wasting your time because they already have the position. The interview itself is more behavioral to determine if you're personable enough interact with patients.", "Interview Questions": "How would you resolve a situation with a difficult patient?"}, {"date": "19 Sept 2016", "title": "Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Aug 2016", "Interview Descriptions": "The Human Resources personnel are very informative and organized. I first had a phone interview and then was asked to come in for a 1:1. After the one on one I was asked to meet with the manager form the department I would be working in along with the person who conducted the  one on one. Finally, after completing two interviews I had a third and a day later received the call.", "Interview Questions": "Why do you want to work for Weill Cornell Medicine?"}, {"date": "18 Jan 2019", "title": "Data Control Coordinaotr Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Weill Cornell Medicine in Aug 2016", "Interview Descriptions": "Seamless, pretty standard. After applying online, I received an email from the clinical manager to set up an interview date within the week. Interview with Clinical Research Manager was one on one. She asked the typical questions and returned with an offer after 2 weeks.", "Interview Questions": "How do you handle deadlines?"}], [{"date": "24 Mar 2017", "title": "Patient Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Weill Cornell Medicine (New York, NY) in Aug 2016", "Interview Descriptions": "Went to several interviews over the course of 2 months. Met with about 5 different departments, numerous practice managers and HR. The interviews seemed have gone EXTREMELY well seeing as i was chosen for 2nd and 3rd itnerviews within a given department. However, i was never chosen and i believe it was because i'm a student and could not dedicate myself to the role they wanted. However, the HR rep continued to pursue positions for me constantly and send me on interviews without ever providing me with feedback as to why i continued to not be chosen. I finally just stopped interviewing. It was becoming vey tiresome.", "Interview Questions": "How do you deal with angry customers"}, {"date": "1 Aug 2016", "title": "Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jul 2016", "Interview Descriptions": "Applied online for an \"Open Interview Day\" position for people interested in administrative fields. On 7/5 I got a call from HR which turned out to be a brief phone screening and then she invited me for an in person interview for one of the departments. She forwarded my resume to different departments and within the next two weeks I got calls to come in for interviews. However they notified me that if I was selected to come in again, I would be meeting with the other managers as well. The week after I got a call from HR again saying she thought of me for a position within another department. This interview was different in that the recruiter prepped me and that I met with all the managers at once. I left that interview feeling pretty confident. Within a week, the recruiter called me again saying the department liked me a lot and the next step would be to contact my references. On July 29 I got a job offer.", "Interview Questions": "Why do you think your old employer kept you around for so long?"}, {"date": "3 Jun 2016", "title": "Account Coding Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "I applied on a Friday and got the call on the same day to interview for the upcoming Tuesday. Went into the interview on Tuesday, nervous of course, and it went great.", "Interview Questions": "What made you want to get into this field?"}, {"date": "9 May 2016", "title": "Front End Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Went through a recruiter. On the day of the interview, I met with various individuals. Both in group and individually. They seemed very prepared and took a lot of notes. Through things went well but never heard from them. Everyone gave the impressions that they were happy to be there.", "Interview Questions": "Why do you feel you are best suited for the position?"}, {"date": "15 Apr 2016", "title": "Grants Administrator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "Too many people to interview with and unnecessary. You start out with a 1:1 with HR, then a 1:1 with the hiring manager and maybe few more people, and then a panel interview with a bunch of people sitting around a table asking questions.  It feels very intimidating and makes the candidate very nervous.  You are not getting a good representation of a person that is very nervous during a panel review unless you want them to do presentations.  I did not like the interview process.", "Interview Questions": "Why am I leaving my prior job?"}, {"date": "3 Jun 2016", "title": "Research Aide Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Apr 2016", "Interview Descriptions": "First had a brief phone interview with a HR recruiter. A week later, received an invitation for an in-person interview. Was short and sweet. I was told I would hear back in 4 weeks. After waiting 5 weeks I contacted one of the interviewers who informed me the position had been filled.", "Interview Questions": "Tell me about yourself, your past work experience, career goals, etc."}, {"date": "1 Apr 2016", "title": "Research Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2016", "Interview Descriptions": "I was emailed requesting a good interview date. The interview was with the Laboratory Manager and Two Postdocs. The Interview lasted no more than 30 minutes. Before the interview started I was given a tour of the lab facilities. Everyone was very nice and easy to get along with. This was followed by an HR interview to hand in transcript verification.", "Interview Questions": "Can you describe the process for completing a western blot?"}, {"date": "25 Apr 2017", "title": "Research Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2016", "Interview Descriptions": "Initially sent an email to cardiovascular group head and got a call setup. Presented my current research work then a follow visit was scheduled but was not an official interview as travel expenses were not covered. Did not hear follow up for extended amount of time as follow up call was postponed repeatedly.", "Interview Questions": "Why are you leaving your company?"}, {"date": "14 Jan 2016", "title": "Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2016", "Interview Descriptions": "I had to do an interview with HR. Hr forwarded my resume to different departments.  I got a call after a week by different departments to be interviewed by office managers.  After that, I just got a call from  the office of the Administration head that i will be scheduled for an interview.", "Interview Questions": "What are your weaknesses?"}, {"date": "28 Jan 2016", "title": "Research Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2016", "Interview Descriptions": "I applied online and directly contacted the PI to follow up. We set up a relatively casual phone interview and talked about my experience.  After thinking I would be a good fit, the PI initiated the more intense process with HR. I ended up being interviewed by the PI, an HR representative, and a veteran lab manager at a neighboring lab. I was offered the job exactly one week after my official interview.", "Interview Questions": "Why do you think you would be good in this role?"}], [{"date": "18 Oct 2018", "title": "Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2015", "Interview Descriptions": "My first interview was with HR then my second interview was with my hiring manager. Both very pleasant and both were very professional. I did not think that they would hire me so fast, I am very happy with my experience.", "Interview Questions": "What are my goals?"}, {"date": "17 Sept 2015", "title": "Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "Interviewed with immediate supervisor, then the physicians and the rest of the staff that I would be working. The entire process took 3 months.  Research is key. You need to research everyone that could potentially interview you.  They will be impressed if you are able to recognize the physicians and their accomplishments.", "Interview Questions": "Where do you see yourself in 5 years? Why do you want this position?"}, {"date": "20 May 2017", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Weill Cornell Medicine (New York, NY) in Sept 2015", "Interview Descriptions": "There was an initial phone interview. Then an in-person interview approximately a month after the phone interview. I interviewed right at the lab with several supervisors and had a tour of the lab. The in-person interview lasted about 2 hours.", "Interview Questions": "Talk to me about your experience as an undergraduate. "}, {"date": "25 Oct 2015", "title": "Patient Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Weill Cornell Medicine (New York, NY) in Sept 2015", "Interview Descriptions": "I applied on the Weill Cornell career website. In 2 days, I was contacted by a recruiter who asked me a few general questions then invited me to a talent event. Have yet to hear any word since then and it's been a month.", "Interview Questions": "Why do you want to work for Weill Cornell?"}, {"date": "7 Jan 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 months. I interviewed at Weill Cornell Medicine (New York, NY) in Aug 2015", "Interview Descriptions": "I had a one on one interview with both the department chair and administrator. the process was overall fast. I was satisfied overall, but a bit disappointed over time in the academic environment.", "Interview Questions": "I was asked some questions related to my career goals, past present and planned projects, scientific expertise, etc..."}, {"date": "11 Apr 2018", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Weill Cornell Medicine (New York, NY) in Aug 2015", "Interview Descriptions": "Interview\r\n\r\nresearching interview. It went smoothly and was very informative. We discussed projects that are runing the lab and all the future possibilities in our area. In addition, we discussed about how life is in NY in a perspective of a postdoctoral researcher and my future career goals.", "Interview Questions": "Techniques I was familiar with"}, {"date": "23 Jul 2015", "title": "Research Aide Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "Interview involved meeting with four different people: two doctors and two representatives from Human Resources.  One interviewer noted that position duties would be significantly different from what was listed in the job description.  Otherwise, the interview process was typical with regards to expectation of what an interview normally is like.", "Interview Questions": "Can you tell me of a time when you were required to write reports or present in and to groups?"}, {"date": "28 Jul 2015", "title": "Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Weill Cornell Medicine (New York, NY) in Jul 2015", "Interview Descriptions": "Went on LinkedIn and connected with a Talent Aquistion Specialist from Weill Cornell and I sent her an email about my interest in working with the company (7/17). The TAS then called me and set me up wit a phone interview (7/20) basically a phone screening, she then set me up with an interview with a Recruiter later that week (7/23). Had an interview with the recruiter, we went over my resume and discussed the best positions for me at Weill Cornell and she scheduled a panel interview (7/27). Went to the interview , and received an offer the next day.", "Interview Questions": "What is one of your professional weaknesses? "}, {"date": "1 Aug 2015", "title": "Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Weill Cornell Medicine (New York, NY) in Jul 2015", "Interview Descriptions": "Took 1 whole day. Met with the clinical director, colleague, PI of the study and again with the clinical director. Unsure if I specifically applied for this position, but was sent an email and told that my resume was provided to them from HR.", "Interview Questions": "Would you be prepared to be versatile and meet all the demands for this position? What experiences have you had that show this?"}, {"date": "5 Oct 2015", "title": "Research Aide Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jul 2015", "Interview Descriptions": "I had three interviews, each with someone higher up. Everyone was very friendly and the setting felt relaxed. However it seemed a bit disorganized as one of the interviewers failed to show up one day and they never responded after to my inquiries after the last interview.", "Interview Questions": "Tell me about yourself, why do you want this job?"}], [{"date": "18 Jul 2015", "title": "Senior Medical Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2015", "Interview Descriptions": "I met with and HR recruiter for a exploratory interview, then my resume was sent to different departments, soon I was sent on an interview.. Met with Practice Supervisor, went over the position, asked a few questions.. about the position, desired salary. I received a call a few days later with an offer.", "Interview Questions": "Do you have any questions, you should always."}, {"date": "5 Jul 2015", "title": "Research Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2015", "Interview Descriptions": "I got the interview through an employee referral.  I had an introductory skype interview and then an in-person interview with about 5 senior individuals within the team. Interview process was not technical, but instead they asked about past experiences and resume.  Overall everyone was really friendly and welcoming. The process took about 3 weeks from initially setting up the interview to hearing back from the PI.", "Interview Questions": "Describe your past experiences in research?"}, {"date": "15 May 2015", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Extremely easy and expedited. Had 4 interviews in 2 weeks. Easy to work with department HR, and there was excellent communication throughout. First had a phone interview, followed by interview with department administrators/HR, and then multiple interviews with attending physicians.", "Interview Questions": "What is the one attribute that you think would be critical for this role? "}, {"date": "16 Apr 2015", "title": "Patient Care Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2015", "Interview Descriptions": "Applied online and got called back for an interview within one week span. Met with a very nice lady. I answered all her questions and she seemed pleased. She wa every enthusiastic as I was responding to her questions. I really thought I would get the job. Maybe I was too honest in my plans of wanting to finish my nursing degree. Everything went well until I mentioned that. I'm very honest, wasn't going to lie about what I want for my future.", "Interview Questions": "Can you recall one time when you think you went above and beyond for a co-worker ?"}, {"date": "18 Aug 2015", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2015", "Interview Descriptions": "Phone interview first with Principle Investigator. Then I met with the PI and lab members. I met with the PI first which went well followed by meeting members of the lab. I was interviewed by the other research techs on the team. This was followed by a meeting with HR.", "Interview Questions": "Strengths and weaknesses. Previous experience. Did I have Research experience."}, {"date": "14 Jun 2016", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2015", "Interview Descriptions": "The interview process was easy and straightforward. I spoke over the phone with an HR representative, who arranged for my meeting with one of the MDs in the office my application had been sent to. The actual interview with my now boss went extremely well. Very succinct and straightforward about what they needed, and I was able to fill those needs. Second interview with HR representative was very easy...not many questions asked really, but I suspect that's because they really needed someone when I got hired. The red tape that came after I actually got hired was the thing that delayed my start date by almost two months though!\r\n\r\nThe overall experience was great because it was so concise and straightforward.", "Interview Questions": "What are your long term goals?"}, {"date": "17 Sept 2016", "title": "Account Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Feb 2015", "Interview Descriptions": "I was contacted by the HR recruiter to set up an interview where I met with the Practice administrator, Assistant administrator, and two people from HR. I was asked questions mostly from the HR recruiters. The entire interview lasted less than 20 mins. I received an official offer for the position less than 24 hrs later and started the following week.", "Interview Questions": "What would you do if you had to work closely with difficult personalities?"}, {"date": "21 Jan 2015", "title": "Research Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Long drawn out, confused, muddled.  One minute they interviewed for position then a few hours later apologized as post was taken, then one week later received offer for more interviews.  knew something was up.", "Interview Questions": "Was told by employer what a confused and horrific place to work - I assumed it was sour grapes."}, {"date": "10 Jan 2015", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "After submitting my application online, a month later I received an email for an interview from a professor in the department and an on-site presentation/interview was scheduled. I presented my PhD dissertation for ~45 min. and was asked a lot of questions about my research findings and potential problems and perspective in general.", "Interview Questions": "there was no difficult questions."}, {"date": "6 Feb 2015", "title": "Administrative Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2015", "Interview Descriptions": "I received a phone interview with a recruiter from the HR department to evaluate my needs, we then set up an in person interview which was pretty standard.  She evaluated my resume and spoke about my interests in order to determine what type of positions I would be best suited for.  About a month later I went on 2 interviews for different departments, one of which they wanted me to go on a second round with the director, the other one I met with 4 different supervisors within the department and received an offer 2 days later.", "Interview Questions": "Standard questions; Why do you think you would be a good fit for this position?  "}], [{"date": "16 Mar 2016", "title": "Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2015", "Interview Descriptions": "very basic, two rounds with senior management, one round with chief doctor, everyone was very friendly and were thoughtful in describing the job position. after each round was told that i would be meeting with a different person the next day", "Interview Questions": "went through resume,asked about life experiences. Asked how i could contribute to company"}, {"date": "22 Nov 2014", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Interview was very straight forward. They simply asked me to describe my resume and experiences, and asked me if I have any experience with certain skills. Most of the interview consisted of describing the position and the tasks that it entails. I had three mini interviews, about 10 minutes each, with three of the employees, each describing a different part of the job to me and asking me their own questions.", "Interview Questions": "N/A"}, {"date": "8 Nov 2014", "title": "Patient Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Most thorough interview process I have ever been through. I was initially contacted in November 2013 and was still interviewing in March 2014 before I stopped the process to take another offer. I would've written sooner but I just learned of this website. \r\n\r\nI was contacted by a really excellent recruiter who sat with me and went over my goals and what I was looking for working at Weill Cornell. She set me up to participate in their interview event, which was kind of like speed dating. There were tables set up with several different departments that were all looking to hire (at least 10 departments there). You sit with each hiring manager(s) for 5 minutes and they ask you quick questions and information. Based off of this, the recruiter contacts you afterward with the departments that would like to meet with you again. \r\n\r\nThis is good, because it helps you line up a couple of interviews within the same organization. My only issue was that the hiring process was taking a long time. I am used to having to do only 1, maybe 2 interviews before getting a yes or a no. Their process is extensive. They want you to meet with everyone in the department to make sure you're a good fit for everyone. You have to be really patient if you're interested in this organization. After 4 months of interviewing and callbacks, I finally pulled the plug it was taking way too long and in the meantime another company extended a similar offer. \r\n\r\nInterview questions were pretty standard, but prepare to meet with a panel on more than one occasion. It was not a negative experience in any form, but it's draining.", "Interview Questions": "Standard interview questions for an administrative role, be prepared to talk in detail about the work experiences you have done that relate to the position. "}, {"date": "9 Nov 2014", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "Panel interviews for management and leadership positions. Conversational style. How would you approach a given situation. Many standard HR questions. What would your colleagues say about you. What would you superiors say about you. What would you change about prior supervisors. What is your management style. Interviews are spread over two or three visits. Interviews may be designed to see how much stamina you have. Evaluation in more than one social situation.", "Interview Questions": "How will you manage communications and competing objectives between all of the collaborating organizations that partner with the institution."}, {"date": "11 Jul 2014", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "initially called by recruiter. scheduled me for panel interview. met with the head of the department, the practice manager, a person currently in the role and the recruiter. the panel interview was somewhat intimidating but the recruiter controlled the whole situation initiating questions about my experience and allowing me to answer..", "Interview Questions": "behavior questions, talked about previous experiences & gave examples"}, {"date": "21 Jul 2014", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "depending on the professor. usuallu the human resource will select the C.V. first and pick 3 to 5 potential candidate for interview, you will be notice by the human resource directly, and then it will depend on how the lab manager do. if u been picked for the interview, you usually will meet all the members of the lab, and take a tour of the lab environment, after that, u will be notice if u r recruited to the second round.", "Interview Questions": "nothing specific difficult, just be professional about your job"}, {"date": "6 Jul 2014", "title": "Animal Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "It was simple and straight forward. Interview times are flexible and they are a day full of interviews with you and different people in management.You receive a walk through of the facility as well.", "Interview Questions": "How would you handle a co-worker that was not doing their job?"}, {"date": "5 Jul 2014", "title": "Research Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in May 2014", "Interview Descriptions": "Hiring was a two-tiered process.  I was first interviewed by the lab's Principal Investigator (PI), then by HR at Cornell.  The PI's questions were related to previous lab experience and techniques, while HR asked the more standard interview questions.  All in all, everyone was very communicative and supportive throughout the process, and I have no complaints.", "Interview Questions": "Most difficult question was related to a scientific technique that I learned a few years back, asked by the lab's PI.  Mostly to check critical thinking skills and scientific acumen.  "}, {"date": "7 Apr 2014", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "There were 3 interviews. The first was completed over the phone. I was then asked to come in person for the interview and lastly I was interviewed by HR.", "Interview Questions": "There were no difficult or unexpected questions during the interview."}, {"date": "9 May 2014", "title": "Bio Statistician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Weill Cornell Medicine in Apr 2014", "Interview Descriptions": "I received a call from HR to interview.  Went to interview with department dean, a post doc, and several M.D./profs.  I was told they are looking to fill the position quickly.\r\n\r\nAlmost all have an M.D., not some kind of statistics degree, so, if you are a stat expert, do use simple terms even if you know about, do not bore everyone.\r\n\r\nThe interviewers talked about medical related things, which I don't know.  I have some great ideas building statistical models, but I didn't get to express that.  I don't think they are interested in knowing.\r\n\r\nI wish they asked something simple but concrete, like how do you build a regression model.  I'd have a lot to say.", "Interview Questions": "Do you know SAS?"}], [{"date": "29 Mar 2014", "title": "Resident Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Weill Cornell Medicine", "Interview Descriptions": "One day interview with all the members of the department", "Interview Questions": "No difficult questions. They already screened you."}, {"date": "22 Mar 2014", "title": "Graduate Student Biomedical Sciences Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Interviewed in 2 different departments in the graduate school which translated to 6 interviews on super day. Had a combination of behavioral and technical questions as well as asked to give an impromptu presentation of my past research. Make sure to do background reading on all your interviewers, and be prepared to discuss your future research endeavors.", "Interview Questions": "An interviewer described her research in about 5 sentences then asked me to propose the next steps that should be done."}, {"date": "17 Oct 2014", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2014", "Interview Descriptions": "The interview was very informal and was in actuality more of an information session. Was told not to bother feigning interest in the interviewer's research. Was sent along to see two other people in another building - both meetings went very well, but I was never called. Nor were my emails inquiring to the position's status answered.", "Interview Questions": "N/A"}, {"date": "30 Mar 2014", "title": "Research Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2014", "Interview Descriptions": "I just had an interview with the lab and everything went well. I was interviewed by the person who I was going to work with and also by other lab members as well as the PI. However, the PI only had 5 minutes to talk to me. The lab seemed really stiff in terms of social interaction. It just didn't felt like home since I will be spending majoring of my time there.", "Interview Questions": "They just asked what kind of research skills I had and my experience in my current lab and why I wanted to work there. I also got a math quiz which was quite unexpected."}, {"date": "12 Sept 2017", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2014", "Interview Descriptions": "initial CV review, followed by skype interviews with the PI and then interaction with the lab members. It was an advertised position. \r\nThe work was although not related to my previous work, I expressed the interest and a knowledge of the subject.", "Interview Questions": "The interview was focused on my previous research work. How I solved problems and how I plan to work in the prospective lab. This is the typical postdoc hiring process. There was also the review from the lab members involved, who found me positive."}, {"date": "15 Feb 2014", "title": "Senior Patient Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Pretty standard", "Interview Questions": "They really don't ask questions. They ask if you have questions,and you always should."}, {"date": "8 Dec 2016", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Feb 2014", "Interview Descriptions": "call for interview within one week of initial application. The interview was one on one with department manager, very straight forward, honest, and personable. Questions were not out of the ordinary. Strong emphasis placed on people skills and personality to create a team that works well together and efficiently.", "Interview Questions": "Questions pertaining to personality and ability to contribute to the ever changing work environment."}, {"date": "7 Nov 2017", "title": "MD-PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Weill Cornell Medicine (New York, NY) in Dec 2013", "Interview Descriptions": "1 day interview, multiple faculty from Cornell, Rockefeller, and MSKCC as well as Tri-Insititutional MD-PhD program specific administrators. Dinner beforehand and afterwards with social outing as well. Rigorous interview questions that were specifically focused on research background.", "Interview Questions": "Why do you want to do MD and PhD?"}, {"date": "2 Oct 2013", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "standard and friendly", "Interview Questions": "N/A"}, {"date": "17 Jun 2014", "title": "Senior Medical Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Weill Cornell Medicine (New York, NY) in Sept 2013", "Interview Descriptions": "Called by an HR recruiter, they did an initial phone interview to see where I would best be fit. I was scheduled for an interview with the Medical Director of the corresponding department and the Department Supervisor. After the interview I was called with a job offer.", "Interview Questions": "How do I handle conflicts with other coworkers."}], [{"date": "25 Sept 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2013", "Interview Descriptions": "The interview process was relatively simple and straightforward. My prospective mentor and I scheduled a time to meet in his office, and he described what the role would entail. He then detailed what I would be doing as a clinical research assistant under him and then proceeded to ask me some questions about my previous experience and my overall goal in life.", "Interview Questions": "\"Why do you want to do medicine?\""}, {"date": "22 Jun 2015", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2013", "Interview Descriptions": "Recruiter reached out and asked me to submit my resume. She forwarded it to those that needed graduates to fill research positions. Had an interview with (current boss) and head of research activities, short interview.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "29 Jun 2017", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2013", "Interview Descriptions": "Two interviews were required. One with HR and one with the lab that I was attempting to work for. The HR one asked the standard questions any interviewer would ask you whereas the lab one was more of a \"get to know you\" and inquired about your skills.", "Interview Questions": "What are your long term plans? Where will you be in 5 years?"}, {"date": "15 May 2013", "title": "Non-Clinical Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "phone interview, panel interview", "Interview Questions": "Why do you want to work here and/or this position?"}, {"date": "27 Jun 2015", "title": "Senior Medical Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in May 2013", "Interview Descriptions": "I work with Weill Cornell so I submitted my application online. I received a response and then was scheduled an interview date.  I asked questions during the interview.  My notification from Human Resources came in a few weeks.  Then I had to go through the orientation.", "Interview Questions": "Why do you want this position?"}, {"date": "5 Apr 2016", "title": "Project Manager II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in May 2013", "Interview Descriptions": "Very detailed concerning artifacts and process.  There were many questions concerning ability and appetite for a heavy workload.  Also, they were honest about the less than ideal work environment though they could have in no way prepared me for how bad it was.", "Interview Questions": "What type of artifacts have you used?  Show examples."}, {"date": "22 Oct 2014", "title": "Postdoctoral Associate In Cell and Developmental Bio Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Weill Cornell Medicine (New York, NY) in Apr 2013", "Interview Descriptions": "Met PI at conference, wrote letter post meeting, invited for interview and was offered the same day. Was given time to interact with everyone in the lab, taken out for lunch.", "Interview Questions": "Would you like to stay in academia?"}, {"date": "21 Jun 2016", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Weill Cornell Medicine (New York, NY) in Apr 2013", "Interview Descriptions": "3 interviews: one with assistant director, one with chief physician of division, one with HR\r\n\r\nThe interviews are fairly informal.  The assistant director may vet you for a second or two to ensure you are worth scheduling for meetings with the physicians (these are insanely busy people).  The interview with the physicians will likely be quick.  If you get to HR, you are essentially as good as hired but don't be a jerk.  I have heard of several people having their offers rescinded after talking down to the HR specialists.", "Interview Questions": "Interview is fairly open.  They essentially want to ensure you 1) have a brain 2)aren't going to use it to do crazy things"}, {"date": "22 Feb 2013", "title": "Research Associate Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Weill Cornell Medicine", "Interview Descriptions": "Initial contact and coordination of interview was smooth and easy. The main interviewer was nice and asked questions that are general but clearly stated. Peer interviewers were not as friendly. Topics discussed were not related to the position nor about applicant. Reluctant to provide information on the position and work environment.", "Interview Questions": "Why did you apply for this position when you already interned for this position before. Have you not have enough of it?"}, {"date": "5 Jun 2015", "title": "Senior Medical Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Weill Cornell Medicine (New York, NY) in Feb 2013", "Interview Descriptions": "Went to a staffing agency. the staffing agent had this position open the next day so I went in and started working. the office manager asked a few questions and took me to train. not much to it when you go through an agency, they hire a lot of people from agencies for all positions.", "Interview Questions": "tell me about yourself?"}], [{"date": "12 Jan 2013", "title": "Research Program Leader Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "It was a personal contact out to Cornell that led to further discussions.  In oncology it is all about personal contacts.  It was finalized in a relatively short time once I had decided it was a good career move for me.", "Interview Questions": "None really.  It was a good fit.  "}, {"date": "24 Oct 2017", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2013", "Interview Descriptions": "The interview process was pretty standard. Over the phone and in person with multiple people.  We reviewed my resume and I talked about my education and work experiences. The people I met with were nice and I thought the process was straight forward.", "Interview Questions": "How would you describe your level of organization and attention to detail?"}, {"date": "21 Sept 2013", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Weill Cornell Medicine (New York, NY) in Dec 2012", "Interview Descriptions": "Application via email followed by interview on skype involving a 45 minute presentation of your research work and discussion on it.", "Interview Questions": "The interview was kind of easy. Only general questions on your past research experience were asked."}, {"date": "5 Sept 2012", "title": "Departmental Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "Initial communication was over the phone.  I was called in to meet with my direct supervisor, and then was asked to come back and meet with another supervisor with a laterally equivalent position.  The interview was very much straightforward and basic.  Questions revolved around level of organization and ability to handle internal customer service.  Office culture was very quiet and congenial, very straightforward in terms of describing the position and expectation.  interviewers probing more for commitment than anything else.  What are your plans in the next two years?  What are your professional aspirations? Hiring process was straightforward as well, asked to undergo testing (typing test) and then received an offer within 2 weeks.  Very streamlined process.", "Interview Questions": "Why are you interested in this position?"}, {"date": "15 Jul 2012", "title": "Research Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Weill Cornell Medicine (New York, NY)", "Interview Descriptions": "The interviewee must exude confidence during the interview and demonstrate a strong knowledge of life sciences. Many Principal investigators (PI) seek graduates that are either pre-med or preparing for a physicians assistant program.", "Interview Questions": "How much experience do you have writing an NIH grant? "}, {"date": "14 Jan 2013", "title": "Research Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2012", "Interview Descriptions": "I submitted a cover letter and resume online, and was called for an interview at a Career Day along with other biomedical research institutions in NYC. The interviewer seemed aloof and disinterested.", "Interview Questions": "What was the last book you read?"}, {"date": "4 Oct 2012", "title": "Computer Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2012", "Interview Descriptions": "There was just one interview, having a few years experience in IT was key for this job. During the interview I just stood keen and made sure to use tech savvy words to display my knowledge in the field.", "Interview Questions": "Questions will revolve around your history in IT. Most likely it will be a troubleshooting question about a computer or printer. If you were picked for an interview, most likely you have at least 2 years experience in the field and should be able to answer with ease."}, {"date": "31 Jul 2013", "title": "Operations Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 8 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Oct 2011", "Interview Descriptions": "Met boss at networking event. He invited me to come in and apply for another open position, which I didn't end up getting. After interviewing with the department, I was hired as a temp for a different role. When I was on-boarded as a full-time regular employee, I had to go in to interview with HR.", "Interview Questions": "Do you feel comfortable dealing with difficult or strong-minded people?"}, {"date": "21 Jun 2014", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Sept 2011", "Interview Descriptions": "I was hired thru a recruiter and HR. They have changed that process now and hire people directly. Very difficult to know who is in charge. My recruiter did a thorough interview, but now they do not use HR anymore.", "Interview Questions": "None. all routine."}, {"date": "7 Sept 2011", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Weill Cornell Medicine (New York, NY) in Jul 2011", "Interview Descriptions": "The interview went great, at least I thought. I was interviewed by the lab head and another researcher. Both went well. I sent a thank you note to both. Two weeks later I was informed that someone else had gotten the position. I at least appreciated being told in a timely manner instead of two months later.", "Interview Questions": "What is a mole and do you remember avaogadros #?"}], [{"date": "26 Jul 2014", "title": "Development Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2011", "Interview Descriptions": "Extremely detail-oriented. Be prepared to deliver original diplomas. All employees need to be screened for tuberculosis as a condition of employment. There is a 90-day probation period, as well, but orientation in thorough and professional.", "Interview Questions": "What did your last supervisor find lacking in your performance?"}, {"date": "20 Jul 2015", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2011", "Interview Descriptions": "Easy interview process, quick background check. one on one questions and group interview as well. Nice facility, clean and easy to find on the WES. HR office is not in the same building so it can become a pain to find. I went during construction, so signs were not clear. NO parking offered.", "Interview Questions": "How do you engage with cross functional groups?"}, {"date": "1 Jun 2011", "title": "Research Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in May 2011", "Interview Descriptions": "I was interviewed by the PI and two research techs of a cancer research lab. The interviews were one-on-one and focused on research skills as well as personality. About two weeks later, I was interviewed by a HR Recruiter who was polite. We focused on character and personality as he seemed less interested about research.", "Interview Questions": "What is a situation where you had to dispute something over the phone?"}, {"date": "3 Sept 2015", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Weill Cornell Medicine (New York, NY) in Mar 2011", "Interview Descriptions": "Laid back interview. First met with laboratory group. If you get an HR interview you have the job. Interviews were very laid back. Just went over my resume and relevant experiences.", "Interview Questions": "Tell us about your research"}, {"date": "26 Jun 2015", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2011", "Interview Descriptions": "First step involved a phone interview and then followed by an onsite interview. Overall the experience was positive. Lot of the questions dealt with knowledge of techniques and basically how quick you can get off the ground. Very fare questions and nothing too much out of the ordinary.", "Interview Questions": "question dealt with previous research projects"}, {"date": "3 Mar 2014", "title": "Data Administrator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Weill Cornell Medicine (New York, NY) in Dec 2010", "Interview Descriptions": "Initially contacted by division manager. Received email describing position, if I was interested in meeting him to learn more. Scheduled interview about 3 weeks after initial email.  Division manager brought me to the cafe, where we sat waiting for woman who would be my immediate supervisor, she arrived late and was very cold the whole time, made minimal eye contact and seemed pretty angry the whole time. Division manner was very nice, made small talk and described very in depth my position. Took me on a tour of the space where I would potentially be located (space was not allocated at time of interview). Immediate supervisor did not say a word through the tour, then left in the middle of interview. After I was taken to the exit, division manager said he would be in touch, heard nothing for about 2-3 weeks, then an HR recruiter contacted me for an interview conducted by HR. He was more thorough, typical interview conducted by an HR professional, but slightly obnoxious. Asked what I wanted to make, said he didn't foresee it being an issue but ultimately would be up to the divisional manager, said he would be in touch, at this time he requested references. Received phone call about 2 weeks later with offer, and salary. Accepted over the phone and received email 10 minutes later with acceptance paperwork, and to schedule orientation. Had to come into HR office with agreement and diploma or transcript for highest education completed.", "Interview Questions": "Describe a workplace challenge you've faced?"}, {"date": "20 Dec 2010", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Weill Cornell Medicine (New York, NY) in Dec 2010", "Interview Descriptions": "Called and interviewed by the Psychologist- senior investigator. She spoke about the research project the majority of the interview. Only asked familiarity and experience with SPSS and experience with elderly populations.", "Interview Questions": "experience with spss?"}, {"date": "7 Jun 2010", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Weill Cornell Medicine (New York, NY) in Feb 2010", "Interview Descriptions": "Panel interview - too many personal questions - age, marital status.  1:1 interview with HR head, her persistence in irrelevant questions was unnerving.  Dissatisfied with my responses to her question about where else I was interviewing, she repeated herself 3 times.  Thus, I suggested the inappropriateness of her question.", "Interview Questions": "how old am I?"}, {"date": "4 Mar 2010", "title": "Research Systems Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Weill Cornell Medicine (New York, NY) in Feb 2010", "Interview Descriptions": "HR recruiter emailed me, arranged a interview time.  They specifically request I bring a transcript or diploma of my highest degree attained and some other standard paperwork (references, etc.).  Filled out a redundant application form which took 15-20min.  The interview itself was casual, no difficult questions per se, straight forward.  Talked about 30 minutes about my past positions.", "Interview Questions": "What would my last supervisor say that I needed to work on to improve performance?"}, {"date": "28 Feb 2014", "title": "Patient Billing Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 7 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jan 2010", "Interview Descriptions": "After I was contacted for an in-person interview, I was told I would be contacted by HR.  That took about 40 days to actually happen - leaving me mostly wondering if I even had the job.", "Interview Questions": "There were no difficult questions."}], [{"date": "15 Feb 2013", "title": "Medical Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Weill Cornell Medicine (New York, NY) in Aug 2009", "Interview Descriptions": "Basic Interview, strengths weakness etc.\r\nBackround check seemed to be a lengthy process took over a month if I recall accurately", "Interview Questions": "Asking history of Weill Cornell"}, {"date": "27 Jan 2010", "title": "Assistant Research Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Weill Cornell Medicine (New York, NY) in Aug 2009", "Interview Descriptions": "The interview was between the director of the department and myself. We had worked in close proximity for a long while and a position was opening up in a new laboratory. I suggested that I should be the one to take the position (I had been working as a post-doctoral associate).", "Interview Questions": "Why are you the best person for the job"}, {"date": "2 Sept 2010", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2009", "Interview Descriptions": "Must go through lots of red tape involved with any big hospital operation, including the classic HR BS.  Candidates will likely have a meaningful interview with the chief of their laboratory, so there will be great variety in the specifics.", "Interview Questions": "Where do you see yourself in 10 years"}, {"date": "5 Jul 2011", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in Jun 2009", "Interview Descriptions": "It was the phone interview.", "Interview Questions": "About my future plan"}, {"date": "22 Feb 2010", "title": "Information Technology Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Weill Cornell Medicine (New York, NY) in May 2008", "Interview Descriptions": "- The first interaction was a phone interview that can be intimidating. You are asked a variety of technical and behavioral questions. They were concerned with your poise and ability to think critically rather that a right / wrong answer.\r\n- The in-person interview was even more rigorous, with more weight on behavioral type questions. The interviewer was inviting and created a comfortable atmosphere.\r\n- The last interview, involved HR screener. They asked a line of questioning surrounding your intentions and your legitimacy of your resume.\r\n(They do contact your references and previous employers)", "Interview Questions": "Where do you see yourself in 2 years?"}]]