[[{"date": "20 Mar 2023", "title": "Assistant to the Dean Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at CSU Dominguez Hills in Mar 2023", "Interview Descriptions": "Applied online and received an email to schedule an interview about 2-3 weeks later. The first interview was on Zoom with an interview panel. About a week later, they sent an email requesting for a second interview with the Dean in person. About 2-3 weeks later, I was offered the job. The first interview were scripted questions and the second interview was more personal.", "Interview Questions": "How do you stay organized and on top of your work"}, {"date": "5 Apr 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at CSU Dominguez Hills", "Interview Descriptions": "I was recruited through AnotherSource for the Director position and I was put through to the hiring committee. It was a pleasant interview process with normal predetermined questions and it was about a week later I was recommended as a two member finalist. It comprised of a 4 hour interview process with the staff I would oversee, senior leadership, an open forum with campus community members, and then a one-on-one with a VP. All of which were extremely pleasant and informal.\n\nThe issue I had is the lack of transparency and communication from either the VP and AnotherSource on the outcome of the interview process. This VP talked of communication, openness, and trust worthy and yet she perpetuates the culture by which she was proposing to change and this rubs me the wrong way by saying one thing and doing another. Actions speaks louder than words and I’m just glad that I wasn’t offered this position as I couldn’t be able to trust this individual as my own boss.", "Interview Questions": "Please tell us about yourseld"}, {"date": "16 Feb 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CSU Dominguez Hills in Feb 2022", "Interview Descriptions": "The interview process was wonderful, even though it had to be virtual. The faculty was inviting, the students were exactly the type of students I'd like to work with, and I had a chance to  learn about the culture of the department.", "Interview Questions": "What is your experience teaching diverse students?"}, {"date": "14 Dec 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at CSU Dominguez Hills", "Interview Descriptions": "The interview process was quick and easy. The interviewer was easy to talk to and detailed the responsibilities for the position. The staff were very accommodating and took care of the paperwork for me. With all these, the transition process was a breeze as the staff were helpful and welcoming.", "Interview Questions": "What can you contribute to the team?"}, {"date": "5 Oct 2021", "title": "Support Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at CSU Dominguez Hills (Carson, CA) in Aug 2017", "Interview Descriptions": "One interview with a panel of 5 individuals, they ask you about your resume, the panel takes notes while you answer the questions. \n\nAt the end they ask you if you have any questions for them. \n\nThey do review your references and do a reference check.", "Interview Questions": "Tell me about yourself \nTell me about an emergency \nStrengths and weaknesses\n"}, {"date": "25 Jun 2021", "title": "Media Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CSU Dominguez Hills (Carson, CA) in Jun 2017", "Interview Descriptions": "I applied online and was contacted about 1-2 weeks later via phone call. I did a phone interview which lasted maybe 10 minutes and then was offered a second interview. Most of the questions I was asked were typical interview questions like availably, job history, etc.", "Interview Questions": "Why do you want to work here."}, {"date": "22 Apr 2021", "title": "Information Technology Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at CSU Dominguez Hills (Carson, CA) in Jan 2017", "Interview Descriptions": "It is a panel interview—typically five to six people from respective department and others. They have standard questions and everyone in the room provides a rating. You will not make it to the interview round unless you have all the experience requirements marked as mandatory.", "Interview Questions": "Why are you the option for this role?"}, {"date": "8 Jun 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at CSU Dominguez Hills (Carson, CA) in Aug 2016", "Interview Descriptions": "Interview process was well not complaints about it. Have a resume at hand and prepare as usual..thank you very much. good luck to you and everyone else doing an interview yes", "Interview Questions": "N/A"}, {"date": "22 Oct 2015", "title": "Recruiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at CSU Dominguez Hills (Carson, CA) in Oct 2015", "Interview Descriptions": "I applied for a temp pool position. About two or three days after submitting my application, I got a phone call to come in the next day for an interview, (this woman seemed to be extremely busy because she had to have someone else return my call). Panel interview with the recruitment team, mostly asked about behavioral/situational questions. Also questions about working with students from a diverse background.", "Interview Questions": "What is your experience working with students of a diverse background?"}, {"date": "31 Aug 2015", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at CSU Dominguez Hills (Carson, CA)", "Interview Descriptions": "Questions are easy and basic. They seem predetermined and dated. They are allowed to ask questions that aren't listed on their paper. It was not stressful. The people on interview panel were very nice. It took a long time to hear back from Human Resources department. They don't do second interviews. They don't send out emails letting you if you got the job or not.", "Interview Questions": "What you do at current job."}], [{"date": "1 Oct 2015", "title": "Manager Position (Staff) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at CSU Dominguez Hills (Carson, CA) in Jun 2015", "Interview Descriptions": "The application and interview process was a six month ordeal (I applied in late March 2015, and received a rejection email in late September). The interview was conducted in mid-June.  All the members of the search committee were friendly and professional.  I also appreciated how well the search committee’s chair kept me updated throughout her portion of the process. The interview consisted of a panel interview with the search committee, followed by a 15-minute presentation to an open forum group, and then a meeting with the hiring manager.  The hiring manager informed me that he was retiring at the end of the following month, and he wanted the person for this position to start before he left.\r\n\r\nEarly the next month, the chair informed me that I was the person that the search committee was going to recommend. The search committee chair checked my references and received approval from the hiring manager  and the university President.  \r\n\r\nAn interim hiring manager came on board in early August before an offer was extended to me . The new manager wanted to interview me, which was certainly this person's prerogative.  The manager began the interview by telling me that I was one of two finalists, which I found surprising and disturbing since the search committee chair never told me that it was between me and another candidate.  The manager did not provide a timeline for the decision process.  I tried following up with this person at least four times via email since we met, and only ne of my emails was responded to, wherein I was informed me that they were in the process of “deliberating,” and that I would be notified when a decision had been made.  \r\n\r\nThe \"notification\" came six weeks later in the form of a system-generated rejection email  informing me that the hiring department had “decided to cancel this recruitment.”  The same position was posted the following day!  So much for the “cancellation”!", "Interview Questions": "How have you desinged a training schedule?"}, {"date": "31 Mar 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at CSU Dominguez Hills (Carson, CA) in Jan 2015", "Interview Descriptions": "A Brief 15 minutes interviews with both supervisors didn't take long. did the hiring paper within a week. and started work and training as soon as i started. work by started with basic function of the computer then in class training", "Interview Questions": "Any experience  with computer programming? "}, {"date": "4 Jun 2014", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at CSU Dominguez Hills (Los Angeles, CA) in Aug 2013", "Interview Descriptions": "Most of the process good, up until the end.  Assistance with travel arrangements and lodging, swift reimbursement, easy dealing with support staff.  Opportunity to meet most of the key players, fewer students than I would have liked.", "Interview Questions": "Here's the deal - I didn't officially hear the results for nearly 2 months after an on-campus interview.  Inexcusable.  Was turned down by email, always tacky.  Then my repeated requests for feedback from the interview were ignored.  A general lack of professionalism around the conclusion of the process, as if they had something to hide about why they did what they did."}, {"date": "13 Jun 2017", "title": "Instructional Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at CSU Dominguez Hills (Los Angeles, CA) in Jan 2013", "Interview Descriptions": "It was an interview with the department director and some other interviewer from other departments. Questions were easy and generally related to what I have done in the past regarding the position.", "Interview Questions": "Donyou know blackboard LMS?"}, {"date": "14 Aug 2012", "title": "Vice President of Operations Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at CSU Dominguez Hills (Carson, CA)", "Interview Descriptions": "Interview with the Executive Team, once recommended by the Executive Team the board will have to approve the position. The interview questions are relatively easy you just need to be familiar with what they do and why you want to be a part of it. Read the By Laws to get a better understanding of the position and ask questions if you have any.", "Interview Questions": "What would you do differently from the previous Vice President of Operations?"}, {"date": "10 Apr 2010", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at CSU Dominguez Hills (Carson, CA) in Feb 2009", "Interview Descriptions": "- A representative or administrative analyst of the department will reach out to the candidate to schedule an interview\r\n- The department will usually select 3-5 candidates for an interview \r\n- The hiring manager of the dept will usually develop a list of questions (between 5-10 questions) to be used during the panel interview\r\n- A select panel of individuals (usually 4 current employees) will be selected to participate in the panel interview. They will review candidate resumes and interview questions before participating in the interview. \r\n-Panel interview usually takes about 30-45 minutes per candidate \r\n-After panel interview is completed for all candidates, the panel will select 3 top candidates; offer is made to the highest scored candidate", "Interview Questions": "N/A"}]]