[[{"date": "8 May 2023", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Dimensions International College (Singapore)", "Interview Descriptions": "Straight forward and the whole process is not lengthy. Interview questions focus more on teaching experience and classroom management skills. Benefits and pay package only will be discussed during job offer.", "Interview Questions": "What is your teaching experience and the profile of your students? How do you manage these students during lessons?"}, {"date": "10 Dec 2020", "title": "Teacher Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Dimensions International College", "Interview Descriptions": "Face to face interview with interaction and sharing of experience, fill in required forms and explanation of job scope , working environment and culture, sharing of expectations, perspective of how to improve and execute ideas in a better or creative ways", "Interview Questions": "Education level, future career path"}, {"date": "21 Jul 2020", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dimensions International College", "Interview Descriptions": "Friendly and short interview. Asked the right questions. Applied online and got an interview a few days later. The interviewer explained in details the role and school I applied for", "Interview Questions": "Have you ever worked in education?"}, {"date": "30 Jul 2021", "title": "Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Dimensions International College (Singapore) in Apr 2020", "Interview Descriptions": "Smooth process, apply via a recruiter, everything arrange nicely, the interviewer is friendly and cheerful. Got a good impression, the whole process is very smooth and i got my offer.", "Interview Questions": "What is your experience in the past"}, {"date": "21 Feb 2019", "title": "Language Teacher Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dimensions International College (Singapore) in Nov 2018", "Interview Descriptions": "The interview was scheduled very quickly and feedback was given on the next day.  However the HR staff is not very responsive and open to salary discussion. The interview questions  were easy to answer if you have prior teaching experience.", "Interview Questions": "How would you manage your classroom?"}, {"date": "18 Mar 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Dimensions International College (Singapore) in Jul 2018", "Interview Descriptions": "from an agency, very simple, interviewer just asked when I can start work etc as it is just a temp job. as long as you have the required literacy skills and basic computer knowledge and microsoft office softwares will do", "Interview Questions": "You have no problems with data entry and administrative work right?"}, {"date": "17 May 2018", "title": "Teacher Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dimensions International College", "Interview Descriptions": "some personal questions and how hard you will work for them there are three rounds in total, first two are easy, third are pressuring. questions are relatively easy, takes less than 30 minutes for each interview", "Interview Questions": "how to handle difficult student"}, {"date": "31 Aug 2017", "title": "Teacher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dimensions International College in Jul 2017", "Interview Descriptions": "First, there was a an application form to be filled up, then you'll be ushered into a waiting room where you'll meet the interviewer. The interview was fast, it took about 20-30 minutes and the level of difficulty of the questions were relatively low.  They will explain to you the job scope and assess your relevant experiences.", "Interview Questions": "What did you study? Tell me if you have any experiences in teaching? "}, {"date": "29 Jun 2017", "title": "English Lecturer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Dimensions International College (Singapore) in Apr 2017", "Interview Descriptions": "These were 2 Skype interviews. Both of the interviewers were not punctual and were about 15-20 minutes late. The questions were related to my current employment, availability, the first interview lasted for about 20 minutes, the second one was twice as less. Eventually after the second interview they gave me an offer but after I tried to negotiate my salary they withdrew it.", "Interview Questions": "Why do you want to come to Singapore?"}, {"date": "8 Mar 2017", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dimensions International College", "Interview Descriptions": "I met the school directors and the interview was the shortest I have ever known. I had more questions for them than they had for me. It seemed rushed and amatuerish. I was requested to start asap, but I wanted to give my previous employer enough notice. I compromised, only to find they had not got the paperwork in place for me to start so I was without work for 10 days which was unnecessary and frustrating.", "Interview Questions": "N/A"}], [{"date": "14 Jul 2015", "title": "Lecturer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Dimensions International College (Singapore) in Jun 2015", "Interview Descriptions": "Interview process was fast, however, on the interview day the interviewer arrived late for the interview. Just like what the reviewers comment in Glassdoor, there seem to some serious issues in the HR department. The interviewer was pleasant though I really doubt the SOP of the company and unprofessional attitude of the department.", "Interview Questions": "Why do you want to work here?"}]]