[[{"date": "2 Jul 2021", "title": "Coding Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Appalachian Regional Healthcare", "Interview Descriptions": "Very relaxed.  Didn’t make me uneasy.  Very relatable and asked great questions.  Allowed me to give my feedback and thoughts.  She was interested in what I had to say.   Great experience.", "Interview Questions": "What makes you stand out for this position? "}, {"date": "11 Jul 2022", "title": "OR Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Appalachian Regional Healthcare (Hazard, KY) in Jul 2019", "Interview Descriptions": "It took all day long. I have to meet with the CEO, CNO and the chief of surgery. I had to have a second meeting which was a dinner. The director did all the talking and you couldn't get a word in.", "Interview Questions": "How far do you  live from the hospital"}, {"date": "13 Nov 2021", "title": "Home Health Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Appalachian Regional Healthcare in Jul 2019", "Interview Descriptions": "Friendly, quick interview process. The company seemed very willing to accommodate. Interview process was driven by standard interviewing guidelines. The company was looking to hire quickly, and decisions were made on the spot.", "Interview Questions": "Do you have Experience with home health? "}, {"date": "27 Apr 2019", "title": "CNA Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Appalachian Regional Healthcare (Belfry, KY) in Apr 2019", "Interview Descriptions": "The interview was excellent but rest was not. Was told had job and was sent for blood tests and urine tests and they scheduled a physical and less than 1 hiur after i left they were rescending offer and would never explain why or give me a chance to correct any issues. This is after trying to be hired with them for 3 months with constant declines and no explanation.", "Interview Questions": "What would I do in specific situations?"}, {"date": "9 Mar 2022", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Appalachian Regional Healthcare (Hazard, KY) in Jul 2018", "Interview Descriptions": "It was Comfortable and personalized. They Focused on my career goals and my previous clinical and internship experience. Explained job duties in detail and welcomed all questions. Asked about any volunteer work", "Interview Questions": "My Leadership qualities and interests "}, {"date": "6 Jan 2019", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Appalachian Regional Healthcare (Boone, NC) in Jan 2016", "Interview Descriptions": "Overall the panel interview was very personable. The process was easy for the most part, there were a lot of situational questions. They tried to connect with you to see if you were a good fit, gave a tour around the area as well.", "Interview Questions": "How to deal with a difficult co worker"}, {"date": "16 Oct 2014", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Appalachian Regional Healthcare", "Interview Descriptions": "You can only apply online. If selected you receive a call for an interview. Interview is lengthy (mine lasted 90 minutes) & mostly asks pointless questions that don't tell them much of anything about you. Your references are called & grilled about you, sometimes for 30 minutes. If hired you must do a physical at their facility. You must give the doctor your full medical history, including every medication you take. If you take medications you must bring the bottles to prove it & have your personal doctor fax a letter stating they write the prescriptions for you. You are grilled as if your medications make you a drug addict no matter what the medications are. You must submit to drug testing. You must also submit to blood work for cholesterol, diabetes & other testing. You must also have a PPD test. If you have any kind of arthritis or previous injury you are forced to see their specialist who does another exam to tell you whether or not he thinks you can do the job. If he passes you then you have to go to their physical therapy department & do another physical which includes walking on a treadmill for 30 minutes, lifting heavy weights, going up/down stairs, pushing heavy weights. It is sometimes an extremely lengthy process that can take several weeks.", "Interview Questions": "If a snow storm prevented travel on the roads & you were asked to come to work anyway or be fired, what would you do?"}, {"date": "30 Mar 2014", "title": "Clerical Staff Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Appalachian Regional Healthcare", "Interview Descriptions": "Application process starts on line, can be a lengthy process. Do not quit your current job until you have a start date.", "Interview Questions": "No unexpected questions, interview went well. Management staff was pleasant and answered all my questions. "}, {"date": "23 Mar 2014", "title": "Behavioral Health Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Appalachian Regional Healthcare in Jan 2013", "Interview Descriptions": "Poor and disorganized", "Interview Questions": "N/A"}, {"date": "10 Jan 2012", "title": "Insurance Verification Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Appalachian Regional Healthcare (Boone, NC) in Dec 2011", "Interview Descriptions": "Interviewed w/ Supervisor of Patient Access.  Not typical interview questions, mostly spoke of her own aspirations & continuing her education in healthcare mgt.  Explained most aspects of the job duties & found it unusual that she did not ask any questions of my work history or job exp.  Strange experience.", "Interview Questions": "Is getting here in inclement weather (snow) a problem?"}], [{"date": "4 May 2012", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Appalachian Regional Healthcare (Boone, NC) in Feb 2010", "Interview Descriptions": "Had a one on one interview with the nursing manager and her assistant, and the educator after initial phone interview, after employee referral for opening.", "Interview Questions": "What was a way that I handled personalities of surgeons?"}]]