[[{"date": "8 Feb 2020", "title": "Help Desk Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fairfax University of America (Fairfax, VA)", "Interview Descriptions": "It was at first one to one interview , and after we had an interview together with the president.\r\nThey asked general questions, such as past experience, why you are a good fit for this role, how are you different from other candidates. They did not give any \"challenges\" that you have to pass in order get a job", "Interview Questions": "Why are you a good fit for this position?"}, {"date": "30 Nov 2021", "title": "Employer Relations Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Fairfax University of America (Fairfax, VA) in Oct 2019", "Interview Descriptions": "Easy and relaxed. I had two interviews. One with the Hr and the hiring manager. General behavioral and situational questions. A whole lot of fit questions and previous experience. Interview took about 35 minutes and I got offer the following day", "Interview Questions": "Tell me about yourself\r\nWhy this organization?\r\nWhat will you bring to the team?"}, {"date": "1 Dec 2019", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fairfax University of America in Jan 2018", "Interview Descriptions": "Interview process was pretty easy. Basic questions about the past experience and why I would like to work for this university. First it was a phone interview with HR department, then I was invited for a face-to-face interview with hiring manager. The final interview was with the President of the university.", "Interview Questions": "Tell me about your past experience?"}, {"date": "22 Dec 2017", "title": "Web Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at Fairfax University of America in Nov 2017", "Interview Descriptions": "First of all the total interview took almost 2 months. First, phone interview with the HR everything goes fine, she said she will call me within next 2 weeks. Two weeks later the IT department called and said he will call me the next week with some test for the job. \r\nNext week comes by, HR or IT department did not call me but emailed me saying \"There will be Skype interview with the IT department\" and for some reason, the soonest that I could do would be the next 2 weeks.\r\n\r\nIt's roughly 4 weeks now. And because I am a good person and always understand people's condition I tried to give this a chance.\r\n\r\nNow comes to the Skype interview. I met 2 of the IT department persons. They assigned me a test to design one of their web pages and they also mentioned about the job responsibility which I am applying for. \r\nHe said he will need me to design a website (with Adobe or any design tools) and give it to the other department to get it develop or code. However, the test that they gave me, requires me to design as well as develop within a short amount of time. \r\n\r\nAgain because I am a nice person and just want to get this over with (even though that's not what I am applying for and that is not listed in the job responsibility) I give it a go.\r\n\r\nAfter I send the test. One week goes by, no phone call, or email from any of the department. I tried to give them heads up. Turns out, they forgot to notify me that I passed the test.\r\n\r\n2 weeks later they want me to come to their campus in Virginia to talk to another IT department for the final interview. I thought this is gonna be more of the design talk since that's the position that I was applied for. Plus, I remember from the last interview with one of the IT department, told me that all I do would be design the website, possibly making a mockup and do some test on the website. \r\n\r\nOh god no, they asked me about immigration questions and the technical questions that have nothing to do with web design. Every different aspect of code and development of the website, even SEO question (search engine optimization) which I never even mention it in my resume. In the end, I look like a donkey who had no idea even what they are asking. And the good part is I don't get the job", "Interview Questions": "What is white space? it's the technical part of the development website."}, {"date": "10 Jun 2019", "title": "Teacher Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Fairfax University of America (Richmond, VA) in Apr 2017", "Interview Descriptions": "First applied online sending the resume and cover letter and then was called for an interview. The interview was taken for like 5 mins. I was asked all the professional questions linked to job title.", "Interview Questions": "What are the key skills?"}, {"date": "2 Jan 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Fairfax University of America (Fairfax, VA) in Feb 2017", "Interview Descriptions": "It was a 2 phase interview process. After getting a confirmation from the department you applied to, you will be invited for the first stage of the interview with the supervisor or department head. If this goes successfully, you will be notified and a second interview will be scheduled with the President of the company.", "Interview Questions": "Tell me about yourself?\r\nWhy should we hire you?"}, {"date": "4 Nov 2016", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Fairfax University of America (Fairfax, VA) in Apr 2016", "Interview Descriptions": "Overall simply straight forward process. First I had a phone interview, then another one with VP in person. Questions asked were a little bit unprofessional.  The interview began with traditional interview questions and some behavioral questions, but shifted to a kind of weird questions in the end. I thought that was because the VP was not professional recruiter or lacked experience of hiring people. Otherwise, everything went smoothly. Staffs were nice and friendly.", "Interview Questions": "How would your friend describe you?"}, {"date": "13 Jan 2016", "title": "Student Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Fairfax University of America in Dec 2015", "Interview Descriptions": "HR contacted me a week after I filed the online application. A telephone interview was scheduled with the department head but the interviewer missed the appointment without notice. I had to contact HR myself to ask to be rescheduled.  \r\nThe interview was a skill review which lasted about twenty minutes. the interviewer seemed  unprepared and had clearly not read through the resume before making the call.\r\nQuestions asked were repetitive.", "Interview Questions": "Why do you want to work at VIU"}, {"date": "13 Aug 2015", "title": "Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Fairfax University of America", "Interview Descriptions": "very quick, they don't ask too many questions.", "Interview Questions": "Okay with working in an international environment?"}], [{"date": "6 Jan 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Fairfax University of America (Fairfax, VA) in Jul 2015", "Interview Descriptions": "Very Simple and straight forward process just want to make sure you have the comm skills to get the job done and they want to see if you can work in a hiearchy", "Interview Questions": "q. Tell us about yourself?"}, {"date": "26 Apr 2015", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Fairfax University of America (Fairfax, VA) in Apr 2015", "Interview Descriptions": "Quick response about scheduling an in-person interview (no pre-screening email or phone call). Interview covered irrelevant questions and verged on being unprofessional. Did not fully respond to questions concerning work environment and culture, which suggests a disconnect between leadership and university employees. Followed up after interview and withdrew application.", "Interview Questions": "Tell us about your international experience."}, {"date": "22 Jun 2015", "title": "Accounting Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Fairfax University of America (Fairfax, VA) in Jan 2015", "Interview Descriptions": "They took 2 weeks to call back. I was Interviewed by three upper management in a group/panel. It takes about an hour. The call you back within a week if they want to offer you a position.", "Interview Questions": "Experience with customer service? Experience in accounts payable/receivable? What do you think  about diversity? Why di you want to work here?"}, {"date": "2 May 2017", "title": "Admissions Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Fairfax University of America (Fairfax, VA) in Oct 2014", "Interview Descriptions": "the interview was a pleasant experience. i was selected to be interviewed after a couple of phone calls. the admissions manager received me very well and was straight forward and asked meaningful questions. The job was offered to me, but i received a better offer from somewhere else.", "Interview Questions": "what is your experience with international students?"}, {"date": "9 Oct 2014", "title": "Admissions Officer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Fairfax University of America in Oct 2014", "Interview Descriptions": "I emailed the application materials, got a call 3+ days later to come in for an interview and do a test on MS Word and Excel. There are 2 interviewers, they seems to be nice. The university tends to like international people, due to their students' background, about 99.9% of their students are international.", "Interview Questions": "Not very hard. Tell us about your previous job experience. How many languages do you speak? Can you work well under pressure and micro-management?"}, {"date": "15 Jun 2018", "title": "Property Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Fairfax University of America (Fairfax, VA) in May 2014", "Interview Descriptions": "It was competitive and how an interview should be. So had to deal with my best I had during the interview process and there off. \r\n\r\none on one, with the President, with super visor, with panel and sometimes with several other experianced knowledgeable persons.", "Interview Questions": "N/A"}, {"date": "3 Mar 2014", "title": "Instructor of Public Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Fairfax University of America (Fairfax, VA) in Feb 2014", "Interview Descriptions": "Apply online and if qualified, called in for an interview and teaching demo.", "Interview Questions": "N/A"}, {"date": "13 Jan 2018", "title": "Dean Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Fairfax University of America (Fairfax, VA) in Feb 2013", "Interview Descriptions": "Very haphazard, no real structure, interviewed with people who were not qualified to hold their position. There was a great deal of turn-over and they needed a competent manager immediately. The previous dean had walked out in the middle of the term.", "Interview Questions": "Very general, questions regarding my \"fit\" in an international setting "}, {"date": "13 Aug 2013", "title": "Adjunct Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Fairfax University of America (Fairfax, VA) in Jul 2012", "Interview Descriptions": "standard for faculty interview: you interview with the VP of academic affair and then do a teaching demo.", "Interview Questions": "None, they were standard."}]]