[[{"date": "2 Dec 2022", "title": "Paralegal Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Guinness Partnership", "Interview Descriptions": "Interview was held over teams. Was asked 6 questions relating to the role and about my past experience. Two ladies interviewed me were very nice and easy to talk to.", "Interview Questions": "What is a challenge you have overcome"}, {"date": "5 Jan 2023", "title": "Plumber Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guinness Partnership (Plymstock, England) in Dec 2022", "Interview Descriptions": "Well organised, nice atmosphere. Made to feel comfortable. It was all over in 40 mins with a chance to ask your own questions at the end. Everything seems good so far", "Interview Questions": "Describing experience in certain situations and Work based scenarios"}, {"date": "28 Jan 2022", "title": "Customer Service Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guinness Partnership", "Interview Descriptions": "few stages of interview. fairly easy process . there was a video interview with pre recorded questions and then another interview in the office. management made me feel comfortable during the interview", "Interview Questions": "describe a situation when youve gone an extra mile for someone / customer "}, {"date": "14 Apr 2023", "title": "Independent Living Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guinness Partnership (Oldham, England) in Oct 2021", "Interview Descriptions": "East process with firm guidance from HR. Presentation well received and was all about me as a person as requested. Questions were short and to the point, feedback was fast too", "Interview Questions": "How do your skills and experience align with Guinness behaviours?"}, {"date": "3 Apr 2023", "title": "Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guinness Partnership (Gloucester, England) in Mar 2021", "Interview Descriptions": "Telephone call Talk about experience, if any, have to give an example of when you’ve done some thing for someone else or cared for someone. They will help with examples", "Interview Questions": "Experience you have Your location."}, {"date": "14 Sept 2020", "title": "Customer Service Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Guinness Partnership (Manchester, England) in Sept 2020", "Interview Descriptions": "The first interview was a 'video voicemail' the second 'assessment centre' was on the phone. Awful from the start - questioned like I was applying for the MI5 with every little thing scrutinised. Awkward silences after every question", "Interview Questions": "Describe a time you have messed up and what you did to resolve it "}, {"date": "11 Sept 2020", "title": "Business Development Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guinness Partnership (London, England) in Feb 2020", "Interview Descriptions": "Time given at the beginning to work on a presentation then gave a 10 minute presentation. Presentation and interview with competency questions based on the presentation and the role. Development questions and knowledge of areas of operation and computer systems used within the organisation.", "Interview Questions": "Why do you want the role"}, {"date": "7 Feb 2020", "title": "Customer Service Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guinness Partnership (Oldham, England) in Jan 2020", "Interview Descriptions": "I applied online and filled in their form.  Pretty much standard. I was asked to do a video interview,  video interview for a job that is on the phones? I don't believe in that, I find it very invasive and not age appropriate for some, especially those that have not been brought up in the age of technology or for those that have and can be quite self conscious with their appearance.  I was invited for an interview and wow....just wow. There were 8 of us, 4 of which must have been nominated by people already working there, as they were saying hello to everyone. 4 decided to take total control of the group activity, not letting anyone have an opinion. This particular activity being about what you would do if stranded in the middle of nowhere.   We were then divided then in to two groups, one group went to do a pretend telephone call and write an email. Coincidentally it just  happened to be the group that knew everyone at the company already.  The other group were interviewed.  My interview comprised of the interviewer not really showing much interest in my answers, just looking everywhere other than at me, even out of the window into the corridor to see who was passing.    One of the  questions  is why do you want to leave your job?   Another one is what is the proudest moment of your career up to date?   I might have well as talked to a brick wall.  This interviewer didn't even ask if I had any questions about the company. I knew then that I hadn't got the job.  So next a pretend game of answering the phone and writing an email and basically wasting my time. A pretend game as they had already made their decision.  A couple of days later when the email came, (not a phone call) that I hadn't got the job, I was not in the slightest surprised. I did ask for feed back, which I was told would happen in up to 5 working days.  Yep, I received the call on the last day, at the very last moment possible and then when I rang back it went to the call centre and I was stuck in a very long queue for around 15 minutes until I realised that basically they just couldn't be bothered or professional enough to give me a direct line number or any feedback, probably didn't like me saying I felt the interviewer was totally unprofessional . Draw your own conclusions from my experience with this company, the company that cares!", "Interview Questions": "Why do you want to leave your job?"}, {"date": "25 Feb 2020", "title": "Digital Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 1+ week. I interviewed at The Guinness Partnership in Jan 2020", "Interview Descriptions": "I was interviewed by a Male and Female. From the moment I entered the room, the female had an air of arrogance about her and was completely rude and standoffish. Throughout the interview whenever the man was asking me questions, she would look at him sideways, almost as though she were mocking my responses. Her questions to me were repetitive and vague - the times I asked her to elaborate or what she meant, she would say just respond that it was open to my interpretation. How on earth does that make sense and give the opportunity to tailor a response to the role I am applying for?! Her attitude absolutely stunk and she is definitely not someone I would have enjoyed working underneath. There were also times were I was explaining things I had done in my previous role and team to which she constantly made sarcastic remarks to her colleague interviewing me such as “oh, it sounds like we’re in the wrong job”. There were also questions where I was specifically asked about my previous role and when I responded she asked “who is we? You say we a lot” - well, considering I was a part of one of the largest companies in the entire U.K. and working within a team, my answer will include a “we” since I didn’t run the entire section singlehandedly. \n\nTotally impossible to feel comfortable being interviewed by her and quite frankly for a temporary position the need to be interviewed in such a hostile environment was totally unnecessary. Wish I saw all these Glassdoor reviews before agreeing to attend the interview. \n\nI was also required to do a written test which didn’t factor into account the need to read four pages of information before completing the task and also the fact that they said the test had started, and then proceeded to talk to me about an impending fire alarm and give me an emergency phone number to contact if the laptop died, cutting down the time to do the task even further. But as I said from the outset the female interviewer had such a bad body language and energy towards me, constantly giving me dirty looks than she no doubt did this on purpose and didn’t care that I would run out of time.", "Interview Questions": "How do you prioritise your workload"}, {"date": "7 Sept 2018", "title": "Customer Service Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Guinness Partnership (Oldham, England) in Sept 2018", "Interview Descriptions": "COMPLETE DISGRACE. Interviewer was very rude and wanted an explanation as to why i was 4 minutes late. When i explained to him that i was not being let in by the barriers outside in the car park he just completely ignored me as if to say i had no explanation.", "Interview Questions": "Make you jump through hoops for a poxy call centre job. "}], [{"date": "27 May 2019", "title": "Customer Service Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Guinness Partnership (Oldham, England) in Jan 2018", "Interview Descriptions": "Competency based interview with two Customer service managers. A telephone based role play with a distressed customer and a written test. Was a fairly straightforward interview, the interviewers were both very nice, professional but friendly and gave me time to think of my answer and probed for further detail where required.", "Interview Questions": "Describe a time when you gave good customer service"}, {"date": "25 Sept 2018", "title": "Housing Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Guinness Partnership in Sept 2017", "Interview Descriptions": "Smooth process, formal and informal interview. It was spilt over the morning, around 3-4hrs, it included a team building excercise, phone call with a customer and written excercise. I then had an interview with 2 of the management team.", "Interview Questions": "Name a time you have had to prioritise your workload. What changes did you make and what was the outcome."}, {"date": "22 Jun 2017", "title": "Homeowner Services Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Guinness Partnership", "Interview Descriptions": "Online testing first which included numeric and logic type tests. This was followed by face to face interview with two people interviewing you. Friendly relaxing interview standard behavioural questions. Quite easy in the end.", "Interview Questions": "behavioural questions"}, {"date": "19 May 2017", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Guinness Partnership (Milton Keynes, England)", "Interview Descriptions": "After applying online I was invited to an interview within 2 weeks. Standard hour long interview with two department managers who took turns to ask me questions relating to my previous employment. there were then a few situational questions followed by a 30 minute test. I then received a call offering me the job within a week of the interview.", "Interview Questions": "Give examples of how you have developed a team"}, {"date": "27 Jun 2017", "title": "Learning Partner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at The Guinness Partnership (Euston, England) in May 2017", "Interview Descriptions": "Initial communication was made via email from the recruiting team with information about the interview on 30th May at 11am and the format. Stage 1) was to deliver a 15 mins facilitation session on one of the Guinness Partnership core behaviours. On the day, I did the session on \"take responsibility\". This was delivered to the panel members, the Group HR Director and the outgoing Learning Partner who both appeared welcoming and friendly (as you would do in interviews).\n\nStage 2)was followed by an hour long interview by the above personnel starting with why I liked the job, my background, what I had done before.  Each took turn to ask a number of competency based questions. At the end, I was offered the opportunity to ask questions. These I came prepared with. \n\nOn ending my questions, I asked 'what was the next step - when would I hear the outcome?\" I was told the following week because they had more interviews including for the Head of Learning & Development who the Learning Partner would report to.\n\nThe week came and went so I assumed I did not get the job and I moved on. To date, neither the HR Dept nor the recruitment team have not demonstrated their core value to \"deliver great customer service\" and let me know that I did not get the job and allow me to ask for feedback on the outcome.  This behaviour is far from their strap line which says \"....we believe that how we do things is as important as what we do\".\n\nI view as unprofessional. It left a bad impression of the HR Dept and the end stages of their recruitment communication process. They clearly need to refresh themselves on their  behaviours which should also impact the recruitment, interviews and selection process.  \n\nPay particular attention to the following behaviours 1) deliver great customer service 2) work together to communicate 4) take responsibility 6) are professional and 'principled'.  The same happened to me with 3 other housing organisations including Peabody.", "Interview Questions": "What attracted me to the role and working for Guinness?"}, {"date": "25 May 2017", "title": "Digital Media Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Guinness Partnership (London, England) in Apr 2017", "Interview Descriptions": "It was a two stage interview process:\r\nStage One - a 45 minute interview with two managers discussing my background and some of the campaigns that I've worked on previously, with a focus on my contribution, approach to content and measurement of results. This was followed by a timed content writing tasking; a blog about a community event with a focus on community engagement and inclusion.\r\n\r\nStage Two - a 30 minute task to develop a topline digital comms strategy for a new online service, followed by a 10-15 minute presentation to two managers on my approach, key messages and measurements of success. This was followed by a few more questions about previous campaign experience, management style and attitude towards content development.\r\n\r\nIt was a really smooth process - I was kept informed by the recruitment team and the timelines for each stage of interview and onboarding were made really clear. The online portal made it easy to choose available times, as well as being clear about what would be required.\r\n\r\nA big thank you to the recruitment team for being so helpful and getting everything ready so quickly so I could get started!", "Interview Questions": "What campaign or communication project are you most proud of?"}, {"date": "5 May 2017", "title": "Digital Media Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Guinness Partnership (London, England) in Apr 2017", "Interview Descriptions": "The initial interview  was 45 minutes long with a test at the end. The second round consisted of an hour long interview and a presentation.  As I had reached the second and final stage of the interview process I would have expected some kind of communication post interview, but I never heard anything again. Even though I didn't get the position (I guess!?), it would have been courteous to let me know and to have an opportunity to ask for feedback.\r\n\r\nUpdate - After posting my review, the Guinness Partnership did get back to me and apologise for not responding.  Their HR representative said this was down to human error and was very apologetic. The person who interviewed me also got in touch and we are scheduled to have a chat so I can get some interview feedback.", "Interview Questions": "I was given some information on a new product and I had 20 minutes to put together a presentation around how I would communicate about the new product."}, {"date": "23 Apr 2017", "title": "Housing Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at The Guinness Partnership (Manchester, England) in Feb 2017", "Interview Descriptions": "Met by member of staff who didnt engage me at all. Despite trying to have some sort of conversation, I was sat at a table in an open area and told to read the questions.  Was also informed that a work experience person would be sitting in on the interview.", "Interview Questions": "Tell me a time where you've made a difference to your team."}, {"date": "22 Apr 2017", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Guinness Partnership (Oldham, England) in Jul 2016", "Interview Descriptions": "Horrendous. Interviewed firstly by two men which I felt went really well. After a week I was called to say I had not been successful. \r\n\r\nA week or so later the head of that department called me to say there had been discrepancies with the interview process and I had indeed got the job. The other person who was then told he had in fact not been successful submitted a complaint (righly so) I was then told I had to go for another interview after being investigated and interviewed about how my first interview had gone, which was very stressful! \r\n\r\nAfter my second interview and nearly 2 months of waiting I got job anyway along with the other member of staff.", "Interview Questions": "Tell me about a time you have worked successfully as a team"}, {"date": "12 Dec 2019", "title": "Electrician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Guinness Partnership (Basildon, South East England, England) in Jul 2016", "Interview Descriptions": "Guinness partnership had taken over contract for social housing from willmott dixon and we were tupeed across. Met with new line managers and senior staff of guinness who were very helpful and made the transition very easy", "Interview Questions": "qualifications"}], [{"date": "20 Jun 2016", "title": "Voids Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The Guinness Partnership in Feb 2016", "Interview Descriptions": "Reasonable. Pleasant interviewers. Straight forward application process and prompt response to application. HR department very informative and advisable in recruitment process.  Made standard job application a lot easier than most and kept me up to date during process.", "Interview Questions": "Explain the barriers that housing officers face"}, {"date": "9 Mar 2016", "title": "Care & Support Enabler Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Guinness Partnership (Havant, England) in Feb 2016", "Interview Descriptions": "I was let into the building by a buzzer but no one came to greet me nor was I told where to go, so I had to look and ask around myself before finally finding the interviewers and some other colleagues in the kitchen having a chat, they were completely unprepared and left me alone in the kitchen while they went off to find a room for us to interview in. Being that I spent the first 10 minutes in the kitchen, I was surprised when I wasn't even offered a drink. I was then taken to a small dark office (they didn't even put the light on), sat on a single tiny chair at the back of the room while my two interviewers sat at a computer desk with their backs to me so they could write at the desk. They then proceeded to ask me 14 questions, 7 each. There was absolutely no eye contact throughout my interview as both of them were writing at the same time. I find it hard to connect with people's backs. I gave short/half answers simply because I felt like I had to wait for them to finish what they were writing and turn around and look at me so I could continue. They were completely rude and obnoxious. To finish, they made it obvious they weren't going to offer me the job by not shaking my hand or seeing me out of the building.", "Interview Questions": "Where have you received good service and how would you incorporate that into this role?"}, {"date": "14 Feb 2015", "title": "Compensation and Benefits Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Guinness Partnership (London, England) in Nov 2014", "Interview Descriptions": "Relatively quick yet intense 2 rounds process, some challenging questions. Hiring Manager biased towards foreign nationals and rather rude. It's worth mentioning that I had no contact / feedback whatsoever following final interview 3 months ago.", "Interview Questions": "N/A"}, {"date": "16 Sept 2014", "title": "ICT Helpdesk Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at The Guinness Partnership (Oldham, England)", "Interview Descriptions": "First was the phone interview, which compromised of a review of your CV and a few questions regarding ITIL and providing great customer service. Then the face to face interview was 1hr 15mins long. 8 competency questions, so giving examples of working within a team, great customer service, etc. After this you get to shadow another helpdesk staff member on a call. And finally ask the interviewers any questions you may have.", "Interview Questions": "Provide a time when you had to implement change"}, {"date": "26 Aug 2016", "title": "Customer Service Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at The Guinness Partnership (Brixton, London, England) in Apr 2012", "Interview Descriptions": "Chaotic and unbelievably silly. Will accept almost anyone who shows up so desperate they are to fill many posts let empty by sudden departures.\r\nQuestions were easy and I had the impression that the interview was merely a formality as the interviewer had no questions of any importance to the job.\r\nOffered a job immediately and accepted on the spot.\r\nNo training on tenant-Partnership rules of behaviour and quickly found out that GP's public image is a total fraud. Anyone in housing soon gets to know the evil reputation GP has.", "Interview Questions": "Am I good enough"}]]