[[{"date": "26 Apr 2023", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "Met virtually with the head of the department to see my qualifications and if I would be a good fit for the position. Talked about my experiences and if I would feel alright in a class setting with young adults. Asked how I give and take criticism to make sure I won't go about it the wrong way with students", "Interview Questions": "Why do you think you would be a good instructor?"}, {"date": "17 Jan 2023", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Dec 2022", "Interview Descriptions": "Made process easy and enjoyable. Friendly and accessible members of the department did a zoom call with me. Follow up with Human Resources. Interesting range of courses and opportunities to expand teaching repertoire.", "Interview Questions": "What criteria do you base raises on?"}, {"date": "22 Sept 2022", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Academy of Art University", "Interview Descriptions": "It was a very easy and smooth interview process overall. I had a brief phone call with a recruiter to chat about the role and my experience. We scheduled an interview for the following week.\n\nI had one interview, inquiring about my background and experience. I received an offer a few days later.", "Interview Questions": "Are you comfortable with meeting goals?"}, {"date": "16 May 2022", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Academy of Art University", "Interview Descriptions": "First interview was short, and notified me that I was actually in a pool, and not immediately considered for the job. This was upsetting because the job description doesn't say that you're applying to be in a pool of available candidates.  \r\n\r\nThen a second and third interview which went well.  I researched the school and their questions were standard interview questions.", "Interview Questions": "What experience do you have that directly ties into the role you've applied for?"}, {"date": "19 Feb 2022", "title": "Accounts Receivable Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University in Jan 2022", "Interview Descriptions": "Literally 3 long interviews and ended up doing free work for them in the end. I considered invoicing them for my time to draft a collections letter for them. Phone screening was done first and then a video interview with a recruiter. Another video interview was later done with the AR manager and supervisor. One thing I got out of the interviews is that they are serious about AR going to pull students out of class and escort them out for not paying, at least give students options on getting back on track for payments.", "Interview Questions": "Are you willing to work on weekends?"}, {"date": "25 Aug 2022", "title": "Librarian Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Academy of Art University (San Francisco, CA) in Jan 2022", "Interview Descriptions": "so many contacts and encouragement, questions by phone 2 times, a long zoom interview, several emails with assistants and I also interviewed a year ago. clearly Bay Area libraries use some people as \"interview fodder\". and never intend to hire some", "Interview Questions": "technical requirements, teaching philosophy, cataloging, art visual literacy, databases , diversity, students, library promotion, administration and university atmosphere and service ideas "}, {"date": "28 Apr 2022", "title": "Studio Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Academy of Art University in Sept 2021", "Interview Descriptions": "Had a quick phone interview about my interest in the role and to get any questions I had answered. They followed up in a week with their decision to move forward.", "Interview Questions": "What was your interest working in a studio lab?"}, {"date": "2 Feb 2021", "title": "Campus Security Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Academy of Art University", "Interview Descriptions": "One of the easiest I've ever done. I did get to meet my direcr manager and we discussed the job in detail. Felt more like a conversation. I appreciated his honesty about the difficulty of the job.", "Interview Questions": "Tell me about some of your weaknesses "}, {"date": "16 Sept 2020", "title": "Front End Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Academy of Art University in Jul 2020", "Interview Descriptions": "3 Zoom Interviews; which all consisted of the same questions by the interview, 22 multiple question assessment test on HTML, CSS and JavaScript passed with  22/22 correct answers; I was told I receive a score of 95% when in fact it's 100%. The assessment test was time sensitive so i made sure to complete it days before the deadline. The next step was to be another Zoom interview with the Director of Human Resources , the Director of Creative Development and I believe one of  AAUs Deans. Weeks turned to a month of excuses as to way a interview date could not be scheduled. Excuses such as \"two of the key players are away\", \"the department has a lot going on so next week we possibly schedule\" etc etc. Until eventually I get a call stating the team decided to go with another candidate they interview weeks before they had interview me which was a clear indication that finale interviews had taken place but despite having the necessary experience and passing their customized assessment quiz with a perfect score. I was not qualified! I should also note that I started the interview process in mid July 2020, and  had I not contacted HR two days ago (9/13/20) I wouldn't known the position had been filled! Complete waste of time!", "Interview Questions": "These questions were asked on every Zoom interview and via email during the interview process. \n\n1.     What are your best qualities that you can contribute to this position? / Why should we hire you?\n \n2.     Considering all your criteria and goals for your next career move, how does AAU meet your employment expectations?\n\n3.     How does this role play to your strengths?\n\n4.     How will this role challenge you to grow? \n\n5.     What other companies/positions are you actively interviewing with and how far along are you in their process?\n\n6.     How does our position compare to the other roles you are considering?\n \n7.     How will you go about making your decision if you receive more than one offer?\n \n8.     If we were to extend the offer to you today, is there any reason you would decline?\n\n9·   When is the soonest you can start in the role?\n\n10·   Do you have a portfolio or different links you can \n"}, {"date": "18 Feb 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Dec 2019", "Interview Descriptions": "The recruiter that worked with me was fantastic. We had open communication throughout the entire process. First was a video interview for a basic screening, then an onsite interview for a meeting with the director. All friendly people!", "Interview Questions": "What are three things your former boss would describe you as?"}], [{"date": "18 May 2021", "title": "Architecture Shop Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Academy of Art University (San Francisco, CA) in Oct 2019", "Interview Descriptions": "The interview process was smooth, both of my supervisors interviewed me. They gave me a tour of the facility and asked me questions about my experience. I went to architecture school, so I think that helped me in the interview process.", "Interview Questions": "What experience do you have operating a woodshop?"}, {"date": "7 Jul 2019", "title": "Accounts Receivable Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "Applied through their website and was set up for a three step interview process. Phone screening, Skype interview, and an in person interview with the manager and supervisor. Requires you to do a homework assignment on how you would collect from a student after the Skype interview and the recruiter will also request a credit check before making a offer: They will also offer you a lowball salary at the phone screening. Overall a waste of your time and not worth applying for. Very poor communication from the interviewer and recruiter. Many red flags in the hiring process.", "Interview Questions": "Are you willing to work weekends?"}, {"date": "20 Aug 2019", "title": "Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Academy of Art University (San Francisco, CA) in Jul 2019", "Interview Descriptions": "The interview was a exam which asked me to solve questions, build a program, and write a document. The questions are easy but time consuming. New knowledge in the test which requires research", "Interview Questions": "Write codes "}, {"date": "27 Apr 2023", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Academy of Art University in May 2019", "Interview Descriptions": "Pretty quick around two to three weeks in total. Overall easy and pretty regular sessions to get through Held two to three rounds of interviews with both HR and a member of the internal department", "Interview Questions": "Background questions, related to skills and job experience"}, {"date": "4 Jan 2019", "title": "Student Services Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Academy of Art University", "Interview Descriptions": "Call or in-person interview with HR, about 45 minutes-1 hour. Second interview with the Assistant Directors, along with a possible meeting with the Director/Executive Director of the department. Very straightforward, but can often get two different viewpoints from HR/the department between interviews. They usually let you know right away whether or not you got the position", "Interview Questions": "Experience level and comfort with being on the phone/communicating through email"}, {"date": "20 Jul 2021", "title": "Student Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Academy of Art University (San Francisco, CA) in Jan 2019", "Interview Descriptions": "The interview is very professional and the person is very kind. It is a good experience. It can give me a good study reference in my future work. I noticed that the office environment is very comfortable, relaxing, and pleasant.", "Interview Questions": "What similar work experience did you have before?"}, {"date": "2 Aug 2018", "title": "Student Services Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Academy of Art University", "Interview Descriptions": "Was contacted by an HR recruiter for an initial phone screening. Went in for an in-person interview with recruiter that was similar to phone screening. Was invited to an in-person interview the following week with directors; that one started around ten minutes late, which interviewers did not apologize for. I did notice one of the interviewers taking off to run off copies of my resume past our interview start time. The recruiter had told me that I would be meeting with the senior director and three associate directors, but what actually happened was that I met separately with two associate directors, and then the senior director, granted \"if he was available\".\r\nMeeting with the associate directors lasted half an hour (straightforward, they wanted to see what my interpretation of the role was and how my experiences related). Was asked to wait to speak with senior director; this took 5-10 minutes as they took time to debrief about me. \r\nThe interview with the senior director lasted close to an hour. A majority of it was spent listening to my interviewer discuss the specifics of the role as well as his vision and ongoing plans for the advising department. It was a long interview where the interviewer talked about himself more than actually asking the interviewee questions. He emphasized repeatedly the retention aspect of the role and the nature of the day-to-day routine (having more phone and email contact rather than in-person). Not sure if he was trying to convince me out of the role rather than into it.  \r\nWould not recommend. Impression I got was that they focused on finding people who would increase retention/graduation numbers in order to maintain the reputation of the university.", "Interview Questions": "In your own words, please summarize the role of student services advisor."}, {"date": "7 Jul 2019", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Aug 2018", "Interview Descriptions": "I was contacted via LinkedIn, I had a Skype interview and an other phone Interview with the Faculty evaluation Member. I was asked question about my background and get some advice about how to teach international student", "Interview Questions": "What's your philosophy of teaching?"}, {"date": "8 May 2019", "title": "Undergraduate Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Academy of Art University (San Francisco, CA) in Jun 2018", "Interview Descriptions": "The interview process was pretty much just a conversation with the VP of Admissions. I believe it was just a way to assess how you converse since that plays a major role in the job.", "Interview Questions": "Why do you want to for the admissions team?"}, {"date": "24 Jul 2018", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jun 2018", "Interview Descriptions": "The interview process took about two weeks and was enjoyable. It started with a quick phone conversation, then we had a FaceTime interview, then an in person interview. I enjoyed the process and everyone I talked with were really nice. I ultimately declined the position due to low pay.", "Interview Questions": "What do you know about the Academy of Art University?\r\nTell me about yourself.\r\nWhere do you see yourself in 5 years?"}], [{"date": "18 May 2018", "title": "Veteran Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Academy of Art University (San Francisco, CA) in May 2018", "Interview Descriptions": "Be careful, this employer discriminates based upon race and veteran status!  \r\n\r\nIn summary, recruiter asked me to come in to interview.  But even before I came into interview the she told me the position was already filled.    \r\n\r\nHere's the breakdown, I received an email to call the recruiter to schedule an interview.  I called later that day (less than an hour) and the recruiter and I had a short conversation.  At the end of the conversation, we set a date and approximate time.  She let me know that she'd be sending out the confirmation later.  \r\n\r\nAnyways, confirmation didn't come.  So, I called and left a VM and emailed her the day after.  After no response for 2 days, I called the HR department on the day of the \"interview\", the person that answered the phone suggested that I wait for an email even though the interview was supposed to be later that day.  I asked that another person please call me back regarding the \"interview\".\r\n\r\nSeveral minutes later, I received an email saying that I was no longer under consideration. \r\n\r\nNeedless to say, I find this very unprofessional behavior.  \"Ghosting\" someone is not the way you let them know that the company is not interested.  At any time beforehand, a call or email explaining the situation would have been sufficient.\r\n\r\nI can only assume that this snub was based on my race and veteran status since an interview was on conducted.  Instead of resolving the issue they decided to cut me out of the process.", "Interview Questions": "N/A"}, {"date": "26 Apr 2018", "title": "Human Resources Generalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Academy of Art University", "Interview Descriptions": "The process was brief and easier than expected. Within a month I received an offer and relocated to SF. I felt that the questions were easy to answer but I prepared for all questions I could think of.", "Interview Questions": "If faced with a situation you have never handled before, how would you prepare for it?"}, {"date": "28 Mar 2018", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Academy of Art University", "Interview Descriptions": "The recruiter was covering for another who recently left and was very busy. She was kind, clear, and communicative. I met with the recruiter once and two different managers. The offer came via telephone quickly and smoothly. There was no ability to negotiate due to budget cuts.", "Interview Questions": "Very typical interview questions relating to passions, motivators, and career experience. "}, {"date": "26 Mar 2018", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "Immediately after I submitted my application I got a phone call from an HR rep. We briefly discussed my interest in the position and set up a time for an in-person interview. After the interview with HR, I came back in for an interview with my manager. At the end of that interview, I was asked to go back to HR where they offered me the position. Very quick process.", "Interview Questions": "Tell me about your resume."}, {"date": "9 Mar 2018", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Academy of Art University (San Francisco, CA) in Mar 2018", "Interview Descriptions": "I applied approximately 3 months before receiving a random phone call from a recruiter. She held an informal phone interview, asking me to talk about my background and then invited me onsite for an interview with the hiring managers. The whole process was rather strange, as I had to call her several times to actually get the interview scheduled. The in person interview was pretty straightforward and rather conversational in tone. I felt pretty confident when I was told that they wanted to move forward with my application, with the recruiter promising to call me back later in the day with the official word, only to then send me a generic \"thanks but no thanks\" e-mail a few days later. When i asked for an explanation as to the discrepancy, I received no response.\r\n\r\nDon't bait and switch applicants. Be honest and straightforward in the interview process. When applicants ask for feedback, provide it rather than hiding behind your e-mail.", "Interview Questions": "Please tell us about yourself and what excites you about the position."}, {"date": "22 Mar 2018", "title": "Marketing Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Academy of Art University (San Francisco, CA) in Jan 2018", "Interview Descriptions": "4 step process + drug screening.  Recruiter screening call. Mainly informational. That's followed by a phone interview then 2 in-person interviews. All the interviews are pretty easy going except the last one.", "Interview Questions": "What happens when someone provides feedback on a design and it's critical of your decision? "}, {"date": "8 Sept 2017", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Academy of Art University (San Francisco, CA) in Aug 2017", "Interview Descriptions": "I applied online, didn't hear anything, forgot all about it, and got a call out of the blue three months later asking to come in for an interview that week. \r\n\r\nI was called by somebody from HR, who I met with first in downtown SF. After 30 minutes of pretty casual chatting, they bussed me 40 minutes across the city in a private shuttle in which I was the only passenger. The woman from HR told me that I would meet with the VP of admissions, who was very decisive and \"hires very interesting people.\"\r\n\r\nAt the next location I spoke with the VP of Admissions for around 30 minutes. He asked no typical interview questions, but instead different versions of \"tell me about yourself.\" It seemed like the idea was to get me talking, and to see if I could talk well, because talking well was an essential job requirement. Next he brought in somebody who had the job I was applying for, and we talked about day-to-day job functions. He seemed to stress the fact that is was a lot of talking on the phone, and that sometimes it's hard to keep up because everyone has \"a pretty big portfolio.\" After that, the VP brought in the director of admissions, who essentially asked me the same kinds of thing as the VP. At the end of our conversation, the director of admissions told me that they agreed that I seemed like a great fit for the position. I was called by the woman from HR later that day and told they would like to get started with the hiring process/background checks. \r\n\r\nI imagine that if you want to do well in this interview, you have to know how to talk well and present yourself well, and everything else will come easily.", "Interview Questions": "\"Tell me about yourself\""}, {"date": "11 Sept 2017", "title": "Undergraduate Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Academy of Art University (San Francisco, CA) in Aug 2017", "Interview Descriptions": "I applied in May/June and got an email back in August asking me to call the HR person. When I called we talked briefly about my resume and set up an in person interview with her the next week. She also set up an interview with the VP of Undergrad Admissions the same day.  The phone call was straightforward and she didn't really ask me any questions and just said she felt very confident in my abilities based on my resume which is why she set up both interviews in one day. (For some background: I just graduated from one of the top three art universities in the US and worked in my school's admissions office for three years.)\r\n\r\nI came in for the interview which was just a very casual conversation. I think because I was selling myself and gave examples on my knowledge and previous interactions with students and parents she didn't need to ask me many questions. If anything, she just helped me prepare for my next interview and gave me more information about the job. It was very nice because I felt like she just really wanted me to succeed. I felt very wanted as she walked me out and put me on the bus to get to the Undergraduate Admissions Office to interview with the VP.\r\n\r\nThis interview was a bit more formal but not by much. The VP was personable and actually gave me good advice on how he got to the position he has now. We discussed skills a bit and at a certain point I think he already made his mind up and we just had casual conversations on interests and life. He then introduced me to someone who would be my coworker and I got the chance to speak with her one-on-one about the pros and cons and daily work life. Then he introduced me to the person who would be my manager and after the VP took the time to walk me out of the building to the school's bus stop. I came out of it very confident I got the job.\r\n\r\nI got a call that same day with a verbal offer and that all three people unanimously said yes! After submitting references and a background check I got a formal written offer.", "Interview Questions": "No questions were really asked. "}], [{"date": "11 Sept 2017", "title": "HR Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Academy of Art University (San Francisco, CA) in Jul 2017", "Interview Descriptions": "Pretty average interview with a 3 step process: Phone screening, meeting with HR business partners and a final interview with HR manager and vp of HR.  People were friendly and the HR manager was pretty responsive and nice. However, they don't follow-up with you when you're not the candidate that they want.", "Interview Questions": "How does your current role fit into this position?"}, {"date": "26 Apr 2019", "title": "Lead Student Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jul 2017", "Interview Descriptions": "I felt the interview process was speedy and thorough. I was able to get a feeling of what the mission of the Academy was and how I can contribute.", "Interview Questions": "N/A"}, {"date": "10 Dec 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jun 2017", "Interview Descriptions": "The interview went as follows: Screening call, onsite with recruiter, onsite with direct report, compute skills online test, and onsite with hiring manager. The process was overall quick and straight forward, the recruiter works to make sure you are interviewing in a school which fits your skill set.", "Interview Questions": "Are you able to speak and collaborate with people whose first language is not English ?"}, {"date": "7 Mar 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Academy of Art University (San Francisco, CA) in May 2017", "Interview Descriptions": "Email survey, 20 min phone interview with Human Resources rep. Follow up via email. Was a cattle call process and not interested in seeing potential growth for prospective employees. I don’t know how many more words it takes to get to 30 words minimum.", "Interview Questions": "What about your previous experience makes you a good fit for this role? "}, {"date": "17 May 2018", "title": "Account Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in May 2017", "Interview Descriptions": "I was reached out by one of the recruiter representative who was kind. She provided me of the job description, hourly rate, when is my availability. She then emailed me an excerpt to reply to. I was then offered to meet with the managers for an in-person interview. After the interview, I received a phone call of the offer.", "Interview Questions": "Why Academy of Art?"}, {"date": "9 Mar 2017", "title": "Student Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Academy of Art University", "Interview Descriptions": "I received an email about setting up an initial phone interview. I set up a time with them, and then the woman who was supposed to call me, emailed me and asked if we could reschedule because she got pulled into a meeting. This was understandable, so I said yes, we could reschedule and told her when I was available. I never heard back from her. In the next few days that followed, I contacted her again as well as the original person who contacted me, just in case there had been some miscommunication. I never heard from either of them again, which I find very unprofessional. Do not contact someone to set up an interview and then never follow up. So strange and off-putting.", "Interview Questions": "N/A"}, {"date": "8 Mar 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Feb 2017", "Interview Descriptions": "Received the call, had an in-person interview in couple of days. Second interview with admin department representatives was held in couple of days afterwards. Final interview was with 2 directors and office manager, which was the crucial one. Got the offer after couple of days after background check and references` input.", "Interview Questions": "What do you know about the Academy? What was your previous job?\r\nHow do you see yourself in this kind of a school?"}, {"date": "18 Jan 2017", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Academy of Art University (San Francisco, CA) in Jan 2017", "Interview Descriptions": "The process was great, the recruiter was very easy to speak with.  I was asked a series of questions regarding hourly availability to see if it was a match and was informed of the contractual parameters for the position.", "Interview Questions": "They asked regarding preferred salary, it seems like they are working out competitive rates for the position."}], [{"date": "6 Jun 2018", "title": "Student Services Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jan 2017", "Interview Descriptions": "I first received a phone interview which took about 15 minutes. At the end a in person interview was scheduled. After then a interview with  managers at once. They each ask questions and jot down answers", "Interview Questions": "Basic questions i.e. strengths, weaknesses, name a time you had to meet deadlines, etc."}, {"date": "1 Dec 2016", "title": "Procurement Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "The interview was held via skype and took about 15 minutes. The questions were all very standard, mostly about my experience. Preceding the interview was a phone screening conversation/mini-interview, I wasn't very prepared for this as I hadn't expected to hear from them.", "Interview Questions": "What do you look for in a manager"}, {"date": "29 Dec 2016", "title": "Human Resources Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Nov 2016", "Interview Descriptions": "First had a phone screening, a few days later, Skype interview, and then onsite Interview. Interview process was smooth and very professional-- all questions were standard. Also required to take a skills test on Excel and Word-- that was a bit more tricky.", "Interview Questions": "Describe a time when you had to deliver bad or negative news to another employee"}, {"date": "8 Sept 2016", "title": "Academy Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Academy of Art University (San Francisco, CA) in Sept 2016", "Interview Descriptions": "I had a 1:1 phone screen with HR, then a 1:1 in person with another person from HR. After that, I met up with the manager of academic advisors for a 1:1. The interview went well, manager even said she wished she could give me the good news right away, but she had to contact her VP first. However, after this interview, I did not hear back from AAU. Sent two follow up emails. Still no response. Extremely unprofessional and rude.", "Interview Questions": "Why do you want this job?"}, {"date": "16 Dec 2016", "title": "Financial Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Academy of Art University (San Francisco, CA) in Aug 2016", "Interview Descriptions": "I did 3 interviews. 1 over Skype with an HR Rep. 1 in person with my manager. 1 over the phone with the VP of Financial Aid. Overall took about 2 months.", "Interview Questions": "It was less typical interview questions and more about how they wanted to change the culture there and if you would fit in."}, {"date": "28 Aug 2016", "title": "Photo Lab Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Academy of Art University (Los Angeles, CA) in Aug 2016", "Interview Descriptions": "Answered some email inquires to cover basic information, then telephone call to better understand the job's requirements and expectations. Right away the interviewer understood the hurtles of moving to the Bay area, but was very helpful in seeking solutions, possible benefits of working for the school. Unfortunately, there were no health benefits for a position that is basically seasonal; 3 times a year, classifying employee as part-time. It's a challenge trying to live and work in the Bay area due to the massive living costs, institutions will be hard pressed to get fresh talent from outside the city.", "Interview Questions": "Ability to relocate to the city with the salary offered."}, {"date": "17 Dec 2016", "title": "Online Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Academy of Art University (San Francisco, CA) in Jul 2016", "Interview Descriptions": "Initial contact from recruiter. A writing sample was requested biased on a specific scenario. Department interview. HR Interview, Background Screening. Then Executive approval. Everyone was very friendly and willing to work with you through out the process.  From start to finish the recruiter was encouraging and helpful and answered all of my questions,", "Interview Questions": "What process would you use to recommend a change in procedure?"}, {"date": "20 Aug 2016", "title": "Graduate Student Services Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jul 2016", "Interview Descriptions": "Well-handled and organized. A representative of the university called and checked in between stages and I was accommodated with phone and Skype interviews when I could not be there in person.  Interactions were warm, informative, and lots of details and reminders were provided via email as well. I always knew where I stood in the interview process.", "Interview Questions": "Key in all stages: describing my interest and fit with the role in question and how my background led me to this role."}], [{"date": "10 Jun 2016", "title": "International Admissions Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Academy of Art University (San Francisco, CA) in May 2016", "Interview Descriptions": "The interview by phone and face-to-face was amazing. The interviewer was friendly and extremely professional at the same time. She made very specific questions, and made me feel very comfortable during the interview. We reviewed together my resume and the job requirements, and discussed salary and schedule as well.", "Interview Questions": "Why I was looking for a different job?"}, {"date": "10 Jun 2016", "title": "Student Accounts Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Academy of Art University (San Francisco, CA) in May 2016", "Interview Descriptions": "The interview went smoothly, both the manager and the assistant manager were very professional, and informative. They were friendly and asked just enough questions that lead me to believe they were interested in hearing what I had to say. We were in a large conference type room for the interview, which was nice. It was a very spacious room as to not make anyone feel too enclosed. Interviews are stressful enough and small rooms make it harder to think and feel comfortable.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "28 Apr 2016", "title": "International Admissions Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Academy of Art University (San Francisco, CA) in Apr 2016", "Interview Descriptions": "I have been working in the same industry for years and understand thoroughly about the scope of duties this position requires. I have been following the university and applied online when the position opened up. I received an email from the recruiter within two days followed by the short phone interview.\r\n\r\nI had many questions prepared for the recruiter as I wanted to know the types of students I will be working with and whether or not I will be working with an international education consulting agency. I also asked other simple questions such as which campus will I be working it, who will I be reporting to, and etc. HOWEVER, the recruiter just laughed and said she knew nothing more about the position and she's just being told to give me a call. I am sorry AAU - it looks like you hired the wrong person as your recruiter to begin with. I was very confident about my background and competency about this role but end up feeling very negative and sorry for AAU after the phone call.\r\n\r\nAfter not being able to answer any of my questions, the recruiter said she will get back to me within a few days for another follow-up. Two days after I received an email saying that this position has already been filled and they are not looking anymore.", "Interview Questions": "Why are you looking? What do you not like about your current role that you want to work for AAU?"}, {"date": "28 Feb 2016", "title": "Immigration Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "Basically the HR lady told me that even though this is a visa issued/management job at the international office,  it is expected the person to sell the university to potential students. Basically, they want you to sell and market the school to the potential students, which is highly unusual for this kind of position.", "Interview Questions": "I was asked about my previous jobs workload and if I mind working on the weekend."}, {"date": "26 Feb 2016", "title": "International Admission Specialist (Bilingual) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Academy of Art University (San Francisco, CA) in Feb 2016", "Interview Descriptions": "Apply online and got an interview invite the next day. Confirm a phone interview within a week. I got a confirmation email 3 days later to inform that I was not able to move on. HR staff handled the process very professionally and efficient.  I asked benefits and working hours but HR staff was not able to provide too much info on benefits. Working hours are wired Tuesday - Sat 10am-7pm with 1 hour unpaid lunch break. 10 paid vacation + 9 sick leave.", "Interview Questions": "Q1. Why do you want to apply for this job?\r\n\r\nQ2. Tell me what do you do at your current job?\r\n\r\nQ3: What is your expected salary? (Their offer rage is between 40k-48k DOE)\r\n\r\nQ4: What is your career goal?\r\n\r\nQ5. What questions do you have for us?"}, {"date": "13 Nov 2015", "title": "Outreach Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Academy of Art University", "Interview Descriptions": "I got a Skype interview first, and then a face-to-face interview with my supervisor. The whole process is positive and pretty standard. No tough questions. They just interested to know you and how you can be a fit for this job.", "Interview Questions": "Why do you want this job?"}, {"date": "12 Nov 2015", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Academy of Art University (San Francisco, CA) in Nov 2015", "Interview Descriptions": "The process was pretty standard. You meet with someone from HR for a preliminary interview, then interview with a few people in the Admissions department. The position isn't quite what they describe online. Once I went through the interview process and spoke to various people that worked there it sounded more and more like just a sales representative.", "Interview Questions": "What do you understand about our school?"}, {"date": "17 Oct 2015", "title": "Campus Host Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "I applied online and got a call to schedule an interview at their 79 New Montgomery building. I was told to dress professional and to bring a copy of my resume. I ended up interviewing with one of the heads of security and a person from the human resources department. After passing the interview process I received an email from a company to enter in my information so they could preform a background check. After passing the background check I was ask to come back to the 79 New Montgomery building to fill out a bunch of paperwork before starting.", "Interview Questions": "To describe what I thought the job entailed. What my experience was"}, {"date": "18 Aug 2015", "title": "Financial Aid Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Academy of Art University", "Interview Descriptions": "went through phone interview, followed by a Skype interview, then a in person interview, very basic questions, customer service based interview questions, financial experience is a plus but not required", "Interview Questions": "do you have any financial aid experience"}, {"date": "4 Aug 2015", "title": "Customer Service Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "My interaction with the AAU's recruiter was positive, the department I'd be working for-ehh.\r\nThrough the whole process I felt like the recruiter was in my corner, routing for me, giving me tips, giving me updates on the status, or even if there was no update- she'd call and say \"Thanks for your patience, we haven't made a decision yet. I'll call again on Friday to check in.\" \r\n\r\nFirst, very positive in-person interview with recruiter.\r\n\r\nThe second interview was with two representatives from the department I'd be working in. One couldn't keep his eyes off of his phone. Ultimately, he excused himself to make a phone call. He returned to the room and then had to leave again! His ins and out definitely broke my concentration and gave a weird vibe to the environment. I repeated some of my answers when he returned, but he was disengaged. This guy seemed to be in a very high position at AAU and very removed from the role of the position I was interviewing for. Clearly, his phone calls triumphed a measly interview. After I had this second interview the recruiter called to check in again. She said they really liked me and was considered one of the top candidates (despite all the awkwardness of the interview!). It was like I was getting a sneak peak about into the other side from the recruiter! \r\n\r\nA lengthy process overall and ultimately was not offered the position.", "Interview Questions": "What technologies are you skilled in? "}], [{"date": "23 Aug 2015", "title": "Cook II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Aug 2015", "Interview Descriptions": "Two managers interviewed me for 30 minutes each, and the questions were settled in a written document. The first interviewer friendly inspire my confidence showed the interviewee.\r\nThe questions were difficult for me because its technical nature about it.", "Interview Questions": "1. Tell us about your background:"}, {"date": "30 Jul 2015", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Academy of Art University", "Interview Descriptions": "i received a phone call the next day after I submitted an online application, the phone call was from HR dept about 3-5 mins, scheduled for two onsite interviews the following week - with HR and with your team managers, about 30 minutes each, easy-avg questions, mostly strength & weakness questions. Then received a phone call with offer after 3-5 days.", "Interview Questions": "why do you think we should hire you for the job"}, {"date": "21 Aug 2015", "title": "Undergraduate Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jul 2015", "Interview Descriptions": "Quick 15 minute phone interview\r\n30 minute interview with HR recruiter\r\n30 minute interview with hiring manager\r\n\r\nEveryone was so friendly and welcoming. I felt heard and cared for as an interviewer. The human resources recruiter I worked with was incredible at communicating and answering emails on a timely manner.", "Interview Questions": "How would you express to parents the importance of their student pursuing the arts?"}, {"date": "9 Mar 2016", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jun 2015", "Interview Descriptions": "Step one was a Skype interview, which went just fine and actually left me thinking that, perhaps, all of the terrible, negative reviews online might be wrong.  After the initial Skype interview, I was invited in for an onsite interview with the same woman I had spoken with on Skype.  This, also, seemed to go fine.  I was then asked to come back again, mind you I lived three hours away, to do a fake presentation and tour for the same woman and two managers, a male and female.  This part was awkward.  I get what they were trying to do, but both during the \"role play\" and outside of it, these two managers were two of the worst humans I've ever come across.  The female manager seems as if she must be absolutely miserable in her personal life, and she's taking it out on anyone and everyone that comes near her.  The male manager was ok, but seemed to be overpowered by the harsh, abrasive female counterpart.  They made me feel so unwelcome, I cannot even imagine working for them on a day-to-day basis.  In my opinion, and from currently being in an HR position, this is NOT how you want to make interview candidates feel.  You should want your candidate to feel welcome and feel like this is a company that they would love to work for.  No wonder this institution can't keep employees!  They treat you terribly and constantly push their own misery off on you.  After the miserable interview process, they take weeks to get back to you with updates.  Everything about this place is unprofessional and uninviting.  The HR department at Academy of Art University should truly be ashamed of how these employees represent the university.  I'd rather flip Big Macs for minimum wage at McDonald's than work here.", "Interview Questions": "I had to give a presentation to the managers as if I were presenting to potential students."}, {"date": "30 Apr 2015", "title": "Admissions Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Academy of Art University", "Interview Descriptions": "initial phone screen...as long as you can answer some basic sales oriented questions then you move on the another recruiter who has you come In for a face to face...if all good then you interview with director of admissions", "Interview Questions": "What do you know about the university"}, {"date": "31 Oct 2016", "title": "Campus Tours Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Apr 2015", "Interview Descriptions": "I applied online and received a call after about 2 weeks. The person I spoke to in HR was extremely excited about my resume, so much so that she wanted me to interview for another position (an administrative assistant position) as well. That way, she said, I could choose between the two.  She emailed me the job description for the administrative position so I can decide. I had done my M.A. in England, something she seemed excited about. In fact, she liked me to so much, that she wanted me to come in for an in-person interview the following day. However, when I went in, she seemed completely shocked at who she saw - a young, hispanic woman. She took me into her office and looked like she really didn't want to interview me. She almost seemed offended by me. She had no recollection of mentioning two positions to me. She looked uncomfortable the whole time she was sitting there and hardly asked me any questions, and the ones she did ask were stupid, condescending questions. When I asked her about the extracurricular activites available to students, she literally went on their website and showed me the list with no elaboration. This was something she just wanted to quickly end. The in-person interview lasted about 5 minutes before she rushed me out to the elevator. I'm pretty sure that was my first time experiencing blatant discrimination in an interview. I never expected a call back.", "Interview Questions": "Have you ever talked on the phone? Do you know how to use email? Have you written a lot of emails?"}, {"date": "17 Mar 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Mar 2015", "Interview Descriptions": "I applied online, got a phone interview within a week, and scheduled in-person interview within a month. The interview was conducted in HR with a follow up with Student Affairs over the span of a few days in SF.", "Interview Questions": "How do you manage things when your manager isn't around?"}, {"date": "2 Mar 2015", "title": "Undergraduate Admissions Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Academy of Art University", "Interview Descriptions": "The first stage is a 15 minute phone interview, and if they are still interested in you after the phone interview you are invited for an in-person interview. The in-person interview is one on one for about 30 minutes, and it was a very pleasant experience. They are definitely focused on finding someone who is able to effectively communicate over the phone, so I would not apply if this is something you do not enjoy.", "Interview Questions": "Do you feel confident and comfortable contacting potentially interested students over the phone? "}, {"date": "28 Apr 2015", "title": "Digital Lab Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Mar 2015", "Interview Descriptions": "First had a phone screening with a recruiter. From there, I was moved to the next stage of the interview process, which was an in-person panel discussion with a manger and lead technician. Overall, it was an extremely easy interview.", "Interview Questions": "What do you like about photography? How would you deal with foreign language students? How many years have you been shooting photos? Do you have experience working with digital printers."}, {"date": "24 Apr 2015", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Academy of Art University (San Francisco, CA) in Mar 2015", "Interview Descriptions": "I applied to a call center position and was contacted the next day. I spoke to the recruiter on the phone and she was great at answering my questions and telling me about the job. I came for an in person interview with the recruiter the follwing week and met the managers right after. Both of these interviews were very detailed, thet asked lots of questions. I then recieved a call the next day to do references and I have since started my new job. The experience was very smooth and quick!", "Interview Questions": "How do you keep yourself motivated?"}], [{"date": "18 Mar 2015", "title": "Customer Service Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Academy of Art University (San Francisco, CA) in Mar 2015", "Interview Descriptions": "I applied for the job awhile ago and then forgot about it, because it took about a month until I heard anything.\r\n\r\nThe recruiter seemed great, she was easy to speak to, understood where I was coming from and thought that I would be a great fit for the job.  I did too, that's why I applied.  \r\n\r\nThe first step was a telephone interview with the recruiter, that went well.  The next step was an in-person interview with the recruiter a couple of days later.  She took lots of notes, again told me she thought I was a great fit and then she scheduled me for an in-person interview, for the next day, with the woman who would be my boss if I got the job.\r\n\r\nThe morning of the interview the recruiter called me and told me that she needed more information, because the woman I was interviewing with was questioning my resume and whether or not I had call center experience.  Keep in mind I stated, many times, in both interviews with the recruiter, that no I had never managed call center staff, but had managed support staff, for many years, in an environment where help was requested via telephone, email, a ticketing system, etc.\r\n\r\nNow running a bit behind due to the last minute phone call I went over for my next interview.  During the interview I had the overwhelming feeling that the woman could not wait to get me out of her office and had zero interest in me.  It was extremely uncomfortable and by the end of the interview (a whopping 20 minutes) I couldn't wait to get out of there myself.  \r\n\r\nAfter I came home I wrote a follow-up email to the recruiter thanking her for setting up the interview and asking her to please let me know the outcome either way.  Zero response!\r\n\r\nAs they were looking to fill the position within a week and I've heard nothing I can only assume that I didn't get the position.  It would have been nice to receive an email letting me know that they went with another candidate, but that didn't happen, which I find very unprofessional (not to mention the last minute call and the fact that the woman at the call center having zero interest in me).  I did read several reviews on Glassdoor about this same thing happening (i.e. apply, interview, hear nothing) and now I know it to be true.\r\n\r\nI've been the hiring manager several times and if someone takes the time to come in and interview with me I take the time to send them an email at the very least.", "Interview Questions": "Have you ever worked at a call center?"}, {"date": "29 Jan 2015", "title": "Student Services Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Academy of Art University", "Interview Descriptions": "I was contacted by the Recruiter via phone. We scheduled a phone interview which went well and then an in person interview. The Recruiter sounded super nice over the phone and said that if this position wasn't a fit- she would find something that might be a better fit, so it seemed hopeful. \r\nI came into the office and a peculiar thing: the candidates that were interviewing for this position were sitting waiting for their interview time, seems they schedule it similar to a casting call. \r\nEverything went well, but towards the middle of the interview her questions felt like she was demeaning and asking why I am even applying for this position. I didn't feel like this was relative to my interview. I worked for a similar educational for type of environment and the recruiting process is the opposite. I decided that whether or not I was going to get the position I would definitely pass, the Recruiter was not professional, and this would parallel the organization. The Recruiter did not even follow up to let me know the results either.", "Interview Questions": "Why do you feel like your past experience relates to this job? "}, {"date": "3 Feb 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Academy of Art University in Feb 2015", "Interview Descriptions": "Applied through linkedin. Was denied first application. Was then called for a job that better suited my qualifications. Short easy phone interview. Was then called in for second interview with HR head. A very easy interview, most lead by my questions. There will be a third interview with direct suoervisiers this week if choosen from applicants.", "Interview Questions": "Asked how I deal with angry or frustrated students. "}, {"date": "23 Sept 2015", "title": "Financial Aid Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Feb 2015", "Interview Descriptions": "I had my first interview with HR recruiter and went over the resume. I had to explain each job I had and reasons of leaving the job. Later, I had a second interview with the financial aid managers and was a 20 min. interview very casual.", "Interview Questions": "Share a story where you provided great customer service "}, {"date": "22 Jan 2015", "title": "International Student Services Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Academy of Art University", "Interview Descriptions": "Applied on website, but the site was having glitches, so I followed up with the Recruiting Assistant who posted the position on LinkedIn, he graciously offered to forward my resume on. About a week or so later I heard from the Recruiter to arrange a phone interview. She was very nice, responsive to emails and seemed to have really read my resume and understood my track. This was just before Thanksgiving, so I didn't expect things to move quickly. \r\n\r\nBut I heard back that the VP of this unit wanted to interview with me about 2 weeks later, so I agreed working around her strict schedule. Then the Recruiter contacted me the day before the interview to cancel as the VP was no longer available. So we re-scheduled for a date about a week later, but as soon as I arrived and was waiting in the lobby the Recruiter informed me that the VP cancelled again last minute, but no explanation, etc. The Recruiter still met with me for a few minutes, we had already discussed my background on the phone, and she didn't know the details of the position, so I couldn't ask any questions. She said she would find out the VP's availability to re-schedule \"again\" but never heard from them again. I followed up with the Recruiter immediately with a calm and friendly thank you note and asking for the next interview date, but still nothing. \r\n\r\nAs I'm still new in my current role and don't have a flexible schedule (which I explained very well to the Recruiter), it was very difficult to arrange this time off work, specially twice, and then to not even be interviewed was completely unacceptable. I had heard very negative things through former employees, etc. about the lack of seriousness, it being just a tuition factory and there being no focus on student services or staff development, but I decided to form my own opinion. I still can't believe that such a public entity who already has a bad reputation is still doing nothing to improve that, seemingly both internally and externally. So now two months later and still nothing, I am counting my blessings that I never heard back as the is says everything about this so called \"university\" which is more of a real estate venture.", "Interview Questions": "Mostly just that the Recruiter didn't seem familiar with the position, international student services, visas, or the details of the department, so it what somewhat difficult to talk about my experience. "}, {"date": "27 Jan 2015", "title": "Photography Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Academy of Art University in Jan 2015", "Interview Descriptions": "I applied online and was contacted for a phone interview two days later. That was pretty brief, with an overview of some of my experience and of this position. She told me the pay is $13/hour, that night and weekend shifts are pretty much required, and that it's a position contracted for each semester. She asked if that was all okay, I said yes, and she set up an in-person interview with HR for me. That interview was pretty straight-forward, mainly reviewing my resume and me talking about my experience. I was told this interview would be just 30 minutes with her, but that went well so they sent me to another site to meet with the photo lab managers. Luckily I had free time that afternoon because the process unexpectedly took about 2 hours. The in-depth technical interview with the actual photo hiring managers was much more difficult and they had a lot of specific questions about my experience with equipment. Before we sat down for the interview, they showed me around the facilities and explained a lot of what I would be doing. They seemed pretty nice and I could tell it was going well. Toward the end they showed me the perks--a nice shirt and jacket uniform, a key card, and he said I would be getting health insurance, which makes sense because the job is full-time. The original woman I interviewed on the phone with called me back that afternoon to offer me the position and she also informed me, however, that the job does not include health benefits because it is \"part time.\" Although it's a minimum of 40 hours per week, you don't working for the entire period between semesters and need to be rehired, so they're able to label it part time. That was on a Thursday and I took the weekend to think about it, ultimately informing her on Monday that I was going to turn it down.", "Interview Questions": "They asked about whether or not I had used various types of equipment and specifically which ones, like lighting, C-stands, cameras, etc. "}, {"date": "15 Jul 2015", "title": "International Department Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jan 2015", "Interview Descriptions": "I talked to human resources and then went into the office to talk to two managers. It was a quick and good talk and they called me the next day to tell me that i was hired.", "Interview Questions": "Describe your past"}, {"date": "14 Feb 2018", "title": "Full Time Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Academy of Art University in Dec 2014", "Interview Descriptions": "I was contacted after answering an advertisement on Craigslist for a full-time faculty member.  I could hardly believe I found the ad there, but answered anyway.  They called me three times asking me to come out for a visit.  I was told I would be interviewed and that I was there \"first choice.\"  Weeks passed without any contact or offer of flying me out, until they called again and told me just to buy my own ticket and they would reimburse me.  I booked a cheap hotel (125$) for two nights in Oakland and the cheapest r/t flight I could find.  I printed my receipts.  \r\n\r\nWhen I got to San Francisco, I had been given the number of the President, by the Director who was in contact with me.  She never answered my calls when I called, nor did she return my calls.  This was not a good sign. So I inquired with the Director.  He seemed as frustrated as I was and called her and managed to set up a meeting between me and her at the Palace Hotel during lunch hour the next day.  She came to that meeting an hour late accompanied by her assistant , she is a sort of enforcer for the President.  The president was overly familiar, fake-friendly and under-curious about me, which always sets off bells.  But apparently I was hired.  She asked me where I was staying and I told her.  She had my hotel switched to a fancy one, but didn't offer to pay for the one I had already booked or my expensive flight.  She told me there was \"one more step\" in the hiring process and that was passing approval from her father. The following day I was to meet her and him at Trader Vic's for lunch.  We met there, and both arrived in black limos that had a sort of mobster dirty feel.  Hers said \"I (heart) art\" on the license plate.  The Father proved to be someone who dominates in conversation, interrupts, and tries to throw in the clever line just when you are getting serious about your answers.  He was pompous and down-talking.  I had brought along a small original noted piece of my expensive artwork.  It was of a famous black woman. He looked at it and immediately commented, \"Are you a communist?\" (with some self sniggering).  Awkward.  Apparently I was hired after this, but felt disgusted and unenthused about the owners of this school.  The process did not get any better after this.  I never got reimbursed for the hotel or flight until nearly 8 months later, even though the President paraded me around the 79 building telling everyone she \"flew me out here\" to interview.  She agreed to pay only half my moving expenses which amounted to $10k.  Those also never were paid until I had contacted the administration 4 times about it well into the second half of my first year on the job, which was nothing as she had described it in the interview.  She had described a job of creativity and teaching where I would teach at a high level with autonomy.  It was nothing like what was described.  No faculty had autonomy, and every aspect of classroom teaching was controlled from curriculum to syllabus, to attendance forms which were expected three times each class period!  Everything presented in the interview was a sham and a lie.  I spent three years here before leaving for a much better opportunity.  Do not fall for this place.", "Interview Questions": "Are you a communist?"}, {"date": "24 Jul 2015", "title": "Cybercampus Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Dec 2014", "Interview Descriptions": "Phone interview followed by in-person interview with department manager.  As long as you are even slightly competent with using a computer, you shouldn't have any problems.  It helps to be proficient with both PC and Mac.", "Interview Questions": "N/A"}, {"date": "21 Nov 2014", "title": "Student Services Assistant Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "It was a pretty simple interview with basic questions such as why my interest in the position and what I could contribute to the position. It was with the hiring manager for the department.", "Interview Questions": "Give me an example of a situation that was difficult to resolve."}], [{"date": "20 Oct 2014", "title": "Department Assistant, Undergrad Admissions Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Academy of Art University (San Francisco, CA) in Oct 2014", "Interview Descriptions": "First applied on line, it took about 4 days to get a reply. \r\nNext step was a 20 mins phone interview, after received the reply message in two days.\r\nAfter phone interview, will need to do a web test about typing, data entry and MS office work.\r\nStill waiting for next step.", "Interview Questions": "Phone interview wasn't too difficult, it was about 20 mints.\r\nQuestions like, why do you think you will fit for this position?"}, {"date": "15 Sept 2014", "title": "Part Time Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Academy of Art University", "Interview Descriptions": "After an employee referral I was invited to a group interview with an administrator I never saw again during my 3 years of employment. No questions were asked, I just listened as she told me about company policy.", "Interview Questions": "N/A"}, {"date": "3 Sept 2015", "title": "Design Shop Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Sept 2014", "Interview Descriptions": "Was extremely straight forward and easy. Little to no technical questions. Was processed directly through a human resources representative. Process was streamlined and took only a few weeks. HR was fairly responsive and easy to get in touch with. Most of the questions were about personal background and past experiences.", "Interview Questions": "What prior similar job experience do you have?"}, {"date": "22 Sept 2014", "title": "Video/Audio Media Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Aug 2014", "Interview Descriptions": "Had a short phone interview with a recruiter where they briefly described the work and the salary range. Then had an interview with two department heads a few days later. Mostly they just ask about my experiences with software and equipment. It was a very candid interview, no strange questions or tricks. A very comfortable experience, and everyone was very nice.", "Interview Questions": "The interview was very straight forward, so none."}, {"date": "7 Jul 2014", "title": "International Admissions Specialist - Bilingual Mandarin Chinese/English Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Academy of Art University", "Interview Descriptions": "The hiring ad was on Craigslist, first submit the resume through email, then a phone interview. The first round interview is about 10 minutes. I think the hiring ad is quite specific about the requirement, so it worth while to read it thoroughly and find out hoe much the match can be.", "Interview Questions": "Why do you want this job? Why do you leave you current job? "}, {"date": "31 Jul 2014", "title": "Undergraduate Admissions Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Academy of Art University (San Francisco, CA) in Jul 2014", "Interview Descriptions": "I applied for the Undergraduate Admissions Representative position online. Within a few days, I was contacted by a recruiter via email to schedule a phone interview. The phone interview consisted of the recruiter providing background information on the university, position, and projected salary. I was asked to go over my resume and explain my reasoning and interest in working for the organization. I was also asked to provide examples of how my experiences fit the role. Throughout the interview, the recruiter was professional and friendly. The person asked questions that were fair and appropriate for the position .\r\n\r\nAfter the resume overview, one is directed to ask any questions they have about the position. During the interview, I asked a number of questions which helped me determine the position was actually for a salesperson and not a student counselor or advisor role. Based on the helpful information, I was able to make the accurate decision to decline an on-site interview.", "Interview Questions": "There were no difficult or unexpected questions during the interview. The interviews questions were standard."}, {"date": "24 Jul 2014", "title": "Online Content Transcriber Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jul 2014", "Interview Descriptions": "I applied online and received an email a day or two later, requesting a phone interview. The lady on the phone was very nice and asked some standard questions to see if I was a good fit. \r\n\r\nShe then offered me an in-person interview which was held two days later. I was interviewed by the director and the department manager. It was not organized well. There was no room available for the interview. After walking through the building to find a room, we went back to the lobby and conducted the interview there. \r\n\r\nBoth very friendly and nice but none of them had seriously read my resume. Basic information about myself were apparently perceived wrong so I had to clarify. It was then, when I started suspecting they actually don't think I was a good fit. The manager tried to make a case that my interest in languages exceeds the requirements for the job, that I was over-qualified somehow, I guess. That is despite the fact that I had more than four years experience in exactly that field. They said it was an entry-level position so I really did not understand questioning my motivation to apply. \r\n\r\nWe then went on to the transcription test, to \"see if you can do the job\". There was little introduction but I was asked to transcribe a short excerpt from a graphic design lesson. It was a simple task. He said I would have ten minutes, however it was more like five minutes. I know because I only transcribed about five minutes with maybe a minute to replay some passages that were hard to understand. He then asked me to revise and proofread what I wrote, this time without any time limit. I did so and then said I was ready. After that he just sent me home. \r\n\r\nA week later I got an email that they have decided to go with somebody else.", "Interview Questions": "No unexpected or difficult questions except they asked if I had any experience in copy editing which was not a prerequisite in the job description."}, {"date": "19 Jun 2014", "title": "Gallery Sales Associate Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Academy of Art University", "Interview Descriptions": "Senior manager did not show up to scheduled interview. Major let down. Many of my questions left unanswered. Without the senior staff member available to speak the interview felt incomplete. Upon requesting another chance or any opportunity to speak with her, I was ignored entirely by HR.", "Interview Questions": "I ask: Which aspect of the role is most critical to operations?\r\nResponse: It doesn't matter. It can be really dead sometimes, so what will you do with your time?"}, {"date": "16 Jun 2014", "title": "Undergraduate Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University", "Interview Descriptions": "Usually a minimum of 3 interviews, phone screen, in person HR, and in person hiring manager. It is important to demonstrate your passion for the arts and education and putting the student first.", "Interview Questions": "Role playing questions. I luckily had worked in higher education admissions previously which helped me to know what type of answer they were looking for, although it's really about engaging with the student and being able to overcome obstacles"}, {"date": "24 May 2014", "title": "Undergraduate Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University", "Interview Descriptions": "Phone screen with a recruiter who was nice, interview with HR who was personable and friendly, final interview with the two directors of admissions. Directors were boring in comparison and had a sales mentality. HR did not share similar views about the position so when the directors explained, it was a surprise.", "Interview Questions": "How would you measure success in this position? "}], [{"date": "13 Sept 2014", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Academy of Art University (San Francisco, CA) in May 2014", "Interview Descriptions": "Initial contact took place in February. Months went by without follow up. Heard back again via email and began conversations in April. Recruiters were pleasant and professional, straight forward interview with offer two weeks later.", "Interview Questions": "They really weren't trying to stump me. The position requires a set knowledge base and experience, all of which I have."}, {"date": "3 Jul 2014", "title": "Academy Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Apr 2014", "Interview Descriptions": "one phone interview, one skype interview, and one in person interview.  Took 4 weeks to complete process and they seemed like the were making it a lengthy process intentionally. It was exciting but stressful at the same time", "Interview Questions": "Had to complete 4 academic tests. Had to answer \"What do you expect out of management\" and other questions related."}, {"date": "8 Feb 2015", "title": "Undergraduate Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Apr 2014", "Interview Descriptions": "Applied online. Received an email about setting up an initial phone screening. At the end of the phone screening, was asked about coming in for an interview. Attended an in-person interview with an HR rep.", "Interview Questions": "Roleplay: You call a student who you believe may be interested in attending Art U, but on the phone they seem very uninterested and unsure. Get them interested and make them want to come to Art U."}, {"date": "14 Mar 2014", "title": "Front Desk Administrative Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Academy of Art University", "Interview Descriptions": "I received a response quickly through email after submitting my application.  I also received a follow up email with some interview questions such as \"why do you want to work here, etc.\"  After sending in my responses, a short phone interview was scheduled.", "Interview Questions": "What is your ideal manager?"}, {"date": "4 Mar 2014", "title": "Art Model Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Academy of Art University", "Interview Descriptions": "1.) Get in contact with hiring manager.\r\n2.) State your intentions the semester BEFORE you want to work and management will send an email with a set of questions to fill out.\r\n3.) Submit photos and responses to email.\r\n4.) If you pass, meet with employer for 1-on-1 interview for more information.", "Interview Questions": "Why do you want to be a model? (Are you just in it for the money or is there a special reason why you chose this position at this school?)"}, {"date": "5 Aug 2015", "title": "Academic Administrator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Academy of Art University (San Francisco, CA) in Mar 2014", "Interview Descriptions": "The HR recruiting team is a well oiled machine that gives you the illusion that AAU also works in similar fashion, however once you are employed you find out rather quickly that is not the case.  Once hired I discovered that the hoops that you have to jump through to get the job are not worth it - the multiple phone interviews, multiple in person interviews and the qualifications tests do not reflect what the actual job will be like.", "Interview Questions": "Are you smarter than the last idiot who had this job (no joke, that is what I was asked)."}, {"date": "8 Jun 2014", "title": "Office Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Academy of Art University in Mar 2014", "Interview Descriptions": "Submitted a resume and cover letter online. Two days later I received an email requesting additional information - 4 interview questions, and desired salary  & start date. I also completed a 1/2 hour phone interview, a 1/2 hour Skype interview and a test on grammer/proofreading, Excel and Word (took about 2 hours to complete). Finally called in to an in person interview with the head of the department about 3 weeks after my initial submission. The head of the department was not prepared for an interview and asked me no questions about myself or professional experience - spent the whole time complaining about the current support staff.  She asked me to come in for further interviews with her staff and said she would contact me directly and I never heard from anyone at the Academy of Art again.", "Interview Questions": "No hard questions, but it was difficult to \"sell\" myself to the hiring manager because she spent the whole time talking!"}, {"date": "6 Feb 2014", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "1) Phone interview with recruiter\r\n2) 1:1 with recruiter\r\n3) 1:3 with recruiter, hiring manager, VP\r\n4) spontaneous phone interview with VP", "Interview Questions": "How do I know that you care about the vision and goals of the advancement of art education?"}, {"date": "10 Feb 2014", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Academy of Art University", "Interview Descriptions": "The interview process for this position was very lengthy. Several phone/Skype interviews. I actually was in town and set-up a time to meet with the staff in the office. Interview was the same as phone interviews - same questions. I heard back the following week with a decline. \r\n\r\nI was very proactive and really tried to express my passion and commitment to the position, how willing I was to move, etc etc.", "Interview Questions": "Your background is in the sciences, how do you think this will affect your ability to connect with Arts students?"}, {"date": "10 Feb 2014", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "I interviewed for this position via Skype, as I did not live in the immediate area, and had to sit for three Skype interviews and one in-person interview total.  Once I arrived for my in-person interview, they were running late, and never bothered to notify me if I did indeed get the job in the time they specified.  I had to continuously email them, and was finally given my answer by their automated email service.", "Interview Questions": "What kind of candy do you like most in the world?  Ok, now sale me that piece of candy. (unexpected)"}], [{"date": "19 Feb 2015", "title": "Undergraduate Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Feb 2014", "Interview Descriptions": "Highly misleading. Recruiter grossly oversold the position and company and misrepresented both the type of work to be done and the environment in which it would be completed. They will hire almost anyone.", "Interview Questions": "Only extraordinarily basic questions were asked. None stand out, or were remarkably insightful/challenging."}, {"date": "28 Jan 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "I applied online and I was contacted by HR.It was an email asking if I was interested, then set up a phone interview. After I pass, scheduled a one-on-one with HR then met with the director of the department on the same day. A few days later, I got a phone call offering the position.", "Interview Questions": "The phone interview is pretty typical as well as the one-on-one with HR. Questions such as, where do you see yourself in 5 years? Tell me something about yourself? Scenarios questions handling difficult customer. If you're good at interviewing, you'll be fine but if you have a hard time, do research on the company and apply your abilities and past experience to the job."}, {"date": "8 Jan 2014", "title": "E-learning Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Academy of Art University", "Interview Descriptions": "The interviewer wasn't very professional and seemed more uncomfortable than I was or just didn't care to interview. Or perhaps they had already chosen someone for the position and were just going through the motions to get through my already scheduled interview.", "Interview Questions": "Hands on 'test' with very little direction or instruction. Just 'fix' the web layout isn't really a way to test someones skill. Not what I expected from a design school."}, {"date": "8 Jan 2014", "title": "Undergraduate Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University", "Interview Descriptions": "Be professional, you talk to three tiers of people: staffing, recruiting, then the director of the branch you're in. Helpful to be yourself, but a more corporate version of yourself.", "Interview Questions": "The typical \"where do you see yourself five years from now/what do you have difficulty with/why are you a good fit here\" corporate questions. "}, {"date": "2 May 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jan 2014", "Interview Descriptions": "-1 month time frame\r\n-phone interview/screening followed by a panel and additional individual meetings \r\n-background took quite some time \r\n-when discussing benefits they avoid going into specific details and often leave certain details out, like Saturday work days \r\n-training is about a month long, with exams that determine whether or not you can move forward in your position \r\n-real understanding happens when you are on the floor", "Interview Questions": "What are your strengths? "}, {"date": "7 Nov 2013", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "I had one meeting with the heads of the department and was hired.  I knew them previously, so they knew my work standard.", "Interview Questions": "N/A"}, {"date": "20 Oct 2013", "title": "Student Services Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Academy of Art University", "Interview Descriptions": "Submitted an application and received a call from an HR representative about a month later. We spoke for about 10 minutes about my relevant skills and why I was interested in the position, and then set up an interview at the site with another HR representative for the following week. I met with the HR representative for about 45 minutes, answering questions about why I wanted the job and some specific scenario questions about how I would motivate students. I was then referred to meet with the direct supervisors the same week. The interview was pretty much a repeat of the previous one, with a few more specific questions about what I expect from management and what I plan to be doing in the next 5 years. I was told later that the interview went well, my references were contacted, and then I waited with no contact for two weeks. Finally I was contacted by the HR representative to let me know that a committee decided not to hire me. I was given no reasoning as to why, after being approved by both HR and my direct supervisors, that I was rejected. The environment felt very cold and corporate, surprisingly bureaucratic for an art school.", "Interview Questions": "What kind of work environment do I like? What do I see myself doing in 5 years? "}, {"date": "11 Mar 2015", "title": "Student Services Advisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Sept 2013", "Interview Descriptions": "Skyped with the recruiter after applying online. One of the requirements was that you had to be a College graduate to work within any of the departments (this is now not the case). Went through a phone interview and then had a face-to-face with the recruiter. After a week, I had an interview with the President of the Student Services department for the final stage.", "Interview Questions": "Why would you like to work at Academy of Art University?\r\nTell us about your experience in working with non-responsive individuals?\r\nAre you a team player or leader? Explain.\r\nAre you process or detail-oriented?"}, {"date": "10 Sept 2015", "title": "Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Sept 2013", "Interview Descriptions": "Once I submitted the online application with my resume, I had a phone interview with an off-site recruiter. The off-site recruiter had me take 2 online tests consisting of administrative organizational questions such as filing numbers or explanations of how I would schedule. Afterward, the onsite recruiter interviewed about my experience asking general questions of management, filing and etc. Finally, the department director interviewed me asking me about my strengths & weaknesses as well as about my professionalism.", "Interview Questions": "How would you organize your director's project ideas and scheduling needs?"}, {"date": "28 Jan 2017", "title": "Art Model Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Academy of Art University (San Francisco, CA) in Sept 2013", "Interview Descriptions": "met model coordinator and went from there. I really just want to read the job review I was looking at. Can I please get back to that for the love of god. I've been filling out this form for 5 mins now and you assured me that it would only take a minute to \"unlock\" the review I wanted to read.", "Interview Questions": "N/A"}], [{"date": "11 Aug 2013", "title": "Writer/Editor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "I was contacted by a recruiter to set up a phone screen. The phone screen was rescheduled a few times, and was an \"hour slot\" instead of a specific time so I had to find a quiet spot and wait for the call for an hour. Recruiter was generally friendly and nice, asked some basic questions.", "Interview Questions": "Standard questions--why are you interested in the position (though they are the ones that contacted me)?"}, {"date": "25 Jul 2013", "title": "Student Services Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Academy of Art University", "Interview Descriptions": "Sent resume after seeing a job posting for the position. A recruiter called me a couple of weeks later for a phone interview. Then I was asked to come in and meet with HR and the manger of the department.", "Interview Questions": "Straight forward questions based around experience and motivations. No difficult or unexpected questions"}, {"date": "15 Jul 2013", "title": "Data Clerk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. I interviewed at Academy of Art University", "Interview Descriptions": "Attended an open house and waited for two hours to meet with a recruiter, who I spoke with for only 15 minutes. I was told to take an online typing test at home to see if I qualify for an interview.", "Interview Questions": "Data Entry Clerk"}, {"date": "31 May 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Academy of Art University (San Francisco, CA) in Jun 2013", "Interview Descriptions": "I went to one of the recruitment calls they posted on Craigslist. I had to wait a long time to meet with a recruiter. The recruiter was difficult to talk to and not very welcoming. She also didn't understand my questions, including simple ones like \"Is there a variety of duties?\" She asked me to repeat it and said “I don’t understand that question.” The interview was also very short.", "Interview Questions": "Why do you want to work here?"}, {"date": "17 Oct 2015", "title": "Student Services Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jun 2013", "Interview Descriptions": "Applied online, set up a phone interview a week later. Had an in person meeting with the director and my future manager. Heard a week later that I would start the next month. The interviews were all very short, quick questions. I remember asking around 10 questions myself and i was in and out of the office in 20 minutes.  Felt unsure if they got a feel for me and my experience, but received a voicemail a few days later congratulating me. I believe they hired me based on my experience in education and international work.", "Interview Questions": "Past experience. Why an Art University? International/visa experience? "}, {"date": "1 May 2013", "title": "International Admission Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Apr 2013", "Interview Descriptions": "First they contacted me through email to set up a small informational interview, for about 5 minutes and followed by a 30 minutes longer interview in the next week. Since I'm not in SF, it was conducted through skype. I think the HR department must be quite busy because the interviewer were late for about 15 minutes. The interview is standard, the interviewer is very nice.", "Interview Questions": "There is no unexpected Question."}, {"date": "26 May 2013", "title": "Graduate Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Apr 2013", "Interview Descriptions": "On April, 25th 2013 HR department contacted me after submitting the application online on April, 24th, and scheduled a Skype preliminary interview with a recruiter.\r\nThe interview (on April, 30th 2013) lasted about 10-12 minutes and only covered general questions about my fit with the position and the working environment I would be looking for at AAU.  The recruiter then allowed me to ask questions about the position. I asked to what extent the position was a pure sales one or in between counseling and sales.  The recruiter replied that the position was a bit of both, though it was clear that, given AAU business model, the University wants Admissions Counselors to pursue high sales and enrollments.\r\nAt the end of the interview, the recruiter mentioned that, if the first interview went well, I would sit another interview with a panel, including the admissions department head.\r\nOn May, 8th 2013, I was notified that I did not pass the preliminary interview.\r\n\r\nQuestions included:\r\n- What do you look for in the position?\r\n- Why this job?\r\n- Name three relevant skills that would bring to the position\r\n- What is your ideal work environment?\r\n- What skills and characteristics do you look for in a supervisor?", "Interview Questions": "What skills and characteristics do you look for in a supervisor?"}, {"date": "19 May 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Academy of Art University (San Francisco, CA) in Apr 2013", "Interview Descriptions": "Screening interview by phone > Online Skills Test > Formal HR Interview via Skype > AAU-wide Admin interview in person > Interview with Department Directors\r\n\r\nI Interviewed with four different Academic departments within the university. It was great to have an opportunity to find the right fit! When I interviewed with my current supervisor, I knew it was IT. The others felt awkward.", "Interview Questions": "How does your previous experience apply in an academic setting?"}, {"date": "10 Feb 2016", "title": "ESL Teacher Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Academy of Art University (San Francisco, CA) in Apr 2013", "Interview Descriptions": "Nice, short, based more on my resume, references, and degrees than on anything I said in the interview. I dressed in a professional but comfortable way, got there on time, and chatted in a friendly way with the interviewer, who was very easy to talk to. They put me on a list for emergency last-minute hiring, and three months later, they called me with one day to prep for teaching a fall semester class. I did it, and after that they kept offering me work each term except for some summer sessions. Like most of their ESL teachers, I am part-time and called temporary, though they keep hiring me back.", "Interview Questions": "\"How would you differentiate instruction in a class of several first-languages and not all exactly the same level of writing and/or speaking English?\""}, {"date": "14 Mar 2013", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Academy of Art University", "Interview Descriptions": "Initally went to the job fair - was contacted by another recruiter to go to the interview. Had several phone interviews and a panel interview. I was asked to do a lot of role playing - pretending I was calling the student.", "Interview Questions": "How would you respond to a student who is very shy over the phone? What would you say?"}], [{"date": "3 Mar 2015", "title": "Professional Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Mar 2013", "Interview Descriptions": "Standard phone screen, met with Hiring and Department Manager, background check, and then offer. \r\n\r\nThe overall process for my role was fairly quick as the Department was in dire need to fulfill the role and required someone who had more than base knowledge of the area I would support.", "Interview Questions": "What are your concerns or opinions of assisting customers in a fast-paced environment?"}, {"date": "18 Feb 2013", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Academy of Art University", "Interview Descriptions": "I had 3 interviews with this company. All fairly standard. The first was a phone interview with the recruiter and then a second in person interview with the same recruiter who was very nice and personable. The third was with someone who I was never quite clear what her role was nor did she introduced herself until I asked. I didn't get the same friendly treatment from the third interviewer. I also didn't get an offer, or a courtesy call or email letting me know. Just never another word after the 3rd interview.", "Interview Questions": "Role-play question. Ugh!"}, {"date": "8 Oct 2015", "title": "Video Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Academy of Art University (San Francisco, CA) in Feb 2013", "Interview Descriptions": "Took almost 3 months... and the HR person who was supposed to be updating me on the process had to be prodded to produce a peep.  i should have taken this as a warning of things to come.", "Interview Questions": "none that were memorable."}, {"date": "7 Apr 2013", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Feb 2013", "Interview Descriptions": "I had a quick skype interview that was basic interview questions.  They asked me if I understood the position I was applying for, which I didn't completely but they were able to explain it better and didn't hold it against me.  I had an in person interview the next week and it went fine but I could tell it wasn't great.  They asked me what type work enviornment I wanted to work with and similar questions.  Although they try to mask it as something else, the position is ultimatly a sales position.", "Interview Questions": "Role play talking to a prospective student on the phone.  How would you find out about the type of art they do?"}, {"date": "29 Jan 2013", "title": "Student Advisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Academy of Art University", "Interview Descriptions": "This is a review of the open house process.  The process was a bit unclear, and I ended up waiting longer than I would have had I registered at the front desk before filling out my application.  Interviews were five minutes, so my advice would be to be prepared with a clear, concise \"elevator speech\". Rehearse while you are waiting ; )", "Interview Questions": "Given the five minute time limit, there was no time for curve-ball questions.  Just be prepared to sell yourself in a short period of time."}, {"date": "16 Jan 2013", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Academy of Art University", "Interview Descriptions": "Very uptight feel... Really hard to connect with the two ladies who interviewed me... I left feeling like I didn't get the job. The admissions department is very uptight and ran very strict. You can be out of there in no time.", "Interview Questions": "The questions were not normal interview questions. I found them to be random and some caught me off guard. "}, {"date": "11 Jan 2013", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "Attended a job fair/mess which I signed up for after seeing their listing on craigslist.  My background and qualifications matched what they were looking for and signed up for their event.  Got email confirmation and was given the details.\r\n\r\nFrom the minute I walked in, I knew it was going to be bad.  A room full of potential candidates looking for jobs.  Should have trusted my instincts and just turned around and left.\r\n\r\nIt was VERY unorganized and it seemed they had more people signing up or just walking in from the streets to their job fair than they expected.  What was shocking is that they had only 3 people from HR doing the interviews.  Had everyone fill out applications and wait.  Did I mention wait?  But lucky us, they had a video playing and catalogs so we can read how great the \"school\" is.  Some waited well over 1.5 hrs, but luckily me, only 1.25 hrs (rolls eyes).\r\n\r\nWhen my name was finally called, I was brought to another room to talk to a recruiter.  The guy was complaining about his long day and how he hadn't had lunch yet, as we were walking to the room.  He literally glanced at my resume and asked a couple questions and rushed the 1:1 interview as he looked tired from his day of interviewing.  I wasn't even allowed to ask a question.  *Poof* the interview was done, not even 5 minutes.  My whole day wasted at the Academy of Art.\r\n\r\nFunny, I bumped into another person who attended the event on my way out of the building and we just shared the horrible experience with one another.  All you can do is just laugh.", "Interview Questions": "None.  Asked two questions.  Why do you want to work here?  What do you know about our company?"}, {"date": "17 Oct 2015", "title": "Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University in Jan 2013", "Interview Descriptions": "The process involved a phone interview, a Skype interview, a test regarding Microsoft word and excel, and a final interview. You have an hour to do the test which had about three tasks. I realized for one of my tasks, I left something in the header from the previous task and was rejected the next day.", "Interview Questions": "What interests you about Academy of Art?"}, {"date": "23 Jan 2013", "title": "Admissions Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Academy of Art University (San Francisco, CA) in Jan 2013", "Interview Descriptions": "Rude and quick, did not take the time to speak with me, took my resume left me waiting 20 minutes then came back and took me to the bar for an interview since the location was at a hotel, sports channel too loud then said thanks.", "Interview Questions": "N/A"}, {"date": "16 Aug 2012", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Academy of Art University (San Francisco, CA)", "Interview Descriptions": "The hiring process began with a referral from a friend who is employed at the Academy of Art University.  There was a further discussion with that friend to determine if the position would be a good fit for me and AAU.  Would I be challenged and stay interested in the job was important to both myself and AAU. Following that I had a brief phone interview with the president that was very pleasant.", "Interview Questions": "The interview was much more conversational than inquisitional.  They were interested in my motivations and I was interested in the growth opportunities."}], [{"date": "9 May 2016", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Academy of Art University (San Francisco, CA) in Aug 2012", "Interview Descriptions": "A week after I applied for the job, that I found on Craigslist, I received a phone call to set up a time to come in. The interview consisted of a HR rep and the hiring manager for the department that I was interested in. They asked me general questions that are obvious, but also asked how I handle situations in which someone does not speak English on a native level. Be prepared for that question is my recommendation.", "Interview Questions": "How do you handle situations in which a student does not understand or speak English as a native language?"}, {"date": "3 Oct 2012", "title": "Video Workstation Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Academy of Art University (San Francisco, CA) in Aug 2012", "Interview Descriptions": "I answered an ad of of Craigslist for an immediate hire for someone to manage all the video NLE workstations at an art school. The Job was advertised as full time, but when I got there they told me it was infact 32 hours a week part-time. I was told that I was to be helping ESL students get through their coursework cause the instructors had very limited office hours, and that the pay was $12.00 an hour.", "Interview Questions": "The interview wasn't difficult. They wan't assurance that I was a working artist and wanted examples. "}, {"date": "14 Aug 2012", "title": "Financial Aid Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jul 2012", "Interview Descriptions": "First interview was a brief phone interview during which the recruiter assesses your phone presence.  After I scheduled a follow-up interview which for most is an in-person interview, but, since I lived in LA, mine was a skype interview.  This was also brief and last 15-20 min.  Then I was promised an in-person interview (final) that was also brief.  It took about two weeks for them to check my references, but the recruiter was really great about keeping and touch and making sure I was still interested.", "Interview Questions": "Nothing too difficult--very straightforward.  "}, {"date": "10 Jul 2012", "title": "Undergraduate Admissions Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Academy of Art University (San Francisco, CA) in Jun 2012", "Interview Descriptions": "The interview process was fairly quick. First I I filled out an interest form online. Then I received a call and scheduled my interview. The interview itself was short - only 20 minutes. The interviewer asked approximately 10 questions. The position required more sales experience/skills than I had anticipated. The online job posting did not offer much detail about the position requirements other than general customer service and communication skills. However, it became clear during the interview that the position was sales-based.", "Interview Questions": "Give an example of someone who motivated you."}, {"date": "22 Jun 2012", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Academy of Art University (San Francisco, CA) in Jun 2012", "Interview Descriptions": "Applied online for a few different positions for which I am not only qualified, but over-qualified. Anyways, got an email asking if I would be interested in the Admissions Rep. position, I emailed back, basically saying thanks but no thanks..they called a week later regardless of this disinterest.. So I figure, OK, maybe I should give em' a shot, maybe it won't be so bad? Ehh....\r\n\r\nBy the way, I completely failed that phone interview. I mean, wrecked it. I was completely thrown off by the on the spot interview. It consisted of some background questions, \"Who were some of the most difficult types of students you dealt with\" blah blah. I wasn't sure if I even wanted the position, and it totally came off that way, but STILL, I was granted an interview, so of course, I accepted. :)\r\n\r\nSo I go to SF and interview with a pretty nice lady. I'll be honest, I didn't get a school vibe from this chick at all. Business all the way. Cut-throat with a smile. Yikes. Anywho, she asked me all the stuff previously mentioned, \"Why our school?\" and a lot of repetitious crap from the phone interview. A lot of questions asking how I would deal with shy or introverted students. From this question came role play..YAY. So she acts like a disinterested student, claiming she is merely \"introverted\", and asks how I would motivate this individual. I stop the role play at some point and tell her that she sounds terribly disinterested and pushing on seems a bit forced, and then it hit me, FORCED, THAT'S WHAT SHE WANTS, SHE DOESN'T WANT THIS STUDENT TO DECIDE ON THEIR OWN TIME WHEN TO START SCHOOL; EMPOWERMENT? WHY LET THEM DECIDE? PUSH PUSH PUSH. \r\n\r\nI asked during the interview what the cut-off is for calling a student when they repeatedly don't answer their phone, she dodged and sugar-coated saying, \"It's all about closure,\" Decoded for those of you who don't speak BS, this means \"Call until you get a solid no or yes, even if this takes 439390 calls, DO IT\" \r\n\r\nWhat's perhaps the worst is the exploitation of artists and their mind-set during the whole interview. She kept claiming that artists consistently need guidance and prodding in order to fulfill their goals. As if all artists get so caught up in their work they forget all about school. I know plenty of artists who went to school and loved every minute of it. If a student lacks the ambition to enroll in classes, who the hell am I to force them to do so? But students = money, and they want it, so yeah. \r\n\r\nDon't sell your soul, cats. Do good. Do right.", "Interview Questions": "Why our organization or school?"}, {"date": "7 Aug 2012", "title": "Undergraduate Admissions Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jun 2012", "Interview Descriptions": "I had previously applied for a different position with AAU, but was declined in the first stage. A couple weeks after submitting that first application, I received an email from the recruiting center about this position as Admissions Representative. I affirmed that I was interested in the admissions representative position, and a recruiting rep reached called me pretty quickly.\r\n\r\nThere was a phone screening with the recruiting rep, then a few days later an interview with a recruiter. The interview with the recruiter was straight forward, nothing out of the ordinary. I was asked to dress professionally, preferably suit and tie. After the interview, I got an email within three days of their decision.", "Interview Questions": "Unfortunately at this time I can't recall the questions that were asked."}, {"date": "9 Jul 2012", "title": "Director of Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Academy of Art University (San Francisco, CA) in Jun 2012", "Interview Descriptions": "I worked with a recruiter. The reason they gave for me not getting a callback or an inteview was because my application was not complete. Really? They are way to detail oriented for their own good.", "Interview Questions": "Describe your experience."}, {"date": "22 Jan 2014", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in May 2012", "Interview Descriptions": "-got a call within a week\r\n-short 10 minute phone interview\r\n-interview with HR\r\n-interview with COO\r\n-got a call within the next 2 days\r\n-the whole process was about 2-3 weeks\r\n-paid 3 week training", "Interview Questions": "-\"Our students are not like ordinary students. They're artists and they think different. How would you handle that?\""}, {"date": "11 Apr 2012", "title": "Undergraduate Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Mar 2012", "Interview Descriptions": "I was called by an HR recruiter within a week of submitting my application. The first phone interview was mostly informational with some general inquiries about job history, as well as more specific workplace scenario questions related to the position. At the end of this conversation, we scheduled an in-person interview. I met the same recruiter I had spoken with on the phone, and there was some repetition in the questions asked. The final round was a panel interview, again featuring a blend of questions related to the candidate's interests and expertise, and more workplace scenario questions. All in all, a very straightforward interview process, and I was impressed by the quick response time after each round.", "Interview Questions": "List your top three strengths that you will bring to this position."}, {"date": "15 Sept 2015", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Mar 2012", "Interview Descriptions": "Brief phone screening, in person interview with the recruiter then in person interview with manager and COO. Depending on schedules this may take some time. My process took almost a month.", "Interview Questions": "Where do you see yourself in five years"}], [{"date": "5 Feb 2016", "title": "Outreach Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Mar 2012", "Interview Descriptions": "Lengthy. I went through 5 interviews total. Presentation skills a must. Lots of questions about hypothetical situations. Diplomatic approach to public relations and education. This is a front-facing position so you encounter people of all walks of life.", "Interview Questions": "They ask about times you encountered difficult people or situations."}, {"date": "16 Jan 2013", "title": "Pre-Admissions Representative Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Academy of Art University in Mar 2012", "Interview Descriptions": "There are two interviews, first with an HR recruiter and then a second with the department manager/director as the deciding factor.", "Interview Questions": "\"We are going to do a couple sample role-plays. You are a representative speaking to me, a 11th grader, on the phone.\""}, {"date": "29 Mar 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at Academy of Art University (San Francisco, CA) in Mar 2012", "Interview Descriptions": "Be prepared for a typing test and a basic Microsoft Office test. Also be prepared for no negotiation for pay. What you are offered is what you will get. The process can be long as you go through a few departments, so be patient. You may not get the department that you initially interviewed for. Be prepared to accept a job in whatever department you are assigned to.", "Interview Questions": "The questions were the typical questions you would answer at any interview. I never like the what is your weakness. "}, {"date": "14 Mar 2016", "title": "Programmer/Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Academy of Art University (San Francisco, CA) in Feb 2012", "Interview Descriptions": "HR Phone interview,\r\nfollowed by one on one with manager,\r\nFollowed by technical team,\r\nbackground check and previous employment check\r\nQuestions related to position that we applied for.\r\nVery friendly people. Cleared the interview easily. An employee working at academy for more than 3 months is eligible for taking an art class per semester.", "Interview Questions": "N/A"}, {"date": "23 Apr 2013", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jan 2012", "Interview Descriptions": "Found out about the position through a third party hiring agency and had an initial phone with them. It lasted about 20 minutes. The next interview was recorded through Skype and also conducted with the hiring agency. They submitted the video responses to AAU, and then they called me in for two in person interviews in San Francisco.", "Interview Questions": "Really nothing I hadn't prepared for by researching the company and general position responsibilities! The final two women that I met with were very rude and the interview lasted 5 minutes. "}, {"date": "2 Jan 2017", "title": "Graduate Studies Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Academy of Art University (San Francisco, CA) in Jan 2012", "Interview Descriptions": "I knew someone in management and did not interview. I spoke to my contact, who recruited me, and they made the offer over the phone and I started a couple of weeks later.", "Interview Questions": "There was no interview"}, {"date": "7 May 2015", "title": "Macintosh Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Academy of Art University (San Francisco, CA) in Oct 2011", "Interview Descriptions": "I had an in-person interview. The first interview was with the lab manager. The second interview was with HR. I received a call back within a week. with an offer. The whole process was pretty straightforward.", "Interview Questions": "What is the most recent version of Mac OSX called? Name three Mac-related websites/blogs that you regularly visit? How do you allocate memory to Photoshop? List the Mac applications that you are most familiar with."}, {"date": "16 Mar 2012", "title": "Undergraduate Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Academy of Art University (San Francisco, CA) in Aug 2011", "Interview Descriptions": "I got a call for a different job than the one I had applied to.  The HR woman was nice enough during the phone interview and sent me the skills test.  After taking the skills test I was called in for an interview with HR then a group interview with the managers.  The HR interview was fine, but really long.  I got the sense of it being a corporation like I have heard.  I work at a different univeristy now and worked at another one in socal before this and this is NOT the same higher ed feel to it.  It very much feels like a business.  I was the first one interviewing with the managers who were cold, unfriendly, and to the point.  At one point they said the position was not for someone who slacks off or is a slow worker or doesn't work fast...they made me feel like that's what they thought I was.  They were pretty rude, and when I asked questions they almost look bothered that I did.  When I left they said \"well best of luck to you\" as if they had made a decision right there.  Nothing about being in touch or any friendliness at all.  A week later I got a call from HR that the managers still hadn't decided and if I would like to still be kept in the loop.  I said NO because if they hadn't decided by then, why would I want to be a second choice?  Especially after how rude my managers would be!  The job I ended up getting is much better.  I still get emails from them since my resume is still on file..NO THANK YOU!", "Interview Questions": "Challenges you have overcome?"}, {"date": "3 Sept 2011", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Academy of Art University (San Francisco, CA) in Aug 2011", "Interview Descriptions": "A recruiter called me very shortly after I submitted an application, and conducted a very brief phone interview. She was very nice and polite.  She gave me a brief description of the position, and asked me at least twice if it still seems like something I would be interested in.  She set up date for me to meet with another recruiter in person.\r\nThe 1:1 interview took about half an hour. This new person was very pleasant as well; very informative about the position, careful listener, great conversational skills; asked good questions, and answered mine very well.  She set up a second interview for me to meet with senior management. \r\nSenior management .... awful. Extremely unprofessional and rude. The interview took 20 minutes. I was interviewed by two women, one of them being COO of Admissions.  The COO did not even pretend to be paying attention: she made virtually no eye contact with me, and literally sat with her chin in her fist staring at the wall behind me most of the time. They both kept arguing with me when I said that a certain skill I use in my current job is relatable to this position.  When I asked if my understanding of this position as somewhat of sales job was correct, they said \"No!\" and started asking me which one of the recruiters gave me that impression; this was a bit uncomfortable because they asked it in a way that made me feel like I would get the poor woman in trouble by giving her name.  Then they gave me the signal that my time was up, and that someone would be in touch if I get the position. As I stood there thanking them for their time and saying my goodbyes, one of them turned to the other and said, \"ok, which one is next?\" I wasn't even to the door yet!\r\nWhat still blows my mind about that experience is, how does somebody get to be COO of any place without having even the most elementary grasp of basic etiqutte?", "Interview Questions": "How would you convince a young person who's not sure what to do with his life that the Academy is the right place for him?"}, {"date": "9 Jan 2012", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Academy of Art University (San Francisco, CA) in Jul 2011", "Interview Descriptions": "I applied to few positions online and got an email from a recruiter to schedule a phone interview. When she called me she sounded cold and immediately started by asking questions about my background, she even asked details about a job experience I had 5 years ago. I did not find the questions relevant and we did not discuss the positions she had. Few days later I received an email saying I had an appointment for a group interview, I didn't go.", "Interview Questions": "Tell me about your experience in this position?"}], [{"date": "5 Jul 2011", "title": "Admissions Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Academy of Art University (San Francisco, CA) in Jun 2011", "Interview Descriptions": "My first conversation was with an internal recruiter; a very basic, straightforward introductory interview where she asked me a couple of basic questions like, 'Why Academy of Art?' and 'Why this industry?'.  The second interview was a 1:1 face to face interview.  I appreciated that the interviewer asked questions about my background and experience relative to the position, rather than talking about irrelevant details as some interviewers are wont to do.  After spending an hour sharing my qualifications, experience and transferable skill sets, however, I was very disappointed that I would not have an opportunity to dispel any residual misconceptions or misinterpretations of my qualifications.  It is not that I did not ask for these objections, because I definitely did, but the interviewer would not share them with me.  So, I thanked her, politely left, and noticed as we walked out of her office that she gave what I describe as an unprofessional 'look' to her colleagues across the hall (this whole office was busy with interviewees) - she thought that I did not see it as I was following her out.\r\nThe next step would have been an interview with a director and a COO that was described more than once as being, 'firm but fair'.  Work culture is described as fast-paced and hands-on, and I could tell that the amount of autonomy I had held in my former positions was going to be a problem in this organization.\r\nThough the interviewer I met with was nice(to my face), the interview process was average and what I learned about the organization and the job in the process led me to believe that this was not a good fit.", "Interview Questions": "What will be the biggest challenge for you in this position?"}, {"date": "24 Nov 2015", "title": "Part Time Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Academy of Art University (San Francisco, CA) in Jun 2011", "Interview Descriptions": "Interview was informal, very relaxed. Quick and no stress. I was working full time elsewhere at the time and head of ARC department was very flexible with my limited time availability.", "Interview Questions": "Started normal, but we just ended up chatting. Interview was one on one. I don't remember how long it took. I was refferred for the job from a department director within the company so most of the questions related to software I was able to teach as well as different subjects."}, {"date": "13 Sept 2011", "title": "Early Admissions Advisor/Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Academy of Art University (San Francisco, CA) in Jun 2011", "Interview Descriptions": "I knew the rep that AAU has but I felt I had to see for myself. I initially applied for a couple positions that were posted online, that I am qualified for. Being someone that checks out their job postings, you can actually tell their is a high turnover rate within HR because the writing style of job postings even changes! Anyways, I got my first initial call from the Recruiter, who on the phone seemed really interested in me. We spoke about the different positions, and I was surprised she actually suggested she would pass along my resume to her colleagues, that hire for other departments if the position she was recruiting for wasn't to my liking. She even wanted me to consider other positions. Seems too good? Yup. My in person interview seemed totally opposite of the conversation on the phone. AAU has people lined up all day long sitting in the chairs next to you, so that person sitting there is interviewing the same one you are! It sucks that I felt the Recruiter was being a bit pretentious, I was offended actually. She asked me several times, \"Why Academy?...why here?\" It wasn't professional after awhile. During and after  my interview I know why people tell you don't even bother.", "Interview Questions": "So your job seems really exciting, why would you want to leave at this time?"}, {"date": "15 Sept 2015", "title": "Online Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jan 2011", "Interview Descriptions": "2 phones interview with HR recruiter and 1 with Help desk Manager. \r\n\r\n1 in person interview with HR and 1 with Help desk Manager. \r\n\r\nThe whole process took 3 weeks before I accepted the position.", "Interview Questions": "Typical questions. What's your weakness? What's your strength? Where do you see yourself in 5 years? How do you deal with difficult situation? "}, {"date": "18 Mar 2011", "title": "Management Job Fair Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Academy of Art University (San Francisco, CA) in Jan 2011", "Interview Descriptions": "You check in, fill out the application, and remain seated as you wait. The recruiters call you into private rooms one by one. There were 4 different recruiters mass interviewing at one time. They expecting half the people that arrived. The other half decided to drop by unannounced for an interview. There were AAU pamphlets everywhere and two television sets playing AAU videos for you to keep yourself entertained during the 3 hour wait to be interviewed. If the recruiter is interested, they will email you back and fourth to find the right fit.", "Interview Questions": "Typical interview questions. "}, {"date": "24 Oct 2011", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Academy of Art University (San Francisco, CA) in Jan 2011", "Interview Descriptions": "It was nice, and easy. Very good questions. Relaxed environment", "Interview Questions": "What was the most challenging thing you experienced in past job?"}, {"date": "26 Apr 2014", "title": "Instructotr Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Academy of Art University in Oct 2010", "Interview Descriptions": "Not in debt at all.", "Interview Questions": "There were none."}, {"date": "12 May 2010", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Academy of Art University (San Francisco, CA) in Apr 2010", "Interview Descriptions": "This was a very negative interviewing experience. Initially, it seemed like a decent job, as I have a strong background in sales and the \"Admissions Advisor\" is really a sales position. I was interviewed by two people at the same time.  They asked me about my background and I told them that I had been the Number One sales associate for my division at a Fortune Top 40 company.  The person who was leading the interview asked why I no longer worked there and I told her that I had been laid off.  She then started arguing with me, stating that it seemed unlikely that a company would lay off its top salesperson.  I explained to her that the company cut the people who made the most and the least in commission.  She still acted like she thought I was lying.  VERY unprofessional.\r\n\r\nIt gets worse.  I asked if there was any chance of advancement in the company and the same woman told me -- and I quote -- \"Well, you have to work for it.  No one's going to give you something for free.\"  I wish I were kidding here, but that's what she said.  I told her that I expected to work hard, but I wanted to know if there was at least potential for advancement.  She then proceeded to tell me her life's story.  How she got to this job right out college and worked hard and that's why she was in the position she was in.  In short, the interview turned out to be mostly about her.  It was weird, I thought they called because they wanted to hear about me and my qualifications.\r\n\r\nOh well, I'm sure that they found someone else to sell their school over the phone.  I didn't like the interview at all and I would not have worked there because the woman running the interview was in a high-ranking position and everyone seemed to report to her.\r\n\r\nI strongly recommend looking elsewhere.", "Interview Questions": "What is your background?"}, {"date": "22 Jul 2014", "title": "Information Technology Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Academy of Art University (San Francisco, CA) in Mar 2010", "Interview Descriptions": "This process was very easy, the HR group are very nice and explained the process very well, the interview was a little strange, the hiring manager was in the room with the HR person, the hiring manager didn't speak, the HR person asked the questions from a list of questions.", "Interview Questions": "N/A"}, {"date": "3 Feb 2010", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Jan 2010", "Interview Descriptions": "The HR person kept giving me answers that were my questions. When I asked what do they feel are the most important qualities for someone to have in this position he responded, \"What do YOU think we are looking for in someone we want in this position.\"", "Interview Questions": "What do imagine this position entails, how do you visualize this position?"}], [{"date": "16 Mar 2010", "title": "Student Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Academy of Art University (San Francisco, CA) in Oct 2009", "Interview Descriptions": "Phone interview was the first time they called. They gave a time for the interview. I felt at the 1:1, the interviewer was seeking to find negative aspects rather than positives. She couldn't answer if there were any scopes for promotion or describe fully what ppl in that position does day to day.", "Interview Questions": "What would your previous supervisor say are your weaknesses."}, {"date": "25 Jun 2010", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Academy of Art University (San Francisco, CA) in Sept 2009", "Interview Descriptions": "You speak with HR. You meet the team and have to explain your proficiency in the software. And you take a drug test.", "Interview Questions": "Why do you want to work here?"}, {"date": "8 Nov 2012", "title": "Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Academy of Art University (San Francisco, CA) in Aug 2009", "Interview Descriptions": "interview consisted of 2 phone interviews and 2 face to face interview with supervisor and manager. Interview process is easy if you know your basic technical troubleshooting for PC and Mac", "Interview Questions": "none"}, {"date": "8 Mar 2010", "title": "Art Model Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Academy of Art University (San Francisco, CA) in Oct 2008", "Interview Descriptions": "I was referred by someone who had modeled for the school before.  The interview itself was very quick and straightforward.  I had experience modeling, and I was offered the position on the spot.", "Interview Questions": "There were no difficult questions"}]]