[[{"date": "29 Aug 2022", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Hollywood Presbyterian Medical Center in Aug 2022", "Interview Descriptions": "quick and easy very simple questions to see how your mind will work. was asked non medical specific questions and was called the next day for a position. there was absolutely no pressure and allowed to speak freely and honestly about experiences.", "Interview Questions": "name a time where you had to act alone without the intervention of other staff members."}, {"date": "5 Apr 2022", "title": "Lactation Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hollywood Presbyterian Medical Center (Los Angeles, CA) in Mar 2022", "Interview Descriptions": "Phone screening interview first.  Very brief, with behavioral questions with examples of how you managed a stressful situation and the outcome of it. Explain relevant work experience and vaccination status.", "Interview Questions": "How did you manage a stressful situation and what was the outcome?"}, {"date": "6 Jan 2022", "title": "New Grad RN Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hollywood Presbyterian Medical Center (Los Angeles, CA) in Dec 2021", "Interview Descriptions": "Attended job fair. Interviewed by two nurses (director and charge). They took turns to ask questions about past experience with clinical. Took about 30 mins. Did not get offered the position but was offered MedSurg unit. I took the offer.", "Interview Questions": "-Tell me about yourself.\n-Name a strength & weakness\n-Why did you chose Hollywood Pres?\n-What does quality care mean to you? \n-Share an experience where you did not agree with another nurse. How did you approach the situation? \n-Share a memorable experience you had at clinical.\n-What was the most rewarding thing about nursing?\n\n\n"}, {"date": "27 Aug 2020", "title": "New Grad RN Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Hollywood Presbyterian Medical Center (Hollywood, CA) in Aug 2020", "Interview Descriptions": "The interview process is a group interview. There were 4 of us in the room, I think they limited the amount of time and the amount of people being interviewed due to Covid precautions. There is a panel of 5 charge nurses that are interviewing you all and they ask everyone the same exact questions. So tough luck if you're sitting in the first seat. I did not receive an offer so I cannot give advice on how to answer their questions. They let me know the status of the interview the very next day.", "Interview Questions": "Why did you Decide to be a nurse? \nWhat are the 3 most important things about nursing?\nWhat does quality care mean to you?\nHow can you provide the best customer service to patients and families? \nWhat do you know about Hollywood Presbyterian? \nWhy should we hire you over the other candidates?"}, {"date": "24 Apr 2019", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hollywood Presbyterian Medical Center (Los Angeles, CA) in Apr 2019", "Interview Descriptions": "There were a lot of applicants so they had either had us tell them what time we wanted to go or you were given a time. The new HR team has the ENTIRE interview process completed via group interview. They screen you through HR by having you participate in a group activity to see if you can handle speaking in public it seems. After that your group gets sent to meet with the Director and a Supervisor of the nursing department. You're all in a small room nervous as all hell and the director informs you about about what they're looking for and answers any common questions from the start. Then they'll ask you when you graduated, when you got your license, where you see yourself in 2 years, and what units you're interested in. Then, they throw out a nursing scenario and ask you questions one by one going down the row. We were told to chime in and answer the individual's question since it was a group interview. Afterwards they thank you, validate your parking and they'll let you know.", "Interview Questions": "Why did you want to become a nurse, who/what influenced you. Tell us about a time you had to solve a problem before asking anyone for help. and the two nursing scenarios they gave us were on CHF and how would you assess a apt in an ICU setting given situation A and B etc"}, {"date": "4 May 2019", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hollywood Presbyterian Medical Center in Apr 2019", "Interview Descriptions": "The entire interview process involved two parts. The first part was meeting with the recruiters and doing activities to introduce yourself . The second part involved us all going up to talk to the directors and answering questions that assessed our clinical knowledge. This part was nerve wracking because you're in a tiny room with a whole group and depending how you're answering a question, the director can cut you off and ask someone else to chime in. We were originally told we would hear back from them by 5pm the latest or the following day. They told us we would either receive a thank you email for participating or an email containing an offer for the job. Fast forward to two weeks later I still have not heard anything from anyone and I come to find out that they have called everyone who qualified for a position. Thankfully I had received an offer from a different hospital and I'm glad I did not wait to hear back from Hollywood Presbyterian. I just wish they would have kept their word about contacting us.", "Interview Questions": "What's the difference between a beta-blocker and ACE inhibitor?"}, {"date": "3 Mar 2018", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Hollywood Presbyterian Medical Center (Los Angeles, CA) in Sept 2017", "Interview Descriptions": "waited for months to be called for interview. ask me to bring all my certifications. it was basic questions, they will ask you personal questions. why you wanna work in this unit. what can you contribute to the hospital. why should they hire you.", "Interview Questions": "N/A"}, {"date": "22 Aug 2017", "title": "RN Staff Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hollywood Presbyterian Medical Center (Los Angeles, CA) in Aug 2017", "Interview Descriptions": "Panel Interview.  Everyone was very kind and pleasant except the ICU Director Fari.  She seemed to take pleasure in making me feel uncomfortable during the interview.  The others were easy to talk to and had appropriate questions.", "Interview Questions": "Why do you want to work for us?"}, {"date": "24 Mar 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Hollywood Presbyterian Medical Center (Los Angeles, CA) in Mar 2017", "Interview Descriptions": "Manager and two coordinators. They asked me how can you manage new work place job. What is your plan to prevent fall during your shift. Can you work any shift?", "Interview Questions": "How can you work as a new member?"}, {"date": "9 Sept 2015", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hollywood Presbyterian Medical Center (Los Angeles, CA) in Jul 2015", "Interview Descriptions": "I applied online for the New Grad RN program at Hollywood Presbbyterian and received an email within a few days inviting me to interview in person. I was also asked to rank my choice of units from 1-3. The interview was set up in stations with each unit having at least two people interview each candidate. Unfortunately they scheduled my interview right before many of the interviewers needed to leave for a meeting, so I was unable to interview with all units as promised. One of the managers also answered a phone call during my interview, which I thought was rude.", "Interview Questions": "Tell me about yourself. Why do you want to work in this unit? Why did you decide to become a nurse? Tell me about a time when you had to make a decision you knew others would be unhappy with. "}], [{"date": "29 Mar 2015", "title": "ICU RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Hollywood Presbyterian Medical Center", "Interview Descriptions": "Skype interview consisted of charge nurse, manager and recruiter. Recruitor called first and then ask all experience related questions,and then panel interview was set over the Skype due to the geographical distance. And on the same day of the interview I got the offer", "Interview Questions": "N/A"}, {"date": "7 Apr 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Hollywood Presbyterian Medical Center (Los Angeles, CA) in Feb 2015", "Interview Descriptions": "After applying online, I received a phone call from th HR department wanting to schedule me for a phone interview. After my first initial phone i terview, I was informed that I will be scheduled another phone interview within the next four days. I then did another phone panel interview. Following that, I did another phone interview and was offered the position. Three phone interviews and an on site interview, I was offered the job.", "Interview Questions": "Long term goals"}, {"date": "2 May 2014", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hollywood Presbyterian Medical Center (Los Angeles, CA) in Apr 2014", "Interview Descriptions": "After 1-2 weeks of submitting online application, i got an interview notice by phone and mail. Made an appointment for the following week for the interview", "Interview Questions": "scenario questions (for example: interpret a prescription, prioritize work, conflict with coworkers, etc.)"}]]