[[{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Lots of pros and cons", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Jan 2023", "job_title": "Specialist", "duration": "N/A", "pros": "Incredible coworkers, small staff so it's easy to get to know everyone and make friends. Everyone has the same values which feels unifying. They are making an effort to gain small donors rather than relying on just a few big ones. They are also genuinely making an effort with (existing, not new) staff in terms of salaries. Pay is adjusted for inflation yearly which is a huge help. The CEO has great vision.", "cons": "Unrealistic expectations for what they're willing to pay and staff for, both in terms of salary and contractors. Top-down culture of micromanagement. The work is very bogged down with processes, even the smallest decisions require \"proposals\" and need to be put through multiple analyses (SWOT, etc). Large donors are out of touch with reality and influence the work in ways that are not helpful. Most roles don't have growth opportunities and they like to hire outside rather than promote from within. Overall the workflow is inefficient, which also made it ineffective. This made it really hard to continue there as someone who cares deeply about the mission."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 May 2023", "job_title": "Business Development in Los Angeles, CA", "duration": "N/A", "pros": "If you love animals, you'd love Mercy for Animals -- everyone is totally committed to helping our fellow creatures all over the world. It's wonderful to work with like-minded people.", "cons": "There was, for a long time, a lot of shake-ups and a lot of unpleasant people. Luckily, most of them are now gone,"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The benefits and salary increases in 2023 are incredible!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Jan 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The co-workers are for sure the biggest pro.", "cons": "Still too much on each staffer's plate."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Extra support", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Sept 2022", "job_title": "Business Development in Los Angeles, CA", "duration": "N/A", "pros": "Wonderful people to work with, for a great cause! Medical benefits, they are willing to work with a salary request, on board quickly.", "cons": "Understaffed, too many employees taking on too many responsibilities."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Home.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Jul 2022", "job_title": "Specialist", "duration": "N/A", "pros": "This is, without a doubt, the best job I’ve ever had. Leadership is smart, kind, realistic, and supportive. Pay is good, benefits are good, expectations of employees are appropriate/reasonable, and the people here care about each other and the mission. I feel at home.", "cons": "I’m sure pay could be higher somewhere that’s not a non profit, but it’s better than I was expecting when I started."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Left feeling burnt out and burned by this organization", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Sept 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Well established remote working culture\nWill work with some of the most compassionate and intelligent people\nBenefits", "cons": "- Lack of support/direction/vision from senior leadership\n- White/US centric strategic thinking for a \"global\" organization\n- Gender equity issues - men are promoted, women are hired externally into leadership positions\n- Values are not demonstrated in the strategy or day-to-day work\n- Unaligned org-wide theory of change\n- Began hiring people that consumed animal products at a vegan organization \n- Lack of transparency \n- Performative anti-racism work, threatened internal changemakers \n- Retaliation\n- Overworking and doing three jobs beyond your job description is praised, but could also go unrecognized if you challenge leadership \n- One SVP has all of the hiring/firing/promotion authority, managers do not have autonomy to decide what happens to their team as far as career achievement \n- Mental health is not taken seriously, performative \"self-care\" is touted as the solution to being overworked and underpaid \n- Overall, it has felt like change was not being made for animals because of the toxic culture and red tape bureaucracy maintained by senior leadership"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A high-integrity, compassionate, thoughtful organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Nov 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Sense of inclusion and belonging\n\nAble to show up as a human being with a full life outside of work rather than being seen as simply an employee valued for productivity and performance (although MFA also highly values performance and impact, as well)\n\nStrong focus on systems change, DEI strategy & intersectionality with animal protection movement, and accountability", "cons": "There are a lot of systems to learn up front since it is a remote work environment\n\nPeople here are committed to this work and extremely invested -- can be tiring when you care so deeply\n\nThe employee experience is heavily dependent on the individual relationship with the manager and team since casual interactions are fewer in a remote workplace -- this can be a pro or con, depending on whether the relationship is a good fit"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Best non-profit I've worked for", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Oct 2021", "job_title": "Director in Durham, NC", "duration": "N/A", "pros": "Great work culture, \r\nImpact driven, \r\nEmpathetic coworkers, \r\nStrong organizational support, \r\nFANTASTIC support/success teams, \r\nPermanent remote work, \r\nStrong JEDI commitment, \r\nInnovative approaches to achieving the mission,\r\nAwareness of opportunities to improve.", "cons": "I have nothing negative to say about MFA. In the words of my uncle, \"I wake up every morning like a spring chicken ready for the day.\""}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "An organization that doesn't embody its values.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Aug 2021", "job_title": "Entry Level", "duration": "N/A", "pros": "Compensation is decent, especially under remote structure. But at the end of the day, this doesn't balance out the core problems of the organization.", "cons": "As an employee, it baffled me how much MFA internally contradicts the values that they have chosen to be their organizational pillars. I’ll go into each one.\n\nCompassion: I don’t know how they could argue that they live by this given how dismissive they have been to so many people who’ve made them aware of the emotional toll caused by working there. They claim to have an open door policy and be against retaliation, but I never witnessed raising concerns there to be taken well. Leadership reactions have ranged from labeling those who’d speak up as toxic, to actually firing people with no warning after they complained about documented problematic behavior from their supervisors.\n\nImpact: The value they embody least, in my opinion. From international regions going a year or more at a time without a Managing Director to funds being spent in petty ways like sending staffers in high ranking positions on unnecessary trips, or paying large sums to keep people from taking action after they’ve fired them with no justification. From a donor’s perspective, I don’t think MFA is at all a good organization to support.\n\nIntegrity: One of the more troubling and unethical things I witnessed there was Leadership publicly encouraging all staff to write good reviews on Glassdoor to balance out how many negative ones there were at the time. Also, they claim they give credit when it’s due, but for as long as I worked there, I noticed a deeply ingrained pattern of excluding qualified employees from being promoted. Instead, directive positions would go out to external applicants with a hustle mentality, who soon proved to have no insight into the organization’s mission and only deteriorated what little progress was previously achieved.\n\nGlobal mindedness: I always perceived a colonialist-minded approach to org-wide work. International regions have never been autonomous, and I think it’s very problematic how they tokenize the couple of staffers from the global majority in their public facing videos and yearly reports.\n\nInnovation: Is the one value I’d say they arguably carry out to some extent, but as I said with global mindedness, they’re determined to push a US-centric approach to all regions, regardless of whether it’s culturally relevant or not.\n\nCollaboration: They pride themselves in approaching entities with different stands and values, but they systematically go out of their way not to do that within the organization. If you hold views that are at all different from Leadership, you’re shut out. Historically, you only move up the ladder if you show nothing but praise, as constructive criticism and promotions are simply incompatible at MFA.\n\nIt’s sad how much potential the organization has had throughout the years and how consistently they wear out people who could have been instrumental to significant change for animals.\nIn the end, I became one of the many who left the organization burned out and disappointed from not having been allowed to make a significant impact for animals killed for food."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 Nov 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- excellent and ethical executive leadership\n- loving and kind coworkers\n- incredible mission\n- understanding of work life balance and social justice importance to our work", "cons": "It's a nonprofit so there will never be enough staff to do all the things that need to be done."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Inclusive, Dedicated, Intentional Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Mar 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Since joining Mercy For Animals, I have been impressed with the welcoming, inclusive culture. Team members are talented, dedicated to making the world a better place, and simply kind - to each other, to themselves, and to animals. Overall, the work feels innovative and high-impact. I feel supported in career development. Further, the benefits for employees are pretty good for a non-profit. I am so proud to work at Mercy For Animals!", "cons": "While a remote work environment is very much a pro, it also has the downside of not being able to see co-workers in person often. My co-workers are fantastic and I hope to meet them in-person some day!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Mercy For Animals led me to burnout and then fired me for \"not being happy at the workplace\"", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "3 Aug 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Decent salary for a person located in MX.\nBenefits include sick-days, and 15 days of paid time off. \nWork is remote and five days a week.", "cons": "This review expresses my opinion of what I experienced and saw during my time at this job.\n\nWhen I joined this organization, I thought a dream just came true, however, the very first meeting that was supossed to be my welcome to the team, turned into a very serious session where upset employees expressed concerns about mass resignations happening at that time and general insatisfaction with how things were handled by leadership. Little did I know, this would set the tone for my remaining three years at Mercy For Animals.\n\nAt first, I was okay with constantly being understaffed and expected to always do things outside job description. However, as time went by, I realized and it is my opinion that this wasn't due to not having enough resources to fix things in my region (Mexico), it was a matter of constantly being an afterthought for the leadership team. It is my opinon that we had no real support from them, we were left to our own devices to come up with strategies for our region but without any real autonomy or proper budget to execute them. \n\nIf you don't care about the actual cause Mercy For Animals stands by, it might be a decent place to work at, based solely on salary and benefits, however, I had never experienced this amount of neglect and mistreatment from an employer. That's probably why there's a constant and considerable amount of staff rotation, which caused many key strategic roles to be empty in my region for the majority of my three years there. This rendered us stagnant and unable to do almost anything of actual value for the animals.\n\nLast year, things turned out to be even worse when my former team was introduced to the new manager, from the very beginning things were very rough. We were verbally told by her that we were expected to work late if she needed to, that we should stop complaining so much about culture and focus on working instead, she said that the things that we were doing weren't impactful or good enough based on just feelings or first impressions, she created a very hostile and unsafe environment for me and my colleagues, and she wouldn't take feedback possitively as retaliation was not uncommon.\n\nIt is my opinion and experience that concerns raised to HR and supervisors are always \"heard\" but at the same time, always disregarded. I never felt like real action was taken when raising concerns or giving feedback.\n\nIt is my opinion that the reason my former direct supervisor would get away with destroying team-morale, not following communication guidelines, forcing staff to share misleading, inflammatory posts on social media, embellishing metrics to make her look better and making classist and xenophobic remarks, is because for more than a year, we didn't have a Managing Director, and like expressed previously, I believe that leadership never really turned an eye to our region, and even if they did, I also believe that none of them really know Spanish good enough like to understand what's really going on.\n\nOne of my collegues would constantly be treated pretty badly by our former manager, and when we decided to speak to HR about this issue (yet again), a couple days later the both of us got fired. \n\nThey told me that the reason they were letting me go was that \"they could tell I wasn't happy working there anymore and that nobody likes working with someone who isn't happy\" I politely asked if this decision had anything to do with the situation going on with my manager at the time and if there were any other reasons for letting me go, since I never got a warning or any complaints, they told me that \"me not being happy at the workplace was more than enough to terminate my contract. \"\n\nBefore the virtual call ended I was already locked out from slack and my email. \n\nI was very upset by how things ended, I invested three years of my life working hard, giving my best ideas, while also trying to improve things at the organization, and at the end they didn't even gave me the chance to say goodbye, but what bothers me the most from this particular situation is that two key positions were yet again left empty, for no real reason, and they also had to pay a really big amount of money as indemnization for injustified firing according to Mexican law. I do not understand why they'd do that and \"waste\" money meant for the animals firing people like that, rather than actually make efforts to improve working conditions so people stop feeling unsafe, unhappy and burned out. \n\nAs of August 3rd of 2021, my former boss is still working at Mercy For Animals.\n\nI hope this message reaches someone thinking about working there and that you really consider other options until Mercy For Animals seriously works on these issues, this is particularly the case if you'll be working in a region that is not the United States. \n\nAs a final note, I remember a time where morale improved only for the US staff after they had their yearly national retreat, (pre-pandemic), after the fact, I saw HR asking through slack to leave positive reviews for MFA at Glassdoor. I believe they did this since they were flooded with negative reviews from the 30+ employees that resignated in a time span of less than year. I felt this is important to point out since I found that practice to be unethical and unprofessional.\n\nThank you for your time reading my review."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "workplace harassment, retaliation,", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Sept 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Remote work\nPassionate coworkers\nOpportunity to help animals", "cons": "Supervisors without any ethical values or experience\nLack of core values\nMicromanagement"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Outstanding mission and culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Oct 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "good culture and mission, welcoming team, remote, good benefits.", "cons": "average pay, some turnover, starting pay on the low end."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "MFA is my happy place", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Oct 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "This is the best place to work in the animal rights movement and probably very good overall for the whole nonprofit sector. Everyone here has such a commitment and passion for the cause and everyone is so smart and good at their jobs. The world is falling apart around us and if feels so good to be doing meaningful work and interacting with wonderful people on a daily basis.\r\n\r\nIt is so inspiring to work at a place that really cares about employees. They just gave us the day off for the election so we can make sure our votes count.", "cons": "Zoom fatigue is real but that is happening everywhere during covid."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "the new MFA is here to stay", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "When MFA's founder stepped down as president and new leadership came in, a lot of change happened: new mission statement, new structure, new focus. I believe 100% in all of the changes that have been made, and in fact I never would have sought out employment at MFA before the changes were made. The mission statement now includes human health and the environment (instead of just \"become vegan for farmed animals) and the vision celebrates incremental, positive change to reduce suffering rather than just absolutist dogma. The new senior leadership team is a bunch of hustlers who work hard and aren't afraid to roll up their sleeves and get the job done. Levels of professionalism have also come to the organization like operations SOPs and an employee match 401k, all of which didn't exist before.\r\n\r\nHas there been turnover at MFA in recent years? Yes, of course, that's a part of the change. But reading these negative reviews it's clear to me that the people who posted them were the \"old MFA-ers\" who couldn't deal with the positive changes taking place. So, honestly, it's good that they got out of the way. MFA is like a start up right now: you either work hard and dedicate yourself to what the organization is doing, or you're in the wrong place.", "cons": "The farmed animal movement is not super well funded (although hopefully that is changing!) so this is not a place to work if you want to make a lot of money. Although, I believe the salaries are fair and comparable to other places in the movement."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Make the world a better place", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Apr 2021", "job_title": "Researcher in Hong Kong", "duration": "N/A", "pros": "Helps animals. Good culture. Sense of fulfillment.", "cons": "Lower pay than average. Sometimes frustrating when receiving negative reactions from the public."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "MFA has gone through a lot of change, but the future is bright!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Mar 2019", "job_title": "Campaign Manager", "duration": "N/A", "pros": "I left Mercy For Animals in recent months, due to being offered another position better suited to my goals. Looking at the recent reviews of MFA on Glassdoor, I think they are very unreflective of an organization that is going through an incredibly productive transformation. The organization, in my two years, has professionalized significantly, which is only a positive thing - it means there is more support for staff, more opportunity for upward feedback, and better handling of complicated employment situations.\r\n\r\nThe new senior management team is far more capable than any the organization had in my two years there, and are going through the implementation of a new strategic plan that seems much more likely to create a lot of change. Of course, change is not received evenly, and that might mean some roles won't be what people expect. But, the organization grew very quickly, and with that has to occasionally come big transitions. Regardless, I am so excited for the future of this organization, and can't wait to see them do so much more for animals.\r\n\r\nOther pros\r\n-Some of the most capable teammates I've ever worked with. \r\n-Working remotely is usually great!\r\n-Lots of passionate folks working there\r\n-Best health insurance I've ever had", "cons": "-I would have slightly preferred having the ability to work in an office at least some of the time."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "What a nightmare. So glad I’m gone.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "7 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Ability to work remotely or from home if local.", "cons": "I’ve seen this organization permit and propagate bullying, racism, employee targeting, and gaslighting; truly shocking from a place that calls itself a social justice organization. Additionally, as others have mentioned, in a year where funding plummeted due to scandal and a subsequent major deterioration of the org’s reputation, senior leadership laid off entry-level staffers making humble salaries while promoting themselves and giving themselves raises. It’s beyond the pale. In other nonprofits, leaders making the most have been known to take pay cuts in lean years to ensure no one loses their jobs. MFA does the opposite. To make matters worse, in their 2019 restructure (the second major one in under a year) they demoted longtime staffers for no reason other than it didn’t fit their “business model.” This created a level demoralization and confusion I’ve never encountered before in my professional life.\r\n\r\nThe inept and tone deaf senior leadership team keep saying everyone is happy and things are great according to their surveys. I don’t believe it. I’ve heard from many people still employed at the organization who are completely beat down and scared to death of losing their jobs, especially in the wake of the lay-offs. What’s more, seven staffers have quit in just the last two weeks. I’ve never seen a leadership team be so out of touch, act with such negligence, and treat its staff so poorly. It’s devastating and totally beneath the animal rights movement."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Making A Difference", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "As someone who has chosen to dedicate my life to doing as much good as I can for animals, it's a true honor to work with one of the most effective groups out there that is so driven on achieving it's mission: reducing suffering for farmed animals. \r\n\r\nWith the program I oversee, I'm given (1) very clear direction and goals, (2) a ton of independence to achieve these goals, and (3) support/help whenever I need it. In my opinion, this is the perfect combination for an individual, department, and organization to succeed.\r\n\r\nThe staff are all very friendly, supportive, and a joy to work with. My supervisor is focused not only on having our programs succeed, but in developing my skills as an activist - helping me to learn and grow along the way. MFA works very hard and very strategically, which I appreciate.", "cons": "Honestly, nothing. Channels exist for employees to voice feedback at any point which I feel comfortable doing."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Senior Leadership Censors Staffers", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Can work remotely. Good benefits.", "cons": "For an organization that prides itself with whistleblowers, this organization censors staff who are vocal against racism, sexism, and employee injustices.\r\n\r\nThe entire staff is scared to speak up. Leadership does not seem to be interested in critical feedback. \r\n\r\nIn a year when there are layoffs, people in Senior Leadership have promoted 10 people in the organization and demoted 4 (in titles only) while giving themselves raises (including staff who have been here for 2 months that have jumped from directors to Senior VPs). \r\n\r\nStaffers have been demoralized and gaslit by senior leadership pretending like everything is fine in the organization when only 50% of the staff feels job security. The HR department continues to spew a toxic culture, including gaslighting individuals on Town Halls and pitting staffers against each other who have opposing views. The Senior Leadership staff also have censored staffers–shocking for an organization who prides themselves on whistleblowers.\r\n\r\nThe president, CEO, and board members of the organization have no idea what is happening under VP levels and nobody in leadership even knows what staffers do. They have laid off staffers who ran an entire marketing department (who does that?) and have laid off 2 development staffers. In what world would an organization lay off development staff when we are \"down in funding?\" \r\n\r\nNow 7 people have quit in the span of a month and Senior Leadership doesn't even see it as an emergency of highest priority."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Awesome coworkers, great mission, big ideas", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 Jan 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "In the last year Mercy For Animals has changed presidents and a lot of senior staff, and in the process has become much more organized, professional, and focused. This transition was difficult at times, but I am more excited working here than ever. We have a bold and clear strategic plan to guide our work for animals for the next few years, I work with 100+ friendly animal advocates, the pay/benefits are competitive for this field (I've worked at similar nonprofits), and every week I get to work on challenging and impactful projects.", "cons": "I work remotely, which I prefer, but sometimes it is a con because I wish I could see my coworkers on a regular basis. \r\n\r\nSome of the decisions made by former leadership are still affecting the organization, and the change the organization went through over the last year was difficult at times. But as mentioned above, we are now on the right path, becoming more organized and professional."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Changing hearts while growing my mind.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Sept 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great work environment. Extremely dedicated co-workers. Innovative thinking. Lot's of learning opportunities. What more could anyone what for a career helping save farmed animals. MFA continually looks forward and executes what will create the most reduction in suffering for farmed animals. Co-workers are passionate, dedicated, smart, and best of all, funny!  We deal with heavy subject matter on a weekly basis but always find a way to have a good laugh. \r\n\r\nWe move mountains for farmed animals each week.", "cons": "The fast pace is not for everyone and at times seems like organized chaos. If you are someone who needs a roadmap to complete your job, this isn't the place for you. If you are not comfortable in continuos change, look elsewhere. \r\n\r\nBenefits and salary are not able to stack up to the for-profit world, but the emotional investment to the work is 10 times more worth it."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Disingenuous senior leaders and poor decision making lead to deep-rooted culture issues", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Ability to work remote. Decent benefits. Non-senior level employees are all amazing, hardworking, and talented activists.", "cons": "A constant barrage of issues ranging from (but not limited to): harboring known senior-level abusers, poorly handled racism claims, disorganization and lack of clarity from the top down, major changes within the senior leadership roles, restructures, financial mismanagement, and lay-offs or demotions of several high-performing and dedicated activists. Throughout everything I had witnessed at MFA, once staff would begin to recover from one difficult blow, another would surface, which lead to a constant cycle of confusion, unease, distrust, and fear. Because of this, many staffers continue to live in fear that they'll be ousted next, so they avoid speaking up and challenging the decisions of the senior leadership team. There is a distinct facade of happiness and contentedness throughout the org which masks the real underlying problems.\r\n\r\nOverall, I would never recommend working at MFA to any of my friends in the animal rights movement. There are so many other orgs with legitimate integrity and compassion for animals AND people."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Sinking Ship", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Most employees are given the option to work remotely and receive a decent amount of PTO. \r\nKind and supportive coworkers at the low end of the totem pole.", "cons": "High turnover. The atmosphere is very negative and uncomfortable due to the most recent recent set of layoffs. Employees are afraid that they will be let go without any notice.  In addition to mass layoffs, eight employees have left the org in the last few weeks. There is little to no communication from senior leadership as to what huge cultural and organizational change will happen next and this causes staff to live in fear of what huge shake-up is coming.  It honestly feels like a sinking ship.\r\n\r\nDue to misuse of donor funding we were not given raises this year. This also forced the organization cut out many of it's usual perks like staff/departmental retreats.\r\n\r\nVery few investigations have been released during the past two years and it's impossible to see how our work actually helps animals. We work tirelessly towards raising money for the organization but fail to see any steps taken that aid animals."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Effective, ambitious and growth-minded!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Mar 2020", "job_title": "Director in Ciudad de Mexico", "duration": "N/A", "pros": "- Organization thinking on impact\r\n- Continuosly doing surveys and interviews to the staff to continue improving their work not only on benefit of the animals, but also to give a better environment to the staff.\r\n- Great benefits, I love the professional and self-care budget, the winter holidays and the appretiation day.\r\n- Passionate staff\r\n- Loads of cultural/skills/experience diversity in the new leadership team, this helps to evaluate initiatives from different perspectives.\r\n- Work/Life balance, I used to work on weekends and long hours in almost all my jobs, but this is not accepted at MFA, they really care about you.", "cons": "- MFA has gone through changes and  this slowed down some initiatives, but MFA wisely recovered from it, and now is very focused and thinking in new strategies."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Best Job I've Ever Had!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Jan 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Opportunities to telecommute/flexible schedules\r\nWork/Life Balance\r\nProfessional development - MFA reimbursed me for professional certification\r\nCulture of kindness, collaboration, and innovation - this is seriously the best and most talented group of people I've ever worked with\r\nCool all staff events like week-long staff retreats and meditation retreats!\r\nThe opportunity to really make a difference!", "cons": "Compensation is fairly competitive for a mid-sized nonprofit, but could be stronger - I know people operations is working on that.\r\nRapid growth and organizational leadership change created some hiccups in 2018, but our new president and senior leadership team are all so talented and compassionate - we achieved so many great things last year, I can only imagine how awesome our successes for farmed animals will be this year!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Better than ever. An awesome place to work.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Jun 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I’ve been at Mercy For Animals for over four years and have seen it go through enormous transition. I can confidently say it’s in better shape now than it has ever been, and the organization is doing enormous good for animals.\r\n\r\nMFA went through a lot of change, but it’s now a much stronger, more professional, more stable, and far more collaborative organization than ever before. For the first time, our “core values” actually mean something, as our new president lives and breathes them in everything she does.\r\n\r\nEarly last year I was looking for a way out, but I’m so happy that I stuck around through MFA’s changes and have seen us become a really phenomenal organization to work for. Generous time off, flexible work hours, commitment to inclusivity, option to work remotely for most staff, really strong anti-harassment policies, an honest and visionary leader… all make MFA a dream job. I think the best part is the people: MFA staff are brilliant, fun, kind, friendly, and SO passionate about the work they do. They genuinely care about the mission and each other - and it shows. True to their activist nature, they speak up and bring solutions forward when they see things that could be improved. As someone not in a leadership or managerial position, I feel comfortable voicing my opinion and know my input will be heard.\r\n\r\nMany of the previous negative reviews were left by people sadly driven by ego and wedded to MFA’s old, ineffective ways of working that we’ve now left behind. Their departure was a necessary and positive part of the organization’s growth.\r\n\r\nSummary: anyone who wants to make the world a better place would be lucky to work here!", "cons": "The legacy of MFA’s previous leadership left some wounds, some of which are still healing. There are still some policies and procedures that could be improved and processes that could be streamlined and updated - but progress is happening on all these fronts. Like most organizations large and small, MFA has work to do to improve diversity, equity, and inclusion. MFA is now a mostly remote culture but is still learning how to embrace that."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing coworkers, leadership, and organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "This is without a doubt the best job I've ever had. I am able to work from home in a location of my choosing. I have low-cost healthcare and lots of time off. The organization's commitment to and demonstrated support of professional development and self-care has allowed me to do lots of things that I otherwise would not be able to do for my development. My team is amazing! I get to see my coworkers every day, virtually from our remote locations; we've developed strong relationships and I consider them friends. My team leader is without a doubt the best boss I have ever had. She is a mentor who I learn so much from and she is really supportive of my professional development. Beyond my own team, I admire and respect everyone who works at MFA; we really do have such an amazing team of intelligent, dedicated, welcoming, kind, talented, creative people here at our organization. Our senior leadership team is hardworking and kind. These are really accomplished individuals, some long-time animal rights activists and others who came to MFA from the very tops of their fields in the corporate world, working hard every day to steer our organization toward making the biggest impact for farmed animals. I feel very fortunate to have them at the helm of our organization.", "cons": "I knew going into nonprofit work that my salary would be lower than it was in the corporate world. Although lower, my salary is fair and I consider it good. The affordable healthcare, ample time off, and ability to work from home really make up for the difference. I may have had more money before, but I have a much better quality of life now, plus the peace of mind and motivation that comes from knowing that I am working every day to help farmed animals."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Very good place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Mar 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Very positive environment (feels sort of like a tech startup, in the good ways), minimal drama, people get along very well, a lot of opportunity for creative freedom, career growth, taking initiative, and so on. Also a lot of FUN! Very effectiveness-minded organization as well, which is somewhat rare for a non-profit. Good benefits package including full health care at no cost, salaries competitive for industry. A lot of respect for employees, etc.", "cons": "many positions are based in LA, which isn't great if you don't like LA, but there are also a number of remote positions."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "MFA Employee", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Mar 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "A very progressive non-profit, where you feel part of a team in both the department and as a whole. The growth from year to year has been incredible. It's been very fast, but not too fast. Proud to work for one of the most effective animal protection groups out there.", "cons": "Jobs are not 40 hour a week positions and everyone is expected to work hard and put in extra time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Mar 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Remote and flexible schedules, working toward a mission I care about, having amazing team members across the organization. People are strategic and we all want to create a kinder world. Good healthcare, great paid time off, great parental leave - very progressive policies.", "cons": "I wish I got to see my amazing team members in person more, because they are all amazing and so fun and inspiring to be around. That being said, I love working remotely and I'm glad MFA allows us to be remote. But it would be fun to all hang out more in person!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Culture, Great Learning Experience", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Had a great time as an intern at MFA. Very supportive and welcoming to new activists and old activists alike. Provided lots of fun to get out there and do work on the street, from leafleting, to festivals, to visiting universities for PPV. They keep you engaged in a variety of projects and activities to learn all the different sides, and to make sure that you are engaged and involved in the process.", "cons": "There weren't really many downsides. Pretty flexible in terms of coming in, etc, got to work with fun people and meet tons of people. Even after my internship was over, I was still a part of the community, which was awesome."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great mission and team", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Jun 2020", "job_title": "Anonymous Employee in São Paulo, São Paulo", "duration": "N/A", "pros": "Mercy For Animals has been growing stronger than ever. Since our current President steeped in she clearly focused on building a team of superstars, improving culture, diversity, and inclusion, and with an amazing strategic mindset providing clear and meaningful direction for the organization. The current leadership embraces kindness and transparency. And team members are positive and all amazing to work with. I feel extremely proud to work for an organization that is driven to cause an impact on ending the greatest cause of suffering on the planet, and at the same time does everything that is possible to provide a healthy workplace and value the team members.", "cons": "I have none to offer at this time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Love the work, people, and cause!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Mar 2016", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "MFA's team oriented, efficient and effective! Management promotes a healthy balance of work and personal life which is practically unheard of at a non-profit. Get to save animals in a fun and friendly environment and has great benefits. Value the staff and compensate accordingly.", "cons": "Current organizational growth spurt is creating some growing pains. Leadership's in process of creating more clear cut delegation guidelines, so all should be remedied quickly and with little affect on staff."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Dream job", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Apr 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Mercy For Animals has created an environment where pretty much everybody cares about each other in the team.  Teams overseas are very integrated as I haven't seen in other similar organizations. \r\nMFA has a great strategic plan and vision, and there seems to be a lot of alignment across the board regarding everybody's responsibilities to achieve our goals together. \r\nAfter a period of turbulence, MFA has proven to be able to navigate through difficult moments and come out from it even stronger.", "cons": "Despite the regular difficulties that we face in any organization, I loved working at MFA and feel extremely supported to do my work at my best."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "More Than a Job", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Sept 2018", "job_title": "Communications Manager", "duration": "N/A", "pros": "- Every day you get to do work that really means something and helps animals. At MFA, you’ll get to collaborate with some of the most creative, compassionate, like-minded people around the world. \r\n\r\n- There is a strong focus on improvement, and we still operate in many ways like a start-up. We are always assessing what we can do better, experimenting with new ideas, and evaluating how we can help more animals. \r\n\r\n- Everyone's voice is heard. We have multiple ways to share ideas: a \"reddit-like\" suggestion website, quarterly surveys, one-on-one checkins with managers, an anonymous suggestion line, and honestly, I could Slack or call anyone at the org at any time with an idea and be heard. \r\n\r\n- There is a strong orgwide emphasis on self-care. At past retreats, we have had self-care workshops and optional meditation sessions. Our \"sick\" days can be used for mental health and personal wellness. It's encouraged that staff use their vacation time and truly unplug during that time. Flexible hours also really helps with work-life balance and allows us to work when we are most productive.  \r\n\r\n- You will feel appreciated, like really appreciated. There's a super thoughtful shout-out channel in Slack. I receive and send individual gratitude messages to colleagues all the time. \r\n\r\n- I'm very happy with the compensation. My salary is far higher than any other nonprofit job I have held or been offered, and I think it's competitive with similar comms roles at for-profit companies. MFA also does annual equity analysis of pay across the organization. \r\n\r\n- There is a lot of autonomy within roles at MFA, which I think is cool. I have a lot of flexibility to try new things and really carve out my own role within the org.", "cons": "- You will see videos or photos of animal abuse. There is no way around it. Some teams, like investigations, have to view the footage more than others. It can be very difficult—and heartbreaking. In a way, this kind of brings everyone on staff closer. Many of our family/friends still eat animals but at MFA we all share in the belief that animals deserve love and respect. \r\n\r\n- Working from home isn't for everyone. I love it, and MFA has a really cool virtual culture (I chat with colleagues all day in Slack!), but you definitely have to be disciplined enough to do your work!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great mission, strong team and leadership", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Mar 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Mercy For Animals is working to end factory farming, one of the world's most critical issues. Whether you care most about animal welfare, climate change, or worker or food safety, MFA's mission is super-impactful and makes sense for so many reasons. The new president and leadership team at MFA are strategic, nimble, kind-hearted and hard-working, and give us confidence in the future.", "cons": "No human organization is perfect, but Mercy For Animals is a great place to work and the team learns from mistakes and missteps--we are getting better all the time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excited for the future at MFA", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Inspiring mission, dynamic new leader, effective strategic plan, lots of potential for growth, talented staff", "cons": "Still moving on from a difficult time of change"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "culture a complete tear-down", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Jan 2020", "job_title": "Vice President of [Redacted] in The Hammocks, FL", "duration": "N/A", "pros": "work remote! vegan co-workers (though most of management isn't even vegetarian)", "cons": "MFA has a deeply broken culture, and its incestuous bubble of decision-makers work only to preserve themselves instead of fixxing any of the problems. The core problem appears to be the founder, Nathan Runkle, who returned from a vacation in Peru (to \"find himself\") with a new name and a strange new desire to turn over his baby to the joyless corporate types, who proceeded to manipulate and gaslight the hard-working peons until they went mad, resigned, or were fired for trumped-up reasons, resulting in cascades of failure."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "MFA is a great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Feb 2020", "job_title": "Researcher", "duration": "N/A", "pros": "I have been with MFA for 6 months and am consistently impressed by the high level of intentionality across the board. It is clear that the leadership works very hard to be strategic in their advocacy efforts AND in creating a positive culture and a productive team.", "cons": "I have none to offer at this time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Friendly, Inclusive Environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "There is an abundance of inclusivity and a desire to achieve success within all departments at Mercy For Animals. All staff is committed to the mission and the goals of the organization and there is genuine support for everyone.", "cons": "Working remotely has its challenges, though the organization actively strives to tackle and to overcome any issues that arise."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "How my dream job turned into a nightmare", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Feb 2019", "job_title": "Content Manager in Los Angeles, CA", "duration": "N/A", "pros": "Ability to work remote. Good amount of PTO.", "cons": "When I started at MFA it was a fun, creative, innovative work environment. The organization was making very real changes in the farmed animal space. Undercover investigations were released often, lawsuits against animal abusers were filed, and corporate victories were frequent. Furthermore, the leadership of the organization supported the mission and empowered employees. Over time the organization’s culture crumbled. There were sexual harassment scandals and constant leadership shakeups. To make matters worse, MFA’s founder and current board President has created a culture of fear. In one full sweep he removed the leadership that cared about employees and the mission, and replaced them all with corporate cronies who could care less about making difference for farmed animals. What’s more, this current leadership laid off staff while giving themselves raises and promotions, and have furthered Milo’s culture of fear. Additionally, the HR department and current President failed to take action when an American employee made blatant racist remarks about staff in Mexico on an organizational wide call. They also dragged their feet when multiple staffers filed complaints about another staffer who assisted a known sexual predator spy on his victims. Quite frankly, it’s appalling that a social justice group would allow these things to occur. During my time at MFA I watched countless devoted activists who cared deeply about making a change for animals be bullied, harassed, lied to, and essentially pushed out of the movement. Current leadership is power hungry, egotistical, and self serving. If you care about helping animals I would NOT recommend working at MFA ... I honestly don’t even think anyone in leadership cares about the mission — including MFA’s founder, Milo Runkle."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Anonymous", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "-a few employees I was able to work and create friendships with \r\n- a cause I fully supported and stood behind", "cons": "The management and way in which certain members (not in the inner MFA circle) were treated was extremely poor. Little to no communication or directon and was let go with no understanding of why, which was extremely hurtful. For a company so passionate about animals, they show little compassion for the humans just trying to help. Working for MFA still gives me an uneasy feeling and made me step away from the movement due to a total lack of confidence in its supporters."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Leadership / Culture Changes Urgently Needed", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- A commendable, international mission to reduce suffering for farmed animals and increase compassion.\r\n- Many kind and generous coworkers, particularly in junior / entry level positions.\r\n- Generally has a decent public reputation, until recently.\r\n- Remote structure allows for flexible work schedules.", "cons": "- Deeply troubled culture that begins at the top, with a high turnover rate among employees who are not in leadership's inner circle.\r\n- Numerous outspoken employees who shared serious concerns about the organization's lackluster culture and poor workplace environment have been terminated or resigned in the last year alone.\r\n- At least several abruptly terminated employees were not presented with any specific, substantive concerns about their work performance, nor were they given an opportunity to improve any alleged shortcomings.\r\n- A senior member of leadership who had a documented history of sexual harassment allegations against him was not terminated until a widespread effort by female employees succeeded. Many female employees subsequently resigned.\r\n- The organization is deeply disorganized, with cumbersome review processes, frequent role changes for staff, and greenlit projects that are later cancelled.\r\n- Has a culture of nepotism at the top, with the President and his spouse both working in senior roles, and numerous longtime friends holding senior positions and controlling the Board.\r\n- Compensation is modest at best, particularly for more junior staff.\r\n- While promoting compassion towards animals, some members of senior management are far less compassionate towards people, given the organization's high turnover rate and repeated, unaddressed concerns shared by many staff."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "\"New Mercy For Animals. Same fight for animals.\" Yeah right. MFA 3.0 is a mess.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Some incredible people still work there. Farmed animals experience the most suffering, so it was an honor working on their behalf. Just upgraded their PTO and most staff can work remotely.", "cons": "Where do I begin? As other reviews state, MFA was once the farmed animal protection leader and now it is in a complete downward spiral. It saddens me that what was once my dream job amongst people I considered to be family ended and the new wave of senior leadership is absolutely unfit for their jobs. Not only are senior leadership members earning high salaries, but they are giving themselves promotions and raises as they are laying off and demoting invaluable team members who were the heart of the organization. There are so many incredible, talented, and compassionate people who work for the organization, but they are being severely mismanaged by new faces who are completely disconnected from reality. Aside from lay offs, they are experiencing resignations left and right. MFA 3.0 is a mess. They created a guiding coalition to develop a 3-year strategy and basically interpreted staff suggestions the worst way possible and when people tried to speak up and give critical feedback, Leah (MFA's current president) and other senior leadership members responded by saying, \"this is the strategy you created, this is what you wanted.\" No, we did not want our beloved organization to be mismanaged into the ground. Morale is at a low and it is heartbreaking that the animals will suffer because of it."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "run like a know-nothing dictatorship", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jun 2018", "job_title": "Senior Web Developer in New York, NY", "duration": "N/A", "pros": "work remotely, great colleagues, reasonable salary", "cons": "rampant nepotism, insufficient separation of board from management, terrible communication between management and employees, and cruel treatment of overworked employees"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Buyer Beware", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Oct 2019", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Working from home. Passionate colleagues.", "cons": "Inexperienced leadership. Lack of trust throughout the organization. Experimental program strategies. Disengaged board of directors. Deliberate lack of transparency, outward as well as inward. High turnover, including at the leadership level. \r\n\r\nAt the beginning of 2019, eight team members were laid off. It was explained to staff that this was necessary due to a budget shortfall. Staff were denied raises, and the annual staff retreat was removed from the calendar. (Later in the year, however, the organization held an extravagant event that cost over half a million dollars.) \r\n\r\nSince the layoffs, over 45 additional team members have left the organization. This includes seven members of the senior leadership team (two SVPs and five VPs). The once harmonious culture that made this organization so strong is no longer in existence at all. Those of us who remain are being told that turnover is \"in line with the industry average\".\r\n\r\nIn 2019, leadership instituted a new strategic plan. Since then, program areas have changed (some have disintegrated altogether), many programs have switched around, and no one can keep track of what the organization is even doing anymore. Meanwhile, there is talk of global expansion into Asia, despite the inexperience in those regions and the overall inability to keep staff retained anywhere.\r\n\r\nDiversity, Equity, and Inclusion are critical to the movement and to the health of this organization. Women, people of color, and LBGTQ team members make up the majority of the people who have left the organization, sadly. Meanwhile, those promoted into senior roles, especially at the upper levels, have all been white men. This organization is becoming less and less diverse, equitable and inclusive every day.\r\n\r\nThis organization is so important to the animal rights movement, and it is shameful what it has allowed itself to become. Until leadership of the organization adopts transparency and makes people and culture a priority, it is doubtful much will change."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": "N/A", "review_title": "If You Like Living in Game of Thrones, MFA might be for you", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 May 2019", "job_title": "Investigator in West Hollywood, CA", "duration": "N/A", "pros": "Lots of random craziness.  You never know when Daenerys will show up with a Dragon.", "cons": "Getting a knife in the back randomly after years of hard work.  Weird politics that make more sense in North Korea than in Animal Rights."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Inclusive, compassionate, strategic!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Working at MFA has been one of the best experiences of my life. My coworkers are so smart and creative, and I love how strategic we are when it comes to our approach. Great benefits, flexible hours, and very competitive pay don't hurt either!", "cons": "Working remotely can sometimes feel isolating, however, there are numerous opportunities to meet up with colleagues over the year."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Dream job", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Feb 2020", "job_title": "Director of Operations in Belo Horizonte, Minas Gerais", "duration": "N/A", "pros": "Great environment, amazing and friendly staff. Mercy For Animals is full of dedicated and collaborative people – which makes work so much more enjoyable. Salary and benefits are good.", "cons": "When you work doing something you love, it's easy to get caught up and suddenly find yourself working long hours in a way that can be unhealthy sometimes."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Feb 2020", "job_title": "Attorney in São Paulo, São Paulo", "duration": "N/A", "pros": "I feel like I can be myself and still be respected at MFA. I can also see  that the leadership is always trying to find ways to improve internal policies and take the organization further.", "cons": "There are internal policies that still need to be improved, but I feel like the leadership is already working on that."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Mar 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The ability to work alongside people who share your ideals, the ability to work remotely, professional development opportunities", "cons": "I'd love to see salaries rise across the animal protection movement."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Leadership gives themselves raises with the money saved from lay-offs", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "There was time this org worked to help animals. Now it's just turning into a welfarist mess", "cons": "New Leadership is completely corrupted, non-transparent, and in this to give themselves the money earned on the backs of loyal employees"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Love working at MFA", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Feb 2020", "job_title": "Corporate Relations Specialist in Ciudad de Mexico", "duration": "N/A", "pros": "Remote work, no more time in traffic. \r\nPassionate people that love what they do. \r\nWorking for making a better world for animals. \r\nProfesional Development and Self Care Budget.", "cons": "You don't get to know all the staff in person."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Investigator", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Apr 2014", "job_title": "Investigator in Los Angeles, CA", "duration": "N/A", "pros": "Helping animals, being able to make a positive change.", "cons": "Long hours, standing lifting, physical labor."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Complete And Utter Chaos", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Jul 2018", "job_title": "Development in West Hollywood, CA", "duration": "N/A", "pros": "Work remotely.  Cause is good.", "cons": "Appalling waste.  Nobody knows what the direction of the organization is.  Communication is terrible, so you never know they don't like you until they fire you or make it so you must resign."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Evaluation MFA", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Mar 2020", "job_title": "Campaign Coordinator in Monterrey, Nuevo León", "duration": "N/A", "pros": "Excellent coworkers and remote work.", "cons": "Many meetings online, that makes one lose the work flow."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Campaign Assistant/outreach intern", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Apr 2017", "job_title": " in Chicago, IL", "duration": "N/A", "pros": "Great organization that does great work!", "cons": "The work pace seemed a little slow to me"}]]