[[{"date": "4 Jul 2023", "title": "Cloud Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at UC San Diego Health (San Diego, CA)", "Interview Descriptions": "Multiple Interviews. 1. Interview with Director - overview of skills 2. Team and Manager Interview - cloud services knowledge - infrastructure knowledge - security knowledge 3. Share current or previous projects as it relates to cloud services", "Interview Questions": "Set cross account permissions in aws"}, {"date": "10 Apr 2023", "title": "Associate Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC San Diego Health (San Diego, CA)", "Interview Descriptions": "Applied, phone call follow up and interview scheduled for the following week. Spoke to several people throughout the course of the process and learned a lot about operations prior to moving forward.", "Interview Questions": "What are some weaknesses you have and how do you adapt to accommodate?"}, {"date": "30 Apr 2022", "title": "Registered Nurse CN IV Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC San Diego Health", "Interview Descriptions": "Group/team interview with multi-disciplinary panel that consisted of manager, potential co-worker in nursing, attending physician, and/or advanced practitioner. Note that this may be divided into different groups same day or on different days", "Interview Questions": "How do you/did you handle disagreement with co-worker"}, {"date": "27 Apr 2022", "title": "Clinical Nurse Educator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UC San Diego Health in Apr 2022", "Interview Descriptions": "I applied in February 2022, received a call in March, to interview in April. The interview went well. Semi-laid back conversation, with behavioral questions asked, but for the most part, I was asking most of the questions. I was interviewed by the department director, manager and a NP. After my questions were answered, I was told by the hiring manager, that the process from interview to offer can take about 3-4 weeks, and to please be patient with the process. I received a call from one of the interviewers asking for clarity regarding my resume, and for references. Those were provided to the hiring manager the next day via email, as requested. This is my dream job, so I’m exercising patience. It has been almost 3 weeks since my interview, so I will email to follow up if there is no communication by week 4. My references have informed me that they have not been contacted yet.\r\nFollow Up: I emailed the hiring manager for follow up, after 4 weeks, and still haven't received a response. The posted position has also changed since I applied, from 1 position to 2, and it is not part time. I will be withdrawing my application.", "Interview Questions": "Tell me your strengths and weaknesses?"}, {"date": "11 Jan 2022", "title": "Research Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC San Diego Health", "Interview Descriptions": "My interviewers were kind and laid everything out on the table regarding the job position, career path, and expectations from the person taking on the responsibilities. They were eager to learn about what I could bring and the conversation was engaging.", "Interview Questions": "My Excel Skills, Multitasking and eagerness to learn"}, {"date": "4 Oct 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at UC San Diego Health (San Diego, CA)", "Interview Descriptions": "The process was very simple.  I was interviewed  by the volunteer coordinator and she did not ask any technical/ knowledge questions.  It was mostly about availability and preference for departments.", "Interview Questions": "What department would you prefer to work in?"}, {"date": "24 Sept 2021", "title": "New Grad Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC San Diego Health", "Interview Descriptions": "The questions were very normal interview questions such as tell me about yourself, why this unit, tell me about a time you had a difficult pt, tell me about a time you had to change your beliefs. I was interviewed by the manager an a nurse on the unit. They were both very nice and would add a response after I answered my assigned question.", "Interview Questions": "Tell me about a time you had a difficult patient assignment."}, {"date": "15 Jan 2022", "title": "Cybersecurity Architect Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at UC San Diego Health (San Diego, CA) in Aug 2021", "Interview Descriptions": "First interview, video via Microsoft Teams, with the hiring manager and two team members. Conversational. Lasted 40 minutes. Second (and last) interview with hiring manager and three team members (two from previous interview). Fast paced Q&A for an hour. Hiring manager stated they would be making a decision in the next couple of weeks. No contact after the second interview. I withdrew my application two months later.", "Interview Questions": "Describe how you would manage a project and deliver results."}, {"date": "3 Jul 2021", "title": "Lab Assistant II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC San Diego Health (San Diego, CA) in Jun 2021", "Interview Descriptions": "The position was in Hillcrest. There were two separate interviews and the interviews were very straightforward and lasted about 10 minutes each. I was told that they have 3 openings for the position. The lab asked me to provide my references shortly after these interviews and they took many days to review them.  However, they reopened the job posting and recruited 2 more persons during the reference checking period. I was merely informed that their subject pool was very competitive. Based on what I read on their hiring guidelines, only final candidates will move forward into the reference checking step. While they claimed that this was completely appropriate, the entire process felt arbitrary and unprofessional.", "Interview Questions": "Do you have experience in schizophrenia or Alzheimer's disease?"}, {"date": "18 Feb 2021", "title": "Student Assistant Marketing and Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UC San Diego Health", "Interview Descriptions": "Interview was quick and the interviewers were very nice! Had the interview in a nice little conference room. They asked important questions to know if you could get the job done but were still interested in who you are.", "Interview Questions": "Q: Tell me about yourself."}], [{"date": "2 Feb 2021", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC San Diego Health", "Interview Descriptions": "Interviewer told me which room to meet them in for my afternoon meeting, I waited in an empty room for 30 minutes and they never showed. Went into the office to ask others where my interviewer was and the others in the office said the interviewer was not in the office yet and they would contact me to reschedule. Unbelievably unprofessional interview experience.", "Interview Questions": "What projects have you completed that qualify you for this role?"}, {"date": "18 Oct 2021", "title": "Data Analytics Lead Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UC San Diego Health in Feb 2021", "Interview Descriptions": "2 very casual interviews with director and manager.  Received an email from manager stating that I had the job and just needed to fill out references.  Never heard back from them again.  2 months later received an email from the director asking if I'd be interested in one of the new job openings.", "Interview Questions": "Describe current work you are doing."}, {"date": "25 Jan 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC San Diego Health (San Diego, CA)", "Interview Descriptions": "The interview was pretty standard. First was a quick phone interview, and then an invitation to an in person interview. I met with the PI of the study, and we discussed  future goals", "Interview Questions": "How do you handle conflict in the workplace?\nWhere do you see yourself in 5 years?"}, {"date": "12 Jun 2020", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at UC San Diego Health", "Interview Descriptions": "Pretty Straightforward \r\n\r\nOne call with Position overview and expectations and then questions about \r\n\r\nSkills and Project discussion and behavioral and team fit questions.\r\n\r\nThe interview was with the full team and it was great ... interviewers were nice and accommodating.", "Interview Questions": "Project and Current work related questions"}, {"date": "5 Mar 2020", "title": "Giftshop Cashier Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UC San Diego Health", "Interview Descriptions": "Not really an interview more like a quick tour and schedule availability confirmation. Got the job on the spot basically as they were just hiring whoever fit their schedule needs.", "Interview Questions": "What is your availability?"}, {"date": "24 Jan 2020", "title": "Admin Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC San Diego Health", "Interview Descriptions": "Interviewer was over 30 minutes late, I was sitting in an empty conference room for so long I considered walking out. Ended up staying and eventually getting hired and heard from other colleagues that they had a similar interview experience.", "Interview Questions": "Tell me about a time you faced conflict."}, {"date": "24 Aug 2020", "title": "Regulatory Response Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at UC San Diego Health (San Diego, CA) in Jan 2020", "Interview Descriptions": "The interview process did take a few weeks; I had two interviews.  Then to get hired on board it took another couple of weeks.  It is not a quick process.", "Interview Questions": "Can you tell me about yourself?"}, {"date": "6 Dec 2019", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UC San Diego Health", "Interview Descriptions": "Interviewed for a position for roughly 3 months. and the company lacked all and any consideration. Typically for my role, the company pays for travel to and from and they refused. They refused to give me a timeline. Made me do 4 separate interviews only to reject me via a \"insert name\" rejection letter. I spent 3 months wondering if I would get the role and they refused to be considerate of me as a candidate the entire time.", "Interview Questions": "why ucsd "}, {"date": "16 Dec 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at UC San Diego Health (San Diego, CA) in Nov 2019", "Interview Descriptions": "Applied in August of 2018 and had a half a day Skype interview in October, this included the hiring manager, direct reports and campus colleagues.  About a week later I was informed that I made it to the next step which was the on campus interview which took place in November. The on campus interview was 4 hours where I did a presentation, met with those who would report to me, and other campus colleagues. From there about 3 weeks went by with some level of communication from the department. They called my references the week after I got back and started scoring all candidates. I received an offer the first week of December.", "Interview Questions": "Why UCSD? What makes you the best candidate for the job? Questions so they could get to know me."}, {"date": "8 Sept 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC San Diego Health (San Diego, CA)", "Interview Descriptions": "lots of apps sent through UCSD health's careers page\nphone interview with HR\nPhone interview with project manager of position\nIn-person interview with a few project managers and staff\nPhone call that I got the job", "Interview Questions": "casual conversation about my experience and a few questions about how I would handle challenging situations in the workplace"}], [{"date": "22 Jul 2019", "title": "Clinical Social Worker I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC San Diego Health (San Francisco, CA)", "Interview Descriptions": "I had a Skype/Zoom interview since I was interviewing for a position outside of the San Diego region.  Being familar with a two diagnoses in DSM5 was helpful and knowing how to use motivational interviewing. There was a diverse panel of people which included two men, four women, two latino people, and one black person. Everyone took turns asking questions and took notes as I responded. Although I was not in the room the energy felt positive from everyone as they smiled and used a calm tone while asking questions.", "Interview Questions": "Do you have experience conducting suicide assessments, How would you handle conflict with a supervisor, What is motivational interviewing and how would you use it to support behavior change with a client, What changes were made from DSM-IV to DSM-5?"}, {"date": "1 Mar 2022", "title": "Research Associate I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at UC San Diego Health in Jul 2019", "Interview Descriptions": "I was in charge of stem cell disease modelling and the interview process was very smooth and comfortable. We talked about my career aspirations and previous experience in a smooth manner. No complaints.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "23 Jun 2019", "title": "AA Patient Care Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC San Diego Health (San Diego, CA)", "Interview Descriptions": "They email to give a date and time, You go in  and they forgot to mention the job was graveyard shift? That is a major detail. I left upset and asked that they post that on the job page ahead so people decide if that is for them, if they want to loose hours of work to go to the interview,  and gas. It was a waste of their and my time.", "Interview Questions": "Due to being so busy we forgot to mention a few details. So now we will ask questions and please tell us if this will work for you. We need people to work weekends, holidays and graveyard....."}, {"date": "23 Dec 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC San Diego Health", "Interview Descriptions": "After your application is submitted, a volunteer coordinator will reach out to you for a quick interview to get a better idea of who you are, how you want to contribute, and select the best department placement and shift for you.", "Interview Questions": "Why do you want to volunteer with UC San Diego Health?"}, {"date": "23 Oct 2021", "title": "Program Evaluation Associate (SRA III) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at UC San Diego Health (La Jolla, CA) in Nov 2018", "Interview Descriptions": "Went in for a preliminary interview with the PI I would be working for (the decision for hire was made here). I then waited while they did due diligence and went in for a second interview where I did a basic competency test (interpreting SPSS output, making an Excel graph).", "Interview Questions": "They basically just described what projects I would be working on (and the grants that would fund me) and asked me if I had any questions about them. They asked me about a few positions on my resume and what programs I was familiar with. "}, {"date": "13 Feb 2019", "title": "Fiscal Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC San Diego Health (San Diego, CA) in Nov 2018", "Interview Descriptions": "There were two interviews. \r\nThe first step was a panel interview with your potential manager and other staff you would potentially interact with daily.\r\nThe second step was an interview with the department director.", "Interview Questions": "They asked about skills, job history, and accounting terminology."}, {"date": "3 Oct 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC San Diego Health (San Diego, CA) in Sept 2018", "Interview Descriptions": "Applied for 2 months and received a call from dept manager to schedule an interview.  Came in for a 30 minute face to face interview with manager and assistant manager.", "Interview Questions": "Why do you want to work for UCSD?"}, {"date": "1 Sept 2018", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at UC San Diego Health", "Interview Descriptions": "Phone interview screen, then a In person interview that lasted about an hour. Then they asked for a reference check that needed to be done before making a final decision.", "Interview Questions": "How do you prioritize and organize your day when you are short on time"}, {"date": "8 Oct 2018", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC San Diego Health (San Diego, CA) in Sept 2018", "Interview Descriptions": "1. After applying on the UCSD website, I got an email one week later to set up a time and date for a phone screen.\r\n\r\n2. Recruiter was very friendly. She was a few minutes late to the call because she thought it was another time, so we reschedule for 2 hours later.\r\n\r\n3. She asked me a few questions and said that I will find out one way or another if I got it. Phone screen was 20 minutes. \r\n\r\n4. I followed up via email, but no response. I checked my status on the UCSD jobs website and it said \"Others More Competitve\" a week later.", "Interview Questions": "Describe your experiences and duties of each job on your resume."}, {"date": "8 Aug 2018", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at UC San Diego Health", "Interview Descriptions": "Interview process was handled well.  I felt informed and interviews were scheduled and coordinated well.  Participated in phone interview, then on-site panel interview.  No word from hiring manager or assistant after the panel interview, despite following up via email and voice mail.  In my opinion, it was unprofessional on their part to not close the loop with a candidate that had been interviewed.", "Interview Questions": "Specific question related to program approach"}], [{"date": "12 Jul 2018", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC San Diego Health", "Interview Descriptions": "I applied online and received a call approximately 3 weeks later to set up an in-person interview.  Interviewed 1:1 with the manager. Interview consisted of only a couple behavioral questions that related to the position. Manager was soft spoken, unsure of her opinion.", "Interview Questions": "Describe a time you faced an ethical dilemma? "}, {"date": "22 Jun 2018", "title": "Fiscal Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UC San Diego Health", "Interview Descriptions": "The hiring process wasn't too difficult. There was an exchange of emails to find an available time to interview. The interview process was extremely friendly as well as the environment.", "Interview Questions": "When can you start working?"}, {"date": "23 Jun 2020", "title": "Clinic Operations Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at UC San Diego Health in Apr 2018", "Interview Descriptions": "The interview process was efficient and thorough. Everything was done virutal due to COVID-19. With new technology it's nice to be able to use other options to complete the recruiting process.", "Interview Questions": "Why are you interested in working with us?"}, {"date": "1 Mar 2018", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at UC San Diego Health", "Interview Descriptions": "Everyone was really nice and the interview questions were related to my specialty ( no clinical based scenario questions.) what does professionalism mean to you? Why this specific unit? 5 year goal? What other credentials do you have? Have you ever been involved in a committee at work?", "Interview Questions": "Tell me your strength and weaknesses?"}, {"date": "18 Dec 2017", "title": "Hospital Assistant, III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at UC San Diego Health (San Diego, CA)", "Interview Descriptions": "it was a straight forward interview where the hiring manager was looking for someone with great customer service skills.  He asked me questions on how I would treat an upset patient/customer, what chain of command I would follow, how would I mediate a conflict with another employee, etc. Although this interview was for a completely new field for me, the interview was similar to other interviews I've had for jobs in other fields.", "Interview Questions": "They asked how I would handle an upset patient/customer."}, {"date": "13 Dec 2017", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UC San Diego Health (San Diego, CA) in Dec 2017", "Interview Descriptions": "Interview was pretty basic, asked mostly behavioral type questions. Tell me about a conflict with a coworker and how you handled it? What are your goals? What does your current hospital practice that you think everywhere should practice? What are your most challenging type of patients? What are your favorite patients to take care? How did you contribute to a team environment at work? There was only 1 clinical question and it was super basic, nursing 101. I had one interview at hillcrest and another one at Jacobs the day after. They were both very similar. Got emailed for references the day after the Jacobs interview which was a Friday. They called me the following Monday and mad an offer. Never did hear back from Hillcrest. Sent them a thank you email and withdrew myself from consideration. So the process at UCSD Jacobs was super quick. Start date 3 weeks from date of offer.", "Interview Questions": "N/A"}, {"date": "27 Nov 2017", "title": "Clinical Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC San Diego Health", "Interview Descriptions": "I got email few days after applying online. Got phone interview for 10 minutes asking about your goals and experience. Very simple questions and direct. The interviewer was very friendly. I got the acceptance within weeks.", "Interview Questions": "Asked about the previous education"}, {"date": "9 Dec 2017", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC San Diego Health (San Diego, CA) in Oct 2017", "Interview Descriptions": "the questions were very general. it was a group interview with 4 others, with the manager, asst. a manger, and clinical nurse educator. They individual asked each of us the same questions and we alternated our responses.", "Interview Questions": "how do u prioritize which pt to see first?"}, {"date": "28 Oct 2018", "title": "Privacy Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at UC San Diego Health (San Diego, CA) in Oct 2017", "Interview Descriptions": "Three panel interview.  Two of the individuals were professional, the third was rude and condescending.   The condescending person was not even an individual who was employed at UC San Diego Health, but rather a former employee.  She seemed very bitter.", "Interview Questions": "Have you ever performed investigations?"}, {"date": "20 Oct 2017", "title": "Patient Access Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at UC San Diego Health (San Diego, CA) in Sept 2017", "Interview Descriptions": "My jngerview was postponed three times and my interviewer was twelve minutes late. I was interviewed by a panel of four. Quite professional at first. I was asked approximately twenty questions and then I was explained what the hiring manager was looking for in a candidate. I did not feel this interview was conducted properly.", "Interview Questions": "If two staff members request the same day off, how do you decide which one is granted the pto? "}], [{"date": "1 Aug 2017", "title": "SRA I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC San Diego Health", "Interview Descriptions": "I applied online. I didn't know anyone in the department. I just hoped that someone would see my application and call me in. (In research, sometimes positions are posted as a requirement by HR, but the PI or research group could already have someone in mind like an internal job promotion or former volunteer or intern.)\r\n\r\nInvited by email to one interview only. No PI present, just postdocs and project manager. I was asked to submit writing samples. After a couple weeks of waiting, references were called and I was offered the position.", "Interview Questions": "Why are you leaving your current job?"}, {"date": "7 Jul 2017", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC San Diego Health", "Interview Descriptions": "phone screen with hr questions, based on that they will possibly bring you in for in-person interviews. I had 1 phone screen that was not followed by an in-person, and 2 that were. After all 3 I was never followed up with by the staff despite sending emails to them.", "Interview Questions": "How do you deal with multiple PIs who have very different supervisory styles"}, {"date": "9 Aug 2017", "title": "Front Office-Urology Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at UC San Diego Health (San Diego, CA) in Apr 2017", "Interview Descriptions": "Phone screening followed by immediate invitation for face to face interview. \nFace to face interview consisted of lead RN and Program \nManager. They explained more about the department and expectations rather than ask questions. The way the posed one question revealed their current work culture, which I don't believe was great. Casual environment.", "Interview Questions": "Tell me about yourself \nStrengths/weakness"}, {"date": "5 Mar 2017", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at UC San Diego Health", "Interview Descriptions": "Applied online, contacted by email for phone interview. 1 week later was asked to come for in person interview. Panel of 5 people, asking very similar questions to phone interview, all relatively nice.", "Interview Questions": "What tools do you use to plan/schedule for future events?"}, {"date": "15 Mar 2017", "title": "Emergency Trauma Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC San Diego Health (La Jolla, CA) in Mar 2017", "Interview Descriptions": "Very average interview, nothing too out of the box question wise. I was interviewed by 3 people. I had applied for this job months before actually getting an interview. Less than a week after the interview I was asked to submit references. Be confident and ask them questions!", "Interview Questions": "Tell me about yourself, etc."}, {"date": "21 Feb 2018", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 8 months. I interviewed at UC San Diego Health (New York, NY) in Mar 2017", "Interview Descriptions": "I had a quick interview over the phone. My boss called me and asked me a few questions. It felt like more of a formality than an actual interview.", "Interview Questions": "How can you demonstrate your organizational skills?"}, {"date": "30 Dec 2016", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UC San Diego Health (San Diego, CA) in Dec 2016", "Interview Descriptions": "I had a great experience when I first walked in. I wasn't the least bit nervous but always nice to be welcomed with a smile.  Being a social butterfly myself, it was quite comforting. My interview went very well. Waiting for labwork and background check to be completed. I'm grateful for being given this GREAT opportunity. Especially hearing how hard it is to get in at UCSD. A HUGE Thank You to ALL whom prayed for me.", "Interview Questions": "When can I start"}, {"date": "15 Dec 2017", "title": "Clinical Data Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC San Diego Health (San Diego, CA) in Nov 2016", "Interview Descriptions": "I went through a telephone interview and received an on-site interview with the whole research team members the next week after the telephone interview. On-site interview went well and received an offer within 2 days.", "Interview Questions": "What's your rationale on sorting data?"}, {"date": "23 Jun 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UC San Diego Health (San Diego, CA)", "Interview Descriptions": "It was very easy and causal. Was not asked any hard hitting questions. I was interviewed by 3 different nurse within 2 hours. Each asked a different set of easy going questions. I felt very comfortable. 2 weeks after my interview I was sent via email requesting my references. After those where submitted I was offered the position.", "Interview Questions": "Tell me about yourself. Why do you want to work here."}, {"date": "27 Sept 2016", "title": "Fit-Up Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at UC San Diego Health (San Diego, CA) in Jun 2016", "Interview Descriptions": "Brief call from the hiring manager, quick formal talk about my skill set, manager was in a bit of a hurry so the call wasn't very long. Recruiter called me back a few days later and said the manager liked me and wanted to hire me.", "Interview Questions": "If I preferred working in a team or independantly"}], [{"date": "20 May 2016", "title": "Student Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 days. I interviewed at UC San Diego Health (La Jolla, CA) in May 2016", "Interview Descriptions": "Just talked about previous projects and knowledge from my resume. Mostly talked about what I would be working on as well as availability. The interview was pretty quick. Most likely just to see if I would be a good fit for the team. Was able to ask questions at the end.", "Interview Questions": "Can you show us what kind of things you have worked on in your previous interning experience?"}, {"date": "2 Apr 2016", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC San Diego Health (San Diego, CA)", "Interview Descriptions": "Two interviews: the first with the nurse manager, the second with both the nurse manager and the director of the department, a physician. Extensive questioning about my skills, previous work experience, what would I do in a given situation. They described the position, and the candidate they were looking for. They wanted clinical skills in a variety of settings, flexibility, good communication skills. They also preferred someone who could speak Spanish (which I do). Given the large number of Spanish-speaking patients at UCSD, that skill is extremely helpful.", "Interview Questions": "The nurse manager asked why I was applying at UCSD. It turned out she had worked for the same health system that I was working in, the exact same department. During the interview, she actually called one of the doctors there to ask about me. So we had a lot of common ground."}, {"date": "11 Oct 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UC San Diego Health (San Diego, CA) in Apr 2016", "Interview Descriptions": "Asked for minimum GPA and a good resume with a good cover letter. Got called in with a joint interview. The defining factor was how well the cover letter was written. People who simply copy/pasted a template were almost immediately rejected.", "Interview Questions": "Why do you want to do research in this lab?"}, {"date": "9 Mar 2016", "title": ", CCBB Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC San Diego Health", "Interview Descriptions": "The director of the program asked some questions about my previous projects. Then I was directed to a software engineer then a data scientist. They went through classes that I took, and ask questions related to R language.", "Interview Questions": "R language"}, {"date": "10 Nov 2016", "title": "Marketing Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at UC San Diego Health (San Diego, CA) in Mar 2016", "Interview Descriptions": "The interview was not complicated at all. I schedule an interview through e-mail. I was interviewed directly by my supervisor and it took about 15-30 minutes. The questions asked were general including goals, reasons I want to work there.", "Interview Questions": "What is your goal?\r\nWhy do want to work here?\r\nWhy are you a great fit?"}, {"date": "12 Aug 2016", "title": "Clinical Data Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC San Diego Health (San Diego, CA) in Jan 2016", "Interview Descriptions": "Applied online. Got a response in 2 weeks Got an email to set up a interview within a week. Ask personality questions along with simple skill questions. Review of benefits and salary requirements.", "Interview Questions": "Ask about skills in excel, ability to communicate with people on phone, in person, and email, ask about flexibility of schedule. Ask about strengths and weaknesses. Asked about some skills in SAS."}, {"date": "31 Jul 2018", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at UC San Diego Health (San Diego, CA) in Dec 2015", "Interview Descriptions": "Long and drawn out.  I initially applied in October of 2015.  Immediately my resume was forwarded to the hiring manager.  I did not receive a call for interview until December 2015.  Did not finalize and get hired until May 2016", "Interview Questions": "Have you use Epic data warehouse as a reporting tool?"}, {"date": "30 Sept 2015", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UC San Diego Health", "Interview Descriptions": "Panel interview of five; each asked several questions. Surprised by the aggressiveness of the panel. I am not sure if it was a tactic they were using, but it was the opposite of what I experienced during my training and education at the hospital. I left the interview not wanting anything to do with organization again.", "Interview Questions": "Few behavioral questions and several scenario questions"}, {"date": "13 Feb 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UC San Diego Health (San Diego, CA) in Oct 2015", "Interview Descriptions": "I had a phone interview for about 20 minutes. I then had a panel interview for about an hour. Everyone was friendly and accommodating to my schedule. The panel was created of different people of the department. The panel also asked about how much I knew about UCSD Health and I was able to learn about the department as well.", "Interview Questions": "They asked a lot of behavioral questions."}, {"date": "8 Jul 2015", "title": "Referral Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at UC San Diego Health (San Diego, CA)", "Interview Descriptions": "I received a call inviting me in for the interview 6 weeks after I applied online, this was a panel interview with 12 people (11 women and 1 man) that lasted 1 hour and 10 minutes. The first 2 was the hiring manager and a Supervisor asking me basic questions about why I applied and explained how they were going to conduct the interview, I asked the Supervisor to describe the job responsibilities and she stated she didn't know that much about it.  The next group was 5 people (the actual team the applicant would be working with) they described their jobs and what they expect from a team member, one of the women in this group fell asleep during the interview, she didn't bother to introduce herself or say hello either. The next group were Nurse Case Managers that asked several questions about my experience and explained what they were looking for in a candidate. Overall, I felt that the interview was unprofessional and overwhelming with 12 people. I thought I did well but they never called back, not even a follow up email saying they decided to move forward with another candidate. I waited another 4 weeks to hear back, all they did was change the job status online to \"Position Filled\" 4 weeks after my interview. After going through such a long and difficult interview and taking out the time to drive out to their location, you would think they would have some sort of common courtesy and notify you. I guess that tells me a lot about how the department is and how the management sets their priorities.", "Interview Questions": "How do you feel about getting constant interruptions?"}], [{"date": "3 Apr 2017", "title": "Comm Health Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UC San Diego Health (San Diego, CA) in Jun 2015", "Interview Descriptions": "Got a phone call regarding interview invitation after submitting an app online. I was invited for an on-site interview, interviewed by two people at once. The interview itself lasted for about 1 hour and it was a very simple process. Asked standard questions (my skills, availability, strengths, weakness, etc).", "Interview Questions": "Why do you want this position? The job requires you to adapt to slow and fast moving environment at the same time, do you think you're ok with that?"}, {"date": "9 Mar 2017", "title": "Data Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UC San Diego Health (San Diego, CA) in Feb 2015", "Interview Descriptions": "Very relaxed; no pressure or intimidation. Was brief (~15min) and asked only a few questions pertaining to hypothetical situations and job-related knowledge. There was no phone interview prior, just a call screening and setup for an in person interview.", "Interview Questions": "Im going to show you X. Look it over and tell me what would you do differently in order to make it more appealing. How would you reorder/add things in order to gather more traffic?"}, {"date": "14 Jan 2015", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UC San Diego Health", "Interview Descriptions": "Applied online and took about a month and a half to get called in for an interview. First interview was with the people I would be directly working with. The second interview was with the overall department head. Got hired about a week after the second interview. From application to hiring the process took about 2 months.", "Interview Questions": "All questions were pretty straight forward and typically for the position."}, {"date": "22 Oct 2014", "title": "Student Administrative Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UC San Diego Health", "Interview Descriptions": "Applied onine via Port Triton website for students\r\nReceived a phone call with immediate phone interview\r\nHired on the spot, very easy interview, asked about work and leadership experiences and applicable skills", "Interview Questions": "N/A"}, {"date": "30 Sept 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 days. I interviewed at UC San Diego Health", "Interview Descriptions": "I went through a phone interview and then called in for in person interviews while tested on my communiation skills and writing skills. I was tested on my verbal skills and asked how I would handle certain situations with clients.", "Interview Questions": "there were not many questions"}, {"date": "5 Aug 2014", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC San Diego Health (San Diego, CA)", "Interview Descriptions": "I applied online & was called exactly a week later to schedule an interview for an 1 on 1 interview. I was called back the same day for a second interview which was consisted of a 4 person panel. Most of the questions were aimed at getting to know me personality, if we could get along with each other & what exact skills I have to contribute to the department. Everyone was very friendly which helped since I was very nervous. Being hired to work at UCSD is a huge deal considering their research accomplishments & world wide influence. Also, you can't beat the pay & benefits when comparing to other hospital systems in San Diego.", "Interview Questions": "Why did you choose Social Work?"}, {"date": "21 Oct 2015", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC San Diego Health (San Diego, CA) in Jun 2014", "Interview Descriptions": "Applied on LinkedIn and after pre-screen was asked to apply at UCSD. Two phone interviews: one by HR, one by hiring manager. One in person interview with just the hring manager.", "Interview Questions": "About project management and steps.\r\nHow to deal with difficult situations?"}, {"date": "21 Jan 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at UC San Diego Health in May 2014", "Interview Descriptions": "Submitted interview and heard back from them a couple months after original submission. They informed me that a new opening was available and asked if I was still interested. Went in for a quick 20 minute interview and was offered the job the next day. The lady interviewing me was extremely friendly.", "Interview Questions": "Why are you interested in working here? What does our research center have to do with your interests? What are you strengths? "}, {"date": "25 Mar 2014", "title": "Staff Research Associate I Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UC San Diego Health", "Interview Descriptions": "Worked there as an undgrad student, so interview was minimal and looked at grades and classes taken so far.", "Interview Questions": "What can you offer to the lab"}, {"date": "18 May 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at UC San Diego Health (San Diego, CA) in Feb 2014", "Interview Descriptions": "Application submitted online, then after almost 8 months was called for an in-person interview w/ three-person group panel; then required to get clearance of medical/financial background and three references from supervisors/colleagues to submit online recommendation letter/survey. Once completed and approved they determine if you are a strong candidate.", "Interview Questions": "Where do you see yourself i five years?"}], [{"date": "1 Feb 2015", "title": "Internship Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at UC San Diego Health (La Jolla, CA) in Sept 2013", "Interview Descriptions": "Tedious. The interviewer decided half way through to have lunch had to wait to continue my interview for half an hour because she had to keep a promise to a colleague", "Interview Questions": "Could you please give an example of when caregiving is detrimental to the patients well being. Give three examples."}, {"date": "19 Aug 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UC San Diego Health (San Diego, CA) in Mar 2013", "Interview Descriptions": "1- I applied through website, and I got an email two days later to set up a time for phone interview.\r\n2- After phone interview, I got an email to have an on-site interview.", "Interview Questions": "Why did you apply for the internship position?\r\nWhat's you plan after graduation?"}, {"date": "12 Jun 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC San Diego Health (San Diego, CA) in Jan 2013", "Interview Descriptions": "The interview process was smooth and fairly generic. Many of the questions were expected as any behavioral interview would be (i.e. Describe a moment when you displayed ________ .).\r\nThere were other questions concerning the future ambitions of the interviewee, mainly for the sake of ensuring shared interests, though these could certainly be answered by any passionate individual.", "Interview Questions": "For what reason would you resign from our team?"}, {"date": "25 Apr 2013", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at UC San Diego Health (La Jolla, CA) in Jun 2012", "Interview Descriptions": "First, I received an e-mail regarding the lab position.  After replying that I was interested, an initial interview was set up through e-mail.  This correspondence was between me and the project manager, whom I would end up working with/for.  The first interview was about 20 minutes long with general questions pertaining to my resume.  For example, he asked me to elaborate on some of my experiences and also asked me questions you would expect, such as \"describe to me an experience where you had to take on a leadership role\".  After the interview was finished, he told me he would contact me in a couple of days.  Eventually, I received another e-mail and set up a second appointment.  I went thinking that I was going in for a second interview, but had ended up discussing the job functions and focus of research, and ultimately got the job.", "Interview Questions": "The most difficult question pertained to the focus of research that I would be working on.  The question was to describe what I knew about nanoparticles and drug delivery."}, {"date": "3 Jul 2012", "title": "Adminsitration Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at UC San Diego Health (San Diego, CA) in Apr 2012", "Interview Descriptions": "Everything seemed standard however after going through a phone and panel interview, you would expect some feedback regarding why a position was not offered. It seemed a bit unprofessional to require all these steps to just stop the process with no word as to why...", "Interview Questions": "Why do you want to work here?"}, {"date": "18 Feb 2012", "title": "Staff Research Associate I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at UC San Diego Health (La Jolla, CA) in Feb 2012", "Interview Descriptions": "I came in for a 1.5-hour interview (30 minutes with 3 different people) I met each person individually, in the same conference room. Each person was very friendly and had questions to ask me that were relevant to the job. I was able to answer the questions well, and they were impressed enough with me to call me in for a second interview. The second interview was very much like the first, only I spoke with two of the same people from the first interview instead of all three of the previous interviewers. They were again impressed, and I believe I would have gotten the job offer, however I suspect that one of my references said something negative as they ended up choosing another candidate after speaking with him. I have since removed him from my reference list.", "Interview Questions": "What can you bring to our team that we are in need of?"}, {"date": "14 Oct 2013", "title": "Senior Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UC San Diego Health (San Diego, CA) in Jul 2011", "Interview Descriptions": "It takes a lot to get a call for an interview. Very competitive. The hiring process also can take up to 3 months.", "Interview Questions": "Honestly nothing out of the ordinary"}, {"date": "21 Oct 2010", "title": "Nurse Midwife Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UC San Diego Health (San Diego, CA) in Oct 2010", "Interview Descriptions": "initial telephone interview then group telephone interview, additional phone interview with a single member of the interview staff, then in person interview at the medical center.  All very committed to the mission of their department.", "Interview Questions": "Tell us why we can't possibly live without you."}, {"date": "14 Apr 2010", "title": "Bioinformatics Programmer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UC San Diego Health (San Diego, CA) in Mar 2010", "Interview Descriptions": "I sent my resume to the hiring PI of the lab advertising the position. I got a call almost immediately, the same day actually, and we talked about my background and about  the position. Later I had some email contact asking for a list of my publications and references. I never heard anything back after that. It would have been nice to at least get a quick email letting me know that I was not going to be considered further.", "Interview Questions": "I was asked about specific experience with sequencing technology."}, {"date": "4 Feb 2010", "title": "Postdoctoral Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at UC San Diego Health (La Jolla, CA) in Apr 2008", "Interview Descriptions": "I was asked to present my research work, to propose ideas for a future project. It took 1 hour", "Interview Questions": "What is your goal career?"}]]