[[{"date": "N/A", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mount Carmel Health", "Interview Descriptions": "My interview was friendly and laid back but informative. Staff was included in process and shadowing was available same day and follow up days. All my questions were answered satisfactorily. ", "Interview Questions": "What inspires you to be a therapist. "}, {"date": "15 Nov 2022", "title": "MST Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mount Carmel Health", "Interview Descriptions": "Recruiter did an initial intake interview and then I set up an interview with the hiring manager. All questions were about my previous experience and what do I feel I can contribute to MCHS.", "Interview Questions": "Describe a time when I made a mistake and how did I handle it"}, {"date": "30 May 2022", "title": "PFS II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mount Carmel Health (Columbus, OH)", "Interview Descriptions": "Very basic, went really quickly, was interviewed by 2 people… left feeling very unsure.  They were general questions about myself, where I seen myself going/doing.. relevant employment history.  The building itself is quite hard to navigate until you get use to it.", "Interview Questions": "Where do you see yourself growing in this company?"}, {"date": "25 May 2022", "title": "PCU Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Mount Carmel Health", "Interview Descriptions": "Had a short phone screen with HR to schedule for interview. Interview was very short and easy . The nurse manager was laid back and easy to talk to . I got to shadow with a nurse for about an hour . I got an email 2 hours later with an offer.", "Interview Questions": "Tell me about your self"}, {"date": "4 May 2022", "title": "Collections Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mount Carmel Health", "Interview Descriptions": "The interview process was very laid back. The manager made the interview feel more like a conversation and that helped ease any nerves. After the initial interview there was an interview with the team lead and that was also very laid back. He basically just went over the job description and the hours and asked alot of behavior questions.", "Interview Questions": "How would you handle an upset caller?"}, {"date": "3 Feb 2022", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mount Carmel Health", "Interview Descriptions": "It seemed like the recruiter waited until the phone screening to look over my CV. The interview was essentially over when they realized I didn’t have prior experience in the particular patient area they were hiring for - which is totally fine - but they could have saved their time, and mine, if they had reviewed my application materials first?", "Interview Questions": "Explain your experience, why MCH, why pharmacy"}, {"date": "24 Nov 2021", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mount Carmel Health (Columbus, OH)", "Interview Descriptions": "The process was great and hiring was able to get back to  me promptly. Human Resource lady was very generous y brought out the entire process and she was always easy to communicate with,  she answered emails/phone calls.", "Interview Questions": "Why do I want to work for Mt Carmel health system? What will bring to the table "}, {"date": "2 Oct 2021", "title": "Xray Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mount Carmel Health", "Interview Descriptions": "Easy, painless process. They asked a couple questions about you and what you expect about the job and what you can anticipate when working there.  Very friendly. When finished they take you around and show you the place and introduce you to the people working there.", "Interview Questions": "What is your spirit animal"}, {"date": "1 Aug 2021", "title": "Multi Skilled Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Jul 2021", "Interview Descriptions": "Applied and got a call back to interview a week later. Set up time for the interview. Interview went well I was hired on the spot. Started my training 2 weeks later.", "Interview Questions": "What three words would others use to do describe you? "}, {"date": "9 Jun 2021", "title": "Mst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in May 2021", "Interview Descriptions": "I put my application in on the website. A few days later I got a text from one of the HR ladies to set a phone screen. After speaking with her about my basic history and what I thought I would like she matched me with the nurse manager from the floor I picked. She set me up an interview the following week on WebEx with the nurse manager. The nurse manager was very nice and answered all my questions. After about a week and a half I got another text from HR asking to speak later that day. She informed me I was offered the position and went over the next steps with me. It was super simple and quick.", "Interview Questions": "What was your favorite floor working at your previous hospital and why? (I was in float pool at my former hospital)"}], [{"date": "28 Nov 2020", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mount Carmel Health", "Interview Descriptions": "Phone interview then in person interview a few days later that included a hospital tour.  Talk about experience and career goals within the profession.  The interview included 3 people, HR, lead RRT for two different units.", "Interview Questions": "Explain your experience in the respiratory care field "}, {"date": "4 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Mount Carmel Health (Columbus, OH) in Nov 2020", "Interview Descriptions": "Received email from Mount Carmel HR department. Schedule initial phone interview with HR. Talked about my interests and scheduled interview with hiring manager. Received job offer less than a week later.", "Interview Questions": "What area are you interested in?\r\nTell me about your experience.\r\nWhere do you see yourself in the future. "}, {"date": "22 Jun 2021", "title": "Patient Financial Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mount Carmel Health in Sept 2020", "Interview Descriptions": "Applied online. 15-minute phone interview with a recruiter to discuss job hours and my background. Zoom interview completed with the hiring manager. Received offer within a few days. The interview itself was mostly about my background, situation questions on customer service, and general job description overview.", "Interview Questions": "Explain a time you had to deal with a difficult situation at work and how you handled it.\r\n\r\nWhy do you want to work here?\r\n\r\nDo you feel comfortable asking for money?"}, {"date": "7 Jan 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mount Carmel Health", "Interview Descriptions": "Very short. Only asked a couple of questions and mostly explained what the job would entail and duties of RN. Then shadowed on the floor for about 30 minutes, which was nice because I got to meet a couple of people and talk with another nurse about how she liked the floor.", "Interview Questions": "Why would you like to work on this specific floor?"}, {"date": "16 May 2019", "title": "Patient Financial Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mount Carmel Health", "Interview Descriptions": "Applied online, got a screening interview over the phone from a contract company that mount Carmel hired. Then a week later I got an email from the hiring manager asking to come in for an interview. Interview went well and basic questions were asked. Still going I get a call back to work there.", "Interview Questions": "Why do I want to work at Mount Carmel?"}, {"date": "29 Nov 2018", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Mount Carmel Health in Nov 2018", "Interview Descriptions": "Applied online, and had a phone interview the next day. She then called me in for an interview which was with the director, my prospective manager and another member of the team. We had Q&A for about 40 mins then I was given a tour of the facility. After that, she asked me to come back and shadow. HR contacted me later on in the day and offered me the position.", "Interview Questions": "How do you deal with stress?"}, {"date": "17 Oct 2018", "title": "Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Mount Carmel Health", "Interview Descriptions": "I saw an opportunity and reached out to the contact recruiter, asking for a 15 minute \"introduction call\" ..... I never heard back.   I subsequently was able to connect with a senior executive, who said that I would be contacted ..... the recruiter never contacted me.\r\nPoor experience all round.", "Interview Questions": "N/A"}, {"date": "19 Apr 2022", "title": "Advanced Practice Provider Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Mar 2018", "Interview Descriptions": "They have no clue how to utilize midlevels and will treat you like a scribe. Raises are given to all employees regardless of how poorly they do their job.  They must be on a hiring freeze because they are not replacing any support staff lost or adding additional providers", "Interview Questions": "What do you know about XYZ specialty"}, {"date": "16 Apr 2018", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Mar 2018", "Interview Descriptions": "I applied online and received an email 3 days later for an interview. Then a week after interview I received a call from HR giving an offer.  Interview in mid March start in Mid April.", "Interview Questions": "What are your weaknesses?"}, {"date": "9 Feb 2018", "title": "Occupational Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Feb 2018", "Interview Descriptions": "Applied online through Encompass Health. Recorded an online interview. Was then asked to provide an updated resume. Was contacted by the hospital for an in-person interview. Was offered the job.", "Interview Questions": "Describe your experiences on your resume "}], [{"date": "13 Feb 2018", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Jan 2018", "Interview Descriptions": "Apply threw indeed. Then threw company site was called about 1 week later for interview. Interviewer was very nice and professional. All together it took about 4 weeks just had to be patient but it do pay off. So excited.", "Interview Questions": "Why do you want to work here "}, {"date": "19 Aug 2020", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mount Carmel Health (Columbus, OH) in Jan 2018", "Interview Descriptions": "HR call, panel interview, administrator interview- all very comfortable . Panel interview consisted of situational interview questions after the “getting to know you” questions.  Other interviews were more conversational . Pleasant experience overall.", "Interview Questions": "What would you do in this situation...\r\n\r\nTell me about a time that you...."}, {"date": "4 Nov 2017", "title": "Instrument Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Mount Carmel Health (Columbus, OH)", "Interview Descriptions": "The interview was a typical interview and not too intimidating. Same why did you choose our company and tell me about your self questions. The manager was really nice. I was giving the option to shadow team members to make sure this was what I wanted to do BEFORE the decision was made. They were very nice and welcoming as well.", "Interview Questions": "Tell us about your self."}, {"date": "11 Dec 2017", "title": "Phlebotomist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Mount Carmel Health (Columbus, OH) in Nov 2017", "Interview Descriptions": "Applied online for multiple positions, and it took almost a month for someone to call. I had an interview, and they said they'd call in 1-2 weeks. Never received a call, reached out to a recruiter and left a message asking what the status was, and 2 min later  received and e-mail saying they will continue looking for other candidates. Also, their body language had already indicated they didn't want me as a candidate.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "15 Sept 2017", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mount Carmel Health (Columbus, OH) in Sept 2017", "Interview Descriptions": "The interview process was easy with basic concerns about providing care for patients. I received an email asking for my availability to talk to a HR representative and a few days later I received the phone call. I was then called back to a in person interview.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "30 Sept 2017", "title": "Patient Financial Services Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mount Carmel Health (Westerville, OH) in Sept 2017", "Interview Descriptions": "Completed a phone interview with a recruiter after applying for the position. A couple weeks after that, I had an in-person interview. I was asked to come back and shadow after the interview was completed.", "Interview Questions": "What do you know about Mt Carmel?"}, {"date": "27 Oct 2017", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Aug 2017", "Interview Descriptions": "HR contacted to schedule interview.  Had to call two more times that week to get HR to respond back, and got interview scheduled.  Met with Manager of department, and then shadowed in department.", "Interview Questions": "What is one of the most difficult things I had to do in my career and how did I handle it."}, {"date": "27 Jul 2017", "title": "Lead Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mount Carmel Health (Columbus, OH) in Jul 2017", "Interview Descriptions": "Inexperienced manager interviewing. He didn't have any direction on his questions and wasn't very prepared. The place seems disorganized. I also interviewed with an executive that same day and she talked so much that I barely got a word in edgewise. Building was very old. Seemed like a pressure-cooker personality environment and I was planning on turning down any offer following this interview.", "Interview Questions": "I'm trying to get an idea of how good your problem solving skills are. Could you explain more about that?"}, {"date": "18 Jun 2018", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Jul 2017", "Interview Descriptions": "It was a round table interview and it lasted about 2 hrs.  They described the position and the responsibilities.  Met with the Director and Manager of both departments.", "Interview Questions": "Why the person left previously"}, {"date": "6 Mar 2017", "title": "Middle Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mount Carmel Health", "Interview Descriptions": "One phone interview and two face-to-face interviews.  The last one was a group interview in front of about 6 or 7 people.  Pretty thorough but not grueling.  Also had to take a couple of online \"tests\" to assess technical skills.", "Interview Questions": "Mostly standard \"behavioral interview\" questions.  Describe a challenging situation & how did you handle it.  What's your greatest accomplishment?  When you're really busy, how do you decide what to focus on first?"}], [{"date": "1 Dec 2020", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mount Carmel Health in Mar 2017", "Interview Descriptions": "Interview process took 15 minutes. Very quick, basic interview questions. Nothing you should be intimidated about. Very good starting job to get your foot in the door in the hospital industry.", "Interview Questions": "How do you manage your time?"}, {"date": "26 Sept 2018", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mount Carmel Health (Columbus, OH) in Mar 2017", "Interview Descriptions": "Quick and accommodating to my schedule. Worked to get me in for the interview in a timely manner and everyone was very pleasant and professional. Very fast follow-up from human resources. Did not waste anytime in making a decision.", "Interview Questions": "typical questions"}, {"date": "30 Dec 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Mount Carmel Health (Columbus, OH)", "Interview Descriptions": "A day after completing an app online, I received a call and interviewed.  I was then scheduled for another phone interview which was pointless. HR recruiter only called to say the date and time of the in person interview. After I interviewed it was a 4+ week process. Too long.  The background check was extensive and they call everyone on your application and ask questions so be ready. Its as if your working for the FBI.", "Interview Questions": "Why would you like to work for Mount Carmel?"}, {"date": "19 Oct 2016", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Mount Carmel Health", "Interview Descriptions": "A few days after applying, I was emailed to set up a phone interview. A few days later I had a phone interview that lasted about 10 minutes. I was contacted by HR after that to do a follow up. About a week later I had an interview with the managers for the position. I waited 6 days until I got a phone call from HR offering me the position.", "Interview Questions": "why do you want to work for mount carmel?"}, {"date": "15 Jun 2020", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Oct 2016", "Interview Descriptions": "It was quick and to the point. I enjoyed the one on one interview process.  The supervisor asked questions that were not so generic but more about my skills and what I could bring to the company.", "Interview Questions": "What could you do to help us with your growth in the company? "}, {"date": "20 Sept 2016", "title": "Staff RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mount Carmel Health (Columbus, OH)", "Interview Descriptions": "About 30 minute interview with hiring manager, plus a 20 min shadowing. I was told I would get a response by a certain date and it was almost 2 months before I was told no, and hiring manager that I interviewed with did not reply to email.", "Interview Questions": "What would be a negative quality a past supervisor would say about you?"}, {"date": "16 Nov 2016", "title": "Patient Financial Specialist I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Mount Carmel Health (Columbus, OH) in Sept 2016", "Interview Descriptions": "I applied online to MCE and got an email for a phone interview the next day. Phone interview was horribly unprofessional and I actually landed my in-person interview due to this fact. Two weeks later I had an interview at MCE with 2 people interviewing me. At the end I was told I would get a call by the following Friday. Call never came. I emailed the email address on the business card the man gave me and someone else that works at MCE emailed me back and said I had the wrong person, despite the email being exactly what was on the business card I was give post interview. I proceeded to call the number to follow up and left a voicemail for my interviewer (a month later). He never called me back. I think it is very unprofessional to provide false info to an interviewee and to never call and provide closure either way. I interviewed on 9/15 and was told 11/15 via the online application that I was not chosen. Never did get a call.", "Interview Questions": "Are you comfortable asking people for money?\r\nWhat schedule are you available?\r\nGive us an example of a time you had to work with someone difficult and how you handled it.\r\nWhat is your biggest fear with this job?"}, {"date": "24 Aug 2016", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Jul 2016", "Interview Descriptions": "I received phone call second day after submitted application online. I got a phone interview 2 days after applied online. Processing time 4 more weeks. Still waiting for response and Check the status often....", "Interview Questions": "Most challenging work, why choose mount carmel."}, {"date": "20 May 2019", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mount Carmel Health (Westerville, OH) in Jul 2016", "Interview Descriptions": "Hiring process was fast and easy. The management was easy going and fun to talk to and not at all intimidating. Their questions weren’t tricky and they seemed to genuinely want to get to know you as a person before hiring.", "Interview Questions": "Why do you want to work at st Ann’s "}, {"date": "3 Dec 2017", "title": "Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mount Carmel Health (Columbus, OH) in Jun 2016", "Interview Descriptions": "I was apply for Mount Carmel Health for accountant position. But when I went to the interview, I realized it was for insurance department.  I was start with 2 phone interviews. Then face to face group interview.", "Interview Questions": "why you would like work with Mount Carmel "}], [{"date": "25 Apr 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Apr 2016", "Interview Descriptions": "I got a phone call about a week after I put in my app. Then I had a phone, and then a 1 on 1 interview and by the next week I was offered a job", "Interview Questions": "What assets would you bring to this company?"}, {"date": "11 Apr 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mount Carmel Health (Columbus, OH) in Apr 2016", "Interview Descriptions": "Fairly easy, very laid back. Made me feel comfortable and eager to work at Mt. Carmel East. Basically was hired on the spot. The clinical manager called me within two hours of the interview to ensure that I could work the hours for the position in which she was about to submit. Currently awaiting a call back from HR with offer.", "Interview Questions": "Do you have experience?"}, {"date": "1 Jan 2016", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mount Carmel Health in Dec 2015", "Interview Descriptions": "I completed a phone interview with my prospective manager and another person, then was invited to an on-campus interview. The interview panel was an interdisciplinary team I would be working with. Overall, I enjoyed the experience.", "Interview Questions": "What would you do if a patient threatened to commit suicide?"}, {"date": "2 Jan 2016", "title": "Licensed Practical Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mount Carmel Health (New Albany, OH) in Dec 2015", "Interview Descriptions": "The interviewer was professional and polite throughout the interview.  The interview was on time and not to long.  The interviewer asked questions about my background and experience and how the facility worked.  I feel that if you don't get the job they should send you a notification explaining that they went with another qualified candidate; that would be more professional than sitting around waiting for a reply.", "Interview Questions": "Why do you want to work for this company?  "}, {"date": "22 Jan 2017", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Oct 2015", "Interview Descriptions": "I submitted an application, got a call to schedule an interview. I went for my interview then they called my references. After that they decided whether or not to hire me.", "Interview Questions": "How would you balance work and school life?"}, {"date": "6 Dec 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mount Carmel Health (New Albany, OH) in Sept 2015", "Interview Descriptions": "I went to the floor and waited to be escorted to the interview. I met with the unit manager as well as the director.  Questions were the same typical questions asked during nursing interviews.I went into the directors office and was asked multiple questions.  I was then taken on a tour of the unit.", "Interview Questions": "Name a time when you had an issue with a coworker and how did you handle it?"}, {"date": "2 Jun 2018", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Aug 2015", "Interview Descriptions": "Quick and easy. Just be yourself. \r\nThey usually have all the supervisors in the interview with you, it may seem overwhelming. But it’s easier for them to do it that way.", "Interview Questions": "How do you handle conflict with peers"}, {"date": "3 Dec 2015", "title": "Emergency Department Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mount Carmel Health (Grove City, OH) in Jul 2015", "Interview Descriptions": "It was a lengthy interview. Involved nursing management as well as administration. Several questions were asked about values and team work rather than clinical experience. Was given a tour at the end of the interview and met some of the staff. Very well rounded and friendly interview. It was all around a good experience and great interview. Not only did they learn about me but I also learned a lot about the company and management.", "Interview Questions": "What will you bring with you to this company?\r\nHave you worked in an environment with many changes? How did you adapt?"}, {"date": "9 Mar 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Jun 2015", "Interview Descriptions": "I was given a over all review of the facility and the company's vision, mission and goals. I was given a tour to the facility and meet with the staff. My interview ended up being 2 hours long and he pretty much made his decision after speaking with me and the rest was history.", "Interview Questions": "How well do you do with pressure?"}, {"date": "28 Apr 2015", "title": "Patient Financial Specialist I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Apr 2015", "Interview Descriptions": "Mount Carmel West Hospital - The interview was decent! They were friendly and seemed down to earth! One interviewer would ask the second did she know this or that about MCH, and the second interviewer would say no! That was odd considering both were in management positions and should know the company and its culture! Basically, the position is to register patients and meet a collection goal every month! 10 hour, night shift. Not really comfortable asking people for their money whether they have it or not!", "Interview Questions": "Typical questions based on personality and what would you do in this or that situation!"}], [{"date": "2 Jun 2015", "title": "Multi Skilled Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mount Carmel Health (Columbus, OH) in Mar 2015", "Interview Descriptions": "Very informal, typical questions you would expect in an interview (describe yourself in three words, etc.) I would still wear shirt and tie and be prepared, but for the most part they were very easy questions. Don't be afraid to take a minute to respond to the questions or ask to come back to them later in the interview, the nursing managers that interviewed me were both very friendly and understanding.", "Interview Questions": "Why do you want to be in healthcare?"}, {"date": "5 Dec 2017", "title": "Ekg Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Sept 2014", "Interview Descriptions": "It was fast. I applied online and got a call after a week for a personalninterview with the manager. Then, I got hired within a week. You need to shadow for one day so that they'll be able to tell if you fit the job. They have a week of training and you need to pass the test to be able to work there.", "Interview Questions": "Why would we hire you?"}, {"date": "24 Jun 2014", "title": "Laboratory Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mount Carmel Health (Columbus, OH)", "Interview Descriptions": "I waited about 3 weeks after i turned in my resume to get a call for an interview. I felt like the interview went well. I guess I was wrong bcuz I never got a call back.      Kind of unprofessional in the since that I was 30 min early and they were late by 15 min. They almost didn't find my paper work for my interview...... Kind of like they almost forgot I had an interview for that day.", "Interview Questions": "What would you do if you seen someone pouring blood from one tube to another. I think I answered this question wrong,"}, {"date": "24 Jan 2014", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Mount Carmel Health", "Interview Descriptions": "Long Process, had to apply multiple times before even had an interview, had attended job fairs where the company was present- with no results.", "Interview Questions": "Why do you want to work HERE??"}, {"date": "5 Aug 2016", "title": "Patient Account Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Aug 2013", "Interview Descriptions": "Typical hiring process. However medical records of vaccinations are required for ALL potential colleagues.  When offered the job, it is thru a recruiter and most communication is conducted via email.", "Interview Questions": "What made you interested in our company?"}, {"date": "12 Aug 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Mar 2013", "Interview Descriptions": "Detailed internet questionnaire followed by intense interview and shadowing.  Overall it moved slowly but progress was made between the HR recruiter and dept head. It was very professional and non-threatening.", "Interview Questions": "N/A"}, {"date": "18 Mar 2014", "title": "Maintenance Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mount Carmel Health (Columbus, OH) in Dec 2011", "Interview Descriptions": "Group interview with peers and HR present, then group interview with supervisors and director with HR present. Job offer a few days later, no real pay negotation", "Interview Questions": "trade specific questions about electrical systems, plumbing systems, where do you expect to be in 5 tears"}, {"date": "24 Jun 2012", "title": "Resident Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Mount Carmel Health (Columbus, OH) in Dec 2011", "Interview Descriptions": "Submitted my application through the ERAS application system, was offered an interview by phone, I accepted the interview, and I learned that I matched at Mount Carmel Health", "Interview Questions": "Why do you want to come to Columbus, OH"}, {"date": "12 Jul 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Mount Carmel Health (Columbus, OH) in Oct 2011", "Interview Descriptions": "Discussion with HR over the phone regarding the unit manager I would be interviewing with. On that particular floor they also have you shadow a nurse and then following that complete a peer interview. That does add some pressure, however allows you to ask staff questions and catch them mid-shift to get a feel for how their day is going.", "Interview Questions": "Strengths and weaknesses"}, {"date": "7 May 2014", "title": "Medigold Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in May 2011", "Interview Descriptions": "Pretty straight forward interview, they promise you the world to get you in. Once you are in they introduce you to everyone who eventually will back stab you later. The training is a joke, orientation about the same. I cannot emphasize how bad the benefits package is. If you are flipping burgers at Mcdonalds, stay there..TRUST ME.", "Interview Questions": "Do you really want to work for us?"}], [{"date": "26 Aug 2011", "title": "Organizational Learning & Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Mount Carmel Health (Columbus, OH) in Jan 2011", "Interview Descriptions": "Received a phone call from an HR representative who appeared excited to speak with me given my specialized educational background. Met initially with the HR generalist and department manager.  Went on to meet with the rest of the group in a panel-type interview.  All were quite knowledgable and seemed friendly and non-confrontational.  Was disappointed when I didn't hear back from anyone, including the HR generalist.  Discovered that they \"went with other more qualified candidates\" when I checked the status of the position online (although the position was still being advertised).  Felt that was extremely unprofessional.", "Interview Questions": "Describe a situation in which you advocated for change.  How did you go about it? What was the result?"}, {"date": "11 Nov 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Mount Carmel Health (Akron, OH) in Jan 2011", "Interview Descriptions": "Panel of IDT members, with each member from different level on a scale in reference to what each person did to provided optimal patient care. Many on spot question that required thought and detailed answers for situation that were very challenging. I overheard after  being hired a discussion among management with reference to not wanting to employee people in this department that were over confident in interview as they seen this as Cocky and not a team player.", "Interview Questions": "All behavior based on scenarios"}, {"date": "16 May 2013", "title": "Laboratory Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mount Carmel Health (Columbus, OH) in Aug 2009", "Interview Descriptions": "Easy and laid back", "Interview Questions": "There was none"}]]