[[{"date": "9 Apr 2023", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Campbell University", "Interview Descriptions": "I heard back about a month after turning in my application. Received a phone call and then had an in person interview on campus. Overall very average and typical interview process. Personally I prefer in-person over phone call or zoom!", "Interview Questions": "Mostly situational questions pertaining to my experience."}, {"date": "6 Jan 2022", "title": "Director of Student Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Campbell University (Buies Creek, NC) in Oct 2021", "Interview Descriptions": "The interview committee was very timely and clear in all communications both in preparation for the interview and in follow-up.  The interview was scheduled promptly after submitting application materials, and I heard back within two weeks about their decision.", "Interview Questions": "How would you support a student who felt that they were being treated differently based on their race or gender?"}, {"date": "16 Mar 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Campbell University", "Interview Descriptions": "The interview process was really straight forward. I was asked to talk about myself and my experience. I was also asked why I felt I was good fit for the position.", "Interview Questions": "N/A"}, {"date": "15 Oct 2020", "title": "Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Campbell University (Fayetteville, NC) in Oct 2020", "Interview Descriptions": "Interview process was long due to having to schedule everything remotely. No fault of theirs....just the times we are in. There were 3 interviews which covered a spectrum of technical, personal and situational questions. At no time was I uncomfortable. In fact they made me feel like part of the team from the start. Each interview seemed to carry over the scheduled time which I enjoyed.", "Interview Questions": "How did I handle a situation where a coworker and I didn't get along?"}, {"date": "26 Nov 2019", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Campbell University", "Interview Descriptions": "meet with the leadership team, questions and answers, lunch with a group of people including students, did one presentation for an hour, also did campus tour and work space tour", "Interview Questions": "Why do you apply for this position"}, {"date": "5 Nov 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Campbell University (Buies Creek, NC) in Sept 2019", "Interview Descriptions": "email, then interview process through in person interview with one person that went over guidelines and rules for working and some of the things I would be doing in the job", "Interview Questions": "What are your future goals from this job experience?"}, {"date": "13 Oct 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Campbell University", "Interview Descriptions": "During and after my successful completion of General Chemistry I and II, along with the respective labs, I approached the lab manager about my interest in working as a student worker in the lab the following year. The manager kept me in mind while emailing students about the positions; I received an email about it during the summer. I responded, and we set up a phone call to talk about the job and what it entailed.", "Interview Questions": "Will you have time to work in the lab as a student worker? Ar you interested in the position?"}, {"date": "21 Jun 2016", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Campbell University", "Interview Descriptions": "The interview process is very fast. There are some minimum requirements you have to meet. If you meet them, you will most probably get hired. You just have to go to the person in charge and ask her for more information.", "Interview Questions": "What would you like to tutor?"}, {"date": "1 Jun 2020", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Campbell University (Buies Creek, NC) in Jan 2016", "Interview Descriptions": "Two-round interview. The first part was a phone interview where they try to get to know you and determine if you are qualified. The second portion is an in-person interview with the lead of the department and supervisor to make sure you'll fit with the team.", "Interview Questions": "What is your greatest weakness?"}, {"date": "9 Oct 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 6 days. I interviewed at Campbell University (Buies Creek, NC) in May 2015", "Interview Descriptions": "It was simple. The questions were mostly behavior based. The supervisor asked  me basic biology questions and explained me my duties and everyday work. We talked about the pay and weekly meetings.", "Interview Questions": "If you have been assigned work which may not be completed before the given deadline, how would you handle the situation?"}], [{"date": "21 Mar 2017", "title": "Sports Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Campbell University (Buies Creek, NC) in Aug 2013", "Interview Descriptions": "It was a good overall process. They didn't drag out the process and got through the 1st round quickly. On campus interviews took a bit, but that's to be expected. Overall it was real smooth", "Interview Questions": "Tell us about yourself"}, {"date": "10 Jun 2015", "title": "Reference Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Campbell University (Buies Creek, NC) in Aug 2012", "Interview Descriptions": "It was very straightforward. not a typical interview more of just a \"yes you got a job\" or \"no you didn't\". Its all based upon whether or not their is a shift available.", "Interview Questions": "Why work here?"}, {"date": "9 Jan 2014", "title": "Admissions and Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Campbell University (Morrisville, NC) in Jun 2010", "Interview Descriptions": "Hiring process was very easy. An employee referral is a good method for quick consideration as is constant call backs to check up on status. Usually there will be a panel discussion at the interview. Interviewers are on target with questions about you and the job requirements. You are never presses for an answer and the atmosphere is relaxed. A decision is fairly quick within a week.", "Interview Questions": "All questions very generic and easy. No gotcha moments."}]]