[[{"date": "27 Jun 2023", "title": "Call Center Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI)", "Interview Descriptions": "Panel interview and Team meet- sat down with the team and then created a job aid to show my understanding of the process. I then had to present it to the team as if I was the trainer", "Interview Questions": "Call center exp as it relates to this job"}, {"date": "2 Apr 2023", "title": "Anesthesia Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at Spectrum Health (Grand Rapids, MI) in Mar 2023", "Interview Descriptions": "Asked basic interview questions and explained the job roles. I was luckily offered the job on the spot resulting in them asking for my next availability and created a schedule.", "Interview Questions": "Q: Tell me something interesting about yourself?"}, {"date": "24 Jan 2023", "title": "Nursing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "Very organized and professional. Interviewed with the Resource Department a while back, and everyone was very kind and follow-ups were easy to follow. It’s a two step process that includes phone screening and then one on one interview with a nursing manager.", "Interview Questions": "Why should we hire you?"}, {"date": "5 Jan 2023", "title": "Onboarding Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "It was great and very informative. Answered all my questions and explained all the steps. They also talked about opportunities to advance within the company after a period of time.", "Interview Questions": "What are my experiences that relate to this position?"}, {"date": "4 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI) in Nov 2022", "Interview Descriptions": "There was a phone interview and then the recruiter sent off your information to the hiring staff. It was a virtual panel interview with the resource recruiter, and the day shift supervisor and night shift supervisor. It lasted about 30 minutes.", "Interview Questions": "Why I was interested in the position on their unit?"}, {"date": "14 Nov 2022", "title": "PSR I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI) in Nov 2022", "Interview Descriptions": "Virtual very easy, on time, worked around my schedule, detailed about position ask me questions based off my past work experiEnces. Asked me why would I be ideal candidate for position.", "Interview Questions": "How would my best friend describe me"}, {"date": "22 Oct 2022", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Spectrum Health", "Interview Descriptions": "Two interviews, one with the hiring manager and one with the Senior Director. I did get called by the hiring manager to apply because I already had a connection with him. Hence why I skipped the TA a interview.", "Interview Questions": "What is one thing you would change or add to this team's communication plan?"}, {"date": "5 Oct 2022", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "It went smoothly. Started with applying online then invited for in person interview. Standard interview questions and time for questions at the end. Reviewed benefits. I met with nurse manager and also got a tour of the unit.", "Interview Questions": "Tell me about yourself. Tell me about a time you worked on a team."}, {"date": "21 Sept 2022", "title": "Senior Level Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Spectrum Health", "Interview Descriptions": "Was contacted by a recruiter. Went through vetting and interview process. Was told I was too senior and was asked to justify in writing why I wanted a position that was a step down. After I provided a thoughtful response to their questions, never heard back and got no feedback from recruiter. They reached out to me and then were pretty insulting. and then ghosted me. All in all zero stars, would not recommend.", "Interview Questions": "Why do you want to work here"}, {"date": "12 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "Interview with recruiter over the phone for about 30 minutes. Asked basic questions and went over my resume. Second interview with unit manager followed by job shadow for a couple hours.", "Interview Questions": "Tell me about yourself and your experience"}], [{"date": "12 Sept 2022", "title": "RN Clinical Care Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health", "Interview Descriptions": "Phone Screen with Recruiter then forwarded to hiring manager. Two person panel for Teams meeting w/hiring manager. Very engaging and thoughtful questions. I felt that they really wanted to get to know me as a person and not just hear about my work experience. Even though I rated the interview as difficult, it was not unpleasant. I considered myself to be well prepared and still had to pause a few times and gather my thoughts before answering. ", "Interview Questions": "What are your standards for success?\n"}, {"date": "30 Aug 2022", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "Phone call screen asking about experience, expectations, and salary requirements. Then had in person second interview where we went over general questions and scenarios working with customers and coworkers and how I navigated certain situations.", "Interview Questions": "How have you handled an upset customer in a previous position?"}, {"date": "23 Aug 2022", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health", "Interview Descriptions": "The process was fairly typical.  I had one phone screening call from the HR department, and then I was scheduled for an onsite interview with the hiring manager and also another team member.", "Interview Questions": "Mostly asked about prior experience.  Also sone questions around current challenges, and my thoughts on them.  I appreciated that."}, {"date": "10 May 2022", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "Sent in application. Received email asking to set up an interview. Was a 15 minute phone interview. Asked basic interview questions. Said they’d let me know and emailed me within a week.", "Interview Questions": "Tell me about a time you overcame a problem"}, {"date": "3 Aug 2022", "title": "Patient Services Rep Assoc, Part Time Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health in May 2022", "Interview Descriptions": "If they are interested you will have a phone screening and then if they approve you will have an in-person interview. However, I never was told I was no longer in consideration for the role. I was surprised by how unprofessional they were for not giving me any update.", "Interview Questions": "Why are you interested in this position?"}, {"date": "9 Oct 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Spectrum Health in Apr 2022", "Interview Descriptions": "I received a phone interview followed by meeting with a person at the hospital and we talked about wages and previous work experience it was pretty easy and laid back", "Interview Questions": "What is your previous work experience"}, {"date": "25 Mar 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "1) Phone Screening that discusses the job, expectations and slightly touches upon your resume.\r\n2) Schedule an interview with the hiring staff and they have about 30-45 minute interview with you.", "Interview Questions": "1) Tell us about yourself \r\n2) How have you navigated conflicts when working on a team?\r\n3) What research projects have you worked on, and what did you learn from the research?\r\n4) Tell us about a time you failed."}, {"date": "31 Oct 2022", "title": "Summer Internship Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health in Mar 2022", "Interview Descriptions": "Friendly interview environment. Basic behavioral questions. Two rounds, the first is a phone interview about 30 min and the second one is interviewing with the teams take 30 min per team.", "Interview Questions": "Tell me about yourself. Why Spectrum Health?"}, {"date": "9 Mar 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Spectrum Health in Mar 2022", "Interview Descriptions": "You will be asked to describe yourself. Then you will be asked situational questions asking the typical explain a time when... and asking about future and goals. Interview lasted about 20 minutes.", "Interview Questions": "Please tell me about yourself."}, {"date": "11 Feb 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health in Feb 2022", "Interview Descriptions": "It was a relaxed interview.  It was not a panel of people, just one manager interviewing me.  She was friendly and made me feel less anxious. It lasted approximately one hour.", "Interview Questions": "Tell me about a situation in which you exceeded the patients expectations."}], [{"date": "3 Apr 2022", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Jan 2022", "Interview Descriptions": "I had a virtual interview. It was with two individuals who would be my supervisors. I was actually offered the job on the spot. I felt comfortable during the interview process and was able to ask any pertinent questions.", "Interview Questions": "They asked about my schedule and when I would be available."}, {"date": "19 Dec 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Spectrum Health", "Interview Descriptions": "calculated and normal questions. What would you do in situations. initial interview with a talent manager, then individual unit management. they will give you a tour and usually will be just with manager or manager and sup.", "Interview Questions": "if you were in a situation where.... what would you do.\n\nname a situation where you were uncomfortable, what did you do to resolve the situation. \n\nname a situation where you see someone doing something incorrectly, how do you deal with that situation "}, {"date": "1 Jan 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Dec 2021", "Interview Descriptions": "The interview process went well. They will first screen you then they will reach out for an interview if they have an interest. They asked the basic questions such as describe a hurdle that you overcame during a project. Another was what is the value of diversity.", "Interview Questions": "describe a hurdle that you overcame during a project"}, {"date": "4 Mar 2023", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health in Nov 2021", "Interview Descriptions": "It was an easy process overall. There were only 2 interviews. There was 1 phone interview with a recruiter. If the recruiter liked you, then they sent your info to the hiring manager at Spectrum for 1 virtual interview with camera on.", "Interview Questions": "How do you handle stress?"}, {"date": "2 Oct 2021", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "I received a phone interview but am still waiting for a callback. Wondering how long it usually takes to hear back? My application status still shows \"In Progress\" after what seems to be a month", "Interview Questions": "Asked about Work history and reason for wanting the job"}, {"date": "24 Jun 2023", "title": "Material Handler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI) in Oct 2021", "Interview Descriptions": "Quick and easy phone interview. Asked great questions and asked me about myself not just work history. Explained the hiring process well and gave great instructions on where to go for onboarding.", "Interview Questions": "What do you currently do for work?"}, {"date": "22 Sept 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "Overall process for interview was relatively streamlined, no trick questions, just a casual conversation about goals and areas one would like to work in. Overall a very pleasant experience. The interviewer was keen to understand where I felt my place was and what tools I thought necessary to do the job well", "Interview Questions": "Name a skill you are good at and something you are bad at"}, {"date": "22 Sept 2021", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "The interview process proved to be Easy and comfortable however it was very misleading. Based on the interview I did not realize I was getting into what I actually got in to working at this place.", "Interview Questions": "What kind of notes I am used to entering "}, {"date": "10 Sept 2021", "title": "Med Tech/Microbiologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "Very complimentary,  Easy to work with, in stressful times. 3.6 out of 4 score. Works hard, Always on time.  Works extra when called on.  Good attitude.  Team player. Helps solve difficult problems.", "Interview Questions": "How do you get people who are science minded to work together and keep employees satisfied?"}, {"date": "25 Sept 2021", "title": "Site Support Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Sept 2021", "Interview Descriptions": "Interviewed with two Managers and two Directors. On a Team's call with them all asking one question each. The interview lasted about 45 minutes and was more of brush off interview. Oh well that how it goes sometime.", "Interview Questions": "What technology has been revolutionary to the Healthcare industry."}], [{"date": "30 Dec 2021", "title": "Requirements Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Spectrum Health in Sept 2021", "Interview Descriptions": "Once your application gets picked up by HR you get screened by them then passed onto the hiring manager. They say that the hiring manager must contact you within 7 days. This didn't happen with either job that I applied for. The first one they at least did follow up, and the second one instead of any contact they just changed my application to \"no longer being considered\" and I guess decided they'd never follow up again - even though I was qualified for the position.\r\n\r\nEveryone that I spoke to for the Requirements Analyst position was very cordial, but they misrepresented the position in the job description. It wasn't an agile position, it was a Business Analyst position, even though they didn't name it as such. Even with several proceeding interviews before the technical one I never understood that from them. So I got into my final interview and was bombarded with technical questions that I had no way of answering because I had no background as a Business Analyst. My experience is as an Agile Product Owner and Scrum Master.\r\n\r\nAfter that horrible interview, I expected to never hear from them again. Funny enough they called me and offered me the position as a regular Analyst instead of Senior. They knew my pay requirements and decided to offer me $25,000 less than I asked for, which would mean a significant pay cut from what I'm even currently making.\r\n\r\nI wanted to hold off on leaving this review to see if it was a fluke, but then I got ghosted again for a Scrum Master position (one that I am much more qualified for) and didn't hear back from the recruiter until I followed up myself. I was then informed they decided to hire internally.", "Interview Questions": "Many technical questions about Business Analyst topics (asking me more or less to define terms)."}, {"date": "2 Apr 2022", "title": "PRN Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Spectrum Health in Jul 2021", "Interview Descriptions": "Generic phone interview  that was ~ 20 min. They told me the pay rate at this time which is non-negotiable. I think did an interview on Teams with two mid-level managers that would be my supervisors", "Interview Questions": "How do I manage time?"}, {"date": "30 May 2021", "title": "Receptionist/Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "Simple,  straightforward and structured. Many changes have been made since starting 7 years ago.  Many processes are virtual,  including your interview and orientation.  They are happy to answer any questions you have as they want to make sure it's a great fit on both sides.", "Interview Questions": "Why us?\nWhere do you see yourself in 5 years? \nGive an example of a time where a job was difficult and you overage obstacles."}, {"date": "24 May 2021", "title": "Senior Systems Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "Had two interviews, one with the hiring manager, and another with multiple people on the team. Ended up ghosting me after the second interview and never ended up hiring for the position.", "Interview Questions": "What is your biggest strength and weakness?"}, {"date": "11 May 2021", "title": "Business Intelligence Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health", "Interview Descriptions": "Applied and received an email to setup time with a recruiter. The recruiter explained the whole process and was in touch with me during the whole process. Pretty simple and straightforward.", "Interview Questions": "Was asked to go more in depth about projects I worked on that were listed on my resume. "}, {"date": "17 May 2021", "title": "Clinical Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI) in Apr 2021", "Interview Descriptions": "It was a Phone interview and they reviewed prior work history. They asked about reason for interest in the position. Many of the questions were behavioral management type questions .", "Interview Questions": "What is your leadership style "}, {"date": "23 Apr 2021", "title": "Emergency Department Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI) in Apr 2021", "Interview Descriptions": "I submitted my application on 03.29.21. After 2 follow- up emails (2.5 weeks), I received an invitation for a phone interview with a recruiter. I was told I was lost in the \"system\"\nI heard nothing for close to a week...\nSo, after following up with the SH recruiter via email due to no response, I was given a video interview with the manager of the specialty unit I am focusing on. \nHowever, because of the amount of time it took for them to get back to me, I applied for another position in the same department, but at another associated hospital. When my application was accepted at that hospital, I promptly received a notification for a video interview and quickly received a job offer.", "Interview Questions": "What is your background? \n\nWhat interests you in this position \n\nWhat is an example of a time when you did everything you possibly could, but it didn't work out?\n\nWhat would you do when patient becomes combative?\n"}, {"date": "8 Sept 2021", "title": "Nursing Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Spectrum Health (Grand Rapids, MI) in Mar 2021", "Interview Descriptions": "2 interviews:\n1st: Talent Acquisition, basic background questions and why you want to do the job\n2nd: Specific floor nursing manager, deeper interview questions to describe experience and ask situational questions.\nThere was a large gap of time between the first and second interviews, but that was due to a lack of communication within the organization. Pro tip: try to be in constant communication with the Talent Acquisition person and phone calls work faster and better than emails.", "Interview Questions": "How do you respond to a stressful situation?"}, {"date": "2 Sept 2022", "title": "Clinical Pharmacist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Spectrum Health in Mar 2021", "Interview Descriptions": "15 min phone HR interview. Then 45 min virtual with pharmacy supervisors. I was the only one with my camera on. There was not enough time for adequate questions. I asked to be connected to other pharmacists so I could get an idea of workflows and work life. I was never connected to another pharmacist.", "Interview Questions": "Tell us about a time that you had to have a difficult conversation with a coworker"}, {"date": "3 Apr 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Marion, IN) in Mar 2021", "Interview Descriptions": "I filled out an application and then was emailed when to schedule my interview over the phone. My phone interview was very professional and upfront. I did not go any further in the interview because I was only looking for a summer job and they were only hiring employees who were going to sign a commitment for at least a year at a time.", "Interview Questions": "The first question was a description of the job and I explained my situation. "}], [{"date": "29 Mar 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Spectrum Health (Grand Rapids, MI) in Mar 2021", "Interview Descriptions": "Easy, 2 part interview. First with the manager individually and then with the select team as other interviewers. SImple questions to get to know the canidate to ensure a good fit with the current team and what the canidate can provide to the team.", "Interview Questions": "Describe a time you faced a difficult decision."}, {"date": "17 Feb 2021", "title": "Clinical Decision Support Analyst II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Spectrum Health", "Interview Descriptions": "Friendly and engaging. Multi-step interview process with various stakeholders from direct coworkers to SVP. Appreciated the thoroughness of the process and the intentionality of the questions.\r\n\r\nSpectrum Health truly hires the \"best of the best\" as they put it.", "Interview Questions": "Initiatives can change quickly around here. How would you manage a time-sensitive but changing project?"}, {"date": "19 May 2022", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Spectrum Health in Feb 2021", "Interview Descriptions": "Laid back and straight forward. I interviewed with two bosses and they were friendly. There were a few questions asked, but a Med Tech should know them. Overall, very informative and helpful.", "Interview Questions": "What makes you a good tech? "}, {"date": "6 Jan 2021", "title": "Occupational Health Provider Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "Spoke with medical director, it was great and directly asked about my experience.  Clear, concise, to the point.  Reviewed my CV and seemed to genuinely have looked at it and cared about the experience", "Interview Questions": "About health experience, medical experience"}, {"date": "2 Jan 2021", "title": "Central Monitor Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "Great, they asked questions that I had already practiced, and I got the job! I am so excited to work here. I am looking forward to working in a growing hospital.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "23 Oct 2022", "title": "Nurse Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Jan 2021", "Interview Descriptions": "I sent in my resume for a Nurse Technician position. I had to call a few times to set up an interview. The interview was with two people over a Zoom video call. They asked a few questions about my background and my schedule and I was actually offered the job on the spot.", "Interview Questions": "Will the schedule of this job work for you?"}, {"date": "6 Dec 2020", "title": "Registered Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "Phone interview first, then meet in person and shadow. Recruiter will call you if the job was offered afterwards. There are a lot of back and forth with recruiter and supervisor/manager.", "Interview Questions": "Explain a time where you didn't know something. How did you handle it and what was your outcome?"}, {"date": "18 Nov 2020", "title": "Marketing Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "It was okay. I didnt like how i felt two people were coming at me and i didnt feel that comfortable with the environment. I also felt they asked odd questions.", "Interview Questions": "What are your strengths and your weaknesses?"}, {"date": "13 Oct 2020", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "The first interview was HR, then second round in person interview. All questions were job related some technical and some behavioral, and the interview was thorough and good. In person interview had 3 interviewers.", "Interview Questions": "What is your strength as a business analyst?"}, {"date": "16 Feb 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health in Sept 2020", "Interview Descriptions": "Had a phone interview and heard back immediately that they wanted me for a second interview. Second interview went well and was asked mostly behavioral based questions to determine how I’ve handled situations previously, I got the job!", "Interview Questions": "Name a time you’ve experienced diversity "}], [{"date": "5 Oct 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Spectrum Health in Sept 2020", "Interview Descriptions": "Moderate interview process with generic interview questions. Everyone that I talked to was very personable and kind. They place you based on your interests and were very open to new ideas as it is a growing program.", "Interview Questions": "Can you tell me about yourself?"}, {"date": "30 Oct 2020", "title": "Supply Chain Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Spectrum Health (Lansing, MI) in Sept 2020", "Interview Descriptions": "It was the next day on-campus one round interview lasted about 30-45 minutes with 2 interviewers. The questions mainly consist of going through the resume, behavioral questions. That will be the end of the interview and it will take a while before they can make a decision.", "Interview Questions": "What would you say is your greatest achievement "}, {"date": "14 Aug 2020", "title": "RN New Grad Residency Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "I submitted my application using resume and cover letter and was asked to interview about two weeks later. It was a phone interview and it was fairly fast with about 30 minutes.", "Interview Questions": "what would you do in a situation where a patient was being difficult \r\n"}, {"date": "30 Jul 2020", "title": "IS Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "You have to be persistent and up front. Be honest,  be yourself.  Incorporate core values and mission.  The process can take a while depending on the department.  Also, it can be difficult to get in if you aren't persistent.", "Interview Questions": "When was a time you failed at something and what did you learn? "}, {"date": "17 Jun 2020", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "It was a quick phone interview to question where you would like to be placed. They then followed up with feed back as to whether or not there were positions for which i was looking for.", "Interview Questions": "Something that you did that was above and beyond for a patient "}, {"date": "1 Oct 2020", "title": "RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Jun 2020", "Interview Descriptions": "Spoke with a recruiter first on the phone and did an interview, then I was passed onto nursing unit manager and scheduled a phone interview. After this then they extend and offer or not.", "Interview Questions": "Describe a time when you went above and beyond for someone else.\r\nDescribe a time you worked as a team towards a common goal."}, {"date": "19 Feb 2021", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI) in Apr 2020", "Interview Descriptions": "Screening interview via phone before full interview with hiring manager. Standard questions of ability to perform role and responsibilities, including previous experiences. Interview also included standard explanation of role, along with expectations, etc.", "Interview Questions": "What do you hope to get from this role. "}, {"date": "6 Mar 2020", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Spectrum Health", "Interview Descriptions": "The hiring manager met me in the lobby of the hospital and brought me up to the unit. She gave a synopsis of the job description, patient population, and staff. We sat in her office and had a very typical interview. She had a list of questions on a sheet to ask me as well as some of her own. She was very pleasant.", "Interview Questions": "How would your previous experience benefit this team?"}, {"date": "31 Aug 2021", "title": "Chaplaincy Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI) in Feb 2020", "Interview Descriptions": "Respectful and asked good questions and helped me even discern if job was right for me. I was interviewed by HR then management and informed within one week of interview.", "Interview Questions": "Why this job during Covid? "}, {"date": "14 Jan 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Spectrum Health", "Interview Descriptions": "There was a phone interview first and after that there was an interview with the hiring manager. The entire process took almost a month. Interviews mostly consisted of behavioral questions.", "Interview Questions": "Tell me about a time you had a conflict with a coworker and how you dealt with it."}], [{"date": "18 Nov 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health in Jan 2020", "Interview Descriptions": "The interview consisted of a series of zoom calls over webcam. I interviewed in 2020 during the covid-19 pandemic.  The interview was conversation-like and not too intimidating- so overall I found it pleasant.", "Interview Questions": "What is a time you overcame/solved a problem?"}, {"date": "16 Nov 2019", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "Behavioral-based questions, where you had to describe situations in which you faced some challenge and show how you overcame adversity. That's all I have to say about it. It wasnt too hard and it definately wasnt easy.", "Interview Questions": "What was a situation in which you had to make a difficult decision that not everyone agreed with?"}, {"date": "29 Oct 2019", "title": "Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "All day - multiple interviews. Some behav event question and some typical questions.  Nothing surprising or too different than other interviews. Conservative leadership and heavy on tech rather than on people seemingly.  Very interested in lg health system experience   Too cold in winter so staying in the South", "Interview Questions": "What are your weaknesses "}, {"date": "3 Dec 2019", "title": "Software Configuration Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Oct 2019", "Interview Descriptions": "Took about 4 weeks to interview, interviewed with hiring manager then team, 1 phone interview.  In person interviews took 1 hour discussing skills and answering various questions on how I would approach situations.  Felt I had a good shot being that it was configuration software and little coding but got rejected for a internal candidate, having a degree and experience didn't help.  Hiring Manager didn't follow up.", "Interview Questions": "Explain a time you worked with a difficult employee. "}, {"date": "14 Mar 2022", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Spectrum Health in Aug 2019", "Interview Descriptions": "I interviewed with two individuals and it took probably 15 minutes. They asked general questions about why I wanted the job, why spectrum health, and then went into more situational questions. It was pretty straight forward and they seemed friendly.", "Interview Questions": "Why do I want this jobs?\r\nExplain past work descriptions.\r\nWhat pay range are you looking for? \r\nWhat did you do in a particular situation in the past?"}, {"date": "21 Jul 2019", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Jul 2019", "Interview Descriptions": "They try to know your skill set, weaknesses and strength. Glass door needs 30 words, but it straight forward, they try to see if you are capable and fit for the job", "Interview Questions": "How would you handle a specific situation"}, {"date": "17 Jun 2019", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Spectrum Health", "Interview Descriptions": "Applied online and got a call few days later for a phone interview. First interview was a success and I was told to expect a call back for the 2nd interview which I did 2 days later.", "Interview Questions": "Tell me a time when you had to deal with a difficult customer how did you handle it."}, {"date": "10 Jun 2019", "title": "Environmental Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Spectrum Health", "Interview Descriptions": "One on One.  I interviewed with someone from the HR then I interviewed with one of the supervisors of environment services right after the interview with the HR person. I was asked about my availability and then I got hired on the spot.", "Interview Questions": "Why would you want to work for Spectrum?"}, {"date": "1 Aug 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Jun 2019", "Interview Descriptions": "This was a typical interview for new graduate nurse with questions such as describe your strengths and your weaknesses, example of how you demonstrate good teamwork, give an example of a time you solved a problem.", "Interview Questions": "Give an example of a time you solved a problem. "}, {"date": "5 May 2021", "title": "Clinical Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Spectrum Health (Grand Rapids, MI) in May 2019", "Interview Descriptions": "One call with HR - general overview of my interest in the position\n\nOne call with manager to discuss the role and see if there were questions\n\nFormal group interview with the team to see if I was a good fit for the group and the day to day.", "Interview Questions": "If you were a vegetable, what vegetable would you be"}], [{"date": "23 Apr 2019", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health", "Interview Descriptions": "In total took about three weeks.  Applied online and was offered a phone interview with a recruiter, this was just simple questions and one situational question.  About a week later was offered an in-person interview with the nurse manager, this was more standard job interview questions regarding experience and situational questions.", "Interview Questions": "Explain one time everything seemed to go wrong at work but you managed to fix it"}, {"date": "16 May 2019", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Apr 2019", "Interview Descriptions": "I applied online and received an email from the recruiter that day for a phone interview. The process of a phone interview and two in person interviews was about 6 weeks long. Phone interview was casual and pleasant: talked about the job and reasons why I applied. The in person interviews consisted of the hiring managers and leads. Mostly behavioral and skill questions and explaining importance of the job. After the final interview, I received a phone call two days later saying I was offered the position, but turned it down due to low pay and not what I was looking for with work.", "Interview Questions": "Describe a time where you went above and beyond for a patient?"}, {"date": "22 Oct 2020", "title": "Appeals Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Spectrum Health (Grand Rapids, MI) in Apr 2019", "Interview Descriptions": "They will ask about past work experience, and get a sense of your personality. It was a good interview experience. Managers were nice and asked about my duties. The more experience the better. Be friendly and knowledgeable of your craft.", "Interview Questions": "What you did on your last job"}, {"date": "6 May 2019", "title": "Nutritional Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Spectrum Health (Grand Rapids, MI) in Apr 2019", "Interview Descriptions": "Had one interview and got multiple job offers for said department. I was surprised to get the second offer shortly after I declined the first one. Overall, it was a wonderful experience and my recruiter did everything he could to get me the job.", "Interview Questions": "What is one thing that would make you stand out from the rest of our candidates?"}, {"date": "1 Feb 2019", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI)", "Interview Descriptions": "Applied online, received a call from recruiter a  week later. She asked basic questions about why I was interested in working for Spectrum and why I wanted the position. She said she would pass me along to the hiring leader. Received a call from the hiring leader soon after and set up an interview with the unit manager. Met with the unit manager and she asked basic questions to understand my background first. Then she went into a list of about 10 questions. The answers did not have to be specific to nursing practice, they could be related to any interaction with others/customers.", "Interview Questions": "Describe a time you faced diversity"}, {"date": "17 Oct 2019", "title": "Surgical Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Feb 2019", "Interview Descriptions": "The interview was very laid back and conversational. The manger asked basic questions and answered questions about the position. Very positive experience and I ma excited to work here blah blah blah", "Interview Questions": "Why Spectrum Health? "}, {"date": "10 Dec 2021", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health in Feb 2019", "Interview Descriptions": "Interview process was pretty quick and they only asked basic questions. I was hired after one interview, but I learned they turnover for this role was extremely high. The managers were pretty nice and it didn’t take long to go over my background", "Interview Questions": "Why do you think you would be a good fit for this role?"}, {"date": "9 Mar 2019", "title": "CMA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Haven, MI) in Feb 2019", "Interview Descriptions": "The process was very laid back and made me very comfortable and at ease. The interviewers were very kind and spoke very clear and made sure that I understood all questions and gave me time to answer them.", "Interview Questions": "How would I contribute to their company?"}, {"date": "14 Oct 2021", "title": "Material Handler Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI) in Jan 2019", "Interview Descriptions": "Quick and to the point \nRespectful \nDetailed and glad to answer questions \nGave me all the info on what I would be expecting when coming to work\nMade the transition very good and gave me reminders on what the work environment was like", "Interview Questions": "What did you choose spectrum "}, {"date": "12 Nov 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Spectrum Health (Grand Rapids, MI)", "Interview Descriptions": "Interview process was straight forward. I first had a phone interview with the recruiter and was asked basic questions about education and work experience. Second interview was in person with the team.", "Interview Questions": "N/A"}], [{"date": "8 Nov 2018", "title": "Advanced Analytics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Spectrum Health", "Interview Descriptions": "Every straight forward and easy. 1st round over the phone and then final round via Skype. Everyone is very nice and just wants to learn more about you. There were no technical questions, all behavior. The process took about 2 weeks in total to get an offer.", "Interview Questions": "Why Spectrum health"}, {"date": "5 Nov 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health", "Interview Descriptions": "I got a call about a week after putting in my app/resume and set up an interview for the following week. There was no phone interview. The face to face went super good, I talked with the hiring manager and also s talent acquisition person. Everyone I met was super nice and made me feel very comfortable and less nervous. The hiring manager conducted the interview very well and it almost seemed like a normal conversation rather than a formal interview.", "Interview Questions": "Why do you want to work for Spectrum Health?"}, {"date": "27 Nov 2018", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Detroit, MI) in Nov 2018", "Interview Descriptions": "Interview was conducted with 2 people, supervisors. The process wasn't bad, but supervisor Cheryl Winton was awful. It seemed as if she played the \"bad cop\". This was the South location. She asked the general interview questions,  but added her personal, negative attitude. I actually got the job, but was completely turned off by her unprofessional conduct.", "Interview Questions": "Give an example of team work"}, {"date": "28 May 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Nov 2018", "Interview Descriptions": "Very comfortable, easy going and friendly. it was a little lengthy about an hour and a half. Had a phone interview first with a recruiter followed by 1:1 interview.", "Interview Questions": "Tell me about yourself?"}, {"date": "21 Nov 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI) in Nov 2018", "Interview Descriptions": "I received an email asking me to indicate a date and time for a phone interview.  The interviewer contacted me at that time and went over my resume and asked questions about my previous experience.", "Interview Questions": "Tell me about yourself?"}, {"date": "16 Oct 2018", "title": "Marketing Operations Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Spectrum Health (Grand Rapids, MI)", "Interview Descriptions": "First a phone screening with recruiter, then an in person interview with hiring manager followed by an in person interview with marketing team. Finally an in person interview with the group director.", "Interview Questions": "Describe how you would approach moving someone through the consumer lifecycle funnel from consumer to customer, customer to brand loyalist. "}, {"date": "13 May 2022", "title": "Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health in Oct 2018", "Interview Descriptions": "Had a phone interview first, about 15 minutes, then was called in for an in person interview about a couple of days later, and that interview was about 30 minutes. The interview was with the manager and the supervisor.", "Interview Questions": "What would you do in a situation where a patient or family member is angry/irritable when asking for information?"}, {"date": "25 Aug 2018", "title": "Marketing Department Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Spectrum Health", "Interview Descriptions": "The whole process lasted for about three months. I applied online, had a phone interview where I was told I was being moved on to the hiring manager and would be contacted in a week or so for scheduling an in-person interview. It ended up being about 5 weeks later (I did follow up with HR during that time) and was told the position was being put on hold. Took another 5-6 weeks until I heard back and was told they were starting up the process again. Took another week before I was contacted for an interview. Had an in-person interview where I met with the hiring manager followed up by the team of people that the position would be working with. Then it took another two weeks to hear the results where I was told that the position had been filled. A few weeks later, the same position was re-posted and the job description was changed. \r\n\r\nSpectrum Health has been high on my list of future employers for a long time, but after this whole experience, I will reconsider ever applying for them again. I understand that things change and departments have to restructure, but it might be a good idea to not post a position until you are definitely ready to interview and hire someone. And what was even more frustrating to me was that the position was cancelled and then got re-posted asking for someone with fewer years of experience. I had to take a whole day of PTO off of work for the interview due to the time that was available, only to later find out the position was cancelled. Please consider the fact that it costs people time and money to interview, not to mention the fact that it makes the company look bad when the hiring department isn't actually ready to hire or don't know what they want in a future person.", "Interview Questions": "Why was I interested in the position? Why did I want to work for Spectrum Health? Why am I looking for a new position at this time? And a variety of behavior type questions."}, {"date": "10 Nov 2021", "title": "Referral Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Phoenix, AZ) in Aug 2018", "Interview Descriptions": "The interview process was not bad at all. It was a pretty straight forward interview. Questions like tell me about yourself, past work experiences, what are your career goals, etc.", "Interview Questions": "What made you interested in working here?"}, {"date": "24 Jul 2018", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Jul 2018", "Interview Descriptions": "I was called a week after I applied for the job and scheduled my interview with the supervisor. The interview was about 45 minutes long. They sent my application to the HR department and was told that I would receive a call in a couple of days which would let me know if I got the position or not. I received a call the following afternoon and was offered the job.", "Interview Questions": "Are you okay with working in a morgue?"}], [{"date": "22 May 2018", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in May 2018", "Interview Descriptions": "The interview process was amazing. The interviewer made me feel comfortable to be myself. She asked my why I wanted to be a phlebotomist and what I like in it the most. After that she asked me about a time where I had to trainee someone and one time where I create or help create a process to make the facility work better.", "Interview Questions": "What I like the most about being a phlebotomist \n A time when I trainee someone\n A time when I had to deal with costumer service"}, {"date": "23 Jan 2022", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health in Apr 2018", "Interview Descriptions": "The interview went smoothly. The interviewers were very friendly and asked relevant questions about their experience. The only issue was that I wasn't notified about some extra qualifications required for the job until I got to the interview.", "Interview Questions": "Why do you want to work here?"}, {"date": "18 Sept 2019", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Spectrum Health (Chambersburg, PA) in Apr 2018", "Interview Descriptions": "One on one with the executive director. Discussed my credentials and future goals. Described company policies and benefits. Asked a few questions regarding my experience and therapy style. Was called back for second interview.", "Interview Questions": "If I was licensed."}, {"date": "8 Oct 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Spectrum Health (Grand Rapids, MI) in Mar 2018", "Interview Descriptions": "You first start off with a phone interview with two basic interview question, go over pay, as well as the shift you applied for. The you move forward to an in person interview where they ask about six interview questions.", "Interview Questions": "What are three strengths and three weaknesses you possess?"}, {"date": "21 Mar 2018", "title": "Medical Laboratory Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Mar 2018", "Interview Descriptions": "First interview was with a recruiter, and she explained the position and what was required for the job. She also asked what my preferences were in the lab and if I was able to work other shifts than the ones listed in the job position information.", "Interview Questions": "Describe a time when something went wrong and you continued to have a positive attitude"}, {"date": "17 Apr 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Spectrum Health in Mar 2018", "Interview Descriptions": "Very quick turnaround for interview and hiring. First interviewed by a recruiter then by the nurse manager on the floor. Mostly situational interview questions, like \"Describe a time when you went above and beyond to provide an excellent customer experience\".", "Interview Questions": "Describe a time when you went above and beyond to provide an excellent customer experience."}, {"date": "26 Feb 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Spectrum Health (Grand Rapids, MI) in Feb 2018", "Interview Descriptions": "After applying online, I was contacted by the nursing recruiter via email to schedule a phone interview.  Then was called to schedule an in-person interview with the nurse manager of the unit.", "Interview Questions": "Describe a scenario when your actions impacted others? "}, {"date": "13 Feb 2019", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Feb 2018", "Interview Descriptions": "I had one phone screen interview for the position, but it was enough for me to lose all respect for their HR department, and made me extremely glad I didn't get the position. The man I interviewed with was extremely rude, distracted, and demeaning to all of my past employment experiences. He said that my past internship experience sounded like it was \"just an assistant job\" and many other offensive things. Clearly, this recruiter needs to brush up on how to properly interview candidates and to treat others decently. Interviews are not only for a company to see if the candidate is the right fit for the role, but it's also a chance for a candidate to see if the company is the right company to work for. This experience made me certain that I never want to apply to Spectrum Health again, or even visit their booths at Career Fairs.", "Interview Questions": "Tell me about a project that you are working on at the moment, or have worked on in the past."}, {"date": "30 Oct 2018", "title": "Intern Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Feb 2018", "Interview Descriptions": "First you will apply online. If approved, you will then receive a phone call from someone on HR or their talent acquisition team. If approved from there, you move to your last in-person interview. This process takes about 2 weeks. About a week later, you will receive another call if they would like to move forward with hiring you, or an email if they are choosing to move forward with other candidates.", "Interview Questions": "What is all you know about the Spectrum Health System?"}, {"date": "27 Jun 2019", "title": "Records Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Spectrum Health (Detroit, MI) in Feb 2018", "Interview Descriptions": "It was short and sweet, but to the point. It got across everything that was needed\r\nFor the specific job I had applied for. The interviewer was very pleasant and down to earth, which always helps!", "Interview Questions": "What experience do I have "}], [{"date": "22 Jan 2018", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Spectrum Health", "Interview Descriptions": "It was a brief phone interview with a recruiter that went over my background and asked questions about my previous work, both professionally and volunteer-wise. I was also asked one scenario-based question that required me to refer to my previous employment experience.", "Interview Questions": "Explain a time where you had to change the way that you did your day to day work in order to accommodate to a new situation?"}, {"date": "15 Jan 2018", "title": "Buyer Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health (Grand Rapids, MI)", "Interview Descriptions": "Preliminary phone interview with a (very nice) screener.  Still waiting to see if I will be moved on to the in-person interview, which would be in a week or so.", "Interview Questions": "To detail what I did at a job that was from 25 years ago."}, {"date": "18 Jul 2017", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Spectrum Health", "Interview Descriptions": "The interview process was long. You first have a phone interview with someone from HR. Then someone from the Unit, or other area of the hospital will contact you for an in person interview. My interviewers were wonderful. I felt very comfortable and there were even laughs shared.  They did ask some difficult questions but, it is a quality health care institution. I would expect it.", "Interview Questions": "N/A"}, {"date": "30 Nov 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Spectrum Health in Jun 2017", "Interview Descriptions": "Good interview, stated expectations, responsibilities.  Managers were late to interview. They were both professional, and friendly.  Felt some details on how function between two managers will work and asked what work load between two were like, they were a little vague.", "Interview Questions": "What do you do if you have too much on your plate?"}, {"date": "1 Jun 2017", "title": "Security Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health", "Interview Descriptions": "the interview process was held in a room with administrative managers asking you about personal and past experiences in the security related field. I work on opposite schedules as them and I do not think they would even recognize me if they saw me on the street.", "Interview Questions": "Asked about previous experience"}, {"date": "16 May 2017", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "Contacted by a recruiter who was great. She was willing to help me in any way.  Two interviews with two different positions. Office Managers seemed ok but very intense at times", "Interview Questions": "where do you see yourself in 5 years?"}, {"date": "12 May 2017", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI)", "Interview Descriptions": "Received email about scheduling phone  interview along with survey. Phone interview was next day, recruiter informed me that she'll be forwarding my app to the hiring manager. I then received a call a few days later for a in person interview. Scheduled for a week later I met with 4 managers 3 days later received offer from recruiter.", "Interview Questions": "What was something negative on your last work evaluation "}, {"date": "11 May 2017", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Spectrum Health", "Interview Descriptions": "The interview day included tour and introduction to the department, then interview with 4 people attending, this was more casual than expected as this was over lunch.  The day concluded with another interview with 2 top administrators", "Interview Questions": "Why I was interested in working for this specific department"}, {"date": "11 May 2017", "title": "Nure Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Spectrum Health (Grand Rapids, MI)", "Interview Descriptions": "The interview process was a little unorthodox. I had already known a manager and was able to bypass what would of been a regular interview process. So I would highly suggest to get to know someone higher up to get some better pull.", "Interview Questions": "There was nothing difficult or unexpected that I was asked in the interview process."}, {"date": "14 May 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Fremont, MI) in Apr 2017", "Interview Descriptions": "Recruiter requested a phone interview that lasted 30-20 minutes. In the phone interview,  the recruiter went over the basics of the position then asked me about my work history. Did a great job explaining the regional location I had applied for- she really was passionate about the Gerber location. After the recruiter interview, I was moved forward to the department supervisor. Interviewed in person with the supervisor- toured the ED. Loved the family-like feel there. I heard from the recruiter 2 days after the interview in person with an offer.", "Interview Questions": "What about this position excites you the most?"}], [{"date": "1 Sept 2017", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Spectrum Health (Grand Rapids, MI) in Apr 2017", "Interview Descriptions": "I had a phone interview with an human resources member who asked me general HR questions regarding to what my background was and how I heard about the position, then met with management which included a day time manager and a educator. I was then contacted again by HR the next day and offered a position.", "Interview Questions": "Why do you want to work here?"}, {"date": "24 Jun 2019", "title": "Nutrition Services Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI) in Apr 2017", "Interview Descriptions": "Pretty standard, why do you want to work here, strengths, weaknesses. There's a phone interview and an in person, if the in person goes well they'll give you a tour of the kitchen area.", "Interview Questions": "Why do you want to work here?"}, {"date": "9 Mar 2017", "title": "Nurse Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health (Grand Rapids, MI)", "Interview Descriptions": "There were two phone interviews with a recruiter, then an  in person with the supervisor of the unit and then I was offered the position and then, hired.", "Interview Questions": "Typical questions, just be prepared"}, {"date": "24 Feb 2017", "title": "RN Staff Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Spectrum Health", "Interview Descriptions": "The recruiter was very nice and started by asking me about my nursing interests, and progressed to a description of the position and the facility. She asked a few standard nursing interview questions as well.", "Interview Questions": "Describe a time that you went above and beyond for a patient or customer"}, {"date": "10 Feb 2017", "title": "Information Security Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at Spectrum Health (Grand Rapids, MI)", "Interview Descriptions": "External is a much longer process.  Internal candidates will be interviewed by a couple of team members for fit and function. Typically, everyone knows each other already so these are more or less an extension of a conversation that already started prior to the internal position being posted. In other words, the hiring manager will usually have someone in mind. \r\n\r\nExternal is always done through HR - there is a vetting process and typically a short interview with the HR resources to ensure you meet the minimal qualifications. At this point your resume will be forwarded on to the hiring manager who will then float it to their senior people for response. In some instances the hiring manager will reach out for a phone call but most often this is delegated to members of the team. Sometimes this will be conversational but it could also be the dreaded behavioral analysis interview - 'tell us about a time where you failed at something'...... blah blah blah. This is painful for everyone involved so just know that it is an HR requirement. We didn't choose to go that route. \r\n\r\nOnce you make it past the behavioral then there will be a broader interview with other members of the team. Questions will be focused on your fit for the role and also for your interactions with other members of the team. In short, you need to know your stuff and fit with the culture of the team. You may be asked to come in a couple of times and you should know ahead of time that this process drags on much longer than it should. \r\n\r\nIf you make it past those rounds then HR will authorize the hiring manager to make an offer. Again, this usually takes longer than it should so you might have to wait awhile. Once the offer is made and accepted then you work with HR to finalize the details - start date, drug testing, background check, orientation, etc.......", "Interview Questions": "In the technical interview I was presented with a network diagram and asked to walk through it - describe the flow of data, the roles of various pieces if equipment and a determination of how it might be improved upon for a set of given circumstances"}, {"date": "7 Oct 2018", "title": "Quality Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health in Feb 2017", "Interview Descriptions": "Phone interview first then in person. The in person wasnt a 1 on 1 but a group/panel interview with around 5 individuals. The interview was fairly easy and quick, only around 20 minutes.", "Interview Questions": "Experience with PM"}, {"date": "27 Jan 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Spectrum Health (Grand Rapids, MI) in Jan 2017", "Interview Descriptions": "I first had a phone interview with one of their recruiters and then a follow-up, second interview on site. I got to talk with the office supervisor and the practice manager as well as already working medical assistants. It was very comfortable and a positive experience.", "Interview Questions": "If we were to talk with someone you worked with at \"XYZ\" what would they say about you?"}, {"date": "22 Apr 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health in Jan 2017", "Interview Descriptions": "Long. It was a long hiring and interview process. I did not enjoy working for the company either. Large corp made you feel more like a number.  In office politics were high and favoritism was present. Company policies are also very strict.", "Interview Questions": "Why should we hire you?"}, {"date": "31 Jan 2021", "title": "Nurse Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI) in Jan 2017", "Interview Descriptions": "There were multiple interviews, met with managers and HR representatives there were multiple canidates there because there were several openings.  Was asked several questions by floor managers and we discussed job training and my qualifications.", "Interview Questions": "How would you handle an upset patient?"}, {"date": "24 Apr 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI) in Jan 2017", "Interview Descriptions": "What a lousy experience.  I drove through a snowstorm to interview and was hired.  I only commuted home every two weeks as I live out of state.  The resource managers are political and unhelpful, they have no sense of proper portfolio management and make it impossible for an experience PM to do his or her job. Don't work there.", "Interview Questions": "People were okay but the do not live up to a courteous level of collaboration."}], [{"date": "21 Jan 2017", "title": "Speech Pathology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Spectrum Health (Grand Rapids, MI) in Nov 2016", "Interview Descriptions": "I interviewed with my potential supervisor, who was hiring for herself and for another speech pathologist. She had asked me to submit my resume and cover letter to Alexis Kurek, who is the coordinator of hiring student interns. However, she had misplaced my resume.", "Interview Questions": "What are you looking for in a supervisor?"}, {"date": "5 Dec 2017", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Nov 2016", "Interview Descriptions": "2 phone interviews. One with HR with basic behavioral questions and another with the team you'll be working with. Second one was more technical but still simple questions. I was asked Java related questions and was told that they didn't expect me to know all of it. Just trying to get a feel.", "Interview Questions": "Name a time you had to take lead in something."}, {"date": "11 Oct 2016", "title": "Project Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Spectrum Health (Worcester, MA) in Oct 2016", "Interview Descriptions": "Horrible! Was called in early last week for an interview on Friday. It went great even lasted over an hour. I was told I will call you by Tuesday either way, don't you hate when you don't get called back? I said absolutely thank you. Half hour before close or business on Tuesday no phone call. I call the interviewer and he says that he was busy but emailed me earlier (a lie) and that I did not get advanced to the next stage because I am not fully qualified under an area of specification that is not listed at all in the advertisement or was brought up at all in the interview! Completely unprofessional on all accounts. Scum to say the least.", "Interview Questions": "They did not ask me if I had experience in the criminal justice system nor was this listed in the ad."}, {"date": "19 Feb 2017", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Spectrum Health (Grand Rapids, MI) in Oct 2016", "Interview Descriptions": "Phone interview was more of them telling you about the position, seeing if that's what you're looking for, etc. Pretty laid back. Interview in person with manager was professional, they were timely with an offer as well.", "Interview Questions": "How do you deal with stressful situations?"}, {"date": "23 Sept 2016", "title": "Lab Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Greenville, MI)", "Interview Descriptions": "The interview process I must say was not bad. When I went in for the interview everything sounded like it was going to be great. But it was after when you saw that they didn't do like they said. That unless you were favored things didn't go well for you.", "Interview Questions": "Why do you want to work for spectrum?"}, {"date": "25 Aug 2016", "title": "Senior Strategic Planning Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Spectrum Health", "Interview Descriptions": "3 phone interviews over the course of 2 months and 6 in-person interviews over the course of 1 day. Met with peers, supervisors and executives. Everyone was very nice and professional.", "Interview Questions": "Tell me about the projects you've worked on. Mini case."}, {"date": "27 Oct 2016", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Aug 2016", "Interview Descriptions": "I first applied online and this was followed by an email from a recruiter. Then, I had a phone interview followed by a half-day interview. Site interview included meeting with other providers at my potential office, as well as seeing a few patients with my potential supervising physician and then meeting with a physician in leadership.", "Interview Questions": "Describe a typical day in my current practice. "}, {"date": "28 Jul 2016", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Spectrum Health (Grand Rapids, MI)", "Interview Descriptions": "Phone screen with HR, followed by phone screen with management, followed by in person.  I actually had a few different interviews with some in person discussions.  I was told the process would be very fast.  It wasn't.  Not sure if I was deliberately lied to, but nothing I was told ended up being true.  I was told things move very fast.  They did not.  The process took months.  I ended up just giving up on following up and moved on.  I was told I was a great fit for multiple roles.  When I followed up, I heard nothing.  I had an in-person and was told I was wanted and skills/background were impressive.  Ultimately I was denied for one role but informed it was because I was a better fit for another.  I inquired about the other role and kept getting put off.  In the end I just decided to focus my efforts elsewhere.  Apparently being a large employer means you can lead on and ignore potential candidates.", "Interview Questions": "N/A"}, {"date": "28 Jul 2016", "title": "Nursing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Jul 2016", "Interview Descriptions": "I applied to the Meijer Heart Center and got a call back about a week later to set up a phone interview. My phone interview was the next day, they asked me about background information, availability, which unit I would most prefer in the MHS and just some simple questions to get to know me as a person. I had to fill out a behavioral assessment and then got a call the next day to set up an interview. My interview went well, they were very easy going and I even got a tour around the unit after we were done. They called back three days later and offered me the job, which I gladly accepted.", "Interview Questions": "Tell me about a time when everything seemed to be going wrong and yet you made things go better."}, {"date": "26 Feb 2017", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in May 2016", "Interview Descriptions": "Submitted an online application and it took a week or so to hear back that I was offered a phone interview with the recruiter. I had a 15-20 minute conversation with the recruiter and at the end he let me know that he thought I would be a great candidate and that he would pass my name along to the hiring supervisor. I received a phone call from the supervisor a couple hours later and scheduled an in person interview. After the interview, she let me know that she had another interview the next day and that she would let me know either in a couple of days or after she got back from vacation. I received a call from the recruiter after the weekend to let me know that I was being offered the position.", "Interview Questions": "How would you define customer service?\r\nTell me about a time that you went above and beyond for a customer?\r\nWhy do you want to work for Spectrum Health?"}], [{"date": "31 Mar 2016", "title": "Radiology Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Mar 2016", "Interview Descriptions": "I had a phone interview with the manager of technical operations who then invited me to an in-person interview with the engineering team. There were no technical questions but it seemed that they wanted to make sure that I would be happy in the job and that I had experience learning about medical equipment.", "Interview Questions": "They asked how I would feel about an on-call schedule (which seemed to be pretty light, once every ten or so weeks)."}, {"date": "19 Jan 2016", "title": "Membership Experience Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Hastings, MI)", "Interview Descriptions": "Met with HR and had went over my credentials. HR at the Pennock Building is awesome! After that had an Interview at the Health and Wellness Center. Met with the Coordinators and was asked questions pertaining to the job. Management is very cool and easy going. Didn't feel pressure in the interviews but more of an open communication feel.", "Interview Questions": "How do you handle bad/angry customers?"}, {"date": "27 May 2016", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Kentwood, MI) in Dec 2015", "Interview Descriptions": "I initially received a phone call asking me if I had time for a phone interview, I set up a phone interview later that week with a HR recruiter. After phone interview process I was set to meet with supervisor in the department that was hiring. I went in and had a one on one with supervisor. Then I had a one on one with another supervisor. Once they were done interviewing. I received a call back asking me if I was still interested. Which I totally was!", "Interview Questions": "Where do you see yourself in 5 years? What are you career goals?"}, {"date": "23 Jan 2016", "title": "Unit Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Spectrum Health (Grand Rapids, MI) in Dec 2015", "Interview Descriptions": "Took a long time to finally get a interview.  The phone interview was concise.  In person interview was as well.  They were prompt and professional.  The interview questions were your basic interview questions.  They were professional when they called and told me they chose someone else.   I will continue to apply for positions at this company.", "Interview Questions": "How will your fellow coworkers know if you are stressed?"}, {"date": "9 Mar 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Spectrum Health (Grand Rapids, MI) in Nov 2015", "Interview Descriptions": "They do not offer competitive wages.  The pay scale for the Patient Service Representative's are higher than Medical Assistants.  Patient Service Representative's only require a high school diploma, where a Medical Assistant is required to be certified or registered, submit continuing education credits, and pay dues yearly in order to stay registered or certified.  This is completely unfair.", "Interview Questions": "What experience do you have?"}, {"date": "1 Oct 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Spectrum Health (Grand Rapids, MI) in Oct 2015", "Interview Descriptions": "I met with a recruiter who came to my school, and she encouraged me to apply for a couple positions online. I had a phone interview with HR, and then interviewed in person with my would-be manger. It took them about a month between my phone interview to set up my in person interview.", "Interview Questions": "Explain your previous experience."}, {"date": "7 Oct 2015", "title": "Process Improvement Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health in Sept 2015", "Interview Descriptions": "Unprofessional and unprepared. Set up phone interview with me. I took off work at my current job to make the interview time. Upon calling, discovered my start date was later than she thought (even though it said on my app when I could start). Had to hang up with me and call someone else to see if that start date would work. Called me back hours later saying they needed someone sooner. Complete waste of my time.", "Interview Questions": "Why are you looking for a new career opportunity?"}, {"date": "24 Jun 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health in Sept 2015", "Interview Descriptions": "First you go through a phone interview, then if you pass you will get an in-person interview. Standard questions at an interview and heard within a day if I got the job.", "Interview Questions": "Why do you want this job?"}, {"date": "3 Sept 2015", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Jul 2015", "Interview Descriptions": "The interview process was pretty easy and It took about 15-20 minutes. The first interview was on phone with HR and after a couple of weeks, I was called for the 1-1 interview with the Unit Manager.", "Interview Questions": "Explain the situation where you get along with a disagreement between a patient or the family member?"}, {"date": "7 Jul 2015", "title": "Rehab Aide Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Jun 2015", "Interview Descriptions": "It was great. The lady who interviewed me was very friendly and showed me around. I never been to that hospital before, so it was very nice of her to show me around the place.", "Interview Questions": "Do I plan to go to school and go higher up in the company?"}], [{"date": "14 Apr 2016", "title": "Medical Office Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Spectrum Health (Grand Rapids, MI) in Nov 2014", "Interview Descriptions": "I was called in with the hiring supervisor and director. All of my background education and job experience was discussed to see how much knowledge and training I had in the job position. I was familiar with the supervisor, director, and position so they were very helpful and professional.", "Interview Questions": "If I currently did the job duties at my prior position as it was a transfer to a different job at a different clinic."}, {"date": "29 Jul 2014", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Spectrum Health", "Interview Descriptions": "I applied online. I was called the next day for a phone interview and to set up a face to face interview the next day. scheduled the interview and was hired a few hours later. Interview was easy and straight forward. Interviewer was nice and comforting. I didn't feel intimidated at all.", "Interview Questions": "Tell me about yourself? What are your hobbies? What type of experience do you have in this position? Are you in school?"}, {"date": "16 Jul 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Spectrum Health (Grand Rapids, MI) in Aug 2014", "Interview Descriptions": "Offers job shadow experience, job description thoroughly explained, asked questions regarding long term relationship with company and goals, asked about education, work experience, why I'm a good fit for spectrum health", "Interview Questions": "Where do I see myself in ten years?"}, {"date": "9 Jul 2014", "title": "Nursing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health (Grand Rapids, MI) in Jul 2014", "Interview Descriptions": "I applied for this job in April of 2014, but was never contacted, so I figured they didn't even consider me for the position. Out of the blue though, in July of 2014 HR emailed me and asked if I would be available to do a phone interview. I gave her a time and she called me the next day. It literally took about 15-20 minutes, which was short from previous phone interviews I have done. She emailed me a few days later and recommended me to the head nurse in the dempartment the position was for. The head nurse emailed me and I believe we talked on the phone to set up an in person interview. The face to face interview literally took only 20 minutes, which did make me nervous. Other than that though it seemed to go extremely well. The basic interview questions were asked. Be prepared to be asked what your long term goals are and where you see yourself in 5 or 10 years. Have your answers ready before the interview. You want to come off as confident. Then, 5 days later(due to the holiday and what not) HR called me and offered me the position. I am ecstatic!", "Interview Questions": "When was a time where you made a mistake? And how did you fix it?"}, {"date": "19 May 2014", "title": "Mobile/Web Developer Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI)", "Interview Descriptions": "I was contacted by a recruiter and set up a phone screen.  The initial phone screen was pretty straight forward and asked about my background, interests, future plans, etc.  After the phone screen I was contacted within a few days to setup an in-person interview.  This first in-person interview was to test my technical background.  They asked some basic JavaScript questions and also some logic questions.  Nothing too difficult.  After that, I was contacted once more to set-up a final in-person interview which was more of a job shadow.  This was an all-day meet and greet with the different project teams.  Everyone was nice and asked me questions about myself and also gave me opportunities to ask about their work.", "Interview Questions": "How many gas stations are there in Grand Rapids?"}, {"date": "12 Apr 2014", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Spectrum Health", "Interview Descriptions": "Clunky, so many people was emailing me and it was confusing who to contact about benefits and stuff. Said one thing in the interview that still has not panned out (strategic organization, value people who are vocal)", "Interview Questions": "Nothing earth shatteringly different than other interviews"}, {"date": "21 Mar 2015", "title": "Medical Informatics Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Spectrum Health in Apr 2014", "Interview Descriptions": "It was a 30mins phone interview for a data analyst/mining position. Other than the mentioned questions, I was given detailed project overview. I liked the project in one go and thus decided to immediately accept the offer.", "Interview Questions": "What have you done as part of your masters' degree?"}, {"date": "9 Feb 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Spectrum Health (Grand Rapids, MI)", "Interview Descriptions": "I had my leadership rotation on the same unit I was hired.  I applied through the nurse recruiter, was given an interview with her, followed by an interview with the unit managers.  The process was straightforward, and all communications followed through the nurse recruiter.  This was more than 10 years ago.", "Interview Questions": "What is one of your weaknesses, and how do you think that you can overcome it?"}, {"date": "1 Feb 2016", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Spectrum Health (Mount Pleasant, MI) in Feb 2014", "Interview Descriptions": "Lots of questions on my experience, sales , customer service, medical questions, ect, phone call, in person interview, training, skills questions, computer questions, how I would deal with trauma, ER, ect", "Interview Questions": "how good I was with customer service and how I had healthcare experience"}, {"date": "31 Jan 2014", "title": "Nuclear Medicine Technologist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health", "Interview Descriptions": "The hiring process is what you would expect.  A long HR process followed by multiple interviews and weeks of waiting for an answer.  This is not a a slam:  this is the typical employer-employee process you will find in most organizations of this size.", "Interview Questions": "What is your greatest weakness and describe a time that you were able to solve a problem effectively."}], [{"date": "28 Nov 2017", "title": "Health Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI) in Jan 2014", "Interview Descriptions": "Applied online, received phone in two to three weeks. I recieved a face to face interview shortly after.\r\nVery friendly and felt very comfortable. \r\nTwo people interviewed and me and took turns asking me questions. Asked me a lot of scenario questions.", "Interview Questions": "What does culturally competency mean to you?"}, {"date": "18 Aug 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Spectrum Health (Grand Rapids, MI) in Oct 2013", "Interview Descriptions": "One phone screen interview that was very easy and provided me quality feedback for about 10-15 min followed by one in person interview with a manager and a member of the team that took about 30 min. I was given a minute to think about answers before giving them which helped a lot.", "Interview Questions": "Define customer service."}, {"date": "20 Dec 2015", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health in Sept 2013", "Interview Descriptions": "I was scheduled for a phone interview with HR which lasted approximately 15-20 min asking mostly about which diagnoses I had treated before, and a few situation-type questions. After some time I was scheduled for an in-person interview which was a group-interview style with multiple current employees asking me questions. This was more specific to PT critical thinking skills. I did not get the specific job I was interviewing for, but I was called a few weeks later regarding another position that was open.", "Interview Questions": "Have you had a situation where a patient was upset and not able to participate in therapy? If so what did you do to try to help the patient?"}, {"date": "1 Jun 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Aug 2013", "Interview Descriptions": "First there was a phone interview, followed by 2 more interviews. One with management, the other with peers. The phone interview was with a talent recruiter and asked some tough questions. The managers asked a few customary questions and the rest of the interview was very relaxed. The peer interview was more intense with more standard questions. It was a positive experience and I truly felt they were looking for the best candidate, not just with experience but also personally.", "Interview Questions": "What could I offer or contribute to the organization?"}, {"date": "18 Mar 2013", "title": "Patient Registration Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health in Mar 2013", "Interview Descriptions": "Received a call that same week from HR. Then a recruiter for a phone interview about 30 mins. Then received a call from a manager for a brief group interview, with the patient registration managers of different department.", "Interview Questions": "Tell me about a time when you failed?"}, {"date": "12 Nov 2015", "title": "Applications Development Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Feb 2013", "Interview Descriptions": "I applied through the carerrs website. HR round is the first round, followed by a technical interviwe by a lead followed a day long interview with different team members. The day long interview process is more of a behavioural. Lunch is also provided", "Interview Questions": "N/A"}, {"date": "11 Mar 2015", "title": "Leadership Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Spectrum Health (Worcester, MA) in Dec 2012", "Interview Descriptions": "I was approached by a search firm that had been entrusted with filling a role on the management team. It seemed like a good organization with good leadership. It turned out to be a little far from my home town, so I decided not to continue the process of seeking a job with them.", "Interview Questions": "No real unexpected questions."}, {"date": "19 Sept 2012", "title": "Material Handler Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI)", "Interview Descriptions": "There was a phone interview with a HR recruiter, who then recommended me to the hiring manager. An in-person interview came after that. There was then a call from the recruiter saying that I got the position.", "Interview Questions": "Explain a situation where you failed."}, {"date": "28 Mar 2016", "title": "Environmental Service Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Spectrum Health (Grand Rapids, MI) in Mar 2012", "Interview Descriptions": "It was quick. They were very pleasant with me and had me fill out some questions. Spoke with me for a bit. Then they called me that night to offer me the job.", "Interview Questions": "Do you prefer to work alone or with others?"}, {"date": "4 May 2015", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health (Grand Rapids, MI) in Mar 2012", "Interview Descriptions": "takes forever to get the interview . I Applied on line only way they take your application . Took 18 months to get my first phone interview and that was after I applied for every job including helicopter pilot. But it worked they noticed me. Then I received 5 jobs at once.", "Interview Questions": "What qualities can you bring to this job"}], [{"date": "1 Apr 2012", "title": "New Grad Float Pool Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Mar 2012", "Interview Descriptions": "I applied online. About 5 days later I received an e-mail asking about my dream-nursing job. Following this, a secretary called me to ask if I was still interested in the job. I said yes. She scheduled me for my first phone interview. I also was required to send in my list of references through a website where emails were sent immediately to those references. The references were asked to complete a questionaire which rated different characteristics. It also asked them to give 3 strenghts and 3 weakeness of myself. Now I\"m just waiting for the interview.", "Interview Questions": "If you saw a patient being abused, and the manager chose to ignore it, what would you do?"}, {"date": "8 Jan 2015", "title": "Patient Registration Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Spectrum Health in May 2011", "Interview Descriptions": "First there will be a phone interview with HR that is very basic. Next there will be another phone interview with the manager that is more specific to your education and experience. Last, there will be an in person inter view with the manager and assistant. This interview will be even more in detail about you past and what you can offer our team.", "Interview Questions": "Give me an example of when you had an unhappy patient or customer and how did you handle it."}, {"date": "10 Sept 2015", "title": "Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Jan 2011", "Interview Descriptions": "They take a long time to contact you (up to 2 months) for the first HR interview, if you make it through that then you are interviewed by the manager and a few of the other RD's.", "Interview Questions": "How I handled a difficult situation"}, {"date": "11 Mar 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Spectrum Health (Grand Rapids, MI) in Sept 2010", "Interview Descriptions": "Interview process was fairly normal compared to most interviews. It was a while back so i dont remember any specific questions that stood out.", "Interview Questions": "I think the \"what is your biggest weakness?\" is always the one that makes you pause for a second."}, {"date": "12 May 2014", "title": "Family Intervention Specialist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Spectrum Health (Coral Gables, FL) in Mar 2010", "Interview Descriptions": "I had one interview,  she checked my employment history, and seen that I had  an extensive social service background,. I also had been doing  basic  intakes, social datas and making sure familes reached  their goals in becoming  self-sufficient.", "Interview Questions": "Was could  I start  the next day."}, {"date": "22 Feb 2011", "title": "Medsurg/Labor and Delivery Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Spectrum Health (Fremont, MI) in Jun 2009", "Interview Descriptions": "I called GMHS spoke with Office Personal employee Brenda Morris, and she directed me where I needed to go. Kerri Wiseman was extrememly helpful as well to facilitate a smooth going interview and hiring process. Was interviewed by Patti Wethington Labor and Delivery Manager and Mary Johnson - Medsurg Manager. Was contact soon after to be hired into the Medsurg unit by Mary Johnson.", "Interview Questions": "Why are you seeking employment here?"}, {"date": "11 Aug 2013", "title": "Membership Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Spectrum Health (San Antonio, TX) in Mar 2009", "Interview Descriptions": "only 1 interview, but with 4 people in office, sales leader office manager, assistant manager and lead personal trainer. they want to hear that you believe in the product and that you will work your butt off to get more people in and sell the training. thy tell you your hours but if you want to actually make money you better be prepared to work at least another 40% of that time. a typical day of 10 hours is not unheard of, and on closeout days 12-16 hours is more likely", "Interview Questions": "sell this pen"}, {"date": "19 Mar 2009", "title": "Medical Office Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Spectrum Health (Grand Rapids, MI) in Dec 2008", "Interview Descriptions": "As an internal candidate, my last interview wasn't nearly as extensive as when I was initially hired into Spectrum Health.  I met with the office manager, who gave me a tour of the facility and asked me questions about my work experience.  She also had some of her staff members sit in and ask me questions.  The process wasn't difficult, and as Spectrum has the ability to check a job application's status online, I was notified when the position was filled.", "Interview Questions": "\"What frustrates you most about your current position?\""}, {"date": "12 Apr 2009", "title": "TIS Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 6 weeks. I interviewed at Spectrum Health (Grand Rapids, MI) in Dec 2007", "Interview Descriptions": "Long without any information. But interviewers were nice and courteous.", "Interview Questions": "Tell me about a specific time when you had to overcome diversity."}]]