[[{"date": "23 Jun 2023", "title": "Dining Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "very casual process since I am already a student worker for quite a while, the interviewer is super nice and friendly during the process, its more like a conversation rather than an interview", "Interview Questions": "How will you make sure that the rest of the workers follow the rules?"}, {"date": "4 Apr 2023", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Boston College (Boston, MA)", "Interview Descriptions": "It was a very easy process, the interviewer was very kind and discussed how previous experience fit into the role I was applying for and then explained the position. The hours were also discussed and then what my goals for the future were. It was more of a conversation than a full interview and allowed me to ask all of the questions I had. we did go into detail about my certifications and how that would apply in this role.", "Interview Questions": "How does my previous experience fit into the role I am applying for?"}, {"date": "2 May 2023", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Boston College (New York, NY) in Apr 2023", "Interview Descriptions": "Applied, heard back about 1 month later regarding interviewing! I met with the interviewer over Zoom. It was schedule for 30 minutes but we only met for 15. A lot of it was basic questions and asking about experience. I was told that they're still accepting applications and interviewing, and that I'd hear back in a couple weeks. The next day I was reached out to interview again! Again done over Zoom, and was a lot more like a conversation. It was really easy, and again a lot of the questions were just about experience or behavioral. I was told again that they're still interviewing and that I'll hear back in a couple weeks. I got the offer the next day.", "Interview Questions": "Tell me about yourself."}, {"date": "22 Mar 2023", "title": "Project Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "there were 3 different interviews with admin and program staff. The interview process was slow. After receiving an offer, HR was difficult to work with unfortunately. Talking to everyone else was very nice and they explained the position well.", "Interview Questions": "Please tell me about yourself"}, {"date": "27 Feb 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "Short. One interview. Basic Behavioral questions. Nothing would stump a person who has been through phone screens before. Inside of the office (however, that may be different now after COVID procedures).", "Interview Questions": "Q: Confidentiality is a must in this job. Describe a time you had to implement this?"}, {"date": "19 Apr 2023", "title": "Math Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Boston College (Chestnut Hill, MA) in Jan 2023", "Interview Descriptions": "I got asked what courses I took and how I performed in them. I heard back a week later. I also was able to fill out which classes I wanted to grade/tutor for.", "Interview Questions": "What classes have you taken at BC"}, {"date": "29 Dec 2022", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Boston College", "Interview Descriptions": "Emailed me for half an hour interview. Chat with a professor. Asked me five questions. Very causal. Told me they will make decision later, and told me I can contact the professor any time with questions.", "Interview Questions": "Your favorite and least favorite biology courses. You most rewarding and challenging research experience. Why you choose BC. Any questions for me."}, {"date": "8 Dec 2022", "title": "Orientation Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "Did a written app, then had a group stage interview with 10-15 applicants, and finished with an interview with 3 interviewers. Two interview rounds with the written application round. Then I recieved a follow up a few weeks later with a final decision", "Interview Questions": "Where is a place that you are truly yourself?"}, {"date": "14 Nov 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "Interview with Professors. Got asked about my research interests and where I am in terms of major courses and data management skills. Overall it is a very chill and conversational process.", "Interview Questions": "What makes you want to do a PhD?"}, {"date": "20 Oct 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Boston College in Oct 2022", "Interview Descriptions": "One video essay: why BC? It required 60s for preparing and 120 mins to answer. Candidates have two attempts to answer the question. Overall, it's not hard and the interviewer just want to learn more about you.", "Interview Questions": "N/A"}], [{"date": "15 Jun 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "The interview was essentially an informal conversation with a professor that I was already well acquainted with, so it was mostly a formality. A large percentage of similar positions with professors were due to pre-established connections, and interviews were informal.", "Interview Questions": "What previous research experience at this school do you have?"}, {"date": "15 May 2022", "title": "Health Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boston College", "Interview Descriptions": "Was reached out to through email. It was professional but the interview was done by 2 people and it was awkward. The lady seemed passive aggressive to her supervisor who was also in the interview. BC seems like a big facade, covering up their shortcomings instead of just being honest to candidates. I withdrew my application after the interview.", "Interview Questions": "What is your experience with customer service/angry parents? "}, {"date": "9 May 2022", "title": "IT Helpdesk Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Boston College (Boston, MA) in Apr 2022", "Interview Descriptions": "I feel I can sure my unfiltered experience as I know that I will not ever have another chance with interviewing this company. As once one has rejected a job offer over pay. The ATS system automatically blacklist the applicant from all future reference. So I hope you will read on.\r\n\r\nMy interview experence I had an cumulative 5 round interviews. Phone interview ( 2 people ), virtual group interview, director of the department, CIO of the department and HR team.\r\n\r\n1st round interview - was conducted from who I know uderstand was another representative within the team as opposed to an official recruiter or HR which is the first red flag as it showed indirectly that the department lacks support when it comes to recruitment if the members within the team have to carry out the recruitment despite having officials in place that this responsiblity should fall under. The representative did not call me during the scheduled interview time. Prompting me to have to reach out. No one picked up the first time, so I called a second time and was greeted by the person who sounded like they just wanted their day to be over despite it being the morning. Another red flag but hey it's such a prestigious college so of course I overlooked it! \r\n\r\n2nd round interview - they were all present and on time surprisingly. They asked very light and generic questions causing me to have to carry the conversation and ask hard-hitting technical and behavioral questions. I found this to be a red flag. Especially when I turned the tables to ask them if they had any further questions they just looked confused. \r\n\r\n3rd round interview - this one was smooth and relatively short but again I was not asked nearly as many questions as I gave.\r\n4th and 5th round interview - was performed in the office the CIO gave a backstory on the founding of the college ( oh joy) and did their best to play off of the view I shared of the team members I met in what felt like an attempt to authentically give the impression that they took know each of the members well. HR team came right after and never once talked about the salary and instead kept trying to emphasize how great their benefits were ( another red flag). It wasn't until I got the job offer that I realized why that was. Despite their job listing showing the salary range for the position, I applied for they offered a salary lower than the shared range. \r\nThis resulted in me having to decline the job offer. To do all of that rounds of interviewing just to be met with that is such a slap in the face and to me, shows a lack of integrity within the company. Do better.", "Interview Questions": "Q: Why did you choose Boston College?"}, {"date": "15 Dec 2021", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boston College", "Interview Descriptions": "first round - manager(personalities and go over resume)\nsecond round - group interview  (case study and go over resume)\nthird round - director (career path, salary expectation, case study) \nforth round - HR(basic behavior questions)", "Interview Questions": "the difficulties when you accomplish one project"}, {"date": "9 Aug 2022", "title": "Associate Director of Prospect Research Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Boston College (Chestnut Hill, MA) in Nov 2021", "Interview Descriptions": "I Interviewed through two rounds in the development office last fall, for a position with the prospect research team. My first interview was on the phone, and went well. The assistant director who interviewed me was warm and professional. After the first call, I was invited back for a second round in person. Needless to say the second round was one of the more bizarre interview experiences I’ve ever had. Everyone I met with seemed scattered, cold, and uninterested. I felt like I was rejected before I even arrived onsite. To make matters worse after following up via email twice with HR I never heard anything again.  Not even one of those form letter rejections you get from most companies. The lack of professional courtesy and basic manners was astounding. Please don’t ghost people who take the time to interview with you, it’s rude and unprofessional. Secondly, don’t be rude and uninterested to the people who do come into to interview with you. I drove for an hour in rush hour traffic and pouring rain to be there, only to be treated like a total waste of their time. Even if  I had gotten an offer, I likely would have declined given my experience with that particular team. Will not be applying for another position there again.", "Interview Questions": "What do I do in my current role? Why am I interested in this position? What are some Challenges I’ve faced before in my career and how did I handle them?"}, {"date": "26 Oct 2021", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "job market at the job market location where candidates from all over the world compete by presenting their research and then schools make fly out offers and then you go the the universities", "Interview Questions": "explain your research in details"}, {"date": "23 Feb 2022", "title": "Intramural Referee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Boston College (Boston, MA) in Sept 2021", "Interview Descriptions": "Very easy process. I met with the supervisor and discussed the job. We then went over training and I was able to start pretty soon after that. Overall, a smooth process.", "Interview Questions": "Do you have previous sports knowledge?"}, {"date": "1 Jun 2022", "title": "Retail Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Boston College (Chestnut Hill, MA) in Aug 2021", "Interview Descriptions": "Applied through Follett. Phone interview by store manager. Simple, asked questions about availability for the bookstore and when I was able to start. Manager was laid back and very accommodating with the school schedule.", "Interview Questions": "What does your availability look like?"}, {"date": "13 Jun 2021", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "The job was a student worker position. The interviewer wanted someone who could work for the next 2 years and thus wasn't planning on graduating early or going away to study abroad.", "Interview Questions": "What do you know about our major/minor's graduation requirement?"}, {"date": "15 May 2021", "title": "Resident Life Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boston College", "Interview Descriptions": "very disorganized and passive aggressive interview. I withdrew my application because it was such a strange experience and I could tell these were not respectful or happy people to work with.", "Interview Questions": "1. how do you stay organized\r\n2. how do you deal with angry customers/parents\r\n3. thoughts on diversity, equity, inclusion"}], [{"date": "5 Jan 2023", "title": "IT Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Boston College (Boston College, MA) in May 2021", "Interview Descriptions": "Mainly behavioral based questions. Goes over your resume and tell them about your weaknesses and you strengths. Overall pretty easy and the interviewers were nice. They're mainly looking for students who are experience with sql.", "Interview Questions": "Tell us about your self."}, {"date": "30 Mar 2021", "title": "Assistant Registrar Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Boston College", "Interview Descriptions": "Applied and heard back pretty quickly, interview was with another Assistant Registrar and the interview started off okay but went downhill quite quickly. One of the major things that threw me off was when she told me that, “when you make a mistake in our office, it’s not professional to point out the person who made the mistake even if they did. It’s just not professional.” That sounds like to me a hostile and toxic work environment where there is a clear structure of hierarchy and I am G O O D.\r\n\r\nNeedless to say, the interview left a bad taste in my mouth and I felt zero inclination to write a thank you email, which is something I usually do (higher Ed folks tend to make a real big stink about not getting thank you emails) so I had a feeling this would seal the deal of BC rejecting me. This was my first interview with BC and while it was pretty easy to get an interview, the interviewer was...to put it simply, very unprofessional.", "Interview Questions": "They mostly ask you about your resume and experiences in higher ed"}, {"date": "3 Mar 2021", "title": "Bookstore Worker Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "5 minute phone call. Barely asked any questions or had answers to my questions. Expected a full-time student to work over 20 hours which is not allowed by the school", "Interview Questions": "Asked about my availability to work over 20 hours as a full-time student which is not allowed "}, {"date": "26 Jan 2021", "title": "Fitness Attendant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "It wasn't too bad. pretty straight forward and easy questions. Asked your fitness history and other things like that. I would recommend this to others any time. For sure for sure for sure", "Interview Questions": "What is your experience with fitness?"}, {"date": "7 Apr 2021", "title": "Adjunct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Boston College (Boston, MA) in Jan 2021", "Interview Descriptions": "Friendly and interested. Got along well with interviewers who know their subject matter and student needs and who clearly care about students and the student experience overall. Good follow up communication.", "Interview Questions": "Why do you want to teach?"}, {"date": "8 Dec 2020", "title": "CSOM Grad Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "Good experience. Video interview from out of state, Personal questions, why BC,  career goals, how can BC help you get there, how does your background make you a good candidate?", "Interview Questions": "Why BC? How will BC help you meet your career goals?"}, {"date": "6 Dec 2020", "title": "EagleTech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Boston College", "Interview Descriptions": "They were friendly and it was more like a conversation than an official interview, more concerned with customer service experience than technical experience. Good to have referrals or pasts colleagues you can name drop. Just be confident and answer the customer service courteously.", "Interview Questions": "What past experience have you had in customer service?"}, {"date": "13 Sept 2020", "title": "Events Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Boston College (Boston, MA)", "Interview Descriptions": "easy process. applied, had phone interview, met with team for interviews, met with boss for interview. questions were normal interview questions. everyone was really friendly. process moved smoothly. lots of time for questions during process. i rec applying here. i suggest thank you notes after all interviews to all team members.", "Interview Questions": "Describe a difficult situation you had to navigate"}, {"date": "1 Nov 2020", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boston College in Sept 2020", "Interview Descriptions": "There were four stages in the interview process. \n1. Screening w/ admin officer - (30 min)\n2. Panel Interview 1 - conducted with about 5 in-country staff including the admin officer (60 min+)\n3. Panel Interview 2 - conducted with about 2 to 3 international staff plus the admin officer (60 min)\n\n4. If you pass all three rounds, you will be invited to \"meet\" the director. The admin officer also sits in this meeting which great bc they can cosign what has or has not yet been discussed during the interview process. - (30 min)\n\nPanel interviews can be difficult if perhaps you never experienced one before and you get nervous under pressure. This was my first but as I progressed I became more confident. The staff appear to be great people to work with.", "Interview Questions": "There were so many. I will say practice going over the commonly asked questions during interview and know your resume like the back of your hand - expect follow-up questions."}, {"date": "4 Feb 2021", "title": "Career Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boston College (Boston, MA) in Aug 2020", "Interview Descriptions": "I interviewed for a career coach position virtually during the pandemic. This process does not usually happen virtually, but the virtual experience was overall a positive one. Communication and scheduling were clear. I had multiple individual interviews with people in various levels of the office. Everyone was great", "Interview Questions": "Tell us about a time you worked with a diverse population of students"}], [{"date": "29 Mar 2022", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Boston College in May 2020", "Interview Descriptions": "They asked several questions about the work experience I provided on my resume, as well as my interest in Boston College and the particular mission of the instiution. I only had one interview for this role before receiving an offer.", "Interview Questions": "Can you please point out key highlights of you resume?"}, {"date": "12 Nov 2019", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "I sent in an application and heard back within a few months (Jan-Feb) that I was accepted to the program,  no interview required. I then was offered to visit the department and interview with my potential advisor and discuss research interests.", "Interview Questions": "What are your  research interests?"}, {"date": "8 Oct 2019", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Boston College", "Interview Descriptions": "Internal referral to apply, apply online with resume and cover letter, a day of interviews with members of the team and HR, hiring manager checked in with references, a couple of weeks to receive the verbal and formal offers", "Interview Questions": "Tell me about yourself and your experiences"}, {"date": "23 Sept 2019", "title": "Library Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boston College", "Interview Descriptions": "I sent my application in during the fall of 2017 and received an e-mail back about an in-person interview a week later. I was interviewed by the two folks who would have been my direct supervisors. One of the women was very prepared and hospitable, the other admitted to not having read my resume and was clearly disinterested for the entire hour. This was my first interview post undergrad, so I didn't realize how unprofessional she was at the time. They both asked me questions about my work ethic, time management, and technical skills for an hour. Then I got a quick tour around the office and met some folks.", "Interview Questions": "How do you manage your time with a heavy workload? "}, {"date": "24 Sept 2019", "title": "Writer In the Office of Advancement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Boston College", "Interview Descriptions": "Was fairly formal, interviewed with six people total over two interviews. The interview/hiring process took a while, especially as they took three week between the first and second interview.  Everyone I talked to was real kind, and made the interviews as comfortable as possible.", "Interview Questions": "What do you know about the Jesuit nature of BC? What do you want to know about the position?  Are you comfortable with deadlines & collaborating with co-worker. And then just questions about my work and educational experience."}, {"date": "22 Oct 2019", "title": "Technology Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Boston College (Boston, MA) in Sept 2019", "Interview Descriptions": "I applied through a recruiter, got a call a week later to schedule a phone interview. The interview was with a panel of about 4-5 people and questions were about my experience and resume. Call ended with them saying I had great experience and that the next step was an in person interview which they would set up with my recruiter. That was a month ago. I look at it at this point that there is no interest on their part to pursue this further, but a confirmation would have been nice to know. I see a lot of other interviewees here where the process seems to drag on and makes me wonder in this current low unemployment environment, how this or any other employer thinks a job seeker is willing to wait? It boggles the mind.\r\n\r\nIf you have an interview here , I would do it and then continue your search because you'll be retired before you hear from this place.", "Interview Questions": "Experience related questions"}, {"date": "12 Apr 2019", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "Applied by submitting an application, contacted by the boss for an interview a week later, the interview was straightforward and more to gauge personality rather than qualifications. Great opportunity for undergrads", "Interview Questions": "Why do you want this position?"}, {"date": "26 Nov 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Boston College in Oct 2018", "Interview Descriptions": "The interview process was very straightforward. There is typically 2-3 rounds before they decide whether to accept or reject. The staff were very friendly, and the questions were not too difficult. The only downside to the whole process was that it took a very long time from the moment I applied to the moment I heard back.", "Interview Questions": "They will definitely ask about your knowledge of BC and its Jesuit roots."}, {"date": "25 Sept 2018", "title": "Office of Residential Life Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "It was very straightforward. Nothing was unexpected. I interviewed with two current staff members. I was not caught off guard by any of the questions that were asked during the interview and would rate the experience as positive overall", "Interview Questions": "Describe a time when conflict arose in a work setting "}, {"date": "4 Sept 2018", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "Met with the hiring manager after filling out a standard application. Was hired on the spot and started the next day. Manager was incredibly nice as were the graduate students.", "Interview Questions": "Experience with photography and/or graphic deisgn"}], [{"date": "10 Jul 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Boston College (Boston, MA) in Aug 2018", "Interview Descriptions": "Had a first round of screening over the phone, once that got through, had a one on one meeting with the PM of the team and later with the Director of Application & Services team", "Interview Questions": "Describe in detail my work experience"}, {"date": "23 Jul 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Boston College (Newton, MA) in Aug 2018", "Interview Descriptions": "It was one on one with the supervisor. About 15-20 minutes longs. Asked about my background in the area of research. Told me about what is looking for and asked if i would be comfortable", "Interview Questions": "My background in the area of research"}, {"date": "21 Apr 2018", "title": "Dining Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Boston College (Boston, MA) in Feb 2018", "Interview Descriptions": "The interview went well, it was nice to interviewing with them, the manager were very nice to me. They asked me a lot of questions but I answered all of them correctly.", "Interview Questions": "They asked me to talk about myself "}, {"date": "18 Dec 2019", "title": "EagleTech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Boston College (Chestnut Hill, MA) in Jan 2018", "Interview Descriptions": "I sat in a room with 3 people and they asked questions about my previous experience in troubleshooting issues for people as well as if I have any customer service experience. I went through a few troubleshooting scenarios and explained what I would do to fix the issue.", "Interview Questions": "How would you solve an issue where someone's laptop wasn't connecting to the internet."}, {"date": "7 Sept 2019", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Boston College (Boston, MA) in Sept 2017", "Interview Descriptions": "Interview with supervisors where they asked a bunch of questions on my skills in the past as a supervisor or referee. I had some experience but they take alot of students that show they are eager and good in dealing with situations.", "Interview Questions": "What was a time you effectively communicated in the workplace?"}, {"date": "5 May 2017", "title": "Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Boston College (Boston, MA)", "Interview Descriptions": "I went through a recruiter. I had 2 calls with the recruiter, then a call scheduled with the hiring manager which was cancelled 3 times. Then I was told they decided not to move forward. Then I was contacted 2 days later saying they would like to move forward and had a call scheduled with the hiring manager. I was asked to code a sample project (being a role for a coder). The project instructions were to create a \"fresh and modern design\". I'm not a designer, and the role was note described as a design role, so I coded it in a fresh way, but left the design as is. I was not asked to move forward after that because they were expecting a better design. So they got a free project out of it.", "Interview Questions": "Describe your coding experience."}, {"date": "20 Jan 2017", "title": "Program Manager (Health & Safety) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boston College in Jan 2017", "Interview Descriptions": "I applied through college or university. The process took 2 days. I interviewed over the phone.\r\nThe hiring manager asked very standard interview questions pertaining to the job. However, after being told that I would hear back from someone  regarding the hiring decision within a couple of weeks, I have not been contacted. I sent the appropriate thank you notes, and follow-up email but I have not heard anything.", "Interview Questions": "How you prioritize?"}, {"date": "10 Oct 2016", "title": "Information Technology Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Boston College", "Interview Descriptions": "I applied to a position in the IT space.  Met many of the people I would be working with and they were great.  I was told that a decision would be made in a month.  I contacted the director and he said he would check on the status.  A month later I emailed him for an update and never got a response.  If I didn't get a position, that's fine but an email saying I didn't get it would have been much more professional than silence.", "Interview Questions": "standard questions - background, what you like about the position"}, {"date": "8 Oct 2016", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Boston College", "Interview Descriptions": "After an email exchange, and submitting my resume I was asked to come in for an interview within the week. The interview lasted half an hour, and I was notified promptly.", "Interview Questions": "What interests you about the work I am doing?"}, {"date": "21 Mar 2018", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boston College (Chestnut Hill, MA) in Aug 2016", "Interview Descriptions": "I was left alone in a room for hours to complete a 30 minute assessment on Microsoft Word and Excel. Asked a few simple questions but it was not very unique at all. Passed with flying colors but ended up getting hired elsewhere... All in all an easy process, go for it.", "Interview Questions": "Where do you see yourself in 5 years? How do you plan on getting there?"}], [{"date": "28 Apr 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Boston College (Boston, MA) in Apr 2016", "Interview Descriptions": "Asked about why I wanted to do the certain type of research and my history in researching. They then asked what my plans were after graduation  and how I found the position. They also wanted to know how many hours I could work.", "Interview Questions": "What kind of research have you done in the past?"}, {"date": "8 Jan 2018", "title": "Orientation Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Boston College (Boston, MA) in Mar 2016", "Interview Descriptions": "I completed an Online Application with two essay questions, was selected to participate in a Group Interview, and then I received a Final Round Individual Interview all within three months time, ultimately leading to selection.", "Interview Questions": "Why do you want this job?"}, {"date": "19 Jun 2019", "title": "PhD Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Boston College (Boston, MA) in Mar 2016", "Interview Descriptions": "Challenging, but fair interview process. Asked some questions about my background and why I thought I would be a good fit. Some questions regarding basic math were asked as well.", "Interview Questions": "Why should we accept you into the program?"}, {"date": "23 Dec 2015", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boston College (Boston College, MA)", "Interview Descriptions": "The interview process consisted of an online application with general background/involvement experience and an essay question on why I would like to became an RA. Followed by a group interview and an individual interview conducted by two professionals. The group interview was very activity based and seemed to focus more on how we can work and coordinate as a group, interestingly, current RA's were the ones who evaluated you during this portion. The individual interview was 1-on-1 but really2-on-1 as there were two professionals that asked specific questions about your experience with leadership and organizing roles as well as behavioral questions.", "Interview Questions": "What is one new thing you would do or implement as an RA?"}, {"date": "24 Aug 2015", "title": "Student Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Boston College in Jul 2015", "Interview Descriptions": "The interview itself was easy.  I met with the director and he was nice; we had a great conversation and he told me more about the position.  He asked very standard interview questions and it was not difficult.  However, after being told that I would hear back from someone in HR regarding the hiring decision within a few days, I was never contacted.  I don't mind not being offered a position - I understand that there are many eligible candidates, but I do mind taking the time to come in for an interview, sending the appropriate thank you notes, and then never hearing anything.  I think it's extremely rude and poor form.  Come on BC, I expected much better from you.", "Interview Questions": "Why are you interested in this role?"}, {"date": "29 Mar 2016", "title": "Tennis Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Boston College (Boston, MA) in Jun 2015", "Interview Descriptions": "I met with Daryl for an interview before Summer of 2015.  The entire interview was very comfortable and Daryl assessed my skills and experience with tennis while describing the entirety of what the position as tennis instructor would entail.  This was a very helpful experience and reassured my fit for the position.", "Interview Questions": "What experience do you have with tennis?"}, {"date": "29 Oct 2015", "title": "PhD Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Boston College (Boston, MA) in Jun 2015", "Interview Descriptions": "What are current and future faculty demographics?  Pay rates?  Type of appointments?  Comparisons to the national levels?Are there issues involving academic freedom present in the state? Are there statewide union issues?", "Interview Questions": "What do you think of your future?"}, {"date": "19 May 2015", "title": "Library Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boston College (Boston, MA) in May 2015", "Interview Descriptions": "I met with six separate people -- one in charge of hiring, those in charge of the departments I'd be working with, one of the university librarians, and an HR representative. Very detailed, emphasized the community aspect of BC. Was there for two hours and had a tour of the library at the end. They wanted to finish interviews before offering me the position, but were quick to let me know that I was one of only a few to get called in for the interview.", "Interview Questions": "(since I had previous experience) What is your favorite part of working at (your current library)?"}, {"date": "3 Apr 2015", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "Ask question about the sas code and knowledge about the Acess database. Not difficult and interviewers are friendly. Need time to prepare what skills they ask for and that will be it.", "Interview Questions": "Intepret the SAS Code"}, {"date": "12 Oct 2017", "title": "Student Technology Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Boston College (Chestnut Hill, MA) in Apr 2015", "Interview Descriptions": "Very friendly open interview process. Primarily behavioral to understand how you interact with those that you will be serving. First, you submit an online survey to put in your application with basic short answer questions. Usually underclassmen are prioritized for an interview spot as they can train them over their next few years at BC. Interview is casual and comfortable, roughly 20-30 minutes of basic behavioral questions.", "Interview Questions": "What is an important aspect of customer service?"}], [{"date": "12 Aug 2015", "title": "Finance Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boston College (Boston College, MA) in Mar 2015", "Interview Descriptions": "I applied through the online application that was emailed out to students. The application included basic information, work experience, GPA, and a few short essays. I would recommend writing a lot for the essays because they are looked at as a \"cover letter.\" A lot of students apply for very few Coordinator positions. Be sure to highlight your strengths, work/extracurricular experiences, and why you would be a good fit. The interview took 30 minutes and was with 2 supervisors. It was very casual and entirely behavioral.", "Interview Questions": "Can you describe a time when you disagreed with your supervisor? What did you do?"}, {"date": "26 Jan 2015", "title": "Group Fitness Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Boston College", "Interview Descriptions": "two interviews the first one was about my experince in teaching the diffrence between ideas and apllication,. the seconed was about my thought of advanceing the teaching of arabic language", "Interview Questions": "why you didnot finish your master until now"}, {"date": "16 Sept 2014", "title": "SAS Programmer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Boston College", "Interview Descriptions": "not that much hard.mostly technical questions related to statistics. very comfortable manner.some behavior questions followed by salary negotiatoin.overall it is good.but boston is highly expensive.accepted offer even the pay is low due to some personal reasons", "Interview Questions": "some complicated sas macros"}, {"date": "3 Sept 2014", "title": "Loan Collector Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Boston College", "Interview Descriptions": "I received a scheduling call and conducted an initial interview with the hiring manager and their department head.  They asked specific questions about my resume and the position and were professional throughout.  I was then invited back for a followup interview with Human Resources and the Division head, who were likewise professional and on key.  A week later, I received a kind rejection letter signed by those who had interviewed me.\r\n\r\nI was very impressed by Boston College and feel that I was treated fairly throughout the interview process; however, my rejection came almost 10 weeks after I sent my application.  During that time, I turned down a job offer with another employer.  I wish that BC would come to a decision in a shorter window of time.", "Interview Questions": "Almost all questions were specific to myself and the position.  I don't think BC uses boilerplate interview questions."}, {"date": "17 Apr 2014", "title": "Fiscal/Procurement Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Boston College", "Interview Descriptions": "You apply for the job online and submit your cover letter and resume online as well through the application system. You then wait to hear from the employer if you have been selected for a phone interview. They arrange a phone interview, which is typically under 30 minutes to get to know you. If selected, you move onto a formal in-person interview that often includes HR. After this step, you are either offered the job by HR or not .", "Interview Questions": "Why this Job?"}, {"date": "2 Apr 2014", "title": "Associate/IT Consultant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "Interviewed over the phone, followed up with an in person interview.  Talked with 4-5 different managers.  Traditional questions regarding how I handle certain support situations.", "Interview Questions": "Tell me about a time you had to deal with a angry customer.  What did you do to alleviate the process?"}, {"date": "4 Oct 2016", "title": "Group Sales Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Boston College (Boston, MA) in Mar 2014", "Interview Descriptions": "They scheduled a phone interview and them hired me and sent me to Boston to begin work. They asked me for what I was most interested in doing and then tried to create an internship experience for me around these interests.", "Interview Questions": "Describe your past experience"}, {"date": "11 Nov 2013", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Boston College", "Interview Descriptions": "The most difficult part of the process for Boston College is the very prolonged hiring process that most offices use.  The job typically is posted for 30 days and without a referral or being an internal candidate, it is extremly difficult to get hired.", "Interview Questions": "BC is a Jesuit institution and many times candidates are not prepared if they are asked about the Jesuit values or something like \"what does it meant to be part of a Jesuit institution?\""}, {"date": "19 Aug 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "No interview", "Interview Questions": "What's your research interest?"}, {"date": "30 Jul 2015", "title": "Development Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Boston College (Boston, MA) in Jul 2013", "Interview Descriptions": "I completed a phone interview for an entry level role in the Development Office. The hiring manager took the entire call to ask me why I didn't participate in my senior class fundraising effort (there wasn't one), as BC has had success in this effort. The interviewer even went so far as to tell me that I was wrong and that I must not have been engaged with my University and I was not qualified for this position.", "Interview Questions": "Did you participate in your Senior Class Giving Campaign at your University?"}], [{"date": "18 Jun 2013", "title": "Staff Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Boston College", "Interview Descriptions": "I was contacted for an initial phone interview screening, and then was brought in to meet with 7 different members of the department.", "Interview Questions": "The questions were all pretty standard. "}, {"date": "13 Jun 2014", "title": "Student Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Boston College (Chestnut Hill, MA) in Mar 2013", "Interview Descriptions": "I applied online and also had a friend recommend me for the job who already worked there. There was 1 Interview, the manager was very nice and comforting. Simple tech based questions were asked, no curveballs.", "Interview Questions": "None, just a typical behavioral interview. Be sure to know about what experience you have with tech."}, {"date": "4 Mar 2013", "title": "Firewall Contractor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Boston College (Brighton, MA) in Mar 2013", "Interview Descriptions": "After pre-screening by an agency, interviewed with the manager and potential co-workers. Everyone was very pleasant, The most difficult part of the interview was that the job description was not written very clearly, so I was not sure who would be making the firewall changes. During the process of the interview, it became clear that this was primarily a documentation project, and that the skills required were those of a technical analyst, project manager, and documentation specialist.", "Interview Questions": "I was asked about scheduling software changes. "}, {"date": "28 Feb 2013", "title": "EagleTech Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Boston College", "Interview Descriptions": "Interview was not too formal. I felt very comfortable speaking to the managers. They are all very nice and understanding. It's important to show a good work ethic with valuable customer service experience and some competency with technology and computers.", "Interview Questions": "Give a time when you had to help someone troubleshoot his/her computer. What was the issue and how did you fix it?"}, {"date": "11 Oct 2016", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Boston College in Feb 2013", "Interview Descriptions": "It was an amazing experience. I felt that Boston College was a very welcoming and warm place to work. I have no regrets choosing them as an employer. I cannot believe how lucky I am to have been given even better opportunities after working here. Boston College was a wonderful career starting foundation.", "Interview Questions": "How prepared do you think you are for this job?"}, {"date": "20 Sept 2017", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boston College (Boston, MA) in Jan 2013", "Interview Descriptions": "I was in China when I got the interview, so I did skype interview with my advisor. She gave me some hypothetical research questions, and asked me how I would approach to design an experiment to answer the questions.", "Interview Questions": "Q: what question do you have for me?"}, {"date": "22 Feb 2013", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Boston College (Chestnut Hill, MA) in Nov 2012", "Interview Descriptions": "Had phone interview and then a full-day in-person interview.  Even after an in-person interview and promised follow-up, never even got a rejection letter.", "Interview Questions": "Asked about prior jobs and difficulties faced during the execution of my duties"}, {"date": "18 Sept 2015", "title": "Processing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Boston College (Chestnut Hill, MA) in Jun 2012", "Interview Descriptions": "A paragraph is a collection of related sentences dealing with a single topic. Learning to write good paragraphs will help you as a writer stay on track during your drafting and revision stages. Good paragraphing also greatly assists your readers in following a piece of writing. You can have fantastic ideas, but if those ideas aren't presented in an organized fashion, you will lose your readers (and fail to achieve your goals in writing).\r\n\r\nThe Basic Rule: Keep one idea to one paragraph", "Interview Questions": "Tell us about yourself."}, {"date": "4 May 2016", "title": "Reslife Facilities Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Boston College (Chestnut Hill, MA) in Apr 2012", "Interview Descriptions": "Meet with your potential managers and go through an interview to see whether you would be a good fit for the job. The managers explain what the job entails and you may ask any questions relevant to the job. The interview is a series of questions and answers that are quite expectable, so just be prepared.", "Interview Questions": "Q. Why should we hire you."}, {"date": "17 Jun 2015", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Boston College (Chestnut Hill, MA) in Jan 2012", "Interview Descriptions": "I wrote a letter stating that I wanted to work and that I would seek external funding. I was looking for a project that I could truly own and take with me when I left. I lucked out and after one year I received a grant that paid my salary for three years\r\n\r\nI had previous experience in the field and a good reputation performing top notch research-so asking me to come out was not at all risky", "Interview Questions": "How fast can you get here?"}], [{"date": "28 Jul 2012", "title": "Part Time Job Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Boston College (Boston, MA) in Sept 2010", "Interview Descriptions": "phone first, and meet the boss. It is just a school work and it's easy. The key is that you are a honest, loyal person. oh, yes, you need to work hard. Most important, if you promise you will work there for one semester, you must not obey your words.", "Interview Questions": "N/A"}, {"date": "5 Jul 2012", "title": "Cashier, Server, Barista Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Boston College (Chestnut Hill, MA) in Sept 2010", "Interview Descriptions": "This was very easy--I just needed to speak with the management as early as possible in order to have a casual interview and secure a spot.", "Interview Questions": "Prior Experience?"}, {"date": "12 May 2010", "title": "Alumni Relations/Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Boston College (Chestnut Hill, MA) in May 2008", "Interview Descriptions": "I interviewed for multiple available positions in the Advancement Division of Boston College of over a several month period. I had positive phone interviews, in-person interviews and each time I was the \"control\" for internal hirings/promotions. The interview process itself featured fairly standard questions. My father and several members of my family are BC alumni/ae so they were quite angry and disappointed in their alma mater for doing this to someone with direct connections to the university. I am now hesitant to ever apply to BC again, although I very much would like to work there. Overall it felt like a disrespectful waste of my time, although it is nice to know that if you are hired from the outside, they do promote from within.", "Interview Questions": "What would be the most challenging aspect of this position for you?"}]]