[[{"date": "7 Jul 2023", "title": "Nutrition Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital (Irvine, CA)", "Interview Descriptions": "For the on-demand interview, you can record, review and re-record as needed. You can practice and go back to the page as needed. There are videos that give the user tips.", "Interview Questions": "Describe yourself professionally. At this time, why are you considering an opportunity at Hoag?"}, {"date": "6 May 2023", "title": "Nurse Practitioner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Irvine, CA)", "Interview Descriptions": "Interviewed during covid. response was fast and interview was with a panel. I decided to stay at my current work as they made an offer/change in position and I wanted a part time position.", "Interview Questions": "They asked clinical questions and approaches."}, {"date": "29 Apr 2023", "title": "Site Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital (Foothill Ranch, CA)", "Interview Descriptions": "I had two phone interviews with two different recruiters before interviewing on site with the hiring manager. The recruiters were pleasant and seemed very candid. The in person interview was unremarkable.", "Interview Questions": "How do you balance competing directives?"}, {"date": "20 Apr 2023", "title": "Information Technology Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Hoag Memorial Hospital (New York, NY)", "Interview Descriptions": "To begin, the application process was a bit tedious. Filling out the application was a manual process, but then you were required to fill out a questionnaire that asked for very similar information. Following that, I waw contacted to verify that I could relocate, since the position was not remote and I was out of state. \nThe initial conversation with the recruiter went well at first, but then shifted quickly. The recruiter did not understand the differences between roles posted, and suggested I apply to several. This was a bit of a put off, and a red flag. They were also concerned about salary, but the range they posted in the job ad was too large to get a feel for the real hiring salary. I asked what the true range was, but only got a vague response. \nAfter the inital call, I was told that an interview would be set up with the hiring manager. It took about a week for them to reach back out to me. It went downhill from there. First, before the interview I was sent a link that asked for 5 references, at least two direct managers. They wanted them within 24 hours. I asked for a delay, and it was approved, until after the interview with the hiring manager.\nThe interview was scheduled a few days after. No one showed up for the interview. After waiting 10 minutes, for a 30 minute interview, I reached out to the hiring manager. They apologized and said something came up and they would jump on the call immediately. Well, it only got worse from there. The manager was unprepared and did not know who I was, what my background was, and had no questions prepared. This was odd, but also very disappointing. There was no enthusiasm and it was like they didn't want to be there. I asked the majority of the questions, and when I got to the expectations of the role I couldn't get clear responses. The only thing they were concerned about was the salary. I gave a number in the middle. Was told to expect a call in 2 weeks, never was contacted. Followed-up with recruiter, no response.", "Interview Questions": "What are your salary expectations?"}, {"date": "23 May 2023", "title": "Registered Respiratory Therapist (RRT) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Apr 2023", "Interview Descriptions": "The interview was a live video, so you would think I wouldn't be nervous, but I was. They asked very good questions but this being my first interview as a new grad showed me how much I needed to polish up on the things I had learned at the beginning up school, before reapplying.", "Interview Questions": "1. Walk me through setting up for an intubation. 2. A 16 year old male comes into the ED, he tells you \"I..have...used...my....rescue....inhaler....but...it's...not... working. 3. The doctor asks you to assess a patient for weaning off of a ventilator. Walk me through the process."}, {"date": "6 Mar 2023", "title": "Spiritual Care Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "Fast and timely manner. Very thorough. They utilized a third party company to assist with the hiring process. I found the process easy and efficient. I would highly recommend pursuing.", "Interview Questions": "The standard interview questions were use."}, {"date": "3 Mar 2023", "title": "Nutrition Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "The Interview Process consisted of a recorded virtual interview, an interview over call, and then an in person interview. Once you fill out the application online, they should update you with how they will like to interview you.", "Interview Questions": "How did you deal with a difficult situation?"}, {"date": "18 Feb 2023", "title": "Member Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "I applied online, then a couple days later I got an email from a recruiter to set up the phone interview that took like 30 min was pretty easy and professional. On that same day got another email to give my references 5 total needed.Then a week later got a call from a supervisor to set up a in person panel interview with 5 members, three supervisors the trainer and the director. Very nice group of people made me feel very comfortable took about 30 min and just asked a few more questions about myself and why healthcare position. They said still had more interviews to go through I would hear back something in 1 or 2 weeks. Fingers Crossed!! I would love to work here! Good Luck!!", "Interview Questions": "Why Hoag? Why this position?"}, {"date": "8 Feb 2023", "title": "Front Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "Applied online. Got a call for an In person interview. Interviewed with two managers. They asked several basic interview questions: 1. Tell me about yourself 2. What are your strengths/weaknesses 3. Tell me about a time when… Then My recruiter called me that afternoon. It takes several weeks before you start because of all the onboarding tasks.", "Interview Questions": "Tell me about your past employment history?"}, {"date": "10 Apr 2023", "title": "Insurance Verification Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Feb 2023", "Interview Descriptions": "I got interview in person after 2 weeks applied. The interview was going well. After 2 months, I still never receive their email or anything if I get hire or not.They take really long time to decide it though", "Interview Questions": "What is your strengh? Tell me about yourself"}], [{"date": "25 Jan 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "I applied online and received an email the same week to schedule an interview which was a in-person panel interview with 4 nurses. Very kind and welcoming. Scheduled a phone interview with HR the following week and received the job offer within 2 weeks.", "Interview Questions": "Tell me about yourself ."}, {"date": "4 Jan 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "Had an onsite interview with the unit manager. Then, had an interview with HR. Had to submit 5 recommendations from previous employers. The process was pretty fast. Easy to reach out to the recruiter/HR. Everyone is on the same page.", "Interview Questions": "Common nursing interview questions. Strengths and weakness Experience Why this hospital and unit ..."}, {"date": "3 Jan 2023", "title": "Patient Care Assistant (PCA) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "The referral got me an interview. The hiring manager was kind and easygoing and asked 5-6 basic questions. The front desk was also cheerful so it eased my worries going in.", "Interview Questions": "Tell me more about yourself"}, {"date": "22 Feb 2023", "title": "Licensed Vocational Nurse (LVN) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital in Jan 2023", "Interview Descriptions": "They called back right away and schedule an interview for the following day. It was a lot of getting to know you questions, and only a couple clinical questions. Felt like a conversation. It was great.", "Interview Questions": "Tell me about yourself. What would you do in this situation?"}, {"date": "3 Apr 2023", "title": "Insurance Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 8 weeks. I interviewed at Hoag Memorial Hospital in Jan 2023", "Interview Descriptions": "Got the interview after a week I applied .The two managers of department interview.They was nice but never got any notify if I get hired or not.They take long time to let you know if you get hired or not", "Interview Questions": "Tell me about yourself?why Hoag? How to deal with irritate patients?"}, {"date": "2 Dec 2022", "title": "Certified Epic Principal Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "Interview process was Quick. Everyone was super friendly. This was a virtual interview I had 3 interviews. Panel interview, supervisor interview and manager interview. Offer within 1 week. Interview process was Quick. Everyone was super friendly. This was a virtual interview I had 3 interviews. Panel interview, supervisor interview and manager interview. Offer within 1 week.", "Interview Questions": "Why are you the ideal candidate for this position"}, {"date": "17 Oct 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Hoag Memorial Hospital (Irvine, KY) in Oct 2022", "Interview Descriptions": "The interview was not too bad, pretty easy. They were questions you would expect such as why this hospital and questions about experience. HR asked all the questions then met with managers of unit as well for a run down", "Interview Questions": "Where do you see yourself in five years, why Hoag, situation where you helped a coworker"}, {"date": "3 Jan 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Oct 2022", "Interview Descriptions": "Took several weeks. Interview questions were case studies, asked my 5 year plan. I had two separate interviews one with the recruiter and one with the unit manager via zoom.", "Interview Questions": "Where do you see yourself in the next 5 years?"}, {"date": "18 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Sept 2022", "Interview Descriptions": "There was a two part interview with the nursing director and HR, standard 5-6 questions with a scenario question to allow for critical thinking. They were accommodating to my location and allowed me to zoom in.", "Interview Questions": "Why did you apply to Hoag?"}, {"date": "20 Oct 2022", "title": "Member Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hoag Memorial Hospital (Costa Mesa, CA) in Sept 2022", "Interview Descriptions": "We talked about my current role and my previous experience. Then we talked about my expectations for the role as well as what the company expects and went into detail of what type of role it would be. Then we proceeded with any additional questions I had for the recruiter. Ending with a follow up date on a next interview.", "Interview Questions": "Name a time you went above and beyond with your customer service to a patient."}], [{"date": "24 Aug 2022", "title": "X-Ray Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "It was a good first interview. There was two people who interviewed me at the same time. They asked the generic questions any interviewer would ask. Very nice people and seems like a good workplace.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "5 Jul 2022", "title": "Licensed Vocational Nurse (LVN) Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "Easy and friendly phone interview. Basic simple question, tell me about your education and experience, in detail, what do like about being a nurse, what do you know about Hoag hospital and why do you want to work here", "Interview Questions": "Tell me about your self "}, {"date": "29 Jun 2022", "title": "RN OR Circulator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Jun 2022", "Interview Descriptions": "Asked several personal questions about experience. Had to explain my good traits, and what I was looking for in a job.very informal. They spoke about the facility and gave me a tour .", "Interview Questions": "How do you handle stress. What are your strong traits. Where do you live?"}, {"date": "30 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Irvine, CA) in Jun 2022", "Interview Descriptions": "Submit resume to job board, interview with HR, interview with director and/or clinical supervisor/managers. Onboarding process consists of background check, drug testing, immunizations, fit testing, series of courses for new hires.", "Interview Questions": "What was a difficult clinical situation and how did you handle it?"}, {"date": "13 May 2022", "title": "Behavior Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "First, you will get a phone call to discuss your interests. then, a face to face interview will be scheduled. After your interview, you will wait a week to hear from the HR about the offer.", "Interview Questions": "Tell me about yourself? Why do you want to work here?"}, {"date": "26 Apr 2022", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Hoag Memorial Hospital (Tustin, CA) in Apr 2022", "Interview Descriptions": "Long wait for return call after interview. Interviewed twice. Thought everything went well and after 3 weeks decision not made. Nice staff but they take too long to make an offer.", "Interview Questions": "Describe what you will bring to office "}, {"date": "14 Mar 2022", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "tedious and thorough to vet staff according to required skills - work samples and skill related questions with multiple rounds of interviews. long background check process with required screening for health and drug tests", "Interview Questions": "why do you want to work at Hoag? explain your experience in the said role "}, {"date": "17 May 2023", "title": "Insurance Verification Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Feb 2022", "Interview Descriptions": "Met with department manager to review the job descriptions. Two other people from the department in the interview as well, very casual. Normal interview situational questions. Gave time to ask questions to them.", "Interview Questions": "Describe a time you had to deliver disappointing news to a patient."}, {"date": "14 Dec 2021", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "There was first an online interview were you recorded yourself and then you get a phone interview. There is also a form you have to send to your references so they can fill it out.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "12 Jan 2022", "title": "Patient Care Associate (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Dec 2021", "Interview Descriptions": "Smooth, more conversational which made the entire process fairly painless and nerve-wracking. The interviewer was very sweet and funny. The interviewer asked some questions about my resume but it wasn't hard in the least.", "Interview Questions": "Why do you want to work at Hoag?"}], [{"date": "5 Nov 2021", "title": "Patient Transporter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "The interview was on the phone and it was very pleasant. The questions posed were relevant to the position and clear. Overall, it was very professional and I was able to have a good interview.", "Interview Questions": "Q: What days would you be available to work?"}, {"date": "5 May 2022", "title": "HR Operations Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hoag Memorial Hospital in Nov 2021", "Interview Descriptions": "There was an initial interview with a recruiter. Next, there was an interview panel with my future teammates where I was posed a lot of questions and I was asked to prepare a presentation for them. Last, we ended in an interview with a senior executive", "Interview Questions": "They asked me to prepare a presentation on which to brief the team "}, {"date": "26 Oct 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "Be prepared to answer scenario questions based on specialty. Some interviews are still virtual depending on area applying for. Quick replies for job offers. Great new grad program and mentor program for all new hires.", "Interview Questions": "If you do not know how to treat a patient in a certain situation what would you do?"}, {"date": "19 Oct 2021", "title": "MEDICAL Lab Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "There's a screening that pretty much asks if you have any experience in the position and know anything about the hospital. \n2nd interview asked what you would do if there was a dramatic critical value in the lab, if you feel comfortable with troubleshooting, and if you're able to have a conversation.  \n3rd interview: talk to HR", "Interview Questions": "Do you have experince with the position?\nWhat's your education?\nHave you made a profile with the hospital?\nWhat do you know about the hospital?\nDescribe how an opportunity here aligns with your career and educational goals?"}, {"date": "29 Aug 2021", "title": "Patient Care Associate (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hoag Memorial Hospital (Huntington Beach, CA) in Aug 2021", "Interview Descriptions": "I got a call for a phone interview and had the interview the next day. It lasted about 30 minutes and I was asked a wide range of interview questions. I was told I would here back from HR in one to two weeks. I received a call less than a week later offering me the job! Overall a great experience.", "Interview Questions": "What would your current manager say you need improvement on? "}, {"date": "13 Jul 2021", "title": "UM Clinical Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "The interview was with the hiring manager and the department head. It consisted of an in person interview, followed by an authorization knowledge assessment. The interview was about 30 minutes and for the assessment I was given 20 minutes", "Interview Questions": "What Clinical experience do you have with authorizations?"}, {"date": "27 Aug 2021", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Jul 2021", "Interview Descriptions": "2 Step Interview Process.  First a call with HR regarding basic work history and culture fit/ behavioral questions.  Then panel interview within the Resp. Care Department and specific questions relating to our field and patient care.  Also situational questions regarding coworker conflicts and teamwork dynamics.  Interview with department personelle lasted around 30 mins.", "Interview Questions": "List the equipment needed for intubation?\n\n"}, {"date": "31 Aug 2022", "title": "Telemetry Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Jul 2021", "Interview Descriptions": "Very personal. Asked questions about self and former work and how it would contribute to the hospital. Overall the interview was insightful and very transparent, was very clear about low  pay but great benefits and perks at hoag.", "Interview Questions": "Tell me about yourself and what you can contribute to this position from former work you've done?"}, {"date": "21 Jun 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "1st interview with recruiter then 2nd interview with hiring manager. Both were very nice and professional. The first interview is mainly about going over your resume and what your availability is. Overall a good experience.", "Interview Questions": "Work history? \r\nWhy did you choose this field of work?"}, {"date": "4 Jun 2021", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "I first received a call from a recruiter for a telephone interview and then I came in person for an interview with the supervisor. I only had one in person interview and was offered the job a few weeks later, however I am not sure if this is the typical interview process for all Hoag facilities.", "Interview Questions": "Why do you want to work for Hoag?"}], [{"date": "17 Mar 2021", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "Interview was conducted on Zoom. Dress professionally. Questions were easy. Manager was friendly. HR and director both interview you separately. Asked behavioral questions and questions about experience level. \n\nlevel of experience/ type of patients you handled\ndifficult coworker and how did you handle", "Interview Questions": "level of experience/ type of patients you handled\ndifficult coworker and how did you handle"}, {"date": "8 Jan 2021", "title": "Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "After sending out my application, I got an email to complete the on-demand video interview, then had a short phone call with HR, and finally got invited for the in-person interview with 2 people.\r\n\r\nOne of the interviewers was very unprofessional and seemed like she had already made up her mind the moment she saw me. The other interviewer asked her manager to start asking me questions since she was her senior but she yawned and asked her to take over. She looked at her phone a few times during the interview and didn't even try to give a proper welcome/walkout/goodbye. Overall, a bad experience, and I received so many negative clues during the interview that I just wanted to finish and leave as soon as possible.", "Interview Questions": "What are the most important things you look for in a workplace?"}, {"date": "4 Dec 2021", "title": "Pct Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hoag Memorial Hospital in Jan 2021", "Interview Descriptions": "It was a very smooth process but it did take awhile to hear back. It consisted of 2 rounds of interviews. The interviewers were friendly and made you feel very comfortable. They asked basic questions regarding personal character and patient care.", "Interview Questions": "How did you handle a time of conflict? Give example of a time you were wholeheartedly there for someone?"}, {"date": "21 Oct 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Jan 2021", "Interview Descriptions": "Interviewed with unit director. Interview was very casual and easy-going, and finished with a tour of the unit. Lasted about 30 minutes.  All my questions were answered, and I am excited for my future role", "Interview Questions": "Why do you want to work on this unit ?"}, {"date": "16 Dec 2020", "title": "Human Resources Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "Video interview, phone interview and two separate in person interviews with a total of six different people, all were very professional. Interviews conducted over a thirty day period, job offer received within ten days", "Interview Questions": "Tell me about a time when you had to deal with change within the organization"}, {"date": "10 Dec 2020", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Dec 2020", "Interview Descriptions": "I applied through the website. Got a phone call to schedule a phone interview. After the phone interview they called me back to schedule an in-person panel-style interview. Afterwards is the onboarding process.  They gave me a choice in roles.", "Interview Questions": "Asked about experience, how comfortable am I with learning new technology,  why I left my previous positions. It was all very basic. They are very friendly and super nice. You can tell they're a team."}, {"date": "31 Dec 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital in Dec 2020", "Interview Descriptions": "I applied online, got an email to set up an interview on the phone, and was told I would get a call back in two weeks but never did. They asked me if i'm willing to negotiate salary.", "Interview Questions": "Why do you want to work at Hoag?"}, {"date": "20 May 2021", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Dec 2020", "Interview Descriptions": "You have to apply online, then you are contacted via email or phone call to set up a screaming interview over the phone.  After that you will be contacted by the unit manager’s secretary to schedule an interview with the manager.  The whole process took me about two months but once I interviewed with the manager I was hired quickly.   I think the hiring process and time frames are a little longer due to COVID but things seem to be returning to normal.", "Interview Questions": "These are individualized according to your resume."}, {"date": "8 Dec 2020", "title": "Hospital Clerk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital in Nov 2020", "Interview Descriptions": "The recruiter called me and asked questions about my resume and mainly questions about myself. Everything went smoothly; however, she did not email me like she said she would. That was very unprofessional.", "Interview Questions": "What do you like to do on your free time?"}, {"date": "17 Nov 2020", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Oct 2020", "Interview Descriptions": "Human resources contacts you to schedule a phone interview then sends you a link for 5 references. After the HR interview an in-person interview with hiring manager is scheduled. It takes a couple weeks to hear back from the hiring manager once all your application information is reviewed", "Interview Questions": "Goals, why Hoag, past experiences"}], [{"date": "24 Sept 2020", "title": "Manager of Special Events Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "I was screened by an HR representative and told that I would get a second call to set up an interview the following week. Fast forward a month, 3 follow up emails, and a phone call to the HR department I was told I would be called soon for that interview. Another week later, I get an email saying I wasn’t selected. I wish they had been more upfront and honest or even responsive! Very frustrating.", "Interview Questions": "N/A"}, {"date": "8 Sept 2020", "title": "Guest Screener Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Sept 2020", "Interview Descriptions": "I applied online. Got an email a week and half later asking to schedule a phone interview with a recruiter. I then received an email saying I needed to get 5 professional references, preferably within 72 hours. Then 2 days after turning in my references I received an email to schedule a second interview. The hiring manager was very kind and the interview questions were more or less standard. I'm expected to hear back from them sometime this week so I'm truly hoping for the best! Overall experience was good.", "Interview Questions": "What are your greatest strengths?"}, {"date": "30 Sept 2022", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Costa Mesa, CA) in Sept 2020", "Interview Descriptions": "Very easy. Group interview with the team was engaging. I was able to see how well the group interacted together.  I was also able to interview with the team without the manager. ", "Interview Questions": "Do you prefer group or individual projects "}, {"date": "17 Aug 2020", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "After application process received an email for HR interview. Then phone interview with HR as well as written Q and A for things such as “what are my expectstions”. After I had a phone and in-person interview with the clinical director", "Interview Questions": "Describe an eval process for a patient post CVA "}, {"date": "18 Aug 2020", "title": "IP Physical Therapy Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "After application I had a phone interview with HR which involved filling out a questionnaire in regards to my experiences and expectations with pay. I then moved on to a phone and in-person interview with the clinical director", "Interview Questions": "Description of in patient experience"}, {"date": "12 Aug 2020", "title": "Patient Sitter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "Called a few weeks after application for in person interview,  and got a call about a day afterwards for the position. I had also applied to a volunteer position at this location but was happy to take this one instead. Great side job 8 hour shifts while in school.", "Interview Questions": "What is the main goal of this job?"}, {"date": "15 Feb 2021", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital in Jul 2020", "Interview Descriptions": "Was first texted about a interview. Then I got a call for a over the phone interview. When the first interviewer liked me, I was set up for a in person interview.  After that, I called about a offer.", "Interview Questions": "Tell me about yourself?\r\nTell me about your experience?"}, {"date": "20 May 2020", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "You first get a phone interview with the talent acquisition team. They then filter you out. The next step is the panel interview with the main leaders in the department.", "Interview Questions": "Why Hoag?"}, {"date": "22 May 2020", "title": "Member Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hoag Memorial Hospital in May 2020", "Interview Descriptions": "The interview process was very straight forward. First step was applying on the Hoag website, followed by an invitation to do a video on demand .  The video on demand interview was easy to understand. They asked for short videos asking general interview questions. HR was very efficient with getting back to me about receiving the interview. They asked for a couple days so the hiring manager could view the application. By the end of the week I was invited to have a panel interview with 4 leaders. The panel interview was not as easy as the video on demand, but that is because the panel interview was over the phone due to the pandemic circumstances.  They said they would get back to me a week later. HR contacted me a couple days later with an offer.", "Interview Questions": "What has been your best professional accomplishment?"}, {"date": "1 Dec 2020", "title": "Nutrition Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Apr 2020", "Interview Descriptions": "The Interview screening process was online. I applied online and was given an email instruction to submit an online video interview with interview questions given ahead of time.There were general questions and then about 7 video questions that you could re-record if needed.", "Interview Questions": "Describe a problem and how you solved it. "}], [{"date": "11 Mar 2020", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "Awesome", "Interview Questions": "Why Hoag?                                                                  "}, {"date": "4 Mar 2020", "title": "MSW Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "Met with MSW supervisor, the interview was 1 hour in length and extremely informative. The supervisor went over a lengthy powerpoint and it was a mutual interview. I was able to ask many questions and the employer was happy to answer them thoroughly", "Interview Questions": "Experience"}, {"date": "12 Feb 2020", "title": "Nutrition Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "The application process was easy to follow. The online application was used to centralize all pertinent work experience and allowed to add a cover letter. It was difficult for me to write the cover letter.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "5 Mar 2020", "title": "Imaging Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Orange, CA) in Feb 2020", "Interview Descriptions": "I was called by a recruiter and we spoke briefly, asked basic questions about qualifications.  The following week I was scheduled for an in-person interview.  I was sent a link that required me to provide SIX references.  The references had to complete surveys online about me. \r\n\r\nThe SIX references are significant imposition and not necessary.  There is no evidence that this will tell them about who the best candidate is.  It is intrusive and I don't like to impose on my colleagues if I don't have to.  Employers think they can make people do anything to get a job, even a casual no benefits position.  I would not apply at Hoag again.  The process is disrespectful of the candidate and intrusive.  I tried calling the recruiter, he never called me back.   Job hunting for regular work these days is becoming a huge cattle call.", "Interview Questions": "Basic questions from the recruiter about my credentials.  The in-person interview was very nice.  However, when I asked what happened to the person who previously had this position she told me something like, she didn't work hard or didn't understand her work and that (as I understood her) they didn't like her.  This was a bit of a red flag.  "}, {"date": "3 Dec 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Newport Beach, CA)", "Interview Descriptions": "Very relaxed environment, and nothing tricky, all basic questions that were expected. Met with the directer and manager and also a phone interview with a Human Resources recruiter.  Manager interview was more clinical based questions and human resource recruiter was more formal business like, getting to know me and how my fit would be.", "Interview Questions": "Why do you want to work on this unit? "}, {"date": "26 Nov 2019", "title": "Cerified Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Hoag Memorial Hospital (Newport Beach, CA)", "Interview Descriptions": "2 step process.  1st step interview with supervisor and once you get the \"you're hired\", he sends you to HR to fulfill a computer competency test and fill out all the forms including a signature for background check. If you pass the computer competency test and background check, they will have you return for employee badge and start date.", "Interview Questions": "Do you think you can be on time for morning draws at 4:30am?"}, {"date": "9 Jan 2020", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Oct 2019", "Interview Descriptions": "Applied online, about two weeks later I got an email from the recruiter to schedule a phone interview.   My phone interview lasted 30 minutes where I was asked general questions about my general experience, my interest and personal goals.  A week later a got a call for a face interview with the department nursing staff. After my face interview couple days later I got a call from human resources for a job offer. After that I got to work on my background, physical and references stuff. I started orientation two weeks later. The whole process went pretty quick .", "Interview Questions": "Why I was interested in that specific hospital. "}, {"date": "23 Sept 2019", "title": "Physician Support Services Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "Positive in-person interview with two managers. Very smooth process with Hoag Medical Group. They made me feel comfortable when answering the questions and it was a great learning experience.", "Interview Questions": "How could I contribute to the company?"}, {"date": "18 Oct 2019", "title": "Maintenance Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Hoag Memorial Hospital (Irvine, CA) in Sept 2019", "Interview Descriptions": "Phone interview was very friendly and professional. In person interview was also professional with detailed questions and description of exactly what was expected. schedule and benefits discussed in detail. Interview was with two managers at once.", "Interview Questions": "Past work experience in detail, What would you do if certain problems happened."}, {"date": "10 Oct 2019", "title": "Instrument Technician - Certified Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Aug 2019", "Interview Descriptions": "I was first contact by the HR recruiter who screened me via a phone interview, was set up for an in person interview on the phone after the interview. The in person interview was the most laxed interview I've ever been to which really helped me to be myself. They were really interested in my time at a private medical company as well as the certification program I went through. Just as a side note - I received the unofficial offer on Monday via phone call, I am currently waiting on the official offer in writing.", "Interview Questions": "What are your short term/long term goals?"}], [{"date": "19 Sept 2019", "title": "RN, Bsn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Hoag Memorial Hospital in Jun 2019", "Interview Descriptions": "Had four interviews. Managers are warm and welcoming. Asked questions regarding past experience and why I chose my career path. Did not feel intimidated by the interview questions. Process took three months.", "Interview Questions": "What are your long term career goals? "}, {"date": "19 Jul 2019", "title": "AP Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hoag Memorial Hospital (Costa Mesa, CA) in May 2019", "Interview Descriptions": "Received an email to set up a telephone interview. Which led to an in person interview onsite. The recruiter did not state that the job was temp to hire. There were 13 temp positions that would all be in competition to fill 1 permanent spot.", "Interview Questions": "What kind of management style do you like"}, {"date": "4 Jun 2021", "title": "Pathology Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Apr 2019", "Interview Descriptions": "Pretty easy, there is one interview where you get to prerecord your answers as many times as you want before final submission. Then there is one in-person interview with similar questions", "Interview Questions": "Describe your ideal work environment"}, {"date": "27 Feb 2019", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hoag Memorial Hospital (Costa Mesa, CA) in Feb 2019", "Interview Descriptions": "The process is too ardous.  They require a self-made video where you introduce yourself, answer some technical question.  Then you have to submit a reference list of at least 5 professional in which 2 have to be in the managerial position.  These references have to respond to a web-based questionnaire on your skill, and all of these are even before a phone interview and an in-person interview", "Interview Questions": "What is your least favorite thing to do at your job?"}, {"date": "2 Jan 2019", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hoag Memorial Hospital (Newport Beach, CA)", "Interview Descriptions": "Long. You have to do a video interview first, then a phone interview, followed by a in person interview. From there, they decide if they want to hire you or not. Took them a while to make a decision but after they hire you, you do an orientation from 8-5.", "Interview Questions": "Name a time you had conflict with a coworker and how you resolved it. "}, {"date": "14 Dec 2018", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA)", "Interview Descriptions": "Depends on the candidate. Usually there's one telephone interview with a recruiter, one telephone interview with a manager/director, one small panel interview, and a one-on-one interview with a VP/president. The process can be quite lengthy, but worth it in the end. All behavioral questions. Background check, references survey, physical health screening, and drug test required. The references WILL be followed up with after the survey, and they check which IP address they come from, so no faking recommendations. Marijuana is still tested for, even though it is legal in CA, but you will have 2 weeks to prepare for your doctor's appointment.  Hoag does a full health screening including a TB test, so there are 2 appointments needed the week before you're hired.", "Interview Questions": "Think of a time when you had to deal with an unhappy customer or patient. Describe the situation and how did you handle it?"}, {"date": "18 Oct 2018", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Aug 2018", "Interview Descriptions": "I was contacted by their recruiter 2 days after placing in my online application.  She was friendly and told me that the nursing manager will call me.  No one ever called me.", "Interview Questions": "The recruiter asked about my thoughts regarding Hoag not having a nursing union. "}], [{"date": "2 Sept 2018", "title": "Radiology Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hoag Memorial Hospital (Irvine, CA) in Jun 2018", "Interview Descriptions": "I submitted an application online and was contacted the next day via email to set up and complete a video interview. The video interview consisted of an introduction and a few basic questions in which my answers could be recorded multiple times until I was happy with the answer.\r\n\r\nAfter that the site supervisor called me to set up an in-person interview. My interview lasted about 30 minutes. I interviewed with the supervisor and lead technologist.\r\n\r\nHR then required 5 references, 2 of which were former supervisors. They sent each of the references a survey to fill out about me and my qualifications.\r\n\r\nAfter the references were obtained HR conducted a background check which was actually completed really really fast.\r\n\r\nAbout 3 weeks after my original application HR contacted my to offer me the position.", "Interview Questions": "Give an example of a time you dealt with a difficult patient."}, {"date": "7 Jun 2022", "title": "Tech Support Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Jun 2018", "Interview Descriptions": "Pretty straight forward interview. Had a total of 11 people interview me.\nWent through my background in the health insurance industry.  Specifically my time at Aetna.\nWas a pretty easy interview.", "Interview Questions": "What was the hardest problem you had at your prior employer Aetna and how you overcame it?"}, {"date": "25 Apr 2018", "title": "EEG TECH Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA)", "Interview Descriptions": "Process took some time as I had to gather  references that would fill out the requiered reference form online (5 references) basically they have to complete a questionnaire about you. After that has been reviewed the process took a week. My interview Lasted one hour and didn't even get the job. Finally, I had to pay for parking :( I thought maybe I got the job because the interview was Soo long! Anyways good luck to you all.", "Interview Questions": "Question was about an example of a difficult situation and how It was handled"}, {"date": "4 Apr 2019", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Hoag Memorial Hospital in Apr 2018", "Interview Descriptions": "Relaxed and conversational. The interviewer was friendly and after she went over some initial typical interview questions, we chatted and she let me tour the unit. She is no longer working on the unit.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Mar 2018", "title": "Outpatient Admissions Representative III Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Hoag Memorial Hospital (Irvine, CA)", "Interview Descriptions": "After applying online, I was contacted by phone and set up an interview at Hoag’s Breast Center in Irvine. The interview lasted for what seemed like 5 minutes. It was super brief and informal, no behavioral questions at all. However, the most appalling thing that happened was that the manager stated the job description was not “that accurate.” In fact, the position was completely different than what I applied for. I thought it was peculiar she couldn’t have mentioned this briefly over the phone before wasting my time.\n\nThe job description was basic front office work - verifying eligibility, prior authorizations, scheduling. What they are actually hiring for is a transcribing in the back office. When the manager asked if I had any experience with transcribing, I told her I didn’t and the interview basically ended. (Note: I do have 7 years’ front office experience, however.) I felt so blindsided and frankly stupid, as if I knowingly applied for something I wasn’t qualified for. I have no idea how they will fill this position as I see the same job description and title are still the same online. Hoag is a great organization and I would still love to work in a different department, but this reflects poorly on their management team.", "Interview Questions": "None"}, {"date": "11 Sept 2018", "title": "Health Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Feb 2018", "Interview Descriptions": "Met with 10 people, two at a time. Talked about certain scenarios you would encounter working in a hospital and asked what you would do in that scenario. Also you would be in a pair of two people while rotating interview", "Interview Questions": "Why do you want to work here"}, {"date": "30 Nov 2019", "title": "EVS Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Nov 2017", "Interview Descriptions": "They call you on the phone, and someone from HR will do a phone interview first. Then they will have the Manager of the department you are applying for interview you in person.", "Interview Questions": "They asked you very basic questions, Why do you want to work here, tell me a time when you had to break rules at work, tell me something you struggle with, tell me something good about yourself, and why should we hire you. They were all very nice. "}], [{"date": "27 Jun 2017", "title": "Ora Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Newport Beach, CA)", "Interview Descriptions": "Single person standard interview questions that was straight forward. I think the interview was a formality to see if we were a good fit for one another. The interview itself was more of a get to know you interview as opposed to my qualifications, which were obviously met.", "Interview Questions": "Why do you  want to work for Hoag?"}, {"date": "8 Mar 2017", "title": "Nutrition Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "There was a phone screening which took about 15 minutes which was then followed by a brief phone interview with a hiring employee in the nutrition department. Last was the in-person interview with a RD on staff. It was a smooth and pleasant interview process.", "Interview Questions": "Why are you looking to leave you current job?"}, {"date": "12 Jan 2019", "title": "Clinical Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Mar 2017", "Interview Descriptions": "There were 2 people interviewing and there were many \"What would you do in this scenario\" questions and why I chose this job. It was a group panel with other applicants being interviewed at the same time that I was. This interview was next to the cafeteria although the space was closed so that the applicants could be interviewed.", "Interview Questions": "They asked what do I hope to accomplish with this experience."}, {"date": "2 Feb 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "With critical care recruiter. Asked about experience, told me about the avaliable units, asked me what my preference was. Discussed follow up. It went well over all she was very kind and had good feedback. Very informative about hoag and all it has to offer.", "Interview Questions": "Why hoag? Tell me about a difficult situation at work. Tell me about your current organization and management."}, {"date": "26 Feb 2017", "title": "Tele Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital in Feb 2017", "Interview Descriptions": "1st interview is a phone interview with a recruiter.  Basic questions on why you chose health care and the like.  Then they email you a request for references to be returned in two days.  Then you await to be contacted for a face-to-face interview.  I'm currently waiting.  I applied for the brand new job posted in mid-February.  Job is to be filled by end of March.", "Interview Questions": "Relate one situation on the job where things went south and how you handled it."}, {"date": "12 Nov 2020", "title": "Charity Fundraiser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Aug 2016", "Interview Descriptions": "Panel interview, challenging questions, not sure the point of the panel besides deciding on if I was a cultural fit.  Only had one round. They have a strong team and it is apparent they work well together.", "Interview Questions": "Don't remember, they seemed to challenge the type of fundraising I did and question the validity."}, {"date": "3 May 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Hoag Memorial Hospital (Newport Beach, CA)", "Interview Descriptions": "I had an interview with the recruiter and she asked some basic questions and some skill based and scenario questions. Was then called by administration to schedule an interview with the Director of Nursing for a specific unit. I met up with the Director and discussed my interest in being with the company, a typical day for me at my previous job, my skill set , and what my goals are. Got an email asking for 5 references and then got a job offer 4 days later. Had to then take an EKG test and pass and then start the pre employment process.", "Interview Questions": "Describe a moment where you had a conflict or obstacle at work and how did you handle it?"}, {"date": "25 May 2016", "title": "Front Office Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in May 2016", "Interview Descriptions": "I applied online for a couple positions, one being front office assistant in the Breast Care Center.  I was contacted about 3-4 days after I applied.  I met with the Breast Center director and the manager.  I am currently waiting for a phone interview with HR after receiving an e-mail requesting days and times I am available for a 30 minute call (after about 4 business days after my initial interview).", "Interview Questions": "What experience do you have with scheduling patients?"}, {"date": "22 May 2016", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hoag Memorial Hospital (Corona, CA) in May 2016", "Interview Descriptions": "Phone Interview first to be followed up with a phone call for a second interview. The recruiter was very polite and helpful to guide on how the 2nd interview will be and how to answer questions better", "Interview Questions": "What was a specific criticism you recieved, and how did you take it and improve from it?"}, {"date": "20 May 2016", "title": "RN Labor and Delivery Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Mar 2016", "Interview Descriptions": "It took a long time before they send me an email, wondering when I can have a phone interview. When the phone interview was scheduled they cancelled it without letting me know, then they scheduled the interview a week later. The recruiter called me and asked some general questions about my work experience, my education and the recruiter gave me some info about the workplace. Then within 24 hours I had to type in 5 references (2 of them had to be managers) with their emails and phonenumbers. I never heard anything more, just that the position was not available anymore.", "Interview Questions": "Tell me about a situation in your previous job, just any workrelated situation."}], [{"date": "16 Feb 2016", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Nov 2015", "Interview Descriptions": "I met with the director of the unit and also with the charge nurse that was on that day. They asked a few different behavioral type questions. Also, why I chose that hospital. It was a surgical floor so they also asked me one question about a patient scenario.", "Interview Questions": "How did you deal with a difficult co-worker?"}, {"date": "11 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Hoag Memorial Hospital (Irvine, CA) in Sept 2015", "Interview Descriptions": "phone screening first followed by a panel interview. Standard...review online. Some situational.Prepared by reviewing, online searches. It's tough because there are multiple people asking the questions and staring at you while you are answering. Its awkward.", "Interview Questions": "Standard...review online. Some situational"}, {"date": "13 Jan 2017", "title": "Instrument Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Sept 2015", "Interview Descriptions": "Asked questions about my knowledge of the instrumentation process and what equipment I had used in the past. They were professional but not intimidating. Very welcoming. After the interview they showed me the sterile processing department and what I would be doing once I was hired.", "Interview Questions": "They asked where I saw myself in five years."}, {"date": "27 Feb 2016", "title": "Client Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Hoag Memorial Hospital (Midway City, CA) in Sept 2015", "Interview Descriptions": "The interview processes takes you from an interview with the hiring manager, followed by interviews with the educators, Burke testing,  and another interview with the hiring manager. If you get this far, you will interview with the company owners. In my case, they added another layer. They had added a new director/hiring manager. The whole process took 5 months", "Interview Questions": "Describe your management style."}, {"date": "29 Sept 2015", "title": "Teletech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hoag Memorial Hospital (Orange, CA) in Aug 2015", "Interview Descriptions": "Originally applied for telemetry RN position but was contacted by phone by nurse recruiter to discuss if I would be open to the option of starting in a support role and then be integrated into an RN position role later. The phone interview essentially was for the support role of a tele tech. Went well and was contacted a week later for another phone interview.", "Interview Questions": "Tell me about yourself."}, {"date": "11 Feb 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Hoag Memorial Hospital (Irvine, CA) in Jun 2015", "Interview Descriptions": "very straightforward, quick and professional.  I was contacted by the nurse requite first and then on to the unit manager.  \r\nThere was a panel interview and a skills test.  Nothing out of the ordinary for an RN position.  Of course there is a urine drug screen.  \r\nI was also given a tour of the department, and met some of the other staff.  \r\nWhen I accepted, I received an email from the staff that I met to welcome me.  This made me feel very welcomed.", "Interview Questions": "Experience and why I wanted to leave to come to Hoag"}, {"date": "17 Mar 2015", "title": "Front Office Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA)", "Interview Descriptions": "Long interview process, ended up interviewing with 4 different people for a few different positions. In the end I got my dream job! I suppose the long hiring process helped them place me in a position where my skills were best utilized.", "Interview Questions": "Describe an instance as manager where you incountered a problem with an employee on your team. How did you handle the situation?"}, {"date": "21 Jan 2015", "title": "Central Supply Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "Applied on the website, received a phone call to set up interview with human resources. The HR interview was over the phone, the person was very delightful to speak to. I was then contacted by the manager of that department. The coordinator of the department interviewed me, the interview was all over the place and unprofessional unlike the HR interview.", "Interview Questions": "Explain a situation where something did not go according to plan, or that failed completely, how did you handle and what was the result."}, {"date": "7 Jul 2015", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hoag Memorial Hospital in Dec 2014", "Interview Descriptions": "Phone interview first with recruiter with typical interview questions and then she sent me a form to fill out more answers to interview questions with scenario type questions.  The recruiter will warn you that there is an in-depth background check and you will also need 5 professional references within 24 hours.  Have them ready, you will need phone numbers and email addresses. Then an in-person interview with unit manager. She asked many scenario type questions as well.", "Interview Questions": "In a time when there was chaos, how did you come together as a team to have a positive outcome."}], [{"date": "27 Feb 2017", "title": "Imaging Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hoag Memorial Hospital (Irvine, CA) in Dec 2014", "Interview Descriptions": "Very lengthy process. Took over a month. Really through even for a low paying position. Had to go through HR first. General phone interview. Then a management interview. Then back to HR to clear all required things.", "Interview Questions": "How long do  you wan to be here?"}, {"date": "8 Feb 2017", "title": "Admitting Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Hoag Memorial Hospital (Irvine, CA) in Jun 2014", "Interview Descriptions": "Started out with a 20 minute phone interview with the recruiter, then I met with the supervisor and lead, fairly casual, simple questions, very standard and easy, the in person interview was about 35-40 minutes.", "Interview Questions": "How are you on customer service? "}, {"date": "6 May 2014", "title": "Admitting Representative III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA)", "Interview Descriptions": "Legit.", "Interview Questions": "Don't be under prepared and you will be fine. Smile and talk about how much you love people and how you skills will easily transition into this environment."}, {"date": "11 Sept 2016", "title": "Clinical Care Extender Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Feb 2014", "Interview Descriptions": "Applied online through the website. I was called in for a group interview. There were three groups. A panel of five people interviewed 3 of us at time. They asked a question and we were allowed to answer at any time. The whole interview took about 30 minutes", "Interview Questions": "What are your strengths? How do you handle a stressful situation?"}, {"date": "25 Sept 2013", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Hoag Memorial Hospital", "Interview Descriptions": "Completely benign. Asked some clinical questions which were basic knowledge.", "Interview Questions": "Treatment recommendations for PE"}, {"date": "15 Feb 2013", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA)", "Interview Descriptions": "I submitted an application online directly on the website on a Sunday. Later that week I got contacted by the hiring manager asking a few questions.  From there, a phone interview with the HR recruiter was scheduled for the following Monday.\r\n\r\nThe phone interview was short and sweet and I was scheduled for an on-site interview on the spot for that Wednesday.  \r\n\r\nThe on-site interview consisted of a panel with a peer and to-be manager.  From there I was directed that if I was to continue, the next step in the process would be a phone interview with the IT Sr Exec, as he was unable to join the on-site interview.\r\n\r\nI got contacted the next day, via e-mail, for a phone interview with the Sr Exec that Friday!  I was told I would hear back within three business days if I was to get the position or not.  \r\n\r\nSure enough, I got contacted two business days later by the hiring manager with an offer!", "Interview Questions": "Based on what you know about the program, what metrics would you measure to show progress or improvement?"}, {"date": "9 Apr 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Feb 2013", "Interview Descriptions": "they will call you to set up phone interview first. then they will set up a face to face interview with a director or with a group of people. It was intimidating to answer all the questions while the other people were watching you. i have passed the interview, but it was one of the worsts I had.", "Interview Questions": "How can you handle a stressful day?"}, {"date": "17 May 2012", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Hoag Memorial Hospital (Irvine, CA) in Apr 2012", "Interview Descriptions": "I was asked where do I see myself in 5years. What I knew about the hospital.", "Interview Questions": "What I knew about magent hospital.I"}, {"date": "24 Mar 2016", "title": "IT Service Desk Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Mar 2012", "Interview Descriptions": "I had a great experience interviewing with Hoag.  They made me feel welcome and happy to meet with me.  When I arrived I was told my interview had changed from the Service Desk Manager to the CTO.  The interview did not feel hurried.  There was a genuine interest in my background and history.", "Interview Questions": "I was asked if I would be able to stand up for myself and let my co-workers know if they were too loud."}, {"date": "1 Mar 2016", "title": "Revenue Cycle Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Feb 2012", "Interview Descriptions": "I was on skype with the directory and two senior rev cycle analyst.  \r\n\r\nThey asked me about my years experience on the Revenue cycle team at Baptist healthcare.  \r\n\r\nThey asked me about HL7 and 4010/5010 ANSII transactions.\r\n\r\nThey asked me about computer languages.", "Interview Questions": "N/A"}], [{"date": "13 Jun 2012", "title": "Medical Records Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Mar 2010", "Interview Descriptions": "I applied to the position, was called by a recruiter from the HR department of the hospital.  I was asked to comply with a background check, drug test, physical exam and tb test. I was emailed a website to go to, printed out the background check document, filled it out, signed, and faxed it to the number I was given.  Then I set up an appointment to do a drug test, physical exam, and TB test.  I was then interviewed by the manager of the department when the results were back.  I called to follow up, and was given a second interview where I was offered the Medical Records Clerk Job.  Three months later, I was promoted to the Medical Records Transcriptionist job by the same manager.", "Interview Questions": "How would you deal with an angry customer?"}, {"date": "20 Oct 2013", "title": "Chief Linical Perfusionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Dec 2009", "Interview Descriptions": "brief and all to the point", "Interview Questions": "N/A"}, {"date": "17 Apr 2009", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hoag Memorial Hospital (Newport Beach, CA) in Oct 2007", "Interview Descriptions": "After submitting an application online, I was contacted very soon thereafter.  The initial phone interview was done by HR and was very personal -- background, where I grew up, interests, etc.  It was more of a conversation between friends than an interview.  That weaved into how I had chosen my career path.  The call lasted about 40 minutes.  I was invited for an in-person interview, which they flew me in for.  I met with the same HR rep I had spoken to on the phone, and then met with my future supervisor and one co-worker.  Everyone was friendly and inviting.", "Interview Questions": "What led me to choose my college major"}]]