[[{"date": "10 Nov 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Susan G. Komen", "Interview Descriptions": "Visited the office and had a conversation with the supervisor and the director of the company. The conversation was very easy going and they did not make me feel like I was under pressure.", "Interview Questions": "Why do you believe it's important to join a non-profit?"}, {"date": "7 Nov 2022", "title": "Mission Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Susan G. Komen", "Interview Descriptions": "Questions about experience in the BC space in the local community. Looking for community connections as much as expertise in the field. Not clear where Komen in moving in the future.", "Interview Questions": "What is your connection to breast cancer?"}, {"date": "29 Sept 2022", "title": "Corporate Partnerships Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Susan G. Komen", "Interview Descriptions": "The process was well defined by HR from the start. It began with a phone screen, interview with the hiring manager and was followed by subsequent interviews with peers and department VP. ", "Interview Questions": "Describe how you would work with cross-departmentally. "}, {"date": "9 Aug 2022", "title": "Executive Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Susan G. Komen", "Interview Descriptions": "Dependent on your Board at the affiliate level. You can count on operations, HR, Development, Grant, and programmatic related questions. If your organization also does advocacy, you'll be required to provide info related to your advocacy efforts.", "Interview Questions": "Provide your experience in Development."}, {"date": "23 May 2022", "title": "Fundraising Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Susan G. Komen", "Interview Descriptions": "Interviews were set up on zoom by the SGK recruiter.  Interviews went very well, but then -nothing.  No feedback or follow up from the interviews, despite my professional follow-up emails. Completely ghosted and very disappointed.", "Interview Questions": "Typical questions - weaknesses, what you do well, why do you want to work here etc. "}, {"date": "8 Apr 2022", "title": "Manager, Strategic Partnerships Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Susan G. Komen in Mar 2022", "Interview Descriptions": "My first interview was a phone call with HR and that lasted about 30 minutes. She immediately set up a second round interview with my would-be manager. That interview was a few days later and I thought it went really well. Obviously it was a personality issue because a few days later I found out that she didn't feel like I was fit for the position. Zero explanation as to why.", "Interview Questions": "She didn't ask that many questions! The ones she did ask were basic like, \"how would you handle someone who didn't want to learn something new.\" "}, {"date": "25 Apr 2022", "title": "Senior Manager of Experiential Fundraising Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Susan G. Komen (Dallas, TX) in Nov 2021", "Interview Descriptions": "I had a 30-minute phone interview with an HR representative who then passed me on to the next round with the hiring manager. That interview lasted an hour on Zoom.", "Interview Questions": "Basic interview questions, including background, experience, and goals."}, {"date": "2 Oct 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Susan G. Komen", "Interview Descriptions": "Pannel interview. Fairly easy.  Very direct and to the point with what they were looking for and what they were willing to offer.  It was overall a very good experience.", "Interview Questions": "What was I looking to gain from this internship?"}], [{"date": "28 Mar 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Susan G. Komen in Oct 2021", "Interview Descriptions": "I was interviewed first by a recruiter, then two interviews from managers, followed by a panel interview with four different individuals. After I received a request for references - and here is where I made a mistake, without an offer and I should never had submitted my references information. After submitting all the requested information, I never heard from them again. Sent several emails and even called. After a few weeks, I received a generic email saying that I was not selected.", "Interview Questions": "Just basic interview questions and some specific questions related to the position."}, {"date": "9 Sept 2021", "title": "Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Susan G. Komen", "Interview Descriptions": "Very responsive throughout the entire interview process, thorough with responding to my inquiries both via phone and email. If I missed a material that they needed, they followed up with me politely requesting it with enough time to respond.", "Interview Questions": "What previous role has prepared you for this role?"}, {"date": "21 Jul 2022", "title": "Sale Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Susan G. Komen (Durban) in Jul 2021", "Interview Descriptions": "It was calm quick and easy  they were very relaxed make you feel comfortable  you go for your first interview then a polygraph test and then you second interview .", "Interview Questions": "To tell them about myself \nWhat are my strength and weakness "}, {"date": "2 Mar 2022", "title": "Development Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Susan G. Komen in Jun 2021", "Interview Descriptions": "My final interview was with a regional exec. They asked very standard questions that I would have expected in a first round screening interview, not a final interview. Additionally, they asked me to stay on video while they turned off their video...and proceeded to interview me on their car audio in front of a group of people I could hear the entire time. As you can imagine, I left that interview feeling peak awkward", "Interview Questions": "Q: Tell me about yourself."}, {"date": "16 Feb 2021", "title": "Race Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Susan G. Komen", "Interview Descriptions": "One Zoom interview with two folks in the department. Typical run of the mill questions - a back and forth conversation that felt mostly natural and easy to complete and understand the role specicifications.", "Interview Questions": "Tell us about yourself.\nWhat's a challenge you've overcome?"}, {"date": "12 Jan 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Susan G. Komen", "Interview Descriptions": "Easy flow, great questions asked! Fun company to work for.  Feels good to work in a place where you are constantly giving back, collaborating with your community, and serving others for a great purpose.", "Interview Questions": "What do you like to do in your free time?"}, {"date": "10 Nov 2020", "title": "Program Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Susan G. Komen", "Interview Descriptions": "Interview process was smooth and conducted virtually. Multiple interview  process. Had the opportunity to interview with a supervisors and a colleague. Interviews were about 30 minutes each. Heard back in a timely manner, and great communication from HR.", "Interview Questions": "Questions are specific to position. "}, {"date": "17 Jul 2020", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Susan G. Komen", "Interview Descriptions": "very friendly and to the point. Interview process was timely. 2 interviews before position was offered.  Phone interview was first and then an in person interview with the direct manager for the position. Whole process was around 2 weeks.", "Interview Questions": "What is your greatest strength"}, {"date": "12 Jun 2020", "title": "Data Entry Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Susan G. Komen (Mississauga, ON) in Jun 2020", "Interview Descriptions": "very light and supportive questions to get to know you. you should be well prepared and just be yourself when you are answering these questions. Honesty and being truthful is the best way to win any interview.", "Interview Questions": "what is one place you'd like to visit"}], [{"date": "29 Oct 2021", "title": "Public Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Susan G. Komen in Mar 2020", "Interview Descriptions": "I had a brief phone interview with a policy associate in which the interviewer asked easy behavioral questions (tell me about yourself,  strengths, team building). She got back to me within the week with the decision and response.  It was a single round interview. It was quite a laid-back experience.", "Interview Questions": "Tell me about a time you worked in a team?"}, {"date": "2 Mar 2021", "title": "Program Coordinator for the Women’s Cancer Profeam Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Susan G. Komen (Baltimore, MD) in Mar 2020", "Interview Descriptions": "There were 3 interviews the first one was with the recruiter, the second with the director and the third was with someone on the team. I made it through the first round. The first two asked basic questions like why did I want to job, explain my history, and what connections did I have in the community. I didn’t make it to the last round as it was canceled  because of covid", "Interview Questions": "How did you find out about the position? Do you have an community organizing experience? What connections do you have in the community. "}, {"date": "3 Jan 2020", "title": "Health Educator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Susan G. Komen", "Interview Descriptions": "The interview was a video conference. It was professional and lasted approximately 40 minutes.  The questions were straightforward.  Like others have mentioned, they essentially fell off the face of the earth after the interview and did not follow up with me.  I wrote a lovely thank you note to the representative and still no response. Disgraceful.", "Interview Questions": "What is your ideal day of work?"}, {"date": "13 Nov 2019", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Susan G. Komen (Dallas, TX) in Oct 2019", "Interview Descriptions": "The interview process what extremely messy. I had a one-on-one screener that went incredibly well, and was excited for the position. The discussion was natural and aligned with the job description, and it was clear that I was qualified. However, when I went in for the in-person interviews, things really devolved. I met with 4 individuals over 4 hours, some of whom were not even present (I had to go into SGK just to Skype with them). None of the interviewers were able to articulate what the position was, what their positions were, or what SGK actually does. One of the interviewers (the director) was also unable to understand basic terms in the field, yet spoke to me as if I were an idiot. She was also incredibly hostile when I asked how SGK collects data from individuals with breast cancer, survivors, or providers about their experiences. She actually stared me right in the eye and told me their perspectives don't matter to SGK's development! I find that deeply disturbing, and suspect others looking to work in a public health field would agree. Another interviewer almost cried talking about how confused she was with her work. I also found many of the interviewers to be rude to the administrative assistant in the office, which did not reflect well on company culture. Moreover, after the interviews were complete, I got the impression that the job description was a way to entice an applied data analyst into an administrative, clerical position.  I would not at all suggest this process to anyone who cares about how data are used in practice.  I'll also add that the process was quite slow, and it was hard to get emails in a timely manner. I ultimately gave up.", "Interview Questions": "They actually talked to me more about themselves than asking me questions.  "}, {"date": "9 Nov 2019", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Susan G. Komen (Columbus, OH) in Jun 2019", "Interview Descriptions": "Interviewed at Columbus chapter. Panel style interview of all women. Asked a lot of questions about how I deal with drama, if I can get along with all women, etc that made me nervous. I was interviewing for one of four open positions at the time and they said they “hadn’t thought about it” when I asked about salary. Then told me they’d get back to me within the week and I never heard a thing.", "Interview Questions": "Would you be able to work with all women?"}, {"date": "6 Apr 2019", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Susan G. Komen (Toronto, ON) in Feb 2019", "Interview Descriptions": "If you are over 18 you have to do a criminal background check which takes about 2weeks, takes super long even if you apply for part time, they also make you wait longer for you to get interviewed to see if you actually want a job there which is so dumb", "Interview Questions": "Why do you want to work here? "}, {"date": "6 Nov 2018", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Susan G. Komen (Melville, NY) in Oct 2018", "Interview Descriptions": "The level of interview was neutral. Asked plenty of job related questions. The interviewer was pleasant to talk to and described the job role and responsibilities in details and was upfront of what she was looking for in a candidate.", "Interview Questions": "How would you describe your superior "}, {"date": "14 Sept 2018", "title": "Marketing Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Susan G. Komen", "Interview Descriptions": "I had a brief phone interview which consisted of basic questions. Why I would like to work for them, the role I'm interested in, where I heard about it. Followed by an in-house interview before being hired.", "Interview Questions": "Why would you like to work for Susan G. Komen?"}, {"date": "24 Sept 2022", "title": "Student Fellowship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Susan G. Komen (New Brunswick, NJ) in Sept 2018", "Interview Descriptions": "Very nice people \nAsked basic informations first phone interview \n\nIn person interview wanted to get to know me and past experience \n\nGoals I have for myself as well as what I wanted to take out of and how it is relevant to what I am studying in school\n", "Interview Questions": "What are goals you want to take out of this fellowship"}, {"date": "14 Jul 2018", "title": "Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Susan G. Komen", "Interview Descriptions": "very good and straughtforward, no issues interviewer was calm and respectful and asked if i had any questions. interviewer arrived on time, neatly dressed and provided lots of info on pay, travel, sick leave", "Interview Questions": "tell me about yourself"}], [{"date": "11 Jul 2018", "title": "Anonymous Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Susan G. Komen", "Interview Descriptions": "Staff was very friendly and professional.  My only issue is that I engaged in 3 interviews, yet never heard a response about not getting the job. I found that to be rude and disrespectful considering I wasted about 8 hours of vacation time from my current job taking time off to be home for the phone interviews.", "Interview Questions": "Walk through your resume and tell me about your career history."}, {"date": "20 May 2019", "title": "Business Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Susan G. Komen (Plano, TX) in Apr 2018", "Interview Descriptions": "The hiring process was not stressful, as the conversation went smoothly.  But it did take quiet a while for the interview process, it took 3 weeks for the internship and it was all phone interviews.", "Interview Questions": "Why are you Interested in Susan G. Komen?"}, {"date": "6 Oct 2017", "title": "Event Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Susan G. Komen (Philadelphia, PA)", "Interview Descriptions": "An assistant reached out regarding my application, set up a phone screen for later that day and sent a calendar invite to confirm. The CEO, Elaine, of the Philadelphia branch was supposed to call me for the interview. She did call...over two hours early. No apology, no explanation for the early call, not even an acknowledgment that the interview was happening WAY early. I was completely caught off guard and found myself apologizing for her error. Interview went well but when I emailed to follow up a week later I received a very short email back (in all caps, so it felt like she was screaming at me) that she had \"made a choice\" already and that was it. Overall, an INCREDIBLY unprofessional experience and I'm pretty relieved I didn't get the job. Still have no idea why Elaine called 2 hours early as we were in the same time zone and had a confirmed calendar reminder with the correct time.", "Interview Questions": "What is your event planning experience?"}, {"date": "22 Jul 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Susan G. Komen (Dallas, TX) in May 2017", "Interview Descriptions": "I originally applied online for a part time position, but since I was a student and was only going to be working during the summer, the executive director emailed me back and said I should interview for an internship with the company for the summer. We set up a quick phone call discussing my background and my interest in the company. 2 days later she sent me an offer via email and asked me to sign a contract.", "Interview Questions": "What prior experience do you have?"}, {"date": "7 Dec 2016", "title": "Development Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Susan G. Komen (New York, NY) in Dec 2016", "Interview Descriptions": "I applied online. I heard back within a week for a phone interview. She basically acted like I was one of thousands to be chosen,which strike me as odd.  The woman who called me (the volunteer coordinator) seemed to only take about how great the \"culture\" was, and how everyone was a team. I tend to be a bit shy on a phone, and she basically called me quiet. I don't see this as a flaw. But, for some reason this got on her nerves. Yeah, not ever giving to this organization again.", "Interview Questions": "How is your communication style?"}, {"date": "26 Oct 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Susan G. Komen (Chicago, IL)", "Interview Descriptions": "I had a 15 min phone interview followed by an in person about a week later. Everyone was extremely friendly and inviting. I went into the conference room to be interviewed and it was a conversation type interview. They want to see if you can articulate and connect just as you will be during your internship role.", "Interview Questions": "What do you know about the organization"}, {"date": "23 Oct 2016", "title": "Web Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Susan G. Komen (Dallas, TX) in Feb 2016", "Interview Descriptions": "I met with the hiring manager and his team. Two of the four people were on the phone. One of those people was looking at my current employer's job postings during then interview and asked why I didn't apply for the Developer position there. I thought that was highly inappropriate. The other person on the phone had an accent that I could not understand. I asked her to repeat her question but still did not understand her.\r\n\r\nI knew from the questions they were asking me, that I was not the right person for the job. The job they were interviewing me for was not the job I applied for. My resume is very clear about my experience so I'm not sure why they interviewed me.\r\n\r\nWhile, the hiring Manager and his boss were very nice, I was not the right fit for their position. When I told them this during the interview, they talked about looking at the whole package. A word of advice, when an applicant tells you she doesn't have the experience you are looking for, believe her. Oh, and if you are going to have people calling in for the interview, you should probably ask them the to focus on the interview and not be looking at and asking about another company's job posting during the interview. That was just tacky.\r\n\r\nProbably the worst interview I have ever had. Definitely turned me off of working for them in any capacity.", "Interview Questions": "What is the difference between html and html5. Other questions I could not understand because of heavy and accent. No one in the room offered to repeat the question for me. Really trying to block it out because it was the worst interview I have ever had."}, {"date": "7 Mar 2017", "title": "Mission PRogram Manager -with An Affiliate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 8 weeks. I interviewed at Susan G. Komen in Jan 2016", "Interview Descriptions": "Great, I enjoyed the interview. Great team, location. Unfortunately the affiliates are limited by fund raising to drive salaries and that disparately contrasts HQ salaries. Event driven to cover bottom line, that concerned me.", "Interview Questions": "Share an example of how you manage projects"}, {"date": "12 Jan 2015", "title": "Cause Marketing Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Susan G. Komen (Dallas, TX)", "Interview Descriptions": "Two phone interviews- the first very generic with the recruiter and the second with the hiring manager- more specific about job experience.  Then panel interview with entire team.  I could tell the questions were straight from HR.", "Interview Questions": "Whats an example of a strong cause marketing partnership and why?"}, {"date": "24 Feb 2014", "title": "Race for the Cure Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Susan G. Komen (Portland, OR) in Feb 2013", "Interview Descriptions": "Great experience overall! Applied online and heard back from the Volunteer Manager within a week. Initial phone interview was easy and lasted around 30 minutes. We set up an in person interview on the phone. In person interview was awesome. Very laid back and casual. I was interviewed by three people and the interview lasted around an hour!", "Interview Questions": "Mostly easy questions no technical questions. Most questioned based upon past job and internship experience."}], [{"date": "29 Jul 2012", "title": "Business Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Susan G. Komen", "Interview Descriptions": "It was a 3 person interview: Manager, Director, and VP. Manager asked basic behavioral questions questions. Director asked about previous technical experience. VP asked about what I can contribute to the organization and why I want to work for non-profit", "Interview Questions": "What is the waterfall method?"}, {"date": "12 Mar 2013", "title": "Grant Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Susan G. Komen in Jun 2011", "Interview Descriptions": "Strange process with Komen. I was called by HR for the standard \"why do you want to work here\" questions, then had a 1:1 phone interview with the supervisor. That went well, and I was flown in for interviews with the whole team, which took 1 business day. I was told by the supervisor's boss that I should start the on-board training on a certain day. After I was flown back home, I was requested to have more interviews via Skype with tangental team members, and then nothing. I tried to call/email to see what happened, even for just development purposes, but never heard from them again.", "Interview Questions": "None - mostly was asked about my work experiences."}, {"date": "9 Jul 2014", "title": "Executive Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Susan G. Komen (Lexington-Fayette, KY) in Jul 2010", "Interview Descriptions": "Board members will perform interviews, although they are not qualified to do the interview. So spew stats and they will think you're amazing. Do research on Komen corporate and who the President is and who is currently in charge. Know who Nancy Brinker is and who her sister was. How long she fought her battle with breast cancer and how much money has been raised to date. Know the last three race profits and you're in!", "Interview Questions": "N/A"}]]