[[{"date": "9 Nov 2021", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Gillette Children's", "Interview Descriptions": "All around, it took nearly three months to schedule and complete all interviews. The interviews were very formal and structured. Overall, the hiring process is really slow and I went with another opportunity that made decisions faster.", "Interview Questions": "General employment questions, nothing elaborate. "}, {"date": "2 Oct 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Gillette Children's", "Interview Descriptions": "Eight interviews of at least one hour each and three of them were panel interviews.  Long, frustrating process that drug over a couple of months. It was a huge investment in time and energy.", "Interview Questions": "Tell us about a time…"}, {"date": "15 Apr 2021", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gillette Children's", "Interview Descriptions": "Human Resources Screening interview was scheduled promptly. Then interview with direct supervisor and interview with colleagues was scheduled for a week later. All of the interviews were virtual or by phone.", "Interview Questions": "Tell us about yourself and why you are interested"}, {"date": "24 Feb 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Gillette Children's", "Interview Descriptions": "Long, intricate process. Several interviews with the same people and two panels. While the interviews were appropriate in difficulty and the people were very nice, it took them more than a month to get back to me with a decision. Several months later I still have not received a thank you letter or any formal acknowledgement.", "Interview Questions": "Behavioral based questions such as tell me about a time when..."}, {"date": "3 Dec 2019", "title": "Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Gillette Children's", "Interview Descriptions": "Phone interview with behavior based questions.  Human Resource Specialist was very transparent about their lengthy hiring process and pleasant to speak with.  She immediately followed up with an email as she stated she would.", "Interview Questions": "How would you handle an employee not meeting standards?"}, {"date": "31 Mar 2020", "title": "Certified Nursing Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Gillette Children's (Saint Paul, MN) in Jul 2019", "Interview Descriptions": "Interview/screening with HR on phone. Then in person interview with manager and nurse supervisor. Took about 30-40 minutes and then a tour of the hospital at the end. Process took about 2 weeks.", "Interview Questions": "What is something you could improve on. "}, {"date": "28 Dec 2022", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Gillette Children's (Saint Paul, MN) in Jun 2018", "Interview Descriptions": "2 one on one interviews with fellow Clinical Research Coordinators and an interview with two of the PhDs you would be working with. The interview was formal and in-person during the time that I was interviewing.", "Interview Questions": "What is your most proud achievement to date?"}, {"date": "19 Feb 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Gillette Children's (New York, NY)", "Interview Descriptions": "Phone screen first. Person doing phone interview was reading my resume and letter as we were talking, so she must not have been the person who initially selected me for a phone screen.  That part was a little odd - waiting while she scanned my info. Mostly behavioral questions. “Tell me about a time...”", "Interview Questions": "What would your previous employer say about you as an employee."}, {"date": "7 Oct 2017", "title": "CNA/HUC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Gillette Children's (Saint Paul, MN)", "Interview Descriptions": "Had a phone interview and then in-person. All questions where behavioral/experience based. Took 2 months to get hired. They looked at and contacted old work place and reached out to references.", "Interview Questions": "n/a"}, {"date": "8 Nov 2017", "title": "Certified Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Gillette Children's (Saint Paul, MN) in Oct 2017", "Interview Descriptions": "I was contacted by a recruiter after meeting at their booth at a job seminar and we communicated through email for a week , where we set up an interview . The interview was fairly simple to me as the Pharmacy manager who interviewed me first appeared friendly and welcoming to me and the questions or answers delivered. Then i went on a 30 minute tour with one of their senior technicians who was very helpful and topped the experience as a delightful one . I then returned to a group of (well not a group but was supposed to be) two female pharmacists who took notes and asked me several challenging but fun questions. I connected very easily with them and they actually over-used their interview time . Overall, it was a delightful experience and I am still in shock on how I didn't get the position(even though I am a Senior Certified Pharm tech) but it was a great learning experience . They however , called later to check my references and I don't know how that went but i guess it's destiny as I am not bothered, just a little shocked!", "Interview Questions": "What will your current employees say about you ?"}], [{"date": "27 Jul 2018", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Gillette Children's (Saint Paul, MN) in Aug 2017", "Interview Descriptions": "I interviewed with 3 managers of seperate departments. It was about 45 minutes long and consisted of questions regarding past employment and how I have handled various situations. Overall it was a positive experience.", "Interview Questions": "Tell us one situation in which you had to do something out of your comfort zone without speaking to management first"}, {"date": "19 May 2017", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Gillette Children's (Saint Paul, MN)", "Interview Descriptions": "3 separate interviews - took 1.5 months to get offer a position.\r\n1. HR\r\n2. Supervisor\r\n3. Peer Interview\r\n\r\nLongest interview process I have ever done in my life. It was almost every 2 weeks that I had to do each interview. The weirdest part was they they used a survey for my reference check.", "Interview Questions": "Why I quit my last job."}, {"date": "5 Sept 2021", "title": "Patient Access Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Gillette Children's in May 2017", "Interview Descriptions": "The interview went smoothly and as expected for an interview. Learned about the role and company culture.  Was asked questions about previous experience, how I have handled situations in the past and why I was interested in the job.", "Interview Questions": "What are you interested in working here?"}, {"date": "6 Mar 2017", "title": "Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Gillette Children's (Saint Paul, MN)", "Interview Descriptions": "I needed to take a test for proficiency of document processing software online before going in for in-person interview. Then I was interviewed by the hiring manager and his supervisor. Later they showed me around the facility", "Interview Questions": "I was asked about my dissertation for my master's degree."}, {"date": "7 Mar 2016", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Gillette Children's (Saint Paul, MN)", "Interview Descriptions": "Initial interview with HR (1/2 hour), interview with director (1 HR), and then Vice President (1 HR).  Liked me but had another candidate with directly related experience.  Very friendly environment.", "Interview Questions": "Why are you leaving you present position, strengths and weaknessness, how you handled a difficult situation."}, {"date": "27 Oct 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Gillette Children's (Saint Paul, MN) in Jan 2016", "Interview Descriptions": "Applied online, was contacted 2-3 weeks after; HR set up 3 interviews: HR, manager, team members. All done in one day (very efficient); application testing; offered was made 2 days after", "Interview Questions": "Behavioral questions: how would you handle & provide a time when..."}, {"date": "14 Mar 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Gillette Children's in Dec 2014", "Interview Descriptions": "Meet with HR and the department, They go through a number of weeks of going through your background before you are considered. Everyone is very nice and are very happy to be working at Gillette. There are a number of people who have been there for years.", "Interview Questions": "General interview questions"}, {"date": "13 Jul 2015", "title": "Patient Appointment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Gillette Children's (Saint Paul, MN) in Aug 2011", "Interview Descriptions": "The interview process was stringent compared to other Healthcare organizations. There were MANY questions. Multiple interviews.  The wait was over 6 weeks. The verification process of previous employment was difficult to complete.", "Interview Questions": "What is your 5 year career goal? How do you handle specific conflict situations? Name 3 things your previous coworkers would say were your greatest downfalls."}, {"date": "21 Aug 2014", "title": "Health Unit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Gillette Children's in Jun 2011", "Interview Descriptions": "I applied for the job online in 2011. It took Human Resources about 3 weeks before extending an offer for an interview. I first received an interview with Human resources and then I received an interview from a nurse manager. After the interview, it only took a few days before they contacted me and offered me the job. The interview process was very smooth and clear. The fact that I have been working in health care for  long time also helped make the interview process faster and easier. From the time I applied the whole process took about a month", "Interview Questions": "I would not say that I had any necessarily difficult or unexpected questions"}]]