[[{"date": "9 Jan 2023", "title": "Team Lead Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bowie State University", "Interview Descriptions": "I went in and the manager asked a few question s then gave a tour of the store and talked about all of the different tasks that the store needs done.", "Interview Questions": "What are your Hours of availability"}, {"date": "30 Dec 2022", "title": "Marketing Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Bowie State University (Silver Spring, MD) in Aug 2022", "Interview Descriptions": "It was very vague, they didn't have clear idea of what they wanted. The job description had just been made. I felt like they were unable to describe how the role fit in with the larger organization.", "Interview Questions": "How do you manage staff? Show me samples of work. Explain your brand strategy approach."}, {"date": "26 Apr 2022", "title": "HR Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bowie State University (Bowie, MD)", "Interview Descriptions": "Two part interview fairly easy. Panel interview for first interview then second interview with direct manager and director.  Some positions such as admin do require a clerical test. In not writing anymore", "Interview Questions": "Basic questions for an interview "}, {"date": "28 Sept 2020", "title": "Student Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bowie State University (Columbia, MD) in Jan 2019", "Interview Descriptions": "it was quite easy and i was asked different questions about the job description and about my past experiences. you need to be able to talk about your past experiences", "Interview Questions": "Why do you think you are fit for this position"}, {"date": "13 Nov 2018", "title": "Porter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bowie State University", "Interview Descriptions": "Very easy, staff was friendly. Very straightforward, and received update in the timeframe that was mentioned at interview. I would recommend applying for a position with this employer. From the time of the setup for the interview date through the interview and next steps was pretty fast.", "Interview Questions": "Tell us about a difficult moment how did you resolve issue?"}, {"date": "10 Jul 2018", "title": "Writing Center Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bowie State University (Bowie, MD)", "Interview Descriptions": "A good while after applying I was contacted via email to set up a phone interview. The phone interview was pleasant and around 20-25 minutes long. The questions were pretty standard and general, but not difficult. I enjoyed speaking with the committee, and a couple days later I was contacted via phone to come in for an in-person interview.\r\n\r\nThe campus interview was really disorganized. I was never given a schedule of where I needed to be. I was supposed to meet with the Dean and no one ever took me to see the Dean or instructed me when or where that was supposed to happen. The classroom demo was given to students who were forced to be there for the summer and were super unhappy. There were large periods of time where I was just waiting somewhere on my own because the interview committee was so disorganized. The people I met were friendly enough and I enjoyed meeting them, but to go through a 4 hour interview and be told I would be informed either way of their decision, and then to never hear anything back, is extremely rude,  thoughtless, and unprofessional on their part. I feel like they already had a walk-in for the position and the whole interview was a sham.", "Interview Questions": "What are the strengths/unique qualities you could bring to the position?"}, {"date": "11 May 2019", "title": "Junior Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bowie State University (Bowie, MD) in Apr 2017", "Interview Descriptions": "The interviewer wanted to know my level of knowledge with Linux, so he asked me to explain terms like passwd, shawod file, xfs  yum, scp, he also asked networking questions like DNS, HTTP, Ports.", "Interview Questions": "N/A"}, {"date": "8 Jun 2016", "title": "Writing Center Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Bowie State University (Bowie, MD)", "Interview Descriptions": "There was a 20 minute phone interview in which they asked 5-6 questions, then three candidates were chosen for second interviews on campus. I was asked to prepare a 10-15 minute presentation about my vision for the future of the writing center, I was given a campus tour, I met the chair of the department, and I was interviewed with two faculty members. I thought I did pretty well on the presentation, but I think I may have sputtered on a few of the interview questions. When it came time for my questions, the faculty members who interviewed me weren't entirely sure about some details of the position, such as whether it was 10 or 12 month since it was a staff position. They referred me back to the department chair if I wanted that information. Benefits were never discussed, and I couldn't find thorough information on HR's website (such as number of days of leave or details about health insurance). It also wasn't clear if this was a contingent or non-contingent position. \r\n\r\nI was told at the end of the interview that a decision would be made in about two weeks, and I'd be notified either way. A month went by and I heard nothing, so I sent an email to follow up and was told another candidate had been selected and accepted the position. Really? When were they planning on telling me? I liked the department chair a lot and I could tell he had the best interests of the writing center in mind, so I'm sure the candidate they selected is the best suited for the position. However, when someone puts time and effort into researching an institution and coming for a campus interview to give a presentation, it's common courtesy to let them know ASAP about the outcome. I'm miffed about the unprofessional behavior there.", "Interview Questions": "Are you familiar with/have experience with grant writing?"}, {"date": "23 Jun 2015", "title": "Student Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Bowie State University (Bowie, MD) in Aug 2014", "Interview Descriptions": "I was assigned to work for a department at the school, as a class requirement for one of my courses.  I was interviewed by the head of the department who already knew my background and we went straight into the need of the project.", "Interview Questions": "If i was able to provide a solution to their problems"}, {"date": "11 Feb 2016", "title": "Academic Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Bowie State University (Bowie, MD) in Sept 2012", "Interview Descriptions": "There was a panel of interviewers who were themselves academic advisers all with scripted questions. it seems like all candidates interviewed were asked the same question. Each interviewer asked the same question and recorded a score upon listening to your response. They were somewhat mechanical in asking the questions.", "Interview Questions": "What were some of the projects you worked on? Describe a specific project in which you made difference, made a significant input and describe the outcomes resulting from its implementation.What do you know about Bowie State University?"}]]