[[{"date": "1 Jun 2023", "title": "IT Support Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Big Brothers Big Sisters (Tampa, FL) in May 2023", "Interview Descriptions": "Applied and heard back in a few days. Scheduled an online Microsoft Teams interview with the regional IT manager, and discussed details about the job and the company's goals. After this, there was a second round interview with the CTO and Software development manager where they had a series of round robin questions to ask.", "Interview Questions": "Describe a difficult technical issue that you have run into in the past, and how did you solved it?"}, {"date": "18 Mar 2023", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "They made me do three interviews that were essentially all the same. They said they would get back to me within a week before completely ghosting me. They said I was completely qualified and that I would do well in the position. I would at least appreciate an automated rejection email. The whole process was extremely unprofessional. Do not apply unless you enjoy getting your time wasted.", "Interview Questions": "Several scenarios about ethics and boundaries regarding Bigs and Littles"}, {"date": "2 Jun 2023", "title": "Program Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Arlington, TX) in Mar 2023", "Interview Descriptions": "I went through a phone interview, in-person interview and mock interview. I didn't hear back after the third round of interviews over a month long process. Interviews questions appeared to be adequate for what the job required.", "Interview Questions": "How do you discern a good a candidate?"}, {"date": "17 Feb 2023", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "The interview process was great. I think they got a great understanding of the skills I bring and I got a great understanding of the skills they're looking for. I am excited to work for this company!", "Interview Questions": "What skills can I bring to this role?"}, {"date": "1 Jan 2023", "title": "Event Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "There was a phone and then zoom interview I didn’t hear back after the second. I assume they went another direction but did not contact me, which I thought was a little rude", "Interview Questions": "N/A"}, {"date": "14 Oct 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "I interviewed with a recruiter who was very distracted during our initial 30-min. discussion. I was thrown off by the recruiter pausing in the middle of our interview to email their supervisor. There was a five-minute break where the individual went off-camera to send a message. While I ended up advancing beyond this stage, I was really thrown off from the lack of professionalism. This sort of behavior wouldn't be acceptable from a candidate -- even in an emergency.", "Interview Questions": "Tell me about your experience developing strategies for leaders."}, {"date": "15 Oct 2022", "title": "Customer Service (CSR) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Great and everything was easy. It’s good when you can be among positive people. I wish the business great success now and forever. They make you feel comfortable and the atmosphere was awesome.", "Interview Questions": "What are your future goals"}, {"date": "13 Oct 2022", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Very straightforward. Interviewers were kind and easy going yet professional. I was interviewed by three staff members and received an offer letter less than 1 month from when I applied for the job.", "Interview Questions": "Basic. Asked about past experiences and transferable skills, knowledge about the company, etc."}, {"date": "10 Oct 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "It was a longggg process to be a big. This is definitely a time commitment. They did provide information throughout the process so I know what i was getting myself into. I wish it was a much simpler process.", "Interview Questions": "Why do you want to be a big?"}, {"date": "13 Oct 2022", "title": "Local Truck Driver Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Big Brothers Big Sisters (Albuquerque, NM) in Oct 2022", "Interview Descriptions": "The interview process was not that difficult. I completed a phone screen, in-person interview, drug test, reference and background checks. Once all that is completed I could tell them my start date.", "Interview Questions": "Tell me about your professional driving experience. What kind and size of vehicles did you drive? For how many, years."}], [{"date": "20 Nov 2022", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Big Brothers Big Sisters (Calgary, AB) in Sept 2022", "Interview Descriptions": "Quite long but interesting. Basically dig everything about you. I don’t mind that. Children’s mental condition need that much work. It’s nice that they want to make sure you will be fine for the kids.", "Interview Questions": "What’s your relationship with your parents, kids, partner and friends"}, {"date": "30 Sept 2022", "title": "Mentoring Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters in Aug 2022", "Interview Descriptions": "Overall a very nice experience. \r\nThere is a pre-screen interview about 20 mins, the interviewer was super friendly. \r\nThen another formal interview with the team about 1 hour. There were a lot of questions about how to handle different situations. Everyone was very supportive and friendly which made me less nervous.", "Interview Questions": "Do you know about our organization and our programs?\r\nWhy do you want to work here? \r\nWhat's your strength and weakness?\r\n"}, {"date": "21 Jul 2022", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Interview was based on company objectives, and program expectations.  First you interviewed with potential supervisor and then agency CEO.  The interview was very informal.  Independent and self-motivation is key to the position since it was a hybrid working position.", "Interview Questions": "Why do you want to work with our agency?"}, {"date": "13 Jul 2022", "title": "Freelance Grant Writer/Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Bigs Central Valley in California were great to interview with. The Executive Director and Director of Operations were warm and welcoming and very clear of what they were looking for in a grant writer.", "Interview Questions": "Do you have experience writing federal government grants?"}, {"date": "25 Jul 2022", "title": "Enrollment Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters in Jul 2022", "Interview Descriptions": "The process had multiple rounds of interviews. It lasted a bit over a month long and I was offered a position. I asked for some time to compare offers and they stated I was given the weekend to think about it. I then received another call stating they were taking back the offer due to inconsistencies. I asked for clarification and was told it was confidential and the call ended.", "Interview Questions": "Typical questions: tell me about yourself, etc. "}, {"date": "2 Aug 2022", "title": "Enrollment Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Dover, DE) in Jul 2022", "Interview Descriptions": "An initial phone screening is done, followed up with a Zoom interview which is done in the same week or done the following week.  After the final zoom interview, an offer is made.", "Interview Questions": "Case Study Conceptualization via email "}, {"date": "4 May 2022", "title": "Placement Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "The interview process was very fair and efficient. All communication that I received from the agency was clear and easy to understand. I felt the process was appropriate for the role that I was applying for.", "Interview Questions": "Please tell me about yourself"}, {"date": "21 May 2022", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters in May 2022", "Interview Descriptions": "The process was easy overall. I completed two interviews.  Both interviews were an hour long and the questions were pretty basic. Definitely know why you want to work there. I am passionate about the work they do and I would recommend this job to someone who is invested in their mission.", "Interview Questions": "Tell me about yourself.\r\nWhat kind of salary are you looking for?"}, {"date": "13 Jun 2022", "title": "Senior Director, Government Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters (Washington, DC) in Apr 2022", "Interview Descriptions": "The HR rep sent link to sign up for a time for a phone screen which didn't work, then didn't respond to multiple emails trying to point this out. He then sent another link to sign up for a time via LinkedIn, which also didn't work. Finally received a call and did a phone screen which felt very perfunctory and rushed. An altogether unprofessional vibe about the whole thing.", "Interview Questions": "Asked for overall background, even though it is, of course, all spelled out on the resume."}, {"date": "24 Aug 2022", "title": "Marketing Communications Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters in Apr 2022", "Interview Descriptions": "I initially applied through a virtual job application, where I sent in my resume & cover letter.\r\nAbout a week later, I received a phone call where I was invited into the office for an interview.\r\nThe person who interviewed me was the Executive Director of the local branch. \r\nThe questions mainly surrounded how well my previous marketing & event planning experience would align with the job responsibilities, and why I wanted to work for their non-profit specifically.", "Interview Questions": "Q. Tell me about yourself."}], [{"date": "30 Jul 2022", "title": "Accout Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Stoke-on-Trent, England) in Mar 2022", "Interview Descriptions": "Verbal Interview  Two Rounds only One HR and Second your Manager ,  Offer letter in 15days you get . Very professional and Proactive . Onboarding also good , work form  home culture", "Interview Questions": "Tell Me about Your self \r\nHobbies \r\n"}, {"date": "11 Jan 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Found the internship at big brother big sister of the eastern shore through my college internship portal. Interviewed in person and was given the role. The internship lasted one semester.", "Interview Questions": "They asked about general marketing experience and courses I took. "}, {"date": "23 Dec 2021", "title": "Community Engagement Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "It was great very friendly people great conversation they were very welcoming and that was such a great experience to have that thank you so much for being so nice to me it is very appreciated", "Interview Questions": "How I feel being a part of a non profit"}, {"date": "10 Dec 2021", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "The staff communicated very effectively and quickly.  Interview process was great with clear expectations. Also was asked to provide a writing sample. Met with Leadership Team. Would go through this process again.", "Interview Questions": "About prior experience with children and volunteers "}, {"date": "18 Nov 2021", "title": "Mentoring Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Got asked very good questions, seemed to be interested in transferable skills, so that even though i had not done this particular jobs, I had done many jobs that required the same skills and that was OK with them", "Interview Questions": "How would you handle various volunteer mentor situations"}, {"date": "14 Sept 2021", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "The interview process was thorough and did not take much time. The first interview was a phone call and the second was an in person interview.  During the second interview, after asking a series of questions, there was a typing assessment.", "Interview Questions": "Do you feel comfortable working on the weekends?"}, {"date": "8 May 2022", "title": "Program Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters in Sept 2021", "Interview Descriptions": "Interview process showed how thorough Big Brothers Big Sisters is when choosing their employees. Three different interviews. These interviews included one initial discussion, one panel review, and one final deciding interview.", "Interview Questions": "What does the word mentor mean to you?\r\n"}, {"date": "18 Aug 2021", "title": "Enrollment Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "The interview process included an initial phone screen followed by first and second round interview. The interview was conducted via video chat. The interview was an in-depth process with an emphasis on behavioral interview questions.", "Interview Questions": "What would your former co-workers and supervisor say about you?"}, {"date": "15 Jul 2021", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "They really try to get to know you.  A very strong focus on personal development. They seem like they work great as a team and have a strong support system and work environment. The atmosphere was kept light.", "Interview Questions": "What are you three strongest attributes "}, {"date": "25 Jun 2021", "title": "Enrollment and Matching Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "I had a phone interview. The person I spoke with was nice. The interview was enjoyable. However, I was told I would get an update on my application. After a month, I followed up and they said they are still conducting interviews. To date, they still haven't told me anything. I moved on, obviously.", "Interview Questions": "Why do you want to work with Big Brothers Big Sisters?"}], [{"date": "15 Jun 2021", "title": "Grant Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "There were at least 5 rounds of interviews with different staff and leadership. It was thorough and included a cultural competency component. All communication was done via email, until the final offer, which was shared over the phone.", "Interview Questions": "Describe a time you failed at something. "}, {"date": "12 Oct 2022", "title": "School Liaison Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters (Traverse City, MI) in Jun 2021", "Interview Descriptions": "Phone interview followed by in-person interview. The interview was a straightforward and comfortable conversation. I did not receive an offer, and later learned that the other candidate they had interviewed had been recruited by the director.", "Interview Questions": "How would your best friend describe you?"}, {"date": "6 May 2021", "title": "Director, Special Events and Sponsorships Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "The initial interview was conducted by a consultant hired to assist the organization. She was very pleasant and conducted the interview professionally, but the follow-up was poor.  Emails and phone calls went unanswered for weeks.", "Interview Questions": "How do you build and maintain relationships?"}, {"date": "30 May 2021", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Nashville, TN) in May 2021", "Interview Descriptions": "There is a phone screening and a formal interview. The phone call was easy and a conversation. I did not go to the interview, because they were offering 36K and that was not enough for me.", "Interview Questions": "What does a good match look like? What does an unhealth match look like. "}, {"date": "2 Apr 2021", "title": "Enrollment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "One phone screen, one in person interview. Cordial, friendly environment, we joked around.  They didn't rush the process.  I felt all my questions were answered.  Two people were in the room during the in person interview.", "Interview Questions": "Behavioral interview questions regarding tough decisions, work in teams, etc."}, {"date": "9 Mar 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "easy, friendly, informative. relaxed. met first at job fair. official interview was at a local coffee house. i felt instantly that i would fit right in and find what i needed.", "Interview Questions": "What do you want to gain?"}, {"date": "8 Mar 2021", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Boston, MA)", "Interview Descriptions": "Interview process had many steps and was a long process. The first step was a Zoom interview with the Manager of Employee Relations. The second step was another Zoom interview with 2 other managers from different departments. The 2 interviews were a month apart and a decision was made 2 months after. Although it was a long process, I appreciated the thoroughness and professionalism. Overall, it was a good interview process.", "Interview Questions": "Why did this position and Big Sister interest you?"}, {"date": "18 May 2023", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (New York, NY) in Mar 2021", "Interview Descriptions": "Interviewed several times. Started with some personal questions and then moved into data driven questions. In the end it was great to meet all of the different team members I would be working with", "Interview Questions": "What are some strategies that you would deploy in order to make recruit more men and more bipoc volunteers?"}, {"date": "27 Jan 2021", "title": "Associate Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (New York, NY)", "Interview Descriptions": "The interview process was strange.  First group interview (where none of the interviewees had been informed that it would be in this format). Second round was a mock  presentation to a full audience (also wasn't informed of this). Got a rejection letter in the mail a week later.", "Interview Questions": "Standard questions in the group interview. "}, {"date": "10 Jan 2021", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Submitted a resume and cover letter an email back within a few days requesting an interview. The interview was fairly conversational, with three currently employees/managers taking turns asking questions. After the interview, I completed a task to simulate writing a bio for a Little Brother.", "Interview Questions": "Q: What makes you best suited for this role?"}], [{"date": "1 Jan 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "1 hour interview with a kind and friendly coordinator asking the basic questions of how you found out about them, why you want to work and etc. Asked situational questions based on big brother program such as what would you do if your little was upset in public", "Interview Questions": "Why do you enjoy working with kids"}, {"date": "18 Feb 2021", "title": "Enrollment & Match Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters in Dec 2020", "Interview Descriptions": "A quick phone screening followed by a long interview - mine was 2 hours.\n\nThey told me after my interview that they were \"extremely impressed\" with my qualifications and were excited to work with me, but then said a \"more qualified candidate\" had been selected. When I asked for clarification, they refused to give me any more information, saying it was not their practice to offer feedback. What???", "Interview Questions": "How do you establish relationships with people of diverse backgrounds?"}, {"date": "28 Oct 2020", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Tampa, FL) in Oct 2020", "Interview Descriptions": "The interview was over the phone and started off well. The interviewer asked questions and I proceeded to answer them all truthfully and respectfully. The entire conversation went really well.", "Interview Questions": "Q: Why do you want to be hired for this position? "}, {"date": "31 Aug 2020", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Had two 1hr 30 min virtual interviews with the CEO and had a great experience. Sent a follow up including my references the next day, one a week later then one a month later. I am assuming by now I have been ghosted, even though was told I would hear either way a week after my last interview. Disappointing. Hope this is not a similar experience across the organization. I am sure they found a great candidate but being ghosted during a pandemic hurts a bit more.", "Interview Questions": "Tell me about your experience with strategic planning."}, {"date": "14 Aug 2020", "title": "Mentoring Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Applied online. Received an invitation to interview a week later. Interviewed by two people. Supervisor and another staff member.  Received a call for a second interview a week later. The second in-person interview was with supervisor and Exec Director. Received job offer within a week.", "Interview Questions": "Tell me about yourself \r\nWhat do you know about our company?\r\nDescribe yourself in three adjectives\r\n Why do you want to work for our company?\r\nWhat are your strengths? Weaknesses?\r\nWhat keeps you motivated?\r\nHow do you keep organized? \r\n How do you handle a chaotic environment/high-pressure environment?\r\nWhat is your experience with crisis management?\r\n How do you handle criticism?\r\nWhat is your ideal manager?\r\n\r\n"}, {"date": "17 Sept 2020", "title": "Match Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Irving, TX) in Aug 2020", "Interview Descriptions": "Had 2 interviews. After the second interview I had complete a scenario questionnaire type thing. I wasn’t notified that I didn’t get the job but I actually know someone working there that told me that they actually hired on 2 people. Not getting the job wasn’t upsetting; it was not being notified that I didn’t. I guess they’re not required to tell people if they don’t get the job but it’s unprofessional.", "Interview Questions": "Tell me about a time you had a conflict with a coworker or supervisor."}, {"date": "20 Jul 2020", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Interview process was smooth. I interviewed with two staff members. Interviewers asked about past experiences, why I would be a good fit for the position, and what I was bringing to the table.", "Interview Questions": "Why I was interested in working for mentoring organization "}, {"date": "15 Jun 2020", "title": "Customer Relations Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "I had a 30 minute in-person interview with two of the managers. I heard back from them in 2 days telling me they wanted me to start the following week.", "Interview Questions": "How comfortable do you feel asking volunteers for personal information?"}, {"date": "16 Mar 2021", "title": "Admin Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Orillia, ON) in Jun 2020", "Interview Descriptions": "I applied for the position through Indeed. I then received an email from indeed with a list of interview times/ dates that I could choose from. I then scheduled a zoom interview. I was told they might do second interviews but this did not happen. I was then offered the job a few days later.", "Interview Questions": "Tell me about myself, what past co-workers would say about me, a situation where I learned from a mistake "}, {"date": "27 Apr 2022", "title": "In-School Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters (Kitchener, ON) in Feb 2020", "Interview Descriptions": "I had applied online and they contacted me with the next steps within a week or so. There was an in-person interview followed by training the same day. I was matched with a mentee within a month or so.", "Interview Questions": "Why do you want this position? "}], [{"date": "2 Mar 2020", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters (Fort Wayne, IN) in Feb 2020", "Interview Descriptions": "Casual and enjoyable interview. The interviewer asked about previous work experience. Also provided a clear description of the position and about company culture and checked back in to make sure I was still interested in being considered.", "Interview Questions": "Who was the best manager you've ever had and why?"}, {"date": "5 Oct 2021", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters in Jan 2020", "Interview Descriptions": "Had phone screening then scheduled for an hour interview with 3 company managers?\nThe interview with Managers asked questions on experience working with youth and experience coaching volunteers. How experience working directly with youth could translate to working with families and volunteers", "Interview Questions": "What do you bring to BBBSCO \nWhat are your thoughts on PYD/ how would you practice that in the workplace/implement with volunteers"}, {"date": "8 Nov 2019", "title": "Match Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Big Brothers Big Sisters (Seattle, WA)", "Interview Descriptions": "I first received a call from the hiring manager to listen to an overview of the open position to ensure I would be a good fit to come in for a formal interview. I was offered an in-person interview and was asked standard interview questions, along with a few questions that related to the BBBS work. A week later I was offered to come in for a second interview with the CEO. Between the first and second interview offer I realized the role was not the right fit for me, but I had a great interviewing experience.", "Interview Questions": "What does poverty mean to me?"}, {"date": "24 Jun 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at Big Brothers Big Sisters (Victoria, BC) in Nov 2019", "Interview Descriptions": "Standardized List of Interview Questions with some room for conversation where it arose- able to accommodate doing it via Facetime which was very helpful. Relaxed interview but they did do a reference and background check as I would be in the building where children came even though I wasn't working with them.", "Interview Questions": "What are you three greatest strengths? And weaknesses?"}, {"date": "18 Sept 2019", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Asked common questions. Great feel! Similar questions as other interviews. Asked common questions. Simple questions and wonderful interviewees. Most interviews are conversational-this one included. I would definitely refer people to reply.", "Interview Questions": "Tell me about yourself."}, {"date": "3 Sept 2019", "title": "Enrollment Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "I had a phone interview, then was asked in for an in person interview and not asked back for a 2nd in person interview. Interview was standard, people were really nice, I just wasn’t the right candidate for the position.", "Interview Questions": "How do I handle multi-tasking?"}, {"date": "28 Oct 2019", "title": "Volunteer Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Big Brothers Big Sisters (Saint Louis, MO) in Sept 2019", "Interview Descriptions": "The interview was casual lots of questions very relaxed. I had a phone interview initially and was asked to come to a panel interview within two days of the phone interview. It was very welcoming and comfortable until the end of the interview I felt like the two ladies that interviewed me were ready for the day to end. At the end I extended my hand to shake hands and thank one of the ladies for her time, she proceeded to wipe her hand on her pants. My hand was not wet or dirty so I assumed the worst. I struggled with how to address the situation and wanted to speak with her directly or her supervisor but I decided against both and thought maybe the job was not for me after all. Although I am more than qualified for the position I felt puzzled as to why I wasn’t considered seriously for the job. I always wanted to work for them and know I would have been a great fit.", "Interview Questions": "How do you handle difficult situations Between a volunteer and a child. "}, {"date": "3 Mar 2021", "title": "Options Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters in Aug 2019", "Interview Descriptions": "A multi-level interview process that begins over the phone and moves to in-person (or video). You are given plenty of opportunities to share your experiences and ask questions about the job.", "Interview Questions": "Expect questions about past experiences with youth who may have challenged you. "}, {"date": "21 Aug 2020", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters in Jul 2019", "Interview Descriptions": "After a phone screen and in-person conversation, you are asked to prepare a mock program day and facilitate with BBBS employees acting as bigs/littles. Very causal and ends with a conversation with HR for more information/questions.", "Interview Questions": "Prepare a icebreaker, program introduction, and activity around professionalism."}, {"date": "26 May 2022", "title": "Recruitment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters in Jul 2019", "Interview Descriptions": "Very welcoming interview. Met with two of the program leads. One being the HS bigs lead and the other being the HS programs lead. Asked for any alignment with prior experience and upcoming duties. Asked about interactions with you (scenario based). Asked about belief in mentoring.", "Interview Questions": "Why is your belief about mentorship."}], [{"date": "23 Apr 2019", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Personal questions looking into your childhood and past relationships. i imagine they are using the answers from this to see how you will handle being a mentor to a young boy or girl. They will get back to you pretty quickly.", "Interview Questions": "Describe your relationship with your parents"}, {"date": "26 Mar 2019", "title": "Multiple Positions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Philadelphia, PA) in Mar 2019", "Interview Descriptions": "I applied online and heard back 7 days later. The first step was a phone interview.  After the phone interview, a week later I was called in for a in-person interview with two staff members. The interview was 45minutes (way too long) but nice staff!", "Interview Questions": "Why do you want to work for the company?\r\nWhat experience do you have with data entry and databases?"}, {"date": "19 Apr 2019", "title": "Mentoring Relationship Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Big Brothers Big Sisters (Indianapolis, IN) in Mar 2019", "Interview Descriptions": "The phone interview went really well and I was told to expect to hear back within a week. It has been 19 days and after emailing and calling them I still have had no response.", "Interview Questions": "What is your favorite aspect of working with youth?"}, {"date": "1 Jun 2022", "title": "Match Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters in Feb 2019", "Interview Descriptions": "3 interviews, one over phone, was very easy, everyone was nice and kind. Lots of talking with staff. Super fun and great experience. I would recommend applying there. Hope you enjoy it if you decide to interview there! it was a good expereince.", "Interview Questions": "If you were a shoe, what shoe would you be? "}, {"date": "15 Jan 2019", "title": "Match Support Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Standard: Phone interview, followed by an in person interview with a panel of two people, with and additional language confirmation assessment (verbal) done by a third staff member, if applying for a bilingual position", "Interview Questions": "Child safety knowledge "}, {"date": "4 Apr 2019", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Big Brothers Big Sisters (Irving, TX) in Jan 2019", "Interview Descriptions": "It was very brief and you could tell that the interviewer was wondering why I was there. I had to drive a half hour to get there and only spent 12 minutes in the office. I was dissatisfied with my experience. If you don't think someone is qualified then don't call them in for an in person interview. I did a phone interview first and then was called to come in. Basically, the moment I said my major you could tell they didn't think I belonged.", "Interview Questions": "Tell me about yourself "}, {"date": "14 Nov 2018", "title": "Very Unnecessarily Long and Inconsiderate Process Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "I first applied online to Big Brothers. I received a phone call where I did an initial screening. Then was told an outsourced recruitment agency would be performing the telephone interviews within 2 days. 2 days go by and no telephone interview. I called HR and they said perhaps in the next 2 days (again). Again, no call for a phone interview. I called again and asked. 1 week later I finally receive a call. There were some more delays here and there. Finally the telephone interview was complete. Next came an online test which took 1.5 hours. Then sending in documents. Then an in person interview which took around 1 hour. Afterwards, I had hoped that regardless of a job offer or not, I would hear back because I complied with jumping through many hoops to get the interview. I never heard back after the interview. It was a very disappointing and difficult process. If you can make it through all the interviews, skill testing and most of all, waiting and at the end receive a job offer, I suspect the job would be good. Because of the process of interviewing and overall communication though, I cannot be sure.", "Interview Questions": "What are 3 strengths and how it would be useful in this role?"}, {"date": "11 Nov 2018", "title": "Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Big Brothers Big Sisters (Westbury, NY) in Nov 2018", "Interview Descriptions": "Extremely long interview process. I applied through indeed and received an email to come in for an interview. I next filled out an application that was literally 8-10 pages. I can’t remember, but at least 8 pages. I was then kept waiting about 15\n-20 mins. I met with 2 women for over an hour. They expressed a high need for case managers. Job is a lot of phone work calling the big and the little & documenting into the system how the visit went. (5-7 pages worth of notes) was asked every and any question you can think of. After, I was asked to take a test. I think it were to be a mock case interview and what you would of done situation. I was not told this nor did I have the time after being there over 2 hours. I asked if I can come back and both responded yes & they would contact me. Never heard back and it’s been over s month.  Unprofessional to say the least.", "Interview Questions": "How is your time management?"}, {"date": "10 Oct 2018", "title": "Fund Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Individual and group interview with leadership and the team. This was a long time ago so I don't really remember it but I have to write 30 words so that is what I'm doing.", "Interview Questions": "N/A"}, {"date": "13 Dec 2018", "title": "Vice President Resource Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Big Brothers Big Sisters (Columbus, OH) in Oct 2018", "Interview Descriptions": "I give this employer a negative review because they dragged their feet on notifying me that they decided to \"pursue another candidate.\" And then, instead of a promised phone call, they mailed me a letter. Just disrespectful.", "Interview Questions": "Tell me about yourself."}], [{"date": "22 Sept 2018", "title": "Volunteer Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "There was a phone interview and then an in person interview. The phone interview is to gage your initial impression and the in person interview focuses on your skills and potential.", "Interview Questions": "What is your experience in actively recruiting volunteers?"}, {"date": "13 Sept 2018", "title": "Enrollment and Match Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Chicago, IL)", "Interview Descriptions": "It was a very good and interesting process. I got a lot of questions answered and felt very confident about the company. It was with three different people so I was nervous at first but no worries. They make you feel welcome, take your time and answer honestly", "Interview Questions": "Why do you want to work for this company"}, {"date": "8 Sept 2018", "title": "Enrollment and Match Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "I had a one hour phone interview followed up two weeks later by an on site, two hour face to face panel  interview with  three staff members. The interview was standard except for the length of each interview.", "Interview Questions": "Standard questions; pleasant, conversational atmosphere "}, {"date": "11 Oct 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Big Brothers Big Sisters (Boston, MA) in Aug 2018", "Interview Descriptions": "I applied online and was contacted within a couple weeks. I did a phone screening and advanced to another phone interview, during which I was asked a series of rapid fire questions that felt more like an interrogation than an interview. Also, a few times the interviewer interrupted me and told me that my response wasn't specific enough or wasn't what she wanted (in a very brusque manner) and told me to go back and re-answer without having let me finish my response in the first place. It was quite stressful and I was sure that I wouldn't be advancing. But I did, and so I did a final video interview and had to do a presentation. I was expecting feedback on the presentation, but the feedback was a bit harsh and it seemed like they had already made up their minds that they weren't interested. I don't know if I would have gotten an offer or not, because I pulled myself out of consideration because I just didn't feel that I wanted to work in an environment like that.", "Interview Questions": "How do you manage conflict with people that come from different backgrounds?"}, {"date": "18 Jul 2018", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Big Brothers Big Sisters (Boston, MA)", "Interview Descriptions": "I went through a phone screen, in-person interview, and performance task.  Friendly team, felt like they were transparent about the company and its match support goals. Felt like a pretty standard interview process.", "Interview Questions": "Was asked to role play a mock match support call to a parent."}, {"date": "1 Feb 2021", "title": "Volunteer Enrollment Specialist Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Indianapolis, IN) in May 2018", "Interview Descriptions": "I had a quick phone interview, and then the hiring manager immediately followed up with an in-person interview offer. I went to the BBBS Indianapolis office to interview. I got a full tour and 2 employees from the company interviewed me. It was very laid back and comfortable.", "Interview Questions": "How do you best work with others?"}, {"date": "12 May 2018", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Big Brothers Big Sisters in Mar 2018", "Interview Descriptions": "The entire process took about a month! I received an email shortly after submitting my resume requesting that i pick a time/date to do a pre-hire interview with and HR representative. She called the following week, everything went smoothly and she mentioned I’d have to wait to hear back from someone in the actually office if they decided to move forward. I eventually got a phone call back after about a week! The second interview went smoothly. I met with a sweet lady who just asked me basic questions “ how did i hear about the organization, what my experience was. Etc” she also did scenario based questions. Later that evening, she emailed me a list of another 5 or so scenario based questions and mentioned to me that if i were to be chose to move forward, that’s I’d hear from someone ( ceo) i received a phone call exactly a week later where she basically asked for a time slot i was available to answer a few more questions, i told her i was available the next day! She called and she went over basically the same questions as the same lady but while also asking about my weaknesses, strengths, etc. after this phone call i already knew i had the job because she stated something like “ well, I’ll let you know that if you made it to this part of the interview, you already have the job, we just do this part to make sure we are all on the same page. We need to call references and previous employers first and make sure everything checks out” she mentioned that I’d hear something in a few days. It actually took about two weeks to hear something back but it was perfect timing!", "Interview Questions": "How are you as an independent worker?"}, {"date": "26 Jan 2018", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "First they conducted an easy phone interview. Then I came in for an interview with a manager. Lastly, I had a 3rd interview with the same manager, the CEO, and a staff member working in the same field.", "Interview Questions": "How would you work to build relationships with the schools we work with?"}, {"date": "12 Apr 2022", "title": "Recruitment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Halifax, NS) in Jan 2018", "Interview Descriptions": "Great warm atmosphere. Organized, solid questions and the interviewer made me very comfortable. I was given prompt follow up, and their communication remained just as strong after I was hired. I could always do my best.", "Interview Questions": "What got you excited about this role and how do you see yourself contributing to our overall mission."}, {"date": "15 Apr 2021", "title": "Marketing Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Big Brothers Big Sisters (Orange, CA) in Sept 2017", "Interview Descriptions": "It was fast and easy in their Santa Ana location, went through resume and asked me the typical interview questions.  After the interview, I was shown around the office and introduced to several of the people I would be working with.", "Interview Questions": "Why would you like to do your internship here?"}], [{"date": "4 Aug 2017", "title": "Associate Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Big Brothers Big Sisters (New York, NY)", "Interview Descriptions": "Three long interviews, in which I met 7 people overall. Everyone is nice and friendly but serious. The CEO met with me last for very short amount of time.", "Interview Questions": "Tell me about your values"}, {"date": "29 Jul 2017", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "They were clearly desperate to hire quickly - they called me within a day of applying, an offered me the job almost immediately after my interview. I met with a small team of managers, but a lot of the information about the job they described was pretty misleading. There is way, WAY more paperwork and administration involved in all their positions, and the pay is awful.", "Interview Questions": "Most of the questions were very standard, and the interview was medium length, about one and a half hours, only because I was interviewed by a panel."}, {"date": "14 Jun 2017", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Met with multiple people; two rounds of interviews; good overall experience; very interested in what I had to say; interesting to meet with many people and learn various aspects of the role", "Interview Questions": "Provided many scenarios of how I would handle situations"}, {"date": "20 May 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Big Brothers Big Sisters (Santa Ana, CA)", "Interview Descriptions": "Sent in resume and got an interview within a few days. Interviewer was very calm and friendly and explained the organization’s goals and duties and events. Asked me about my past experience and asked me what branch of the organization I would like to work in.", "Interview Questions": "What are some of your long term goals"}, {"date": "25 Apr 2017", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Seattle, WA)", "Interview Descriptions": "I applied online, and they called me about three weeks later to do a phone screen. We then did the in person a few weeks after that.My interviewers were really personable and it felt like a conversation.", "Interview Questions": "Most were scenarios."}, {"date": "4 Jul 2019", "title": "Marketing and Communications Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Vancouver, BC) in Feb 2017", "Interview Descriptions": "Phone interview and then an in-person interview at their office. The phone interview was very friendly and casual, just a bit about myself and my experience and career interests. They asked me to bring in writing samples, design portfolio and an example of a previous social media campaign to the in-person interview, which was with their larger comms team.", "Interview Questions": "Walk through the process behind designing a previous social media campaign"}, {"date": "30 Jan 2017", "title": "School-Based Enrollment Specialist (Philadelphia) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 2 weeks. I interviewed at Big Brothers Big Sisters (Philadelphia, PA) in Jan 2017", "Interview Descriptions": "Interviewed with Program Managers, then with Chief Program Officer. Managers were delightful; Chief Program Officer was a nightmare. Actually, nightmare puts it rather pleasantly. \n\nAfter mispronouncing my name several times (without asking me how to say it), and oddly asking me where we had met before (I had never, ever met her, but she kept saying she knew me, which was awkward) she very quickly looked at my resume and bluntly said I was not a good candidate. She then strongly hinted that I was wasting her limited and precious time. Finally, after some unenthusiastic questions that she was probably required to ask, she flipped my resume over and asked \"Why are you  here?\" in a very dismissive manner. She then abruptly left the room without shaking my hand which I had extended. Honestly, she did me a tremendous favor--that job has been reposted time and time again, and I'm certain it's because whoever did end up working under her realized what a monster she was and quickly left. I'm lucky my skills weren't wasted working for such a miserable person, no matter how good the cause of the organization.", "Interview Questions": "N/A"}, {"date": "25 Feb 2019", "title": "Big Sister Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Big Brothers Big Sisters (Salt Lake City, UT) in Jan 2017", "Interview Descriptions": "There was a lot of initial paperwork to complete and checks to go through. Once that was all approved and process, I attended an individual interview at which they asked about my intentions, what situations I would be open to, etc.", "Interview Questions": "What experience have you previously had mentoring children and young adults? "}, {"date": "7 Dec 2016", "title": "Caseworker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Cambridge, ON)", "Interview Descriptions": "Great. Relaxing. Was interviewed by CEO and another staff. Interviewers were kind and personable in the interview. Asked standard interview questions about my previous experience and how it would apply to the position I was interviewing for. A few scenario questions. I think it took about 45 minutes.", "Interview Questions": "I don't remember the exact questions, but they were mostly about my previous experience relating to the role and some scenario questions. Also, brush up on child safety legislation + processes. They will likely ask questions pertaining to this, considering the nature of the organization is working with children."}, {"date": "22 Jan 2019", "title": "Big Brothers Big Sisters of South Texas Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Big Brothers Big Sisters (San Antonio, TX) in Dec 2016", "Interview Descriptions": "Apply online/via email with resume and cover letter, interview in-person with manager and supervisor, final interview with C-suite and CEO.\r\nI really recomend asking them questions about current leadership, internal communication, and turn-over.", "Interview Questions": "Where do you see yourself in 3 to 5 years"}], [{"date": "3 Dec 2016", "title": "Program Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters (Tucson, AZ) in Nov 2016", "Interview Descriptions": "Program Director, in this role, escentially watches over the other children in the bunket. directly supervised mentorship programs for three separate organizations. These orgs were all building on the same vision that BBBST is looking to fill--that it only takes one solid adult in a child's life to show them their value and potential in the world. This is a priceless gift and something I could have been passionate and engaged with for a long time. It's unfortunate that my rejection form letter didn't have more helpful constructive criticism to is.. as I would be putting that all into place Schroth", "Interview Questions": "Background information on who I was and how I chose Tucson."}, {"date": "10 Jan 2017", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Big Brothers Big Sisters (Chicago, IL) in Oct 2016", "Interview Descriptions": "There were two interview processes that took place on the phone and in person. The phone interview was quick and easy while the in-person interview took around 45 minutes. They just needed to know more stuff about you so they could see if you could become a big brother/big sister. They were easy questions and afterwards they decided if you were going to be a good fit.", "Interview Questions": "Have you had any past experience dealing with children?"}, {"date": "24 Mar 2018", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters (New York, NY) in Aug 2016", "Interview Descriptions": "I applied online and got a call within 30 mins for a phone screening. I was then asked to come in for an interview. My interview was set for 4:30pm, of course I got there earlier and wasn't interviewed until after 5pm. Looking back that might've been a sign I shouldn't have accepted the offer.", "Interview Questions": "Why should we hire you"}, {"date": "25 Jul 2016", "title": "Associate Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Big Brothers Big Sisters (New York, NY)", "Interview Descriptions": "I applied through email. Five days later, I got a phone call to schedule an onsite interview that week. They gave me a paper application form to fill out while you wait. Met with the director and associate director for about an hour. Asked the standard interview questions, why you want to work here, how the past working experiences will help, and what can you bring into this position etc. At the end of the interview, they gave me two sample emails from mentors and asked me to write case notes for each. The HR got back to me 16 days after the interview.", "Interview Questions": "Why do you want to work here? How the past working experiences help you at this job? What can you bring into this position? Where do you see yourself in 3 years? If I contact your references, what do you think they will say?"}, {"date": "21 Sept 2016", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters in Jun 2016", "Interview Descriptions": "Very straightforward. Had a quick call with a manager, was brought in later that week for an interview. Interviewed with two people, took about an hour and heard back within ten days. Most of the questions were pretty standard but obviously be ready for a discussion about the organization's mission and mandate.", "Interview Questions": "Talk about a time when you had to deal with a work conflict."}, {"date": "18 May 2016", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Chicago, IL)", "Interview Descriptions": "Application online consisted of standard questions plus essays about what I liked about working with children and why I valued mentor relationships. Phone interview was moderate difficulty. In person interview was roundtable with my immediate supervisor, her supervisor, and an HR Rep. Was also given opportunity to talk to two people who had my current position while getting a tour of facility.", "Interview Questions": "Prior experience, how I felt about working more than 40 hours/week,"}, {"date": "28 Mar 2016", "title": "Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Big Brothers Big Sisters (Boston, MA)", "Interview Descriptions": "Applied online.  Was called for a phone interview and then asked to come in person for a interview as well as a presentation.  Interviewed with 3 employees.  Everyone was very nice but it was not a good fit.  Received an email about a week later that they had chosen another candidate.", "Interview Questions": "Explain a difficult experience?  Asked a lot of questions about my current position."}, {"date": "27 Jan 2016", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Interview was personable and tailored toward my experience. I really enjoyed the questions that were asked, they were very reflective and made me realize how qualified I was for the position. I had an initial phone interview which was about 30 minutes and an in person interview which was about 45 minutes. They are very thorough, which is always a good thing.", "Interview Questions": "What would you be bringing to the organization?"}, {"date": "1 Feb 2016", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Big Brothers Big Sisters (Fulton, MS) in Jan 2016", "Interview Descriptions": "I applied on Tuesday, received a call the very next day to set up an interview, and was interviewed the following Monday (Jan 11). The interview was face-to-face with the state program director. She was very nice, told me a lot about the position, and I told her about my experiences with the program and about my life and responsibilities. She said she had to choose a top three and that her boss would conduct a phone interview with the top three by the end of the week so that she could let the new hire know by the day after Martin Luther King, Jr, day (Jan 19) so that person would have time to put in a two weeks notice and be ready to start Feb 1. I did not receive a call, so I assumed I must not have made the top three. However, on about Jan 21 I received an email from the lady I interviewed with telling me to expect a call from her boss that week. He did not call until January 26. He told me the position starts the following Monday (Feb 1) and that the person selected for the job would be called by the end of the week. I never received another call or email and today is the starting day, so I assume I did not get it. I was also told I would receive a call either way, and that did not happen. I just hate how the process drug on for three weeks preventing me to take other avenues.", "Interview Questions": "What do you know about Big Brothers/Big Sisters?"}, {"date": "3 Dec 2015", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Classic interview- they asked questions about my background and different skills that were on resume.  The process was very quick after the interview.  Very short interview - quick and to the point.", "Interview Questions": "Tell me about yourself."}], [{"date": "2 Apr 2016", "title": "Volunteer Outreach Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters in Dec 2015", "Interview Descriptions": "Participated in a phone interview. Was extremely short, only 3-4 questions. Didn't get moved on to the next part of the process. I heard back from them after they had filled the position, but never was told I didn't get moved on.", "Interview Questions": "Why Are you Interested in the position?\r\n\r\nWhy BBBS in particular?\r\n\r\nWhy am I job searching. "}, {"date": "13 Nov 2015", "title": "Relationship Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Big Brothers Big Sisters (Saint Louis, MO) in Nov 2015", "Interview Descriptions": "It begins with a phone interview and moves forward with a panel. After the phone call one is left feeling perplexed. The questions were very automated or cookie cutter and disjointed. It was my responsibility to determine the job description by asking questions. The interviewer was not forthcoming with any information.", "Interview Questions": "What are your strengths?"}, {"date": "23 Sept 2015", "title": "Enrollment and Match Support Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters (Ann Arbor, MI)", "Interview Descriptions": "I submitted my resume, cover letter, references, and application. I heard back from them within a few days and scheduled an interview for the week later. Interviewed in person with the director, and got a rejection e-mail about two weeks later. Interviewer seemed bored that I was there, and was unable to articulate the organization's mission statement.  I left with the impression that they tend to hire female social workers for this role, and the lack of enthusiasm left me not wanting to pursue the position.", "Interview Questions": "Describe a situation where a supervisor did something you didn't agree with and how you handled it."}, {"date": "25 Sept 2015", "title": "Match Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Big Brothers Big Sisters (Chicago, IL) in Sept 2015", "Interview Descriptions": "The entire hiring and interview process is extremely long and egregious.  My interview lasted two hours. First you meet with an HR representative, followed by two managers, then followed by two current match support specialist.  It doesn't flow and the gaps between meeting each group is too wide spread. The pay does not appear that great as well.", "Interview Questions": "Mostly situational and behavior questions."}, {"date": "11 Jan 2016", "title": "Part-Time Community-Based Match Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Big Brothers Big Sisters (Boston, MA) in Sept 2015", "Interview Descriptions": "Was first screened over the phone, then met with two supervisors at the Big Sister Boston office. They were both very nice and seemed very interested in their work. They each asked general questions about volunteer management experience, experience working with youth, experience working with families, then asked questions specific to their departments and logistical questions about meeting the role's expectations (access to a vehicle, open availability to meet with volunteers and families, willingness to attend office meetings, etc).", "Interview Questions": "Describe how you would approach a first meeting between a volunteer and her new little sister's family at the family's home."}, {"date": "30 Dec 2016", "title": "Volunteer Big Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Big Brothers Big Sisters (Baltimore, MD) in Sept 2015", "Interview Descriptions": "In depth interview! They ask questions going back to childhood experiences. They really research their candidates well to make sure that they are a good fit for their 'little's.' 2 hour interview, but I enjoyed it!", "Interview Questions": "What makes you want to get up in the morning? Gives you scenarios and asks how you would best handle the situation."}, {"date": "22 Apr 2016", "title": "School Site Based Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Big Brothers Big Sisters (Houston, TX) in Aug 2015", "Interview Descriptions": "The interview process went well, it was a one on one interview. The questions were straight forward and I took a typing test at the end. I did have to pay for parking when I left the interview but it was in downtown Houston, so understandable.", "Interview Questions": "Describe a barrier you face in the work field?"}, {"date": "25 Jul 2015", "title": "Donation Center Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Big Brothers Big Sisters (Tucson, AZ)", "Interview Descriptions": "I submitted my resume to the organization through a web-based employment service run by the University of Arizona. In a couple of weeks, they called me in for an interview where I sat down with the donation center office supervisor and the donation center manager. It was very easy-going, they were very professional and pleasant.", "Interview Questions": "How would you handle a difficult customer who called and wanted to donate something we don't accept?"}, {"date": "18 Jun 2015", "title": "Match Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Was contacted for a phone interview, the person interviewing went down a checklist of questions and never once asked about my skills but went on and on about why I wanted to work for the organization and what I thought the position included and what I expected about salary. At the end I felt really confused about what I was really applying for as the person on the phone never once really explained the position well. Interviews are suppose to be a two way street but she made it seem like it was just a one way street. HR didn't even bother to send me an email or any notice about not being offered the position which is highly unprofessional.", "Interview Questions": "Do you have a car?"}, {"date": "4 Jun 2015", "title": "Match Support Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Big Brothers Big Sisters (Boston, MA)", "Interview Descriptions": "- 8 days after the job was posted, I submitted an application.\r\n- Received an email the next business day asking to schedule a phone screening 3 days later. The phone screening was very basic and was conducted by an HR office assistant.  When I tried to ask non-surface level questions about the position, she told me that she was not a good source to ask and that she was not as knowledgeable about the role as my next round interviewers (direct supervisors) would be. I hung up from the half hour screening feeling unsure if the role was a good fit. \r\n- Was contacted 2 business days after phone screening asking me to come into the office for an in-person interview in 3 business days.  I was still feeling unsure about the role, so I called my next interviewer (her name was given to me) to ask some clarifying questions; I left her a voice mail and a follow-up email. She replied to my email saying that she would not be calling me and that I should come to the interview to learn more about the position.  It's possible that they didn't want to show any favoritism to prospective applicants, but all I asked for was a <5 minute phone conversation to avoid wasting an hour's time in the future.  I decided not to go in for the second-round interview because the role did not seem like a good fit.  I cannot say I felt valued by HR based off of my brief interactions with them.", "Interview Questions": "Why do you want to work at Big Sister? "}], [{"date": "17 Sept 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Big Brothers Big Sisters (Everett, WA) in Jun 2015", "Interview Descriptions": "The interview was quite informal. There were some specific questions that were used to assess how I would handle certain situations with difficult cases. Otherwise, it was more of an assessment of my personality in order to ascertain if I would fit in the office and in the position. This was done 1:1. After I passed that interview, I then had a group interview with the rest of the office so they could assess my personality and fit with their operation.", "Interview Questions": "Have you had any experience with children?"}, {"date": "13 May 2015", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters (New York, NY)", "Interview Descriptions": "Online posting, in-person interview, and written application upon interview. When I got there, I filled out a physical application and was also given a scenario to write a written response for. The interview questions were pretty standard and they went through them pretty fast. The job was actually more case management than program management and they talked through all of that. I asked questions at the end.", "Interview Questions": "How to handle certain situations between mentors and mentees."}, {"date": "12 May 2015", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Big Brothers Big Sisters (Knoxville, TN) in May 2015", "Interview Descriptions": "I emailed to ask if any positions were available & was able to apply for this. Within the week I had an email asking for a phone interview. After the first phone interview I had an in-office group interview. It was me, 3 staff members, the V.P. of Programs & (supposed to be) the CEO. The CEO had to travel last minute so his portion of the interview was over the phone. \r\nI was asked about my experience with youth in counseling/mentoring; why I'd be a good candidate and why I wanted to work specifically for them.", "Interview Questions": "I was given a \"phone script\" & had to answer questions on what was good/bad about the mentoring situation. Things included were parent involvement; child's development; age appropriate activities; the mentor's response to the mentee. "}, {"date": "13 Jun 2015", "title": "Associate Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters (New York, NY) in May 2015", "Interview Descriptions": "The group interview felt very natural and relaxed.  The wait time was a bit ridiculous, especially given the amount of empty desks the office has.  They make you fill out a paper application and then provide two sample emails so you write case notes.", "Interview Questions": "What makes you want to work with mentors?"}, {"date": "29 Mar 2015", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Application was generic and done online. Interview done as a weed out process group information meeting. They give an overview of the program and then give a scenario for you to work with a small group to come up with solutions. Give you a chance to ask questions and explain the next step to you. When called in for the next interview they give you the paperwork for the background check to fill out while you wait. They are in depth with questioning that is specific to the position; leadership style and team work. Very friendly overall a great process; waiting to see if I got the job.", "Interview Questions": "Do you work better in a group or individually?"}, {"date": "20 Jan 2016", "title": "Enrollment and Match Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Big Brothers Big Sisters in Apr 2015", "Interview Descriptions": "I first conducted a phone interview and then was brought in for an in-person interview. There was a supervisor from both the enrollment and match area to ask questions. The questions were what I would have expected- about my background and situational based questions. None of the questions were too difficult to answer as they all were very much related with the nature of the work.", "Interview Questions": "How would you interact with a child who was having a difficult time in a match."}, {"date": "24 Apr 2015", "title": "Associate Manager of Workplace Mentoring Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Big Brothers Big Sisters (New York, NY) in Apr 2015", "Interview Descriptions": "I submitted my resume and cover letter online and got a call for a phone interview not too long after. I scheduled an in person interview with the Associate Director and Director of the program. I am currently waiting for an response in regards to an offer. It has been a 4 days since the interview. Since I have not heard back yet I selected \"Yes and accepted\" to be optimistic since I cannot submit this and leave that section blank", "Interview Questions": "Basic interview questions (strengths/weaknesses) and questions regarding facilitation situations"}, {"date": "18 Mar 2015", "title": "Enrollment/Match Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Big Brothers Big Sisters (West Bend, WI)", "Interview Descriptions": "I first had a phone interview with Big Brothers Big Sisters of America. At the end of the phone interview, I was asked to come in for a one on one interview with the director the following week. I was told that the company had narrowed it down to myself and one other person. They me asked back for a 2nd interview with potential peers. I heard from them by the end of the week. The interview went smoothly and quickly. I have no complaints. Everyone was very pleasant.", "Interview Questions": "Basic interview questions."}, {"date": "2 Mar 2015", "title": "Match Support Specialist, Spanish-Speaking Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "I was contacted by the Coordinator of Office Administration for a 20min phone screen and was asked about the organization, my relevant experience, and reasons for interest in the organization. After the phone screen, I was emailed and asked to attend an in-person interview the next week. In the in-person interview, I met with two members of the staff team that directly oversaw and worked with the position I applied for, the Manager of Match Support and Coordinator of Match Support. It was a lengthy interview, lasting about an hour and fifteen minutes where the two interviewers took turns asking questions and answering questions that I had. Next I completed a Spanish phone screen, which was brief with about 5 questions total. After the Spanish phone screen, I was invited back to interview with the VP of Programs and the Manager of Enrollment and Matching. When I arrived for the second interview, I only met with the VP of Programs. It was a very basic interview lasting only 20min (which included the time I took to ask questions also). It seemed that VP of Programs had not communicated with my first interviewers, which gave me a sense that the process was a bit disorganized and not cohesive. Once that was over, I completed a short writing assessment where I wrote 2 sample email responses to Big and Little Sisters. \r\n\r\nAfter the entire interviewing process, I was never contacted again by the organization. I understand that the position is still open, however after 2 phone interviews and 2 in-person interviews I at least expected to be informed that I was not the fit they were looking for. I was very surprised not to hear anything from the organization after the in-depth interview process.\r\n\r\nOverall, it seems a great organization that seems to lack efficient communication.", "Interview Questions": "How comfortable do you feel forming relationships with families and facilitating Big and Little Sister introductions in the home of the Little Sister?"}, {"date": "22 Dec 2015", "title": "Volunteer Applicant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took a year or more. I interviewed at Big Brothers Big Sisters (Oakland, CA) in Mar 2015", "Interview Descriptions": "I applied as a volunteer a year ago. Around that time, BBBS did a national marketing campaign, which created a lot of demand. I waited a few months and heard back from an enrollment and match specialist that they were ready to interview me. I paid the $35 processing fee, did the interview and filled out all the administration work. I was told a few months later everything cleared, it's just finding a match at this point. I've been periodically checking back with my match specialist and continue to receive the thanks for your patience and understanding as we work with our limited resources emails.\r\n\r\nI'm very disappointed in the process. Spent a lot of time and money applying and a year later no results. Just wanted to share this so other interested candidates are aware of the process. One of my friend who applied before me hasn't even had an interview yet.", "Interview Questions": "Most questions were situational"}], [{"date": "29 Sept 2016", "title": "Enrollment and Match Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Big Brothers Big Sisters in Feb 2015", "Interview Descriptions": "Multiple interviews first with program staff then with the CEO. Tons of situational questions were asked and many of them required specific examples from past work experience.  After this a writing sample and personality test were required.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "22 Jan 2015", "title": "Director of Community Affairs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Great phone interview. Came in for the in-person meeting and the HR person was great. One of the senior managers; however, strongly suggested that I was too old for the position (being in my 40s), though I was completely qualified.", "Interview Questions": "It was unexpected to feel that the interviewer thought -- quite openly -- that I was too old.  Especially at a not-for-profit."}, {"date": "9 Jan 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "The interview process was not difficult. There were a few basic questions that were asked about my background and past employment and why I was interested in the position.", "Interview Questions": "The most difficult questions were  specific questions or details about previous employment that was asked that was required to be answered in details according to how I handled certain situations. "}, {"date": "14 Oct 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Orlando, FL) in Jan 2015", "Interview Descriptions": "They sat with me one on one and asked me questions to know a little more about myself that way they can have a better idea of who to match me with. They asked why I wanted to volunteer for them and how I found out about them. They were very nice and easy to talk to.", "Interview Questions": "What interested you in volunteering for our program and how did you hear about us? "}, {"date": "29 Dec 2014", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "I had a phone interview first that was only about fifteen minutes long. I was called in for an in-person interview the following day. We chatted for about thirty minutes. Atmosphere was casual but professional.", "Interview Questions": "What would you tell a parent if they asked you for help finding food assistance? "}, {"date": "15 Aug 2017", "title": "Site Based Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Chicago, IL) in Dec 2014", "Interview Descriptions": "First step is a phone interview.  Basic questions regarding past experiences working with youth, volunteers, at-risk population, group presentation skills, etc.\r\n\r\nSecond Step is an in-person interview.  2 separate interview groups comprised of 2 managers. \r\n\r\nThere's also a separate interview of 2 Coordinators already in the role and you're asked  to present an \"activity\" to display organizational skills, presentation skills, and command of room.", "Interview Questions": "Where do you see yourself in 5yrs, or what are your long term goals/plans?"}, {"date": "4 Nov 2014", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "I was brought in for a first and second round interview. On the second interview I was brought around to HR, the executive director, and submitted a background check form.  Only took a few days after my second interview to hear back about the position.", "Interview Questions": "How you handle child saftey"}, {"date": "7 Jan 2018", "title": "Associate Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Big Brothers Big Sisters (New York, NY) in Nov 2014", "Interview Descriptions": "Very long and extensive interview. Following a very extensive phone interview, the first interview was the very rude and abrasive Human resources director and mild mannered Director. the 2nd interview was with the Chief Program officer whom was very friendly and easy to talk to. Final interview was with the CEO whom was very self absorbed and spoke mostly about himself for the duration.", "Interview Questions": "What do you think you can bring to the position?"}, {"date": "17 Jul 2015", "title": "Program Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Big Brothers Big Sisters (New York, NY) in Nov 2014", "Interview Descriptions": "30 minute interview- very straight forward questions. HR, however, met with me later than expected so I was waiting for a bit. I was offered the job on the spot.", "Interview Questions": "Explain your experience working with kids."}, {"date": "29 Oct 2015", "title": "Enrollment and Match Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Big Brothers Big Sisters (Chicago, IL) in Oct 2014", "Interview Descriptions": "3 step interview -- pre-screen, being interviewed by direct managers and a potential colleague and touring the office space, and then meeting with other senior staff and the CEO. Was a quick, but tedious process. Everyone was extremely friendly and time-managed with the interview process.", "Interview Questions": "Why are you best fit for the position?"}], [{"date": "6 Jul 2015", "title": "Enrollment Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Big Brothers Big Sisters in Oct 2014", "Interview Descriptions": "I had an initial phone interview, interview with my direct supervisor, and then another interview with my supervisor's boss. It was pretty basic and informal. They asked me about myself, why I wanted the job, and why I thought I would be good for the agency. They also asked me some difficult scenarios and how I would handle them.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "24 Sept 2014", "title": "Coordinator Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "I had three interviews, met with several different people in the company. Also had an extensive 2 hour long phone interview. The Human Resources process was very slow, and the company never took the time, after all of mine was invested, to reach out to me personally about not getting the job.", "Interview Questions": "N/A"}, {"date": "1 Jul 2015", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Big Brothers Big Sisters (Boston, MA) in Sept 2014", "Interview Descriptions": "The interview process was very straightforward. I gave them a call in which they gave me an email to send in a cover letter and resume. That was followed up by a phone interview, then followed up with an in person interview.", "Interview Questions": "Tell me an example of when you went above and beyond to help a customer."}, {"date": "9 Jun 2015", "title": "Public Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Big Brothers Big Sisters (Gainesville, FL) in Aug 2014", "Interview Descriptions": "Very simple. My interviewer was a recent college graduate who had gotten a job there the previous semester. The questions were more personal as the program is working with children and seemingly wanted to get as sense of my background. My interviewer asked questions to get to know me and how I had worked with kids in the past, my work ethic, previous jobs and my experience level in public relations.", "Interview Questions": "What kind of fruit would you be and why?"}, {"date": "22 Apr 2015", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Big Brothers Big Sisters (Lancaster, CA) in Jul 2014", "Interview Descriptions": "Briefly asked about former experience working with people and past experience in the social work field. Was asked how I was at handling conflict between people and high stress jobs.", "Interview Questions": "Are you comfortable making phone calls?"}, {"date": "2 Jul 2014", "title": "Enrollment Specialist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Big Brothers Big Sisters in Jul 2014", "Interview Descriptions": "I forwarded my resume via email and received an email the next day requesting a phone interview. After the phone interview then your resume is forwarded to the hiring manager. The hiring manager will schedule you for a second interview plus schedule you for a computer skills test along with a typing test.", "Interview Questions": "There were no difficult questions, just the basic questions."}, {"date": "4 Apr 2016", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (San Antonio, TX) in Jul 2014", "Interview Descriptions": "The supervisor  interviewed me was nice. I did not feel overwhelmed or intimidated as both the supervisor and the employee that was being relpaced asked me about my experience and gave me a few scenarios about certain volunteers on an average case load.", "Interview Questions": "they gave me scenarios and what would I do in those situations"}, {"date": "20 Jun 2014", "title": "Mentor M≪ Anager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Wasn't too bad, although initial interview took over 3 hours and interviewer did most of the talking.  Second interview was brief.  Decision was made in a decent period of time considering the norm.", "Interview Questions": "I don't remember - most questions were pretty typical - like strengths and weaknesses."}, {"date": "1 Jun 2014", "title": "Enrollment and Match Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "I applied online and was contacted in a few days to set up a phone interview. The phone interview lasted about 20 minutes and I was told more about the position and was asked to discuss experience, education, etc. From the phone interview, an in person interview was scheduled for the following week. I was interviewed by two individuals and the interview lasted about an hour.", "Interview Questions": "Think of a time when you adapted your communication style when dealing with someone who clearly had a different perspective than you. Tell me how you adapted the content of your message to ensure it was effectively received."}, {"date": "12 Feb 2018", "title": "Match Support Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Big Brothers Big Sisters (Toronto, ON) in May 2014", "Interview Descriptions": "Spoke with the Manager and Director for an hour and answered standard questions about working with children, having difficult conversations, and work-life balance. Completed a 30 minute case-management exercise after the interview.", "Interview Questions": "What are your self-care strategies?"}], [{"date": "7 Mar 2014", "title": "Enrollment and Match Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Initial telephone interview that took about 10 minutes. I was told more about the Job Description :the  interview process for Bigs and family interviews for Littles, which might take 1 to 1 1/2 hour in the homes.  Was asked about my previous experience in the field. Follow-up question was: would I be comfortable doing this?  (My Answer :\"Yes\".)I was told there are forms, documentations to fill out afterwards.  What were my computer skills like? (Average 30-35 wpm. I could brush up on Excel if needed.) Interview ended on \"someone will be getting back to you in a week or sooner.\"  I was emailed in 5 days that they were looking for someone with \"more clinical experience in the field.\"", "Interview Questions": "N/A"}, {"date": "2 May 2016", "title": "Enrollment and Match Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Big Brothers Big Sisters (Wichita, KS) in Jan 2014", "Interview Descriptions": "Interviewed a a specialist in Wichita, KS. Received a call after submitting my resume online. Scheduled and interview and started working 2-3 weeks later. The process was straight forward. After the one on one interview with the hiring manager you're asked to write a report from a scenario given. Make sure to be detailed and proofread.", "Interview Questions": "Tell me about a time you had to deal with a difficult client?"}, {"date": "25 Dec 2013", "title": "Match Support Specialist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "I was invited to attend a group interview. There were 7 other candidates there. It was more like an information session.  We broke up into groups to answer  a case scenario question and then had to report to the larger group.  I was invited to attend a one on one interview, with two employees of the company.", "Interview Questions": "The most difficult question was specific to a phone transcript that I was given and had to answer questions about it."}, {"date": "13 Nov 2015", "title": "Enrollment and Match Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Big Brothers Big Sisters (Boston, MA) in Dec 2013", "Interview Descriptions": "The interview process overall went well. You are first phone screened and then brought in for a series of interviews. Due to the high volume of turn over, they are used to the interview process and happy to move it along quickly. The decisions can come very quickly, but they do require phone reference checks that can take some time to schedule.", "Interview Questions": "They ask about past experience in related fields, your passion for the work and availability to work overtime among others."}, {"date": "18 Oct 2013", "title": "Relationship Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Big Brothers Big Sisters (Miami, FL)", "Interview Descriptions": "Went through a phone interview, a second interview and then a third interview with the Vice President and really felt as though I got the job but did not receive an offer.", "Interview Questions": "Tell me about a time when your dignity was challenged."}, {"date": "23 Aug 2013", "title": "Intake Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Received a phone call to come in for an interview. I was interviewed by the CEO and Supervisor who were gentle in their approach to help with interviewee feel relaxed. Were respectful and very communicative. The interview lasted about 45 minutes and they told me when I can expect to hear from them should I be the chosen candidate.", "Interview Questions": "List all resources are you familiar with in this city. There are so many in a large city so I listed the ones I knew that were related to families or children. "}, {"date": "25 Jul 2013", "title": "Human Resource Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters (Irving, TX)", "Interview Descriptions": "Went through a phone pre-screening process before the actual face-to-face interview.  Interviewed with the VP of HR and she was very straight forward and to the point but also comfortable. Good interview even though I was not chosen for the position.", "Interview Questions": "What was the most difficult employee relations situation I had been involved in?"}, {"date": "11 Jul 2013", "title": "Match Support Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "The hiring and interview process was pretty straightforward and went smoothly. I first had a phone interview, and then was asked to come in for an in-person interview. The in-person interview was with three people-a member of upper management, a team lead, and a staff member.", "Interview Questions": "The questions were straight-forward and easy to answer if you have ever worked with children or have done any type of social service work."}, {"date": "8 Dec 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Big Brothers Big Sisters (Decatur, IL) in Jun 2013", "Interview Descriptions": "Multi-stage in-depth interview process. First was interviewed via phone, then in person by three people, and then a one-on-one with my future supervisor. I felt the process went smoothly and I felt well-informed each step of the way.", "Interview Questions": "How have you resolved conflict with a co-worker in the past?"}, {"date": "21 Feb 2014", "title": "Donation Driver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Big Brothers Big Sisters (Las Vegas, NV) in Jun 2013", "Interview Descriptions": "First interview is conducted by Operations manager. He is rude and acts like he doesn't want you to be there. Simple questions about your experience and then he'll have the lead driver conduct second interview, those guys are generally pretty nice.", "Interview Questions": "Really nothing out of the ordinary here. Schedule conflicts, experience, why BBBS, etc."}], [{"date": "11 Aug 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Big Brothers Big Sisters (San Diego, CA) in Apr 2013", "Interview Descriptions": "it was really brief, had to see which one would be fit for the kids. they called you if they liked your resume, then you went to the district office and sat down for an interview. asked questions about your goals, what would you do in this or that situation, and see if you were fit. easy interview tbh", "Interview Questions": "\"What are your experiences working with kids?\""}, {"date": "7 Oct 2015", "title": "School Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Big Brothers Big Sisters (Baltimore, MD) in Jan 2013", "Interview Descriptions": "I was first given a phone interview that was very brief and just asked a few basic questions (How much did I know about the organization? Why do I want to work for them? Etc). Then I was called in for an in-person interview with two directors/managers. They were both very pleasant and asked typical interview questions as well as give hypothetical scenarios to gauge how I would handle problems.", "Interview Questions": "Can you tell me what you think Big Brothers Big Sisters does?"}, {"date": "29 Oct 2015", "title": "Development Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Big Brothers Big Sisters (New York, NY) in Dec 2012", "Interview Descriptions": "I was brought in three different times and made to wait a lot.  There were lots of people who interviewed me.  Between interview sessions I was told to wait in the lobby and it seemed like I was not priority and people forgot about me.", "Interview Questions": "How do you prospect"}, {"date": "8 Apr 2015", "title": "School and Site Based Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Big Brothers Big Sisters (Lakewood, NJ) in Oct 2012", "Interview Descriptions": "I applied online on Craigslist. I received a phone call about a week or two later where I scheduled an in-person interview at the office. I met with the CEO and Program Director. They informed me heavily about my position and what I would be doing. They asked about my experience working with children and why I was looking for a new job because I was still employed at the time. The interview was casual and I can tell they they felt positive about me at the interview. They informed me of the salary/benefits during the interview as well.\r\n\r\nAbout a week later, I received a call where I received the job offer and worked there for about two and a half years!", "Interview Questions": "How familiar are you with computers?"}, {"date": "6 Sept 2012", "title": "Enrollment and Match Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Big Brothers Big Sisters", "Interview Descriptions": "Applied through craiglists. It was over a month before called in for an interview. They said I was interviewing with 1 person and I showed up to a group of 5 people. Interview questions were very long with multiple parts so you pretty much had to ask them to repeat all questions. I didn't have to answer the scenario questions because I gave examples during the regular interview portion. I was offered the job the following week.", "Interview Questions": "Describe a situation in which a supervisor did something you didn't agree with and how did you handle it. "}, {"date": "18 Feb 2013", "title": "School Based Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Big Brothers Big Sisters (Philadelphia, PA) in Sept 2012", "Interview Descriptions": "I had a phone interview and then went to the office for a job interview.  My first warning was that the saddest looking person in a very full elevator  went into the BBBS office.  I have worked at a BBBS agency before, so my guess was she was a mentoring manager.   I was interviewed by a panel of three.  Two of them were nice, but the head honcho ( as they had no ED at the time)  made me feel that I was at an interrogation instead of an interview.  She made way too many assumptions about me. all wrong.  I knew even if offered, there was no way I was working for this angry woman.  The two other women seemed a bit intimidated by the grump as well.", "Interview Questions": "The problem was that since there were 3 people and no one seemed to have a question written the interview was pretty random,not fun for the the interviewee. one question would be about my qualifications, and then a question about where my parents lived....and even where my boyfriends parents lived.  whaaa??    There were way too many personal questions asked...  questions about my family,my relationship.  It was probably the worst interview ever  which is kind of ridiculous since I had done the job before at another agency and actually supervised and trained other people for the same job."}, {"date": "2 Jul 2015", "title": "Partnership Builder/Event Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Big Brothers Big Sisters in Aug 2012", "Interview Descriptions": "One quick interview. I went in and did the interview with my direct supervisor and the CEO. I was introduced to the staff on a quick tour. No phone interview and no second interview.  I was offered the position within a week.", "Interview Questions": "What fundrasining experience do you have and what would you change about it?"}, {"date": "7 Jul 2012", "title": "Event Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Big Brothers Big Sisters (West Palm Beach, FL) in Apr 2012", "Interview Descriptions": "University commenced the Interview process in where basic Interview questions were addressed.  The next step included an interview with the employer which assured that this would be a best fit for the organization.  I enjoyed the process all together.", "Interview Questions": "Address an event where faced with a difficult team player, and what three solutions can be implemented to solve the issue?"}, {"date": "11 Apr 2016", "title": "Intern - Hourly Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Big Brothers Big Sisters (Chicago, IL) in Apr 2012", "Interview Descriptions": "Very easy and the woman made me feel very comfortable. The woman made sure to look me in the eye while I was talking and made me feel like I was the only one in the room", "Interview Questions": "Tell me about yourself?"}, {"date": "9 Jul 2015", "title": "Office Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Big Brothers Big Sisters (Saint Louis, MO) in Jan 2012", "Interview Descriptions": "Not very long, but several phone calls for screening then one interview face-to-face.  They took a bit to get back to me.  Pleasant interviewers, not super formal.  In person interview lasted about 45 minutes.", "Interview Questions": "What do you have to offer the company?"}], [{"date": "14 Nov 2011", "title": "Case Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Big Brothers Big Sisters in Aug 2011", "Interview Descriptions": "The interview was very comfortable but they only asked me 1 question. I was interviewed by 2 people who were very nice and easy to talk with. But other than the one question, the time was spent just talking about the position. It was nice to learn all about the position, but it would be nice to have more questions asked about my interest and qualifications.", "Interview Questions": "What experience did I have with Big Brother Big Sister?"}, {"date": "23 Jun 2015", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Big Brothers Big Sisters (New York, NY) in Jan 2011", "Interview Descriptions": "Interview with Human Resources, direct leadership, and the E.D.D. before getting an offer. Interview is a great way to learn what expectations are from the position and to meet your leadership.", "Interview Questions": "Interview questions were standard however, there is an emphasis on making sure that you understand the mission of the organization and that you've had some experience in the past.  Overall, each person wants to make sure you are a good fit for the organization."}, {"date": "11 Jan 2014", "title": "Clay Count Area Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Big Brothers Big Sisters (Jacksonville, FL) in Jun 2010", "Interview Descriptions": "Walked into the office and gave the secretary my resume and asked if I could speak to someone about a position. She told me to come back in an hour and she would have me interviewed. I was interviewed with the COO and then the next day the CEO. It was mainly just talking to one another and not very formal. There is a lot of attrition in the position/company.", "Interview Questions": "Don't recall any specific questions."}, {"date": "13 Jul 2010", "title": "Recruitment Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Big Brothers Big Sisters (Saint Louis, MO) in Oct 2009", "Interview Descriptions": "Interview lasted around 45 minutes with most of the questions being your guideline human resource questions. It was a salary position starting at around 31000 in the 45-50 hours a week range. The interview was a one on one interview in a comfortable setting.  It took around 4 days to get the results back on the status of the job.", "Interview Questions": "Name a time in your past experiences in which you had to give a presentation to a large group of individuals?"}, {"date": "28 Sept 2010", "title": "Senior Software Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Big Brothers Big Sisters (Philadelphia, PA) in Jun 2009", "Interview Descriptions": "I submitted an online application for the position.  Later, I was called for a brief telephone screen, then scheduled in-person interviews on-site with multiple people.  The questions were much more about attitude than skills, although there was one skill-specific interviewer.  The people were clearly passionate about the company and its mission.", "Interview Questions": "You're currently making above the salary range for this position - I want to make sure that won't be a problem before we continue.  Do you have any issues with taking a pay cut to work here?"}, {"date": "28 Aug 2009", "title": "Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Big Brothers Big Sisters in Jan 2009", "Interview Descriptions": "The interview went very well.  It was very relaxed and I did not feel at all like I was being interrogated.  The office was laid out in a comfortable way and the questions asked were all pertinent.", "Interview Questions": "What are your greatest strengths and weaknesses?"}, {"date": "15 Aug 2010", "title": "Education Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Big Brothers Big Sisters (Hartford, CT) in Aug 2008", "Interview Descriptions": "The communication was positive and very frank.", "Interview Questions": "Why do you want to make a change?"}, {"date": "13 Jun 2010", "title": "Big Sister Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Big Brothers Big Sisters in Jun 2008", "Interview Descriptions": "This interview was fairly easy, and completely worth it. It only lasted about an hour. I was asked questions about my background, my religion, my life in gneral. They then asked what age group you would like to work with and if you'd like a boy or a girl. They strive to meet the needs of both parties. Completely worth it.", "Interview Questions": "What is your religion?"}]]