[[{"date": "8 Aug 2022", "title": "Risk Management Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Metro Inclusive Health", "Interview Descriptions": "Phone screening, then video call. Was told they needed to talk to a few more people and I should hear back soon. The next week the job was posted again, I hadn’t heard back from HR.", "Interview Questions": "What do you know about the company"}, {"date": "8 May 2023", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Metro Inclusive Health (Saint Petersburg, FL) in Oct 2021", "Interview Descriptions": "Two interviews usually with CEO and other relevant director. Asks about experience working with medical staff, experience with EMR. Situational questions like how have you reacted to a high stress situation. questions about organization.", "Interview Questions": "What is your experience working in an EMR?"}, {"date": "7 Jul 2021", "title": "Early Intervention Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Metro Inclusive Health", "Interview Descriptions": "It seems fairly straightforward. All you truly need to do is understand the job functions, and be able to relate past experience your future job functions. The interviewers are very nice and warm individuals.", "Interview Questions": "What would you say to an individual who may have come to you distraught over reactive result to a HIV test?"}, {"date": "1 Apr 2021", "title": "Director of Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Metro Inclusive Health", "Interview Descriptions": "I scheduled through Indeed. \r\nI received an email confirmation, and then a couple of text reminders. \r\nVirtual interview,  it was very quick the position had \r\nalready been filled.\r\nOverall it was a pleasant experience.", "Interview Questions": "N/A"}, {"date": "3 Mar 2021", "title": "Director of Finance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Metro Inclusive Health (Saint Petersburg Beach, FL) in Dec 2020", "Interview Descriptions": "Standard interview process. Quick meeting with HR then hiring manager, then CEO if you are top candidate.  Follow-thru is terrible! Communication stopped after CEO/CFO meeting and then position was re-posted a month after the \"final\" interview. CFO was at least honest in the interview and said that the last SEVERAL people in the position didn't make it past 90 days. SEVERAL!!! Big red 🚩\nUnless you NEED a job because you don't have one currently, pass on this place. Don't leave a good paying job because you could be looking for a new one within 90 days.", "Interview Questions": "Why do you want to work here?"}, {"date": "17 Aug 2020", "title": "LGBTQ Program Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Metro Inclusive Health (Saint Pete Beach, FL) in Jul 2020", "Interview Descriptions": "I was initially contacted for an interview by a person in HR. The did an initial screening and told me I would have a follow-up interview with the hiring manager the following week via GoToMeeting. When it came time for my interview I was stood up. I tried to contact the office to ensure I had the right time, the HR person was not in and the person I spoke with did not know who else to put me in contact with. I e-mailed the HR rep and didn't hear anything back for three days. The HR rep rescheduled my interview and when the time came for my interview the manager again was not in and I was interviewed by somebody else in the position I was applying for. The interview was pretty straight forward and had typical questions. I was told I would hear something in 2-3 weeks. I never heard anything, but I know with COVID things are challenging. I contacted the HR rep again to see if I was still in consideration for the position and never heard anything back.", "Interview Questions": "There were quite a few scenario questions about how you would respond."}, {"date": "13 Mar 2020", "title": "Prevention/Sexual Health Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Metro Inclusive Health (Saint Pete, FL) in Jun 2019", "Interview Descriptions": "my interview process was made extremely easy to navigate. I was interviewed by three people including the C.O.O, and two directors. I was given a warm, professional welcome, given a tour of the facility, and was made comfortable by everyone conducting the interview.  The process was a seamless, pleasant experience, and I was contacted about my position promptly.", "Interview Questions": "One of the things I was asked was why I was passionate about working for a non-profit such as Metro, and how my relevant skills might bring quality service to the organization "}, {"date": "1 Jun 2019", "title": "Program Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Metro Inclusive Health (Tampa, FL) in May 2019", "Interview Descriptions": "went for interview, took excel test. The 2 women who interviewed me seemed disorganized, also the info they gave regarding the position was different than what HR had given. Stated they had a position in both Tampa and St. Pete. In checking their website both positions are still open- St Pete for several months.", "Interview Questions": "no real questions, just a basic discussion, with a promise to get back to me with a yes/no in 2 weeks. One month later still no response even after calling HR. Also, the original HR person apparently had quit and new person was not versed on the open position."}, {"date": "15 Nov 2019", "title": "Division Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Metro Inclusive Health (Saint Petersburg, FL) in Apr 2018", "Interview Descriptions": "Standard. Once at the interview i was greeted with friendly faces and very engaging management staff. The process was thorough but not intimidating. I felt confident in my answers and they made me feel like they were looking for the right person to fill the role.", "Interview Questions": "Tell me about a time where you had to handle a conflict. Can you specifically tell me how you handled it and what was the result?"}], [{"date": "12 Feb 2016", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Metro Inclusive Health (Saint Petersburg, FL)", "Interview Descriptions": "The interview process was not difficult. Phone interviewer will ask you what do you know about the company so be prepared to answer. The face to face interview was conducted with two staff members. Ask typical questions pertaining to the job description.", "Interview Questions": "How did you hear about our company and how will you fit in?"}, {"date": "12 Oct 2016", "title": "Program Support Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Metro Inclusive Health (Saint Petersburg, FL) in Sept 2015", "Interview Descriptions": "Submitted my resume through an employee referral, then recieved a call from there one HR Staff member to set up the interview, did a face to face interview with  the Director whom ask pretty standard easy question and then Hired by VP/COO", "Interview Questions": "1.Your Experience\r\n2.What is it that you like to do?\r\n3. What positions have you been in that are similar to this?"}]]