[[{"date": "19 Feb 2022", "title": "RN, PRN, Emergency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University Medical Center of El Paso (El Paso, TX) in Jan 2022", "Interview Descriptions": "Received a call and did an on the spot phone interview. Was asked what credentials I had and if I was working anywhere else currently. FYI- the ONLY certifications the accept for BLS, ACLS and PALS is through the AHA.", "Interview Questions": "Asked scenario questions like when was a time I was particularly efficient in a scenario when I did not have the tools required to be."}, {"date": "27 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University Medical Center of El Paso (El Paso, TX) in Dec 2020", "Interview Descriptions": "Over the telephone due to Covid.  Interview was on time. Less pressure over the phone, The interview went well. The interviewer was very nice and informative.  I really liked the telephone process.", "Interview Questions": "Why I chose University Medical Center"}, {"date": "19 Nov 2020", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University Medical Center of El Paso (El Paso, TX) in Nov 2020", "Interview Descriptions": "about 7 questions with director and one register nurse. The basic they ask in every interview. Why would you be a great candidate etc? What are your long time goals? Where do you see yourself in 5 year?", "Interview Questions": "N/A"}, {"date": "19 Nov 2019", "title": "Certified Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University Medical Center of El Paso (El Paso, TX) in Nov 2019", "Interview Descriptions": "I had an interview with the lab technician and director they usually do 2 separate interviews but i did it all in one day it was easy simple questions about what i would do in certain situations", "Interview Questions": "What tube is used for a pt test"}, {"date": "27 Mar 2018", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University Medical Center of El Paso (Lubbock, TX)", "Interview Descriptions": "Word of mouth got my application looked at..interviews with supervisors and then a peer interview..supervisors very friendly and humble..serious but makes u feel comfortable..overall a very non intimidating process", "Interview Questions": "Previous Experience, Define success "}, {"date": "9 Jul 2015", "title": "RN I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University Medical Center of El Paso (El Paso, TX) in Mar 2014", "Interview Descriptions": "The interview consists of two interviews. The first interview was with the Manager and Assistant Manager. The second interview was with employee who work on the unit. The questions were very standard and felt comfortable in the environment.", "Interview Questions": "How can you use your previous experience for this position? What can you bring to the unit?"}, {"date": "26 Aug 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University Medical Center of El Paso (Lubbock, TX) in Oct 2013", "Interview Descriptions": "Was the standard interview. Interviewed by a group of nurses that actually worked in the unit as well as the with the unit education manager. Given a breakdown of the organization and how it works closely with its affiliate, Texas Tech University, and it's staff. The department works with Surgeons, Residents, and Anesthesia which all are a part of Texas Tech University", "Interview Questions": "Have you ever had a difficult situation in the work place? If so, describe it and how you handled it."}, {"date": "25 Jun 2017", "title": "Patint Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University Medical Center of El Paso (El Paso, TX) in May 2013", "Interview Descriptions": "Called and intervied me-couple weeks later went through a background check and went through a second interview through supervisor. Then they called me back and I got hired. Then I started working a couple of weeks later,", "Interview Questions": "N/A"}, {"date": "31 Jul 2014", "title": "Histology Transcriptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at University Medical Center of El Paso (El Paso, TX) in Apr 2012", "Interview Descriptions": "Took place before I had to go out of town for brother's funeral. Called on the phone for an interview that afternoon for a temporary position. The Staffing company posed different questions to me, did a  drug/background check, and then sent me to the actual Pathology Supervisor. Pleasant, supportive staffing company, but firm in their ways. The Pathology Supervisor was more relaxed in her approach to me with her interview questions.  She was friendly but professional as well.", "Interview Questions": "Tell me about yourself. Are you an introvert or an extrovert?"}, {"date": "8 Feb 2014", "title": "Rehabilitation Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University Medical Center of El Paso (El Paso, TX) in Dec 2011", "Interview Descriptions": "For a job such as this one it is great of course to have interpersonal skills, but a strong stomach, and physical strength are definitely a plus. I would recommend during the interview to be as professional as possible and answer all questions truthfully and to the best of your knowledge.", "Interview Questions": "Why do you think you are the best fit for this position?"}]]