[[{"date": "7 Jul 2023", "title": "Appointment Setter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "Smooth and easy remote interview. Very informative and managers were extremely nice. The interview lasted about 10 minutes and their questions were straight to the point. Seems like a great place to work. I was offered a job a week later but unfortunately got another job before that.", "Interview Questions": "What do you have to offer that another applicant may not?"}, {"date": "6 Jun 2023", "title": "New Grad RN Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "I had two interviews, first was the hiring team which was made up of a few nurses from different units, they generally wanted to know what I knew about the company, my views on specific things like culture diversity were and if they aligned with CHLA’s mission, and mostly the essay questions from our application. Second interview was with two managers, unit specific, it was very conversational. The goal was to get a feel for how I would fit on the unit. A ton of situational questions such as “Tell me a time when you went above and beyond for your patient or had a difficult patient\u2028, and had a conflict with a coworker”, “why this unit/hospital”, “why did you become a nurse”. Those were the top questions asked, the rest of the interview I asked a million questions about the unit and residency.", "Interview Questions": "N/A"}, {"date": "3 Jun 2023", "title": "Clinical Research Coordinator I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "Supervisor called to do a short phone screen interview - briefly reviewed my resume & past experience. Agreed on an interview date with the team - supervisor sent an interview invitation shortly after for a time we did not agree upon over the phone. while it wasn't a big deal, it did put me off. Interview with the team + supervisor was mainly led by the team, supervisor asked maybe 1 question. Standard questions you could expect from an interview. Some behavioral questions, some related to the job and some not. They seemed really eager to explain the role and oversold the company. Heard back from Talent Acquisition roughly two weeks later, who told me they were extending an offer. FYI: THERE IS NO NEGOTIATION IN SALARY, except maybe a 50 c increase if you attempt to negotiate. I ultimately declined d/t that conversation. The interview process itself, however, was overall positive. would have been a decent team to work with.", "Interview Questions": "why CHLA/that role? tell me about yourself? stressful time/situation - how did you deal with that"}, {"date": "31 May 2023", "title": "New Graduate Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Your first interview will be general and will generally be geared toward your two choices. The second interview will be given if you are selected by one of your two unit choices. The interviews were straight forward and are clearly meant to understand your desire to work in that specific unit. Interviewers were kind and professional! I would say overall I had a great experience interviewing with CHLA.", "Interview Questions": "Why do you want to work at CHLA?"}, {"date": "8 May 2023", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Only had to do a unit interview. Quite short and simple. Just asked if you had experience handling children before, and what your goals are for the future. Didn't take longer than 15 minutes.", "Interview Questions": "Explain a past experience handling children."}, {"date": "27 Apr 2023", "title": "New Graduate RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "2 rounds. First 15 minute zoom interview to nurses within talent acquisition, seemed like they had done a lot of interviews so conversation was difficult. 2nd round was unit specific with 2 20 minute portions one with unit nurses, the other with a manager.", "Interview Questions": "First round interview was almost identical to the essay questions"}, {"date": "16 May 2023", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles in Apr 2023", "Interview Descriptions": "There are two rounds of interviews. The first one is with the general hiring team. I interviewed with two RNs and it lasted about 15 minutes. The second one was scheduled for 45 minutes with the unit. I interviewed with a panel of eight people.", "Interview Questions": "1. Tell me about yourself 2. Where do you see yourself in 3 to 5 years 3. What was your biggest challenge? 4. What was a moral dilemma you faced? 5. What was a teamwork experience you had? 6. Why pediatric nursing?"}, {"date": "22 Mar 2023", "title": "IT Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "Had one phone screen with the hiring manager that was approximately 30 minutes long, then I had an hour video interview with a panel of 4-5 team members. After this, I was invited for a 3-4 hour on site interview. Seeing as I am currently employed and they wanted me to come in during the middle of the week, this posed some challenges but I was able to schedule time off work to make it to this interview. After the interview was scheduled, I followed up a few days later to nail down specifics like what exact time we would meet and where in the hospital I should arrive. I heard no response, not even after the interview date had passed. \"Ghosting\" your candidates without a word after an on site interview is scheduled is extremely unprofessional and I think it speaks volumes of the kind of working environment that is present here.", "Interview Questions": "I was asked a lot of behavioral questions such as how I would deal with difficult or egotistical supervisors, doctors, etc."}, {"date": "11 Mar 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Mar 2023", "Interview Descriptions": "Long situational questions. A lot of what would you do if x y and z and how would you resolve a conflict. Nothing nursing related. Overall not bad, just wish it was focused more on skills and experience that I can speak on", "Interview Questions": "Describe a time you had conflict with an employee and how did you resolve it"}, {"date": "12 Feb 2023", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Great interview and employment process. Heard back from HR fairly quickly. Started position within 2 weeks with training. Interview questions are common questions and remember to also ask questions. Very reputable hospital and great place to work.", "Interview Questions": "How do you deal with difficult situations?"}], [{"date": "18 Jan 2023", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Received phone call from recruiter. Over zoom, met with director of rehabilitation. Interview lasted about 30 or so minutes. Spoke about logistics as well as expectations. Very straightforward and normal interview.", "Interview Questions": "Can you tell me about yourself"}, {"date": "7 Jan 2023", "title": "MRI Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "first part was online with the hiring manager. during this part, they will ask you questions. I know another person who got interviewed but this time it was with the MRI lead techs. the second part is to be interviewed in person. this also includes a tour of the MRI scanners and a window to see the workflow of the environment.", "Interview Questions": "what made you decide to apply at chla?"}, {"date": "15 Mar 2023", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Children's Hospital Los Angeles in Jan 2023", "Interview Descriptions": "Interview process was extremely quick - from initial phone screening to verbal offer was 8 business days! Interview process consisted of 1 phone screening and 2 30-minute Zoom panels. Never visited office or hospital. After a week of negotiation, I declined the first offer because it did not meet my minimum compensation needs. The following week, I was contacted again and negotiations restarted. I eventually accepted the second offer, and began the onboarding process, including getting drug tested and getting my photo taken. Eight days before my start date I received a call from HR informing me they were rescinding my offer because there was insufficient funding for the position. \r\n\r\nI don't know how this happened, particularly with there being weeks of negotiations happening. Very poor form, and does not reflect values of an organization I would want to be associated with. They may do meaningful work, but I could tell from the onboarding process that there is room for a lot of improvement with staff satisfaction.", "Interview Questions": "Tell us about your experience managing grants and projects, specifically Federal contracts?"}, {"date": "21 Nov 2022", "title": "Sr. Social Media Strategist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "I was ghosted after submitting social media strategy, so fellow social media professionals--beware. For context, after I applied online for this position, someone from their HR team reached out through 3 methods: email, phone call, and text. Not for an interview, but to get my \"insight\"... Mind you, this was all before the usual initial phone call. They requested for the social media strategy on Friday and expected to have it by Monday morning. Working in social media, this request is not out of the ordinary (though companies usually offers compensation), so no major alarm bells went off considering this was CHLA, a well-known organization. I sent my strategy and they responded to say they'd like to move forward with an interview as the next step. Unfortunately (or fortunately?) the interview never happened and they essentially ghosted me after I gave them what they asked for free.", "Interview Questions": "Submit 1-page statement that covers: a) Why you think you are well qualified for the position. b) Why you are motivated by the CHLA position. c) Your ideas on new strategies for @sugarproofkids Instagram page and for the Southern California Center for Latino Health d) Include links to examples of your work"}, {"date": "10 Oct 2022", "title": "Accounts Payable Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Interview process was super smooth. I really enjoyed meeting the team and my interview process went really well. Be prepared to answer questions regarding the field to show your expertise.", "Interview Questions": "What is your accounting experience and background?"}, {"date": "27 Aug 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "I feel a moral obligation to let people know how incompetent and poor my interviewers were in treating me.  \nFrom ill-timed and blunt questions, to a clear disinterest in me as a candidate right off the bat, this was the worst interview experience I ever had.", "Interview Questions": "What is the length of graduate programs you are looking at?"}, {"date": "1 Oct 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Aug 2022", "Interview Descriptions": "After two hour-long interviews, I never received a follow up— even an auto-rejection! Interview itself was fine, some questions felt unnecessary.  Would have been nice to at least be told no. Ghosting is not cool", "Interview Questions": "What interested you in this role"}, {"date": "16 Dec 2022", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Jul 2022", "Interview Descriptions": "HR reviews the application and forwards to hiring manager. All virtual until the hiring manager has you meet with staff members and they give a mini interview with feedback too", "Interview Questions": "Why I choose to interview CHLA"}, {"date": "16 Jun 2022", "title": "Information Security Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Interview process was comprehensive and straight forward. Typical interview format. Just be well prepared and you should be ok. I got connected with some people and then a hiring manager called me after a few rounds of interviews/meetings", "Interview Questions": "Tell me a little bit about yourself"}, {"date": "25 Apr 2022", "title": "New Grad Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Simply put, it was very general and simple. There are a total of two interviews, one with different employees across CHLA and the next is unit-specific.  It was virtual and the first interview was about 15 minutes long.", "Interview Questions": "The first interview asked questions regarding diversity and patient experience. Specifically, why CHLA?"}], [{"date": "22 Apr 2022", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Apr 2022", "Interview Descriptions": "First part of the interview was a 15-minute camera interview consisting of three questions. The interviewers were nice and personable. They made the interviewee comfortable.  The interview can be less than 15 minutes depending on how fast you answer the questions.", "Interview Questions": "Why did you choose this program?"}, {"date": "18 Feb 2022", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Interviewed for 2 positions. Each consisted of one Zoom interview with the person who would be my direct supervisor. No one from HR was included in the interviews, which caused confusion because  your interviewer can’t discuss things like salary with you, and likely doesn’t understand HR’s hiring process.\r\n\r\nOne of the managers put me on the spot during the interview and immediately offered me the role, I told them I needed a few days to consider it and wanted to discuss salary and benefits with HR first. I think they were confused on how to handle candidates, because it turns out that they’re actually not authorized to offer the job, and they completely ghosted me when I followed up with them about speaking with HR because they didn’t want to forward my information until I accepted. I ended up accepting the other role after this, and they were more responsive and professional. \r\n\r\nThe interviewing and hiring process definitely needs more work. The HR contact was pressuring me to start earlier than I requested despite special circumstances, and overall the process with getting cleared by HR and the health clinic was super disorganized and stressful. I had to submit my references 3 different times, change my start date, and was told conflicting information by HR, the interviewer, and the health center. \r\n\r\nI was able to negotiate a sign on bonus, but definitely negotiate the salary HR tells you, as I’ve now learned that I could be making at least $5k-10k more at other companies.", "Interview Questions": "How do you handle competing priorities?"}, {"date": "31 Jan 2022", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "It was 2 rounds of interview. The first interview with the hiring manager took about 6 minutes. Then I received an invitation for onsite interview which was odd but  I accepted.  The whole interview process was ok but the problem was that they never contacted me after the interview. I followed up 3 times with the HR and they said they are going to contact me once the hiring team make a decision. After 2 months, I reached out to the hiring manager and he didn't responded me either. It was very rude and unprofessional that you ask someone to travel 9 hours, arrives at 10 PM to the hotel, interview at 9 AM,  took him to the airport 7 hours prior to departure , and fly back  for 10 hours and in the end the HR and the hiring manager even don't bother to send an email!!!", "Interview Questions": "I presented my project and they asked some questions about my projects. "}, {"date": "11 Feb 2022", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "Process was easy.  It took less than an hour. I was called back the same day and offered the position.  Managers were nice and friendly. It was a good experience.", "Interview Questions": "How is your work ethic?"}, {"date": "11 Feb 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "It was fast and the people interviewing were so kind and welcoming. The entire process was maybe a week and the recruiters were really helpful when it came to finding me options that would be a good fit.", "Interview Questions": "Something relating to diversity and inclusion in the workplace"}, {"date": "8 Feb 2022", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Received an email to schedule an interview for the first round and then a phone call for the second round of interviews. The first interview was about 15 minutes long and the second about 30 minutes.", "Interview Questions": "Why do you want to work at CHLA?"}, {"date": "15 Mar 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Feb 2022", "Interview Descriptions": "Applied on website and heard back from the hiring supervisor about 2 weeks later to schedule an interview. Afterwards, there was a reference check and the final round of interviews. The interviewers were very enthusiastic and friendly, overall easy interview with a couple of scenario-based questions.", "Interview Questions": "Tell me about yourself, what did you do at your previous role, tell me about a time you made a mistake, difficult patient/situation, etc."}, {"date": "8 Feb 2022", "title": "Videographer/Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Jan 2022", "Interview Descriptions": "30-60 minute pre-interview with Hiring Manager. 30-60 minute interview with Department Leader. Both virtual. Both pleasant, informative, and thoughtful. I felt like they were asking appropriate questions and answered my questions as well.", "Interview Questions": "Tell me about a time when you had to motivate a stakeholder who had lost interest."}, {"date": "4 Dec 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Hiring Manager reached out to me directly through email to schedule an interview with no specified specific timeframe (red flag!) typically apparent in interview invitations. Interview was done over 3 weeks after initially applying.\r\n\r\nDuring interview, hiring manager seemed insecure and I detected passive aggressiveness as well as some anger underneath.\r\n\r\nLooking back, I am glad I got rejected by this hiring manager alone,  as there was so much unprofessionalism being manifested (already!) in the interview. \r\nOne can easily detect that the hiring manager only has worked at CHLA their entire life/career and unaware of how poor quality the interview was carried out.  I was not able to proceed forward because of the hiring manager’s insecurity.\r\n\r\n(The hiring manager destroyed their own reputation/social image before, during, and after the interview. )", "Interview Questions": "Wanted to know about what I have done  (work summary)"}, {"date": "9 Jan 2022", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Dec 2021", "Interview Descriptions": "3 Interviews- \r\n1st interview was a speed interview (15 mins) where they get to know you. \r\n2nd was 30 mins and discussed more in depth questions and clinical experience during COVID\r\nWaiting on 3rd interview", "Interview Questions": "Why did you want to work at CHLA"}], [{"date": "17 Dec 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Dec 2021", "Interview Descriptions": "An email requesting an interview. Online interview asking basic questions about my background and interest in the position with two supervisors. 2nd in-person interview with the PI plus lab tour. Over all the first online interview was a little less than an hour. The second in person plus lab tour took about 1 hour and 20 min.", "Interview Questions": "Tell me about yourself. Why this position? Career goals?"}, {"date": "1 Nov 2021", "title": "Nutritionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Very efficient and friendly. Manager is responsive and receptive to questions. The process was quick with flexible scheduling. Able to contact via email and/or phone. \r\n\r\nHas a set of interview questions to make interviewing candidate more objective. Has multiple interviewer to allow for different point of views for the candidate.", "Interview Questions": "Describe a conflict you have with a superior and how you dealt with it."}, {"date": "18 Dec 2021", "title": "PICU RN Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Nov 2021", "Interview Descriptions": "It was a three-step process interview,  which was very professional and well organized. The interview was smooth and focused on the specific unit. After each interview, I received an answer in a timely manner.", "Interview Questions": "Describe yourself in 3 words "}, {"date": "24 Sept 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "I applied online and received an email to schedule and interview about 2-3 weeks later. Had 3 rounds of interviews. 2nd round was a panel interview. Was tasked with preparing a presentation for the panel interview. Everyone was incredibly pleasant.", "Interview Questions": "Scenario based questions. \"Explain your process for completing XYZ tasks\" \"How do you work through issues arising during a project?\""}, {"date": "20 Jul 2021", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "I spoke with a total of 6 people during the interview process and every single one was like having a normal conversation! It was a great introduction to the team I am currently working with.", "Interview Questions": "What drew you to this position?"}, {"date": "8 Jul 2021", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Jun 2021", "Interview Descriptions": "It was honestly the greatest process I have ever been through. I was interviewing at another company and it took them 2+ months to get back to me where as here, they called and had all my interviews scheduled and wrapped within a week. The efficiency was so refreshing.", "Interview Questions": "\"How do you handle competing priorities?\" "}, {"date": "25 May 2021", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Friendly staff, professional interview process, was pre-screened by Human Resources recruiter on the phone, then interviewed with the managers on the phone as I was out of state and then and couple weeks later, went in for an interview with a manager a three peers.", "Interview Questions": "Reviewing standard interview questions prepared me for the interview. "}, {"date": "3 Nov 2021", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Mar 2021", "Interview Descriptions": "The process was two rounds. Both rounds of interviews followed more of a causal and conversational-style format. They did require resume and cover letter, and the interview asked about resume experiences.", "Interview Questions": "Why are you a good fit for the role"}, {"date": "31 Jan 2021", "title": "ER Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Four person panel with various of questions about yourself and your previous experiences. They want to know if you could handle stress situations well when it comes to children. They also want to know if you could handle distraught parents well.", "Interview Questions": "What's the sickest child I've seen?"}, {"date": "27 Feb 2021", "title": "Motion Lab Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles in Feb 2021", "Interview Descriptions": "Had a phone interview with a recruiter, have not heard back on if I have been moved on to the next steps.  Will hear back in one to two weeks.", "Interview Questions": "Tell me about yourself\nDo you have clinical experience \nWhat is more important to you the job or the location"}], [{"date": "1 Feb 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "During the interview they asked questions regarding what you would bring to the team and how you handled difficult situations  and situational based questions about providing care and how you would prioritize care.", "Interview Questions": "Tell me what you would bring to our team of coworkers."}, {"date": "7 Jan 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "I asked an employee to get me in contact with the internship director and I filled out a few forms for them. It was very easy and they were extremely nice to work with my schedule", "Interview Questions": "I reached out to a current employee and they began the process"}, {"date": "27 Feb 2023", "title": "Nursing Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's Hospital Los Angeles in Jan 2021", "Interview Descriptions": "30 min interview online with the charge nurse and unit manager. Interviewers were very open and enjoyed talking. It was quick to the point and power through questions. One of the most relaxed interview environment.", "Interview Questions": "Tell me about yourself. Why do you want to work here?"}, {"date": "12 Mar 2021", "title": "Care Partner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Dec 2020", "Interview Descriptions": "Conversation process with the unit manager to get to know my experience and personality. The interview was about 45 minutes long and provided me the opportunity to ask all questions I had.", "Interview Questions": "Describe a time you have had to be creative in your medical approach to a difficult situation. "}, {"date": "14 Dec 2022", "title": "Clinical Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Children's Hospital Los Angeles in Nov 2020", "Interview Descriptions": "The interview process was straightforward. I got an interview invite about a week after I sent my application. The lab manager reached out to me to schedule a virtual interview (due to COVID). The lab team was there to ask me questions, and then a week after that, the manager scheduled me for an in-person interview. The whole experience was very personable and not so intimidating.", "Interview Questions": "1. How do you handle stress? 2. What are your past experiences working in the lab? 3. How do you handle conflict with co-workers? It was a mix of scenario-based and traditional 1:1 interview questions"}, {"date": "29 Aug 2020", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "This was an online group via zoom interview that lasted about an hour and thirty minutes. The same questions were asked to each candidate and they took turns answering.", "Interview Questions": "what do you hope to gain?"}, {"date": "10 Jul 2020", "title": "Operations Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "After several phone interviews, I was granted an in-person interview with the department.\r\n\r\nAt the start of my in-person interview with the hiring manager and HR rep, I was told the job we would be discussing was not the job to which I applied, but it was similar.   (yellow flag #1)\r\n\r\nNext, I met with the head of department for an engaging discussion - resulting in him extending our allotted time, which I saw as a good sign.   However, I also learned in this meeting that \"hiring someone is hard because the team is a tight-knit group and they are fussy with whom they work.\"     (yellow flag #2)\r\n\r\nAfterwards, I met for a group interview with the team who's leader said he hadn't reviewed my resume.   (yellow flag #3)\r\n\r\nLast, I met with the person I would be replacing (who was leaving due to another job offer) who advised he didn't agree with the description of the position as advertised.  (yellow flag #4)\r\n\r\nNonetheless, I maintained a pleasant nature throughout, provided thoughtful answers, showed my research of the organization and, afterwards, followed up with thank you notes.\r\n\r\nI never heard back from anyone and sent follow up emails.   A while later, the hiring manager responded that the team would be discussing the candidates the following week, and that he would get back to me.\r\n\r\nWeeks later, I still received no contact but saw the position was re-posted online.    I found it strange to have been ghosted, particularly after participating for a couple of hours of interviews.      \r\n\r\nIt's unfortunate, but with warning signs appearing throughout the hiring process, I feel like I dodged a bullet.", "Interview Questions": "The questions were standard open-ended (tell us about yourself, etc.)\r\n"}, {"date": "27 May 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Hospital Los Angeles in May 2020", "Interview Descriptions": "Very easy process! Started with an online video prescreen with the application. After receiving an email about an online video interview with the unit managers and 5 nurses who worked on the unit as well. Heard back a week later.", "Interview Questions": "Tell me about a time you advocated for a patient."}, {"date": "27 Mar 2020", "title": "Cardiac Sonographer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Hospital Los Angeles in Mar 2020", "Interview Descriptions": "First step was just a phone call for a quick phone screening and then if they like you and find you qualified you move on to a more comprehensive interview. They present all the applicants that they like to a panel before deciding who to continue with for the next round of interviews.", "Interview Questions": "How much experience working with children do you have?"}], [{"date": "26 Feb 2020", "title": "Emergency Room RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "The staff was on time and polite. They took their time in knowing me and you can see their true intentions in wanting nurses in their team. Thank overall s great and positive experience. They were thorough in why they stay at CHLA after many years.", "Interview Questions": "Situational "}, {"date": "23 Jan 2020", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "Seems like they only hire friends of friends. Impossible to get to interview based by merit however once your in its a fast process. They reimbursed for parking too overall it was not great not terrible", "Interview Questions": "Ability to work with different ages gender religions ect"}, {"date": "13 Jan 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles in Jan 2020", "Interview Descriptions": "A 30 minute phone interview leading to an in-person interview .  If it goes well, you share your references with HR, who then  contacts your references.  You receive an offer within 3 -5 days after submitting your references.", "Interview Questions": "How does your work experience apply to the position.  How comfortable you  working with youth."}, {"date": "2 Oct 2019", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "30 minutes long, several questions, asked me if I had any questions. I was offered a position far below the average rate for this area and far below what I was making at my current job for the same type of work. With the cost of living in LA, paying off student loans and their requiring a degree, I was shocked and disappointed because I believe in the mission of CHLA and really wanted to work there. After reading other reviews on Glassdoor, I had second thoughts. I have over 20 years experience in this field, and it was like they were asking me to start over. I negotiated a higher rate, but it still wasn't what I could get elsewhere. I was then offered a job at another institution doing pretty much the same thing for about 3 times that salary. Its unfortunate, because I love Children's Hospital and think the doctors and nurses are great, and it would have been a great commute, but from my experience and the other comments I've read, they really need to look at their salary structure, especially if they're trying to find quality people to work with such a precious population.", "Interview Questions": "Do you have IRB experience ?"}, {"date": "18 Sept 2019", "title": "Junior Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Los Angeles (Glendale, CA) in Aug 2019", "Interview Descriptions": "First round was a standard 15 minute video interview which went well. On-site interview was terrible. Started with a presentation of a previous project but the interviewers were being completely rude from the very beginning by being on their phones and seeming like they rather be anywhere else which made me question why I was invited there in the first place. The rest of the interview consisted of conversations with two members of the data science team and a clinician. I was told to expect an email in about 2-3 weeks but it never came. Very rude, disrespectful, and poorly handled.", "Interview Questions": "Present a project and be prepared for questions on the project"}, {"date": "14 Aug 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Jul 2019", "Interview Descriptions": "One phone, two group interviews. Poor communication on their end. Forgot to tell me they downgraded the position ultimately. HR made informal offer before 2nd interview, but then rejected me for overqualified. Interviewers are nice.", "Interview Questions": "What experience do you have working in an interdisciplinary team? \r\nWhere do you see yourself in the future?\r\nWhat software do you have experience with?"}, {"date": "24 Jun 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Had a great time talking to the interviewers. They really wanted to know about who you are as a person and how you are or aren't qualified for the position you are interviewing for.", "Interview Questions": "More in depth questions about specific experiences."}, {"date": "2 Jul 2019", "title": "Family Nurse Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Jun 2019", "Interview Descriptions": "Interview with 5-7 Nurse Practitioners asking you scenario questions. They would ask you your experience and \"what would you do\" scenarios. They go over in some detail your experience as a registered nurse. They are quite prepared with the resume you send them on your application. The interview was about 30-45 minutes long.", "Interview Questions": "How would you get information if you aren't aware of a certain situation or diagnosis?"}, {"date": "4 Jan 2021", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Jun 2019", "Interview Descriptions": "I interviewed for a summer research position at the Peterson Lab at CHLA. I was promptly greeted and I had my interview with Dr. Peterson. I appreciated that he was friendly and was willing to answer my questions about the position. I also appreciated that he introduced me to other members of the staff in the lab so I could get a feel for what everyone in the lab did.", "Interview Questions": "I was asked about my career goals and what I hoped to gain from the position, as well as my family and my background."}, {"date": "27 May 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "First interview was with recruiting manager. 15 minute interview that could have been done over the phone but they wanted you to come in. From then on, you have an interview with the principal investigator that’s in charge of the lab that you will be working for.", "Interview Questions": "What is your background?"}], [{"date": "9 May 2019", "title": "Human Resources Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "During my phone interview the recruiter mentioned that the job description was incorrect and needed to be updated. Overall, the interview went well and they wanted to schedule me for an in person interview. After providing me dates and times the recruiter abruptly said they have to get back to me. It felt like a curtesy interview and this recruiter showed zero respect to me. It went from wanting to schedule an interview for me to nothing at all. I will never apply to this company again. Horrible experience and no respect shown.", "Interview Questions": "Tell me about your background"}, {"date": "6 May 2019", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "Applied and got a call the next day and had an interview in 2 days. The day after my interview I received a call that I was hired. Overall it was a great experience the managers were extremely friendly.", "Interview Questions": "Why CHLA"}, {"date": "14 Nov 2019", "title": "Nurse Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Apr 2019", "Interview Descriptions": "The interview was fairly casual. It was on the unit with multiple people interviewing from the hiring committee. It ran about 40 minutes in time and they asked questions from a few pages of questions.", "Interview Questions": "What is a mistake you have made and what did you learn from it. "}, {"date": "11 Mar 2019", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "3 interviews including one panel. Was told that every person on the HR team had to agree to hire me, a group decision. I was not asked, I was told that I was involuntarily terminated from a former employer but was not. I was harassed by that one interviewer in the panel. That same interviewer was mean and harassing during the panel interview.", "Interview Questions": "What are your weaknesses?"}, {"date": "9 Sept 2019", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Mar 2019", "Interview Descriptions": "Intense lots of people in one small room  doing multiple interviews at one time. There were 5 stations set up for interviews with at least 3 people at each one.", "Interview Questions": "Lots of questions related to Respiratory "}, {"date": "5 Feb 2021", "title": "Data Science Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Mar 2019", "Interview Descriptions": "Must give a presentation on prior research, and meet with each of the team members. For an intern position they don't grill you with questions, they want to see how good you are at learning and following instruction.", "Interview Questions": "If you had an issue with you project what did you do?"}, {"date": "10 Mar 2020", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Hospital Los Angeles in Feb 2019", "Interview Descriptions": "Contacted me by email for interview.  Gave me access to an video interview interface that allowed me to record my questions.  Had to record all questions at once, but I could re-record if needed.", "Interview Questions": "What interested you about this position?"}, {"date": "8 Apr 2019", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Feb 2019", "Interview Descriptions": "It was a quick meeting with the managers of the unit, they were so kind and easy to talk to. They asked a few different questions pertaining to the job responsibilities.", "Interview Questions": "Why do you want to work at CHLA? "}, {"date": "11 Jan 2019", "title": "Clinical Research Coordinator II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Met with several faculty members for 1 on 1 interviews with each. Interviews were scheduled for one day and the whole process took several hours to accommodate each of the faculty members schedules. Lots of waiting in-between interviews.", "Interview Questions": "-Why do you want this position?\r\n-Walk me through your experiences\r\n-What are your strengths/weaknesses?\r\n-What are your plans for the future?"}, {"date": "1 Nov 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Speed interview was very quick but everyone was really nice. They have you talk with an educator while you wait you can answer your questions. All behavioral questions but they may base some of their questions off of your answers too.", "Interview Questions": "How would you decide an offer between your top 3 hospitals"}], [{"date": "17 Oct 2018", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Applied online for Versant Pediatric Residency and completed application packet for upload, received email for screen interview,  interview was 15 minutes and ended on the dot, will hear in 2 weeks", "Interview Questions": "Tell me about yourself"}, {"date": "7 Nov 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Oct 2018", "Interview Descriptions": "It took 6 weeks after applying to receive email with job interview opportunity. First interview is a speed interview that took about 20 minutes. Standard interview questions were asked. Pretty nervous at first but they are always very patient and understanding", "Interview Questions": "Why did you choose CHLA? "}, {"date": "14 Sept 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Ask the general interview questions and research experiences and introduced me about what's the job like and showed me around the working area. \r\nThe interview in 1:1 and interviewer is very friendly.", "Interview Questions": "like tell me about yourself. "}, {"date": "9 Sept 2018", "title": "NNP Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "Overall it felt very unorganized.  There were a lot of red flags. Some of the things that gave me a bad impression: the interview start time rescheduled the morning of an hour before we were supposed to begin, interview schedule emailed with another candidate's name listed, paid for my own lunch and ate alone, and none of the NPs work full-time.", "Interview Questions": "Do you like caring for a heavy surgical patient population?"}, {"date": "2 Sept 2018", "title": "Registered Nurse - Versant Fellowship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "Your first application to the Versant program is very simple, you upload your resume and enter your education and experience. After this, they decide whether they want to interview you or not. I have not received a call after about a week so I called talent acquisition and that is when I found out I was eligible for the first interview. Your first interview will be with multiple managers. It might take up to a month before you hear back for a 2nd interview.", "Interview Questions": "Tell us what a typical shift is like where you come from?"}, {"date": "23 Jul 2018", "title": "Research Biorepository Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "I was first interviewed by the Doctor in charge of the lab and we talked about the research that is being done. I was then introduced to the rest of the members of the lab and they asked me a few questions.", "Interview Questions": "Can you go over your research experience?"}, {"date": "12 Jun 2018", "title": "CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "Short conversation with the charge nurse and department head.  Simple questions about work history and education.  The interview lasted approximately twenty minutes.  They asked for a copy of my resume and for references.", "Interview Questions": "Why do you want to work at Children’s Hospital? "}, {"date": "9 Jun 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Internal Interview process. After reviewing my resume, program director called to my previous directors and brief interview by asking my previous job description and responsibilities. Introduction and discussion with other lab members. Final decision was made promptly.", "Interview Questions": "Tell me about your job description and responsibilities?"}, {"date": "21 Jun 2018", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Jun 2018", "Interview Descriptions": "The process was great. This is my 3rd interview with this organization. In all honestly, I feel like they already hire people in their minds but continue to interview other people just to say they did it. It is tough because you build great interview rapport and then not even 24 hours, you get an email notification say \"We hired someone for this position already\"... I guess it's about who you know and not what you know at CHLA.", "Interview Questions": "How do you prioritize your work load?"}, {"date": "31 Jul 2019", "title": "Ultrasound Technologist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Children's Hospital Los Angeles in Jun 2018", "Interview Descriptions": "I was originally approached on LinkedIn by a recruiter asking if I’d be interested in a position they had to offer. I showed interest and provided the requested information and then the recruiter went silent and completely ignored my messages for several weeks until she called to offer an on site interview. \n\nThe interview was fairly standard and friendly. I enjoyed meeting the staff, the supervisors, and seeing the facility. It appeared they had good intentions and the right attitude about a team and supportive environment.\n\nThe interview was with the ultrasound lead and the radiology supervisor. Both were very pleasant and kind to speak with.\n\nAfter this portion I completed a scan interview. A complete abdomen on a staff member that wasn’t a tech. It was just me and the employee in the room, very little pressure.\n\nA week later I got a request from the original recruiter to fill out some additional application information. Then thanked me when I submitted. The questions were about background info and drug test submissions, so I asked why these extra steps were needed. That’s then the recruiter informed me they were “taking the next step”. It sounded like they were offering me the job, but I :8didn’t receive any type of correspondence saying this. The recruiter again came off as unprofessional and unseasoned.  I patiently awaited to see what was to follow.\n\nThe following week I received a phone call with a salary offer. When I heard it my jaw literally dropped. I had never expected an offer that low. Not for someone with the experience or level of training I had in pediatric ultrasound. It was without a doubt one of the most insulting points in my career. I made more money as a new grad in a 35 bed hospital. $38.00 an hour for 4 years experience and the best training in the industry.\n\nIn the Hollywood area  this isn’t a wage someone can comfortable live on. I was shocked and completely disappointed that a facility I was always inclined to admire and follow had such poor taste and effort in attracting and retaining top talent. \n\nEven without the experience or the training, you’re better than $38 an hour. Look elsewhere to further your ultrasound career.", "Interview Questions": "Why do you like pediatrics?"}], [{"date": "27 Apr 2018", "title": "Intern/Associate Pharmacist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Very short and concise; they were very conversational and willing to get to know you. It was pretty easy going and not tok serious. It was a great experience.", "Interview Questions": "Tell me about yourself; what are your strenghts and weaknesses? "}, {"date": "23 Apr 2018", "title": "Care Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "I interviewed with the nurse manager of the unit and one of the charge nurses. It was thirty minutes long. They were both really pleasant and asked questions regarding personality and situational.", "Interview Questions": "Why CHLA?"}, {"date": "11 Aug 2018", "title": "Senior Director, Business Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Apr 2018", "Interview Descriptions": "I interviewed with clinicians, marketing team members, international team members, contacting members, the Chief Strategy Officer and other person involved with increasing national and international referrals to CHLA regarding my experience in business development and developing long-term sustainable relationships.", "Interview Questions": "Why do you believe you are qualified for this postion"}, {"date": "27 Mar 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Mar 2018", "Interview Descriptions": "Great! I really enjoyed the interview. They seemed quite genuine in getting to know you and what you could bring to the team.  I was actually very excited to speak with them again.", "Interview Questions": "Tell us about your past experiences,\r\nTell us about your "}, {"date": "23 Apr 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Hospital Los Angeles in Feb 2018", "Interview Descriptions": "First interview are with the managers. They ask basic scenario/behavioral questions and if you pass the first interview, you will have a second interview with staff. My second interview had 5 nurses interviewing me. They asked me a few questions and also allowed me to ask them questions about the unit, the unit’s culture, the managers", "Interview Questions": "Tell us about a conflict you’ve had with a coworker and how you dealt with it"}, {"date": "17 Aug 2018", "title": "Care Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Feb 2018", "Interview Descriptions": "I met with the nurse manager on the unit and another woman that also worked on the unit. It was fairly casual and they didn't ask a lot of question like I thought they would. The interview only lasted about 10 minutes. I'm not sure if they were looking for me to try and keep the interview going or what.", "Interview Questions": "Tell us about yourself, what do you know about the care partner position, do you have any questions."}, {"date": "30 Aug 2018", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Children's Hospital Los Angeles in Jan 2018", "Interview Descriptions": "Very bad experience. Spent hours making an effort to fit the hiring managers schedule, but he showed up late and was unprofessional. Recruiter was too busy or lazy to communicate throughout the process. Worst interview experience in my entire professional life.", "Interview Questions": "They legit asked me “what would a penguin say if he walked in the room with a sombrero?”"}, {"date": "15 Dec 2017", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Oct 2017", "Interview Descriptions": "First interview was 10 minutes with two nurse managers and one bedside nurse that was focused on getting to know the interviewees.  Second interview was 1 hour with the same interviewers as the previous one that focused on get to know you and behavioral questions.", "Interview Questions": "What do you know about our residency program?"}, {"date": "16 Oct 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Hospital Los Angeles (East Los Angeles, CA) in Oct 2017", "Interview Descriptions": "I received a call over the phone from the hiring manager on Friday, and had an interview on Monday for an in-person interview.  It was definitely more of a conversation.", "Interview Questions": "What were some of your challenges in your last role? "}, {"date": "21 Sept 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "The interview process was very robotic. Manager had questions prepare however seemed to be more concerned with about other things than the interview as she was on her cell phone the entire time.", "Interview Questions": "I was asked where i lived and about past experience. "}], [{"date": "8 Sept 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "10 minute phone interview. The two research coordinators on the phone explained the day to day functions of the job. They explained that there is room to grow in the company and that it was entry level, but clearly they wanted someone with experience.", "Interview Questions": "What is your goal career wise?"}, {"date": "7 Oct 2017", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Los Angeles (Westminster, CA) in Sept 2017", "Interview Descriptions": "Great office culture and place to work if you love helping children and being around like minded professionals who are passionate about pediatric care.  Initial interview was splendid, management is great at CHLA.", "Interview Questions": "Why CHLA?"}, {"date": "18 Aug 2017", "title": "HVAC Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Aug 2017", "Interview Descriptions": "HR scheduled appointment with Facilities Director for interview.  A few days later I met with him.  Very welcoming man, very friendly.  I was expecting something different before I walked in, but he made me feel very comfortable and at home and I am very glad I was able to meet him.", "Interview Questions": "Why did you choose CHLA?"}, {"date": "24 Aug 2017", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Jul 2017", "Interview Descriptions": "The interview was scheduled very quickly, but luckily I was able to accommodate my schedule. My interviewers were incredibly nice and friendly, and the interview was very easygoing and informal.", "Interview Questions": "How will you apply your previous experience to this job? "}, {"date": "24 Nov 2017", "title": "Respiratory Care Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Jul 2017", "Interview Descriptions": "Consists of three parts: Online application, in-person panel interview, and secondary management review if called back. The first interview require a knowledge assessment on basic respiratory function and equations. The first interview involved a panel of three staff members asking various respiratory and situational questions. The second interview was done with management and they asked again ethical questions, situational, and clinical based questions.", "Interview Questions": "Why do you want to work at Children's Hospital Los Angeles?"}, {"date": "10 Jun 2017", "title": "Senior Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Jun 2017", "Interview Descriptions": "I submitted my application online through the CHLA website and got a call back to schedule my interview, which took about twenty to thirty minutes and was with the three individuals who works in the department.", "Interview Questions": "Tell me something about yourself"}, {"date": "24 Apr 2017", "title": "Care Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles in Apr 2017", "Interview Descriptions": "Applied through employee referral. Got a call from recruiter and scheduled interview 2 weeks out. Met with a panel of 3 including department manager. Pretty simple interview about 20 mins long.", "Interview Questions": "Describe a problem you had with a coworker and how did you handle it? "}, {"date": "22 Nov 2016", "title": "RN New Grad Versant Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Oct 2016", "Interview Descriptions": "Short 15 minute screening interview with 2 people. Asked expected questions. If chosen a 2nd hour interview is to be scheduled. The 2nd interview process would involve 2 administrators and 3 staff RN for the unit you are applying for.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "31 Aug 2016", "title": "RN II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at Children's Hospital Los Angeles in Aug 2016", "Interview Descriptions": "1st interview was with the manager for the unit. About an hour long. Basic questions regarding my resume, experience, and desire for the position. Casual interview. Got request for 2nd interview. Got tour of unit.", "Interview Questions": "Tell me about a time you had a conflict with a coworker or patient at your previous job."}, {"date": "29 Jan 2020", "title": "RN II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Jul 2016", "Interview Descriptions": "Group interview with managers and peers.  First part of interview was with the managers, they described the job details and work environment.  Second part of interview was with a peer panel where they asked 4-6 questions and scenarios.", "Interview Questions": "Describe a difficult situation you were put in and how you managed it?"}], [{"date": "3 Jun 2016", "title": "Patient Care Service Aides Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Received an email for interview, met with recruiter & the director of the unit, recruiter called and offered me the job & I went in & did health assessment, drug test, & background check. It was a pretty quick process.", "Interview Questions": "Just general questions about the work you've done, how are you as asset to our company,  how do you feel about children & dealing with the pass of one and etc."}, {"date": "27 Jun 2016", "title": "Versant New Graduate Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in May 2016", "Interview Descriptions": "2 part interview process: 1st part was a 15 minute speed interview with 2 managers from the NICCU.  They asked basic interview questions regarding personality, with one clinical care question.  2nd part was an hour long interview on the unit with the same 2 managers and a tour of the unit.  Questions were more about why I wanted to work at this hospital and in this unit.  They gave an overview of the program and verified my commitment to work at CHLA for 2 years after the program.  I did not get an offer.", "Interview Questions": "Why do you want to work in this specific NICCU?"}, {"date": "15 Apr 2016", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Children's Hospital Los Angeles in Apr 2016", "Interview Descriptions": "I knew I did not have enough experience for this position, so I already expected to be rejected. It was good to get the interview experience and knew what people look for for this position though. Interviewer was the a doctor (principle investigator) that works in the lab. He started with asking me to talk about myself. He then asked what other experiences I have that show I am a good fit for this position. He was looking for previous experience with contacting clients/patients, but I did not have that experience so he explained to me he won't be able to hire me. He also encouraged me to talk to the PI of my lab for more opportunities other than sitting in the office working with data. He also told me that I'm a good student because he saw that I have good grades in all my classes. This made me feel a bit better.", "Interview Questions": "What will your lab's principle investigator say about you?"}, {"date": "20 May 2016", "title": "Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Apr 2016", "Interview Descriptions": "Skype Speed Interview - fairly easy, typical interview questions. Process was over Skype and there were three different managers for the speed interview. Speed interview seemed a bit rushed and they didn't seem too engaged to what I had to say. It was fairly quick, however, and the interview took no more than 20 minutes", "Interview Questions": "Briefly describe a time you made a mistake"}, {"date": "16 Oct 2016", "title": "Biomedical Research Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Apr 2016", "Interview Descriptions": "we were asked about our backgrounds from grad and under grad and what field we would to work in while the whole panel was sitting in front of us and we were 3/4 of us answering them", "Interview Questions": "what field would you like to work in?"}, {"date": "16 Mar 2016", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Mar 2016", "Interview Descriptions": "I had three interviews. The first was with the HR resource and then with the lab manager and another staff member. They were polite and direct to the point. I didn't feel like my time was wasted. They made sure I was well matched with the position I was interviewing for. I spoke with HR for about 15 minutes and then the manager about 30 minutes. I was then scheduled for a face to face that was scheduled for an hour and a half that went to four hours. It was a great day and I felt at home. There was a miscommunication between HR, my recruiter and the management but they were very amenable. They were at other locations and came to meet me. I was then taken to HR and filled out the first paperwork. I was called and scheduled for a third more technical interview and that was very informative and straight forward. I was given an offer within two business days. I counter offered and that was accepted within two business days.", "Interview Questions": "Too many questions to list but HR wanted to know firstly that I knew the role I was applying for and the range of salary."}, {"date": "15 Feb 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Applied, contacted later in the week. Scheduled interview for the next day, interviewed with 4 representatives that we clearly dedicated to the company.  Management style represents one that is focused on choosing the right people for the job. Very relaxed yet engaging interview.", "Interview Questions": "Personal\nSituational\nLong term/Short term goals\nQuestions about my education"}, {"date": "23 Oct 2016", "title": "Care Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Jan 2016", "Interview Descriptions": "Interviewed with 3 managers all very kind ladies, no offer, in total about 20 minutes or so mostly talk about yourself and what you have to offer and your experience.", "Interview Questions": "Tell us about yourself?"}, {"date": "13 Nov 2017", "title": "Emergency Department RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Dec 2015", "Interview Descriptions": "Two separate Interviews, one of which was a a quick 10-20min large group followed by a personal 1-2hr interview with department managers. After online application, followed by a personality quiz, HR calls to let you know about the interview. Best to bring at least one complete portfolio and at least 3 resumes.", "Interview Questions": "Typical interview question related to healthcare: Why Emergency? Why Pediatrics? Why CHLA? Tell us about a conflict you had and how did you resolve it? Second Interview included slight situational questions including : You have a patient who comes in with a complaint of a closed head injury, tell me how you would care the child? "}, {"date": "21 Sept 2015", "title": "Research Observer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "I received a phone call to interview with two labs at CHLA. I interviewed with the first group, then the second group. First, I took a brief quiz on general biology/chemistry, then was led to interview with both groups. Each group asked me general questions about my background, where I saw myself in the next couple of years, and what sort of lab experience I had.", "Interview Questions": "Talk about an instance when you had to work with difficult people."}], [{"date": "5 May 2016", "title": "Social Work Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Jun 2015", "Interview Descriptions": "There was a supervisor and two employees at the interview asking a lot of detailed questions.  They really wanted to find out if the intern is a good match for the culture of the workplace and willing to devote extra time to doing the job right.", "Interview Questions": "How will you balance your school work and work requirements without getting burnt out or overwhelmed?"}, {"date": "28 May 2015", "title": "Systems Training Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Applied on-line.  4 months went by with no follow up.  The fact that I listed current employees as references and did not receive any type of follow up over 4 months does raise some concerns about the culture of CHLA.  Also the job application took over an hour to fill out which seems a bit excessive considering that I had no idea how much the job paid or whether I was really a fit for the organization at all.", "Interview Questions": "Previous work experience based questions"}, {"date": "17 Sept 2015", "title": "RN New Grad Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in May 2015", "Interview Descriptions": "it was a two step process. It was with the PICU the first was with the managers and if you made it through you interview with 5 RN's on the staff. Basic behavioral questions", "Interview Questions": "Tell me a time when you were praised for doing a good job?\r\nTell me a time when you were in a difficult situation and how did you deal with it?"}, {"date": "17 May 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in May 2015", "Interview Descriptions": "First was a basic phone interview. Asked about what experience I had, told me more about the work they did, and my availabilities. Then, was offered an in person interview. The in person interview was very conversational, asked about my experiences and had my elaborate on my past research and leadership experience. There were no hard questions asked. Seemed more a screen for personality/fit.", "Interview Questions": "What experience do you have in research?"}, {"date": "19 Jul 2019", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Apr 2015", "Interview Descriptions": "I had a phone interview and then an in-person interview two weeks later. I met with two individuals one who would eventually be my supervisor. They each asked a group of preset questions. I also had the chance to share my previous work history with them.", "Interview Questions": "Why would you like to work here?"}, {"date": "16 Mar 2015", "title": "Research Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Mar 2015", "Interview Descriptions": "about 17 mins three people asked me a lot of questions. About my analysis skill, hobby, kind of work environment I prefer, my strength, what question I have as so on. People are pretty nice ad we have a wonderful conversation. We used skype for the interview, sometimes because of the unstable internet, sometimes I cannot hear some words clearly. You can require them to repeat it.", "Interview Questions": "why you are interested in this program?"}, {"date": "7 Apr 2015", "title": "Patient Experience Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Feb 2015", "Interview Descriptions": "The interview was very conversational. I felt very comfortable and welcomed. I first went through two phone interviews, one with a recruiter and the other with the hiring manager. I then went through a in-person interview with recruiter, hiring manager and then the director. The overall experience was good and I felt I was treated with respect and the hiring process was fair.", "Interview Questions": "Usual questions to see if your a fit for the organizational culture, then task specific questions like if you were in this situation, how would you handle it?"}, {"date": "1 Nov 2014", "title": "RN New Grad Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "I applied online. I was sent an email for with attachments to print out and fill out and turn/mail in to the HR department. I got a call for a speed/screen interview. The interview is timed at ten minutes and is over on the dot. The told me I will hear back from them if selected for another interview.", "Interview Questions": "Because this was a screening, they were all expected questions. I did not receive ant clinical questions."}, {"date": "28 Nov 2014", "title": "Research Associate I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Sept 2014", "Interview Descriptions": "I submitted an application at CHLA's website and followed up with an email to the PI.  He scheduled a phone interview and then an in-person interview.  The PI was extremely friendly throughout.\r\n\r\nI was not offered the job.  The PI explained that out of 25 applications, he'd picked two people to interview.  Both of us had seemed fully qualified and good-natured, so it'd been a coin toss.  He recalled that I'd mentioned that I was considering an offer from another lab, so he figured it wouldn't affect me.", "Interview Questions": "It was all very conversational, really.  Nothing harder than \"do you prefer collaborative or individual work?\""}, {"date": "17 Jul 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA)", "Interview Descriptions": "If you are a new grad RN, you will be hired into the Versant RN Residency program. A new grad includes those with less than 1.5 years of experience. The new grad program is an intense 22 week program that combines classroom lectures, skills labs, unit based classes and of course clinical hours on the unit you are hired onto. During the program you will be precepted by senior nurses on the unit in order to fulfill a number of competencies, you will also be completing a Evidence Base Project and poster which will be presented at the end of the residency, so brush up on those reserach skills! I would definitely apply for a PCSA (Patient Care Service Aide) position on the unit you are interested after your peds rotation in nursing school. Units are now looking to hire from within, by transitioning PCSAs in nursing school into the residency. Some questions in the interview: Why CHLA? Why ____ (the unit you applied for)? What are your 1 year and 5 year goals? Have you dealt with a difficult situation with coworkers or classmates, how did you deal with it? What are your professional goals? How do your peers see you, how would they describe you in three words? How do your own values align with those of CHLA?", "Interview Questions": "All questions were pretty standard. They do however, ask situational questions regarding meds (Ex. cardiac meds on the cardiac units)."}], [{"date": "31 May 2014", "title": "RN New Grad Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Prescreening interview process was very short and to the point. Asked very simple questions. Was with the unit managers for the unit you were applying for. They let you know if you had another interview very quickly. The questions were not too difficult, but not are all expected questions.", "Interview Questions": "Asked very unexpected questions"}, {"date": "1 Sept 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Jun 2014", "Interview Descriptions": "depends on the team, it can range from team fit interview only to a very technical interview. It is a one day, they try to make it more then one interview but it is really not.  They did a lunch, team fit is important, and presentation of past work.", "Interview Questions": "reverse a linked list"}, {"date": "20 Aug 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in May 2014", "Interview Descriptions": "Very relaxed, standard interview. Easy questions to answer. They brought me in and it was hard to find the office, but the interview was held in a conference room and there were two interviewers, one after the other. This is common and CHLA.", "Interview Questions": "Where do you see yourself in 10 years?\r\nIf you could do any job right now, what would it be? \r\nWhat are you strengths/ weaknesses?"}, {"date": "16 Apr 2015", "title": "Clinical Research Coordinator I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Mar 2014", "Interview Descriptions": "Everyone was very nice who I was talking to. The interview process had a lot more behavioral questions than I expected so just prepare accordingly. The job seems demanding but extremely worthwhile and I am excited to have been accepted", "Interview Questions": "Asked about family dynamics"}, {"date": "22 Feb 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "Relaxed and casual, lots of introductions. An initial phone interview (though I would be relocating from Dallas so this may not be common practice). The interview in person was based on a multiple mini interview style. The hospital is very large, I was told to arrive 15min early to find the interview location and then waited 20min for the first interview to start", "Interview Questions": "How do you handle office drama? "}, {"date": "30 Sept 2015", "title": "Clinical Laboratory Scientist I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Feb 2014", "Interview Descriptions": "I went through a panel interview with the supervisors for each lab department - chemistry, hematology, microbiology, blood bank. Most of them are pretty friendly and the interview was casual. There was no tricky questions and they just want to know more about your personality and ability to handle stressful situations. I'm just filling this out to meet the 50 word minimum....", "Interview Questions": "What are you strength and weaknesses? \r\nCan you work under pressure?\r\nDescribe a time where you had to deal with a difficult coworker.\r\nWhat are 3 qualities a CLS should have?\r\nWhat are your long term goals?\r\nWhat department do you prefer to work in?"}, {"date": "10 Jul 2013", "title": "Motion Lab Engineer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "A phone interview that was a Performance based interview", "Interview Questions": "Describe a time when a piece of machinery failed to operate. What did you do and how did you fix it?"}, {"date": "24 Mar 2013", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Children's Hospital Los Angeles", "Interview Descriptions": "The initial screening interview occurred via phone. Basic questions pertaining to my resume - experience, skills, why I want to work for them. The in person interview lasted about 3 hours and involved the person hiring me as well as members of his staff. I had to give a power point presentation and then 3 weeks later, I was offered the position.", "Interview Questions": "None that I can remember"}, {"date": "4 Apr 2013", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Mar 2013", "Interview Descriptions": "Applied to the job online and then I got an e-mail asking for a few references. I then scheduled a phone interview for a screening process and then after I passed the screening process, I was invited for a real in person interview.\r\n\r\nI came in for the interview and the parking situation is BAD, take the metro red line if you can! I was applying in the oncology and leukemia research wing of the hospital and the head researcher interviewed me. He was really nice and all the receptionists were nice, but the first question he asked for our \"interview\" was do YOU have any questions about the position? I was put on the spot and I automatically had to think of what to ask, even before we had a discussion about my qualifications! After all questions were answered, he instructed me to get some references to him and he would base my qualifications off of them! I was really sad that my fate would be determined by the people who only sort of knew me and were currently on vacation. I left the building for 30 minutes because the parking structure is not very well structured at all...\r\n\r\nOne day after my \"interview\", I found a VERY similar job posting looking for VOLUNTEERS!!! I originally applied for the paid version of the position and so I was not offered the job.\r\n\r\nOf course I could be wrong that this was the same posting, but I have a strong gut feeling he called my reference and my previous volunteer work was most likely mentioned, which gave the interviewer some ideas.", "Interview Questions": "Do you have any questions for me? (As a first and only question)"}, {"date": "26 Sept 2016", "title": "Server and Technical Support Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Nov 2012", "Interview Descriptions": "Short, and pleasant.  The Director I interviewed with was very low key.  He seemed uninstersted in me, and was likely only interviewing me as a favor for the VP that recommended me.  That was nice actually, and I felt that it was very open minded of them to consider someone who they might not have considered had a VP not referred them.", "Interview Questions": "Describe a time that you overcame a serious obstacle at work."}], [{"date": "11 Mar 2016", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Apr 2012", "Interview Descriptions": "Easy going environment, ask about where do you see yourself in so many years? Why do you want to work for them? Have you ever worked in the medical field? Does blood make you uncomfortable? Customer care for patients is always number one, selling yourself to the hospital.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 Jan 2014", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Children's Hospital Los Angeles in Nov 2010", "Interview Descriptions": "Interview conducted with three employees, all in higher positions", "Interview Questions": "N/A"}, {"date": "27 Mar 2011", "title": "General Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Sept 2010", "Interview Descriptions": "Was interviewed twice. They actually had some decent questions to ask. Many companies dont prepare ahead of time, these managers did. Gave helpful info about the position and company goals there.", "Interview Questions": "N/A"}, {"date": "9 Mar 2010", "title": "Data Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Mar 2010", "Interview Descriptions": "Got the interview, had three rounds of interview- Med Director, Quality Director and Quality Manager.\r\nThey were very impressed with my credentials and experiences and offered me a job on the spot.", "Interview Questions": "Technical questions on Joint Commission inspection in previous hospital"}, {"date": "2 Aug 2010", "title": "Financial Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Children's Hospital Los Angeles (Los Angeles, CA) in Feb 2010", "Interview Descriptions": "LONG", "Interview Questions": "List 5 adjectives about yourself?"}]]