[[{"date": "26 Jul 2022", "title": "Online Digital Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Vegan Society (Birmingham, England) in Sept 2021", "Interview Descriptions": "Quite rigid and lifeless, if I'm honest... no real insights, back & forth, reluctant to share information about the role - didn't really seem passionate about what they were doing, which was why I applied for the role (passionate about the ethics behind the company!)\r\n\r\nVery disappointing and very old-school lines of questioning. Didn't really ask to get to know anything beyond competencies and had no real desire to be there.", "Interview Questions": "How do you handle multi-tasking\r\nHow do you work under pressure"}, {"date": "27 Apr 2021", "title": "Digital Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Vegan Society", "Interview Descriptions": "One stage interview, presentation had to be put together for a marketing campaign. Questions mainly around team management, project management amd veganism.  Team seemed friendly and passionate about the cause, which was great.", "Interview Questions": "Around veganism amd team management"}, {"date": "11 Feb 2021", "title": "Marketing Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at The Vegan Society", "Interview Descriptions": "As a passionate supporter and previous volunteer of The Vegan Society, I was excited to see them advertise a role perfect for my career journey. I went on their website to fill out the application - the first one had an error and the second was formatted so badly and would copy typed words into every box. \r\n\r\nAfter overcoming the form difficulties and submitting my application, it took just over three weeks to be rejected. I asked for feedback and two months later still haven't received any. \r\n\r\nFor a company I looked up to I was disappointed in the recruitment process and it has put me off applying for future roles. They seem to advertise something new every week and the high turnover is a little concerning.", "Interview Questions": "What hobbies do you have? "}, {"date": "24 Feb 2021", "title": "Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Vegan Society (Birmingham, England) in Jan 2021", "Interview Descriptions": "The most positive interview experience I have ever had. The job was posted end of December 2020 and I started in my new role on 17th February so the entire process felt very efficient, especially the timeline once it was actually in the hands of the Marketing Manager. I was called the day after my interview and offered the job and I started exactly three weeks later (to allow for equipment and tech set up) which I felt was an incredibly speedy timeline. \r\n\r\nThe interview was done by the marketing manager and the director of business development, which felt like an amazing amount of attention for an assistant role, and both were very friendly and welcoming and I felt at ease as soon as I joined the call. In fact, I was actually unsuccessful in an application for a more senior role, but rather than a rejection, I was asked to interview for a more suitable role (considering this is my first grad job).\r\n\r\nI found the actual interview a genuinely enjoyable experience which is a rare thing to be able to say - I was asked to create a presentation with some specific details and I felt it really gave me a chance to show what I could do with my own creative touch. The interview questions were fairly standard and nothing felt out of the blue or not applicable to the role I was applying for. I also felt supported to find the right answer which was lovely, so if I didn't answer the exact question, it was rephrased, so I was given the chance to give the best answer possible. \r\n\r\nOverall a fantastic experience, and I'm now in my second week of work and the onboarding and induction process is so thorough and welcoming, especially considering the challenges we're all experiencing working from home.", "Interview Questions": "Prepare a 5-10 minute presentation that answers the following questions: briefly tell us about yourself and your interest in this role, share with us some of your content/graphic design work and experience, tell us about a project you're proud of."}, {"date": "24 Feb 2021", "title": "Media and PR Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Vegan Society (Birmingham, England) in Nov 2020", "Interview Descriptions": "I had a remote (Teams) interview for The Vegan Society in Nov 2020. While the interview was set up by an outsourced HR company, I was interviewed by two senior members of staff from the Comms Dept who were both friendly, warm and welcoming. I find remote interviews can be particularly challenging as you don't always get a sense of the company, job or potential colleagues but I felt very much at ease. The process was quite long - I think about 1hr 15 mins - but I did talk a lot. I've had interviews for similar roles previously but enjoyed this one the most. I loved that they took the time to explain more about the company, the office space and how they were working during the pandemic. It was one of those interviews where I came away fully confident in what was expected of me but also the benefits I could get in return. They went into detail about the role and the requirements so nothing really came as a surprise when I started. The interview also included some practical assessments including a practice radio interview (as the role required being a spokesperson on behalf of the company). After the interview I was called by the HR company who explained when I would hear back and also further questions about start dates/holidays/pay etc.", "Interview Questions": "Q. How would I have secured positive coverage for The Vegan Society if I had been working as the Media and PR Officer during the Covid-19 pandemic? "}, {"date": "24 Feb 2021", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Vegan Society (Birmingham, England) in Aug 2020", "Interview Descriptions": "The application process took just over 2 months in total, from seeing the job advertised, to filling in the application form, to getting an interview and then hearing back about the job. I think this is a fair timeline for a small charity.\r\nThe interview was held remotely via Teams because of the current situation. The interview lasted about an hour and included a short presentation at the beginning, followed by 6 competency questions and then general HR questions. \r\n\r\nThe interviewers were friendly and approachable. I felt that I understood the job description and the tasks asked because of how well they interviewed.", "Interview Questions": "The competency questions were marketing or managerial related"}, {"date": "13 Dec 2019", "title": "Communications Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Vegan Society (Birmingham, England) in Oct 2019", "Interview Descriptions": "I applied online via an application form. \r\nAfter the closing date, I had an email followed by a phone call with the recruitment officer who explained the process and offered me a formal interview date. \r\nI was then scheduled to meet for a formal interview with two senior members of the communications team. \r\nDuring the interview, I was given a management skills question test to answer and given 30 minutes to compile my answer/plan of action. We then talked through my POA, followed by them asking me a series of competency-based interview questions, including questions related to The Vegan Society.\r\nAll members of staff I came into contact with were friendly and approachable, I felt a positive and welcoming atmosphere.\r\nI was contacted a week later to say I had a successful interview and I was offered the job, which was fantastic news.", "Interview Questions": "The questions were mainly around  people management experience, veganism and  project management experience."}, {"date": "27 Sept 2018", "title": "Office Manager and Business Development Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Vegan Society (Birmingham, England) in Aug 2018", "Interview Descriptions": "I applied for two jobs at the Vegan Society.\r\n\r\nAfter my first interview I was asked back for a second interview so clearly it went well!\r\nFor the second interview I was sent a whole pages' worth of brief for a task I had to complete. It was called ‘the pros and cons of various staff time recording systems’. \r\nIt didn’t explicitly state that there would be more interview questions, and considering the size of the task I thought that would be the main deciding factor. So I spent all day every day for a week on this presentation. \r\n\r\nThere did end up being further interview questions however, and I was told I didn’t get the job because I didn’t answer the questions sufficiently, which seemed perfectly fair, but it made me realise that the presentation actually had little to do with the decision-making process.\r\n\r\nThe interviewers even said during the interview that a staff time recording system is something that they were actually going to implement for the charity, so this makes me think that they were just taking advantage of hopeful candidates by getting them to do their research for them. They even asked me to send them a copy of my presentation 'to make sure it worked on their computer system when i got there to present it', which they clearly didn't because it didn't work when i got there. So why did they ask me to send it over?  \r\n\r\nThere were delays throughout the whole process, including after the interview for the second role. I sent two emails politely requesting some feedback after it was clear I hadn’t got the job. My emails were ignored and after the whole, difficult process I was a little irritated. This led me to email again pointing out I had been ignored; I got an immediate email, and a phone call back! Telling me that as a vegan, I should understand that she didn't have time to reply to candidate emails and not complain. \r\n\r\nI get the impression, from talking to those involved and from the other reviews on this website that  because the Society does good work for the animals, they feel they have an excuse to treat people badly.", "Interview Questions": "What recent health and safety legislation are you aware of"}, {"date": "6 Mar 2018", "title": "Fundraising and Partnership Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Vegan Society (Birmingham, England) in Feb 2018", "Interview Descriptions": "I was interviewed by a panel of two at The Vegan Society's office in Birmingham. I gave a presentation, and afterwards there were six or seven questions.\r\nThe interview took place on a Friday, and I was told that I would be informed of the outcome by the end of the day, or, at the latest, on the Monday immediately after the weekend. In fact, I was never informed of the outcome, and I when I sent a follow-up email this was ignored. \r\nI travelled to the interview all the way from Brighton at my own expense (they did not offer to reimburse travel expenses) and had to take a day off work from my current job to attend. I consider the fact that they did not bother to inform me of the outcome to be extremely unprofessional and rude, especially given the fact that I also had to prepare a presentation for the interview. The Vegan Society's lack of response is the main impetus behind this negative review, although I would also add that I was not impressed by their office, which was untidy, and the general appearance and attitude of the staff, which did not inspire great confidence in their professionalism.", "Interview Questions": "I was asked how I would deliver a Fundraising Strategy for the Society."}, {"date": "17 Apr 2015", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Vegan Society (Birmingham, England) in Nov 2014", "Interview Descriptions": "The process was initially completing an application form which request responses to specific questions as a means of demonstrating prior experience. I was then telephone interviewed which went well, i provided an outline of my marketing experiences here in the UK and also in Italy. \r\nI was then invited to an interview.\r\nI was kept waiting for over half an hour in a kitchen, and when the two interviewers arrived it was obvious they expected someone much younger and their attitude from that on the phone changed from enthusiasm to abrasive.", "Interview Questions": "To outline my marketing experience emphasizing achievements?\r\nwhy i had applied for the role and what unique skill did i think i could bring to it? \r\nWhat did i know about the company and its history?\r\nWhat upcoming events that they were organizing did i know about?\r\nWhat did i think of the social and online campaigns etc.? \r\nHow i would deal with specific problems and these were to be answered by means of a small presentation."}]]