[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fantastic Team and a very supportive CEO", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Mar 2023", "job_title": "Senior Manager in London, England", "duration": "N/A", "pros": "Everyone is really committed to the cause and supportive to Partners. Current CEO, Dylan Mathews, is just incredible. Super committed, involved in many initiatives, really focused on making a difference. If you have a chance, spend as much time as you can with him. Interesting and varied work, if you work in programmes with Partners, you most likely have an option to travel. The culture is really inclusive and everyone has a lot of opportunities to contribute to everything, from operational decisions to the strategic direction. Technically, Peace Direct operates a four day working week, with half of Fridays signposted to wellbeing and half to training and development.", "cons": "Like in most charities this size, Senior Management Team has to wear lots of hats, which can be difficult at times. That is to be expected. Also, working in this sector can be overwhelming. You need a good support network and be prepared to be agile, as the workload can be heavy."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Exceptionally lovely company culture :)", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Aug 2021", "job_title": "Fundraising Officer in London, England", "duration": "N/A", "pros": "A friendly and welcoming tight knit team, and a relaxed and pleasant company culture. Not very hierarchical, and the people that work there are passionate about the cause.", "cons": "A lack of opportunities to learn and quite a lot of unnecessary meetings. Aside from that, a great place to work (and the challenges mainly stem from it being a small place, and not about this organisation specifically)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "You couldn't hope for better colleagues!", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Nov 2020", "job_title": "Programmer Manager in London, England", "duration": "N/A", "pros": "A really lovely group of people to work with and great office atmosphere. This is nurtured from the top of the organisation, with a real emphasis on team building. PD has very strong and admirable values at its core and is constantly asking itself how it can do better. The organisation is flexible and ambitious and not constrained by its own set of 'rules'.", "cons": "The organisation can get a bit stuck in its self-questioning of 'how to do better' at the expense of getting on with the job, which can be frustrating. For me its aim of supporting local peacebuilders was vast and loosely defined so it felt a bit lacking in clear direction at times. The charity is growing fast and struggling to catch up with itself. The lack of robust systems and processes means things are often done in an ad hoc way which can be inconsistent and confusing."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A brilliant organisation and a great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "14 Oct 2020", "job_title": "Programmes in London, England", "duration": "N/A", "pros": "Peace Direct is a brilliant place to work and I feel proud and fortunate to have had a chance to work there. They work with an amazing selection of peacebuilders from around the world. As a member of the team, you get a chance to work closely with these partners.\r\n\r\nI was at Peace Direct for almost a decade and so worked with a lot of colleagues over those years. Colleagues were always great - it is a relaxed and supportive work environment. \r\n\r\nIn a programmatic role, there is the requirement for reasonably regular travel. I always enjoyed the opportunities to meet with partners in their countries and see their work in person.", "cons": "PD is a fairly small organisation. For those who enjoy working in small teams and with more autonomy over your work, that's great. However - if you are someone who prefers more structure, it can be challenging.\r\n\r\nAlso: life at PD is always busy. If you want to really focus on one project or issue, you will find that hard as you'll likely be drawn into various projects."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "A very rewarding place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Oct 2020", "job_title": "Head of International Programmes in London, England", "duration": "N/A", "pros": "I worked at Peace Direct for 9 years and found it consistently a very friendly and rewarding place to work. Some key points:\r\n\r\nA really nice group of people\r\nThe purpose and values of the organisation are extremely valuable to society\r\nThe local peacebuilders are incredibly inspiring and they are the focus of the whole organisation \r\nInclusive of all staff in strategy development and a really friendly environment to work in\r\nProgressive and reflective management styles make it a place you can feel heard", "cons": "As a not-for-profit funds are often tight and this can mean that travel to see the peacebuilders can be limited to essential staff but Peace Direct has done well to find ways around this, such as larger one-off international gatherings.\r\nThe pace of work is high as you would expect in an activist organisation but at times that can make it hard for proper reflection but the new CEO when I left was good at making the space for this.\r\nToo many meetings!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Still a very long way to go for this org", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Oct 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "The local peacebuilding partners are very lovely people.\r\n\r\nA small training budget is available to staff, meaning if you find an affordable and relevant course to your role, you can possibly have it signed-off.", "cons": "Staff turnover rate is exceptionally high.\r\n\r\nWorkplace culture lacks diversity in every sense of the word. Here, there is zero diversity of thought and the organisation is very far behind when it comes to promoting diversity. You can feel incredibly isolated here if you think differently to the cultural norm or if you value diversity in an organisation.\r\n\r\nSenior management team can be ineffective and aren't generally nice people to deal with.\r\n\r\nInefficiency is a problem here, with constant meetings not being the best use of people's time. \r\n\r\nEnvironment can be toxic as most people think they are 'experts' and humility is not encouraged."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great organisation to work for", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "12 Oct 2020", "job_title": "Head of Programmer Development in London, England", "duration": "N/A", "pros": "Wonderful people who really care about their work and are great colleagues \r\nSupportive and approachable management who encourage ideas from everyone and are flexible to changing needs. \r\nGreat programmes and local partners \r\nAlways trying to be learning organisation with regular reflections and everyone at every level is encouraged to input.\r\nGood benefits for a charity of this size including additional support for those studying part time alongside work etc.\r\nI can honestly say Peace Direct was one of the best places I have ever worked. It's such a special organisation.", "cons": "Given the small size there are is not always a lot of room for career progression (although they are aware and working on this).\r\nThe management structure could do with more work as the organisation grows."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An innovative charity that invests in it's staff and strives to improve the world for everyone", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "11 Oct 2020", "job_title": "Head of Supporter Engagement in London, England", "duration": "N/A", "pros": "The CEO, Dylan Mathews is one of the most inspirational, hard-working, caring and determined people I have had the pleasure of working with. He invests time and so much energy and passion into the work of the charity and in the staff - he wants to see you be the best you can be. \r\n\r\nIf you're a committed self-starter who wants to change things for the better both within the place you work and the wider world, then this is the type of place where you will excel in. \r\n\r\nPeace Direct did all they could to provide fair pay and good benefits and I was paid well. Dylan led the way in improving the benefits like maternity.  The leadership strived for equality and diversity and changed recruiting practices to help meet these aspirations which built a diverse workforce.  All opinions were listened to and I felt privileged to be involved in choices around things like ethical banking.\r\n\r\nI had the opportunities to learn all about how a charity operates and I was fortunate enough to be involved in developing the organisational strategy. It was more singular than most meaning it could be implemented and was successful resulting in significant growth.\r\n\r\nI was encouraged to try new things to achieve my objectives and failure wasn't see as a negative but a learning opportunity - something many charities say but not many practice. Personal development was key and there were a lot of training and qualification opportunities.\r\n\r\nI had so many experiences that I just wouldn't have had elsewhere, I visited local partners in countries such as Burundi and Rwanda, corporate partners in New York, I took corporate partners to a remote island off the coast of Scotland and I attended training events throughout Europe. I did this with an amazing team of like-minded people who are now friends for life.", "cons": "As a small charity, it suits someone who is a multitaskers, can work independently, wants to learn and wants to understand the bigger picture. With this comes an experience you just wouldn't get elsewhere but you need to be flexible and determined."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Fantastic charity, good employer", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Oct 2020", "job_title": "Database Officer in London, England", "duration": "N/A", "pros": "- The impact of this charity is world class. There are few other organisations that achieve so much with the level of resource that Peace Direct has.\r\n\r\n- Dylan Mathews, the CEO, is dedicated, talented, hardworking, ambitious, friendly and approachable. The only fault I think he has (which he is well aware of) is that he sometimes takes on too much.\r\n\r\n- This is a great place to work if you're early on in your career. As a small charity, staff get involved in all sorts of different aspects of the work, meaning you get a broader range of experience than you would in a similar role at a large organisation. \r\n\r\n- The people are so friendly and supportive. This is the best team I've ever worked with. \r\n\r\n- Peace Direct is very self aware and reflective as an organisation. They take the time to ask themselves the difficult questions, to consider ripping up the plan of it's not working, and to put in the work to change so they can best meet the needs of local peacebuilders. \r\n\r\n- They are a fair employer, and really respect the commitments they make to employees. Difficult staff aren't pushed out, but are worked with and pushed to be better. \r\n\r\n- Their level of diversity and inclusion is great. As a person of colour, I felt satisfied with how highly diversity was valued. The unconscious bias training we did a few years ago seemed to have gone down well across the entire team, which says a lot.\r\n\r\n- There's a lot of trust. I was trusted to get on with my work and wasn't micromanaged. There was also freedom to fail. It was a good environment if you're creative or innovative.", "cons": "- As a small organisation, there aren't many opportunities for promotion. I saw lots of talented people move to other organisations because they were offered more senior and better paid roles which weren't even on the horizon at Peace Direct.\r\n\r\n- The office space isn't the best. It's not bad, it used to be terrible, but it's not up to the standards of many London based professional companies. \r\n\r\n- The pay isn't brilliant. It has increased significantly since I started at Peace Direct, but I would say it's below average for the roles I held, even allowing for the fact that it's a charity employer.\r\n\r\n- If there's a toxic or bad employee, you're stuck with them until they either leave or underperform so badly that they get fired. But I can't imagine Peace Direct firing someone, they're too nice to do that without gross misconduct being the issue.\r\n\r\n- Workload was always an issue. I always felt overloaded and behind, and struggled to leave work at work. I often worked over my hours. I would say at least a third of staff had a similar experience to varying degrees."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "A great family", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Oct 2020", "job_title": "Programme Officer in London, England", "duration": "N/A", "pros": "At Peace Direct I enjoyed the atmosphere with my other team mates and the friendships I developed over the year. My position allowed me to travel and meet peacebuilders around the world. I felt part of this great family alongside amazing people whom I was looking up to.", "cons": "Peace Direct grew a lot during my time there and it was hard to keep up with the constant changes (staff, strategy, procedures)."}]]