[[{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "No regrets joining but will not recommend it to others", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Apr 2022", "job_title": "Senior Associate in Singapore", "duration": "N/A", "pros": "Nice office building with excellent toilet. Gain experience working with government entities.", "cons": "Low pay, toxic environment, weak leadership."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Great job if only you know how to network", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Nov 2021", "job_title": "Assistant Manager in Singapore", "duration": "N/A", "pros": "Access to a great network of HNWI", "cons": "Long hours\r\nForever increasing workload\r\nDirections torn by multiple stakeholders\r\nPoor remuneration and benefits."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Business China", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Mar 2021", "job_title": "Assistant Manager in Singapore", "duration": "N/A", "pros": "Many opportunities to work with ministers, business leaders, internal stakeholders", "cons": "Inexperienced leadership, too many heads to clear(CEO, Chmn, Committee member, Board, etc.)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Great China Exposure; Unreliable Leadership & Management", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Apr 2019", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "1)If you are someone keen to do something in China and would like to develop your market access and networks, BC is a good platform to do so.\r\n2) Plenty of opportunities to connect with government leaders of SG or officials from China, corporate C-suites \r\n3) Lean organisational structure - you can easily reach and seek feedback from CEO or middle management, without the bureaucracy \r\n4) A relatively good level of trust and autonomy given to junior associates in their work", "cons": "1) NPO - don't expect a competitive remuneration despite your workloads being comparable to those in the civil service or stat boards\r\n2) Weak enforcement of organisational vision and incoherent management structure that is constantly hijacked by the top brass \r\n3) CEO changes every two years or so - lack of continuity \r\n4) Despite being lean and relatively non-bureaucratic, politics among management trickle downwards, which don't receive due attention or effort to stem\r\n5) For fresh grads, not a recommended first job as you don't get to develop specific industry-relevant skillsets apart from event management perhaps \r\n6) Workloads are pretty heavy for a NPO that pays relatively poorly as you may get arrowed with ad-hoc tasks and projects that do not contribute to org vision such as \"staffing\""}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Downhill since 2015", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Jun 2018", "job_title": "Anonymous Employee in Outram Park,", "duration": "N/A", "pros": "1. Business China is such an amazing place!!! If you are good at curry favour, this is the perfect platform to shine! \r\n\r\n2. Many opportunities to get into close contact with politicians, businessmen, but it all depends on your department and your direct boss, who might just cut off all your connections and simply make you do all the hard work.\r\n\r\n3. Office building is new, although all the furnitures are old, with the exception of those in top management office.\r\n\r\n4. Supervisors who are even more concern about you than your parents. They get anxious once you ain’t in their bird eye view and you will receive text from them asking “where are you?”. Such love and concern, isn’t?", "cons": "1. Not for people who want to do real work, since the management have no directions or leadership skills required to run the organization.\r\n\r\n2. Change of top management almost every two years, so even if you are great at bootlicking, it will reset to zero every two to three years. \r\n\r\n3. Company tends to scout highly paid yet incapable mid-management, who loves to take credit for their subordinates’ work. When anything goes wrong, it’s all the minions’ fault. \r\n\r\n4. Pay is below market rate for junior staffs, with minimal increments. Income gap between junior staffs and management is enormous. \r\n\r\n5. Promotion purely based on favoritism. Apparently non-deserving staffs get the most recognition. If you show that you OT very often (even if you come in at 10am and do nothing during working hours), but just because you OT it’s considered going the extra miles!! So remember to check your emails every night till 12am, you will definitely be seen as someone very proactive! \r\n\r\n6. A very toxic culture, with office politics even more exciting than our TVB HK drama. \r\n\r\n7. Definitely a training ground for Star Awards - leading actress/actor including one that bangs the table, another that accuse cleaner of stealing stuff etc"}]]