[[{"date": "10 Jan 2023", "title": "Med Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Eskaton (Gold River, CA) in Jan 2023", "Interview Descriptions": "Had a telephone interview with a recruit coordinator that they type up your answers to then be emailed over to the hiring manager at the location you’re applying to. Should hopefully receive a response with a week for next steps.", "Interview Questions": "Do you prefer to work independently or part of a team? Strengths/Weaknesses One thing that would make me remember you."}, {"date": "21 Jul 2022", "title": "RN Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Eskaton", "Interview Descriptions": "I Applied online and upon arrival for my interview, I was asked to fill out an application. The process was fairly simple. I interviewed and was offered the job approximately one to three days after.", "Interview Questions": "Tell me about yourself.\nWhy Eskaton"}, {"date": "4 Jul 2023", "title": "Kitchen Lead/Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Eskaton (Carmichael, CA) in Jul 2022", "Interview Descriptions": "Very long arduous process, must complete background check and physical and then drug test and tb test after the interview in order to get hired at any one of these facilities", "Interview Questions": "How many people I have cooked for daily"}, {"date": "20 Oct 2019", "title": "CNA Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Eskaton (Sacramento, CA) in Oct 2019", "Interview Descriptions": "Basic interview questions. Asking about past experience. They will have you walk into the facility to fill out an application so bring a copy of your resume to fill out paperwork.", "Interview Questions": "What are your strengths? "}, {"date": "17 Nov 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Eskaton (Sacramento, CA) in Feb 2018", "Interview Descriptions": "Panel of two people, they write down your answers. They called me two days later to let me know I got the job. I had to get a physical and they send you to corporate office.", "Interview Questions": "How do you feel about calling into work?"}, {"date": "14 Mar 2018", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Eskaton (Sacramento, CA) in Aug 2017", "Interview Descriptions": "Submitted an online application. After a few weeks, I received a phone call to schedule an in-person interview. After the in-person interview, I received a call a few weeks later to attend orientation.", "Interview Questions": "How do you handle stressful situations?\r\n"}, {"date": "24 Apr 2018", "title": "Resident Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Eskaton (Roseville, CA) in Aug 2017", "Interview Descriptions": "The interview process took long.  I had two interviews one with the Executive Director and the nurses and another one with all the directors.  In hindsight thought I would not have changed anything.  I feel that I had an insight on my co-workers before even working and that has help me adjust and fit in nicely.", "Interview Questions": "Mainly experience and regarding my resume.  But what stood out was that they asked me what I did outside of work.  That is surprising to me because I felt that they not only cared about what I could bring to the table but what I did outside of work was also important."}, {"date": "20 Feb 2017", "title": "Leadership Role Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Eskaton (Sacramento, CA) in Jan 2017", "Interview Descriptions": "After completing a very brief phone interview, I was invited on site for an in-person interview with the hiring manager.  I was called a few days later and offered the position.  However, I declined because it was not a good fit for me.  Also, I would be remiss if I did mention that this was the second job I applied for at Eskaton.  The first time I applied was for the same position at a different location.  I was not invited to interview.  In lieu of not responding to my application at all or simply sending me a standard notification email, I received a form postcard informing me that another candidate was selected for the position. While I think sending a decision in the mail still has merits in the 21st century, despite being somewhat old fashioned, a postcard is tacky and distasteful because it does not protect candidate confidentiality.  Anyone who handled the postcard prior to its delivery was privy to the information.  Occasionally, I receive a neighbor’s mail by accident, and vice versa.  I would have been extremely embarrassed if one of my neighbors had received this postcard.  I recommend that Eskaton stop sending these form, impersonal postcards immediately.  Instead, I recommend that the company either send a letter in a confidential envelop or just send an email like most other employers.  Even not responding to a candidate that took the time to apply for an open position would be better than a postcard.", "Interview Questions": "What led you to apply for this position?  "}, {"date": "6 Apr 2017", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Eskaton (Fair Oaks, CA) in Aug 2015", "Interview Descriptions": "Warm interview with director of program.  Very casual and made me feel welcome.  The interview lasted about 30 minutes total and they were responsive to questions from me.  They let me know in a timely fashion when I was selected for the position", "Interview Questions": "Years of experience"}, {"date": "17 Feb 2017", "title": "Dietary Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Eskaton (Cameron Park, CA) in Aug 2015", "Interview Descriptions": "I was first called in for a one-on-one interview with the Food Service Director, then upon her approval I was called in for a second panel interview with a couple of the other managers. After that, I went through a background check, drug test, and a physical, all paid for by the company.", "Interview Questions": "How do you handle multitasking?"}], [{"date": "1 Nov 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Eskaton (Sacramento, CA) in May 2015", "Interview Descriptions": "Filled out application in the facility. Got a call back with in a couple days. If you are looking to apply here your best bet is to go into what ever facility you want to work at and turn in your application there along with your resume", "Interview Questions": "Why do you wanna work here? Along with many patient scenarios such as what would you do if you needed help but couldn't leave the patient?"}, {"date": "1 Mar 2016", "title": "Wait Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Eskaton (Carmichael, CA) in Feb 2013", "Interview Descriptions": "it was very brief, they had at least two supervisors simulataneously ask me questions, mainly about my temperment and how I would deal with unruly or not very friendly residents. asked a lot about how i would deal with specific situations concerning the residents not so much on how i would get along with the staff. overall asked very general questions such as why im applying for such a position or what qualities i have that could give an overall friendly experience for the staff working there", "Interview Questions": "how would you deal with residents that weren't as kind or were rude?"}, {"date": "4 May 2016", "title": "Office Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Eskaton (Fair Oaks, CA) in Mar 2012", "Interview Descriptions": "The hiring process is two stages you meet with the supervisor of what area they are hiring for as a meet and greet the next stage is the panel interview of five of the supervisors.", "Interview Questions": "If I had all the money in the world what would I do with it?"}, {"date": "9 May 2015", "title": "Activity Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Eskaton (Sacramento, CA) in Jan 2011", "Interview Descriptions": "Face to face with administrator, submission of cover letter and resume, review of references, background check and drug screen, second interview, meeting with second interview panel, there is nothing else to write so I have no idea why you are forcing me to write 30 words or more!", "Interview Questions": "Do you have experience doing MDS?"}]]