[[{"date": "27 Jan 2023", "title": "PAYROLL Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Marquette University (Milwaukee, WI) in Jan 2023", "Interview Descriptions": "The application process lasted approximately one month, comprising of the initial submission, an in-person interview with two individuals, and completion of necessary paperwork, including a background check and credit check. The interview lasted for approximately one hour and I appreciated the opportunity to meet with the hiring team in person.", "Interview Questions": "Tell me about yourself? Tell me a time when you went above and beyond? What would you like us to know about you, that was not asked in the questions?"}, {"date": "5 Oct 2022", "title": "Student Success Advisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Marquette University (Milwaukee, WI) in Oct 2022", "Interview Descriptions": "15-minute phone screen with the supervisor for the position followed by a 1-hour interview with a panel of 3 staff and 1 faculty from the area in which the position is housed", "Interview Questions": "Why do you want this position? What makes you the best candidate? Discuss your commitment to diversity, equity, and inclusion. How do you prioritize tasks?"}, {"date": "19 Sept 2022", "title": "Cell Biology Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Marquette University (Milwaukee, WI) in Sept 2022", "Interview Descriptions": "The interview was extremely laid back, I provided proof of an A in my cell biology course and showed a glimpse of my notes, as well as responded to questions regarding why I wanted the role. ", "Interview Questions": "1. Why do you want to be a cell biology tutor?\n2. Tell me about your experiences working with students\n3. Situational questions "}, {"date": "18 Feb 2022", "title": "Fundrasier Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Marquette University", "Interview Descriptions": "The interview was incredibly friendly and welcoming. The conversation lasted about 45 minutes and included time for questions. The process was to include multiple rounds of interviews. This was the first interview of many.", "Interview Questions": "Tell me about yourself \r\nDescribe your work style. \r\nDescribe your fundraising experience. Most proud of?"}, {"date": "16 Feb 2022", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Marquette University (Milwaukee, NC) in Oct 2021", "Interview Descriptions": "They are very timely in responding and getting an interview for the position set up. Everyone was very nice and actually seemed like they wanted to be there. The interview questions were a good balance between challenging and easy. Very pleasant experience.", "Interview Questions": "Why are you interested in this field of research?"}, {"date": "10 Sept 2021", "title": "Front Desk Receptionist - Office of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Marquette University (Milwaukee, WI) in Aug 2021", "Interview Descriptions": "It was smooth. They did a phone interview and then brought me into the office. Everyone was super friendly and nice, and they were willing to work around student schedules.", "Interview Questions": "Tell me about yourself. What extracurriculars are you involved in? What is your most proud accomplishment? Strengths and weaknesses?"}, {"date": "19 Jun 2021", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Marquette University", "Interview Descriptions": "Great and detailed interview process, lots of detail. The interviews were patient with their questions and allowing interviewees time to think of and explain their well thought out answers. The environment of the interview and building was a calm, serene, and felt like home. It was an easily comforting environment and made the interview process much easier for students hoping to get the job.", "Interview Questions": "Why do you want to help students/"}, {"date": "17 Jun 2021", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Marquette University", "Interview Descriptions": "Interview was standard, but there was a strange stand-offishness with one of the interviewers. Everyone else was nice, but this one person felt almost angry at times. Definitely an odd experience.", "Interview Questions": "What is your experience with multimedia in the classroom?"}, {"date": "6 Apr 2021", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Marquette University", "Interview Descriptions": "It was a formal interview process that was well designed, and that interviewees were very clear about the process and how it would work. Well organized, which is always a nice bonus.", "Interview Questions": "Why do you want to work here?"}, {"date": "4 Mar 2021", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Marquette University", "Interview Descriptions": "Was contacted via email about my application and request for interview.  Scheduled a virtual interview in a timely manner.  Interviewer was on time, gave detailed information about position, was polite and professional.  Promised to inform if job opportunity was possible regardless of outcome.  Was contacted about doing a second interview with other staff in the department.  Virtual interview was scheduled quickly, interviewers were on time, professional, friendly and informative.", "Interview Questions": "How would you handle an unfamiliar situation if no one was around to help?"}], [{"date": "4 Mar 2021", "title": "Global Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Marquette University", "Interview Descriptions": "One interview with the manager. The interview was pretty short and to the point. Asked where you worked and how you qualified for the job. It was an interview that was very conversational.", "Interview Questions": "How can you help the team?"}, {"date": "22 Feb 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Marquette University", "Interview Descriptions": "Very quick turn around simple questions, verified student status, job expectations laid out very clearly. Interviews and competitiveness of position depend on department. Flexibility with hours as well, must be coordinated with class schedule", "Interview Questions": "What is your weekly capacity with your course load "}, {"date": "23 Sept 2022", "title": "GA prevention education programs  Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Marquette University (Milwaukee, WI) in Feb 2021", "Interview Descriptions": "They do a match program. It makes it a lot easier  and less stressful. Multiple interview round.  This took place over teams and was virtual.\nIn the future they may do in person. ", "Interview Questions": "How well do you handle stress"}, {"date": "7 Dec 2021", "title": "Apartment Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Marquette University (Milwaukee, WI) in Dec 2020", "Interview Descriptions": "I felt the interview process was pretty self explanatory. It was an online interview with 10-15 questions and you could re-record a few times if need be. I heard back the next month!", "Interview Questions": "How will you make your building more inclusive?"}, {"date": "11 Feb 2021", "title": "Group Fitness Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Marquette University in Jul 2019", "Interview Descriptions": "Initially I reached out via email to inquire. Next we met on teams to talk about the position very informally. I would definitely not stress over it. Overall the process was very informal and stress free", "Interview Questions": "What is your fitness class experience?"}, {"date": "2 Nov 2020", "title": "Resident Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Marquette University (Milwaukee, WI) in Jan 2019", "Interview Descriptions": "Two phases, one that is more business like, and the other is casual. Most dorms need males and that's what they usually look for, in my opinion. The second interview they look for leadership skills and how you handle different situations.", "Interview Questions": "Write a haiku on your experience today"}, {"date": "18 Feb 2023", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Marquette University in Jan 2019", "Interview Descriptions": "Not too bad - they do a good job of screening candidates and determining experience. I think that they are a good university and contribute to higher learning. Plus Milwaukee is a great city with great people.", "Interview Questions": "What is your experience level?"}, {"date": "17 Oct 2018", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Marquette University", "Interview Descriptions": "applied online. brought in to look at labs. then chose a lab from there. you have a year or two of graduate assistant support before expected to find research group", "Interview Questions": "why marquette"}, {"date": "3 Feb 2021", "title": "Graduate Assistant - Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Marquette University (Milwaukee, WI) in Jul 2018", "Interview Descriptions": "Casual interview, more personal and research interest than anything else. I prepared more than necessary and was pleased with being over-prepared.  I enjoyed the process and was pleased with the result.", "Interview Questions": "What are your research interests?"}, {"date": "29 Dec 2021", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Marquette University in May 2018", "Interview Descriptions": "group interview with performance based interview questions. asked more about my interest in the position and past experience that I planned to bring into the curriculum. very pleasant interviewers, non-intimidating.", "Interview Questions": "Tell us why you are interested in this position?"}], [{"date": "18 Jun 2020", "title": "Community Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Marquette University (Milwaukee, WI) in Jan 2018", "Interview Descriptions": "I had one interview and they went over my ability to manage time and my experience in social justice field within the Milwaukee area. They also talked about how it would be on me to create a lot of what the job is so asked what ideas I had for this role, and then asked about my major and how it connected to my overall goals of working this job.", "Interview Questions": "How do you manage time efficiently if there are conflicting interests? "}, {"date": "21 Nov 2017", "title": "Practice Placement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Marquette University", "Interview Descriptions": "The interview process was a panel interview with several tenured staff from the university. It lasted about 2 hours. They were individuals I did end up working with pretty closely when hired.", "Interview Questions": "How will I implement in this role? "}, {"date": "29 Sept 2017", "title": "Advancement Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Marquette University (Milwaukee, WI) in Aug 2017", "Interview Descriptions": "Applied in May 2017, but I wasn't available to work until August. Had my initial phone screen that went very well, but then I had some difficulty remaining in touch with the department. I sent a few emails/phone calls that went unanswered, and I assumed I was no longer in the running for a position. Heard back about 2 months later that I was still in the running, so I went in for an informal interview, then a more formal interview. Neither interview was very structured, I asked most of the questions in the second, more formal interview.", "Interview Questions": "What are the most important things to you in a work environment?"}, {"date": "25 Feb 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Marquette University in Jul 2017", "Interview Descriptions": "Fair and reasonable, met with direct supervisor and their supervisor.  References reported good phone discussion with supervisor.  Staff seemed pleasant and knowledgeable.   Office area was pleasant.  Evening dinner discussion was also held.", "Interview Questions": "Describe your past experience relative to this position."}, {"date": "6 Jun 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Marquette University (Milwaukee, WI) in Mar 2017", "Interview Descriptions": "The hiring managers were extremely friendly and I was very thankful for the group interview.  Each person asked a question and I asked them questions as well.  It was about 30 minutes to an hour during the process, and I had an in-person interview after a phone interview. Even though I didn't get the job, it was still a great experience!", "Interview Questions": "What type of food would I bring to a potluck!"}, {"date": "8 Mar 2017", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Marquette University (Milwaukee, WI) in Nov 2016", "Interview Descriptions": "Very tough interview, but very fair. It started slow with an email, and then a phone screen then a presentation with a panel, then a second and third interview with more faculty.", "Interview Questions": "How do your values fit into Marquette's Jesuit tradition."}, {"date": "24 Oct 2016", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Marquette University (Milwaukee, WI)", "Interview Descriptions": "Very comprehensive.  Interviewed with over 20 people including faculty, staff and current students after having a phone interview.  I was flown into Milwaukee and stayed overnight for a two day interview.", "Interview Questions": "Why Marquette?"}, {"date": "11 Apr 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Marquette University (Milwaukee, WI) in Sept 2016", "Interview Descriptions": "Applied to the department who then looked over candidates before looking to assign each to a particular research faculty depending on availability and interest. Overall it was very laid back and an enjoyable experience.", "Interview Questions": "What is your past experience in research?"}, {"date": "13 May 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at Marquette University (Milwaukee, WI) in Apr 2016", "Interview Descriptions": "The hiring process took over 6 months and communication with HR was very poor. Marquette HR put off communication and delayed the initial interview for months.  It was near impossible to contact them or get any status updates on the process.", "Interview Questions": "Do you have experience with Word or Microsoft Access?"}, {"date": "9 Nov 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Marquette University", "Interview Descriptions": "For the interview process, it was a discussion with several different professors about Marquette and course work. In addition, upon applying to graduate school you are automatically considered for finical aid.  The position covers tuition and provides a stipend. After discussion with the professors you can increase your odds of a position.", "Interview Questions": "Discuss some of the class specific topics and explain how you would create a different laboratory."}], [{"date": "27 Oct 2015", "title": "IT Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Marquette University", "Interview Descriptions": "The hiring process was postive. Had a phone screen with the director, came on site for an hour long interview with the director, then did a half day with the team. Met with the director once more to go over the offer in person.", "Interview Questions": "How would you go about solving a problem?"}, {"date": "22 May 2017", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Marquette University (Milwaukee, WI) in Aug 2015", "Interview Descriptions": "been employed with the university for 2 years. the interview process was very quick. the interview overall went very well. the department has great people to work with that will help your career long term.", "Interview Questions": "when are you able to start?"}, {"date": "1 May 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Marquette University (Milwaukee, WI)", "Interview Descriptions": "Very intense and interviewed with over 20 professionals.  Two day interview including a dinner the night before and interviewed along a continuum of people ranging from students to Deans.  I had one on ones as well as interviewing with panels and people from all areas of the University on how I would interact and improve the \"Marquette experience\" for the students.", "Interview Questions": "Why Marquette?"}, {"date": "5 Oct 2015", "title": "The Comptroller's Office Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Marquette University (Milwaukee, WI) in Apr 2015", "Interview Descriptions": "There were 2 interviewers who are from the office. The process was about half an hour. There was no greeter. The interviewers would be an internal audit and an accountant. They probably will ask some accounting questions.", "Interview Questions": "Why Marquette?"}, {"date": "4 Feb 2016", "title": "Communications/Advancement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Marquette University (Milwaukee, WI) in Jan 2015", "Interview Descriptions": "I applied online and shortly after was reached out to for a phone interview. The phone interview went well and I was asked for an in-person interview. In addition to the in-person interview, I was asked to complete a writing assessment. I was asked back for a third interview before I was told that I did not receive the job offer. A lengthy interview process but everyone who I interacted with was nothing short of professional and warm.", "Interview Questions": "Tell us a little about your previous experience."}, {"date": "20 Nov 2018", "title": "Service Learning Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Marquette University (Milwaukee, WI) in Jan 2015", "Interview Descriptions": "group and individual interviews. The group ones try to answer each question. It can be hard in a group but feel free to raise your hand to get a word in", "Interview Questions": "What is your comfort with social justice subjects?"}, {"date": "14 Sept 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Marquette University", "Interview Descriptions": "Standard interview process. First go through round of phone interviews, then in-person interviews. My areas had lots of contact with students, so there were a lot of questions on how I interact with them. The interview itself only took about an hour and was fairly painless, mostly conversational. It's difficult to say how interviews are held university-wide, however, as Marquette (like most universities) is a fairly \"silo-ed\" place with different departments doing very different things, and needing very different characteristics from their employees.", "Interview Questions": "Why did you choose the major you did?"}, {"date": "25 Jul 2014", "title": "Communications/Advancement Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Marquette University", "Interview Descriptions": "Submitted Online Application software was very buggy and unsure if was submitted so resubmitted No email , phone or written response. I waited over two months to hear anything. Gave up and never head from even though position still listed at last viewing. Very curious seems as though listing are just holding spots in many cases waiting for funding.", "Interview Questions": "Previous experience question"}, {"date": "23 Dec 2015", "title": "Student Employee Phonathon Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Marquette University in Jul 2014", "Interview Descriptions": "I applied online. Then about two weeks later got a call for a phone interview that was very easy and got offered the job at the end of the phone interview.", "Interview Questions": "How would you respond to an angry alumni?"}, {"date": "23 Apr 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Marquette University", "Interview Descriptions": "I got an interview chance from an assistant professor in Marquette University firstly and had a short phone interview. The process was quite concise and happy, but I didn't hear about the results for about 6 weeks. I wrote an email to the professor before the due date and didn't get a reply. \r\nLuckily, I got an offer from another professor in Marquette University directly without an interview. So, I accepted this offer. \r\nAdditionally, I also got an offer from the first professor after the due date, the reason that the professor didn't reply was that he was struggling to get a fund to support a RA.", "Interview Questions": "none, actually, it was quite concise and happy."}], [{"date": "19 Feb 2018", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Marquette University (Milwaukee, WI) in Apr 2014", "Interview Descriptions": "Pleasant process, the interviewers were very welcoming and wanted to understand my personality and goals before the interview started.  The interview was a behavioral style interview with some knowledge-based questions", "Interview Questions": "What was my experience in dealing with difficult students?"}, {"date": "19 Jan 2014", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Marquette University", "Interview Descriptions": "Straightforward interview process. Phone screen and two onsite interviews. Very corporate. The team was already formed; meaning that there were long-term existing relationships that a newbie would have to overcome. The interview process also had a lot of questions about staying longer-term (which is great) so the focus was really about what types of contributions could be made over a longer period of time.", "Interview Questions": "How do you deal with a difficult employee?"}, {"date": "6 Jan 2014", "title": "Desk Receptionist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Marquette University", "Interview Descriptions": "I signed up for an interview time when I turned in my application. The interview consists of a panel of 3 current students--1 current apartment/facilities manager, 1 new apartment/facilities manager, and a current desk receptionist. They ask you typical questions like what are your strengths and weaknesses and when is a time you have had to deal with diversity or be assertive. Once you leave they give you a numerical score--most of the applicants receive a similar score. Basically you just need to show that you are available, are responsible, and are assertive.", "Interview Questions": "Describe a situation where you have had to confront someone"}, {"date": "29 Nov 2013", "title": "Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Marquette University", "Interview Descriptions": "The interview takes about a half an hour and is with 3 current student employees of Marquette. It is a simple interview asking about past experiences and how you would handle certain situations, as long as you don't say \" I want to get paid to do my homework\" you should be able to easily get hired.", "Interview Questions": "N/A"}, {"date": "24 Oct 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Marquette University (Milwaukee, WI) in May 2013", "Interview Descriptions": "I was staring at the window one day. My advisor came into the lab, and offered me the job. I said I would take it. That was the whole process... But realistically, if a person who is a grad student at the Mechanical Engineering department wants to become a TA, they will have to talk with the head professor who is in charge of the entire graduate program. Let the head professor know that you are interested in becoming a TA for the coming semester. He will keep your profile on file, and let you know before the next school year begins. It's more like an evaluation of how well you are doing at school.", "Interview Questions": "Do you want to take this job?"}, {"date": "24 Feb 2014", "title": "Writer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Marquette University (Milwaukee, WI) in Jun 2012", "Interview Descriptions": "Hiring took forever -- 9 weeks: one phone screen, three rounds on on-campus interviews, including one with the Asst VP, two different writing assessments. This was a great deal of scrutiny for the position, especially since they switched my team to a different supervisor after I had been there one month. Considering I was laid off 17 months after I was hired, I don't think the right hand was talking to the left.", "Interview Questions": "Neither difficult or unexpected, but applicants needs to be able to discuss in length what the Jesuit mission means to them. Do a lot of research on MU before applying and expect hiring to go very slow. "}, {"date": "23 Jun 2015", "title": "Controller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Marquette University (Milwaukee, WI) in May 2012", "Interview Descriptions": "Good, no interview.  Interviewed by one of my best friends.  Knew I had the job going into the interview. Easy to prepare for.  Would reccomend to undergrad students at Marquette University.  Great job, could study during office hours.", "Interview Questions": "When can you start?"}, {"date": "29 Jan 2013", "title": "A/V Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Marquette University in Jan 2010", "Interview Descriptions": "Fairly straightforward online application process which allowed for the applicant to choose their top three departments. This increased the chances of getting an interview, which was good. The interview itself wasn't too hard, and at only one meeting, wasn't drawn out at all. Overall, it's a great place to work with even better people", "Interview Questions": "Describe one time you've failed and how you've used that to motivate yourself in the future?"}, {"date": "19 Nov 2009", "title": "IT Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Marquette University (Milwaukee, WI) in Aug 2008", "Interview Descriptions": "Got called, interviewed over the phone.  Then I was asked to come into the office for a group interview.  I wasn't asked about my past experiences and how they might apply to the job.", "Interview Questions": "You have a project for a department on campus that is resisting the change, but the university thinks its the direction the department should go.  How do you (as a project manager) get everyone on board with the decision - or, how do you build support?"}]]