[[{"date": "15 Jun 2023", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Navitus Health Solutions (Appleton, WI)", "Interview Descriptions": "The interview process was fantastic. The recruiter was very helpful and quick with getting back to you. The interview scheduling was quick as well. Everyone I worked with during the interview process were very nice and quick to respond back. I did have a phone screen, and 2 interview sessions.", "Interview Questions": "They do the typical phone screen and ask the typical questions “tell me about your experience” and “why do you want to leave your current job” they also asked me about certain skills such as multitasking and attention to detail and examples of how I’ve used them. During the interview be prepared to talk about your experience and how it relates to the position you are applying for."}, {"date": "2 Jun 2023", "title": "Talent Acquisition Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Navitus Health Solutions", "Interview Descriptions": "I really enjoyed the interview process and everyone I met with was very kind! I went through to the final interview, however, I was ghosted after that and never received an answer after multiple reach outs which was disappointing.", "Interview Questions": "How do you stay organized?"}, {"date": "19 Apr 2023", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Navitus Health Solutions", "Interview Descriptions": "Had an interview with the recruiter over the phone which was not stressful. Was selected to move on in the interview process but decided this was not the right time so did not continue on with the process.", "Interview Questions": "Why did you apply here?"}, {"date": "21 Apr 2023", "title": "Product Owner Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 3 weeks. I interviewed at Navitus Health Solutions (New York, NY) in Apr 2023", "Interview Descriptions": "Phone call with a recruiter then 3 interviews, one of them with a panel of 3 people.\n\nNothing too hard, cultural stuff. \n\nTell me about a time...\n\nHow would you solve....\n\netc.\n\nI told them I received another offer and had to answer by the next week.\n\nThey scheduled a final interview for me and told me I would hear back very soon.\n\nThey told me they were making an offer, but did an odd thing where I had to talk to a benefits person before the offer to go over the benefits.\n\nIn hindsight, I'm wondering if they try to wow you with the benefits (very low deductible)  so they can pay you less.\n\nI reminded them I had a time limit for their offer, but they made me wait a couple days for a response. They then responded, saying they couldn't match my other offer and were exploring their options. I asked them what that meant, and they made me wait another 2 days for a response. I ended up being forced to take the other offer, and then they responded to me after to tell me they wouldn't even be sending me an offer anymore. I asked for a follow up and I've been ghosted since.\n\nIt was all very shady and unprofessional. Part of me thinks they were hoping I would let the other offer expire. \n\nI think the company means well but if you're in product you're better off looking elsewhere.", "Interview Questions": "How did you solve a conflict"}, {"date": "9 May 2023", "title": "Business Intelligence Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Navitus Health Solutions (Madison, WI) in Apr 2023", "Interview Descriptions": "Straightforward HR recruiter call, followed by the 30 min Teams meeting with 3 team members that was by far the most awkward interview I've ever had. Very unprofessional, sloppy and clearly unprepared. Followup was assessment to finish in 1 hour precisely (didn't check in if I was available). Week later got an impersonal rejection email.", "Interview Questions": "Preferred learning style, background etc"}, {"date": "13 Feb 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Navitus Health Solutions in Jan 2023", "Interview Descriptions": "I had a Talent Acquisition Specialist reach out to me for a Project Manager position on LinkedIn. When I replied that I was interested I had to basically chase him down for a response. He scheduled an interview with him and said he would submit me for the role so I could interview with the hiring manager. He also said to reach out if I had any questions and then has ghosted me for the past four weeks. I've emailed, messaged on LinkedIn and called. I'm honestly very unimpressed with the lack of courtesy, professionalism or respect from this company.", "Interview Questions": "Tell me about your previous healthcare experience."}, {"date": "7 Jun 2022", "title": "Product Owner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Navitus Health Solutions", "Interview Descriptions": "One phone interview with a recruiter and two virtual panel interviews with potential teammates and managers. \nPhone interview was about system knowledge and skills.\nPanel interviews were a series of questions.", "Interview Questions": "What is your experience with the Agile Methodology?"}, {"date": "3 Feb 2023", "title": "Business Intelligence Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Navitus Health Solutions in Jun 2022", "Interview Descriptions": "I had a phone screening, skills assessment, and the actual interview. There was a 2.5 hour interview. We met with clients, managers, and members of the team. Culture is very important within the company.", "Interview Questions": "What is your ideal workday like?"}, {"date": "18 May 2022", "title": "Associate Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Navitus Health Solutions", "Interview Descriptions": "It was very laid back. They were interested in finding the right fit. My interview and time in the position was during the height of covid so my interview experience may be a little skewed.", "Interview Questions": "Why do you want this position "}, {"date": "13 Apr 2020", "title": "Project Manager/Implementation Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Navitus Health Solutions (Madison, WI)", "Interview Descriptions": "Phone interview: I met with the director of implementation and she was awesome. She has personality and treats you like a person. I've never had a better phone interview, in my opinion,  ever. It was like a breath of fresh air even with the stress of finding another job after being laidoff.", "Interview Questions": "Tell us about yourself."}], [{"date": "10 Oct 2019", "title": "Training and Development Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Navitus Health Solutions (Stough, AL)", "Interview Descriptions": "I applied online, and got a call back for a phone screen a few days later. A few days after the phone screen, they called again to set up an interview.  The interview was 3 hours, with a skills assessment test (Outlook, PowerPoint), an interview with the hiring manager and director, a benefits overview, and then an interview with the team. After the interview I received an email asking to fill out an application on their online portal with references, and they said they would get back to me by the end of the week. By Tuesday of the following week, I had not received any email or phone call. I checked the online portal, though I had not been prompted by an email or in the interview to do so, and the online portal said I did not get the job. I emailed my contact to confirm this was the case. They were prompt with email response and cordial during the interview process.", "Interview Questions": "How have you handled, or how would you handle, an instance where you violated HIPAA?"}, {"date": "16 Apr 2019", "title": "Client Services Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 4 weeks. I interviewed at Navitus Health Solutions (New York, NY)", "Interview Descriptions": "interview consisted of screening call with recruiter, call with 1 hiring manager, then on site with 6 others (2 hiring managers, 3 client managers, 1 hr rep). Standard questions for an account manager/ client manager role, behavioral questions and a lot of why I choose to apply to Navitus.   Very nice group, however once I mentioned my salary probably priced myself out, and never heard back after the I review, at least a standard rejection would have been appreciated.", "Interview Questions": "tell me why you chose to apply to Navitus"}, {"date": "22 Mar 2019", "title": "Programmer Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Navitus Health Solutions (Austin, TX) in Oct 2018", "Interview Descriptions": "Applied online, brief phone interview, two in person non-technical interviews, and then an HR benefits overview interview on the phone. Had the initial phone interview two or three weeks after applying. Very easy general questions about my work history and academic experience. Was told I would hear something for an in person interview in about two weeks. Two weeks passed and I didn't hear anything. I emailed my interviewer and that same day received an email from a recruiter for the in person interview for the next week. Since the software team is in a different state, it was a video interview with one person in the meeting room with me and 4 or 5 people in the video asking questions. They asked easy questions about what I did in school and my work history. Fundamental programming questions and behavioral questions. Generally easy. Right after the interview ended, I received a phone call to schedule a second in person interview the next day.  This time, no one was in the room with me, just 4 or 5 people in the video. Questions were more challenging but only behavioral. Since I was entry level, every question was about what I did in school and I couldn't answer using experiences from work. They wanted to know how experienced I was in working in a system similar to theirs. Shortly after the interview, I got a call from an HR Rep for a benefits interview over the phone. This interview was odd. The HR Rep literally read off the details of the medical insurance benefits like deductibles, OOP Max, etc and did the same for the dental and vision benefits. When I asked about how do employees in Austin communicate with their managers and HR since the headquarters are in a different state, I was told that as long as I answered with more Yes's than No's, and had an entrepreneurial work style, I wouldn't have a problem with management. Okay...The HR Rep also asked what my salary requirements were. At the end of the interview, I was told a decision would be made within the week. I waited but didn't hear anything. I emailed the recruiter, which I was told I could email if I had any further questions about the job, but I didn't get any response back. Another week went by and I got an email over the weekend stating they picked someone else.", "Interview Questions": "Tell us a time when you didn't do your best and what do you think you could've done instead?"}, {"date": "14 Apr 2018", "title": "Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Navitus Health Solutions", "Interview Descriptions": "Very easy cultural questions with very easy technical questions.  More concerned with cultural fit than actual talent and aptitude.  Generally an incredibly low bar for the expected knowledge of day to day job.", "Interview Questions": "Do you know how to use a computer?"}, {"date": "25 Jun 2017", "title": "Client Service Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Navitus Health Solutions", "Interview Descriptions": "I applied on line then I was contacted for a screening phone interview by human resources.  Then went to onsite interview by a panel, the questions were average with some behavioral ones like how did you react to a problem and tell how you solved it and what was the result.", "Interview Questions": "Describe your work style"}, {"date": "15 Jun 2017", "title": "Coordinator, Government Programs Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Navitus Health Solutions (Appleton, WI) in Apr 2017", "Interview Descriptions": "Contacted by the hiring manager via phone. Did a quick phone interview with him. Followed up by an in-person panel interview. You meet with HR via video conference first, then the panel interview with your co-workers interview you, followed by a short interview with the hiring manager.", "Interview Questions": "What do you like about your current job?"}, {"date": "28 May 2019", "title": "Customer Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Navitus Health Solutions (Appleton, WI) in Feb 2017", "Interview Descriptions": "It was a group interview with several different people from within the company.  It was informative, fast and kind of fun because you can see how you will mesh with other possible co-workers.", "Interview Questions": "They asked what was the last electronic you had to learn."}, {"date": "24 Oct 2016", "title": "Client Service Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Navitus Health Solutions", "Interview Descriptions": "phone call which was mostly informative about the company\r\nalso got lots of information about living in Wisconsin\r\nseems to be people friendly and a good corporate culture --- probably due to the size\r\nasked about relocating and questions related to the very detailed job description", "Interview Questions": "Give an example of a difficult situation that you had to handle?"}, {"date": "10 Oct 2019", "title": "Senior Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Navitus Health Solutions (Appleton, WI) in Jul 2016", "Interview Descriptions": "I had a 1 on 1 interview with Human Resources, a phone interview with the hiring manager, and finally an in-person interview with hiring manager and several other team employees.", "Interview Questions": "Tell me how you handle multiple deadlines of equal importance? "}, {"date": "28 May 2019", "title": "Prior Authorization Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Navitus Health Solutions (Appleton, WI) in Mar 2016", "Interview Descriptions": "I was hired as a temp, in a group interview format. I applied with a temp agency, and had to interview with a group of 4. The interviewers would alternate which interviewee would start answering, so you really only had to answer a few questions first.", "Interview Questions": "What do you think Prior Authorization is?"}], [{"date": "27 Apr 2019", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 months. I interviewed at Navitus Health Solutions (Appleton, WI) in Feb 2015", "Interview Descriptions": "I applied for at least a dozen different positions, some of which I was actually MORE than qualified for.   The communication I got from Navitus was absolutely horrible.  Sometimes I’d get an email, sometimes I’d get nothing.  I went to their Career site and I can see some of my applications are still pending—and I applied in August of 2018.  The one time I did interview there a few years ago, it was a standard panel/skip-level process, and even with regular follow ups from me, it took NINE MONTHS to get my canned email rejection response from anyone!", "Interview Questions": "Tell me about a time when you had to influence someone to implement an idea you had"}, {"date": "26 Nov 2017", "title": "Member Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Navitus Health Solutions (Appleton, WI) in Jan 2015", "Interview Descriptions": "It was your standard run of the mill interview where they ask you questions, you answer questions and then you have answered questions for them to review at the end of the process", "Interview Questions": "N/A"}, {"date": "29 Oct 2014", "title": "Finance and Administration Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Navitus Health Solutions", "Interview Descriptions": "Excellent team process, very streamlined, great quesitons.  Had a phone screen first, then a 3 hour interview morning with serial conversations with the hiring manager, then the team, then with an HR representative to go over the benefits and culture pieces.  Very impressed with the HR portion--answered all my questions completely, and followed up with me after.", "Interview Questions": "Tell me about a time when you had difficulty meeting a deadline, and what you did about it."}, {"date": "6 Jan 2017", "title": "Member Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Navitus Health Solutions (Appleton, WI) in Oct 2013", "Interview Descriptions": "You must work with a temp agency to receive an interview in the member services department. You may get a group interview that is generally in groups of 4-5 people. They will ask all of you the same question/s and you are expected to answer it in your own way while 3 Navitus employees take notes on your answers. \r\nIf they liked you during the interview, you may get an offer extended from the temp agency. \r\nOnce you have fulfilled your temp agency required hours, Navitus may extend to you a formal job offer to become a permanent employee. It's at this time that you are eligible for all of their job benefits.", "Interview Questions": "What was your most difficult experience working with others in your past experience? "}, {"date": "26 Aug 2015", "title": "Business Information Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 days. I interviewed at Navitus Health Solutions (Madison, WI) in Apr 2011", "Interview Descriptions": "In my cases there wasn't much of an interview.  It started as a temp to hire position so I basically had to interview with my work product.  If future interviews we would do a group panel with incoming candidates and we would ask them a range of questions.  Questions would range from how they deal with past work situation to more abstract questions like \"How much sugar do you think is consumed in the US each year\"", "Interview Questions": "When can you start?"}]]