[[{"date": "25 Jul 2023", "title": "Film Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Toronto International Film Festival (Toronto, ON)", "Interview Descriptions": "I received 10 situational questions before the online interview, so I had time to get myself prepared. During the interview, the interviewers were so nice. They basically only asked those questions.", "Interview Questions": "How did you overcome communication barrier at work?"}, {"date": "8 May 2023", "title": "Grant Writer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Toronto International Film Festival", "Interview Descriptions": "There were 10 questions I had to answer however, the people interviewing me were very kind. They provided the questions beforehand to help you prepare. The questions were pretty standard and very situational.", "Interview Questions": "Name a time when you made a mistake and how did you fix it?"}, {"date": "2 Jun 2022", "title": "Production Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Toronto International Film Festival", "Interview Descriptions": "The interview consisted mostly of situational questions about teamwork, communication barriers, difficult situations and how you manage to work under stress and in fast-paced environments. The people in the interview were friendly and kind - mostly focused on the prep questions that any other thing.", "Interview Questions": "What's your biggest challenge so far?"}, {"date": "17 Apr 2022", "title": "Industry Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Toronto International Film Festival", "Interview Descriptions": "One round of interviews, I was given questions ahead of time and two people on the panel they were friendly and answered my questions but took a while to hear back from them", "Interview Questions": "At the end of it they asked me what my favourite movie is "}, {"date": "22 Dec 2021", "title": "Festival Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Toronto International Film Festival", "Interview Descriptions": "All hypothetical questions for a job that requires training. Not a lot of information about the job before hand.  Little to no diversity in hiring staff. A lot of waiting but decently organized.", "Interview Questions": "What you would do in various situations"}, {"date": "30 Nov 2021", "title": "Social Media Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Toronto International Film Festival", "Interview Descriptions": "The interview process for this role was very comforting, each person was very kind and created an enjoyable zoom environment. An HR coordinator reached out with some sample questions ahead of time to help me prepare.", "Interview Questions": "Tell me about a time when you built rapport quickly with someone under difficult\r\nconditions."}, {"date": "8 Sept 2020", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Toronto International Film Festival", "Interview Descriptions": "Met the full team over 3 interviews (1 telephone and 2 in person). The first and last interviews were more conversational, whereas the second was directed from a list of questions and in round table format.", "Interview Questions": "What does good customer service mean"}, {"date": "11 May 2023", "title": "Usher, Cashier, Box Office Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Toronto International Film Festival (Toronto, ON) in Apr 2020", "Interview Descriptions": "Great and friendly staff. Was given questions beforehand so I can be prepared. It was in person and felt interviews made feel comfortable. Overall great experience and would recommend to apply.", "Interview Questions": "Why do you want to work here"}, {"date": "23 Jan 2020", "title": "Human Resources Generalist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Toronto International Film Festival (Toronto, ON) in Dec 2019", "Interview Descriptions": "My interview process started with telephone interview. I was then invited to a panel-style interview three days later,  with the heads of departments who work closely with the role in question", "Interview Questions": "Tell me about a time that you had to analyze large amounts of data."}, {"date": "10 Sept 2019", "title": "Social Media Producer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Toronto International Film Festival (Toronto, ON)", "Interview Descriptions": "Three part process for a three month contract, little insane but that's TIFF.. Phone interview, assignment, in-house. \r\n\r\nNice enough guy. Pretty common interview questions. They ask where you get your film news, all personality stuff. I've worked there for years but I was applying to a different position so I knew how to give them what they wanted to hear on a lot of stuff.", "Interview Questions": "They asked for an assignment. I booked it, on my regular laptop, assuming it's just written or they would have said noted the resources I require to complete it. They send over the assignment and it's a bunch of photos that require serious Photoshop editing to make them even remotely usable. Just terrible. I've worked as a photo editor on the Olympics so this is kind of my jam. However, there was zero notice I'd need special software to complete the assignment, which obviously made completing the assignment impossible.  \r\n\r\n"}], [{"date": "25 Jun 2019", "title": "Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Toronto International Film Festival", "Interview Descriptions": "Received an email to select a time slot for a phone interview. I had a phone interview with manager and coordinator. They were very friendly and accommodating. Questions were of average difficulty.", "Interview Questions": "How are you in a oriented environment?"}, {"date": "1 May 2019", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Toronto International Film Festival", "Interview Descriptions": "Phone interview and then an in-person interview. Both interviews were pretty straightforward and easy. Asked the basic questions and was overall a very pleasant experience. I did not get it though.", "Interview Questions": "What is your greatest strengths and weaknesses?"}, {"date": "15 Oct 2018", "title": "Corporate Partnership Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Toronto International Film Festival", "Interview Descriptions": "Pre-screening with 30 minute phone interview. \r\nAsking numerous questions about the role and how you qualify. \r\nInterviewer seemed rushed aND not relaxed. Did offer much opportunity for conversation. Wanted to get right to interview question on aptitude on the position.", "Interview Questions": "Why you know about TIFF "}, {"date": "1 Sept 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Toronto International Film Festival (Toronto, ON)", "Interview Descriptions": "Was super laid back. I applied online to volunteer for the Toronto Film Festival and then received an email to go to an orientation. At the end of orientation there is a interview. The interview conducted is one on one, but multiple interviews happen at a time. It is like a 5 minute or less interview!!", "Interview Questions": "What does customer service mean?"}, {"date": "5 Jul 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Toronto International Film Festival (Toronto, ON)", "Interview Descriptions": "Short phone interview followed by an in person interview with two managers and an HR Rep.\r\nDid not hear from them after the interview.  Had to reach out to the hiring manager multiple times before finally receiving confirmation that they had chosen another candidate.  Reached out to the manager a while later as I noticed another posting in her department.  No response.", "Interview Questions": "Constant questioning about mistakes made and how you fixed them."}, {"date": "13 Sept 2018", "title": "Front of House Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Toronto International Film Festival (Toronto, ON) in Jun 2018", "Interview Descriptions": "There was a Job fair and an interview with 2 people on the panel. It lasted for 10 mins and then a phone call after a month which lasted for 5 mins. I had applied for a front of house role but got the Usher role.", "Interview Questions": "Why do you want to work at Toronto international film festival?\r\nWhat will you do if the movie is delayed by 30 minutes?\r\nHow will you handle the crowd? \r\n"}, {"date": "11 Jun 2018", "title": "Festival Job Fair Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Toronto International Film Festival (Toronto, ON) in Jun 2018", "Interview Descriptions": "After being offered an interviewed, I went into the cinema and filled out application where you select your top choices for jobs at the festival. You are assigned a number and then once called go into a separate room where other people are also being interviewed. Interviewed by two people. The employees at TIFF were very friendly and welcoming.  They asked typical interview questions that were not very hard.", "Interview Questions": "What do you know about TIFF?"}, {"date": "26 May 2018", "title": "Theatre Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Toronto International Film Festival", "Interview Descriptions": "Straightforward, good conversation and explanation of job, lots of talking about requirements and expectations. Clear explanation of salary, time required, long hours etc, dealing with partons and filmmakers and other staff.", "Interview Questions": "Strengths and weaknesses"}, {"date": "16 May 2018", "title": "Program Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Toronto International Film Festival (Toronto, ON) in Jan 2018", "Interview Descriptions": "Two interviewers, asked practical questions, scenario questions, what I can bring to TIFF, asked about who I am as a person, asked some technical questions pertaining to the program, very relaxed interview, not intimidating, a little bit harder than the average interview", "Interview Questions": "Describe a time when you felt like you were extremely successful in your work place"}, {"date": "21 Sept 2017", "title": "Festival Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Toronto International Film Festival", "Interview Descriptions": "The interview happened after orientation. Waited a long time in the theatre without cellphone reception. 3 questions were asked and the whole process lasted 10min. Mostly behavioral questions. Interviewers are experienced volunteers.", "Interview Questions": "Why do you volunteer? Which are the venues you want to work at and why?"}], [{"date": "20 Jul 2017", "title": "Festival Job Fair Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Toronto International Film Festival in Jul 2017", "Interview Descriptions": "Group interview - very well organized. They have you all sit in a cinema room first to fill out a festival job fair application (outlines each role and you list your top picks). Be sure to bring a copy of your resume with you!! You'll grab a number when you walk in and they'll call your number when they're ready for you. You then go out to wait in another small line up of people in the hallway until you're called in to the interview room (where multiple interviews are happening at once). You'll meet with 2-3 members of the TIFF team who will ask you a short list of standard interview questions.", "Interview Questions": "Standard interview questions - why do you want to work at TIFF / tell us about how your past experience relates to this position / what would you do in X situation / tell us about a time when you exemplified excellent customer service. \r\n\r\nInterviewers are very welcoming and friendly. "}, {"date": "28 Sept 2017", "title": "Festival Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Toronto International Film Festival (Toronto, ON) in Jul 2017", "Interview Descriptions": "Arrived TBLB and was directed to Cinemas where numbers were called. Interviewed by a team of two using standard behavioural questions, in a room where others were being interviewed by teams of two also.", "Interview Questions": "What have you done recently to go above and beyond in customer service?"}, {"date": "10 Jul 2017", "title": "Adult Learning Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Toronto International Film Festival (Toronto, ON) in May 2017", "Interview Descriptions": "Applied online via. TIFF Career. Got phone interview within one week of application and got the result within one week as well. It should be a general meeting if the candidate gets in.", "Interview Questions": "Why do you want to join TIFF?"}, {"date": "5 Mar 2017", "title": "Intern Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Toronto International Film Festival", "Interview Descriptions": "First a phone interview about the position and screening you. \r\n\r\nSecond a three person pannel. One person from HR and two from the department you are applying to. \r\n\r\nThey call your references make sure you have three.", "Interview Questions": "What's your favourite movie? \r\nHow to you stay calm under pressure? \r\nHow do you keep yourself organized?"}, {"date": "19 Nov 2020", "title": "Filmmaker Host Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Toronto International Film Festival (Toronto, ON) in Sept 2016", "Interview Descriptions": "The interview was divided into sessions.  First, they tested my knowledge of downtown Toronto such as restaurants, entertainment sites, and general navigation. Second, my knowledge of cinema and my favourite movie.", "Interview Questions": "Which are the main attractions in the city? "}, {"date": "6 Sept 2016", "title": "Festival Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Toronto International Film Festival (Toronto, ON) in Aug 2016", "Interview Descriptions": "Applied online on the website in May, got answer and invitation for the interview-orientation session at the end of June, very easy process. Signed up for the first orientation date on the Hub. There was an orientation presentation by very nice staff members of TIFF, followed by short 1 on 1 interview (but in panel style form). Easy questions, just making sure that you can do the 4 required shifts and talking about previous customer service experience or how you would manage certain situation.", "Interview Questions": "How would you manage a person who says that the waiting line is too long?"}, {"date": "6 Nov 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Toronto International Film Festival (Toronto, ON) in Aug 2016", "Interview Descriptions": "General Interview of one to one on the stage of the cinema. Many groups of interview at the same time. Very short questions asked. First is the online application and if you passed it, you have the change to go to the orientation and answer two short questions.", "Interview Questions": "What do you think of a service industry"}, {"date": "13 Jun 2016", "title": "Film Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Toronto International Film Festival (Toronto, ON) in Jun 2016", "Interview Descriptions": "Applied online, heard back a week and a half later for a pre-recorded interview and then an in-person interview the following week. The interviewees were friendly, but do your research!", "Interview Questions": "Explain something complicated in under 3 minutes"}, {"date": "9 Nov 2015", "title": "Interm Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Toronto International Film Festival (Toronto, ON)", "Interview Descriptions": "Phone interview, second in-person interview, third in-person interview with senior management. Sat down in meeting room, they offer water. They read questions from a sheet and write down your answers - very normal. It is a nice interview.", "Interview Questions": "Questions pertaining to department and your experience."}, {"date": "14 Nov 2015", "title": "Logistics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Toronto International Film Festival (Toronto, ON) in Jun 2015", "Interview Descriptions": "Job fair type of interview.  You sit in a cinema, listen to the various jobs and benefits of working there.  You select your preferences and then you go to a big room where many interviews are being conducted and wait for your turn.", "Interview Questions": "They are behavioural questions.  Why do you want to work at TIFF?  How do you handle stressful situations?  Etc."}], [{"date": "10 Mar 2015", "title": "Event Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Toronto International Film Festival", "Interview Descriptions": "After applying online, I received an email soon after inviting me to choose an orientation session date. There were quite a few options. At the session they outlined the requirements of the volunteer positions which included an orientation booklet. After this session, a small interview took place for all new volunteers (returning volunteers did not have to complete the interview). Those who arrived first were interviewed first, and so on. While waiting, there was a preference list we were required to fill out stating which positions we were most interested in. \r\n\r\nThere was approximately 30 people conducting interviews so the process moved quickly.  It was one on one, and the interviewer asked approximately 5 questions about TIFF, why I was interested and how my previous experience fit.", "Interview Questions": "What do you know about TIFF/TIFF's different programs?"}, {"date": "16 Nov 2014", "title": "Festival Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Toronto International Film Festival (Toronto, ON)", "Interview Descriptions": "Phone interview followed by IRL interview by Junior Manager. They left a great impression and made me want to work there. I was so interested, I returned for a second year.", "Interview Questions": "No unexpected questions"}, {"date": "1 Nov 2016", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Toronto International Film Festival (Toronto, ON) in Jun 2014", "Interview Descriptions": "15-20 minute pleasant phone interview with very basic questions. Was called less than a week later and brought in for an in person interview with phone interviewer and the person who would manage me. The whole process was extremely pleasant.", "Interview Questions": "How would you deal with a patron who is being rude and demanding to be seated in a reserved seat?"}, {"date": "16 Feb 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Toronto International Film Festival (Toronto, ON) in Apr 2014", "Interview Descriptions": "Submitted resume, cover letter, and three references. Got a phone interview that lasted about ten minutes about my knowledge of the organization. Got scheduled an in-person interview. Three people on the panel, got asked questions about my knowledge of the organization, some case studies, and situational questions. Got a phone call offering me the position three weeks after.", "Interview Questions": "How do you keep yourself motivated when completing repetitive tasks?"}, {"date": "7 Jan 2018", "title": "Usher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Toronto International Film Festival (Toronto, ON) in Mar 2014", "Interview Descriptions": "I was interviewed by my immediate manager after an e-mail application. There may have been someone else in the room, I can't remember. It was not terribly formal (which suited me fine.)", "Interview Questions": "What is one time you've had to deal with a difficult customer, and how did you handle that interaction?"}, {"date": "10 Feb 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Toronto International Film Festival (Toronto, ON) in Jan 2014", "Interview Descriptions": "First interview was formal, with two managers from the department and an HR representative present. They rotated asking traditional HR questions, and a few job related questions.\r\n\r\nSecond interview was an informal coffee meeting with the department, more of a personal meet and greet. \r\n\r\nReceived an offer of employment a few days after my second interview.", "Interview Questions": "Describe a time you had a conflict with an employer, how was it resolved? "}, {"date": "18 Jun 2016", "title": "Box Office Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Toronto International Film Festival (Toronto, ON) in May 2013", "Interview Descriptions": "Met with two managers in a room where other managers were also interviewing prospective hires. They asked a variety of generic scenario questions, nothing unexpected. It lasted approximately 10-15 minutes, and they said they would contact me in a few weeks. The entire interview felt very laid back and conversational, which is reflective of TIFF's work culture. They got back to me fairly quickly via e-mail, sent me a contract and I accepted.", "Interview Questions": "How would you react to..."}, {"date": "14 Mar 2017", "title": "Technical Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Toronto International Film Festival (Toronto, ON) in May 2013", "Interview Descriptions": "I was interviewed by 2 people in the company, and was asked technical questions related to the work involved, aspect ratios, projection experience, etc. I was offered the position by phone afterwards.", "Interview Questions": "Tell us about your experience."}, {"date": "30 Sept 2013", "title": "Facilities Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Toronto International Film Festival (Toronto, ON) in Jun 2012", "Interview Descriptions": "Behavioural based Interview questions. Panel interview, usually 3 people, Hiring Manager, HR representative, potential stakeholder / colleague. They are very interested in cultural fit.", "Interview Questions": "They select from the 35 most common behavioural interview questions. Google that & prepare yourself."}, {"date": "4 Nov 2014", "title": "Membership Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Toronto International Film Festival (Toronto, ON) in Mar 2010", "Interview Descriptions": "Interview with 3 committee members.  Very standard behavioural questions about your work background.  No questions related to knowledge of film or film industry.  There was only one interview   followed by the offer.", "Interview Questions": "Standard behavioural questions, no surprises or hard questions."}]]