[[{"date": "2 Feb 2023", "title": "Technical Writer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of New Mexico", "Interview Descriptions": "The interview was scheduled quickly after application. The interview was conducted virtually over Zoom. The interview lasted approximately 45 minutes. The interview was conducted with several members of a search community, all of whom asked questions.", "Interview Questions": "What was my previous experience working with others on a written project?"}, {"date": "15 Jun 2023", "title": "Student Tutor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of New Mexico (Albuquerque, NM) in Jan 2023", "Interview Descriptions": "Teach students in computer science field using java, C, and python. I help them in solving the assignment problems, and projects. In addition, I also help with learning new programming language.", "Interview Questions": "I haven't taken the interview"}, {"date": "9 Nov 2022", "title": "Library Information Specialist III Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at University of New Mexico", "Interview Descriptions": "All scheduling was done via email, and the interview was conducted remotely interview, over Zoom. I was interviewed by four persons who took turns asking questions. I was asked standard questions pulled from a database, I think it was eight to ten questions in total.", "Interview Questions": "General \"tell us about yourself\" question and another \"describe your work experience\" question. One question related to diversity was obviously not updated to reflect the current DEI statements by the university and amounted to asking \"what is diversity?\" This was a library position but none of the questions were library-specific, most were general office culture and customer-service questions."}, {"date": "22 Aug 2022", "title": "Compliance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of New Mexico", "Interview Descriptions": "There were three interviewers on the panel. They \"round robined\" prepared questions. I met with the group roughly 3 weeks after applying. Within about 1.5 weeks I received notice of my interview results.", "Interview Questions": "What did I know about civil rights and diversity. How I would handle unsettled individuals. "}, {"date": "4 Aug 2022", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of New Mexico", "Interview Descriptions": "Virtual, pretty informal \nOver all it was casual and they asked fairly simple question. A lot of talk about the role itself and how you may be best suited for it", "Interview Questions": "Your schedule for the semester "}, {"date": "20 Apr 2022", "title": "Student Technical Support Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of New Mexico", "Interview Descriptions": "I applied through a referral. Got an interview call within one week of applying and got hired next week for the position. The interview was remote and pretty laidback. The interview took about 30 minutes.", "Interview Questions": "How do you keep up with the technology?"}, {"date": "7 Apr 2022", "title": "Videographer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of New Mexico", "Interview Descriptions": "Smooth interview process. The interviewer mostly seemed to stick to a script of questions, which I’ve noticed for a lot of these types of positions. They were interested in knowing whether candidates can hit the ground running and how well they follow directions.", "Interview Questions": "How well do you work as part of a collaborative/team? "}, {"date": "6 Jul 2023", "title": "Tech Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of New Mexico (Albuquerque, NM) in Apr 2022", "Interview Descriptions": "Quite Easy, a couple technical questions about the actual job but most of them are about customer service. The majority of the questions are hypothetical scenarios and what you'd do in that situation.", "Interview Questions": "Describe cPanel in your own words."}, {"date": "11 May 2023", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of New Mexico (Albuquerque, NM) in Mar 2022", "Interview Descriptions": "5 interviews total. Very long hiring process. Interviews are 30 minutes to an hour long on zoom. Multiple people involved in the interviews and they all ask a lot of questions. Very nerve racking.", "Interview Questions": "What can you bring to UNM that would be beneficial to the department?"}, {"date": "3 Jan 2022", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of New Mexico", "Interview Descriptions": "It was a pretty straightforward interview and got the job.  Just few questions and that's all. Don’t be nervous or scared. I got an email for job offer after few days", "Interview Questions": "Why Should We Hire You?\nTell Me About Yourself."}], [{"date": "30 Dec 2021", "title": "Audiologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of New Mexico", "Interview Descriptions": "Interview was lengthy. Many technical and/or case study questions (How would you fit a hearing aid on a child?) along with your standard interview questions (What are your goals? Why our facility?)", "Interview Questions": "How would you diagnose auditory neuropathy?"}, {"date": "16 Nov 2021", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of New Mexico", "Interview Descriptions": "Really easy , they gave a time and. A place, nothing special,  very really easy process, i had one interview  that was it. They called a few days later to offer me the job", "Interview Questions": "How iw i feel about hiv patients"}, {"date": "30 Jun 2022", "title": "IRB Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of New Mexico in Jun 2021", "Interview Descriptions": "Two rounds of interviewing with more than one person. Questions were thoughtful and the people you would be working directly with were in the interview, so you could ask really good and important questions.", "Interview Questions": "N/A"}, {"date": "12 Mar 2021", "title": "Deputy Director of Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of New Mexico", "Interview Descriptions": "Interview with the 3 leadership members, then one interview with the Executive Vice Chancellor. The first interview was very simple and typical, the last interview was more of expectations of the job.", "Interview Questions": "Typical Regulation questions and other behavioral questions"}, {"date": "5 Apr 2021", "title": "Clinical Research Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of New Mexico (Albuquerque, NM) in Mar 2021", "Interview Descriptions": "Smooth process to applied but I takes a long time to get the interviews and still you need to wait longer to know their final decision about you getting the job.", "Interview Questions": "Tell us about your self."}, {"date": "18 Jan 2021", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of New Mexico", "Interview Descriptions": "Phone interview for hiring manager, then Zoom interview with interview committee (4 individuals comprised of 3 team members 1 external). The Zoom meeting covered basic interview questions and some scenarios for advising.", "Interview Questions": "What is your advising philosophy?"}, {"date": "11 Jan 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of New Mexico", "Interview Descriptions": "The interviewers were disorganized. They were totally unresponsive after the interview. Got an email 6 months later saying I didn't get the job. It was one final interview, no initial phone screen or anything, which is a bit unusual.", "Interview Questions": "10-15 classic behavioral questions over the course of an hour. "}, {"date": "28 Aug 2021", "title": "HR Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of New Mexico in Jan 2021", "Interview Descriptions": "The interview was set up quickly. The lady that called was pleasant and gave me clear directions on where to park. The interview itself was fine. They were a pleasant panel except that because everything was written down - there wasn’t a fluid conversation going which makes interviews more difficult in my opinion.", "Interview Questions": "All questions were scenario based"}, {"date": "14 Mar 2022", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of New Mexico in Nov 2020", "Interview Descriptions": "Applied for position and received a call to interview one week later. very quick process.  only had one interview with 3 other people via zoom. received a job offer two weeks later.", "Interview Questions": "What challenges do you think you might experience "}, {"date": "6 Sept 2021", "title": "OT Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 5 months. I interviewed at University of New Mexico (Albuquerque, NM) in Oct 2020", "Interview Descriptions": "Very difficult, multi stage application process.  Including Casper test and group interviews. There is only one OT program. In NM and there are also applicants from out of state that you have to compete with.", "Interview Questions": "Name an ethic dilemma that you have had to face"}], [{"date": "3 Aug 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of New Mexico (Albuquerque, NM)", "Interview Descriptions": "No interview.\nYou just need to have connections and talk about your projects and find a connection between your job and your advisor.  The Albuquerque is a perfect city for getting your PhD. Everythings is cheap so I highly recommend.", "Interview Questions": "Can you work with Mathematica?"}, {"date": "28 Nov 2021", "title": "Bus Driver Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of New Mexico (Albuquerque, NM) in Aug 2020", "Interview Descriptions": "It was Ok. A panel discussion with lead drivers giving option. The senior drivers were allowed to black ball perspective drivers without qualifying reasons. Many female drivers used flertasious behavior to gain control over new drivers.", "Interview Questions": "How would you deal with a difficult passenger"}, {"date": "6 Nov 2019", "title": "Sales Associate Bookstore Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of New Mexico", "Interview Descriptions": "Easy interview process. Very basic questions, appropriate for a student job. Relaxed interview atmosphere. Basically they just want someone who is dependable, can occasionally work weekends and who is friendly to customers.", "Interview Questions": "When will you be graduating "}, {"date": "23 Oct 2019", "title": "Senior Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of New Mexico (Gallup, NM) in Oct 2019", "Interview Descriptions": "Upon selection, you are set up with a Xoom (video) interview. You are asked 15 stock questions that are more of a personality inventory than and interview. I did not make it past that stage, but it is followed by a campus visit for lead candidates.", "Interview Questions": "NOTE: For Gallup branch campus.\r\nThe initial video conference interview is not at all an opportunity to learn more about the job or learn about how you fit in increasing outcomes.\r\n\r\nRather, it is a series of stock \"gotcha\" questions - 15 of them - where they rate your answers in some sort of rubric. It's very guru and a flashback to trends of a decade ago.\r\n\r\nQuestions are of the \"How do you react when someone at work questions your integrity?\" and similar. There is little to no opportunity for followup questions, and they are dismissive if you ask about the job itself."}, {"date": "31 Aug 2019", "title": "IT Programmer/Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of New Mexico (Albuquerque, NM) in Jul 2019", "Interview Descriptions": "They didn't ask any technical questions, but they did ask for details and examples about my technical background, as well as general ones to gauge my personality and the kind of decisions I'm likely to make. They were friendly, personable, open-ended, and welcomed questions. \r\n\r\nThe interview was over a month ago, and they still haven't decided on a candidate. I don't know yet if I'm getting an offer or not.", "Interview Questions": "Describe a time when you encountered a very difficult programming problem, and how you solved it."}, {"date": "27 Jun 2019", "title": "Institutional Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of New Mexico (Albuquerque, NM) in Jun 2019", "Interview Descriptions": "There was just one round of interview. It was a panel interview with four people, and it lasted about 30 minutes. They mainly asked about my relevant skills and experience. They were all fairly easy-going and relaxed.", "Interview Questions": "What's your biggest professional achievement so far?"}, {"date": "29 Mar 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of New Mexico (Albuquerque, NM) in Mar 2019", "Interview Descriptions": "It seemed scattered and as a candidate was unsure of what would be next step.  Also did not get a phone call when position was filled by another application.  I had to make the call myself.", "Interview Questions": "How would you handled a confrontation with co-worker and give an example in previous job?"}, {"date": "17 Jun 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of New Mexico (Albuquerque, NM) in Feb 2019", "Interview Descriptions": "I was notified that I had been shortlisted, then they requested dates/times when I was free to attend a video panel interview.  I listed several academics that I would like to be a part of the panel but none of my choices were present. However, both of the researchers who were present had similar research interests to mine.", "Interview Questions": "What is the reason to apply for this particular program?"}, {"date": "28 Sept 2018", "title": "Donor Relations Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of New Mexico (Albuquerque, NM)", "Interview Descriptions": "Overall, it was a pretty positive interview. Most of the questions were pretty generic, seeking to determine what you would do in various generic scenarios, such as how you'd handle conflict with coworkers. There were relatively few questions about the organization itself or what sort of changes/ideas you might suggest in your role, which surprised me since it was a last-round interview. I walked out thinking everything had gone very well but did not get the job.", "Interview Questions": "What are three adjectives you would use to describe yourself as an employee?"}, {"date": "26 Nov 2018", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Sept 2018", "Interview Descriptions": "I easily applied for the job through the UNM job website. I was contacted shortly through email to set up an interview. Since I was out of state I had the option of a phone or Skype interview.", "Interview Questions": "The did not ask stereotypical interview questions at all. They only asked questions that pertained to the job.  For example: what experience I had in field research. "}], [{"date": "29 Aug 2022", "title": "Project Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of New Mexico in Sept 2018", "Interview Descriptions": "Questions were fair and specific to the goals of the position that was being interviewed for. Interviewed by 3 people in first interview then by 2 people in a subsequent interview.", "Interview Questions": "They asked me about writing skills"}, {"date": "11 Jul 2018", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of New Mexico", "Interview Descriptions": "The interview was completely conducted by email and telephone. The first interview were some questions sent by email to reply to. The second interview included three University of New Mexico employees asking fairly standard interview questions for the position.", "Interview Questions": "Name an instance where you thought of a novel way to handle a difficult situation."}, {"date": "7 Aug 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Jul 2018", "Interview Descriptions": "Painful. It seems that UNM is required to interview many candidates for a single position for documentation purposes when they already have a candidate in mind. If called, I would ask if they are actually interested in you, or if they are filling an interview quota.", "Interview Questions": "How do you stay organized?"}, {"date": "25 Jun 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of New Mexico", "Interview Descriptions": "List of questions. It involved questions that has job duties. Friendly interviewer and just one round of interview. The duration of the interview was very reasonable. It was about 30 minutes long.", "Interview Questions": "Availability"}, {"date": "13 May 2022", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of New Mexico (Albuquerque, NM) in Jun 2018", "Interview Descriptions": "Did a zoom interview, then got invited to travel to new Mexico, went out to new Mexico and met with the director and revived an offer a few weeks later.", "Interview Questions": "Regular interview questions like tell me about yourself, etc."}, {"date": "19 Jun 2018", "title": "RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Apr 2018", "Interview Descriptions": "Very laid back interview. Everyone was very nice and made the interview feel comfortable. Four team members involved in doing the interview. The interview process took approximately 30 minutes", "Interview Questions": "Why do you want to work here? How will you fit in? Strengths "}, {"date": "29 Aug 2021", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Feb 2018", "Interview Descriptions": "Quick and easy with great feedback afterwards. The process can be very simple and applying online in their portal is great. No one should have problems applying and interviewing here.", "Interview Questions": "How long have you been designing?"}, {"date": "16 Feb 2018", "title": "Systems/Network Analyst II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of New Mexico in Jan 2018", "Interview Descriptions": "Standard interview with mix of behavioral and technical questions. The process took  over a month and could not get any reply to phone call messages from anyone (including HR)  regarding status updates.   I was not notified that the job had been filled, found out after checking the website.", "Interview Questions": "N/A"}, {"date": "8 Sept 2018", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of New Mexico (Albuquerque, NM) in Jan 2018", "Interview Descriptions": "Skype Interview with on campus interview and job talk\r\nExpect a large number of people in the room\r\nBack-to-back interviews with multiple committees\r\nRead the job description carefully, many interview questions will reference specifics outlined in the description", "Interview Questions": "N/A"}, {"date": "17 Jun 2021", "title": "Front Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of New Mexico (Albuquerque, NM) in Jan 2018", "Interview Descriptions": "Interviewed with the Operations manager and the SRC Desk Manager, went upstairs and waited for my interview time. Shortly after the interview, they emailed me with a job offer for the position.", "Interview Questions": "FERPA. What would you do if a parent calls asking for information about their student?"}], [{"date": "11 Nov 2018", "title": "Teaching Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of New Mexico (Albuquerque, NM) in Jan 2018", "Interview Descriptions": "You have to know a professor that will be able to vouch for you to get an interview. The interview is not that bad but you will have to stand from the crowd.", "Interview Questions": "What skills do you posses "}, {"date": "18 Aug 2020", "title": "Compliance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Sept 2017", "Interview Descriptions": "Initial interview was a phone interview that reviewed the job and skills needed and did some initial screening and then panel interview consisted of two managers. That was all that the interview process consisted of at that time.", "Interview Questions": "Explain how the prison to pipeline theory impacts the campus community and how it would ultimately impact the people and persons whom you would be conducting investigations on."}, {"date": "15 Nov 2020", "title": "Childcare Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of New Mexico (Albuquerque, NM) in Aug 2017", "Interview Descriptions": "UNM interviews like to include lots of scenario based \"What would you do?\" type questions. Focus on child safety and positive redirection. Flexibility in work environment is a plus. I was also asked to bring an item that reminded me of my childhood for fun.", "Interview Questions": "What would you do if you saw a child climbing a fence on the playground?"}, {"date": "21 Jul 2021", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Jul 2017", "Interview Descriptions": "Thorough interview process which required numerous steps. The process began with a phone call then a video interview and an in person interview. The process took approximately one month from application to offer.", "Interview Questions": "Tell us about your experience"}, {"date": "27 Mar 2019", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of New Mexico in Jul 2017", "Interview Descriptions": "It was a series of questions mostly designed to test whether i am a good fit for the job or not. Also the questions were meant to get an answer out of me.", "Interview Questions": "How big is it?"}, {"date": "7 Aug 2017", "title": "Orientation Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of New Mexico (Albuquerque, NM) in Apr 2017", "Interview Descriptions": "There was a list of questions they asked regarding managing international students and problems they face in beginning. What was my previous background experience in this regard? How many university resources i am aware of?", "Interview Questions": "What problems do International students face in beginning? "}, {"date": "7 Sept 2016", "title": "Accountant I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of New Mexico", "Interview Descriptions": "Saw the posting on the internet and applied, manager called and setup interview.\r\nInterview consisted of canned questions very procedural. The answers to these questions could be found online. The overall process was quite painless and professional if not impersonal.", "Interview Questions": "Q: What are your strengths, how to handle difficulty situations, typical interview quetions"}, {"date": "6 Jul 2016", "title": "Senior Scientist Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Jul 2016", "Interview Descriptions": "I was arranged with a phone interview and the whole process was about 10-15 minutes. He asked me several questions which was related to my visa status, when I can graduate, what makes me to success in the position and so on so forth.", "Interview Questions": "What makes you successful in the position if you are selected?"}, {"date": "20 Nov 2016", "title": "Systems/Network Analyst III Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of New Mexico (Albuquerque, NM) in Jul 2016", "Interview Descriptions": "Standard questions about past experience and behavioral questions. Library has no technical leadership or vision for moving the University forward. The whole department was brought in to ask questions after the interview. They all sat there silently. Very little clue about what this position actually did or what it was responsible for.", "Interview Questions": "Describe your experience in managing storage infrastructure including any specific technologies or systems used."}, {"date": "19 Dec 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of New Mexico (Albuquerque, NM) in Jun 2016", "Interview Descriptions": "very simple and quick, just need to make an appointment with a professor and talk to him about yourself and why you want to be a teaching assistant? It was only about half an hour process.", "Interview Questions": "Why do you want to be a teaching assistant"}], [{"date": "25 Jun 2018", "title": "NSF Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of New Mexico (Albuquerque, NM) in May 2016", "Interview Descriptions": "There really was no interview. I just completed the application online and got an email a couple of months later. You chose your PI based on your interests and all the PIs are great so even if you dont get your fist choice you are ok.", "Interview Questions": "Previous experience"}, {"date": "7 Apr 2017", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at University of New Mexico (Albuquerque, NM) in May 2016", "Interview Descriptions": "I applied online and received a call to attend the interview.\r\nThe interview was not so hard, but you have only 30 minutes to solve the questions.\r\nAfter that, I was called and told that I was selected.\r\nQuestions involved are basic stuff.", "Interview Questions": "web development questions"}, {"date": "3 Jan 2017", "title": "Programmer Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of New Mexico (Albuquerque, NM) in Apr 2016", "Interview Descriptions": "I have applied online and interviewed at unm Albuquerque, it was a panel interview, many questions are from resume and few  follow up questions based on answers.Very friendly people.", "Interview Questions": "Constructive feed back you received and how did it helped you?"}, {"date": "6 May 2017", "title": "Student Technical Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of New Mexico (Albuquerque, NM) in Jan 2016", "Interview Descriptions": "The interview process was very easy.They asked some technical and behavioral questions.it was only one round of interview.There was first phone screening interview and then their was one-one interview.They also asked whether you are interested to work on weekends or public holidays", "Interview Questions": "Tell me some thing about your past experience"}, {"date": "18 Sept 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of New Mexico (Albuquerque, NM) in Nov 2015", "Interview Descriptions": "Initially, I was asked about my background, previous experience, skills, and interests. Professor put me to the test for a week to see if I could learn a software independently. After I showed him some results, I was given the job.", "Interview Questions": "Why do you want to work for me?"}, {"date": "19 Sept 2016", "title": "Academic Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Oct 2015", "Interview Descriptions": "Easy going asked about work experience and scenarios. Then the management team asked many interview questions about the scenarios in which case what you would do in situations. Also asked questions on training and projects outside normal duties", "Interview Questions": "Working with student population"}, {"date": "11 Jun 2015", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of New Mexico (Albuquerque, NM)", "Interview Descriptions": "apply online, contact for interview, (panel interview), then an offer was given over the phone. Please be sure to check your email junk area as thats where the \"already filled position\" emails go. (for gmail) As for the phone calls, they all show up as blocked or a strange number that you cannot call back.  Make sure you have a Voicemail set up that clearly states your name,", "Interview Questions": "Where do you see yourself in a few years, strengths and weaknesses. Multiple other positions I interviewed had up to 5 people in front of you "}, {"date": "28 Apr 2016", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Jun 2015", "Interview Descriptions": "Preliminary telephone interview. Checked all references.  Second interview was a panel interview with 5 staff members.  Third interview included students within the department and required a presentation that I delivered created according to instructions.", "Interview Questions": "Questions included asking how I would handle certain situations such as groups that were difficult to handle."}, {"date": "12 Feb 2016", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of New Mexico (Valencia, NM) in Jun 2015", "Interview Descriptions": "I got a call back and went to job interview a week later. Interview was held in the office of the Department Chair. Answered a few questions. Questions were basic, exploratory type. There was no teaching demonstration. Within twenty minutes I was offered the position.", "Interview Questions": "Tell me about your teaching experience. . ."}, {"date": "27 Oct 2015", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of New Mexico (Albuquerque, NM) in Jun 2015", "Interview Descriptions": "1 Hour behavioral interview with few technical questions. Technical questions mostly regarding MS project, visio and sharepoint. Behavioral on how to handle difficut situations, team members and tasks. Explain your experience with visio ans sharepoint. give some examples from your past experiences. Explain agile , six sigma projects", "Interview Questions": "How will you manage tasks assigned to you?"}], [{"date": "6 May 2015", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at University of New Mexico", "Interview Descriptions": "Submitted the resume online and it took not more than two days to schedule the in interview.The interview was very easy. I was asked questions regarding sql and web application development experience.", "Interview Questions": "Tell me about your programming skills."}, {"date": "1 Apr 2015", "title": "Analyst Programmer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of New Mexico", "Interview Descriptions": "Ask programming skill in SQL and understand basic statistics. Need to be a student at UNM.\r\nHow many hours can you worked here? (hour salary) paid insurance and intuition. It is very good interview experience. Must be very aggressive and commitment for this position. Need to attend meeting if possible.", "Interview Questions": "What is your programming skill?"}, {"date": "5 Mar 2016", "title": "Network Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of New Mexico (Albuquerque, NM) in Apr 2015", "Interview Descriptions": "Pretty simple. Questions on resume about projects, basic questions on the job based on description. Please explain what you have done in your Academic projects and make sure to be confident", "Interview Questions": "Explain the projects in your resume"}, {"date": "21 Apr 2017", "title": "Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of New Mexico (Albuquerque, NM) in Jan 2015", "Interview Descriptions": "Online application and then interview face to face with the department team. The interview took about 30min with fit-work environment and personality. The interview was very friendly and i heard within two weeks about the result of the interview.", "Interview Questions": "What is one big cultural challenge your faced and how did you solve it?"}, {"date": "19 Dec 2014", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of New Mexico", "Interview Descriptions": "Online posting and application process. All communication from the university, including request for interview and notification of hire/not hire are done very impersonally via email. Personal connections within the university are essential to be seriously considered for a position at this level.", "Interview Questions": "N/A"}, {"date": "16 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of New Mexico (Albuquerque, NM) in Dec 2014", "Interview Descriptions": "Professors typically hire based on if they know you well or if you are recommended. Otherwise it will be difficult to get into because there are so many applicants applying for the position", "Interview Questions": "No Interview"}, {"date": "3 Sept 2014", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of New Mexico", "Interview Descriptions": "Great communication and feedback. Somewhat scripted in terms of information about the university and basic questions as expected. Great energy from faculty in terms of research interests and potential fit with the department.", "Interview Questions": "Not difficult but definitely important: would you have a problem moving to Albuquerque?"}, {"date": "21 Oct 2014", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of New Mexico in Aug 2014", "Interview Descriptions": "One interview after online application. I was contacted by email to set up interview. Three people interviewed me and took turns asking questions. The supervisor started talking about the department, felt really long and covered what any applicant should have known from looking at the website. Did not start with the dreaded \"Tell me about yourself\", but something easier to answer.", "Interview Questions": "Tell me about a situation where you gave good customer service. "}, {"date": "24 Aug 2015", "title": "Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of New Mexico (Albuquerque, NM) in Aug 2014", "Interview Descriptions": "Sat down with manager and supervisor and discussed involvement on campus. It was friendly and welcoming,. Definitely on the easier side of things, however I was given the job due to a recommendation, so the interview may have been a formality. I did appreciate the questions during the interview though.", "Interview Questions": "How do you adapt?"}, {"date": "16 Nov 2015", "title": "Video Editing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at University of New Mexico (Albuquerque, NM) in Aug 2014", "Interview Descriptions": "I am a student employee, so applied through college website but was rejected in first round. After 4 months they called me for another first round and got selected. I was offered job after 2 days. It was overall an easy average interview, not too easy or too hard.", "Interview Questions": "Few technical ( database, basic programming) questions and few HR questions"}], [{"date": "16 Sept 2015", "title": "Computer Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of New Mexico (Albuquerque, NM) in Jun 2014", "Interview Descriptions": "I applied for the position through the online jobs website that the University of New Mexico has for students, faculty, and staff members.  I applied for the position about 2 weeks before they called me for an interview.  The interview was with the head of the ARC department and a supervisor.  After the interview they said they would call me and it took about a day and a half before they called me with a job offer.", "Interview Questions": "How do you like to stay organized?"}, {"date": "23 Mar 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Apr 2014", "Interview Descriptions": "The job was posted on UNM's Job Connection. The initial application package required a resume and cover letter. Since it was a work-study position, I also needed to be able to verify my award for that year. 2 weeks after I submitted my application, I received an email instructing me to visit for an interview. The interview was 10 minutes long, discussing my goals, interests in the position, and familiarity with the work that was done there.", "Interview Questions": "Are you familiar with any database software?"}, {"date": "5 Mar 2016", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of New Mexico (UNM, NM) in Mar 2014", "Interview Descriptions": "Skype Interview with on campus interview and job talk\r\nExpect a large number of people in the room\r\nBack-to-back interviews with multiple committees\r\nRead the job description carefully, many interview questions will reference specifics outlined in the description", "Interview Questions": "N/A"}, {"date": "20 Feb 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of New Mexico", "Interview Descriptions": "It depends on personal abilities and funding situations of the professors.", "Interview Questions": "N/A"}, {"date": "24 Sept 2015", "title": "Senior Alumni Relations Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of New Mexico (Albuquerque, NM) in Jan 2014", "Interview Descriptions": "The first step was to participate in a committee interview with the heads of many of the departments.  The final interview was with the Dean and the president of the alumni council.", "Interview Questions": "They asked me to describe a time where I had to work with a group and things did not go my way.  What was the outcome?  How did I work within the team to help us reach a conclusion."}, {"date": "13 Apr 2015", "title": "Construction Safety Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of New Mexico (UNM, NM) in Dec 2013", "Interview Descriptions": "I was interviewed by a panel of 6 staff members who represented each function of the department. Each member was asked to bring 2 questions for me and were picked in a random order. The process took about 45 minutes.", "Interview Questions": "Describe your work experience as it relates to this position."}, {"date": "8 Dec 2015", "title": "Senior Practice Managrment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Sept 2013", "Interview Descriptions": "First interview included Clinical Department Administrator, Accounting Manager and another department Revenue Director. second Interview was with Department Chair and Vice-chair.  They had a prepared set of questions provided by HR which they rotated through and each recorded their answers. It was a comfortable environment.", "Interview Questions": "Practice mananagement experience with regard to interaction with providers, my comfort level, etc."}, {"date": "3 Jan 2014", "title": "Therapist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6+ months. I interviewed at University of New Mexico (Albuquerque, NM) in Sept 2013", "Interview Descriptions": "UNM has very strict hiring practices. Interviewers must ask a specific set of questions. I interviewed twice, and both times I had two people doing the interviewing--they would alternate between asking questions and taking notes. The hiring process also took a long time...it was over six months between my interview and my date of hire.", "Interview Questions": "N/A. Read the job description very carefully. Every question I got was to test how well I met the qualifications and experience."}, {"date": "30 Jul 2015", "title": "User Support Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Jul 2013", "Interview Descriptions": "Potential employees are required to meet with supervisors. Supervisors ask questions, then attempt to write down everything you say. Be prepared to answer questions about your education, preferences and goals. How you answer questions is as important as the content you provide, so be sure to keep a calm demeanor while answering all questions. The interview is where potential candidates are categorized, so a strong performance will guarantee an offer.  The interview will take around fifteen minutes, so take your time and answer all questions completely while remaining calm.", "Interview Questions": "Describe a customer service experience from a previous job."}, {"date": "23 Apr 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of New Mexico (Albuquerque, NM) in May 2013", "Interview Descriptions": "Behavioral Interview, 5 people rotating around the table asking questions and asking participant to describe scenarios, the frustration is that it takes UNM a VERY LONG time to hire and onboard a candidate.", "Interview Questions": "Standard Behavioral Interviewing questions relating to Projects, leadership, teamwork, etc."}], [{"date": "18 Jul 2015", "title": "Attorney Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of New Mexico (Albuquerque, NM) in Mar 2013", "Interview Descriptions": "Three-panel interview, form to fill out.  They ask a lot about your interest in defending the indigent.  They respect you and treat you like an autonomous person with their own knowledge and life experiences.  You will be asked whether you are interested in representing the indigent, and whether they will respect you.  They ask about your experience as an attorney and with indigent and disadvantaged communities.", "Interview Questions": "What is your experience with disadvantaged clients"}, {"date": "6 Apr 2017", "title": "Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of New Mexico (Albuquerque, NM) in Feb 2013", "Interview Descriptions": "Submitted application online, was selected to interview. Had a committee style interview with multiple people as we all as a campus tour. This was followed by reference checks and transcript requirements.", "Interview Questions": "A fault I have"}, {"date": "31 Jan 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of New Mexico", "Interview Descriptions": "Met with professor, he asked me about my research experience and asked for four recommendation letters.", "Interview Questions": "To pick a research topic right away."}, {"date": "20 Jan 2014", "title": "Student Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of New Mexico (Albuquerque, NM) in Dec 2012", "Interview Descriptions": "Applied with university job website", "Interview Questions": "Nothing out of the ordinar"}, {"date": "25 Jul 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of New Mexico (Albuquerque, NM) in Oct 2012", "Interview Descriptions": "Very friendly and smooth, just discuss about the recent project I was working on, and my adviser talked about her project. And we decided we can work together. She gave me offer as research assistant during my master.", "Interview Questions": "basic question about smart gird, and renewable energy."}, {"date": "8 Nov 2015", "title": "IT Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at University of New Mexico in Aug 2012", "Interview Descriptions": "Interview process was very laid-back. I was interviewed by my direct supervisor and a senior colleague. They just wanted to see that you had an interest in technology, had some background in it, and were customer-service oriented. The most important thing they were looking for was motivation to learn technology and great problem-solving skills. They asked how I would troubleshoot a problem with 'X' (do not remember the problem), in order to see the steps that I would take with troubleshooting in general.", "Interview Questions": "Q: How do you keep up-to-date with technology?"}, {"date": "18 Oct 2012", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Aug 2012", "Interview Descriptions": "Very technical questions about my previous projects", "Interview Questions": "all questiosn were focus on my experience and projects i have done"}, {"date": "19 Oct 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of New Mexico in Jun 2012", "Interview Descriptions": "It was a panel interview of 5 people that lasted for about one hour. They asked a range of questions about my knowledge of the areas I would be tutoring. They gave plenty of time to elaborate on their questions. Come with references and grades obtained in areas in which you tutor", "Interview Questions": "My confidence in the areas I would be tutoring"}, {"date": "16 Oct 2016", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in May 2012", "Interview Descriptions": "One over-the-phone the interview with the hiring manager initially. Then a more in-depth in-person interview with hiring manager and two other people in the program. I was hired within a few hours of the second interview.", "Interview Questions": "Why are you interested in a job in this field?"}, {"date": "30 Oct 2012", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of New Mexico (Albuquerque, NM) in Apr 2012", "Interview Descriptions": "Online application; 2-Day interview included meeting with faculty and presenting a seminar.", "Interview Questions": "How will your research impact other research in the department?"}], [{"date": "25 Jun 2012", "title": "Research Experience In Nanophotonics Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Apr 2012", "Interview Descriptions": "It was based on my academic record and my research interests and how I could contribute positively to the group.", "Interview Questions": "What do you want?"}, {"date": "12 Nov 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of New Mexico (Albuquerque, NM) in Feb 2012", "Interview Descriptions": "I applied the phd degree online. The academic advisor review your document with some professor as a committee. They need your GPA, TOEFL if you are not an English native speaker, GRE, and your transcript and $50 application fee. Then they will contact you about their initial decision via email or on phone. Then they will consider you on waiting list of assistantship later.", "Interview Questions": "N/A"}, {"date": "22 Apr 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of New Mexico (Albuquerque, NM) in Jan 2012", "Interview Descriptions": "It was very simple, consisting largely of questions regarding background experience. Since the position is not rigorous w.r.t. background experience, it rode largely on my personality and people-skills. The best advice I could provide is to get enough sleep and just be ready to let your personality shine, as they are hiring a people-person and not hiring a skill set.", "Interview Questions": "They asked if I had any experience teaching."}, {"date": "29 Aug 2012", "title": "Front of House Floor Manager At Popejoy Hall Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of New Mexico (Albuquerque, NM) in Oct 2011", "Interview Descriptions": "Applied by posting resume, cover letter, and relevant documentation to the unmjobs website. Received email asking for interview within a month. Interviewer went over the job requirement, asked what I thought I'd be good at or have trouble with, whether I could make the time commitment, and whether I had any questions.", "Interview Questions": "Questions about personality/sociability and how you'd be likely to get along with other employees."}, {"date": "26 Oct 2011", "title": "Internal Auditor III Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of New Mexico (Albuquerque, NM) in Mar 2010", "Interview Descriptions": "Applicants to positions at UNM apply online through the UNM Jobs website.  The entire application process was lengthy and slow.  I applied on 03/04/2010, interviewed on 03/31/2010, received an offer in late May 2010, and began work in June 2010.", "Interview Questions": "13.\tIf asked to conduct a review of a newly implemented system or of an existing IT system, how would you go about planning, conducting, documenting and reporting the review?"}, {"date": "7 Apr 2013", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of New Mexico (Albuquerque, NM) in Feb 2009", "Interview Descriptions": "i was invited for an interview based on my resume. I gave a presentation and met the faculty. I was given an offer two weeks later.", "Interview Questions": "none. was a very nice experience. "}, {"date": "29 Jan 2013", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of New Mexico (Albuquerque, NM) in Jan 2009", "Interview Descriptions": "The interview was more like an orientation. Myself and 24 other students came to the headquarters on campus. We were informed of the program specifics, such as salary, a yearly stipend, and the community service the program emphasized. Later I was put into a group of 5 and we had detailed conversations about various situations tat might arise working with children. As well as situations concerning the other services they were building such as the community garden.", "Interview Questions": "The most unexpected question was when they asked what I would do if a child was destroying something at a community event."}]]