[[{"date": "24 Feb 2022", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Global Brigades", "Interview Descriptions": "Sent in Resume and video cover letter. After that, I was requested to answer two questions as if I was answering an email to a potential client. I passed that portion and had two round of interviews with different people in the organization. \r\n\r\nEasy process, however, somewhat time consuming.", "Interview Questions": "Explain the Holistic Model to me"}, {"date": "3 Nov 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Global Brigades (Athens, Athens, Attica) in Oct 2021", "Interview Descriptions": "Formal but not impersonal. I felt comfortable with the interviewee. The interview took place in person with two people, and then a follow up phone call. Overall, I felt comfortable, and felt that they were professional.", "Interview Questions": "I dont remember the exact question but it focused on my communication skills and accountability skills."}, {"date": "7 Oct 2022", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Global Brigades in Aug 2021", "Interview Descriptions": "In the first place, I had to send a small video (2') of why I'm interested in this position and why I am a good fit for the position along with providing a CV. In the next phase, I had to provide a written essay about some organization facts (kind of questions and what would-you-do scenarios) (about 2 pages). After that, I passed an interview with HR that was important as well. I got no reply for some days but then received the proposal for the salary.", "Interview Questions": "How would you describe Global Brigades to a person that didn't have an idea?"}, {"date": "23 Feb 2021", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Global Brigades", "Interview Descriptions": "Very professional and objective. I thought it was a very clear and streamlined interview process, which I know can sometimes get convoluted and long if not managed appropriately.  Felt informed and in the loop through the whole process.", "Interview Questions": "How do you see yourself in the PA role supporting the overall mission and vision of the organization?"}, {"date": "21 Apr 2020", "title": "Marketing Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Global Brigades (Logan, UT) in Mar 2019", "Interview Descriptions": "Interviewed with who I was working under and then one of the CEO's on a video call. It wasn't too difficult and everyone was super nice during the whole process.", "Interview Questions": "What would you contribute to this position?"}, {"date": "11 Aug 2018", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Global Brigades", "Interview Descriptions": "After submitting a CV in January I was asked to complete a work task in February. I returned this but didn't hear anything until I mailed again to check it was received one month later.  It was, but no decision was made at that point. I then got a generic email a few weeks later to say that things were still being processed due to volume of applications, but when I still hadn't heard back and saw the advert was once again live on the site a few weeks following this and after hearing nothing, I asked for some feedback about what I could have done better (in May)....and was invited to an interview (June)! Apart from the incorrect time being given for the interview (time zone mistake - luckily I was one hour early not late!), I think the interview was fair, the interviewer was friendly and I was provided a lot of information about the role.  I was told I'd hear back in 3 weeks (the role was due to start end of July,  just a couple of weeks after that ). I didn't hear anything, and when I sent an email four weeks later to say thank-you and ask if there were any updates, I was told I didn't get the job. I asked for feedback again a week or so later but didn't get a response. \r\n\r\nI've now seen the same role live again due to start in September and although I'd be interested in applying again, I'm not sure whether there's any point. Although the rejection email encouraged me to apply in future, the fact I wasn't given any feedback makes me think they might not be so keen on receiving applications from me in future and also makes it difficult to see where I need to improve upon last time! I think I was quite nervous in the last interview and I might feel more confident next time but...it could be that they're looking for a kind of experience which I still haven't gained a few months later. Who knows.", "Interview Questions": "Which chapter would you be most interested in getting involved with?"}, {"date": "26 Dec 2017", "title": "Chapter Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Global Brigades", "Interview Descriptions": "The interview process includes a phone screening and a couple rounds of interviews. They ask about your work experiences and are looking to see how comfortable you would be abroad", "Interview Questions": "Explain any abroad travel experiences."}, {"date": "5 May 2015", "title": "Water Brigades Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Global Brigades", "Interview Descriptions": "A phone interview with questions regarding interest, experience and adaptability to living abroad.  Conversation about the Water Brigades program, how my preparation was adequate to improve it and how I would impact its future.", "Interview Questions": "What vision do you have for the Water Brigades Program?"}, {"date": "30 Jun 2014", "title": "Chapter Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Global Brigades", "Interview Descriptions": "The process consisted of submitting a resume, written response questions, and three rounds of interviews. The written response questions served as trials and emulated scenarios that we would have to address on the job. Interviews were conducted over the phone or through video chat (Skype) by the advisor manager on the first interview, the Director of Student Affairs on the second, and two chief officers together on the last interview.", "Interview Questions": "How do you see yourself functioning in an environment where you will be living with your co-workers?"}, {"date": "19 Dec 2013", "title": "Program Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Global Brigades", "Interview Descriptions": "Interviews with about 8 different people over the course of several months. Limited feedback after the fact.", "Interview Questions": "None, they repeated themselves over and over again after the first interview. Always asked contextual and situational questions, nothing to do with experience really. "}], [{"date": "5 Dec 2013", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Global Brigades", "Interview Descriptions": "I went through 3 interviews, and all 3 consisted mostly of behavioral questions. It helps to know a lot about the organization, be really passionate about the mission and vision, and have good leadership experience. The hiring process was very long and late in the game compared to others.", "Interview Questions": "How will you adjust to a different culture? "}, {"date": "24 May 2015", "title": "Chapter Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Global Brigades in Sept 2012", "Interview Descriptions": "The interview process was not stressful. I had three rounds of phone interviews with three different current employees of Global Brigades. They asked me the typical interview questions and got to know my personality a bit. Although it was easy, it's always a good idea to prepare for interviews so you are ready to answer any question thrown at you.", "Interview Questions": "A very typical interview question - why did I want to work for Global Brigades?"}, {"date": "1 May 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Global Brigades (Panamá) in Jan 2011", "Interview Descriptions": "Fair, not too lengthy. I was approached for the role as reference by a colleague. There were two regular interviews with the management team. There wasn´t a clear interview process at the time as they were in the process of restructuring several processess. Overall the interviewers were very interested in my capacities and experience but also in my expectations within the role.", "Interview Questions": "What are you professional and personal expectations within the role?"}]]