[[{"date": "10 Jul 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "Interview process was easy and recruiter was nice. She used the star method and answer all of my questions about in boarding and benefits. It took a few days to receive offer letter.", "Interview Questions": "Tell me a time you made change in you company."}, {"date": "16 May 2023", "title": "Accounts Payable Temp Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "The interview process for this role was super easy. I was asked 3-5 questions about my previous work experience. After completing interview I heard back pretty fast in regards to being offered the position.", "Interview Questions": "Describe previous work experience as it pertains to accounts payable."}, {"date": "10 May 2023", "title": "Audio Visual Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory University (Atlanta, GA) in May 2023", "Interview Descriptions": "Applied online, scheduled a virtual call with one on one with the Associate Director (AD). After the virtual call, scheduled an onsite half day visit. 1-1 with AD over coffee. 1 Hour Session with the team (about 5 members) 1-1 with AV Tech and an audio setup 1-1 with Director of Student Center/Campus Life Tour of Student Events Area and some conference/meeting rooms", "Interview Questions": "Tell us about yourself. Why Emory University? What do you think would be the most difficult thing about transitioning into the role? How do you handle finding a way to resolve conflict?"}, {"date": "14 Apr 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Two interviews. The first one centered around getting to understand your skills and motivation, and the second one trying to determine fit. A good experience overall, and pretty smooth response times too", "Interview Questions": "Why do you want to join the lab?"}, {"date": "13 Apr 2023", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "straight forward, describe data experience, tell us about yourself, why are you a good fit for this position and what're some things you hope to gain from this role, what is your ideal work setting like", "Interview Questions": "describe your weaknesses and strengths"}, {"date": "6 Apr 2023", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "The interview was good. The interviewers asked if I had previous experience, had good organizational skills, and more. The interview lasted about one hour, and I had two additional follow-ups.", "Interview Questions": "Tell me about your organizational skills."}, {"date": "18 Mar 2023", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Emory University", "Interview Descriptions": "Great interview process! Quick response time and very transparent about their needs and my ability to serve them. Being able to speak with the 2 members from the research team, including a PI and the project coordinator was informative.", "Interview Questions": "What is my experience with data management and participant interviews?"}, {"date": "15 Mar 2023", "title": "Evaluator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Phone interview and Zoom interview, interviewers were bossy and rude. Interview was also late. Not the best experience, would not interview here again. Lecture heavy interview. Phone interview and Zoom interview, interviewers were bossy and rude. Interview was also late. Not the best experience, would not interview here again. Lecture heavy interview.", "Interview Questions": "\"Describe your perfect evaluation.\" \"Where do you see yourself in 5 years?\""}, {"date": "15 Feb 2023", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Emory University", "Interview Descriptions": "Very straight forward, polite and to the point. Asked about relevant experience and previous positions. Wanted to hear about interests in research topics and potential projects in the position. Asked about what skills you bring to the team/to the position.", "Interview Questions": "What research projects would you be interested in initiating/participating in during your time here?"}, {"date": "6 Feb 2023", "title": "Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University", "Interview Descriptions": "I had a wonderful interview with the PI, and then I had met with the lab members to see if I was a good fit for the lab. The PI was passionate about the research her lab conducts related to pediatric sickle cell mechanisms.", "Interview Questions": "What are your future goals?"}], [{"date": "2 Feb 2023", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Emory University", "Interview Descriptions": "How well did you do in the class and your relationship with the professor must be both strong and make sense for you to be a teachers assistant. If not it will be very hard to get the role but otherwise should be strait forward a meeting with the teacher and maybe a few behavioral questions", "Interview Questions": "Why do you want to be a TA"}, {"date": "18 Apr 2023", "title": "Public Health Program Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory University (Atlanta, GA) in Feb 2023", "Interview Descriptions": "The interview process was straight forth. I had two interviews where they asked standard questions about my resume, how I work with others, etc. I was offered a position on the team and accepted it tentatively based on HR's final decision. But was not given a salary and was told this would be decided by HR. HR requested 5 references and would want to hear from all of them. The team that was hiring me would also like to hear from 3 references/ a letter of recommendation. This all feels like a bit much for an entry to mid level position without at least a salary range given. Over a month later I am still waiting on a final response from HR and the team.", "Interview Questions": "Q: Why would you be a good fit for the position?"}, {"date": "21 Jan 2023", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory University", "Interview Descriptions": "It is very challenging to get a foot in the door to get an interview at Emory. If they have an internal candidate selected, the interview process may drag on with few updates. Typically, you won’t find out you were not awarded the position until everything is finalized with the preferred candidate. Their application system can make it hard to apply to multiple openings at the same time, but I am going to continue to apply to positions — it’s just a matter of finding the right match and the right person in charge of the job hunt.", "Interview Questions": "These are smart people, expect to face questions about basic program management processes, questions about how you dealt with a failure in a past job, and scenario questions. Q: Tell us about a time you went over budget."}, {"date": "14 Dec 2022", "title": "Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Way too competitive and there wasn’t a clear decision making process being shared. Did a lot of prep for the interview but there’s apparently so much competition. I wouldn’t recommend it to anyone doubting if they can stand out amongst 200 candidates.", "Interview Questions": "What makes Emory University unique"}, {"date": "2 Dec 2022", "title": "Teaching Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "The chair gave background information about the department and described the interview procedure. The interviewers introduced themselves. Each interviewer asked one question and finally opened the floor for the candidate to ask questions.", "Interview Questions": "1. What is your research focus and how does it inform your teaching? 2. (asked and answered in Chinese): Give an example of grammatical point that is challenging to U.S. students and how do you teach it 3. Given the current challenge faced in Chinese programs, what's your solution? 4. What is the core knowledge students need to learn for understanding modern Chinese society? 5. The responsibility of teaching assistant professor is mainly in teaching and service, but faculty in Emory University also conduct classroom based research. Are you conducting this kind of research now or what research in this sort do you expect to do in the future?"}, {"date": "28 Nov 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "It was conducted smoothly. The interviewer is nice and he asks me to introduce myself and share something on my resume. He also shared some insights into his career at the school.", "Interview Questions": "The most inspiring past experience"}, {"date": "19 Nov 2022", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "3 rounds, star questions, let you know the salary upfront. Went through your history and what projects you worked on. Pretty easy interview. Went by within 3 weeks they give an answer.", "Interview Questions": "What projects have you led and how did they end up?"}, {"date": "15 Oct 2022", "title": "Assistant Vice President Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Demanding interview process consisted of committee review and repetitive examination. Never was I so extensively screened for qualifications. The interviewer posits himself very endearingly. How many words does this whole description need, I just want info on AMD right now.", "Interview Questions": "What do you envision for Emory"}, {"date": "8 Oct 2022", "title": "Phlebotomist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Emory University", "Interview Descriptions": "Great question equal opportunity. They talk to you as an equal and don’t look down on you. They explain everything in full and you get to your and do a mock run if you get to phase 2 of the interview.", "Interview Questions": "What is the order of draw."}, {"date": "6 Oct 2022", "title": "Informatics Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University", "Interview Descriptions": "30 minute interview with manager and then an hour long with 4(!) staff members. Never heard back, completely ghosted. Gave 1.5+ of my time, a stock email rejection would be nice.", "Interview Questions": "Asked some questions on how I'd reform some basic SQL queries (SELECT, UNION, etc). Would be much better if they had a way to test that knowledge in a practical way."}], [{"date": "3 Oct 2022", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Pretty standard. The interview involved hiring manager + team. The process took a few weeks; month from start to finish. Experience definitely variable based on things like role, location, and department. ", "Interview Questions": "What are your strengths and / or weaknesses?"}, {"date": "13 Dec 2022", "title": "Associate Director of Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory University (Atlanta, GA) in Oct 2022", "Interview Descriptions": "Overall, it was a long and thorough process, lasting a couple months, but that's to be expected with academia. It began with an introductory call over Zoom with the hiring manager. Within a week, I had two 30-minute interviews with a panel of three employees each. After a few weeks, I had another Zoom call with the hiring manager to check-in. Then, another round of interviews with other employees. The hiring manager was transparent later in the process that I was a finalist, however I did not receive an offer.", "Interview Questions": "Tell me about your experience in the field."}, {"date": "16 Jan 2023", "title": "Sr. Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA) in Oct 2022", "Interview Descriptions": "A lot of situational questions. Just be prepared by practicing your answers. A lot of questions will be answered from your experience. The questions are not that difficult if you are prepared.", "Interview Questions": "What was the one thing you would do over in your last job to correct."}, {"date": "19 Sept 2022", "title": "Project Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "The process included 1 interview with the supervisor of the research project. I was asked basic interview questions and questions related to the role. I was asked to rate my skill level on certain skills from 1 to 10. Be prepared to discuss your work experience and skill levels.", "Interview Questions": "On a scale of 1 to 10, rate your skill level in the following areas?"}, {"date": "17 Sept 2022", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "I had 5 interviews over the course of 2 weeks. It was friendly and open with little pressure. The interviewers (a total of 15 across all interviews) asked a mix of professional and outside-of-work questions including hobbies and goals. ", "Interview Questions": "Is there any part of the requirements for the job posting that you will have difficulty meeting?"}, {"date": "10 Feb 2023", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Emory University (Atlanta, GA) in Sept 2022", "Interview Descriptions": "they first let me introduce myself and asked several Behavior questions regarding my background experience. and then I was asked some technical questions about survival analysis that was related to the lab that I was applying.", "Interview Questions": "Describe one experience when you have trouble solving a challenge."}, {"date": "16 Mar 2023", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Emory University in Aug 2022", "Interview Descriptions": "The interview process for a student ambassador at the emory police department is primarily behavioral. They will ask questions like your interests, run me through your work experience, etc. They want to see if you fit the small team well.", "Interview Questions": "What could you contribute to the team?"}, {"date": "19 Jul 2022", "title": "Research Fellow Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Straightforward and fairly thoughtful. Lots of introspection required both before and after the process, which was neither too long nor too short considering the position was for a yearlong opportunity", "Interview Questions": "Describe your weaknesses in three words"}, {"date": "14 Jul 2022", "title": "Assistant Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University", "Interview Descriptions": "Submit my application through Emory Career and wait for the response. \r\nRound 1: Interview with supervisor (30 min talk)\r\nRound 2: Meet department heads individually (3 hours in total) and give a public presentation (45 min plus Q&A)", "Interview Questions": "Introduce yourself\r\nWhy do you want to work here\r\nWhy did you leave your previous job\r\nDo you have any plan to improve yourself here"}, {"date": "10 Jul 2022", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Emory University", "Interview Descriptions": "Zoom interview that took approximately thirty minutes. Single interviewer that asked approximately five different questions, and opened up to questions that I had.  The interview lasted approximately thirty minutes and was pretty simple.", "Interview Questions": "Why are you interested in this position?"}], [{"date": "23 Jun 2022", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory University", "Interview Descriptions": "I was called for a virtual interview with my direct lead about two weeks from applying for the position. The hour conversation was pleasant and natural. The second interview was later that week with a department colleague - also virtual and similar in nature in terms of dialogue feeling conversational and organic, while still holding space for roles and responsibilities. I was offered the role by phone two weeks following the last interview.", "Interview Questions": "Tell us your trajectory - what themes presented itself that led to you  applying for this role. \n"}, {"date": "1 Jun 2022", "title": "Testing Site Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Smooth process.  Interview was timely and questions were appropriate for the role. Feedback provided within 24 hours post interview to keep the process moving forward.   Ask questions to understand role completely.", "Interview Questions": "How do you value customer service?"}, {"date": "15 Jun 2023", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Jun 2022", "Interview Descriptions": "Average, situation-based questions. Ask about terminology that's relevant to the position, will ask culture-fit questions as well as what you bring to the table. The company did not get back to me.", "Interview Questions": "Q: What makes you a good fit for the company?"}, {"date": "3 May 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Phone screen and panel behavioral interview.  Please do research on the organization and the role. Make sure you have prepared questions that align with the job duties. Make sure you also understand the department you are interviewing for.", "Interview Questions": "Why am I interested in this role?"}, {"date": "14 Jul 2022", "title": "Senior Assistant Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University in May 2022", "Interview Descriptions": "The interview process for me was 4 separate steps. \r\n1. Initial phone interview (approx 15-20 mins)\r\n2. Secondary video interview (approx 45 mins)\r\n3.  Panel Interview (45mins - 1 hr)\r\n4. Interview with Executive Director (approx 30 mins)\r\nAfter all interviews were completed, was also asked to complete a writing assignment - spent several hours over the course of a 3-4 days. \r\nFollowed 2 weeks later and was informed they selected an internal candidate who they noted had a \"considerable edge\"\r\nAll the staff I interviewed with were very pleasant and generally responsive, but quite disappointed that they took me through the entire process when there was an internal candidate for which they knew had a large advantage over an external candidate. Ultimately, felt like it was a waste of my time and effort.", "Interview Questions": "What is one of your weaknesses/strengths?\r\nWhy are you interested in this position?"}, {"date": "20 Apr 2023", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Emory University (Atlanta, GA) in May 2022", "Interview Descriptions": "Easy interview to get to know you. Asked about previous job/ clinical experiences. Was informed about salary, expectations of each clinic, and caseload. Shadowing at different clinics was part of the process to get to know the different clinics in Atlanta.", "Interview Questions": "What type of patients did you see during your past jobs/clinicals?"}, {"date": "18 Apr 2022", "title": "Student Stacks Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Long, but straightforward.  Got a long description of the duties of stacks work. You pretty much just need to listen and agree to the job. You don't have much to worry about.", "Interview Questions": "If you're willing to work the job. "}, {"date": "5 Apr 2022", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory University", "Interview Descriptions": "I applied through their system online, and set up an interview 2 weeks later. I completed the interview, and was given an assignment to complete. After completing that assignment I heard back within a month.", "Interview Questions": "How does this position line up with your career goals?"}, {"date": "21 Mar 2022", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Once app was submitted it took a couple of weeks to receive a response.  Had phone screening and then did interview with hiring manager.   Background Check was conducted.  Start date given.  Training was provided where applicable.", "Interview Questions": "N/A"}, {"date": "12 Mar 2022", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University", "Interview Descriptions": "Asked why do you want to be a TA? What was your favorite part about the class? How would you improve the class? What was your least favorite part of the class?", "Interview Questions": "Tell me a bit about yourself? "}], [{"date": "20 Jul 2022", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 months. I interviewed at Emory University (Atlanta, GA) in Mar 2022", "Interview Descriptions": "This was for a temporary role so it may look different from a full-time position. I joined on a Zoom call after I sent in my application to the Emory University job portal.", "Interview Questions": "They asked me what administrative experience I had. \r\n\r\n\"Tell me about yourself.\" \r\n\r\n\"What is your learning style?\"\r\n\r\n\"Why do you want to work at Emory?\""}, {"date": "8 Mar 2023", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Emory University in Feb 2022", "Interview Descriptions": "I had three separate, back-to-back interviews with biostatistics professors. They asked me about my previous research, why I want the Ph.D., and why I think I can finish the program when I haven't had a break from school in years.", "Interview Questions": "What do you want to do with the PhD?"}, {"date": "24 Apr 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory University (Atlanta, GA) in Feb 2022", "Interview Descriptions": "I applied in February and received a phone call from the employer a month later. The first interview was a phone interview about my past experience related to this position. The second interview was a virtual interview with a program team-member / group meeting.", "Interview Questions": "What is your weakness and strength?\r\nHow would you deal with conflict? \r\nWhere do you see yourself in five years? "}, {"date": "4 Dec 2022", "title": "Advancement - Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Feb 2022", "Interview Descriptions": "The interview process was straightforward. The panel seemed to be very engaged and had a willingness to learn more about my experience. There was a phone screen and then a panel interview with approximately six panelists.", "Interview Questions": "Why Emory University and what do you know about this organization?"}, {"date": "19 Jul 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Emory University (Atlanta, GA) in Feb 2022", "Interview Descriptions": "There is one round with the professor you will be working with. In my case it is a finance professor and mainly asking coding questions in SQL. There are 4-5 questions in total and they are all pretty basic. After that you need to express your interest in the job, like why research in this field as well as speaking on your background.", "Interview Questions": "How would you query any 10 results from the database?\r\n\r\nHow do you join these 2 tables?\r\n\r\nHow do you count columns?\r\n\r\nHow do you find values similar to \"ABC\"? (use LIKE operator)"}, {"date": "20 Jan 2022", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 8 weeks. I interviewed at Emory University", "Interview Descriptions": "The initial interview was with the dean and two members of the team. They made the experience more of a conversation rather than round robin of questions and they were all so nice. They gave a clear outline of their timeline and instructions on the process. They were also quick to respond and offered thoughtful feedback. I didn't have as much experience as some other candidates so I wasn't offered the position but they did ask me to apply for another position on their team.", "Interview Questions": "What specific experience do you have assisting students with the pre-health application process?"}, {"date": "20 Jan 2022", "title": "Development Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "The interview process was smooth. I had a phone screening, 1 to 1 interview and a panel interview (all virtual.) Due to pandemic the time the time from application to acceptance was about 10 weeks.", "Interview Questions": "How do you manage your day to day workload?"}, {"date": "16 Jan 2022", "title": "Chief Business Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University", "Interview Descriptions": "Initial telephone interview with recruiter; asked about experience, career goals. Asked for real life examples of projects, responsibilities, and professional experience that related to role for which I was interviewing", "Interview Questions": "What previous experience related to the role."}, {"date": "2 Mar 2022", "title": "Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Emory University (Dallas, TX) in Jan 2022", "Interview Descriptions": "I was interviewed by an Emory alumni, and she asked a variety of questions.  I was honored to be selected because not everyone gets an alumni interview.  This was actually my first interview and she asked a variety of questions.", "Interview Questions": "How would you improve the community?"}, {"date": "7 Dec 2021", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory University", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire.", "Interview Questions": "Why do you want to study here?"}], [{"date": "15 Nov 2021", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "~the interview was approximately 6 hours ( including lunch) where I met with various faculty members. The purpose was to see whether I had overlapping research interests and to learn about opportunities for collaborations", "Interview Questions": "Why do you want to work here? "}, {"date": "13 Nov 2021", "title": "Intramural Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Emory University", "Interview Descriptions": "In person interview with the director of intramural and club sports. Majority of the questions involved current and past experiences, perceived skillsets, and how I would respond to various situations. Additional questions were about goals and expectations. Current employees were also present during the interview.", "Interview Questions": "What would others say is your greatest strength and weakness? What would you say is your greatest strength and weakness?"}, {"date": "3 Nov 2021", "title": "Lab Prep Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "No interview, personal connection. I enjoyed taking the BIOL class with my professor and asked her if I could get a job on campus. She then offered me the position.", "Interview Questions": "Why do you want to work here?"}, {"date": "1 Nov 2021", "title": "Secretary Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Challenging but worth the time.  Interviewed with multiple people who seemed excited about their jobs.  Very friendly and motivated and determined to get the right fit.  Not rushing the process but taking time to find the right fit for the department.", "Interview Questions": "Why do you want to work here. "}, {"date": "27 Oct 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "How did you find out about this position?\r\nWhy are you interested in working as a research assistant?\r\nWhat are your long-term career goals?\r\nWhy do you want to work for this organization?\r\nDescribe a time you overcame a challenge at work.\r\nWhat are your greatest strengths?\r\nWhat skills are you working to improve?\r\nTell me about your hobbies.\r\nHow would previous colleagues or classmates describe you?\r\nWhat do you find interesting about research assistance?", "Interview Questions": "Tell me about your background"}, {"date": "6 Oct 2021", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Need to be very knowledgeable of the mission process. Must be experienced and must possess excellent people skills and be multiculturally aware. Speaking another language other than English is a plus and necessary skill.", "Interview Questions": "How may you assist a non-English speaking candidate to have access to our medical research team?  "}, {"date": "5 Oct 2021", "title": "Post Doctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Friendly in general. It involved a presentation followed by technical questions.  Afterwards had the opportunity to meet with peers and students individually after lunch with the boss and senior researchers in the lab.", "Interview Questions": "Challenges faced and how you dealt with it? "}, {"date": "30 Sept 2021", "title": "MBA Applications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Fairly simple. They ask behavioral questions and how would apply past learnings in the MBA. Another important one is how do you plan to contribute in class. Interviews lasts about 30 minutes", "Interview Questions": "How will you contribute to class learnings?"}, {"date": "18 Apr 2022", "title": "Medical Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory University in Oct 2021", "Interview Descriptions": "I applied via the online portal and heard back he next day. Had a phone screening, an interview with the hiring manager, then four panel interviews with 2-3 people, which lasted an hour. \n\nI was told the final step was going to be just a reference-checking. When that was completed, I was ghosted by the hiring manager; I emailed her twice and got no response. Very professional, right? \n\nThe hiring portal still says that I'm, \"under consideration\". I'm not interested in working for such rude and unprofessional individuals. I'm attempting to delete my online profile, but even they aren't being cooperative about that!", "Interview Questions": "Tell me about yourself?\nWhat is your weakness?\nWhat do you like to do for fun?\nWhat is passive voice?\nHow many publications do you have?\nWhy are you leaving your current position?"}, {"date": "14 Sept 2021", "title": "Dinning Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "It was great and very easy to do. The people were nice who did the interview and very informative about job position. The managers were nice and overall I had a great interview experience.", "Interview Questions": "What makes me different from other applicants"}], [{"date": "12 Sept 2021", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "It was firstly at conference meeting and half an hour interviewing with four future colleagues and then an onsite job talk. The job talk was a full day meetings with everyone in the department and several college leaders.", "Interview Questions": "What areas are you good and comfortable for teaching"}, {"date": "8 Sept 2021", "title": "Legal Department Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Zoom met with lots of supervisory staff and laterals, very friendly at first, then judge-y and political, you'd better be on the right side of politics or you don't stand a chance.", "Interview Questions": "Resume coverage and experience questions"}, {"date": "1 Sept 2021", "title": "HR Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "The interview process was fairly easy.  The first was a phone conversation, and then an in-person interview.  A lot of references are requested. The references are also required to provide a lot of information.", "Interview Questions": "Tell me about your background."}, {"date": "4 Sept 2021", "title": "Student Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Emory University", "Interview Descriptions": "Quite casual as it was for an undergrad student position. \n\nAfter receiving a follow up email with an invitation to interview, I met with the Research Assistant of the lab who asked a couple of typical interview questions. She gave me a brief tour of the lab and the responsibilities of the position. Afterwards, we me briefly with the professor which was when I was formally offered the position.", "Interview Questions": "Why are you interested in research?"}, {"date": "23 Aug 2021", "title": "Nursing Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "I first applied online at Emory Careers. The interview was via Zoom call (because of current quarantine). The interview was by the Unit Director. I was asked how I work in fast paced environments, what was a time I experienced conflict at work & how I solved it, and why I want the position as the Unit Clerk.", "Interview Questions": "How do you work in fast paced environments?"}, {"date": "5 Aug 2021", "title": "Wellness Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Very involved. Highly engaging. Group interviews with many people. Very flexible to work with on zoom calls. Have lots of information on the company as a whole. Used basic interview questions.", "Interview Questions": "Why do you want to work for Emory. "}, {"date": "2 Mar 2023", "title": "Student Digital Life Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory University in Aug 2021", "Interview Descriptions": "Very straight forward, they ask basic interview questions. Preparation did not take too long. Make sure you can speak on your experiences on your resume and explain why you are a good fit for the job.", "Interview Questions": "Tell me about yourself, why do you want this position, what does good customer service look like to you."}, {"date": "9 Dec 2021", "title": "Screener/Greeter Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory University (Atlanta, GA) in Aug 2021", "Interview Descriptions": "Interviewed once over the phone, lasted 20-30 mins. Was pretty smooth, asked about work history and gave good description of job title. They were clear about it being a temporary contract job.", "Interview Questions": "How do you work with and handle upset visitors/patient?"}, {"date": "26 Aug 2021", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Aug 2021", "Interview Descriptions": "Completed 3 virtual interviews which seemed very promising and was going to get a call back or email about 4th interview then the manager of the department went ghost! I emailed twice and nothing! That was a terrible thing exp. But I expected that from Emory", "Interview Questions": "Tell me about yourself and background"}, {"date": "19 Jul 2021", "title": "Accout Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "The interview process was normal. I had a total of 3 interviews. Two of the interviews were panel. I enjoyed the interview process. Everyone I met was personable.  They asked several questions from behavioral to technical.", "Interview Questions": "Why do you want to work here?"}], [{"date": "6 Jul 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "I was called to ask questions about my interests in being a researcher and I was asked questions about my research in cosmology related to dark matter and Bose-Einstein condensate", "Interview Questions": "Tell us more of the most recent project that you have been working on"}, {"date": "4 Jul 2021", "title": "Nurse Residency Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Emory University in Jun 2021", "Interview Descriptions": "I was sent a link to sign up for my desired specialty. The interview took place over Zoom. The interview consisted of many scenario-based questions, and the last ten minutes was time for me to ask the interviewer questions. The interview lasted about 30 minutes.", "Interview Questions": "How did you prioritize patient care?"}, {"date": "21 May 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Emory University", "Interview Descriptions": "I had two initial one on one interviews with two different individuals to start. Then they scheduled me for 7 more interviews with 20+ interviews over a two week span. The interviews were extremely early in the morning (before business hours), and I had no say so in the scheduling. The dates and times were sent to me in a list. The interviews were extremely awkward. I found the interviewers to be ill-informed about the job. A long time later, I’ve heard nothing else from HR or the hiring manager.  The whole experience soured me on the organization.", "Interview Questions": "What is your leadership style?"}, {"date": "10 May 2021", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Quick, not a lot of questions asked. Very basic.  Phone interview.  A second phone interview followed.  Very general questions from both HR personnel.  The first one lasted about 15 minutes.  The second one lasted about 25 minutes.", "Interview Questions": "General questions.  How do you deal with difficult customers, tight deadlines, etc."}, {"date": "24 Jun 2021", "title": "Pre College Community Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emory University (Atlanta, GA) in Apr 2021", "Interview Descriptions": "there was only one interview and I basically knew I got in by the end of the interview. The interview was about 40 mins with the assistant director of the program who I will be working with later.", "Interview Questions": "tell me about (a certain part of resume)"}, {"date": "16 Mar 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "It was 30 mins in total. 2 Interviews were very nice to talk to. The whole process was quite easy and relax. Just tell about your past experience and some common behavioral questions.", "Interview Questions": "What is your most difficult project?"}, {"date": "30 Mar 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University (Emory University Post Office, GA) in Mar 2021", "Interview Descriptions": "Described their research and discussed my qualifications for the job. Discussed their objectives and why they are interested in in taking on another lab member. Was invited for a lunch interview and lab tour, where I learned more about their research.", "Interview Questions": "How does your background make you qualified for this position?"}, {"date": "8 Jun 2023", "title": "Writing Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA) in Mar 2021", "Interview Descriptions": "- Group interview (4 interviewees, 2 interviewers) - Everyone takes turns answering the same questions. - They prefer that each interviewee be the first to answer one of the questions.", "Interview Questions": "How have you supported race, equity, and inclusion in your life?"}, {"date": "15 Feb 2021", "title": "Senior Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "Long but good - met with three different panels, including team members. Everyone was very nice, and it helped me get a good idea of what it'd be like to work there.", "Interview Questions": "Why do you want to work here?\r\n\r\nWhat makes you the best candidate for the job?"}, {"date": "15 Feb 2021", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Email to request an interview with availability. Schedule a phone interview and then if the recruiter likes you usually you will go to the department administration to interview. From start to finish it was all down very quickly and friendly and pretty straightforward.  Emails back and forth, phone calls if needed to follow up.", "Interview Questions": "what interested you in the position?\nCan you walk me through your cv? "}], [{"date": "2 Feb 2021", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Emailed professor posting the job after getting a lead from a friend. Interviewed on a Thursday and a Tuesday. Generally cordial exchanges. Received a job offer the following week. Onboarding process took longer than either interview step.", "Interview Questions": "Where do you see yourself in five years."}, {"date": "16 Jan 2021", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "After applying online, got email from hiring team. First was a phone screening. After that virtual onsite on Zoom with two 1 hour long interviews. First one was for frontend and second was backend.  I think I answered all the questions correctly on frontend. For backend, mostly they asked if you have worked on specific technologies. Unfortunately after a few weeks got rejection email.", "Interview Questions": "Explain Closure in JavaScript.\r\nReact Hooks\r\nHave you worked on PHP"}, {"date": "11 Jan 2021", "title": "Bioinformatics Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "It was short and to the point. There was the first and most important round with the hiring manager. It included technical and behavioral questions. Next round was a meet and greet.", "Interview Questions": "Give your strengths and weakness - 3 each"}, {"date": "18 Oct 2022", "title": "Academic Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory University (Atlanta, GA) in Jan 2021", "Interview Descriptions": "Decent interview process, was able to meet staff and higher ups in a comfortable setting. About 3 rounds of interviews in order to get a feel for the team and how you fit", "Interview Questions": "How do I handle assisting multiple faculty and departments?"}, {"date": "18 Dec 2020", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Emory University", "Interview Descriptions": "The interviewer asked about my personal information, professional skills and the reason for this position. Then, he asked me some basic statistical questions. Finally, I asked him what I can get in the position.", "Interview Questions": "What does the p-value mean in t-test?"}, {"date": "9 Dec 2020", "title": "Applicant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "The interview process was prompt, orderly, and friendly. Explanations and directions were provided for each next step in the process, was a longer process than usual due to the current pandemic.", "Interview Questions": "still in the interview process"}, {"date": "31 Oct 2020", "title": "RN MICU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University", "Interview Descriptions": "Panel interview, hr calls for the offer, two day turn around, two day offer decsion, unit director and charge nurse was present during the interview. Very nice and detailed about the unit", "Interview Questions": "Tell me about your hardest patient, how did you dea with them? "}, {"date": "26 Oct 2020", "title": "Analyst Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "It was a very layered process but overall good. They do ask for a writing sample to see how you respond to customer service items. This job does have a lot of written correspondence, so how you write is very important.", "Interview Questions": "How well do you work in a group?"}, {"date": "23 Oct 2020", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "The interview process was fairly lengthy. There was an initial screening with the HR manager followed by a virtual zoom meeting with the hiring supervisor and two follow up in person interviews with the division administrator and director of the program/division.  It was extremely well organized and they responded with interview feedback within two days.", "Interview Questions": "What experience do you have that qualifies you for this position?"}, {"date": "20 Oct 2020", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Very fun and helpful.  I really felt as though I was listened to thoroughly and given a solid chance to succeed. I wish to be able to get another shot at this company though.", "Interview Questions": "What is your medical background?"}], [{"date": "8 Oct 2020", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Very straightforward and communicative - supervisor gave a brief but clear description of the process going forward. Nice to know ahead of time what it would look like. Very nice and easy to get through.", "Interview Questions": "Tell us about a time you handled a conflict."}, {"date": "7 Oct 2020", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Emory University (Atlanta, GA) in Oct 2020", "Interview Descriptions": "Coordinators and interviewers were extremely friendly and understanding. It felt like a conversation instead of an interview, which allowed me to be more comfortable/relaxed. There was plenty of questions - some hard, some expected, but everyone seemed very supportive of each other.", "Interview Questions": "What challenges do you anticipate for this position?"}, {"date": "20 Oct 2020", "title": "Regustered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA) in Oct 2020", "Interview Descriptions": "The interview process was easy and efficient. The questions were flowing and the interviewer was knowledgeable about the unit. Still waiting to hear back about whether or not I got the job.", "Interview Questions": "What do you know about working on this unit?"}, {"date": "14 Sept 2020", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Emory University", "Interview Descriptions": "Nerve-wracking. They asked why do you want to be part of the team of RA's. What makes you special at communicating with students? What positives can you bring to the table? Standard questions. If you place an emphasis on students you will be better off.", "Interview Questions": "What do you like about being part of the Emory community?"}, {"date": "11 Sept 2020", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "I got a call back after 1 week and the interview was pretty casual. Interviewer was very friendly conducted the meeting with an upbeat manner. It was more conversational than it was question and answer.", "Interview Questions": "What is one strength and one weakness?"}, {"date": "1 Dec 2021", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University in Sept 2020", "Interview Descriptions": "2 rounds of interviews. The first interview was with the hiring manager and the second interview was with Team. General questions about previous work experience and a basic SQL assessment.  The process is simple and response is quick", "Interview Questions": "Basic SQL questions, and knowledge about healthcare data "}, {"date": "1 Aug 2021", "title": "Senior Customer Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory University in Aug 2020", "Interview Descriptions": "Easy and simple. No curve balls whatsoever. As long as you prepare for a simple behavioral interview, you should be fine. The interview was scheduled for 30 minutes with a portion set up for Q&A afterwards.", "Interview Questions": "Would you say that you are detail oriented?"}, {"date": "17 Jul 2020", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emory University", "Interview Descriptions": "2 rounds with one with HR then department. Then moved on to the program director and team. Pretty thorough with questions and had a lot of job specific questions. Provide solutions.", "Interview Questions": "Describe your background\r\nDescribe a time you had to do this"}, {"date": "24 Dec 2020", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA) in Jun 2020", "Interview Descriptions": "I was contacted to set up a phone call interview. My interviewer was very friendly and asked a good amount of questions. I was called a few hours later and offered the job.", "Interview Questions": "What department do you see yourself working in and why?"}, {"date": "30 Jul 2021", "title": "Writing Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory University (Oxford, GA) in May 2020", "Interview Descriptions": "The questions were very purposeful in detecting whether or not you would be a constructive teacher of writing. I have been both the interviewer and the interviewee so I can say all questions are fair and not difficult to answer, especially if you just answer honestly.", "Interview Questions": "I can't remember but it was basically about your background in writing! Everyone has one, especially as a college student. "}], [{"date": "17 May 2021", "title": "Research Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Emory University (Atlanta, GA) in Feb 2020", "Interview Descriptions": "The interview involved people within the lab asking me a series of questions regarding my prior experience as well as questions regarding the field and my future plans. They listed out what i would expected to be doing on a day to day basis.", "Interview Questions": "What scientific techniques have you used in the past? "}, {"date": "27 Sept 2020", "title": "Resident Advisor (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Emory University (Atlanta, GA) in Feb 2020", "Interview Descriptions": "You are assigned to a group upon arrival, and you do an icebreaker to start. Then, you go into a group interview or your 1:1 interview, which ever your group has first. I heard back in about a week.", "Interview Questions": "What does integrity mean to you?"}, {"date": "16 Feb 2020", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA) in Jan 2020", "Interview Descriptions": "I applied online through portal and received call next day in morning for personal interview.\r\nI did really well in the interview but did not receive any call.\r\ni interviewed with 4 ppl.", "Interview Questions": "Basic Question\r\nWhat are your goals\r\nwhy Emory\r\ntell me something about yourself\r\nwhat ethics do you have in you."}, {"date": "4 Mar 2021", "title": "Human Resources Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory University in Jan 2020", "Interview Descriptions": "very easy, and it went very well. Panel  of 4 people. each ask me a questions.    vvv mmm mmm nnn mmm mmm '   mams yoyr mom  I know the answe yes it was feasible thank you", "Interview Questions": "how do you describe your work ethic"}, {"date": "12 Dec 2020", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA) in Jan 2020", "Interview Descriptions": "It was okay. They paid me to fly out there and put me up in their hotel. People were kind enough. I did not get the job so I have not much to add.", "Interview Questions": "What is your goal in 5 years?"}, {"date": "4 Dec 2019", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory University", "Interview Descriptions": "I have had two different interviews at Emory of the last year - both for Director positions.  The people I spoke to were pleasant and the process was moving into later rounds.  However, Emory seemed to be very elusive when it came to disclosing compensation ranges.   I explained that compensation is one of the factors I consider when looking into a role. I also explained I didn't want to waste their time and go through the process if my expectations couldn't be met.", "Interview Questions": "The asked the basic stuff: What do you want this role? Why do you think it would be a good fit?"}, {"date": "24 Oct 2019", "title": "Regulatory Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory University", "Interview Descriptions": "Setting up the interview was fine (average) and the interview itself was a little difficult. A lot of personal behavioral questions with some skills question mixed in. Overall, it was okay but I still felt anxious after it was over.", "Interview Questions": "How do you deal with difficult coworkers or teammates?"}, {"date": "8 Oct 2019", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA) in Oct 2019", "Interview Descriptions": "I was called 2 weeks prior to interview. I was surprised they didnt ask for a phone interview. They sent me an email to confirm where I needed to come. Interview was nerve wreaking, only because I was nervous anyways. They did give me time to think the questions over.", "Interview Questions": "Why do you want to work for Emory."}, {"date": "8 Aug 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Emory University", "Interview Descriptions": "Very easy. It was first a phone interview and then I was immediately offered an in-person interview to see if it was a good fit for me. Nice team and welcoming environment", "Interview Questions": "Q: What are your qualifications?\r\nQ: What is your research and clinical experience?"}, {"date": "1 Aug 2019", "title": "Communications Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "Phone interview followed by 2 hour in-person interview. The first hour involved meeting with the hiring committee and the second hour was one-on-one with the person that this role reported to.", "Interview Questions": "What writing experience do you have?"}], [{"date": "22 Sept 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Emory University (Atlanta, GA) in Aug 2019", "Interview Descriptions": "The process was relaxing and fun, asked a few questions about the past research experiences and some behavior questions.  Then the interviewer asked about my career goal and what I want to get out of this position.", "Interview Questions": "Describe your past research experience."}, {"date": "22 Sept 2019", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Jul 2019", "Interview Descriptions": "It was two phases. One was a phone screen and then the second was an in person interview. I’d advise for you to be prepared for you’re phone screen. They will call you randomly and ask you if you have time to talk about the position you most recently applied for. If you can’t remember or just aren’t on your toes when speaking with a hiring manager it could look bad. So if you see any number you do not recognize calling you after you have applied to Emory don’t answer. Let it go to voicemail and the manager will leave you a detailed message about why they called. Then you can go back and research the position in detail then call back. The in person interview was super lax. Emory is very lax in general. They are down to earth and treat you like family. The interview process is very chill. It is hard to decipher if you are a good fit by how chill they are. With this being sad stand out. Bring extra copies of your resume. Have a business notepad. Take notes, ask MANY questions. Show them you are super chill, but very professional. I think part of their process is too see what your standards are and since they are intentionally chill, and you follow the lead of being that way also it can come off unprofessional.", "Interview Questions": "Q. Why did you pick this position \r\n\r\nQ. What are your strengths and weaknesses\r\n\r\nQ. What is your five year plan?\r\n\r\nQ. Tell us about yourself? \r\n\r\nQ. What can you bring to the table?\r\n\r\nQ. Tell us about your experience and how it relates to this position."}, {"date": "29 May 2019", "title": "Clinical Research Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University", "Interview Descriptions": "30 minute phone screen, and one to two in-person interviews, first with team, then with one of the Principal Investigators. Interviews consisted of discussing the position, highlighting relevant past experience, and asking any questions about the work environment/fit.", "Interview Questions": "Describe your relevant work experience."}, {"date": "22 Jun 2019", "title": "Senior Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Emory University in May 2019", "Interview Descriptions": "The interview process was typical.  I was told that the position needed to be filled , \"as soon as possible\".  That being stated, after the interviews, the communication ceased.  Seven weeks after the first interview and five weeks after the final interview and only after sending an email did I receive a generated email that I was no longer being considered.  \r\n\r\nEveryone was perfectly kind and I would have been pleased to work for the University. \r\nI do make a decision in working for an organization/business by the quality of their communication.  I have since withdrawn my other job applications from Emory.\r\n\r\n(1)  Phone Interview Screening\r\n(2) Zoom (telepresence) Meeting with Executive (Dean)\r\n(3) Zoom (telepresence) Meeting with HR which included other Sr. Admins", "Interview Questions": "Describe a \"bad\" day at work.\r\nTypical team work, knowledge of software applications, etc."}, {"date": "16 Jul 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Emory University (Atlanta, GA) in May 2019", "Interview Descriptions": "It was a phone interview. I was really nervous but PI was very straightforward. She first asked what I was looking to get out the job and where my interests lies. Then she explained her interests and we thought about how to combine them.", "Interview Questions": "What are some of your research interests?"}, {"date": "18 Dec 2019", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Emory University (Atlanta, GA) in May 2019", "Interview Descriptions": "Pretty brief.m interview.  Didn’t prepare much.  Met with the dean and then the team of two people.  Wasn’t really sure what to prepare but i made a calendar of proposed events.", "Interview Questions": "Why do you want to enter into higher ed administration "}, {"date": "25 May 2019", "title": "Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emory University (Atlanta, GA) in Mar 2019", "Interview Descriptions": "Made me feel very welcomed and at ease. I was super nervous and the two people who interviewed me assured me there was nothing to be nervous about. They sit you down and go through your resume to compare it to what they need. They asked me to elaborate on some of my past experiences and my education. They also take you through the workplace to see if you’re comfortable working there.", "Interview Questions": "What are your goals?"}, {"date": "30 Mar 2021", "title": "Resident Advisor (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA) in Mar 2019", "Interview Descriptions": "There is a two-step process: one individual and one group interview. Both are conducted extremely well and they make sure to be extremely welcoming and easy-going throughout the process. Questions are not hard and I was never taken off guard.", "Interview Questions": "If you have previous experience, they will almost certainly ask what made you successful in you previous position as well as what you struggled with and how you have worked on overcoming it."}, {"date": "26 Jan 2021", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University in Feb 2019", "Interview Descriptions": "I had a phone interview with the manager and it was more about myself and past my experiences and my technical skills. They asked me what was my previous projects and few behavioral questions", "Interview Questions": "Why do you want to work with us?"}, {"date": "16 Jan 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA) in Jan 2019", "Interview Descriptions": "Had a phone a phone call interview. Call went very well and detailed .  Main questions were about experiences in clinical research and how I can bring it all to the job at Emory.", "Interview Questions": "Q: What experience do you have to bring to Emory?"}], [{"date": "16 Dec 2018", "title": "Network Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Apply through Emory's job website but the job is posted for only a few days at a time. Wait for the manager to reach out and visit the office for an interview. It lasts only one day so you'd know on or after the day.", "Interview Questions": "N/A"}, {"date": "7 Feb 2019", "title": "ED RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory University (Atlanta, GA) in Nov 2018", "Interview Descriptions": "Interviews over the phone then I had an appointment one week later and offered the job 3 weeks after that. I took tour of the ED and that was all", "Interview Questions": "How do you handle stress "}, {"date": "22 Nov 2018", "title": "Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Emory University (Atlanta, GA) in Nov 2018", "Interview Descriptions": "Very Easy Interview the Process was smooth the lady was very nice and Professional no hard questions to answer just waiting on a call back now  it take about a week to process everything", "Interview Questions": "Do you like Cleaning?"}, {"date": "24 Jun 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory University (Atlanta, GA) in Oct 2018", "Interview Descriptions": "1. Complete application online and email the project coordinator\r\n2. Interview with senior research staff (two senior research staffs) \r\n3. Wait for their follow up \r\n4. Talk with Project manager and other staff", "Interview Questions": "Do you have any experience using creativity to solve task works?"}, {"date": "30 Sept 2018", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Emory University (Atlanta, GA) in Sept 2018", "Interview Descriptions": "I applied for the program coordinator in June  2018 and was contacted in early Aug for an interview. They were accommodating of my schedule and were able to meet with me after hours. I was asked some STAR questions and normal questions. I was asked for a follow up interview and was offered the position a few days later mid Sept. Over all a long process but worth it.", "Interview Questions": "Tell me about a time you disagreed with a coworker and how you handled it."}, {"date": "9 May 2022", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Sept 2018", "Interview Descriptions": "It was casual and comfortable. They asked about skills and if I thought I would be a good fit. I was given a chance to ask as many questions as I wanted as well as shown around the office.", "Interview Questions": "They asked me why I wanted to work in this position."}, {"date": "9 Aug 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "It was very busy but not stressful at all. The faculty are all very nice and if you are there, that means they probably want to take you on as a student.", "Interview Questions": "What are your research interests?"}, {"date": "9 Sept 2018", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory University (Atlanta, GA) in Aug 2018", "Interview Descriptions": "Let me start by saying that this was one of the best interview processes I’ve ever experienced, and it was relatively quick for an academic institution. I applied for the position in early July. I was contacted for a phone interview in the first week of August. The next week I was called to schedule an in person interview. \r\n\r\nThe on site interview took place in mid-August. After introducing myself to the administrative assistant, I was almost immediately greeted by the current program coordinator and then the process began. I had 3 back to back 1 on 1 Interviews. The process lasted about an hour and a half to two hours and was completely seamless and well planned. I interviewed with the current Program Coordinator for about 30 minutes, then the individual who would manage me for an additional 30 minutes, and finally the Director for about 45 minutes. This was much less overwhelming than a panel would’ve been. I thoroughly enjoyed speaking with each interviewer, and found myself wishing I could spend more time with them after it was over. This was not a basic interview, where experience and ability were the only thing taken into account. All of the interviewers were very interested in my education, skill set, personality, and ability to work with a team.\r\n\r\n I was informed that I was the top candidate at the end of the same week as my onsite interview. I received a verbal offer at the beginning of the next week, and then received a final written offer a few days later. Overall the entire process from application to start date lasted about 2 months. This was unusually fast because they needed someone to fill the position rather quickly, yet the experience couldn’t have been more positive. I was kept informed at every stage in the process.", "Interview Questions": "What do you think sets you apart from others who applied to this position?"}, {"date": "8 Oct 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Emory University (Decatur, GA) in Aug 2018", "Interview Descriptions": "The interview was pretty straightforward and relaxed. Mostly questions about how I can contribute to the lab team and my duties in my prior research jobs. They were mainly concerned about availability.", "Interview Questions": "Past Research Experience"}, {"date": "15 Jun 2018", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Emory University", "Interview Descriptions": "1st was a phone interview and 2nd was a one on one interview with multiple people. The 2nd interview was three and one half hours long with breaks in between.", "Interview Questions": "How do you think  your past experience translates into this position? "}], [{"date": "16 May 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Emory University (Decatur, GA)", "Interview Descriptions": "Attended an RN Hiring event. Very relaxed Interview. 4 people were interviewing me and offered a job on the spot. Looking forward to the experience. Forgot to ask some pertinent questions, but I look to get into all that when I actually accept the offer.", "Interview Questions": "What is something that you feel you caught onto quickly, and what us something that you have difficulty with?"}, {"date": "11 May 2018", "title": "Research Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University", "Interview Descriptions": "Racist, don't apply unless you white wash your first and last name. Then HR might consider you. Also they only hire Emory or Gatech students before considering students from other universities.", "Interview Questions": "Do you require an a visa sponsor? "}, {"date": "29 May 2018", "title": "Strategic Procurement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory University (Atlanta, GA) in Mar 2018", "Interview Descriptions": "One on one in the reporting manager's office. Very nice interview with open discussion allowing to answer main questions regarding the job tasks. Used email to work out the best time to interview.  Cared more for the type of person I was rather than experience *not to say the experience was useless, but in working as part of a team it is important.", "Interview Questions": "Asked about my recent experience and what I enjoyed about them/ disliked about them"}, {"date": "7 Mar 2018", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Emory University (Atlanta, GA) in Feb 2018", "Interview Descriptions": "It went really well, normal questions were asked, didn't feel out of my comfort zone. The interviewer was warm but firm in her questions. I had a great experience and it inspired me to want to work here", "Interview Questions": "Why are you interested in the job?"}, {"date": "24 Oct 2022", "title": "Medical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Emory University in Jan 2018", "Interview Descriptions": "I was a referral so I interviewed directly with the hiring manager. This was a face to face interview. I was offered the job the same day. Started within 2 weeks.", "Interview Questions": "Please tell me about yourself."}, {"date": "23 Dec 2017", "title": "Human Resources Generalist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Emory University", "Interview Descriptions": "Very slow process with little to no system updates.  Recruiter conversations were typical.  Hiring manager scheduled a time with me and called me 40 minutes later than planned.", "Interview Questions": "When are you available to start?"}, {"date": "1 Dec 2017", "title": "Senior Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Emory University", "Interview Descriptions": "I applied close to the end of September and received a request for a phone interview 2 weeks later. After the phone interview, I followed up immediately with a Thank You. Two weeks later, I hadn’t heard anything so I followed up once more and received a great response. Three to four days later, I received a request for an on-campus interview. Two weeks later, I received a phone call offering me the job.", "Interview Questions": "How do you manage multiple projects simultaneously?"}, {"date": "12 Oct 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Meet multiple people in the department to decide whether or not you are a good fit for the department. You must show a strong background and enthusiasm to join the program.", "Interview Questions": "What was your biggest challenge during your undergraduate years? "}, {"date": "1 Nov 2021", "title": "Academic Records Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA) in Jul 2017", "Interview Descriptions": "Very long time from application to interview. Interview was hard, a panel of several people, who asked many time the same questions. It was intimidating and long. Long time to give answer or offer.", "Interview Questions": "In person interview only. No Internet."}, {"date": "24 Oct 2018", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory University (Atlanta, GA) in Jul 2017", "Interview Descriptions": "Average interview process. Started with a telephone interview, then an Associate Dean interview, and last a group interview with everyone on the team. The group interview was slightly overwhelming, there were 16 people and everyone had multiple questions. Everyone was nice and welcoming so that made it easier.", "Interview Questions": "Why do you want to work with Emory University? "}], [{"date": "25 Jun 2017", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "Dr. Plummer interviewed me. He drew an L shape and labeled both sides with numbers and symbols and asked me what that meant. After much thought I said I don't know. He said \"GOOD ANSWER\". It's better not to know than know something wrong. Good choice!", "Interview Questions": "N/A"}, {"date": "9 Jun 2017", "title": "Research Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 8 weeks. I interviewed at Emory University", "Interview Descriptions": "The interview lasted an hour and consisted of a brief overview of the type of testing performed and tour of the lab. No questions were asked other than \"Do you have any questions for us?\"", "Interview Questions": "Do you have any questions for us?"}, {"date": "1 Jul 2017", "title": "Financial Aid Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Emory University (Atlanta, GA) in Jun 2017", "Interview Descriptions": "Their interview process is one of the best I've ever engaged in! I interviewed on a Thursday and in two weeks a decision was made. Both panel interviews went exceptionally well and all parties involved were pleasant. Word of advice...if you're pursuing an advanced degree (PHD/Ed.D) and the job you're applying for doesn't require it, don't say anything about it and remove it from your resume. Even if you're a great candidate, you won't be considered an asset but more so a liability and a waste of OJT (on the job training). Don't allow your academic endeavors to become a place of contention for future employers; oxymoronic isn't it...", "Interview Questions": "What do you enjoy doing in your spare time?"}, {"date": "15 Jul 2017", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory University (Atlanta, GA) in Jun 2017", "Interview Descriptions": "I applied for the Financial Aid Advisor position at Emory University (Atlanta, GA) May 2017. Then called for an Interview in mid-June 2017.\r\n\r\nTheir interview process is one of the best interviews that I have ever experienced. I was never and it was pouring down rain. It was a 2 hour interview process with 2 different committees. I felt that they were impressed with me and made sure to explain how I truly know Financial Aid. I was myself and made sure to look at each person on the committee. You never know who is the deciding factor for the position.", "Interview Questions": "If you had a weekend to yourself (no family, kids, obligations), what would you do?"}, {"date": "8 Sept 2021", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory University (Atlanta, GA) in Jun 2017", "Interview Descriptions": "Evaded several questions regarding internal culture. I got the sense they didn't want to speak to who happened to the folks who had left prior. Couldn't explain the high turnover.", "Interview Questions": "Q: How would you handle a situation involving faculty and parents? "}, {"date": "4 May 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "I took a very long time to hear anything, I waited months and emailed to get updates but the process was still stressful. The background check took the longest and there was no negotiation of salary on my level.", "Interview Questions": "N/A"}, {"date": "28 Apr 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Emory University", "Interview Descriptions": "Simple and friendly, asked career goals and personal experience. The employer spent a lot of time explaining the job responsibilities and the organization. At the every end, they offered the job.", "Interview Questions": "How do you manage time?"}, {"date": "21 Jun 2017", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University in Apr 2017", "Interview Descriptions": "I applied online through Emory's website. After my application was under review, it took a week to have a phone interview, and the next week was my in person interview. The interview process began with a phone interview and then an in person interview.  I was notified about the decision two weeks after my in person interview.", "Interview Questions": "What skills can you bring to the clinical research team?"}, {"date": "9 Oct 2017", "title": "Assistant Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Emory University in Apr 2017", "Interview Descriptions": "Met with leaders a few times. That was the extent of the interviews. The interview processes for this job was not difficult but it does take a while to hear back.", "Interview Questions": "I don't have any specifics for interview questions. "}, {"date": "2 Oct 2017", "title": "Research Interviewer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Emory University (Atlanta, GA) in Mar 2017", "Interview Descriptions": "I applied to the job in January.  I was emailed to do a phone interview in late February. Completed a team interview and 2 one-on-one interviews and one team bonding/meeting. I received the job offer in mid March.", "Interview Questions": "Explain a challenge you had to overcome."}], [{"date": "26 Jan 2017", "title": "Clinical Research Finance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory University in Jan 2017", "Interview Descriptions": "1 - 3 hour interview with 6 different people. Applied online, 1.5 weeks later had an informal phone interview to determine if an in person interview was needed. Had an in person interview two weeks later, and less than a week after interview was offered the position.", "Interview Questions": "Behavioral questions were asked"}, {"date": "1 Nov 2016", "title": "Marketing Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "I had two interviews. One was with the marketing director and the next with the marketing team the following week. Process was average. They wanted to get a feel for my personality and skill set.", "Interview Questions": "Tell me about your experience"}, {"date": "10 May 2017", "title": "Senior Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University in Oct 2016", "Interview Descriptions": "I was emailed to set up a telephone interview. There was a committee of people on the phone call. It would have been helpful to know who was on the committee prior to the call. Then the finalists had a campus interview.", "Interview Questions": "Questions were all related to content in the job description."}, {"date": "20 May 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Emory University in Sept 2016", "Interview Descriptions": "Interviewed for a temporary position with 4 people. Applied for a different position and wasn't selected but resume forwarded to another recruiter and I received the position after interviewing. Had to go through process with HireRight.", "Interview Questions": "tell about a time you had to handle a difficult situation."}, {"date": "18 Aug 2016", "title": "Patient Access Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University", "Interview Descriptions": "The interview process took maybe 2 months with applying and getting a call back for an interview. There was 3 interview steps; 1st interview was a phone screen call in which was very pleasant and the recruiter asks a few customer service questions. Second interview was face to face in which did not last long about 15-20 minutes in which you sit with a recruiter and they just get a feel if you are a good fit for the position. Third interview is a group interview  in which they ask a few questions and each person has a chance to answer and you can ask questions to the interviewer as well. I felt like all the stages of the interview went well. After 3rd interview I waited about two weeks in which I emailed the HR lady and then I found out that I did not get the job. But it was a good experience and I would apply again for another position.", "Interview Questions": "Why Emory?"}, {"date": "25 Aug 2016", "title": "Public Health Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Emory University (Atlanta, GA) in Aug 2016", "Interview Descriptions": "I had an informational interview with someone from the project I wanted to work for within the Rollins School of Public Health at Emory. That informational interview led them to forward my résumé onto some project managers they thought would be interested in my experience and skills set. I received an email 2-3 weeks after the informational interview (from the project managers) requesting an interview. We scheduled it for the following week and we met in a conference room. The interview lasted exactly 45 minutes. Afterward, they said they would be conducting interviews all that week and would get back to who they chose by the end of the following week. The end of the following week came and went, and I heard nothing. However, that following Monday, I received a very nice email from the managers indicating that while I had not received the offer, they were still very interested in my experience and skills set and they asked if it would be okay if they passed my résumé onto some managers for upcoming positions. Overall, I'd call it a win.", "Interview Questions": "What was one time you had to work with a difficult client and how did you handle it?"}, {"date": "20 Jul 2016", "title": "Clinical Research Coordinator I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "I applied online. I received an email several weeks after I applied. They asked questions via email and then scheduled an in person interview. I spoke with several members of the team and the associate director. They asked about my background and qualifications.", "Interview Questions": "Why should we hire you?"}, {"date": "4 May 2016", "title": "Academic Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Emory University", "Interview Descriptions": "Email from administrator, brief phone conversation the same day, final interview two days later. \r\n\r\nProcess was quick and got the rejection a few days after the interview. \r\n\r\nConfused since my current position is exactly the same but who knows, most likely internal or alumni. One of the interviewers said \"I think I got you figured out\" which was very strange. Might inquire with HR.", "Interview Questions": "How will you adapt to this position?"}, {"date": "5 Jul 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at Emory University (Atlanta, GA) in Apr 2016", "Interview Descriptions": "A long and drawn out process: I moved up in the resume pile by knowing a current employee. I had a phone interview and a few weeks later, an in person interview with my potential boss and a couple other department heads. The interview was very conversational - nothing too stressful. I was given a timeline for a response which they did not at all stick to. I was told, however, that I would be contacted when they reached a decision. After waiting a few weeks and not having heard a peep from them, I emailed one of my interviewers about their decision. No response. I waited a few more weeks and just couldn't take it anymore, so I called and discovered that I didn't get the job. \n\nI'm an empty alumni with a really good GPA and references and met the qualifications for the job, and the alumni association still rejected me. I wish I knew where I went wrong. \n\nThe most disappointing part, however, is their lack of concern for candidates who are trying to work around a timeline that they don't even try to stick to. I wonder if they ever would have contacted me to let me know I didn't get the job.", "Interview Questions": "What experience do you have with technology and databases?"}, {"date": "6 May 2016", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory University (Atlanta, GA) in Apr 2016", "Interview Descriptions": "After an initial Skype interview, I was invited to come give a seminar within the department. Following the seminar, I met with several faculty members as well as all the members of the lab. It was a long day, but I felt very welcome.", "Interview Questions": "Nothing specific. We just talked science most of the day "}], [{"date": "21 Mar 2016", "title": "Patient Account Representative I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Emory University (Atlanta, GA) in Feb 2016", "Interview Descriptions": "It was very formal.  Two people were in the room.  One person explained the position, then the other person asked 4 behavioral type questions.  I sensed the job was already taken when I entered the room and they were just going through the motions.  It wasn't very engaging, they were more concerned with writing down my answers to the questions then they were with actually getting to know me, as there wasn't much eye contact, which they apologized for in advance.  It was the quickest interview I've ever been on.  I tried to tell a little more about me but they wanted you to stick to the questions, I even asked at the end if they had any other questions for me and they flatly said no.  Basically they just wanted to know if you fit in with the staff.  I knew I didn't get the job when I left because I didn't even get to meet the staff or take a tour, I was just escorted out.  I really prepared for the interview and never got to show my true self.  They never even asked so tell me about yourself, although I did try to work that in their to be engaging, but they really don't want to hear anything other than what is asked. I am not sure behavioral type questions work best.  I felt like a robot just answer the questions and we will make a decision.", "Interview Questions": "Tell me about a time when .....(reference to a job)\r\nI think it was something like, state the project, what steps were taken, what was the outcome, was it successful?"}, {"date": "29 Feb 2016", "title": "Security Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Feb 2016", "Interview Descriptions": "There are two rounds, the first is Phone interview, and the second is on-site Interview. If you have enough security and network fundamental knowledge, you are fine. I did well during the Interview. And I had a good discussion with the Technical hiring manager and the team. And after the on-site interview, they asked for 5 references from my professional manager and friends. But after I finished everything, they did not give me the offer, because they do not want to provide sponsorship. The HR told me that they wanted to open the job for several weeks to see if there is proficient US-citizen candidates.", "Interview Questions": "attacks and countermeasures in different layers"}, {"date": "31 Jan 2016", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Emory University", "Interview Descriptions": "You will be invited to a campus visit if they think you are qualified. On-site interview will be held at that time. The faculties are very nice and you will be invited to some nice places in Atlanta.", "Interview Questions": "The questions will based on your research area and interest. For example something about your previous project."}, {"date": "10 Mar 2016", "title": "Applications Developer Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Emory University (Atlanta, GA) in Feb 2016", "Interview Descriptions": "Got mail from the recruiter.Scheduled the interview.Explained about her work and work to done by us once we got selected and about project.Interview is about 30 minutes and very friendly.She asked me to have brief introduction about me.Got offer after 3 days in mail about my compensation and benefits.", "Interview Questions": "1.Tell me about yourself.\r\n2.Difference between vector and arraylist?\r\n3.Which methods are implemented in hash map?\r\n4.how we handle exception in DB2 and java?\r\n5.Difference between string,string buffer and string bulider?\r\n6.difference between interface and abstract class?"}, {"date": "19 Dec 2017", "title": "Senior Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Emory University (Atlanta, GA) in Feb 2016", "Interview Descriptions": "Details about professional and personal experience were asked. The best part was they asked about the programming language in which I'm most comfortable in and also the mistakes I did in my past professional experience.", "Interview Questions": "What are the bioinformatics pipelines you worked on?"}, {"date": "8 Nov 2019", "title": "IT Project Manager II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory University (Atlanta, GA) in Feb 2016", "Interview Descriptions": "Phone screen, interview presentation, then meet & greet interview including box lunch with the stakeholders you work with.  Very intense process with regards to the 1 hour long presentation you must complete in the 2nd round.", "Interview Questions": "Describe your the best project you ever worked?"}, {"date": "22 May 2017", "title": "Senior Applications Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University in Feb 2016", "Interview Descriptions": "Applied through online job portal. Received a call later on to schedule the interview. The interview process was quite easy. Just a round of phone interview with typical technical questions. The complete process took 2 weeks from interview to get an offer.", "Interview Questions": "More of technical related to data structures  like hashmap, List etc"}, {"date": "28 Jan 2016", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "They ask about any previous research experience you may have had and your current research interests. They were also curious about your ability to think critically. There were multiple interviewers (4) all with varied backgrounds. Mostly they will talk about their research but I found it valuable to have read their papers and be prepared with a few questions for each.", "Interview Questions": "What type of research have you done?"}, {"date": "15 Mar 2016", "title": "Psotdoc Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Emory University (Atlanta, GA) in Jan 2016", "Interview Descriptions": "I did not experience any interview, just feel the project is acceptable and come. No special feeling, just for finishing this project asap and get good publication. Then go back to China. \r\nBy the way, it looks that the vacancy is quite easy to take.", "Interview Questions": "N/A"}, {"date": "4 May 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Emory University (Atlanta, GA) in Jan 2016", "Interview Descriptions": "A lot easier. Students may get a part time job through networking with professors. A lot easier. Students may get a part time job through networking with professors. A lot easier. Students may get a part time job through networking with professors.", "Interview Questions": "Why are you interested?"}], [{"date": "2 Nov 2015", "title": "Clinical Research Coordinator III Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "Very laid back...interviewer appeared to have Googled \"Interview Questions\".  No thought was put into the questions asked.  They are just trying to fill positions.  From speaking to other employees it is a revolving door in the clinical trials office.  Management not in tune with employee needs and the demands of the job are not aligned with the low compensation", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "1 Oct 2015", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "Interview was on phone. I was interviewed by a technical person. She was very nice. Repeated the question when I didn't understand. I was asked an easy question about how to merge two sorted arrays", "Interview Questions": "Merge two sorted arrays"}, {"date": "10 Sept 2015", "title": "At Rollins School of Public Health Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "Very cordial, friendly and relatively informal interview. The interview was in a glass room so people could see into the room and I could see out. Interviewer used my resume to refer to previous experiences and ask about relevant skills. Interview lasted approximately 30 minutes and I heard back within the week about the position.", "Interview Questions": "Relevant analytical skills, how would someone else describe me"}, {"date": "28 Aug 2015", "title": "IT Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "step 1:  phone screen by HR.  step 2:  phone interview with hiring manager.  step 3: in-person interview with hiring manager and some team members.  step 4: follow up phone conversation to address questions from both sides", "Interview Questions": "why are you a good fit for the position"}, {"date": "10 Jun 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emory University (Atlanta, GA) in Sept 2015", "Interview Descriptions": "I submitted my resume on the Emory career website (EagleOps) and received email back three days later to request an interview later in the week. I interviewed in the office on Thursday with the associate director, who would become my future supervisor. I heard back from on Tuesday. It was a very expedient process and everyone at every step was cordial and professional.", "Interview Questions": "What kind of project would you initiate in this role and how would you go about initiating it?"}, {"date": "26 Aug 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Emory University", "Interview Descriptions": "The interview panelist were warm,rigorous  and engaging. Went through 3 different interview panels. It was for not sure 3-4 days plus arrival and departure days process, we were lodged in a hotel, our feeding was taken care of. We had a tour of the city and a wonderful dinner with current students.", "Interview Questions": "Why do you want to undergo a PhD? What are your areas of interest, what are your career goals, where do you see yourself  in 10 years time? Tell us about yourself?"}, {"date": "7 Nov 2015", "title": "Management Position Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory University (Atlanta, GA) in Aug 2015", "Interview Descriptions": "The process involved a phone interview, a group/panel interview and an interview with an executive level panel. The questions are standard and seek to identify your experience and fit with the team and organization.", "Interview Questions": "Tell us about your experience."}, {"date": "28 Jul 2015", "title": "Academic Department Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory University (Atlanta, GA) in Jul 2015", "Interview Descriptions": "Applied online via the Emory University website, the HR automated website sent me updates as I was moved through the process. Once the hiring manager decided to interview me, I received and email letting me know of their interest and scheduling the interview. What was especially helpful is that he sent me bullet points of what he would like to discuss so I was able to make notes and be very prepared and have a very productive conversation.", "Interview Questions": "What attracted you to this position?"}, {"date": "26 Feb 2017", "title": "Senior Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory University (Atlanta, GA) in Jun 2015", "Interview Descriptions": "Pretty straightforward experience. I completed a short telephone interview with 2 associates, and then an in-person panel interview with the same associates, a field interviewer, the PI and a co-investigator. Overall experience was pleasant and straightforward.", "Interview Questions": "If you had to tell us one thing about yourself, what would it be?"}, {"date": "21 May 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "The interview was pretty simple and the interview was concerned with  gauging my interest in the position. I applied for a part time research position as a student.", "Interview Questions": "What are your interests ? Why do you believe you are a good fit for the position ?"}], [{"date": "24 Mar 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "Submitted online application. Recruiter then contact me. Went on a interview with unit manager and department manager. 45 minutes of behavioral questions. HR contacted me 2 days later with an offer. All staff was super helpful and nice.", "Interview Questions": "describe a situation where you dealt with a difficult patient. what was the outcome."}, {"date": "4 Mar 2015", "title": "Library Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University", "Interview Descriptions": "I applied online. The process took about a month and a half. Overall the staff was friendly but it was not as organized as I would have liked. For example, I was applying to two separate positions and when the recruiter for one of the positions called she scheduled a time for a phone interview. The other simply began asking me questions without giving me time to prepare and with no previous warning, so I was on speaker in a conference room with four separate employees and no preparation. Perhaps this was a simple screening, but I would have liked to been better informed.", "Interview Questions": "Name a time when you have an countered a tense situation with a coworker."}, {"date": "30 Jul 2015", "title": "Business Objects Developer/Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Emory University (Atlanta, GA) in Mar 2015", "Interview Descriptions": "I applied on the university career website. Very very slow interview process with five rounds of interview. I was approached by the hiring manager in March 2015 and had my initial screen. Initial screen lasted for about 25mins and later in April 2015 i had my second phone interview with the team. This was more of behavioral questions about my work and it lasted about 45mins. I had my third phone technical interview in the May 2015. This lasted for 30mins and purely technical. Then again in the last week of May 2015, i had a 30min skype interview call with the chief officers of the university which was again behavioral. In June 2015, finally i was called in for an in person interview which involved meeting the whole IT/non IT team and having lunch with them. The final round was more casual and it was good to meet everybody. This lasted for 3 to 4 hours.", "Interview Questions": "1) How do you describe yourself\r\n2) What do you expect from a manager\r\n3) Describe a difficult situation with users that you had to handle\r\n4) Define loop and different ways to resolve a loop\r\n5) What is a derived table, aggregate table\r\n6) few questions on BO administration"}, {"date": "13 Jul 2015", "title": "Temporary Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Emory University in Jan 2015", "Interview Descriptions": "The process took about 4 to 5 months. After you fill out the application and if you qualify they will contact you by email to take about 7 assessment test in a certain time frame. If you do well on the tests you are called in for a standard interview where they ask you questions like: tell me about yourself, why Emory, tell me a time where you dealt with a difficult situation and how did you handle it? What are your strengths/weaknesses.", "Interview Questions": "What are your strengths/weakness?"}, {"date": "22 Dec 2014", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Emory University", "Interview Descriptions": "Submit resume and application online or at a career fair, one interview with the office manager. When I entered I was told she already intended to hire me, so it was nice to know where we stood going in.", "Interview Questions": "Are you keeping your hair like that?"}, {"date": "12 Nov 2014", "title": "Senior Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Emory University", "Interview Descriptions": "Most of hiring process through online--can be hard to navigate, but not impossible. I do not think my process was normal. The semester was about to begin and they needed to fill the position. I have found the administration here easy to work with and highly ethical. Emory is a good place to work.", "Interview Questions": "N/A"}, {"date": "11 Oct 2016", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Emory University (Atlanta, GA) in Nov 2014", "Interview Descriptions": "Met with the lab manager. had a nice conversation. Hired after. Great fun easy process of getting hired. Conversation went well. Had a good time. Person that was hiring was very nice. No problems there. Wanted to ask many questions and did and they got answered. so no problem there. Hoped that i got the job and did so no problem there. hope that there was room for growth and development so no problem there.", "Interview Questions": "What are your goals professionally for this job?"}, {"date": "3 Oct 2014", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory University", "Interview Descriptions": "Applied online and emailed the HR department with my resume. I received a call within a week of sending my initial email. I interviewed with three different people on three different interviews.  After that they hired an internal person for the position.", "Interview Questions": "Give an example of your daily administrative task."}, {"date": "22 Sept 2014", "title": "Non-clinical Services Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Emory University", "Interview Descriptions": "Campus recruiting. Two rounds in a row. Two interviews, each one is half an hour. One will ask you technical questions and the other ask you behavior question. One week later the HR will call you about the result and give you offer at that time. You only have two weeks or so to decide.", "Interview Questions": "If you had to be an animal, what animal would you be?"}, {"date": "15 Mar 2017", "title": "Dishwasher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Emory University (Atlanta, GA) in Jul 2014", "Interview Descriptions": "It was good overall  and it lasted for about 4 hours they had refreshments and drinks for us it was like 150 people in the building I had got there 25 mins held of time so I wouldn't be late", "Interview Questions": "Why do u think this company should hire u"}], [{"date": "31 Jan 2015", "title": "Technical Project Manager-Yerkes National Primate Research Center Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Emory University in Jun 2014", "Interview Descriptions": "Over the course of 4 months I interviewed with everyone and their mama.  It seemed almost as if they were still trying to justify the position.  Just kept going and going, then after the last phone call, where he asked the question below, I never heard from anyone again.  Very RUDE, after I spent so much time going there to talk to everyone. one on one.  I deserved a call, email, etc. or something to say \"thanks for your time, but no thanks\" at the very least.", "Interview Questions": "After everything you've seen here and everyone you talked to, in what specific ways could you help us?"}, {"date": "7 Dec 2015", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Jun 2014", "Interview Descriptions": "Apply online, and get a email about person to person interview, after the interview, takes about 2 weeks, get an offer. The whole process is very fast and the interviewer is very helpful and nice. I enjoyed the whole process.", "Interview Questions": "Do you have any previous experience? Strength and weakness"}, {"date": "7 Sept 2015", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Emory University (Atlanta, GA) in Jun 2014", "Interview Descriptions": "The interview was grueling but as to be expected given the nature of the job interviewing for. I was interviewed for almost an entire day.  I met with the research team as a whole first and then met with the \"higher ups\" individually.  It's an exhausting process but not intimidating at all.  Dress comfortable and eat well (fuel food) before and during process.", "Interview Questions": "What Skill set do you have that will be particularly helpful for this position?"}, {"date": "8 May 2014", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "Remember this was 12+ years ago so I'm sure some practices have changed.  I met with the CFO for a 1:1 interview, she felt I had too much experience for the front office. She interviewed me for a upcoming position.  I meet with 2 other supervisors that day which went well and received a call back by 4pm that day for a follow up interview.  I came in  24 hrs later and was offered the job by the HR Director. He was very funny and made me feel relaxed.", "Interview Questions": "How do I feel about animal research? And Animal Rights activist? "}, {"date": "24 Apr 2014", "title": "Public Health Program Associate Senior Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Initial communications and interview process very easy and seamless. Interviewers are laid back and helpful. Groups like to interview candidates so the team can understand if the candidate will be a good fit.", "Interview Questions": "Depending on what group you are interviewing with, questions such as sensitivity to other cultures, religions and backgrounds may come up. This is important when working with diverse groups and exciting to have opportunities to interact with people who come from all over the world with different experiences. "}, {"date": "13 Oct 2014", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Emory University in Apr 2014", "Interview Descriptions": "preliminary phone interview, then all day interview. Gave me things to prepare and present for the all day interview. You will meet with a lot of different people. Make sure to send thank you notes or emails and to remember specific things from your conversations. They look for people who already understand and Emory university as a whole so a lot of research on the universities fundraising practices was necessary.", "Interview Questions": "How do you measure success?"}, {"date": "29 Jun 2015", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Emory University (Atlanta, GA) in Apr 2014", "Interview Descriptions": "They look for intelligence and problem solving. Basically, they want to see if you can multi-task and how you would react and handle various situations and patrons. There are a lot of things that can go wrong and a lot of people who can call you asking for all sorts of different things.", "Interview Questions": "How do you balance your time?"}, {"date": "13 Mar 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Straightforward and simple", "Interview Questions": "Most questions were simple and to the point"}, {"date": "19 Feb 2014", "title": "Associate Director, Student Conduct Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "I was initially hired as the first assistant director for the Office of Student Conduct, then promoted to associate director over four years later. My selection process was typical for a student affairs position: I submitted a cover letter, resume, and professional references. I had a telephone interview, then was invited for an on campus interview that was a full day in length and involved meetings with various constituency groups.", "Interview Questions": "At dinner the day before my interviewing began I was given a case study that was a composite of several difficult situations that office had recently addressed. I was asked to review the case and be prepared to discuss it at my final interview of the day."}, {"date": "30 Jan 2017", "title": "Supplemental Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Jan 2014", "Interview Descriptions": "Very simple, professors want to know you have good grade in course, must be friendly and willing work hard and devote time. Most professors already have a student in mind they want to have to if you want to be considered really make an attempt to be very friendly and show you understand the material.", "Interview Questions": "Would you be available to hold sessions two times a week?"}], [{"date": "23 Jun 2016", "title": "Campus Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Jan 2014", "Interview Descriptions": "My interview was about 3 mins... they asked the question about my work ethics & I gave quick & direct anwsers... a week later I was hired!! It was self explanatory, on the spot questions,, but I didn't break a sweat..", "Interview Questions": "How would I react to a couple workers attitude"}, {"date": "15 Jul 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Dec 2013", "Interview Descriptions": "3 rounds of application - online application followed by Skype interview.  called for campus interview 3 weeks after Skype interview.  campus interview lasted 3 days.  interviews took place over breakfast, lunch and dinner, and a job talk presentation.", "Interview Questions": "A detailed question asked at the job talk "}, {"date": "26 Mar 2017", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory University (Atlanta, GA) in Dec 2013", "Interview Descriptions": "First round of the interview is a Powerpoint presentation of the previous work with a big group of researchers. The second round of the interview is to meet with lab members and to discuss their individual projects. Third round is to interview with the P.I to talk about the future work in the lab.", "Interview Questions": "What skills do you have"}, {"date": "17 May 2017", "title": "Medical Records Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA) in Dec 2013", "Interview Descriptions": "I was interviewed by the business manager, Erna, the first time.  She was very friendly and explained how Student Health had improved over the past few years.  We toured the facility, and I was introduced to the clinical providers and the front desk/business office team.  My second interview was a group interview, with Erna and the nursing supervisor and two of the MDs who work at Student Health.  It was my first group interview, and it went very well.", "Interview Questions": "Why do you want to work here?, which I suppose is a standard interview question.  "}, {"date": "16 Oct 2013", "title": "Admission Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at Emory University", "Interview Descriptions": "When you are brought on-site, you are interviewed by a group of your potential future colleagues/peers. Usually it is several small groups but sometimes just one big group. You also give a presentation on a topic of your choice and then have a one-on-one with the supervisor", "Interview Questions": "Give an example of a group/organization/community where you have created a lasting impact that no one else could have done in quite the same way. "}, {"date": "31 Dec 2015", "title": "Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Emory University (Atlanta, GA) in Oct 2013", "Interview Descriptions": "The interview was straightforward and low-pressure. A student who would be in charge of the team conducted them individually. In hindsight, perhaps the actual adult employees of the University should have been present. It was mostly behavioral, and not much information about the position was given. She asked about my experience, which was quite little, and I was honest.", "Interview Questions": "Do you have any experience working with cameras?"}, {"date": "20 Oct 2015", "title": "Sports Official Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Emory University (Atlanta, GA) in Oct 2013", "Interview Descriptions": "The interview wasn't too bad. I met with the director of intramural sports in order to \"get him to know me and get me to know him.\" Essentially, the interview process was very easy, nothing to get too worked up about. There was no technical questions besides a few basic questions about the basic rules of soccer and basketball. Additionally, he asked for a couple of stories that I've done that would demonstrate interest for this role.", "Interview Questions": "Why do you want to be a sports official for basketball and soccer?"}, {"date": "6 Nov 2014", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory University in Sept 2013", "Interview Descriptions": "Asked about previous experience, no specific questions in regards to skill. It was a one on one interview with a nice atmosphere. Look tidy and speak clearly. Looking for people who are good at customer service.", "Interview Questions": "Previous experience."}, {"date": "8 Nov 2016", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Emory University (Atlanta, GA) in Sept 2013", "Interview Descriptions": "Easy. Checked out their website and read some of the articles. Emailed the prof and then went in to talk to prof, then get hired. The lab that hired me was Dr.Minsu Kim's lab which specialized in biophysics research. And a lot of the resource was invested in microbiology related topics.", "Interview Questions": "What is your research background"}, {"date": "14 Aug 2013", "title": "Clinical Research Coordinator III Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at Emory University", "Interview Descriptions": "Worked here in the past. Was hired back. Interview process consisted of sending resume and one meeting with boss. Pretty simple. Most people are referral hires in the department. No aptitude/personality tests. There is a background/drug screen after you've been given an offer.", "Interview Questions": "N/A"}], [{"date": "18 Jul 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "Had a phone interview and was asked questions regarding to tasks of the job and my experience doing certain job requirements.\r\n\r\nVery nice and said they would let me know as soon as they interviewed the other candidates.", "Interview Questions": "Questions were not that hard; just talking about my prior experience"}, {"date": "14 Jul 2013", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "First interview is over the phone.  Basically tests your ability to be conversational and think on your feet.  As well as gauging your interest in the job.", "Interview Questions": "How would you convince me if I were a potential donor, to give to Telefund or one of Emory's programs?>"}, {"date": "13 Jul 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory University", "Interview Descriptions": "email, then phone interview, then in-person interview with several people", "Interview Questions": "N/A"}, {"date": "8 Jul 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "The process was simple. There was only one interview and it was quite informal. The questions were not at all tricky. I applied online on the emory website and was contacted for an interview about a week later. I was actually offered the job based on my resume qualifications, so the interview was simply a chance for them to se if I was who I said i was.", "Interview Questions": "What unique characteristic will you add to the research team"}, {"date": "22 Aug 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Emory University (Atlanta, GA) in Jul 2013", "Interview Descriptions": "I had a group interview with everyone that I would be working with. The group interview was fine and very relaxed. I was asked a series of questions and then I had to present my past research.", "Interview Questions": "How do my experiences fit with their department?  "}, {"date": "18 May 2013", "title": "Clinical Research Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Emory University", "Interview Descriptions": "HR is generally slow is hiring for clinical research nurses due to their stringent screening process.  There are typically 3 to 4 interviews which they try to schedule in one or two days.", "Interview Questions": "How do you function in extremely stressful environments?"}, {"date": "29 Mar 2013", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Emory University", "Interview Descriptions": "I was contacted and had a brief phone interview where we scheduled me to come in.  Standard interview questions, talking about what I had done, why I was looking right now, etc.  Had a second interview the next week and was extended an offer shortly afterwards.", "Interview Questions": "N/A"}, {"date": "25 Mar 2013", "title": "A/P Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emory University", "Interview Descriptions": "Easy", "Interview Questions": "N/A"}, {"date": "6 Sept 2015", "title": "Resident Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Mar 2013", "Interview Descriptions": "First there is a group interview where you are observed interacting with various other students on accomplishing a task. Then you are interviewed by two previous RAs. Finally, you have an individual interview with the Resident Life Coordinator.", "Interview Questions": "What are various programs you have planned for the students?"}, {"date": "28 Feb 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "Interview with Professor. Basic questions: Why do you like the subject? What do you want to get from this research position?", "Interview Questions": "None."}], [{"date": "13 Sept 2016", "title": "Grada Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Emory University (Atlanta, GA) in Feb 2013", "Interview Descriptions": "I interviewed with a handful of faculty members in my prospective department. It was about 6 interviews, each approximately 20 minutes, back-to-back. They asked me questions about my previous research experience and what I wanted to do in the future.", "Interview Questions": "What would you like to do (research) while at Emory? "}, {"date": "15 Nov 2012", "title": "Research Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA)", "Interview Descriptions": "It was very important to know someone inside Emory. It is a huge bureaucracy, and I feel sorry for those who do not have an insider to advance the process. Having such an insider, it was very easy for me. The red tape really occurred in salary negotiation; Emory wants to stay within specific boundaries, some of which are unrealistic.", "Interview Questions": "the toughest question is sometimes the most expected: Why would you want to be at Emory? Well, its a great university with wonderful benefits in a great city. Duh... But if you answer with that, it isn't original, so you're kinda stuck."}, {"date": "23 May 2014", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Emory University (Atlanta, GA) in Jun 2012", "Interview Descriptions": "Facile process with a few question. It starts with a presentation and then meet all the group member. Everybody was nice and trying to help me. The offer came after several email correspondence which is kind of long process.I have no major complains.", "Interview Questions": "none"}, {"date": "5 Jul 2012", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Emory University (Atlanta, GA) in Apr 2012", "Interview Descriptions": "I had two interviews.  The first was through a group setting and the second was with the PI over the phone.  They were somewhat relaxed and seemed like they were eager to hire someone asap.  The group interview consisted of me explaining what my last two work experiences were and any thing I wanted to add that was not on my resume like volunteer experiences.  There were not many behavioral questions other than,\r\n\"Where do you see yourself in 5 years? and What do you like to do for fun?\"", "Interview Questions": "Where do you see yourself in 5 years? (i.e. short term goals)"}, {"date": "28 May 2015", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Emory University (Atlanta, GA) in Mar 2012", "Interview Descriptions": "I had two interviews for this position.  The initial was with a hiring manager and the School's head of business and finance.  It seemed this was an initial screening interview.  The second interview was with the person I would report to directly.", "Interview Questions": "Basic behavioral and functional questions."}, {"date": "24 Jun 2015", "title": "Information Analyst III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Emory University (Atlanta, GA) in Mar 2012", "Interview Descriptions": "A brief phone interview was followed up by an interview at campus. Was asked a few coding questions and got to meet some of the team. Important to get along well with the team since you'll be interacting frequently with them. By and large, a stress free interview.", "Interview Questions": "A technical question on how an algorithm."}, {"date": "26 Jul 2016", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Emory University (Atlanta, GA) in Feb 2012", "Interview Descriptions": "Interviewed 1 on 1,in office with administrator. Introduced to staff, sent for physical. Assigned a nurse educator who walked me through what I would be doing then without hoovering watched me do it.", "Interview Questions": "What do you think is your weakness?"}, {"date": "20 May 2013", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Jan 2012", "Interview Descriptions": "Must apply via Emory University HR website.  Be prepared to enter details about educational background as well as contact information for all professional references up front.\r\n\r\nHighly recommend connecting with someone in the department--HR often does not forward all resumes to the hiring manager!", "Interview Questions": "What would you tell a consulting MBA job seeker to do?"}, {"date": "13 Aug 2016", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Emory University (Atlanta, GA) in Jan 2012", "Interview Descriptions": "Pre screening test, panel interview and two One on one interviews with Director and AVP drug screening background check skills reviewing lengthy process but worth the time parking difficult need to plan better for that.", "Interview Questions": "Behavioral questions to see how you may fit within the organization"}, {"date": "13 Oct 2013", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Jan 2012", "Interview Descriptions": "Filled out application online.  Needed two recommendations, one from a Professor and the other from a supervisor from a job or extracurricular activity.  Was then contacted to come to an interview process that lasts about 2 hours in total.  We had a group interview, where the panel watched how we as candidates interacted with one another to discuss issues at Emory, then later a 2 on 1 interview with two ResLife staff members.", "Interview Questions": "If there is one area of Emory that you think needs more attention, what would it be and why?"}], [{"date": "6 Aug 2016", "title": "Technology Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Emory University (Atlanta, GA) in Jan 2012", "Interview Descriptions": "A quick chat and sent resume was all that it required. I began my time as a technology consultant for the goizueta business school computer lab as work study Ias a student) and when I didn't qualify, they still kept me on.  Great team and very easy to work with.", "Interview Questions": "How did you hear about the job?"}, {"date": "15 Jun 2015", "title": "Lead Research Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Dec 2011", "Interview Descriptions": "I received an email from HR requesting an interview. I met with the future boss and potential colleagues. They called me two weeks later to let me know their decision.", "Interview Questions": "They asked me about my past lab experience and how soon I would be available."}, {"date": "10 Feb 2012", "title": "Web Or Applications Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Emory University (Atlanta, GA) in Dec 2011", "Interview Descriptions": "Had a phone interview and then on site interview with direct team I would be working with, marketing team, CIO and another manager. From my perspective the interview went well. They asked why did I want to work for Emory and to describe my work experience. They where late to the in person interview. Unfortunately the process took WAY too long 2 months. I had two interviews in the mean time from other companies with offers before I even got an update no longer under consideration. So regardless of an offer I would of had to turn it down.", "Interview Questions": "Describe the difference between html and xhtml"}, {"date": "22 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Emory University (Atlanta, GA) in Aug 2011", "Interview Descriptions": "Very candid and friendly interview.  Very simple.  Sat me down in a professor's office and just asked me who I am and what I like doing on my off time.  It was quite casual and they just wanted to get a better idea of who I was.  It didn't seem too stuffy and or too uptight, as it was a very casual environment.", "Interview Questions": "How do you feel about research and testing on animals?"}, {"date": "24 Feb 2012", "title": "Administrative Assistant, Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Emory University (Atlanta, GA) in Apr 2011", "Interview Descriptions": "My experience was very different because I went through the in house temp service. Typically the interview process at Emory is long and drawn out, but I was called on a Thursday went in for the interview on a Monday and was offered the job that same day. I was at work a few days later.", "Interview Questions": "How are you with dificult personalities?"}, {"date": "30 Apr 2011", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Emory University (Atlanta, GA) in Apr 2011", "Interview Descriptions": "I was asked to tell them about myself. Then, they told me about the job and what criteria they were looking for in an applicant.", "Interview Questions": "Tell me about your self?"}, {"date": "14 Sept 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Emory University (Atlanta, GA) in Apr 2011", "Interview Descriptions": "quick, one on one interview with the PI. Followed presentation after 2 weeks and interviews with all the members of the lab and junior faculty. and a day after I got the job", "Interview Questions": "Why am I interested to join Emory?"}, {"date": "25 Sept 2015", "title": "Senior Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Emory University (Atlanta, GA) in Apr 2011", "Interview Descriptions": "Phone interview first then face-to-face interview with 3 staff members including 2 directors. Pretty standard interview in a professional and welcoming atmosphere. They explained the position in more detail then showed me an organizational chart and some reports the department produces. Took me on a tour of the office space and introduced me to the other staff.", "Interview Questions": "What is your 5 year career plan?\r\nWhat interests you about the position?\r\nWhat is your relevant experience?"}, {"date": "30 Apr 2015", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Emory University (Atlanta, GA) in Mar 2011", "Interview Descriptions": "It was a fairly quick process. Took 3 weeks met with everyone on the first visit, completed background and received offer. It was standard and easy. The communication was clear and directions were clear as well.", "Interview Questions": "There were alot of behavioral based questions."}, {"date": "19 Aug 2015", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Emory University (Atlanta, GA) in Feb 2011", "Interview Descriptions": "3 day process. You will meet with 6-8 faculty, some of your choosing and some from the selection committee. Each interview is about 25 minutes. There is also a dinner with current students and a dinner with faculty. There is also a house party with students on the second night. 50 students are interviews for 14-18 slots.", "Interview Questions": "Why do you want to get a PhD?"}], [{"date": "6 May 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Emory University (Atlanta, GA) in Feb 2011", "Interview Descriptions": "A full day of interviews with 4-5 faculty members.  Most asked about background in research and research interests. They wanted to make sure you were interested in research and knew what you were getting into. There was also a dinner with faculty members and other graduate students that was very relaxed.", "Interview Questions": "Q. What are your research interests?"}, {"date": "30 Mar 2015", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Emory University (Atlanta, GA) in Jan 2011", "Interview Descriptions": "First and extensive telephone screen.  Note that this was after two levels of resume screening.  Then in-person with committee of at least three staff members.  Note that these included the direct supervisor, a co-worker and one additional team member.  The questions were scripted in advance and each interviewer had specific questions to ask.", "Interview Questions": "Describe a situation where you assisted a direct report or team member."}, {"date": "9 Jun 2015", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 8 weeks. I interviewed at Emory University (Atlanta, GA) in Jan 2011", "Interview Descriptions": "Seminar, meetings with a dozen people\r\nclassical academic process.  Meet chairs, deans, faculty, try to impress all of them. \r\nAtypical job search for most professionals.  They try to assess your future potential as a scientist and if you place nicely with others.  Emory is an elite university and acts like it.  They have very high expectations.  Many faculty are anxious about the funding climate, but it is that way everywhere.", "Interview Questions": "Plans for future grants"}, {"date": "29 Jul 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Emory University (Atlanta, GA) in Jan 2011", "Interview Descriptions": "I am international so it was through skype. The professors are very nice and I feel if they give you an interview, they probably feel you are qualified. So the interview was not technical, but more conversational and they tab more into motivation.", "Interview Questions": "You were studying pharmaceutical science, why switch to chemistry as in basic science?"}, {"date": "29 Nov 2013", "title": "Research Informatics Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Emory University (Atlanta, GA) in Jan 2011", "Interview Descriptions": "Hiring takes forever, even after a verbal offer.  Utilizes the \"targeted selection\" process by DDS (read about it before interviewing and save everyone a lot of time).  Panel interviews (around three people) and a solo interview.  There will be a drug test and you will need to be up to date on your vaccinations.", "Interview Questions": "Tell me a time when you failed miserably at something and what you did to remedy the failure (or something to that effect).  Targeted Selection is a behavioral interview style and if you're already at this stage, you've met the technical aptitude requirements.  Now they need to feel out your personality."}, {"date": "18 Oct 2012", "title": "Payroll Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Emory University (Atlanta, GA) in Nov 2010", "Interview Descriptions": "Took a total of one month from appication to completing new hire docs", "Interview Questions": "Tested on computer abilities and knowledge"}, {"date": "5 Feb 2014", "title": "Research Project Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Emory University (Atlanta, GA) in Jul 2010", "Interview Descriptions": "Emailed a professor whose research I was interested in.  Took a lot of emails to get a response, interview was straightforward.  Since I was interested in the research and qualified I received the job", "Interview Questions": "Whether I have clinical trials experience, and whether or not I have the ability to simultaneously do data analysis, management, and coordinate a trial."}, {"date": "10 Apr 2013", "title": "Research Specialist Lead Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Emory University (Decatur, GA) in Jun 2010", "Interview Descriptions": "very slow and process is hard to folllow", "Interview Questions": "N/A"}, {"date": "13 Sept 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Emory University in Feb 2010", "Interview Descriptions": "Four or five faculty members talk for about 30min, mostly on their own research projects. They may ask you for your opinion on some specific questions as a way to test your thinking capability. Would be a huge bonus if you can ace it but would not be a big concern if you feel you did a mediocre job.", "Interview Questions": "Please try to design a high-throughput screening method for antiviral drug discovery which also takes into account of cell viability."}, {"date": "20 Mar 2013", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Emory University in Aug 2009", "Interview Descriptions": "Interview process was lengthy.  It usually takes 6 months from the time the search opens.  Communications were great once selected to interview. \r\nInterviews were scheduled throughout the day. \r\n1st was with HR, then the Director, then the team, then constitutants which was with a panel of 6 -7 people.  They try to be very formal but are really looking for the \"real\" you.", "Interview Questions": "Tell us why we should not hire you"}], [{"date": "11 Jan 2010", "title": "Associate Director, MBA Student Career Advising Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Emory University (Atlanta, GA) in Aug 2008", "Interview Descriptions": "The selection process began with a phone interview. The phone interview include general questions regarding my interest in the position, my transferable skills, and my interest in the company.  After passing the phone interview, I was asked to come in for three rounds of interviews and a presentation.", "Interview Questions": "What would be the first thing you would do if selected for this position?"}, {"date": "4 May 2010", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Emory University (Atlanta, GA) in Aug 2008", "Interview Descriptions": "I applied directly to the PI. Initial communication was through email, followed that by a phone interview.  The phone interview was confined to science; mostly my research, what interests me about the lab, etc. I was then invited to visit the lab, interact with other members of the lab, meet faculty members with whom we collaborate and then a presentation. \r\n\r\nI was offered the job within 48 hours. \r\n\r\nThe whole process from the initial contact to the offer stage took only 2 weeks.", "Interview Questions": "Mostly conversational. General stuff about research and science. "}, {"date": "24 May 2012", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Emory University (Atlanta, GA) in Aug 2008", "Interview Descriptions": "1:1 interview took place at a restaurant during a professional meeting. \r\nMy future boss and I discuss what the position would entail and which skills I would bring to the lab.", "Interview Questions": "What is the best contribution you could bring to the lab?"}, {"date": "17 Nov 2009", "title": "Office Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Emory University (Atlanta, GA) in Jun 2008", "Interview Descriptions": "Applied for position via company website.  Received email from HR indicating that I qualified for position and that application had been forwarded to hiring department.  Received call for interview.  Interviewed for position.  Received notice of candidate selection.", "Interview Questions": "What sort of fund raising have you done?"}, {"date": "11 Jul 2010", "title": "Research Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Emory University (Atlanta, GA) in Feb 2008", "Interview Descriptions": "The interview procedure is standard, just ask some technique in my resume and ask me some plan. Then I was taken to the lab and look around. The whole process just take 1 hour. I think the lab professor then made decision.", "Interview Questions": "tell me about yourself"}, {"date": "1 Mar 2010", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Emory University (Atlanta, GA) in Jan 2008", "Interview Descriptions": "Interview process was quick and efficient - I believe they really were in need of an assistant. High turnover in my position in the last couple of years. I had about 2 face to face interviews, first one was basic and very general and the second interview were more questionnaires and scenarios and I had to provide examples. Both times interview took place with the same person.", "Interview Questions": "How id you handle a certain situation?"}]]