[[{"date": "20 Jul 2022", "title": "Physics Lab TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of the Pacific", "Interview Descriptions": "Hiring manager was nice and it went smooth.  I got an email from the instructor regarding his interest in hiring me. He asked me to interview with him in the dates we had free. was about 20 minutes.", "Interview Questions": "physics related questions\r\nquestions about strengths\r\nhow to handle a situation where the student asks for help"}, {"date": "2 Mar 2022", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of the Pacific", "Interview Descriptions": "The interview process was fairly easy. I had to connect first over the phone with Director, then another round where I spoke with the entire department. I was then asked submit a written proposal.", "Interview Questions": "Q. How will you enhance this department? \r\nQ. What are your research goals?"}, {"date": "25 Feb 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of the Pacific", "Interview Descriptions": "After your resume is passed, they do group Interview and then individual interview(pre-covid). In group interview, current RAs observe your attitude and cooperation in activities. Once you pass the group interview, you get an email for invite of individual interview. Interviewers are Resident Director and current RA.", "Interview Questions": "What does community mean to you?"}, {"date": "16 Nov 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at University of the Pacific in Sept 2021", "Interview Descriptions": "Phone call with a recruiter then a video interview with the hiring manager. The recruiter was super helpful and guided me through the process and gave me tips to prepare.", "Interview Questions": "How would you determine deadlines"}, {"date": "28 Jan 2023", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of the Pacific (Stockton, CA) in Aug 2021", "Interview Descriptions": "Interview was very short and relaxed and most certainly they want you to get the job. if you have applied keep your hopes up because not many people apply and make sure to apply ahead of time.", "Interview Questions": "what is your workload this semester?"}, {"date": "16 Jul 2021", "title": "Data Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of the Pacific", "Interview Descriptions": "They are very friendly and do not challenge you. They just wanted to know if I’m a good fit or not. They went through my resume and the job’s tasks. There didn’t ask any technical question.", "Interview Questions": "How you want to mange the data from stack holders"}, {"date": "14 Jun 2021", "title": "Student and Academic Affairs Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of the Pacific in Jun 2021", "Interview Descriptions": "Interview lasted for about 30 minutes and it consisted of a panel of three women. The questions they asked were straight forward and were relevant to the job. Overall it was a good interview.", "Interview Questions": "Describe a difficult situation at a previous job, and how did you solve it? "}, {"date": "3 Feb 2022", "title": "Student Success Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of the Pacific (Stockton, CA) in Apr 2021", "Interview Descriptions": "Application thru University job page.  Timely response. Panel interview.  Friendly interviewers.  60 minute interview.  \r\nhe interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire.", "Interview Questions": "How do you balance multiple priorities."}, {"date": "8 Dec 2020", "title": "Associate Dean Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of the Pacific", "Interview Descriptions": "Great. They were very welcoming and warm. The campus felt like one that I will enjoy for years to come. I can see that they wanted conarodery and respect between each other. I will enjoy this position", "Interview Questions": "How important is diversity to you"}, {"date": "18 Jan 2021", "title": "Lecturer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of the Pacific (San Jose, CA) in Feb 2020", "Interview Descriptions": "The interview was with the department chair.  She was prompt, informative and really gave me a feel for the school.  After the interview, she answered all of my questions and was good about following up with HR for the hiring process.", "Interview Questions": "What made you interested In Working for Pacific?"}], [{"date": "20 Dec 2019", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of the Pacific", "Interview Descriptions": "The 1st interview was about 30 minutes over-the-phone. The 2nd interview was about a 4-hour process in person. The staff was incredibly kind and forthcoming about the job and qualifications.\r\n\r\nThe only negative was that it took a long time to hear back (over a month.) I only received a response because I inquired about the position.", "Interview Questions": "What is your experience with committees?"}, {"date": "3 Oct 2020", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of the Pacific (Stockton, CA) in Aug 2019", "Interview Descriptions": "It was a great experience. I was asked a couple of Data Structures and computer networks related questions. It took about an hour or so for me but the time varies, but I think it depends a lot on the Professor.", "Interview Questions": "A couple of time complexity related questions, what’s the best and worst scenario for quick sort and 2 coding questions "}, {"date": "26 May 2019", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of the Pacific (Stockton, CA) in Mar 2019", "Interview Descriptions": "Within a week of the application, I was emailed by one of the interviewers to participate in a phone interview. Afterwards, I didn't hear from them until 2-3 months later (despite a follow up), and it was a simple form email from HR rather than from my initial contacts.", "Interview Questions": "What are my plans in working together with the faculty?"}, {"date": "13 Apr 2018", "title": "Program Management Office Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of the Pacific (Stockton, CA) in Dec 2017", "Interview Descriptions": "Phone Screen, moving to and in person where I had to complete a slide deck and present how I would bring value to the organization.  I presented once to their leadership and once to the team I would lead.", "Interview Questions": "Ho do you coach and mentor your team?"}, {"date": "17 Nov 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of the Pacific (Stockton, CA)", "Interview Descriptions": "Phone with Human Resources, followed by a video interview with a hiring committee made up of faculty and staff,  followed by 2-day on-site interview with campuses in Stockton, Sacramento and San Francisco.", "Interview Questions": "How will you engage faculty?"}, {"date": "5 Nov 2017", "title": "Customer Engagement Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of the Pacific (Stockton, CA)", "Interview Descriptions": "I had one interview in person and it lasted about an hour.   I had been hired right on the spot.  I didn't know much about the alumni project but I had one lady interviewing me and she seemed to have not cared that much.", "Interview Questions": "What I knew about the alumni project"}, {"date": "24 Aug 2017", "title": "Insurance Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of the Pacific (San Francisco, CA) in Aug 2017", "Interview Descriptions": "The interview process was so long. I had to come in for an initial interview with the department manager then they had me fill out forms for a background check. They said they would contact me in two weeks for a typing test on the basics of microsoft office. After they do a Panel interview with 3-4 people.", "Interview Questions": "Tell me about yourself?"}, {"date": "16 May 2018", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of the Pacific (Stockton, CA) in Aug 2017", "Interview Descriptions": "Simple.  I was hired on the spot. Asked questions that you should be able to answer in an interview (strengths and weaknesses. time you failed and succeeded). Was very relaxed interview and loved working", "Interview Questions": "What type of boss do you work with best?"}, {"date": "14 Jul 2016", "title": "Title IX Coordinstor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at University of the Pacific (Stockton, CA) in Jun 2016", "Interview Descriptions": "I submitted an application online in March. I was contacted in April to interview by telephone. I interviewed by telephone two weeks later. I heard nothing. \r\n\r\nTwo weeks later in May, I was notified by a reference that they were contacted (without my knowledge). I followed up with the school. I finally heard back. They wanted me to come to campus. Initially it was one day. Then it became 3. They paid to fly me from the East Coast. I visited all three campuses. No time to think. One meeting after the other. The time scheduled with some was too short, with others too long. I had to give a presentation.  Driven by Lincoln Town car to all locations. \r\n\r\nI was told on campus  they were going to check my references. (They lied. They didn't.) I was asked to think about where I wanted to put my office. (Strange) They took me on a residential tour and to see a marina (neither on schedule). \r\n\r\nThey required me to interview with yet another person by telephone when I returned from my overnight flight home. I did. I sent thank you notes to each individual person. I heard back from some, not others. \r\n\r\nI left Thursday evening, arriving home on Friday AM. I interviewed by telephone with the last person on Saturday afternoon (we tried to interview on Friday, but I missed the call - go figure; I called back, and heard nothing to Saturday).  Monday was July 4. I followed up on Monday July 11.  That afternoon I received an email from the a senior staff member who was my contact throughout claiming to have hired someone who had experience the opposite of mine. \r\n\r\nThe senior staff member, who was my contact, stopped responding. A secretary referred me to a low level staff person for reimbursements. This person's email responded on July 12 with an auto-reply saying she was out until the 25th. Yah. I haven't sent them yet. Why rush. No one is there to help me. \r\n\r\nOverall - they did a good job of being phony. They kissed my butt while I was there, but they never intended to hire me. I was the national candidate. They were dishonest in things they told me. Ultimately, they hired someone the opposite of me, who had a lesser pedigree than I had, and I felt it was a waste of time and resources.  The person they did hire was the same age and had the same look as the President. \r\n\r\nTheir behavior afterward, scurrying under a rock, ruined any good impression they gave me. I felt used and they clearly chose to cater to the chosen one, rather than wrap up their interaction with me in an appropriate way. It was a little too Los Angeles for Northern California. \r\n\r\nI wish I hadn't gone through the process. I feel like a used, discarded date.  How ironic.", "Interview Questions": "During Campus Visit: Have you ever done a Title IX investigation on a college campus?"}, {"date": "27 Oct 2017", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of the Pacific in Jan 2016", "Interview Descriptions": "This was a relaxed, mostly conversational interview. The employer asked more about my experience with calling and how I would effectively call constituents in a case to case scenario. The whole interview lasted a total of thirty minutes and was not hard at all!", "Interview Questions": "How would you handle a situation in which a caller is upset with the institution?"}], [{"date": "25 Jun 2015", "title": "IT Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of the Pacific (Stockton, CA) in Feb 2015", "Interview Descriptions": "Very straight forward. Phone screen with hiring manager.  Then an invite to the campus for a face to face and almost immediate feedback. Thorough panel interview with fair questions.", "Interview Questions": "Situational Decision making questions"}, {"date": "6 Feb 2015", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of the Pacific (Stockton, CA) in Jan 2015", "Interview Descriptions": "There are two interviews, one with a faculty member and one with a student.  There is also a writing portion and a tour of the campus.\r\n\r\nThe questions seemed were very typical.  They seemed to be picking a few from a list they had.\r\n\r\nThe entire staff was friendly and helpful.  The school presented itself in a very warm manner as opposed to a colder and dry approach that is expected in the professional world.", "Interview Questions": "What would you say is unique about yourself?"}, {"date": "17 Nov 2014", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of the Pacific", "Interview Descriptions": "Multiple panel interviews spread over 3.5 hours. Very fair questions, but the delve into every area of the job description, and you need to be detailed in answers. Had a 1-1 interview with my boss, a 1-1 with someone in a similar position in another department, and a large 5 person panel of other people influential with my boss.", "Interview Questions": "There was a question about some small job description detail that I had forget about - don't do that."}, {"date": "4 Dec 2015", "title": "Recreations Service Host Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of the Pacific (Stockton, CA) in Oct 2014", "Interview Descriptions": "First you would apply online through Tiger Jobs. I was then contacted by phone to schedule a 1 on 1 interview with the Director of Athletics. I received a 2nd call a few days later for a follow up interview with the Assistant Director of Athletics. The second interview is always with the Assistant Director. Both interviews were personality based. No technical or skill based questions were asked.", "Interview Questions": "Define \"diversity\""}, {"date": "9 Feb 2017", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of the Pacific (Stockton, CA) in Oct 2014", "Interview Descriptions": "There are two interviews: One was a group interview where you participated in various activities with a group and are supervised by current ambassadors. Some of the activities included meeting the other interviewees with ice breakers and creating a skit with your group members. The second interview is a regular panel interview of 3-4 people who asked a few questions and record your response.", "Interview Questions": "Sell the university to us."}, {"date": "13 May 2014", "title": "Information Commons Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at University of the Pacific", "Interview Descriptions": "It was a group interview, mainly asked situation based questions. For example, describe a situation where you've had a  conflict with another team member. How did you handle the situation? How well is your knowledge with technology (Mainly Windows and Mac)? Describe software you are proficient in. Describe a challenge you face at another job, school, etc.", "Interview Questions": "Describe a situation where you've had a conflict with another team member, "}, {"date": "23 Mar 2018", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of the Pacific (Stockton, CA) in May 2014", "Interview Descriptions": "The interview was very casual and friendly.  As a former student, I had an upper hand in knowing some of the staff from various interactions as a student. I talked with 3 different people in the office that I would work closely with. Each were one and one, in person interviews at the office.", "Interview Questions": "Why do you want to work for us?"}, {"date": "14 Aug 2013", "title": "Administrative Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of the Pacific (Stockton, CA)", "Interview Descriptions": "General interview reviewing initial application. There was a description of the department given as well as the expectations of the position. Pretty basic and easy.", "Interview Questions": "N/A"}, {"date": "7 Mar 2013", "title": "Systems Administrator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of the Pacific", "Interview Descriptions": "Usually starts wiht a review of the resume and then a phone interview. If you qualify then moves on to the in person and could be a couple of these before a decision is made.", "Interview Questions": "N/A"}, {"date": "8 Nov 2012", "title": "Biology Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at University of the Pacific (Stockton, CA)", "Interview Descriptions": "Virtually all incoming graduate students into the Masters of Biological Sciences program get the option to receive a Teaching Assistant position. There is no interview for this process. There was also no interview for me to get into the program, but I was already an undergraduate at the university. I hear now that there is an interview to get into the program, but I have no details about the questions asked.", "Interview Questions": "N/A"}], [{"date": "28 Jul 2015", "title": "Summer Temp Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at University of the Pacific (Stockton, CA) in Apr 2012", "Interview Descriptions": "Panel interview of three people. Each asked a different question regarding the position. Mainly asked about your experience and your views on safety and diversity. Because this isn't an interview for like an office job, you didn't need to dress up for the interview. Jeans and a shirt is fine.", "Interview Questions": "Do you clean your house on a regular basis? If so, explain."}, {"date": "12 Jul 2012", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of the Pacific (Stockton, CA) in Apr 2012", "Interview Descriptions": "My initial interview was with a panel of five.  I was very surprised by this and felt a little nervous.  However, the interview went extremely well and I quickly felt very comfortable with everyone in the room.  Most everyone was very nice, however, there was one person in the interview who I felt uncomfortable with.  Either way, I left the interview feeling confident that I had done well and knew that I would accept an offer if they gave it.  Within the same week, I was called to meet with the head of the department for a second interview, 1:1.  I was much more nervous in this interview.  Unfortunately, the person I interviewed with did a lot of talking, but not very much listening.  By the time I was done with the interview, I knew all about them, but they knew very little about me.  Wait, who was interviewing who?!  After that meeting, I was so unclear about the interview that I left feeling unsure about whether or not I still wanted the position.  I was called the following day and offered the position, so I ultimately accepted.", "Interview Questions": "Tell us something about you that we may not know."}, {"date": "28 May 2012", "title": "Student Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of the Pacific (Stockton, CA) in Aug 2011", "Interview Descriptions": "Very easy and you only needed good grades.", "Interview Questions": "N/A"}, {"date": "2 Jul 2014", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at University of the Pacific (Stockton, CA) in Oct 2010", "Interview Descriptions": "Apply via the University's job site on main page (www.pacific.edu). Most jobs are reviewed by a committee who will then call applicant for an interview. Not required that applicants are notified that they will not be called in.", "Interview Questions": "Questions on support for diversity. "}, {"date": "6 Apr 2013", "title": "Technical Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of the Pacific (Stockton, CA) in Apr 2010", "Interview Descriptions": "Hiring process was pretty straight forward I expressed my interest in the position to the supervisor and handed him my résumé.. Since my position was a student job I got a call before the semester started and was asked a few simple it related questions like what is SATA", "Interview Questions": "How do you remove hard drive from a computer without touching it"}]]