[[{"date": "17 Apr 2023", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Otterbein SeniorLife (Marblehead, OH)", "Interview Descriptions": "Sent in application, scheduled interview with head hunter, then one on one interview with Director of campus and with Regional manager finally panel interview with Leadership team, received offer shortly after.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "20 Sept 2022", "title": "Grounds Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Otterbein SeniorLife", "Interview Descriptions": "Very nice and laid back questions about yourself/skills and what you can bring to the company.  Walks through general day and what you will be doing day in and day out. ", "Interview Questions": "What will you bring to us?"}, {"date": "11 Sept 2021", "title": "STNA/CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Otterbein SeniorLife (Perrysburg, OH) in Sept 2021", "Interview Descriptions": "Got a call within 24hrs after submitting my app, had a phone interview & scheduled for orientation. Quick,painless & concise.  Ive learned for interviews in this field its Best to be very honest, be Yourself, & show Why you're good for this role.", "Interview Questions": "Why I chose this field"}, {"date": "16 Mar 2023", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Otterbein SeniorLife in Mar 2021", "Interview Descriptions": "Interview process was great! I was emailed an offer letter within a day or two. The hiring process was pretty quick as well. I interviewed over the phone first then went into the facility for an in person interview.", "Interview Questions": "Could you be a team player"}, {"date": "24 Feb 2020", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Otterbein SeniorLife (Pemberville, OH) in Jan 2020", "Interview Descriptions": "The hiring process was easy. Set up an in person interview, answered a few select questions, did the drug test (mouth test) at the interview and also did the background check then and there. Started training the next week.", "Interview Questions": "Tell me about a time when you had many tasks to do... How did you prioritize them?"}, {"date": "4 Oct 2019", "title": "Housing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Otterbein SeniorLife (New Albany, OH) in Sept 2019", "Interview Descriptions": "I showed up early to meet my interviewer at the specified location - interviewer wasn’t there! After standing around and searching for an entrance and place to speak with someone, an executive from HR happened to show up. (Not my interviewer). This person contacted my interviewer, and there I learned that my initial interviewer would not be able to interview me that day. \r\n\r\nThe HR person from home office visiting that day decided to do an impromptu interview with me there in that room, and it became very clear from that moment on that it would have been a poor fit for the both of us. They really talk a lot about the “faith based” aspect of the job, which is only a footnote in the listings. \r\n\r\nIt was completely a waste of my time.", "Interview Questions": "How do you manage expectations?"}, {"date": "13 Aug 2019", "title": "Elder Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Otterbein SeniorLife", "Interview Descriptions": "Basic interview, background check, TB test then orientation which is really just signing papers but it takes forever to get it scheduled. Aids have to go through two orientations. One general then one specifically for aids.", "Interview Questions": "Can you cook?"}, {"date": "21 Mar 2019", "title": "Elder Assistant (STNA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Otterbein SeniorLife (New Albany, OH) in Mar 2019", "Interview Descriptions": "Quick interview with Guide.  Was given an offer letter during the interview, and was emailed information about Orientation that was the next week.  The interviewer was very nice, and friendly during the interview.", "Interview Questions": "What is your experience?"}, {"date": "14 Feb 2020", "title": "Director of Culinary Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Otterbein SeniorLife (Saint Marys, OH) in Nov 2018", "Interview Descriptions": "3 rounds of interviews. Once with administrator, management team and panel of residents from the dining committee. I was a current employee at another location and was asked to apply for the open position. The process for an outside candidate would be longer and require more steps. Senior management would need to interview as well.", "Interview Questions": "How will you approach the resident dining experience "}, {"date": "20 Feb 2018", "title": "Licensed Practical Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Otterbein SeniorLife (Gahanna, OH) in Feb 2018", "Interview Descriptions": "The process was one interview at the Gahanna location. I was interview by the admissions director because they had a new DON. I felt the interview went well. He even gave me his cell phone number incase I had any further questions after the interview. He also told me that he would call me the next day if not that Monday after with either a job offer or decline. I never received any call. I was shocked that he would give someone his phone number and not even call them to inform them of no offer.", "Interview Questions": "They asked me if what I put as my requested pay was what I was currently making  at my current job, which I thought was rather unprofessional. "}], [{"date": "12 Sept 2016", "title": "Housing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Otterbein SeniorLife (Gahanna, OH) in Sept 2016", "Interview Descriptions": "I applied online and received a call within 1-2 business days. A man called me and had my resume with the application in front of him, and started asking me questions about my background. He then asked did I have any additional experiences other than what was on the job description. I explained my background to him and he stated they will be pursing other candidates. He then ended the phone call. The skills and experiences he asked me about were not even listed on the job description.", "Interview Questions": "What additional experiences do you have?"}, {"date": "4 Aug 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Otterbein SeniorLife (Lebanon, OH) in Apr 2015", "Interview Descriptions": "Brief and comfortable, I interviewed with upper management and had a great experience doing so. I was not very nervous and process was simple and easy. I would research the company prior to a interview though.", "Interview Questions": "N/A"}, {"date": "5 Jan 2018", "title": "STNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Otterbein SeniorLife (Monroe, OH) in Jan 2015", "Interview Descriptions": "I showed up for the interview and they told me what positions were available and asked what I types of shifts would work for me. It was super easy and the one interviewing me was kind. I signed on within 15 minutes.", "Interview Questions": "Why I wanted to work at Otterbein"}, {"date": "5 Dec 2016", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Otterbein SeniorLife (Pemberville, OH) in Jul 2013", "Interview Descriptions": "I was called by the HR Administrator to set up an interview with the DON. Upon my arrival I was interviewed by the DON and another head nurse. I was questioned for approximately 30 minutes and was offered a job on the spot before they even called any of my references. My references were not even called until after two weeks that I was already working there.", "Interview Questions": "Like most employers now a days I was asked to tell about myself."}, {"date": "29 Sept 2015", "title": "Cook Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Otterbein SeniorLife (Marblehead, OH) in May 2013", "Interview Descriptions": "Easy, straightforward.  One with executive director or human resources. Then one with director.  Went over job expectations and my experience.  Talked about what to expect when you get hired.  Require background check and preemployment drug screening.  I heard back in around a weeks time.", "Interview Questions": "How would you handle a confused resident?"}, {"date": "17 Mar 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Otterbein SeniorLife (Lebanon, OH) in Jan 2012", "Interview Descriptions": "They are so desperate for nurses, if you have a pulse, you get hired. must pass background check and drug screen, one on one interview with DON, must be able to work additional shifts because you will get mandated to work overtime, if you like to work many hours in a row this is the place for you", "Interview Questions": "Why do you like working in Long Term Care?"}]]