[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Challenging but fulfilling work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Apr 2022", "job_title": "Nurse in Syracuse, NY", "duration": "N/A", "pros": "Driven individuals and teams that want to make an actual difference.", "cons": "Rapidly changing healthcare policies and regulations create challenges that must be addressed quickly by both individuals and teams."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good for starting my expetience", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Jun 2023", "job_title": "Counselor II in Syracuse, NY", "duration": "N/A", "pros": "Benefits Bonuses Attempt at boosting morale", "cons": "Overworked Patient to clinician ratio high Lacking in diversity"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Enjoyed it in the beginning, but burn-out set in quickly.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Mar 2023", "job_title": "Counselor Aide in Rochester, NY", "duration": "N/A", "pros": "-Start accruing vacation and wellness time immediately - begin with 10 vacation and 12 wellness days per year -Working with patients is awesome!", "cons": "-Lack of support on evening and night shift -No evening or night shift differential for clinical staff, little pay in general -Minimal supervision on evening, no supervision on overnights -Conflicting directions from members of leadership -Massive lack of communication and direction from leadership -Coworkers not reprimanded for breaking important guidelines -Onboarding and training is not adequate for the job that's worked"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "11 May 2023", "job_title": "Licensed Practical Nurse (LPN) in Binghamton, NY", "duration": "N/A", "pros": "Good money and love helping patients", "cons": "Short staffed and can be very busy"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Many responsibilities with very little training or compensation", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Jan 2023", "job_title": "Case Manager in Syracuse, NY", "duration": "N/A", "pros": "It is fulfilling to help people on their recovery journey.", "cons": "There is no training on actual job responsibilities including zero training about different substances/their effects. However, it was discussed that there’s a plan in place to fix this. Employees are often asked to enter unsafe situations without much of a plan in place. Program money is spent on things such as new cars and technology, but wages are extremely low for employees."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "The best in the industry!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Apr 2022", "job_title": "Anonymous Employee in Syracuse, NY", "duration": "N/A", "pros": "Helio is one of the best companies to work for in the industry. I have experience working at several other companies in healthcare, and I know for a fact that none of them are better than here. The work environment is just phenomenal. Even though the workload can feel a mile high at times, everyone in the office stays upbeat and positive and we work together to get it done. Management is great in that regard – they don’t hire people with bad attitudes.\r\n\r\nThere’s no toxicity. No cutthroat competitiveness. No pettiness. No drama. Nothing you’d expect to find at such a large, established company. I was blown away when I first got hired on and I kept waiting for the “other shoe to drop”, so to speak. But it’s been over 4 years now and it’s exactly as healthy and supportive of an environment as it’s been since day 1.\r\n\r\nI can’t imagine working anywhere else. If all goes according to plan, I’ll be retiring from Helio in about 35 years.", "cons": "The only thing I can say is that my opinions of the company are based solely on my own experience here. I would guess that other employees have similar experiences/perspectives, but I can’t guarantee it and I don’t want to speak for anyone but myself. And as far as any cons that I’ve experienced during my time at Helio, I don’t believe there are any."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Work", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Jan 2023", "job_title": "Counselor Aid in Binghamton, NY", "duration": "N/A", "pros": "You will Get to help patients", "cons": "It sometimes feel like they care more about patients than workers. Short staffed"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Incredibly rewarding experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Apr 2022", "job_title": "Counselor in Syracuse, NY", "duration": "N/A", "pros": "Working here has been one of the most rewarding experiences I could have ever asked for. I start my day knowing the work I carry out each day has a direct impact on the lives of many different people. My colleagues are friendly and supportive and driven and generally all-round inspiring people, whom I really enjoy working with. I have worked at a lot of different mental health service providers, but this one feels the most right. Here, I have a strong sense of pride and at least for the foreseeable future, cannot imagine working anywhere else.", "cons": "It is evident in other reviews that this place definitely has had its ups and downs. The good news is these times are now over, thanks in part to the work senior management did by working hard to address any issues head on. Communication is more transparent than ever before. It would have an easy and maybe even understandable to tighten the reins on employees, but instead a culture of support and personal development has been put in place."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "No Concern for staff", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Dec 2022", "job_title": "Counselor in Syracuse, NY", "duration": "N/A", "pros": "The work is rewarding watching people recover", "cons": "Management does NOT care about their employees"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "A positive experience from the word go", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Nov 2021", "job_title": "Anonymous Employee in Syracuse, NY", "duration": "N/A", "pros": "From the moment I went into my interview, to accepting a position, to my where I am currently with the company, I’ve had nothing but a positive experience here! Everyone on the staff is welcoming and friendly. You get recognition by management for great work and immediate assistance if you’re struggling with anything. Everyone is there to help each other out and if someone needs help in one department, you can bet it’s going to be a collective effort to get the problem solved. Even though the company has several different departments we all make up ONE cohesive unit as a company, and that’s why teamwork is not only expected within a department, but throughout the entire organization. The benefits and pay are well within reason and I’ve never not received a pay increase after a review... plus, if you ever need time off they’re very accommodating. I personally haven’t had a single request rejected since I started (although to be fair, I always give ample heads up). All in all, I would recommend anyone looking for a job to apply here… you never know, it could be the perfect fit!", "cons": "Every company has its ups and downs but if you work together you can accomplish anything! There are cons to working here to be sure, but it’s mostly because we are so busy. That being said, when everyone is on their A game and we have all the people we need, we’ve never had issues pulling through."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "5 star patients, -0 star management", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 May 2022", "job_title": "Counselor Aide in Binghamton, NY", "duration": "N/A", "pros": "Patients are the only pro", "cons": "Everything. Condescending & unorganized management"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "My experience at Helio", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Mar 2022", "job_title": "Staff RN in Syracuse, NY", "duration": "N/A", "pros": "One of the best parts of this company is how easy it is to believe in what we do. Not only am I proud to work here, but I’m honored. Every day I come to work, I know that what I’m doing makes a difference. And everyone else who works here knows that, too. We’re all happy to be here, and I can feel the happy energy every morning I walk into work. This job showed me my mission and I’m going to spend the rest of my life trying to help make sure people get the help they deserve. Helio is just the first step in that process.", "cons": "It’s a continuously evolving field, and there’s a lot to learn. But I like that I’ll never stop learning!"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 5, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Not Supportive of Employees Unless You're \"Leadership\"", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Mar 2022", "job_title": "Counselor Aide in Rochester, NY", "duration": "N/A", "pros": "Being there during the admission process with family members and friends and helping someone take the big step of asking for help.\r\nCo-workers are cool, like a family (also gossips and is dysfunctional like a family)\r\nHelping someone who WANTS the help!", "cons": "Most patients are frustrated that they're there and take it out on you.\r\nPatients take anger out on you, PTSD out on you, defiance to the rules they don't agree with.\r\nManagement AKA Leadership changes the rules every week. Such as where patients can and can't go in the building. Your job is enforcing the new rules and taking the heat of the backlash because patients are vulnerable and emotional.\r\nLeadership's attitude is \"that's a you problem. This place gives you everything you need\" and they do not back down from that detatched attitude. Everything wrong is the CAs and the Nurses' fault. We complain too much, we're all jaded and grouchy, we aren't staffed because of too many call-ins. \r\nThe call-ins and quitting comes from burnt-out under-paid over-worked, under-appreciated and sometimes overqualified co-workers always in a bad mood and always launching into speeches about how Helio sucks. \r\nAll new employees get one or two days of orientation with slide shows, then they throw you onto the floor with no proper training in the database program, the medical charts, the MSFT Teams program..... you have to learn every little thing from whoever's around and knows how to do it"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Growth opportunities across all roles", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Mar 2022", "job_title": "Anonymous Employee in Syracuse, NY", "duration": "N/A", "pros": "The company is always growing and opportunities for career advancement are excellent. The leadership is very dedicated to provide the counselors and other teams a high level of support that adds to high job satisfaction and excellent patient care and outcomes.\r\n\r\nUltimately, I really enjoy working for this company. They are also very flexible and understanding of your personal life.", "cons": "Very few! Working for a company that’s been around for so long does have some challenges, but most of them are good ones."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Amazing opportunities in a short period of time", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Apr 2022", "job_title": "Counselor Aide in Syracuse, NY", "duration": "N/A", "pros": "Even after only a few months with the company, I’ve had the opportunity to take on projects solo and even direct other aides! This is definitely a company to work for if you want a job you can turn into a career.", "cons": "Management has their favorites just like anywhere else. My advice, excel at your job and get on their good side. Then you won’t be on the outside looking in."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Love this company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Mar 2022", "job_title": "Licensed Practical Nurse in Syracuse, NY", "duration": "N/A", "pros": "Supportive management & clinical team, upper-level managers truly care about you - fast & effective communication, ready & willing to answer ANY questions or concerns. Each therapist - no matter which discipline, is friendly, ready to talk about each patient to help them make best possible outcomes. Has a productive & \"feel good\" kind of atmosphere.", "cons": "I can’t think of any cons."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great culture, exciting work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Jan 2022", "job_title": "Internship in Syracuse, NY", "duration": "N/A", "pros": "The staff here is very nice and collaborative. Work arrangements are flexible, and the company offers a very generous work from home policy. Hard work is appreciated. Additionally, working here can feel very exciting, there’s continuously new things to work on. Development is fun when you can so closely see the clear, positive impact it's having on the lives of individuals.\r\nProbably my favorite thing about the company is that the hard work I've put in is quickly appreciated and readily noticed by upper management. Two weeks into productively contributing I was getting positive feedback from peers and my superiors.", "cons": "It can be emotional. You have to make sure to take care of yourself when you’re handling so much emotion at once."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Mission-driven company with dedicated employees", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Nov 2021", "job_title": "Counselor Aide in Syracuse, NY", "duration": "N/A", "pros": "I was drawn to Helio because of how altruistic the job is, and how devoted to the mission the employees are. Once I started, I realized that the people that work for Helio are all incredibly passionate about delivering on said mission. Personally speaking, I work for a manager that is maybe the best I have ever had. She is thoughtful, caring, empathetic and a wonderful patient teacher. I love my work, I feel like I have the right balance of autonomy when I need it and support when I need it.", "cons": "At the moment, there doesn't seem to be any room for career growth in terms of promotion, at least in my role, but I am happy to just be along for the ride and learn as much as I can in the moment, especially, since I just started a few months ago."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Inspiring people and mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Feb 2022", "job_title": "Mental Health Counselor in Syracuse, NY", "duration": "N/A", "pros": "This company has a wonderful culture and a phenomenal group of employees. The culture is positive with a great team dynamic. Collaboration is expected and teams work well together. Senior employees are encourage to share knowledge and mentor those who are newer and have less experience. The managers are effective and protect the best interests of their team and ensure that every employee’s hard work is recognized. Learning opportunities are plentiful and I receive training regularly. This is a great place to work where your hard work is appreciated, recognized and rewarded.", "cons": "Can be chaotic and disorganized at times."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Toxic and stressful", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 May 2022", "job_title": "Admissions Counselor in Syracuse, NY", "duration": "N/A", "pros": "Some good co-workers, and sometimes the clients make it worth it.", "cons": "Constant short staffed, administration is lacking everywhere and pay is low, not a good job and the higher ups do not care about you!"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Positive experiences here", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Feb 2022", "job_title": "Counselor Aide in Syracuse, NY", "duration": "N/A", "pros": "The center has a good focus on clinical excellence, serving the community, and providing the highest level of care to its patients. Where I worked had a warm and welcoming environment with a lot of openness to educating new graduates. The office coordinator was always ready and willing to assist with any insurance issues or general questions. The managers were all readily available to help if problems arose and did their best to provide solutions.", "cons": "Space could be an issue at times. Trying to fit patients into a small space while trying to social distance could be difficult."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "HR Specialist", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Jan 2022", "job_title": "Anonymous Employee in Syracuse, NY", "duration": "N/A", "pros": "I’ve been with the company for a few years now and it’s always felt more like one giant family than anything, but last year really showed everyone in the office (myself included) just how much those in management value us – and not just as employees, but as people. We were never once put in a position that would jeopardize our health in any way. Truly something to be commended.", "cons": "I wrote this review because I wanted people to know how well Helio handled the pandemic. In that regard, there are absolutely zero cons."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Overworked and Toxic", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Nov 2021", "job_title": "Counselor in Syracuse, NY", "duration": "N/A", "pros": "The clients are amazing people.", "cons": "When I worked there, managment seemed to frequently ask me for feedback on other employees, almost felt as if they wanted to know the dirt on my fellow employees. There were camera's there I initially thought were for clients, but they seemed used more so to monitor employees like lab rats. I constantly felt watched. I saw a fellow employee burst into tears due to the work environment and quit the next day. I was also told that I could not talk to my fellow employees, and teamwork seemed frowned upon. It always seemed as if we did not have enough people on staff, resulting in constant overtime, which was kind of nice, but then it seemed expected and negatively impacted a work life balance."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "No major complaints so far", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Nov 2021", "job_title": "Resident Specialist in Syracuse, NY", "duration": "N/A", "pros": "- Define your path. Somedays it can feel like a \"choose your own adventure\" as the company looks for new ways of doing things. It makes for a fun atmosphere for those with a more entrepreneurial spirit. \n\n- Collaboration. Limited egos, lots of opportunities to connect with your team and brainstorm solutions.\n\n- Smart people. Experts in their respective fields with a lot of knowledge. You learn from literally everyone. \n\n- Generous PTO. Which we are actually encouraged to take. Nice to see company that truly supports its people taking a break when needed.", "cons": "- Starting salary is low. They low ball you at the beginning. I think it’s to see who’s really worth the long-term investment, but I hope this goes up quickly."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to wo", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 Mar 2022", "job_title": "Counselor II in Syracuse, NY", "duration": "N/A", "pros": "Can’t say enough good things about HH. It’s a great place to work and one of the best in the area.", "cons": "The standards are high. But while this is a huge con to some, I’m a very hard worker and a bit of a perfectionist so it doesn’t bother me as much."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Helio Health is a great company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Dec 2021", "job_title": "Anonymous Employee in Syracuse, NY", "duration": "N/A", "pros": "I joined the Helio Health Team just over 6 months ago and I couldn’t be more thrilled about my decision to join the team. Everyone I have met and work with is passionate about showing up to work and the outcomes for patients and clients. The leaders do a great job communicating and sharing the vision of the company.", "cons": "There is so much growth and opportunity at this company that it can be a little hard to digest all the opportunities at once."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Just ok", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "29 Mar 2022", "job_title": "Counselor in Syracuse, NY", "duration": "N/A", "pros": "Great mission and gives plenty of food and ice cream to employees l.", "cons": "Lack of communication and lack of support."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "You’ll learn a lot", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "31 Mar 2022", "job_title": "Anonymous Employee in Syracuse, NY", "duration": "N/A", "pros": "I learned a lot! The people here are amazing and all incredibly talented!", "cons": "There isn’t as much room for growth as I initially thought."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Amazing company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Jan 2022", "job_title": "Anonymous in Syracuse, NY", "duration": "N/A", "pros": "*Many different opportunities and paths to grow \r\n*Continuing training and amazing resources\r\n*Constant updates from management on the state of the company\r\n*Open lines of communication with upper management \r\n*Warm, friendly, and knowledgeable colleagues that are alway willing to work together or help you out", "cons": "*You can’t fake performance! If you want to do well here, you actually need to perform well."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Meaningful work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Nov 2021", "job_title": "Anonymous Employee in Syracuse, NY", "duration": "N/A", "pros": "The company’s mission is powerful and does a lot of good for the world. It’s easier to go to sleep at night knowing that I’m working for a company that is doing its part to help people heal from their mental health issues. Now that I’ve started working for a company that makes such a positive impact on society, I don’t think I’ll ever be able to go back to working somewhere with a mission I don’t believe in.", "cons": "I haven’t found one yet."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Amazing organization", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Mar 2022", "job_title": "Anonymous Employee in Syracuse, NY", "duration": "N/A", "pros": "Great work environment\r\nHealthy work/life balance\r\nFriendly coworkers\r\nPurpose-driven job", "cons": "Communication about changing policies or processes"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "ALL pros, NO cons", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Feb 2022", "job_title": "Counselor in Syracuse, NY", "duration": "N/A", "pros": "EVERYTHING…\r\nHelio Health sets the standard for every employer.", "cons": "NONE…\r\nThere isn’t anything I don’t like about working here."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "What I wish I knew:", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Aug 2021", "job_title": "Counselor II in Syracuse, NY", "duration": "N/A", "pros": "- They do go above and beyond to try their best to keep staff by offering a lot of incentives and swag. \n- Many of the supervisors are wonderful clinicians with great knowledge to offer but limited time to teach. \n- Working in the SUD/MH field can be challenging but is also beautiful and rewarding.\n- Great tech. No out of data systems. \n- Beautiful building (located in dicey area)", "cons": "THE ***NEW EMPLOYEE*** PARKING LOT IS 3 MILES FROM THE BUILDING!!! There is a guy they pay to drive employees back and forth but he is not always there. I end up walking almost every other day. It's approx. 6-7 minute walk down N. Salina Street under the bridge. Every counselor is expected to do one late night a week until 8pm as well. \n\nFlashy swag and incentives are offered in lieu of supporting employees and making necessary changes to better serve the community. Self-care is a must in a community clinic of this size because you see patients back to back all day long, no time to use the bathroom, lunch breaks are spent catching up on notes in front of the computer, case load size is between 50-80. There is no cap on case loads and you do not have the option of saying no if you don't feel comfortable taking someone. Everyone must take a group, even if you do not feel comfortable or aren't good at running groups, there are no guidelines created so you make up the material as you go along. Leadership makes decisions from the top down for clinicians but many of them have never held a clinical role themselves or functioned at the same capacity. You are expected to complete multiple reoccurring assessments with patients all the times. Patients become angry because you spend so much time asking questions, it's not therapy. We are just data collectors."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "I enjoyed working here", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Dec 2021", "job_title": "Counselor in Syracuse, NY", "duration": "N/A", "pros": "I enjoyed my time at Helio Health. It’s a good, strong company with a solid reputation throughout the country. It looks good on your resume and it’s an excellent opportunity to get your foot in the door.", "cons": "I don’t have anything bad to say about this company."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Highly recommend", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Dec 2021", "job_title": "Anonymous Employee in Syracuse, NY", "duration": "N/A", "pros": "Great wages, opportunities and excellent team. Great opportunities for networking. Was able to keep my schedule flexible to accommodate my life outside of work as well (no “sell your soul to the devil” deals here). Highly recommend if you’re offered the opportunity.", "cons": "No cons. It was a great company to work for."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Excellent employer", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Dec 2021", "job_title": "Licensed Practical Nurse in Syracuse, NY", "duration": "N/A", "pros": "Everyone I worked with was not only responsive, but was genuinely concerned about doing an excellent job. Everyone is responsive to suggestions for improvement of processes. They really care about patients and staff.", "cons": "I genuinely can’t think of any"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Exciting opportunities to work in healthcare!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Dec 2021", "job_title": "Anonymous Employee in Syracuse, NY", "duration": "N/A", "pros": "Allowing individuals to work and advance on their skillsets, both individually and professionally", "cons": "In certain areas, improving lines of communication"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "Work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Nov 2021", "job_title": "Counselor Aid in Binghamton, NY", "duration": "N/A", "pros": "Bonuses, holiday pay for the major holidays, great PTO and wellness", "cons": "Unorganized at times, no shift differential for CA’S which is unfair, over worked"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": "N/A", "review_title": "no", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Feb 2022", "job_title": "DataEngineer in Bethsaida, AL", "duration": "N/A", "pros": "i cannot say anything about", "cons": "they are good i believe so far"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "This is great.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Nov 2021", "job_title": "Director in Syracuse, NY", "duration": "N/A", "pros": "What a wonderful company to work for.", "cons": "Always looking for ways to improve."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": "N/A", "review_title": "Helio", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Sept 2021", "job_title": "Counselor Aide in Syracuse, NY", "duration": "N/A", "pros": "Flexible hours, company considerate of personal matters", "cons": "Very little security measures in place, take advantage of willing employees"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great employer", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Aug 2021", "job_title": "Counselor II in Syracuse, NY", "duration": "N/A", "pros": "Supportive management, creative problem solving, believed in continued learning opportunities and growth.", "cons": "Salary, parking, difficulty contacting some members of the interdisciplinary team."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Too overworked", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Aug 2021", "job_title": "Social Worker%2FCase Manager in Syracuse, NY", "duration": "N/A", "pros": "There are no pros for the job at this place", "cons": "The pay, the treatment, the atmosphere, the attitudes, the overworking"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 0, "review_title": "Review", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Jun 2021", "job_title": "Licensed Practical Nurse (LPN) in Rochester, NY", "duration": "N/A", "pros": "Work independently and great social interaction with clients", "cons": "Told to do thing outside scope of practice"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Burn Out", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Feb 2021", "job_title": "Counselor Aide in Rochester, NY", "duration": "N/A", "pros": "Being able to help people is great- when they let you", "cons": "Burn you out\r\nOver schedule you\r\nDo not treat clients well\r\nManagement asks you about personal information"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good Company", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Nov 2020", "job_title": "Counselor Aide in Syracuse, NY", "duration": "N/A", "pros": "Opportunity to work a lot of shifts if wanted", "cons": "I do not have any"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Poor Leadership", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Aug 2017", "job_title": "Counselor in Syracuse, NY", "duration": "N/A", "pros": "I did learn a lot at my time with SBH.  There are some very talented people that are employed there.  SBH offers a wide range of services to the community.  It also has good employee perks", "cons": "Very poor communication from management on all levels.  Pay is poor for what they expect you to do.  Issues  throughout the agency from top to bottom.  A lot of  management is driven by emotion and makes poor decisions that effect the rest of the staff.  Poor supervision and guidance.  Very high stressed environment and the turnover rate for employees is concerning."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Counselor", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Dec 2018", "job_title": "Counselor in Syracuse, NY", "duration": "N/A", "pros": "I’m working on getting credentialed then I’m leaving as soon as I can. Just like the intern on here had posted, do your research and type in Helio Health or or their previous name Syracuse Behavioral Health in the news. Helio is not very well respected within the community.", "cons": "If you want to work somewhere where drug deals occur  in the waiting room, this is the perfect place for you. Working here has been awful within the past year. The horror stories you hear from other people who used to work here is unbelievable. The recent reviews left on here must have come from HR or administration because not many people have that much respect for the “visionary leadership” as they call themselves. Within outpatient, the supervisors are inexperienced and lack clinical skills. Counselors can expect increasing caseloads, over 40 primary patients and groups on top of it. Upper management could care less about its employees and how they are treated."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Awesome Vision and Quality of Services", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "5 Dec 2018", "job_title": "Anonymous Employee in Syracuse, NY", "duration": "N/A", "pros": "This place has visionary leaders who really have a heart for improving access to care and quality of behavioral health care.", "cons": "Public behavioral health is sometimes challenging work and some clinicians are not onboard with behavioral health center of excellence concepts and quit or get fired rather than improve their skills."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Seen a lot of violations of patient rights,#1reason i am not employed@Sbh any longer!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Mar 2015", "job_title": "(Residential)CounselorII in Syracuse, NY", "duration": "N/A", "pros": "Some of the counselors are able to be more client centered rather than staff centered!Really making a difference in the lives of those effected by addiction in ANY way!", "cons": "Some staff are definitely more staff centered creating a sometimes VERY unsafe atmosphere for those trying to recover!"}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Nurses are not protected", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Sept 2018", "job_title": "Licensed Practical Nurse in Syracuse, NY", "duration": "N/A", "pros": "Pay is good,  People are friendly.  They offer a lot of services to the community", "cons": "administration is cold and not caring , Nurses are overworked and expected to work overtime. little to no training. no supervision or real supervisor for that matter.  There are some very unethical people that work there and it is pushed under the rug.  Management and HR turn a blind eye."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Good place to start", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Apr 2019", "job_title": "Counselor I- Inpatient in Syracuse, NY", "duration": "N/A", "pros": "I got a lot of good experience at Helio, formerly SBH. They do invest in their staff which was great.  Lots of company gear, regular staff meetings which was nice so everyone was mostly on the same page", "cons": "Bureaucratic- too many hands in the pot. Feels like the client has become more of a number these days ."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Grateful for what I learned; would never, ever go back", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 Aug 2017", "job_title": "Counselor I in Syracuse, NY", "duration": "N/A", "pros": "I learned a great deal, became close to my coworkers and immediate supervisor", "cons": "Poor pay, anxiety-driven atmosphere, unrealistic (read: impossible) expectations when it comes to productivity"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Bad place to Intern", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Dec 2018", "job_title": "Internship in Syracuse, NY", "duration": "N/A", "pros": "I can not really list any. Some people really act like  they care but you can’t tell if it’s genuine or not  ... burn out is so high.  They have good google results  showing stories with headlines “Drug dealer bolts rehab with counselor's aide: in romantic spree, a pregnant user dies”  or “Camillus mom sues drug rehab, counselor's aide after daughter's overdose death”  and “3 Syracuse men arrested for sex crimes involving 3 victims under 17” You may have to search under  Syracuse behavioral healthcare or Syracuse Brick house both aliases for the organization.", "cons": "As a Syracuse University social work intern placed at Helio I can say this place is far from doing any type of real social work. For a non for profit agency there main goal seems to be money. Their main focus is keeping their beds full regardless if this goes against  ethics.  They hire inexperienced counselors as well as  management.  Most of them are put in their positions for convenience and have no idea what they are doing.  The higher management at their IP doesn’t deserve the time of day. They are Incompetent, rude and present as  knowing  nothing’s about the social work competencies or the values and ethics of a licensed social worker."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Pray on the weak, No Teamwork", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Mar 2019", "job_title": "Counselor in Syracuse, NY", "duration": "N/A", "pros": "The learning experience you will gain from Helio is like no other.  You will learn how NOT to treat a population that is already stigmatized by the general public.  You will learn what poor supervision looks like.  You will learn what burnout feels like.  You will get to experience what it is like to be prayed upon by white privilege and if your lucky you may even get groped and a pay raise. By working for Helio you will learn what its like to monopolize an industry and how to slam the weak to the floor.", "cons": "Its interesting how the truthful reviews get pushed to the bottom and the two line positive ones are upfront. Helio does not have any ethics and follows no moral compass.  If you read over the other reviews, you are able to see what I am talking about.  You can over hear management soliciting employees to leave positive reviews on places like this.  The positive reviews left on here sound like scripted responses by upper management and HR gives a scripted response as well.  There is no detail to individuals.   There was a panic in the air when realistic reviews started to surface.  Glassdoor does a great job of allowing truthful reviews to remain and encourages other to speak out.  They are damaging both clients and professionals.  Their management is in place out of convenience and not out of talent.   There is no teamwork.  You will be stabbed in the back before you even know it.  As you are bleeding out they will ask you to resign instead of firing you to save them from paying unemployment. Supervision does not happen and there are no ways for you to process your caseload, transference issues or vicarious trauma.  Helio wonders why their employee retention rate is so low?  The higher management is making six figures and the front line staff will be lucky to make 30K a year.  This company s ruled by white privilege and continues to oppress people trying to make a living.  There are so many different opportunities in CNY don't be tarnished by Helio."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Unqualified Leadership & Nepotism", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Jun 2019", "job_title": "Anonymous Employee in Syracuse, NY", "duration": "N/A", "pros": "The paid time off was decent. They provide a lot of swag (shirts and jackets).", "cons": "The leadership is disgusting at Helio Health (formerly SBH). The CEO dictates EVERYTHING and doesn't take advise or criticism well. Most of the c-level employees are grossly unqualified and promoted based on who they know. Anyone notice the President/CEO and CMO are married? Is that not a conflict of interest? Consistently understaffed and under supported."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "You can change the name but not the reputation of Syracuse behavioral healthcare (SBH)", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "7 Sept 2018", "job_title": "Counselor in Syracuse, NY", "duration": "N/A", "pros": "Decent benefits and some people care.", "cons": "The CEO is a Predator as other have said. And if you work there long enough you will see and feel it as well unfortunately. To have HR discredit that experience is disgusting.  The management only cares about utilization and finances not about the people"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Overall a fine job", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 May 2020", "job_title": "Counselor Aide in Syracuse, NY", "duration": "N/A", "pros": "staff is supportive of each other and each department gets along with other departments.", "cons": "some of the management can improve by listening to their employees concerns and being better problem solvers. it has been noticed that some of the staff that are in recovery have been unfairly treated by management"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Team Oriented Atmosphere", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Jan 2016", "job_title": " in Syracuse, NY", "duration": "N/A", "pros": "Those I have worked with are extremely happy with their jobs and very dedicated to improving the lives of the people we serve.  SBH is family oriented and understands that family comes first.  They are also very supportive of your career goals.", "cons": "I cannot think of any cons at this time."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great organization to work for!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 Oct 2019", "job_title": "Program Director in Syracuse, NY", "duration": "N/A", "pros": "Great culture! Opportunities for growth. All leadership staff from CEO down are genuine and truly care about staff and population served.", "cons": "I had no negative experiences with the organization. Left to re-locate closer to family."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Family First Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Dec 2015", "job_title": " in Syracuse, NY", "duration": "N/A", "pros": "Benefit rich organization and family first culture.\r\nEveryone is always willing to work as a team and assist when needed.\r\nThe organization constantly looks for employee feedback from the bottom to the top and uses this feedback to make changes or implement new ideas.", "cons": "No cons with working at SBH."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Stay away!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Jan 2019", "job_title": "Licensed Practical Nurse in Rochester, NY", "duration": "N/A", "pros": "Co-workers get along for the most part.", "cons": "Pay, overworked, absentee director, management incompetent-always trying to pin medical vs clinical-plus they sre friends so they back each other up, you will be disrespected as a nurse-you will have no say in medical matters at all, it's almost cult-like there-employees are used to being treated poorly by managenent."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Incompetent", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Jan 2019", "job_title": "Mental Health Counselor in Syracuse, NY", "duration": "N/A", "pros": "I probably think it’s the Benefits,", "cons": "The Payment was not appropriate for the experience , Incompetent management, inexperienced leadership, far from “ visionary leadership” chaos to say the least, \nThe previous 5 stars are from HR personnel"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Demanding and Rewarding", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Mar 2019", "job_title": "Counselor I in Syracuse, NY", "duration": "N/A", "pros": "Excellent coworkers, excellent learning opportunities and professional development through frequent free trainings.", "cons": "As with any similar agency- a great deal of paperwork, difficult to establish a work life balance"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Disorganized", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 May 2019", "job_title": "Counselor Aide in Binghamton, NY", "duration": "N/A", "pros": "Decent pay for the area,  flexible scheduling,", "cons": "Mid level staff not always present, lack of clarity on rules and regulations"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Counselor Position", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Mar 2014", "job_title": "Substance Abuse Counselor II in Syracuse, NY", "duration": "N/A", "pros": "Very Professional environment leading toward a common goal", "cons": "Too friendly at times leading to misunderstandings and personal conflict"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Rewarding workplace", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Mar 2020", "job_title": "Counselor Aide in Syracuse, NY", "duration": "N/A", "pros": "Company is committed to helping the clients, above all else.", "cons": "Employees elsewhere in the field often remark at how much Helio employees work and how little they get paid."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good employer.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Sept 2019", "job_title": "Counselor Aide in Syracuse, NY", "duration": "N/A", "pros": "The team communicates well with eachother, very flexible and understanding supervision", "cons": "Burnout if you're not careful with self-care. that comes with the territory of the work."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Eye-opening experience", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Oct 2020", "job_title": "Counselor Aide in Rochester, NY", "duration": "N/A", "pros": "Always able to pick up extra hours\r\nWorks with diverse populations", "cons": "Unsupportive management\r\nLack of supervision\r\nInconsistent work expectations"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Helio Health", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Aug 2020", "job_title": "Counselor II in Syracuse, NY", "duration": "N/A", "pros": "Some diversity in staff, laid back environment.", "cons": "Some staff seem to be burnt out or heading in the direction. Not much direction."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "So so", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Feb 2017", "job_title": "Nurse in Syracuse, NY", "duration": "N/A", "pros": "Urban non profit that is committed to the community. Some very talented people work there. A good place for people who want to recover from addiction.", "cons": "Leadership is unapproachable. Male dominated management and some nasty things happen. Low pay."}]]