[[{"date": "21 Jun 2023", "title": "People Operations Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University (Pittsburgh, PA)", "Interview Descriptions": "The interview itself was fairly straight forward, and the interviewer was friendly and easy to converse with. Went over my past experiences and how it would relate to that position and other relevant experience I had listed on my resume.", "Interview Questions": "N/A"}, {"date": "14 Jun 2023", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Carnegie Mellon University (Pittsburgh, PA)", "Interview Descriptions": "Interviewed by an incoming professor at RI. The professor sent me an email to schedule a meeting. I presented slides to him, and he asked a bunch of questions. Not bad.", "Interview Questions": "All the questions are about the content in my slides."}, {"date": "3 Jun 2023", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Carnegie Mellon University (Pittsburgh, PA)", "Interview Descriptions": "Screening with HR for salary, one round virtual with search committee, second round virtual with whole committee, third virtual interview presentation and meeting with the office staff (including the director separately)", "Interview Questions": "Case scenarios for advising students"}, {"date": "14 May 2023", "title": "Grad Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Carnegie Mellon University (Pittsburgh, PA)", "Interview Descriptions": "PhD interview process for SCS was straight-forward. 30-60 minutes of previous presentation and research interests. The professor asked about key challenges and what short-comings about my prior methods about a specific research.", "Interview Questions": "1. Describe your previous research experience. 2. Why do you want to join this school? 3. Why do you want to join this lab? 4. What is your research interst?"}, {"date": "26 Apr 2023", "title": "Adjunct Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "Zoom interview to talk about possible job opportunities. most communications were through email. It was good and easy way to set things up. I thought it was good and effective.", "Interview Questions": "How would you teach a class?"}, {"date": "6 Apr 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Carnegie Mellon University (Pittsburgh, PA)", "Interview Descriptions": "Seemed like the standard procedure. Sit down with 2 interviewers and went through questions for roughly 30 minutes or so. Lots of follow up emails after acceptance though due to security and getting set up in the company.", "Interview Questions": "Asked about any previous background experience"}, {"date": "6 Apr 2023", "title": "IT Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA)", "Interview Descriptions": "Completed initial screening, successful interview with supervisor and full-day interview with various teams within the Computing Services department. After a month, I heard back from HR with limited details about their decision not to extend an offer.", "Interview Questions": "How do you manage releases and the software upgrade process?"}, {"date": "18 Mar 2023", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Called to do a screening. Never followed up, so I emailed to follow up. Told me “ Our hiring manager is still reviewing all applicants at this time.” but that was 2 months ago :(", "Interview Questions": "Why choose CMU out of all the great colleges in pgh?"}, {"date": "6 Mar 2023", "title": "Multimedia Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "The recruiter and interviewers were both very professional, sweet, and seemed genuinely interested in my future. The initial zoom interview was focused mainly on the job description and finding a good fit.", "Interview Questions": "What did you enjoy most about your previous experience?"}, {"date": "22 Feb 2023", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "First interview was a phone conversation with a representative from HR, followed by another with the hiring manager. Final round was a Zoom interview with multiple groups of stakeholders. All of it took place of the course of two to three weeks.", "Interview Questions": "Q: Have you ever had to facilitate information between stakeholders with different priorities?"}], [{"date": "4 Jan 2023", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "Friendly and comfortable - they answered all the questions I had about the company and culture. I was asked what problems I faced in those projects and what my approach to solving them was.", "Interview Questions": "Tell me something about yourself and describe your projects"}, {"date": "19 Dec 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "Behavioral interview, 10-12 questions, some were harder than others but overall it was a fair interview, lasted only about 30 minutes and you had the chance to ask questions at the end for the interviewers, there were two interviewers and you were paired with a Housefellow and Community Advisor", "Interview Questions": "Why do you want to become an RA"}, {"date": "21 Nov 2022", "title": "PhD Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "his information guide will help break down the parts of an interview, types of interviews, interview do’s and don’ts, basic interview questions, and also offer a few suggestions for questions you may want to ask an employer. Remember that practice makes perfect. You can create and practice your responses to common interview questions and register for mock interviews through Career Services.", "Interview Questions": "ob interviews are often perceived as an unpleasant rite of passage. However, with ample preparation, it is possible to enter the interview process with confidence and to enjoy the experience. A common misconception of those new to the process is that the interviewer holds all the power. Instead, the interview is a way for both parties to assess the fit between you and your skills and interests, and the company and its values and culture."}, {"date": "12 Sept 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Carnegie Mellon University (Pittsburgh, PA)", "Interview Descriptions": "I had an on-site meeting with a recruiter to go over basic info, followed by a meeting with the manager and assistant manager of the department the position reported to.", "Interview Questions": "Q: Do you know Excel?\nQ: How do you like to organize your work?"}, {"date": "5 Nov 2022", "title": "Information Security Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Carnegie Mellon University (Dallas, TX) in Sept 2022", "Interview Descriptions": "3 stages because it is the IT department very friendly and engaging. The though questions were the technical. Which is understandable because it is IT. Also the interviewers make communication easy through email for a follow up.", "Interview Questions": "Q. Behavioural questions. Q. Technical Questions"}, {"date": "14 Sept 2022", "title": "Robotics Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Aug 2022", "Interview Descriptions": "The process took 3 months \nThe first one from the recruiter, then next I had a initial semi technical interview with a senior mechanical engineer. They allocated 1 hr for the interview but it lasted for only 20 minutes. It felt like the person clearly not interested in talking to anyone but they forced him to do it. Instead of the interviewer asking questions, I was the one who was asking more questions and kept the conversation alive for some time.\n\nThen no word from them for 2 months and then again got call for the next round which was a paired interview. They literally told me due to their seniors on vacation they were on hold. \nThe interview was 1:30 minutes where they asked a ton of hypothetical questions from robotics background system, including navigation, path planning and more. Initially I think I was doing good but at some point it felt like they don’t seemed to care my answers and started behaving rude. \nOne thing they should understand is that, if someone is highly experienced in robotics field he or she will not going to go for CMU NREC job with low pay.", "Interview Questions": "Robotics navigation, path planning, control and more hypothetical question. "}, {"date": "18 Jul 2022", "title": "Machine Learning Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in May 2022", "Interview Descriptions": "I interviewed at NREC as a ML Engineer. Several zoom interviews later was called for an onsite interview. Didn't get a reimbursement for the travel expenses (see update). This whole process took 5 months. Interviewers were absolutely condescending. I wanted to leave half way into the process. I guess this is what happens when you have a bunch of old incompetent geezers and insecure people. I personally felt like they were looking for more of a cultural fit than your qualifications.\r\n\r\nThe first interviewer was nice, showed me around campus (which is in an abandoned pipe factory). This guy wants to leave badly. You can see it by his attitude. He told me in the first interview how he had to beg the director for several years to let him take classes at CMU while working there. He also interviewed at least one company while employed at NREC.\r\n\r\nThe second interviewers were also nice.\r\n\r\nIn the third round of interviews I literally had one lady (senior engineering manager) who was frowning the whole time, and another guy (robotics engineer) who constantly felt the need to assert his dominance (usually a sign of insecurity). The lady started off by bragging about how she was a nuclear engineer and such, and was condescending throughout the entire process. It felt like she already had someone else in mind and was trying to promote that person by playing political games. She spent the majority of the time down valuing my experience and qualifications. Since these are paired interviews, if one person gives off a negative impression that automatically imprints on the other. This is how broken their process is. Then again, should not be unexpected given the delusional nature of the director (keep reading).\r\n\r\nKeep in mind that this is during interviews where people are supposed to be on their best behavior. I would hate to imaging what they are like outside of interview setting. Actually, now that I think about it, I did have one guy - a former interviewer - come into lunch and sit secluded from the rest of the team. If you ask me, I'd say that he hates the rest of the team. Can't imagine why.\r\n\r\nOverall most of the people came across as closed and narrow minded. I should also mention that these people first conducted a reference check before even deciding to interview me in-person. This is extremely disrespectful and a waste of time for my references who are researchers and principal software engineers. Reference burnout is a thing. My advice to the people interviewing at this place would be to get first a written offer contingent on reference and background checks, and then give these people the reference list.\r\n\r\nInterview with the director started off with saying how they can't afford 80k for someone who would be doing the job of software engineering, data engineering and ML engineering. To top it off he said that they don't like people who leave for better opportunities while the entire time dangling the carrot of getting to take classes at CMU. Not sure if the guy is delusional or too far detached from reality or both.\r\n\r\nAfter the interview I withdrew all of my applications for this place. The recruiter still sent me an email telling me that I had not been selected to move forward.\r\n\r\nWhat a joke of an organization. This place likes to dangle the carrot of getting to take classes at CMU while paying you significantly less than market value - 120,000 national average for ML engineers. The director did this to me several times. I guess this is the only way they can get candidates to apply and take the offer.\r\n\r\nUpdate: Several emails exchanges later I got the reimbursement after 2 months.\r\n\r\nUpdate: I recently accepted a position at a semicondictor industry as a Machine Learning Engineer with a base salary of $180000 (I asked for 130-140K), $10000 sign on bonus, and $25000 RSU with a vesting period of 1 year", "Interview Questions": "Reverse the string\r\nSeveral ML questions - what is bias and variance, what is the difference between classification and regression, What is the effect on the output feature maps of the convolution layer that follows a max pooling layer. Why do we want a maxpooling layer. When to use a confusion matrix. What is the difference between precision, recall and F1. what is focal loss, what is dice loss.\r\n\r\nML System Design (Facial recognition system) - think about clustering, dimensionality reduction, database storage, approximate nearest neighbor search, reducing database lookup time with horizontal scaling. Also think about feature/concept drift detection and rectification. Talk briefly about knowledge distillation, model quantization and pruning.\r\n\r\nData engineering question - how would you remove duplicate images? Hash the images using a fingerprinting algorithm using DFT. Similar to how shazam's audio fingerprinting works. Now you have reduced the problem to removing duplicate fingerprints. If you type \"image hashing\" in google, a lot of academic papers with noise robust algorithms will pop up."}, {"date": "10 Apr 2022", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "Meeting with PhD student, questions about resume, general knowledge questions. ML, AI, Stats, regression. I spoke mostly about XGboost. All in all good and easy process for CMU students. Took around one hour.", "Interview Questions": "Explain difference between L1 and L2 loss"}, {"date": "4 Apr 2022", "title": "Senior Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Good communication with HR through out the process. Good environment and schedule for in-person interviews. Everyone was on time and friendly there were two phone interviews and one in person with multiple people. .", "Interview Questions": "They shared an example of a recent challenge ans asked how I would handle. "}, {"date": "21 Jul 2022", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Mar 2022", "Interview Descriptions": "Knowledge of the subject is crucial, usually, through an interview with a professor of the course. Questions on the subject and why you would want to do this job. Some of them may require knowledge of specific software tools used in the course, depending upon the coursework", "Interview Questions": "Subject-related basics and some difficult ones as well\ntested knowledge on the coursework-related topic"}], [{"date": "17 Mar 2022", "title": "SWE Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University (Fremont, CA) in Mar 2022", "Interview Descriptions": "It was a phone interiew with a member of the Software Engineering Institute. They asked about my background and whether I was willing to relocate however at the end asked if I'm a U.S. citizen which I'm not so they rejected me right there", "Interview Questions": "Are you a US Citizen"}, {"date": "9 Jan 2022", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "Long interview with many people. The hiring process in general moves at a slow pace and there is litted communication during this time. Recommend contacting the hiring manager for updates as needed.", "Interview Questions": "What does a normal day look like at your current position."}, {"date": "6 Apr 2022", "title": "Computer Science CS PhD Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2022", "Interview Descriptions": "I was interviewed by a professor in CS. They asked about my current research projects and interests, and then said that multiple professors are interested in my profile. It only took about 20 min.", "Interview Questions": "Q: Can you talk more about this XXX research project?\nQ: What do you want to work on in graduate school?"}, {"date": "11 Dec 2021", "title": "Teaching Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University", "Interview Descriptions": "They asked me questions about my work load and course load. They also did want to know more about my time management skills during the semester. They also asked me what classes I had taken recently, relevant to my teaching assistant position.", "Interview Questions": "N/A"}, {"date": "1 Dec 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "Easy and great, not really hard to get in, but value is relative great. So its the one of the best University in the world. Students here works extremely hard", "Interview Questions": "1. Why do you think CMU suits you?"}, {"date": "5 Mar 2022", "title": "Senior Digital Content Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Nov 2021", "Interview Descriptions": "Proceed with caution when applying to Central MarCom. The duration from initial application to the final round interview was 3.5 months. One of the interviews was with a higher-level individual who was 10 minutes late to the 30-minute meeting. That person made it clear that they hadn't looked at my resume and called me by the wrong name while signing off.  After 4 additional rounds, the hiring manager requested my references, proceeded to contact none of them, and after 3 weeks, sent a form email that they would not be moving forward with my candidacy.", "Interview Questions": "Q: What websites do you like and why?"}, {"date": "6 Feb 2022", "title": "Student Affairs Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Sept 2021", "Interview Descriptions": "I had an in person interview and was asked a series of basic questions, and then I had a design prompt I had to present. The prompt was a take home assignment and I printed out examples of my designs to show. I then talked about a few of my projects from my design portfolio and my process behind it.", "Interview Questions": "Describe a time you faced a pressing deadline. How did you work around it?"}, {"date": "23 Aug 2021", "title": "Peer Tutor At Academic Success Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "pretty streamlined process, applied on google form with a few short answer questions, interviewed with upperclassman experienced in the role, heard back in the next few days to enroll in training course", "Interview Questions": "What is your availability for the next school year?"}, {"date": "7 Jul 2021", "title": "Library Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "The interview was more of a conversation. There were not many questions asked of me, we mostly just discussed the job responsibilities. The job was as described when applying, so no surprises.", "Interview Questions": "How are you with overseeing student workers?"}, {"date": "9 May 2021", "title": "Community Outreach Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University", "Interview Descriptions": "1 informal phone screen, never heard back from CMU in 3 months, despite contacting the recruiter 4 times during that time. Even called the hiring manager and heard nothing until a month AFTER the position was already filled", "Interview Questions": "Why do you want to leave your role"}], [{"date": "16 Apr 2021", "title": "Associate Director of Industry Relations Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Apr 2021", "Interview Descriptions": "Very long process with very many people throughout multiple departments within the university. It took several days. This included within the departments and others this position would interact with, as well as faculty and staff.", "Interview Questions": "General knowledge of the department "}, {"date": "4 Mar 2021", "title": "Business Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Applied online. Received call to screen and then in person interview. The process was okay. Normally just a general conversation, not much in the way of testing for aptitude. It seems like the interview is just to see if the hiring manger likes you or not.", "Interview Questions": "Tell us about yourself, etc. Pretty generic"}, {"date": "30 Mar 2021", "title": "Help Desk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Mar 2021", "Interview Descriptions": "Interview setup through a recruiter, the feedback they gave my recruiter was so bad I'm suprised the recruiter didn't drop me, I ended up writing what I actually said in response to her forwarding their feedback because it was so misconstrued.", "Interview Questions": "Asked about networking commands in windows"}, {"date": "1 Mar 2021", "title": "Senior Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2021", "Interview Descriptions": "There’s a part one. If they like you, you get a part 2 with different members. Very nice group of of people who are friendly and they are open and welcoming. They did not seem judgmental. You could tell they liked their jobs. Seems like a great team and they want you to feel comfortable.", "Interview Questions": "Why this position? Can you see yourself here for 3-5 years?"}, {"date": "8 Jan 2022", "title": "Java Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2021", "Interview Descriptions": "Multi-phased with lots of one on one discussion as well as panel interviews.  Coding challenges were given as well. Very time consuming but also very thorough. All of this was done over Zoom since it was during the pandemic.", "Interview Questions": "What is the difference between a binary tree and a red-black tree?"}, {"date": "8 Dec 2020", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "They asked about my previous experiences in the relevant engineering fields including publication papers, research experiences, and internship experiences. Other misc questions were also asked but not super important. Hope you will get into CMU as a future phd student.", "Interview Questions": "What have you done for catalysis"}, {"date": "25 Aug 2020", "title": "3D Artist Summer Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "Discussed my skills and capabilities with the director of the program and what the overall summer job would entail. I also was asked to include my portfolio that included 3D work done in the past.", "Interview Questions": "How comfortable are you with Maya?"}, {"date": "4 Jun 2020", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Research-related interview that is very general and sometimes related to the prospective research projects. Also, questions for previous work experiences and projects.  One on one session with PI. One on one session with PI", "Interview Questions": "Research-related interview that is very general and related to the prospective research projects. One on one session with PI"}, {"date": "23 Mar 2021", "title": "Advancement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University in Jun 2020", "Interview Descriptions": "I applied online. Got a phone call interview in a week. But it took 1 min because I am not qualified because I am a visa holder.  WHAT A WASTE OF TIME! I wish it said clearly \"not sponsor H1B\" in the ADs, so it would save my time and energy!", "Interview Questions": "Which of the following status describes you?   A. American passport holder; B. Greencard Holder; C. Visa Holder. D Refugee Visa.   \n\nI found this question very demeaning!!! "}, {"date": "18 Feb 2020", "title": "Dsa Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Applied through handshake website. It took 1 week to get response. It didn't take long and I got offer on the spot. Its a good on-campus jobs for students.", "Interview Questions": "What is a good example of DSA?"}], [{"date": "29 Dec 2020", "title": "Associate Software Engineer Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Feb 2020", "Interview Descriptions": "Phone screening interview. Conversation was lovely but no technical interview was made. Position closed and I was put on their list of people to call in the future. Discussion was mostly about salary and why i wanted to work at CMU", "Interview Questions": "Why did you want to work at CMU?"}, {"date": "21 Jun 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carnegie Mellon University in Jan 2020", "Interview Descriptions": "good overall, great flexibility  in work time and places good overall, great flexibility  in work time and places good overall, great flexibility  in work time and places good overall, great flexibility  in work time and places good overall, great flexibility  in work time and places good overall, great flexibility  in work time and places", "Interview Questions": "prior research experience and related project"}, {"date": "29 Jun 2022", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2020", "Interview Descriptions": "a phone call, followed by a panel interview. The phone interview was about 30minutes. The in-person panel interview lasted over an hour and included behavioral/situational questions related to the job functions and my background", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "23 Sept 2019", "title": "Multimedia Producer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Several phone interviews. First round with HR was standard and smooth subsequent interviews should have been in person, as call quality and delay was not great. Hiring manager seemed unfamiliar with the duties of the newly created role and asked questions that were not in line with industry skill set. After a few rounds that were set at inconvenient times and being told I'd hear back soon I was ghosted. Very unprofessional. I'm glad I did not get the job as the positioned seemed to be created within a department with management skills in other areas and the inability to give notice that they were moving forward with other candidates demonstrates poor people skills.", "Interview Questions": "What does creativity mean to you?"}, {"date": "22 Aug 2019", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "no interview, just online application.\r\nI emailed my advisor during application, and he replied.\r\nBut there is a committee in the department, professor's feedback doesn't count everything. You still need to meet some standards to be considered for admission, even with some professor's strong recommendation.", "Interview Questions": "no questions"}, {"date": "25 Jun 2021", "title": "Andrew Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Aug 2019", "Interview Descriptions": "Virtual interview with two of the head andrew ambassadors. They asked why I want to be an ambassador and gave me difficult questions that have been asked by parents on tours to see how I would answer them.", "Interview Questions": "How would you answer this: a family asks if the school is a party school."}, {"date": "10 Jun 2019", "title": "Lab Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University", "Interview Descriptions": "I applied  online and was contacted via email to set up a phone interview.  3 days after phone interview I was contacted again via email to then come in for an in person interview", "Interview Questions": "How do you feel about leaning new procedures? "}, {"date": "6 May 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carnegie Mellon University", "Interview Descriptions": "They asked me about my previous research and why I was interested in CMU. There weren't too many details, I think they just wanted to get a general sense of who I was.", "Interview Questions": "what field of research I'd be interested in"}, {"date": "23 Apr 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Very good. Ask lots of basic concept of the mechanics. Some questions are about personal interest and some courses that has been take before. Professor told some about their research. Very good experience", "Interview Questions": "What's your fav class when you were a Master's student"}, {"date": "5 Sept 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Apr 2019", "Interview Descriptions": "I got an email after I applied and just got assigned to one of the courses I'd taken and got an A in.   I received an email saying I should apply for a TA position if I'm interested. After I got an email from the advisor, I went to talk to him about the schedule and the course I would be teaching.", "Interview Questions": "What time is suitable for you to teach, grade, and proctor exams?"}], [{"date": "27 Mar 2019", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "Met with multiple stakeholder groups including, faculty, career services, academic staff, marketing, administrative support, and academic advisers. It consisted for 4 panel interviews as well as 2 one on one interviews.", "Interview Questions": "What's your personal brand?"}, {"date": "15 Mar 2019", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "The interview process was very short and casual. Basically the usual questioning about why you want the job and your past experiences. Overall pretty straightforward, there were no curve balls or anything.", "Interview Questions": "Past experience "}, {"date": "5 Jan 2020", "title": "Master Student (Engineering & Technology Innovation Management) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Feb 2019", "Interview Descriptions": "The interview process was via a phone call. It was behavioral-based. I would suggest everyone to go through their resume properly and prepare for the answers for the purpose of pursuing a Master's Degree.", "Interview Questions": "Why do you want to pursue a Master of Science in Engineering & Technology Innovation Management?"}, {"date": "24 Mar 2019", "title": "Postdoctoral Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2019", "Interview Descriptions": "I had to give a  45 min talk for professors, staff, and students (PhD, Masters, and undergrad). Additionally, I had around 8 one-to-one meeting. Technical questions by the end of the day.", "Interview Questions": "How would you solve problem X? Where X belongs to a completely different area of research"}, {"date": "28 Aug 2019", "title": "Mscf Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2019", "Interview Descriptions": "When submitting the application, a video recording of a topic is required. After submitting the application, about half a month later I got an interview. One round of interview with the admission and received my results in March", "Interview Questions": "Behavioral questions in general: such as how would you explain quantitative finance to your grandmother? What do you think is the biggest obstacle you experienced in your internships。"}, {"date": "6 Oct 2022", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2019", "Interview Descriptions": "it went well, professor was friendly. I was zooming and he accepted a rescheduling as well. I have worked here for two years. It is a great place to be.", "Interview Questions": "they ask about my college experience, research experience, job experience, previous knowledge about programming and machine learning, current working hours and what the research might head to"}, {"date": "11 Nov 2018", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "Asked to explain a concept for class in front of other TAs, it was a fun experience and had a good time. There were then questions about the material of the course", "Interview Questions": "Explain a concept you learnt in the class"}, {"date": "8 Nov 2018", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "Interviewed by professor for the class you want to TA. If you don't list a class as your top preference then it is possible you won't be offered an interview since many people apply for limited spots, but this depends on the class you want to TA.", "Interview Questions": "Teach a recitation on a technical topic."}, {"date": "20 Nov 2018", "title": "Machine Learning Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University in Nov 2018", "Interview Descriptions": "There was an initial phone screening. Followed by an online assessment that took about an hour to complete. Then I had a phone interview where they asked me technical questions about coding and some general terms. The interview was pretty hard, and i didn't move on to the next round.", "Interview Questions": "What is cross sectional analysis and when should you use it?"}, {"date": "10 Dec 2018", "title": "Temporary Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Nov 2018", "Interview Descriptions": "My first interview I met with the TES manager who asked your standard questions, which she read from a list. It felt very structured and robotic, but easy.\r\nThe second interview was with 2 staff from the office that needed a temp position filled. This interview was more of a meet and greet. Almost no experience questions and I was offered the position right there. They showed me around the office, introduced me to everyone and we decided on a day I could start.", "Interview Questions": "\"Tell me about a time you encountered an interpersonal conflict.\" (job related)"}], [{"date": "4 Oct 2018", "title": "Piano Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Carnegie Mellon University", "Interview Descriptions": "got applied through school since the new semester need more instructor for their minor music student. it was a very good experience and everything you need to do is just show what you have and discussed the past experience of teaching and performed some pieces. demo a studio class in front of the people.", "Interview Questions": "what's the hardest time to teach a student and how did you deal with it."}, {"date": "8 Oct 2021", "title": "Solutions Architect Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Oct 2018", "Interview Descriptions": "The interview process was three individual interviews, each 1 hour.  Discussed the intricacies of the position and what responsibilities I'd have. They asked about my background and why I would be a good fit.", "Interview Questions": "Why do you want to work for CMU"}, {"date": "16 Mar 2019", "title": "Research Developer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Aug 2018", "Interview Descriptions": "The interview process consisted of the following steps: online application, initial contact via email, a phone screen, and an on site interview. I was asked to provide code samples for review during the process as well.", "Interview Questions": "Asked about willingness to work with students on student schedules"}, {"date": "24 Jul 2018", "title": "Research Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA)", "Interview Descriptions": "Such a backwards, slow process. The left hand doesn't know what the right hand was doing. I had my first phone interview with the recruiter about 2 weeks after applying. Another 2 weeks later, I had another phone interview with the department heads. Another 2 weeks after, I had an in-person interview and a meet-and-greet with HR and the department. Over this time I was called their \"shining star,\" \"best choice out of x-number of applicants.\" Even behind the scenes, they were exclaiming how excited they were to have me on board.\r\nFast forward, two months later: 99% of my follow-up emails and voicemails were ignored. They decide to tell me they have chosen another applicant. Horrendous process, completely wasted my time.", "Interview Questions": "\"What do you expect to be the hardest part of this job?\" "}, {"date": "2 Oct 2018", "title": "Robotics Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in May 2018", "Interview Descriptions": "Very good. Took 3 weeks. They asked questions about perception, motion planning, general software engineering and vision related topics. People are open and friendly and they have lots of good projects going on there", "Interview Questions": "How do you reverse a linked list?"}, {"date": "10 May 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in May 2018", "Interview Descriptions": "Directly meet with the research director to talk about the specific research topic you want to do during your work time. Also, introduce your own background to see whether it has a fit. Then meet with other colleagues in this team.", "Interview Questions": "What is the topic in this field you want to study?"}, {"date": "20 Jul 2018", "title": "Front End Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Apr 2018", "Interview Descriptions": "Very difficult interview process, 4 interviews total, 1 over the phone, 1  1:1, 1 with business operations and manager and last with engineering manager. Very satisfied after working there for a while now.", "Interview Questions": "Develop a front end simple page that integrates with the Google Maps API and is responsive - 1 hour."}, {"date": "8 Feb 2020", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Apr 2018", "Interview Descriptions": "Quick in-person interview just as a screening, very informal. They just want to get to know who you are as a person and whether you'd be a good fit for the company. They also just ask about your schedule to see whether you can offer the number of hours they need you to work.", "Interview Questions": "Tell us about yourself"}, {"date": "25 Sept 2018", "title": "Extra In Video Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Apr 2018", "Interview Descriptions": "There was no interview face to face. There was just an exchanging of emails which resulted in me getting an offer to be an extra in the Tepper Quad opening video which took place the next following days.", "Interview Questions": "N/A"}, {"date": "14 Mar 2018", "title": "Associate Bursar Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Carnegie Mellon University in Mar 2018", "Interview Descriptions": "Phone Interview that was very rushed and unprofessional, the interviewer spoke more and did not provided enough time to properly answer the questions.  At the end the interviewer asked if there were any questions and stated you have 2 minutes left to have them answered.", "Interview Questions": "How you motivate staff?"}], [{"date": "21 Feb 2018", "title": "Tech Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Carnegie Mellon University (Pitts, PA) in Feb 2018", "Interview Descriptions": "talk with the manager, ask some easy questions about hardware troubleshooting, the manager was very nice, and after the interview, we started to schedule my time slots to work. She also showed me around the office and acquainted me with other coworkers.", "Interview Questions": "just some basic questions about hardware troubleshooting experience "}, {"date": "23 Jan 2018", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Phone screen, video, and in - person interview. Everyone was very friendly and made me feel comfortable and welcomed. In-person interview was long but the conversations were good. Overall a good experience.", "Interview Questions": "Mostly behavioral questions. "}, {"date": "2 Jul 2019", "title": "Technical Writer/Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Nov 2017", "Interview Descriptions": "Interviewed with the immediate manager and the team. The process took a half day. It was either 8-12 or 1-4. They did give you a break for water. You may need to take a test.", "Interview Questions": "Why would you want to work here"}, {"date": "7 Sept 2017", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University (Pittsburgh, PA)", "Interview Descriptions": "Interview was quick and easy, more of a formality than anything. They just give you a  quick call on the phone to ask about your resume and applicable experience. After a chat they accept most applicants because there is a very high turnover rate for student callers.", "Interview Questions": "Have you ever worked in alumni relations before?"}, {"date": "5 Sept 2018", "title": "Front End Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Sept 2017", "Interview Descriptions": "Tough interview process - 4 interviews in total, 1 phone-call, 3 on site. 1st conversational, background oriented, 2nd  background, personality on-site, 3rd technical, creative, 4th meet the department's director, leader.", "Interview Questions": "You have 1 hour, use javascript or jquery to populate forms from static data on an html page, give it a design oriented responsive look."}, {"date": "9 Jul 2019", "title": "Research Proposal Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Sept 2017", "Interview Descriptions": "I had one phone interview with HR that lasted about 45 minutes, one video conferencing interview with a panel of people that lasted an hour and a half, and an onsite interview with a panel of people that lasted half the day.", "Interview Questions": "Why should I hire you? What contacts do you have in industry? What would you do in the first 90 days if you are hired"}, {"date": "3 Jun 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jun 2017", "Interview Descriptions": "Sat down with HR to go over goals and what type of work I was looking for, followed by interview with heads of different departments who needed employees. Met with a manager in the mail room and one in the contracts department.", "Interview Questions": "Q: What kind of work are you interested in?"}, {"date": "26 Sept 2017", "title": "Graduate T Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in May 2017", "Interview Descriptions": "Apply to Professor\r\nCheck how well you know the course.\r\nHow do you communicate with students.\r\nHow you solve their problems without giving away the solution\r\nCommand over English and technical subject is a must\r\nMostly you need to have taken the class earlier before you can TA the course, unless it is a undergrad level course", "Interview Questions": "Check how well you know the course.\r\nHow do you communicate with students.\r\nHow you solve their problems without giving away the solution\r\nCommand over English and technical subject is a must\r\nMostly you need to have taken the class earlier before you can TA the course, unless it is a undergrad level course"}, {"date": "18 Sept 2017", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Apr 2017", "Interview Descriptions": "Just had to apply online through their portal. I was simply called with an offer. There wasn't really an interview process because it was a Research Experience for Undergraduates which is just an apply-and-accept thing.", "Interview Questions": "There was not an interview question. There was really only a project placement screening, but they had two potential projects for me that our conversation aimed to make a choice from."}, {"date": "4 Mar 2017", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University", "Interview Descriptions": "I first Applied online. I had a Phone interview 1 week later. Then i was  invited in for a panel interview with 5 different current employees. process took about 2 weeks overall. A very normal experience in general", "Interview Questions": "where do you see yourself in 5 years"}], [{"date": "22 Sept 2017", "title": "Mscf Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Mar 2017", "Interview Descriptions": "The interview was on skype. Basic questions about resume and career plans. Easy process. Just prepare for every experience on the resume and be ready to answer questions about them. R", "Interview Questions": "Walk me through your resume"}, {"date": "21 Jan 2018", "title": "Cmu TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carnegie Mellon University in Mar 2017", "Interview Descriptions": "Actually this job comes along with my admission of a graduate program at Carnegie Mellon University. I apply online from the CMU official online application website. The application took about 2 months for me to get the result of admission", "Interview Questions": "SOP"}, {"date": "2 Oct 2016", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Aug 2016", "Interview Descriptions": "I have the interview two weeks ago. The man asked me about my project experience and some CS fundamental knowledge. Then give me the coding question. Not too hard. I didn't received offer from them. This is a small company.", "Interview Questions": "add two linkedlist into one linkedlist."}, {"date": "20 Sept 2016", "title": "Computing Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Aug 2016", "Interview Descriptions": "Mostly behavioural interview not too many technical questions since they have a good idea based on the classes I have taken. focused more on the dynamics of working within a team and how I would deal with certain situations i.e. uncooperative team member etc. Also asked about prior experience in working with code/ projects done in class etc.", "Interview Questions": "How would you handle an urgent ticket at work"}, {"date": "13 Jul 2016", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jun 2016", "Interview Descriptions": "I was contacted a week after applying. The HR worker emailed me first to set up a phone interview. After the the phone interview I was informed that I would be contacted again if the recruiting manager wanted to move forward after reviewing the phone interview results.", "Interview Questions": "Why do you want to work for CMU?"}, {"date": "8 Mar 2017", "title": "Innovation Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in May 2016", "Interview Descriptions": "Interview was very fast and quick, they got back to me very quickly. Two people were there to interview, asked mostly behavioral questions. There were no technical questions asked.", "Interview Questions": "Strengths and Weaknesses"}, {"date": "23 Jun 2016", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Apr 2016", "Interview Descriptions": "I had applied for another position at the university, which was filled internally. I got an email from HR asking for a phone interview later that week. A week later, I received an email asking me to pick a time for in-person. The process lasted four hours and required me to meet with groups of people at different times. It was very different and much longer than any interview I've ever had, but I enjoyed it enough to accept the offer a week later.", "Interview Questions": "N/A"}, {"date": "28 Nov 2017", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Carnegie Mellon University in Feb 2016", "Interview Descriptions": "Conversation with the other teaching staff and the professor, within the university and the specific department looking at how to push the subject matter for the course, It was very friendly and simple process", "Interview Questions": "Why are you interested in this position? and this subject"}, {"date": "7 Mar 2016", "title": "Pre-College Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Feb 2016", "Interview Descriptions": "Interview process was straightforward. Applied online, everyone undergoes a group interview that tests your team ability and an individual behavioral interview that gauges your interest about the position and what you would bring to the program.", "Interview Questions": "What activity/club would you start as a counselor for the students?"}, {"date": "11 Jan 2016", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "Recommended by my former adviser, so I directly contacted my current adviser, sent her my CV, and we had a couple of conference calls. We talked about the projects I did in my graduate school, the projects in her lab, working environment and style of her lab, funding possibilities, and so on.", "Interview Questions": "what's your dissertation about?"}], [{"date": "5 Jan 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA)", "Interview Descriptions": "Interview process for a graduate student is pretty standard. By the time you go for an interview, you are already accepted into the program so meeting them is just knowing everyone better, learning the culture and for helping you to decide if you want to go with this school/program.", "Interview Questions": "About your resume, undergraduate experience, future interest, skills and expertise. It was pretty general. Just be prepared to tell about your undergraduate research experience."}, {"date": "9 Feb 2020", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2016", "Interview Descriptions": "The professor had interviewed me on Skype. He talked about the projects he is currently working on. It was my first interview with a professor, and he made me very comfortable during the meeting.", "Interview Questions": "Which areas of my (professor) expertise did you want to work on?"}, {"date": "27 Aug 2017", "title": "Marketing Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2016", "Interview Descriptions": "Very smooth, but a little daunting.  Met with VP first then had three follow-up interviews that day with teams of three to five people each.   All in the same afternoon.", "Interview Questions": "Questions were pretty standard. "}, {"date": "22 Dec 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Nov 2015", "Interview Descriptions": "Applied online. Interview lasted for 1 hour. I was quizzed about the subject. Evaluated past performances and my ability to interact with students. The professors have been doing this for a very long time so they ultimately know what they expect in a teaching assistant and so I was asked questions about my knowledge on specific issues which are newly introduced to the curriculum and was gauged on how well I handled topics I am not aware of. I was made aware of the qualms of the work, like workload, responding to a student in doubt and the technical issues with grading and updating the lists on the university blackboard portal.", "Interview Questions": "Past experience with the subject\r\nPresentation skills\r\nInterpersonal skills"}, {"date": "6 Aug 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Oct 2015", "Interview Descriptions": "The first step of the interview was a phone screening. The interviewer asked mostly about my current research activities and then explained the project they wanted me to work on. After the phone screening, they invited me for onsite interview. During onsite interview, I met with the supervisor first. We discussed mostly about different research projects. Finally, I gave a presentation on my research.", "Interview Questions": "Discuss about your dissertation?"}, {"date": "29 Sept 2015", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Carnegie Mellon University (Pittsburgh, PA)", "Interview Descriptions": "The hiring process for undergraduate TA's varies on the course you are applying to teach for. Some courses conduct formal interviews, with a series of questions that targets both subject knowledge and interpersonal skills and decision making.\r\n\r\nSometimes, a casual conversation with the professor is all that is required. But regardless, you are expected to have excellent performance in the class, or in an equivalent one.", "Interview Questions": "What do you want to gain from being a Teaching Assistant?"}, {"date": "28 Oct 2017", "title": "Andrew Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Aug 2015", "Interview Descriptions": "You will be asked to attend a brief (usually 20 minute) interview with the student coordinators, although sometimes you will also meet with one of the admission counselors. They focus more on questions that would be related to the tour than office work.", "Interview Questions": "What is your favorite and least favorite thing about Carnegie Mellon?"}, {"date": "17 Aug 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jul 2015", "Interview Descriptions": "The interview was very standard for a technician position: I was asked for my background in research, my career goals, and my research interests. I was then given an overview of the lab's current research directions, during which I was expected to ask questions to fill in my gaps in understanding. Overall, a very positive experience.", "Interview Questions": "What are your career goals after the completion of your project here?"}, {"date": "10 Nov 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jun 2015", "Interview Descriptions": "Told Professor about my interest to be a teaching assistant. Since I had the top grades and the best project from last year, he agreed. I followed up with our department co-ordinator and also told her personally about this alongside going through the formal procedure.", "Interview Questions": "1) Why are you interested in this course?\r\n2) What do you hope to achieve through a teaching assitantship?\r\n3) Do you have any suggestions on how to improve the course from last year?"}, {"date": "22 Mar 2016", "title": "Research Designer and Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jun 2015", "Interview Descriptions": "I had a screening interview with a recruiter in HR, then a phone interview with the Director that was hiring for the position, and then an in-person campus interview.  The in-person interview had an interview with the director of the office, a presentation to guests invited from other offices on campus, and a lunch with other staff members in the office.", "Interview Questions": "N/A"}], [{"date": "16 Oct 2015", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in May 2015", "Interview Descriptions": "Talk to one of the PhD students who you get assigned to and tell them about your skills and interests. They care about your interest and want to pick a project that will benefit you. You get a lot of flexibility since there are lots of things that are yet to be implemented", "Interview Questions": "What computer vision technologies are you familiar with"}, {"date": "7 Apr 2015", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Took 2 months for HR to even call for phone interview. Then another month to have an in person interview with hiring manager (however this is very common in academia). Very laid back, a few prepared questions but nothing awkward. HR met with me directly after to discuss benefits and salary expectations.", "Interview Questions": "How would I manage a difficult peer?"}, {"date": "26 Jul 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Apr 2015", "Interview Descriptions": "We were invited to submit our resumes to the graduate program advisor.Then resumes were shortlisted and I was selected for interview.The interview was more about cloud computing and the various databases I was familiar with.I was asked about the NoSQL Database Hbase.The interview was after a month from the resume short listing process.", "Interview Questions": "Lowest ancestor of a binary search tree."}, {"date": "3 Sept 2016", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Mar 2015", "Interview Descriptions": "I was an undergrad teaching assistant for CMU Department of Mathematical Sciences. Usually, the application's deadline is around the mid-semester break for each semester. If interested, you need to contact the TA supervisor - Dr. Deborah Brandon and she will send you a simple form to fill in. After submitting the form, you will be scheduled for an interview with Dr. Brandon and she will let you know whether the department will hire you right after the interview.", "Interview Questions": "Have you had any teaching experience before?"}, {"date": "13 Aug 2015", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Mar 2015", "Interview Descriptions": "Submission of CV, followed by online interview, followed by in-person multiple interviews by stakeholders in a few different departments. In-person interviews were scheduled over two days @ CMU and were followed by a required presentation to faculty and students. It was one of the most grueling two days I've had, though it was also quite enjoyable. CMU has a talented faculty and forward-thinking curricula.", "Interview Questions": "Many questions from how I saw the discipline's evolution through how we might interface with various communities of practice. "}, {"date": "5 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Carnegie Mellon University (Pittsburg, CA) in Feb 2015", "Interview Descriptions": "I initially contacted the professor directly and applied online. After several rounds of emails, the professor asked two of his senior Ph.D. to give me a 30 minutes interview. A week later, I am notified to be accepted.", "Interview Questions": "Since I work on NoC, most of questions are really targeted to test your knowledge on this area."}, {"date": "18 Feb 2015", "title": "Postdoctoral Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Feb 2015", "Interview Descriptions": "I applied online, then followed with phone interview. They asked reference letters and then do on-site interview. The on-site interview includes a seminar in research group, individual meeting with professors and lab tour.", "Interview Questions": "Research experience, expertise, etc."}, {"date": "28 Mar 2016", "title": "Master In Computer Vision Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Feb 2015", "Interview Descriptions": "It's a 15 min Skype interview about my research background. The interviewer is a professor of the newly-founded department. He probably read my CV beforehand, so he didn't spend time on introduction stuff. Instead he asked about some project details directly. I think I did not so well but I got the admission offer. I didn't go there because I got another offer from where the tuition is much cheaper.", "Interview Questions": "Explain your undergraduate research projects."}, {"date": "22 Jan 2015", "title": "Student Researcher Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "Contact professors whose project you're interested in and would like to research for. Fill out application and make sure to follow through. Sometimes professors or graduate students are not keen on follow ups.", "Interview Questions": "Mostly typical; behavioral questions and what you want to gain out of the research."}, {"date": "1 Jul 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2015", "Interview Descriptions": "Very easy. I found the job posting online, sent email to the ISR regarding the position, matched with two projects. I talked with 2 supervisors from ISR separately via skype. Both offered the jobs and I chose the one I was more interested.", "Interview Questions": "What are your strengths regarding this job position?"}], [{"date": "20 Oct 2015", "title": "Community Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2015", "Interview Descriptions": "Resume, Cover Letter, Application with questions related to vision and purpose of the CA role\r\n45-minute interview with panel of 3-4 Housefellows consisting of a 15-minute presentation based on your House vision and three of the First-Year/Upperclass guiding principles, followed by 30 minutes of questions and discussion related to your background and vision", "Interview Questions": "Talk about a time when you persuaded or influenced a group. "}, {"date": "20 Feb 2016", "title": "ResearchDatabase Group Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Carnegie Mellon University in Jan 2015", "Interview Descriptions": "It was pretty basic. Most of the questions were about what I did before. I was also explained my roles and the system that was being built. I was asked some questions on database systems as my work would require knowledge on database systems, specifically the internals. I did not have much experience dealing with database internals, but I was selected anyway. They already had 4 people with previous experience with database internals, hence they were ready to give me a chance even without extensive prior knowledge.", "Interview Questions": "Have you worked with database internals before? If yes, in what context?"}, {"date": "16 Oct 2014", "title": "Unix Systems Administrator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "Multiple initial communications. They are very selective and discriminating on whom to hire. It took forever to get started. Place was just busy. Relocation included and some time allowed to adjust to work; incredibly smart people to work with. Work is very demanding and they are always struggling to be on the forefront of research and technology.", "Interview Questions": "N/A"}, {"date": "7 Aug 2014", "title": "Software Engineering Inst Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Three phone interviews and several hour interview in person.  I had to do a half hour presentation, do a question and answer session.  Submitted all online information and everything for a background check.. was strung along for months.", "Interview Questions": "very difficult, on the spot interview"}, {"date": "24 Jun 2015", "title": "Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Aug 2014", "Interview Descriptions": "The hiring manager calls you into his office or does a phone call.  10 minutes tops.  They are more willing to hire people if you apply during the summer so that you can start working for orientation week when all the new freshman come to Carnegie Mellon Campus.  They want to make sure you have a friendly demeanor and a responsible person.  It is also a customer service and secretary position because sometimes visitors or parents will ask you questions about the university and you have to keep each dorm building's supplies in check and make sure everything is in order.", "Interview Questions": "How many dorms are there on campus?"}, {"date": "25 Feb 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Aug 2014", "Interview Descriptions": "meet professors to discuss research interests, skills for the projects they are working on, how these skills can fit into those projects, meet post-docs and existing phd students, choose a potential list of professors to work with", "Interview Questions": "relating prior work with current projects, skills used in prior projects, willingness to learn and apply new skills and do interdisciplinary work"}, {"date": "10 Dec 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Aug 2014", "Interview Descriptions": "The course professor asked some fundamental questions. Since i had taken the course previously, it was easy to get the job. It involved asking the number of hours that i can put in since i was taking other courses, and a few questions from previous years.", "Interview Questions": "How many hours a week can you put in this TA apart from your studies?"}, {"date": "1 Aug 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Hiring process really depends on the department. For mechanical engineering, you need to submit online application, well, just like all other jobs, then if a professor is interested in you, he/she will call/email you, if you are in US, you will get an invitation for campus visit, then if the professor still likes you, they will make you an offer", "Interview Questions": "Just the regular stuff, whether or not you know some field in their research and whether you are interested in becoming part of the group, etc."}, {"date": "3 Jul 2014", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Fairly simple interview, you have to have done well in the class, pretty casual, make sure you know what hours you are available and that you can attend class lectures, show that you are hard-working and that you enjoy the class", "Interview Questions": "I don't remember there being a difficult question"}, {"date": "23 Jun 2014", "title": "Assistant Professor - Visiting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Carnegie Mellon University", "Interview Descriptions": "The visiting position was advertised in June for a position to begin in August, so they were rather disorganized. The panel who interviewed me was representative of the department, it was done by phone due to the tight timeframe. I was told there would be a full time tenure track search, that I was asked to write the description for and then didn't get it.", "Interview Questions": "The questions were fine in the phone interview; in the tenure track interview, one of the senior tenured faculty asked what I meant by historiography. "}], [{"date": "8 Nov 2015", "title": "Sei Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jun 2014", "Interview Descriptions": "Phone interview followed by second round in person interviews. After the final round it was difficult to get ahold of HR to determine when a hiring decision was made.  Everyone was very nice throughout the process but the lack of follow-up even to inform they had chosen another candidate was disappointing", "Interview Questions": "General situational questions: name a time you didn't meet a goal, deadline, failed etc"}, {"date": "12 May 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Submit application online, and wait for the professor to contact you in person. When the professor decide you are a fit to the project, then go into his office to have an 1-1 interview, and  if he finds your skillset is a match to the position, then you would be qualified.", "Interview Questions": "What is your overall understanding of data analysis"}, {"date": "2 Jul 2015", "title": "Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Apr 2014", "Interview Descriptions": "It's very easy. They just make sure you will do the job, and you aren't a delinquent I guess. It's more of a small chat than an actual interview. I would still say dress well, because over the summer it isn't competitive, but during the year everyone wants this job since it's the easiest, and it pays just as much as other jobs", "Interview Questions": "If you find a desk attendant has been arriving tardy to his/her shifts, how would you react?"}, {"date": "19 Nov 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Carnegie Mellon University in Apr 2014", "Interview Descriptions": "Skype interview i talked to a professor via skype, He asked me about the process and the progress of my own research. He really likes my research interest and my mathemtical training", "Interview Questions": "Research interest"}, {"date": "18 Mar 2014", "title": "MS-SE Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Interview process on Sype. And a code exercise was given on a choice of your language.", "Interview Questions": "What are your plans. And what do you want to do after completing your education"}, {"date": "21 May 2014", "title": "School of Computer Science - Employment Process Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Mar 2014", "Interview Descriptions": "The interview process is very lengthy; I met with 6 people on two different days after having a phone interview.  I met with 2 people for an hour and then two other people for an hour.  Was called back and met with 2 other people for an additional 2 + hours.  Everyone was extremely professional, but the one interviewer typed on the computer the entire interview (typing the answers to my interview questions) which distracted me and I don’t know why, but I could not maintain focus as I am used to face to face conversations during a job interview.  Although I appreciate the idea of saving paper, the interviewers face was in the computer the whole time and I thought that defeated the purpose of having a face to face.  Not meant to be perceived as negative, but for me, I just didn't care for it as I prefer engagement. Overall, it was a pleasant place to interview.", "Interview Questions": "Standard interview questions; nothing out of the ordinary."}, {"date": "3 Feb 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Carnegie Mellon University", "Interview Descriptions": "The application process is department dependent. After being accepted, I was invited to attend an open house, which I did attend. The open house included presentations about the department and the different research project that would likely be available. Time was allotted for one-on-one meetings with faculty that matched our interests.", "Interview Questions": "The application essay contained the only questions that were posed. "}, {"date": "8 Jan 2014", "title": "Senior Information Security Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Carnegie Mellon University", "Interview Descriptions": "Rigorous vetting process, with about 8 hours of interviews and multiple panels/one-on-one interviews.  Numerous unwinnable scenarios and edge questions about different technologies.  The interview would be pretty hard to fake, and I was able to prove competency in relevant fields.  Sometimes the questions were a little \"out there,\" however the interview process was exactly what I would expect from a top tier school.", "Interview Questions": "Most unexpected question - explain how NTP security functions.  "}, {"date": "4 Jan 2014", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Carnegie Mellon University", "Interview Descriptions": "There really is no interview process to get selected as a teaching assistant. If you got an A- or better in the course you are applying TA for, you are good to go.", "Interview Questions": "N/A"}, {"date": "7 Feb 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2014", "Interview Descriptions": "Basic information questions: name, major, aspirations, previous experience, availability. Hired almost immediately simply by asking follow-up and operational questions! Must be able to show capable and to take the initiative on new tasks. Efficient work is also a plus.", "Interview Questions": "How many courses are you taking this semester?"}], [{"date": "20 Nov 2013", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Carnegie Mellon University (Pittsburgh, PA)", "Interview Descriptions": "Resume and standard interview", "Interview Questions": "What interests you about research?"}, {"date": "8 Nov 2013", "title": "Final Position High Speed Data Ircuit Designer Begand A A Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Carnegie Mellon University (Pittsburgh, PA)", "Interview Descriptions": "very ifficult", "Interview Questions": "its testing, roe play, keyboarding,  87% of candidates in Phia fail. Pittsburgh has 32% pass"}, {"date": "27 Oct 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Nov 2013", "Interview Descriptions": "No interview process. Based on Statement of Purpose. Need to have a solid Statement of Purpose to get in. Have to explain you long term and short term goals. Also need to talk about previous research experience. Very good experience as you get to put out your thoughts on grad school in an organized way.", "Interview Questions": "1) Why CMU?\r\n2) Why grad school?\r\n3) Where do you see yourself in 5 years from now?\r\n4) What have you done previously?"}, {"date": "18 May 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Carnegie Mellon University (Mountain View, CA) in Oct 2013", "Interview Descriptions": "Very informal discussion in the hallways with the faculty where they describe the couple of options they have at hand (sometimes ones yet to be advertised on the university site ). There's  mutual interest/benefits discussion.", "Interview Questions": "Prior experiences and interests related to the project at hand"}, {"date": "26 Sept 2013", "title": "Manager of Desktop Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Carnegie Mellon University", "Interview Descriptions": "This is a tough place to get into. The interview process is very intense and usually involves multiple interviews and several hours.  All worth it though.", "Interview Questions": "This one is hard because it depends on what type of job you are interviewing for.  "}, {"date": "3 Apr 2015", "title": "Human Resources Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jul 2013", "Interview Descriptions": "It was a 2 tier interview process. The 1st interview included the immediate team. The 2nd included the directors and AVP of the organization. The questions were mostly \"fit\" type and behavioral, along with just learning what the day to day was like.", "Interview Questions": "Walk me through your resume"}, {"date": "25 May 2017", "title": "Crew Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jun 2013", "Interview Descriptions": "easy, about 15 minutes, explain duties, task  and requirements. Filled out payroll info and background check information. Staff was easy to talk to and the process did not take long at all. Hiring manager works with people with flexible schedules.", "Interview Questions": "can you lift a lot of heavy duty furniture?"}, {"date": "9 Sept 2013", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in May 2013", "Interview Descriptions": "Got the Interview and got hired.", "Interview Questions": "What do you expect to learn in your job?"}, {"date": "10 Aug 2015", "title": "Desk Attendant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in May 2013", "Interview Descriptions": "I emailed the director of the Athletics Program and I was sent a followup email the next few days. After about 2-3 days, I received an email from the director and she invited me to an interview. The interview as very easy and I accepted an as-is offer from her in terms of salary.", "Interview Questions": "How do you handle customer service situations?"}, {"date": "17 Nov 2014", "title": "Bim Engineer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Carnegie Mellon University (Pitts, PA) in May 2013", "Interview Descriptions": "It's quite easy if you are well prepared your project samples. They will ask about your experience, what part of model you are familiar with. Show them your model, and be confident for what you have done. It's a academic internship position, so their requirement isn't too hard.", "Interview Questions": "N/A"}], [{"date": "30 Sept 2013", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Carnegie Mellon University (Pitts, PA) in Feb 2013", "Interview Descriptions": "I applied online, during this process, I wrote a PS, a resume and many other files to prove that I am the right person to choose. Then I have to wait for the reply. I emailed Carnegie Mellon University for many times, and they gave me lots of useful information.", "Interview Questions": "It takes a long time to waiting for the reply."}, {"date": "1 Jun 2017", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Carnegie Mellon University (Washington, DC) in Jan 2013", "Interview Descriptions": "Pretty standard: interview, campus visit with job talk and teaching demo. During the interview I met with a few potential colleagues and answered questions about my experience, research, and courses I'd teach. I was able to ask questions about the job opening and the job.", "Interview Questions": "The kinds of courses I'd teach"}, {"date": "25 Aug 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Aug 2012", "Interview Descriptions": "The process was fairly easy depending on what course you would like to TA in. Just go and talk to the professor, have the interview with the professor, and he/she will give you the offer if he/she needs someone to be the assistant.", "Interview Questions": "Tell me about yourself"}, {"date": "21 Nov 2013", "title": "Staff Accountant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University in Jul 2012", "Interview Descriptions": "As expected - they want to know you and why are you interested in that particular position.", "Interview Questions": "N/A"}, {"date": "22 Jun 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Apr 2012", "Interview Descriptions": "It was conducted in person - I had to teach a demo class to a small group of students. There was also a Q and A session. Later, they called me over the phone to offer me the position.", "Interview Questions": "Describe what learners should know at different classes."}, {"date": "15 Apr 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Carnegie Mellon University (Pitts, PA) in Apr 2012", "Interview Descriptions": "The process is quite standard for graduate school. Apply online via a form, and they will reply to you several months later. At this point, you have already been accepted. They will invite you to the campus to have a visit with professors whose interest matches your own. After you arrive on campus, there will be a matching process to determine your adviser. In this process, you will discuss in depth the professor's research and you can meet all of their students. This typically takes 3-5 weeks. After the matching process is complete, you will be a member of the research team and will finally begin to undertake some research.", "Interview Questions": "When you visit the campus, you will have discussions with professors about research interest and  goals. Nothing too technical, they just want to see who you match with. It is quite a relaxed process, as by the time of the campus visit, you have already been accepted, and they are simply trying to convince you to choose CMU over other schools that may have also accepted you."}, {"date": "19 Mar 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Mar 2012", "Interview Descriptions": "If your grad school application catches one or more of the professors' attention, they interview you either on the phone/skype (if you are from outside of US) or face to face. Depending on the professor, they can do technical and/or nontechnical interviews. My interview was nontechnical. So, be prepared for everything.", "Interview Questions": "There was no difficult questions in my interview as it was nontechnical."}, {"date": "22 Oct 2015", "title": "PhD Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Carnegie Mellon University in Feb 2012", "Interview Descriptions": "A professor who might be interested in taking you into his lab group, will interview you on phone or skype to go over your resume, Statement of Purpose and tell you about the research he does and try to see if you are a good fit.", "Interview Questions": "Research interests?\r\nPrevious experineces"}, {"date": "23 Oct 2015", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2012", "Interview Descriptions": "Phone interview for a few minutes on relevant research areas. Separately I visited the school for me to evaluate it, and found it. This process is not required and students may find they end up having a very different experience when applying. In particular, I found strong recommendations greatly shifted the response of the university toward a more streamline acceptance process.", "Interview Questions": "What do you want to work on?"}, {"date": "1 Mar 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Sept 2011", "Interview Descriptions": "I had an initial interview with the HR person that was pretty typical. Questions included the basic questions that a screener asked. Then I had an over the phone interview with the hiring manager. Then i had a third interview in person, where I had to have a presentation. \r\nThe presentation was in front of a panel of people -- the team that I ultimately worked for. I also interviewed with team members from departments that I would be collaborating with. I got the sense that they only had me interview with them because my skill set closely aligned with them more than the team I would be working with.", "Interview Questions": "Why do you want to work in higher education?"}], [{"date": "21 Nov 2013", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Carnegie Mellon University in Jul 2011", "Interview Descriptions": "I was contact by email by the hiring supervisor.  I had a preliminary phone interview for about 30 minutes.  Within two hours, I received a call asking me to come to Pittsburgh for an in-person interview.  I was flown in, given a driver and a hotel, even picked up the next day for my interview (all totally covered).  I was given an agenda and had about 4 group meetings.  All very formal, but comfortable.  Most people gave a good vibe, but a few were obviously there because they had to be (one woman was texting most of the time).  After my meetings were done, the hiring manager who interviewed me said something along the lines of \"I have a meeting to go to, but why don't you walk around the campus for a while by yourself until your car comes to get you.\"  At that point I almost lost it with her, wondering if I was being a burden to her and her time.  I was not even given a campus map to navigate.  However, I wanted the position so bad I quietly accepted her offer to explore the campus on my own.  I flew home, sent thank you emails.  Over the next two weeks they conducted a reference check and I was offered the position over the phone.  I negotiated a slightly higher salary and got a moving stipend as well.", "Interview Questions": "Nothing,  it was very unoriginal. While there were scripted questions, most of the people asking the technical and detailed questions did not even understand what they meant or why I should be able to answer them. They would ask a question, then explain what is it that they did.  The soft questions were the usual \"about yourself or experiences\"type questions.  Much of the focus was generically focused on how I would increase enrollment and program visibility.  My background was in distance delivery and program design, so that was the direction of my responses.  While they were hooked on the idea, NO-ONE knew enough to even ask follow-up questions.  "}, {"date": "10 Jul 2015", "title": "Financial Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jun 2011", "Interview Descriptions": "Met recruiter at a career fair and had to put a lot of effort in over a few month period to get a response.  The interview, when I had it, was short and positive as they had liked the consistency with which I had tried to contact them.  They reached out to me shortly after with a job offer.  Very much enjoyed the individuals whom I interviewed with.", "Interview Questions": "N/A"}, {"date": "24 Jul 2015", "title": "Grsd Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Mar 2011", "Interview Descriptions": "great experience for me in general I had a great time meeting all the professors. I evebtuly accented offer even though there competing offers from others schools I really liked the whole experience as a eyehole. I recommend it for others  who are vivid eying PhD programs", "Interview Questions": "what are your long term goaks"}, {"date": "4 Dec 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2011", "Interview Descriptions": "There was no interview process. One just applies online and waits to get an offer. The only interview you get is once you are accepted , they want to make sure you are able to TA.", "Interview Questions": "Explain what a partial derivative is"}, {"date": "5 Dec 2014", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Carnegie Mellon University in Jan 2011", "Interview Descriptions": "After I submitted my online application, they send me a notification of Skype interviews 1 month later. Now the standard process is on-campus interview (meet 4~5 professors). Because I'm not in US, so I can only do it with Skype interview.", "Interview Questions": "all behavior questions, personal experience"}, {"date": "30 Apr 2011", "title": "Technical Coordinator, Administrative Computing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Nov 2010", "Interview Descriptions": "The application was done online.  A month later I got an email about wanting to schedule an on campus interview at the Tepper School of Business.  Once it was schedule for the next day, the Director of HR said the interviews were running late by about 30 to 45 minutes.  It was a bit strange waiting in a common area with a handful of people clearly going to the same job.  There were 2 other coordinators and the HR director there.  They were very upfront with what they wanted and discussed a scenario about the first day of work, etc etc.  It was a fairly easy interview.  However it seemed if you did not know everything as an expert listed on their requirements, the interviewers were completely turned off by you.", "Interview Questions": "If on your first day of work and someone rushed in your office and requested access to Oracle, what would you do?"}, {"date": "11 Feb 2011", "title": "Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Sept 2010", "Interview Descriptions": "Candidate must apply online.  The online system requires a computer with significant resources (processor and memory) to work well.  CMU staff communicates the specifics of the interview throughly.  The interview is with many people in groups of three or more.  Interview process takes several hours.\r\n\r\nThe candidate is left with the feeling this is a very professional organization who only hires the best.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "20 Aug 2010", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Aug 2010", "Interview Descriptions": "It was an internal hire.", "Interview Questions": "N/A"}, {"date": "16 Sept 2010", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jul 2010", "Interview Descriptions": "technical skills, their own project introduction", "Interview Questions": "technical experience"}, {"date": "18 Feb 2014", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Carnegie Mellon University (Pittsburg, CA) in Jun 2010", "Interview Descriptions": "I sent my resume to a professor whom I really wanted to work with and received a research assistant position as a junior in college.  I worked with him , postdoctoral student, and a PhD student for 8 months, and afterwards, he offered me a PhD position after reviewing my credentials.", "Interview Questions": "There wasn't any technical question, but I had to think about whether I was really zealous about the PhD position when he asked me about it."}], [{"date": "30 Apr 2013", "title": "Graduate Student, Master's In Computational Finance Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Mar 2010", "Interview Descriptions": "Applied online. There was an online screening process and an interview. For the interview you have the option to go to Pittsburgh in person or have the interview via skype.\r\nIn the interview they were looking for 3 things:\r\n1-Make sure you look presentable. Dress professional and carry yourself in a professional manner.\r\n2-Conversational skills. They want to know that if you go to a job interview after you graduate you will be able to get the job. So, you need to be able to have a conversation with the interviewer and get your points across.\r\n3-Why You? You need to tell them why they should accept you and not someone else that satisfies 1 and 2. Figure out what distinguishes you from others.", "Interview Questions": "Why should we accept you?"}, {"date": "15 Aug 2010", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Feb 2010", "Interview Descriptions": "A recruiter contacted me after finding my resume on the Internet and scheduled a first brief interview to present me the project. Later, I had a telephone interview with the project manager and staff in which I was asked to present my previous work in the field. During the interview I was asked to submit some materials (presentations, notes, etc) I produced in the past as evidence of my skills.", "Interview Questions": "Why did you choose to work in a field which is an unusual choice for people with your background?"}, {"date": "11 Mar 2013", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Aug 2009", "Interview Descriptions": "I met my boss in a conference. My boss advertise this job position, and we have a talk. My boss also asked me to talk to the current group members. I am employed by this group because my back ground match their research. I think it is also very important have good talk with the current group members", "Interview Questions": "I cannot think of any unexpected question. Mostly we were talking about my research and what project they want me to do in their group. "}, {"date": "29 Aug 2010", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Mar 2009", "Interview Descriptions": "General questions about past subjects and courses.\r\nDid a background check with professors\r\nquizzed on past projects", "Interview Questions": "favorite project ?"}, {"date": "27 Dec 2013", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Feb 2009", "Interview Descriptions": "admission interview", "Interview Questions": "interview questions were pretty basic (e.g., describe what kind of research you would like to work on)"}, {"date": "16 Mar 2010", "title": "Research Assistant () Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Carnegie Mellon University (Pittsburgh, PA) in Jan 2008", "Interview Descriptions": "1 Phone interview mostly technical followed by one face to face interview.", "Interview Questions": "What are your area of interest? Coding experience"}]]