[[{"date": "19 Jan 2023", "title": "Web Producer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Simons Foundation", "Interview Descriptions": "1) initial HR screening (standard HR questions) 2) interview with hiring manager (questions specific to the position, included time for the applicant to ask as well) 3) interview/meet-and-greet with future teammates", "Interview Questions": "Why are you interested in this position? What experience do you have working with Wordpress/HTML."}, {"date": "21 Dec 2022", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Simons Foundation", "Interview Descriptions": "Easy process. Everyone was personable and professional. The questions were easy and the interviewers put you at ease—standard questions for this position. The manager was a bit condescending and there was a disconnect but everyone else was nice.", "Interview Questions": "Why are you the right person for this job?"}, {"date": "12 Apr 2023", "title": "Temporary grants assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Simons Foundation (New York, NY) in Nov 2022", "Interview Descriptions": "Preliminary interview with recruiter/HR, email response and excel assignment tests, then seperate interviews with grants manager, grants assistant, and grants administrator before one more follow up interview with HR director", "Interview Questions": "What tools do you use for organization?"}, {"date": "3 Aug 2022", "title": "Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Simons Foundation", "Interview Descriptions": "Normal enough process, phone screen and two rounds.\n\nWas told in my final round that \"this is a formality\" and that they wanted me to start in a few weeks. Was then rejected a few weeks later.", "Interview Questions": "normal questions about experience, etc"}, {"date": "8 Jul 2022", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Simons Foundation", "Interview Descriptions": "it was an easy process of interview,\r\nI cracked it easily and also I had only two rounds.\r\nFirst round was technical interview and second round was techno managerial interview\r\nit was an easy process of interview,\r\nI cracked it easily and also I had only two rounds.\r\nFirst round was technical interview and second round was techno managerial interview", "Interview Questions": "Not much simple core java ques"}, {"date": "10 Jan 2023", "title": "Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Simons Foundation (Ondal) in Jul 2022", "Interview Descriptions": "First round was an assessment containing aptitude and coding assessment. Second round was face to face technical interview they mainly ask about java deep concepts like threads, exception and all . Give some programs to do in notepad . Also ask some logical questions.", "Interview Questions": "Explain the concept of threads in java with example program Explain about the linked lists with program"}, {"date": "2 Jul 2022", "title": "Building Operations Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Simons Foundation (New York, NY) in Feb 2022", "Interview Descriptions": "I applied in the very start of Feb. 2022 for the Building Operations Assistant role. Amazingly the role is still open, having been reposted several times--and I've tracked this closely--in the hopes of finding new candidates as none thus far seem to have met their standards. \n\nAs of July 1, 2022, the same role is still open (R0000931). It does not seem like there is any seriousness in their hiring to actually find candidates and fill vacancies. It is extraordinarily dishonest to have candidates go through multiple rounds of Zoom interviews, screeners, and complete assignments to see that not a single one of the people of the hundreds at this point who have applied have actually been hired yet. They wrote in the rejection email that they're \"moving forward with other candidates\", but that is clearly not the case. It's zero progress forward.\n\nAfter being so excited to join what seemed like an amazing organization, this has left a sour taste in my mouth that will probably not be overcome even in the time that it takes to finally hire someone for this job.", "Interview Questions": "N/A"}, {"date": "11 Oct 2021", "title": "Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Simons Foundation (New York, NY) in Oct 2021", "Interview Descriptions": "Multiple interviews are required for the position.\r\nFirst with the hiring manager, office manager, office assistants and hiring manager again.\r\nI got interviews Friday and was called for the second round of interviews on a Monday.", "Interview Questions": "Why are you interested in working with this company?"}, {"date": "10 Aug 2021", "title": "Producer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Simons Foundation", "Interview Descriptions": "Interview process took over 5 months. Went through multiple rounds and spoke to a number of different team members. There was very little communication between myself and the HR representative in that 5 month time period.", "Interview Questions": "How do the values of the Simons Foundation align with your personal values?"}, {"date": "3 Jun 2021", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Simons Foundation in May 2021", "Interview Descriptions": "Phone call with the hiring manager that had behavioral and technical questions (SQL, Python) , then technical interview with the team with live coding in Python. Felt professional and friendly, and the questions were appropriate for the role.", "Interview Questions": "- SQL what is the difference between self join (and what is self join used for), inner, full, outer, left, right joins\n- JavaScript difference between let and var\n- What are inherited classes and when would you use them?"}], [{"date": "12 Feb 2021", "title": "Grants Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Simons Foundation", "Interview Descriptions": "I applied online and received an email to schedule a phone interview (with one time slot that same day...). From the phone screening, I was sent an assignment to complete (draft an email; create various graphs on Excel). Then I was invited to various interviews with staffers over the course of 2 hours. About a week later, I was informed that I didn't get the position.", "Interview Questions": "What interests you about the foundation?"}, {"date": "21 Jan 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Simons Foundation", "Interview Descriptions": "phone interview was 15min and in person interview was 1 hour. Easy questions for the most part. I think it was a good fit from the start so it felt overall positive for me. They have really interesting manufacturing processes.", "Interview Questions": "Where do you see yourself in 5 years?\nWhat do you expect your salary to be in 5 years?"}, {"date": "10 Jul 2021", "title": "Grants Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Simons Foundation in Nov 2020", "Interview Descriptions": "I applied online and was invited for a phone interview.  \nDuring the interview I was informed that they already had a shortlist of candidates. \nAfter the interview I have not heard from them for a week and after the follow-up email I was told that they had already found the right candidate.", "Interview Questions": "Describe your typical day at work. \n"}, {"date": "16 Nov 2020", "title": "Audio Visual Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Simons Foundation (New York, NY) in Aug 2020", "Interview Descriptions": "I applied through LinkedIn and received an email a few days later requesting a phone interview. \n\nThe call went great and the recruiter was impressed and thanked me for doing my research into the foundation. I was told at the end of the call that there would be a follow-up zoom call to determine if they would move forward with me. \n\nThe zoom call went great as well. I spoke with the head of the department, then it was followed by a three-way call with two current employees. They were all friendly, asked poignant questions, and made me feel comfortable. \n\nIn the end, my lack of zoom experience was the deciding factor. I understood but it was disappointing as this job was not going to be remote forever and zoom wouldn't be as important moving forward. \n\nHowever, the process was positive and honest. The recruiter even emailed and told me why they hadn't gone with me in a very respectful dignified way.", "Interview Questions": "What experience do you have working with zoom?"}, {"date": "15 Nov 2019", "title": "Web Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Simons Foundation", "Interview Descriptions": "I applied to the role online. I had a great discussion with the recruiter and I thought the conversation with the hiring manager would go just as well.\r\n\r\nThe follow-up call with the hiring manager ended up being a group phone call with 2 people. I was kind of surprised by that, because I just like to be prepared. And also, I wasn't sure if this meant that I would be reporting to 2 people not just one.\r\n\r\nThe hiring manager, or the person who I thought was the hiring manager, seemed kind of distracted and didn't seem interested in answering questions. I was told that if I have any questions about things like promotions or questions about company culture, I should talk to the recruiter.\r\n\r\nIt gave me a bad sign that the hiring manager wouldn't be responsive to basic questions, and simply tell me to ask someone else if if the question was easy to answer. I don't know if that's their culture or just this one person.", "Interview Questions": "Can you make prototypes?"}, {"date": "16 Jul 2019", "title": "Systems Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Simons Foundation", "Interview Descriptions": "Very good interview straight to the point i was very happy to answer any questions. Interview was more on general experience. The interviewer explained clearly on the job description and spoke about general global points for the job", "Interview Questions": "Experience and background "}, {"date": "8 May 2019", "title": "Web Producer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Simons Foundation (New York, NY)", "Interview Descriptions": "Applied online. Phone interview with two HR representatives followed by an in-person interview with HR and 3 team members the position would work with. Overall a very positive experience and everyone was warm and welcoming.", "Interview Questions": "How would you handle project difficulties?"}, {"date": "28 Apr 2020", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Simons Foundation (New York, NY) in May 2019", "Interview Descriptions": "Very organized and informative.   The process went smoothly and everyone was very nice.  I was greeted warmly and provided with an overview of the interview schedule and process when I arrived.", "Interview Questions": "Please describe your relevant experience and overall fit for the job."}, {"date": "14 Aug 2017", "title": "Research Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Simons Foundation (New York, NY) in Aug 2017", "Interview Descriptions": "It was brief and delightful. Applied online and after a week or so, received an email invitation for first round interview. The interviewer is friendly and professional.  \r\n\r\nBegan by a common question like why this position/why SF, then asked about my SQL/Database management experience. Then experience working with Linux System. Overall, it is a short phone interview (20minutes).", "Interview Questions": "why this position why Simons Foundation"}], [{"date": "9 Jan 2019", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Simons Foundation (New York, NY) in May 2017", "Interview Descriptions": "I was contacted by a recruiter and then I had an initial phone screen with the hiring manager. I did not make it past this point but she mentioned the next step would be an in-person interview. The job wasn't a great fit as I was familiar with a different coding language used in-house so the process ended after the phone-screen.", "Interview Questions": "Experience questions - what coding languages I knew, what my background is, etc."}, {"date": "9 Nov 2016", "title": "Senior Software Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Simons Foundation (New York, NY) in Oct 2016", "Interview Descriptions": "This was for the role of a backend Python senior software engineer. I was contacted by an internal recruiter who sent me an untimed take-home exercise and later scheduled an on-site interview. I felt reasonably well qualified for the position but did not receive an offer. Their stack for this position uses Python 2.7, Django, PostgreSQL via Django, Celery, and a message broker.", "Interview Questions": "In Python, in an \"if\" statement, how would you check if something is None? What is the difference between \"if foo is None\" and \"if foo == None\" and why would you prefer one over the other?"}, {"date": "18 Feb 2016", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Simons Foundation (New York, NY) in Feb 2016", "Interview Descriptions": "Had a phone interview with someone in HR and then went for an in person interview where I met with 3 different people - the one person that I would be directly working underneath, another person on the team I would be working for and someone else involved with a different aspect of the company. Overall a very positive experience and everyone was warm and welcoming.", "Interview Questions": "Describe my strengths and weaknesses."}]]