[[{"date": "13 May 2022", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at IPRO", "Interview Descriptions": "screen interview then the depth interview. \r\ninterview was very decent and friendly. question were not hard and general. they asked some questions about sas skills but nothing complicated.  I felt very comfortable talking to them and go over my skills and education.", "Interview Questions": "which sas environment did you use before?"}, {"date": "24 Mar 2022", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at IPRO", "Interview Descriptions": "The process begins with discussing the role with the Recruiter, then deeper dive with the Hiring Manager and the Peer Panel.  It was helpful to meet with the entire team.", "Interview Questions": "There were good questions and appropriate for the position"}, {"date": "18 Jan 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at IPRO", "Interview Descriptions": "Got a call for an initial screening interview. Took about 10 minutes and just asked for my background and role. Pretty much confirmed what I had on my resume and had a lot of followups. I was able to ask questions as to what type of role I was being interviewed for in further detail", "Interview Questions": "Q: Explain your role in your current position "}, {"date": "16 Feb 2021", "title": "Research Analyst III Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IPRO in Jan 2021", "Interview Descriptions": "The interview was conducted via Webex. The interviewing staff were very nice, felt like a discussion which was both a positive and a negative as some of the info they provided ahead of time wasn't displayed properly. Long interview process", "Interview Questions": "Can you identify what this Tableau spreadsheet is illustrating? Can you identify any mistakes?"}, {"date": "27 Dec 2018", "title": "Community Resource Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IPRO (Lake Success, NY) in Dec 2018", "Interview Descriptions": "Applied via Indeed and was contacted by Human Resources to discuss the position.  After agreeing this was a position I was interested in my resume was sent to the director.  Human resources then contacted me to set up a phone screening with the director.  After this conversation, Human Resources contacted me again to set up an in person interview.  Process itself took about a week.", "Interview Questions": "How do you handle stress?\r\nWhat about IPRO makes you want to join our team?\r\nHow would you handle conflict amongst team members?\r\nCreate a moc email, excel spread sheet, and 3 slide power point for a presenting problem they give you on paper (timed 30 minutes)."}, {"date": "22 Feb 2018", "title": "Compliance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IPRO (Albany, NY)", "Interview Descriptions": "I received a phone call from HR for a phone interview. I was emailed an application I had to print, fill out, and email back prior to the in-person interview scheduled for about a week later. I arrived 5 minutes early and had to wait about 10 minutes after the scheduled time. I was interviewed by the department head, followed by two team leads, one of which was over a web conference. They are not looking to hire until they are sure they will have the budget, which is 2-3 months from now. They did not smile, not one of them, during the entire process. They seemed disorganzied, technologically daft, and not really interested.", "Interview Questions": "What does IPRO stand for? "}, {"date": "15 Dec 2017", "title": "Director, Quality Improvement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at IPRO (Lake Success, NY) in Oct 2017", "Interview Descriptions": "After submitting my resume online for the position, I was contacted by someone in their HR department within a week regarding their interest and invited for a phone interview.  The phone screening interview was scheduled and I was then invited for an on-site interview with the team I would be working with.  Prior to the in-person interview, HR sent some employment forms to be filled out.  I completed these and brought them in with me on the day of the interview.  Their office location is in a beautiful building, it seems to be a very friendly family atmosphere, where important work gets done.  They also have a full kitchen!  During my interview, I was told that I would hear their decision within two weeks.  After three weeks, I reached out to find out the status of my candidacy.  I was informed that one of the key decision makers was out traveling and I should hear back shortly.  I never heard back.  Two months later, though I presumed the position had already been filled, I reached out, but still no response.  Considering candidates take time out, sometimes from work to attend the interview, it should be common courtesy to let them know the outcome.  Don't just ignore them when they reach out to find out the status of their application and interview.  Perhaps a simple email thanking them for their time, and wishing them well in their job search.", "Interview Questions": "Discuss projects you have worked on the past, address challenges and how I worked to overcome those.  "}, {"date": "25 Dec 2016", "title": "Program Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at IPRO (Albany, NY)", "Interview Descriptions": "I had a screening interview with HR long after I applied online. Then I had an in person interview with two people in Albany.  I followed up regularly and they finally sent me on an interview.  I was told it was with 2 managers for 2 different jobs at the health department.  There were actually about 6 people in the room for only one of the jobs and no explanation was offered.  I was clearly overqualified and the questions implied such (see below).  They never returned messages after this interview which seems unprofessional after meetings and months of follow-up. I would never work for them after this.", "Interview Questions": "\"How would I, manage you?\" (asked because I was overqualified)"}, {"date": "21 Jan 2016", "title": "Allied Healthcare Professional Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at IPRO", "Interview Descriptions": "Received a call to conduct a phone interview. Phone interview went really well and was told I would receive a call back within a week to set-up a face-to-face interview. Well, I never received any call, e-mail or any time of follow-up acknowledgement.", "Interview Questions": "How did I hear about the job? What interested me in the job? How do I currently spend my day at my current position? What are some of the things I like and don't like about my current job? Why do I want to leave my current position? Salary expectations? "}, {"date": "8 Jan 2016", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at IPRO in Jan 2016", "Interview Descriptions": "Received a phone call from K.M. out in Lake Success - I passed their phone screening and had my first interview set with with the assisted director S.B. When asked about salary expectations we compromised at 56k annually.\n\nAfter a great interview days later with S.B. I was selected by IPRO to have a second interview with a potential company to do contract work for. About a month had passed by before the 2nd interview was scheduled with NYS DOH. Had a great 2nd interview and was promised by to hear back within the next two days what DOH had decided.\n\nAround 6:30 PM on the same day of my second interview with DOH, I received a phone call from V.L. stating how I was selected for the position with NYS DOH! However I not qualified for the title of \"Data Analyst\" because I was one month shy of 12 months minimum experience. I was offered 41k which wasted both IPRO's and my own time. \n\nThe company is excellent to work for and I've met numerous employees through this interview journey. If we were on the same page with salary expectations I would accept this position in a heart beat. The staff and managers are extremely friendly and knowledgable - I wish them all the best!", "Interview Questions": "They will ask you about recent programs you have created and what your goal was."}], [{"date": "19 Apr 2015", "title": "Community Outreach Coordinator Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at IPRO (Lake Success, NY) in Feb 2015", "Interview Descriptions": "A staff in human resources called me for a pre interview.  She was very nice and explained the position in detail.  I received another call I believe in a few days and was set up with an interview with the director of the department.", "Interview Questions": "I was asked my experiences in the workforce and my education.  I was also asked about my experience with patients and family.  These were the base information of the interview."}, {"date": "7 Sept 2014", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IPRO in Jul 2014", "Interview Descriptions": "Three interviews:  \r\n     One phone interview\r\n     One phone/group interview\r\n     One group interview\r\nIt has been a month and no offer for employment\r\nOpening is still posted so that indicates that the current applicants are not satisfactory.\r\nI would prefer receiving a rejection letter.", "Interview Questions": "N/A"}, {"date": "13 Jan 2014", "title": "Claims Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at IPRO", "Interview Descriptions": "Very nice people in the interview.  Completely, into your answers. Seem genuine.", "Interview Questions": "Why should we chose you?"}]]