[[{"date": "22 May 2022", "title": "Senior Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University Medical Center New Orleans", "Interview Descriptions": "“Speed dating style” interview. Asked very vague and basic questions. Nothing to stress or prepare for. Felt very comfortable through the process and nurses from various departments interviewed. Make it known which department you really see yourself working in!", "Interview Questions": "Tell me about yourself, rank your top departments of choice and why"}, {"date": "15 Aug 2021", "title": "PBX Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University Medical Center New Orleans (New Orleans, LA)", "Interview Descriptions": "I interviewed with the director at the time. This was actually before the hospital became UMC. She asked about my experience and what I could contribute to the organization. I was offered the job on the spot. I was also brought down to the department and shown my area.", "Interview Questions": "Tell me about yourself?\r\nWhat can you bring to the organization?"}, {"date": "23 Mar 2021", "title": "Psych Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University Medical Center New Orleans", "Interview Descriptions": "The interview was quick and straight to the point. They made sure I understood what I was getting into. After the interview portion I was given a tour of the area.", "Interview Questions": "Did I have any employment history in this field?"}, {"date": "8 Aug 2019", "title": "Nurse Tech Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University Medical Center New Orleans (New Orleans, LA) in Mar 2019", "Interview Descriptions": "Interviews for the nurse tech program took place over 2 days, and they emailed me a time for one of the days to come interview. There were several candidates scheduled at the same time slot, so they interviewed each person in the order of arrival.", "Interview Questions": "Tell about a time you overcame conflict in your job. "}, {"date": "20 May 2018", "title": "Patient Access Representative/ER Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at University Medical Center New Orleans", "Interview Descriptions": "Was asked a few questions over the phone prior to being scheduled for an interview. Met with the recruiter first for a pre-interview. Then I was brought to another room to be interviewed by the manager and supervisor of the department.", "Interview Questions": "Tell me about yourself?"}, {"date": "12 Apr 2017", "title": "Patient Acess Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at University Medical Center New Orleans in Apr 2017", "Interview Descriptions": "Applied online. It took almost two weeks until I received a phone call to come in for an interview. I interviewed with the HR manager and the manager of the department. Next day received a call that I got the position. Two days after that filled out paper work, and I start working within a week.", "Interview Questions": "How do you handle an aggravated patient? \nIn three words describe yourself? \nThey ask me other questions but it wasn't nothing hard."}, {"date": "1 Jan 2017", "title": "Human Resources Compliance Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University Medical Center New Orleans (New Orleans, LA) in Dec 2016", "Interview Descriptions": "I applied online in December 2016. I received a call from HR scheduling a phone interview. The phone interview was the next day. I had the phone interview and then a face to face interview. They basically told me that I wasn't a good fit for the job because after 6 months I would be bored with the job.", "Interview Questions": "What do you like to do for fun?"}, {"date": "22 Dec 2015", "title": "Position In Surgery Department Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University Medical Center New Orleans (New Orleans, LA) in Nov 2015", "Interview Descriptions": "I was asked to meet near the coffee shop for the interview at a certain time. I arrived early and waited for her arrival. When she was over 30 minutes late for our interview, I called her to ask if she would like to reschedule- because I had assumed she had gotten busy or tied up. Well no, she actually completely forgot about the interview SHE scheduled with me. Lovely. She comes down and meets me and does apologize. The interview was one of the strangest interviews I've ever been on. She only asked me one or two questions pertaining to the actual position I was applying for and some how the conversation switched to something extremely casual such as shopping and things going on around the city. I did try quite a few times to shift the conversation back to something that actually pertains to the job, such as my clinical experience but quickly got the vibe that she didn't want to talk about the position and just wanted to get to know me as a person so I just went along with it. At the completion of the interview, I was informed that I had gotten the position. I was asked to not explore other employment opportunities or schedule any other interviews. I was asked to act \"surprised\" when the HR department called me to offer me the job since they like to be the one to tell people they got the job. I thanked her for her time and giving me the chance to be a part of their team as well as expressed my excitement over being offered the position. Well a week or so passes by and I did not receive any phone calls from the HR department. I called her directly and she did not answer, so I left a message. She never called me back and I thought that was strange but figured she was probably very busy and forgot. Fast forward another week and I still haven't heard anything. I tried calling her again and she does not answer. I send her a respectful professional email asking for an update on the process and to let her know I have not heard from the HR Department. She never responds.  Fast forward another week and I decided to call the job recruiter in the HR dept to ask if the position was still available or if it had been filled. I was informed that the position had been filled. I obviously did not get the job. It's quite possible that she interviewed someone after me who had more experience and was a better fit and she hired them instead. I completely 100% understand and respect that decision. What I can not understand nor respect is why she didn't have enough decency to call me or send me a quick email and let me know that. If she would have I would have been spending the past few weeks looking elsewhere for a job instead of assuming that the hiring manager was extremely busy and that their HR department is just slow. I found the whole situation to be very unprofessional and it has changed my opinion on this facility. To ask me not to explore further employment opportunities or schedule any interviews, then offer the position to someone else and not bother to contact me to let me know- is in my opinion pretty unforgiving and not a boss I would want to have. So heads up- if you are offered the position during your interview here- don't bank on it until you've received your offer from the HR dept. Lessons learned.", "Interview Questions": "Where did you get your purse?"}, {"date": "30 Jan 2017", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University Medical Center New Orleans (New Orleans, LA) in Oct 2015", "Interview Descriptions": "Applied Online at the UMC website. Received a call for an interview. Interviewed face-to-face with 1 interviewer. Got the offer and accepted. Returned for an employee health appt where you turn in all of your certifications, shot records, get needed vaccines, drug test, take I.D. picture. Return for orientation.", "Interview Questions": "Why did I choose UMC? "}, {"date": "26 Mar 2017", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University Medical Center New Orleans (New Orleans, LA) in Jan 2015", "Interview Descriptions": "I interviewed with HR and then second interview with nursing manager. I toured the unit after interview. I got a call a few weeks later and I was offered a position.", "Interview Questions": "Why do you want to work here?"}], [{"date": "6 Dec 2015", "title": "EMR Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University Medical Center New Orleans (New Orleans, LA) in Jun 2013", "Interview Descriptions": "I had to demo a training presentation on a topic to simulate a training class.  If you can do this successfully it won't be bad.  Overall, the manager looks for people who are personable, knowledgable, and able to teach adults in a clinical setting.  Clinical experience is helpful but not required.  The best thing you can do is to keep it simple.  It's one interview after the prescreen in HR, I believe.", "Interview Questions": "Describe your training experience/Epic knowledge."}]]