[[{"date": "1 Jun 2023", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at NESTA (London, England) in Jun 2023", "Interview Descriptions": "Interview of 30 minutes, followed by a technical task of four hours and another interview of 45 minutes with a Q&A format. The process was very well organised and there wasn't much issue during our calls.", "Interview Questions": "Could you please tell us about your experience of working in teams?"}, {"date": "17 May 2023", "title": "Assistant Programme Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at NESTA (London, England)", "Interview Descriptions": "Good experience was really nice meeting the team. It was multiple staged interviews and engaging. Everyone was friendly and seemed really intelligent. There was an interest in my passions as well as my experience.", "Interview Questions": "Situation based questions around how you have dealt with previous scenarios"}, {"date": "27 Apr 2023", "title": "CXO Team Member Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at NESTA (London, England)", "Interview Descriptions": "Phone screen interview for 30 minutes with a CXO team member. Approx 6-7 questions covering leadership, experience with design thinking and innovation methodologies and practices, motivations and how would deal with areas of less experience", "Interview Questions": "What is one innovation from NESTA or Behavioural Insights Group that you find memorable and transformative?"}, {"date": "14 Mar 2023", "title": "Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NESTA", "Interview Descriptions": "They were very nice and took to great lengths to make it anonymous for the first interview in order to reduce bias in the hiring process. It was for the Challenge Works arm and they were quite relaxed.", "Interview Questions": "What are some bad challenge prizes we have designed?"}, {"date": "3 Apr 2023", "title": "Design Resident Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at NESTA (London, England) in Mar 2023", "Interview Descriptions": "After the application review, it jump straight to interview invitation. It's a virtual interview one recruiter and three members from the design team. It's easily to access with zoom and the conversation is very chill.", "Interview Questions": "General behaviour questions and your experience in project management and coordination."}, {"date": "8 Nov 2022", "title": "People and Culture Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at NESTA", "Interview Descriptions": "Informal interview over Zoom. Very welcoming people. Questions centred on examples: Policy Development Employee Relations Performance Management Coach Managers on employee relations Involvement in strategic people projects General strengths and weaknesses", "Interview Questions": "Give an example of a policy development you have been involved in delivering."}, {"date": "15 Aug 2022", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NESTA (London, England) in Aug 2022", "Interview Descriptions": "The application process is fully anonymous, and is made more inclusive by asking you to describe your approach to hypothetical tasks/situations rather that focus on specific experience or qualifications. Having scored well with my responses, I was invited to interview with two members of the Sustainable Futures Mission team. Again, the questions were mostly situational. Although I do think this is a good approach, I did feel that I had wasted a lot of time trying to prepare. The people who interviewed me were very friendly and I felt comfortable throughout the process.", "Interview Questions": "What would you do if you had been asked to give a presentation on a topic you had very little knowledge of, with very little time to prepare?\r\n\r\nWhat would you do if the deadline was fast approaching and you had nothing to present?"}, {"date": "23 Jun 2022", "title": "Investment Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at NESTA in Jun 2022", "Interview Descriptions": "Started off standard first stage with questions about the role and motivations for applying. Then had to wait a month and a half to hear anything about progression to the next stage. \r\n\r\nSecond interview stage also was very standard with certain role specific questions. However, the interviewers were decidedly uninterested and completely un-interactive. Very poorly conducted. Then I only received feedback and a result after chasing them up 3 weeks after they said I would receive it. \r\n\r\nOverall very underwhelming and frustrating interview process.", "Interview Questions": "Why impact investing?\r\nHow would you assess a healthy company?"}, {"date": "24 Jan 2022", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at NESTA", "Interview Descriptions": "Relaxed and friendly. I felt very comfortable and all my questions were answered. I had a great feeling about this company! \r\n\r\nI was asked questions about my work experience, my desire to study a professional qualification and where I see myself progressing to.", "Interview Questions": "About my experience and my career progression"}, {"date": "24 Oct 2021", "title": "Finance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at NESTA", "Interview Descriptions": "Standard Questions, based on the competencies required for the role, and motivation for applying to the organisation.  Invited questions at the end. Asked when I had done parts of the role.", "Interview Questions": "Odd statement on suitability at the start"}], [{"date": "13 Aug 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at NESTA", "Interview Descriptions": "First filter: closed and open-ended questions\nSecond filter: interview with 3 panellists based on situational questions ranging from how would you go around implementing a programme, interpreting findings from a graph, how would you deal with x challenge, etc\nNo questions asked about your experience", "Interview Questions": "What does this graph tell you?\nHow would go around implementing X programme?\n"}, {"date": "8 Jun 2021", "title": "Assistant Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at NESTA (London, England) in Apr 2021", "Interview Descriptions": "I got through the sift to a video interview. 5 written questions to answer in the sift, and 5 to answer in a one-way video interview. The video interview didn't inform me that I could re-record etc. prior to it, which was frustrating, as I would certainly have left more time and prepared more. So remember, you can pause, delete, ad re-record your answers!", "Interview Questions": "What do you know about water shortages? What are the first steps you would take in preparation for an event you are responsible for managing?"}, {"date": "12 Feb 2021", "title": "Programme Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NESTA in Feb 2021", "Interview Descriptions": "The interviewers were kind and friendly. The interview was 45 minutes of standard competency and technical questions around challenges and prizes as well as management style (very similar/identical to questions already on glassdoor). \r\n\r\nTo my surprise, I found the interviewers' answers to my own questions about team/work culture and strategy to be less inspiring than I expected.", "Interview Questions": "1. Describe one of Nesta's challenge prizes that most interests you and how you would add value to it as Programme Manager.\r\n2. What is a challenge and what are the strengths and weaknesses of using them in international development?\r\n3. What is your experience and approach to line management?\r\n4. What are the key attributes/skills needed for managing stakeholders?\r\n5.  How have you adjusted to working from home?\r\n6. Tell us about a challenge/problem you encountered and how you resolved it."}, {"date": "11 Oct 2020", "title": "Project Co-ordinators Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NESTA (London, England) in Sept 2020", "Interview Descriptions": "First round interview was about the role, and was with one staff member and competency based. Second round interview was much more focused on an exercise which I had to prepare in advance and had a panel.", "Interview Questions": "Tell me about an experience of developing partnerships?"}, {"date": "19 Aug 2020", "title": "Investment Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at NESTA (London, England) in May 2020", "Interview Descriptions": "The interview process started with submission of CV and cover letter, following that I was invited to 1st stage interview. Upon passing this stage I was invited to take take part in a written assessment, a case study of an investment proposal. Following this I made it to 2nd stage interview.", "Interview Questions": "How would you apprise a possible investment proposal?"}, {"date": "26 Sept 2021", "title": "Programme Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at NESTA in Mar 2020", "Interview Descriptions": "The assessment in the application process was entirely anonymous. They also provided feedback and information on how the assessment was made and how was the application rated. Although it did not result in an offer, it felt fair and unbiased.", "Interview Questions": "The assessment was anonymous to prevent bias and discrimination"}, {"date": "4 Nov 2019", "title": "Team Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NESTA", "Interview Descriptions": "Had two interviews with Nesta. Process took a few weeks, received an interview invitation relatively straight away.  Panel interview made up of Programme Manager and previous Team Coordinator who seemed nice. Interview comprised of two activities and questions were compentency-based. However, I felt at one point one of the panel members was trying to put me off, where they commented the environment and nature of the organisation is a lot different to my previous experience. Which is ironic as that person had a similar background. \r\n\r\nIn another interview it seems like the panel members were trying to catch me out, where they asked me questions I would not have identified from the JD. One of the panel member also made a disparaging comment when I told them what area I was coming in from...as much as the organisation seems like they are actively working to remove bias in the recruitment process, when you go to the office I found 98% of people there to be white! So i'm not sure if this was the type of environment I wanted to work in, particularly with the comment made by the panel member.", "Interview Questions": "What three qualities do you think is required for the role?"}, {"date": "25 Sept 2019", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NESTA (London, England)", "Interview Descriptions": "Firstly I was asked to do a small task and after it was about standard questions, such as what is my background, what are my expectations, whether and how I would handle tasks related to everyday operations and tasks that I should be doing", "Interview Questions": "They asked me where do I see myself in 5 years and what are my future career goals"}, {"date": "25 Nov 2019", "title": "Assistant Programmer Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at NESTA (London, England) in Aug 2019", "Interview Descriptions": "1st interview panel of two people. Second interview included a presentation task and a panel of two people (one person replaced by someone more senior than the previous panel member).", "Interview Questions": "Why this job, why now, why Nesta?"}, {"date": "11 Oct 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NESTA (London, England) in Jun 2019", "Interview Descriptions": "I initially had 2 telephone interviews, then went in to the office for a final interview. I originally met the head of the Better Markets Team, who I would be helping with diary management. Then had a 1:1 with the head of recruitment.", "Interview Questions": "How do I handle working under pressure."}], [{"date": "31 Aug 2022", "title": "Programmer Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at NESTA (London, England) in Mar 2019", "Interview Descriptions": "The interview consisted of questions and a presentation of ten minutes at the start of how I would approach the challenge of building up the organisation's capacity in this new space.", "Interview Questions": "How would approach building a stakeholder network in this role? "}, {"date": "10 Dec 2020", "title": "Investor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at NESTA (London, England) in Jan 2019", "Interview Descriptions": "Good, transparent and diligent interview process. Well organised. Used an anonymous first layer which helped to encourage diversity. Was supported well before and after. Would recommend. Was given good instruction beforehand.", "Interview Questions": "Core motivations for working there?"}, {"date": "6 May 2019", "title": "PA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NESTA (London, England) in Oct 2018", "Interview Descriptions": "There was a skills test followed by a 121 interview. All staff were very friendly and welcoming. The whole process from application to hearing back was efficient with clear communication. They made decisions very quickly and gave good feedback.", "Interview Questions": "What past experience means you are suitable for this role"}, {"date": "31 Oct 2018", "title": "Operations Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NESTA (London, England) in Sept 2018", "Interview Descriptions": "Interview was set up as video conference with two senior managers.   On the day, I received an email saying that videoconference facility was not working, so interview would be a phone call only.", "Interview Questions": "Give one example of a problem you came across in a previous role and how you dealt with it.  "}, {"date": "5 Dec 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at NESTA (London, England) in Apr 2018", "Interview Descriptions": "Interview lasted an hour with standard competency questions by two members of staff. They probe your answers to get the best out of you. Many of my colleagues later said they thought the interview went badly although they had secured the position", "Interview Questions": "What did you learn when you did this?"}, {"date": "11 Apr 2018", "title": "Programmer Compliance Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NESTA (London, England) in Feb 2018", "Interview Descriptions": "Submitted an application online through their website, was invited to interview a couple of weeks after. I negotiated for 1st stage to be done by skype with two staff, the person currently holding the position (going on maternity leave) and one project manager. I felt confident I replied to all questions and that I provided good examples on my knowledge of the areas mentioned in the job description\r\n\r\nI was confirmed I wouldn't be invited to 2nd stage, even if \"the panel felt that you gave a strong interview\", as communicated to me by HR.\r\n\r\nI have seen this same role re-advertised just few weeks after and I enquired with HR on what happened but was completely ignored.", "Interview Questions": "Have you ever been involved at designing internal management tools or processes?"}, {"date": "22 Aug 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at NESTA", "Interview Descriptions": "Fairly standard interview, was asked to do small task and feed back. Then range of questions on experience and skills e.g. working in a team, why want to work at company, future plans", "Interview Questions": "What has someone told you was a weakness of yours?"}, {"date": "13 Sept 2017", "title": "Assistant Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at NESTA (London, England) in Aug 2017", "Interview Descriptions": "Applied online, got shortlisted and invited to the first stage interview. The interview was competency based and took 45 minutes. Two people present, looked slightly tired but were engaged. Was not invited to the next stage. Competitive process.", "Interview Questions": "Why you are the right person for this role and our organisation?"}, {"date": "6 Jun 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at NESTA (London, England) in Mar 2017", "Interview Descriptions": "Normal application (CV, letter), one Skype interview, one in person. For the second interview I was offered to skype as well, if necessary.\r\nAfter the first interview, I was asked to complete a written exercise, which I got a brief and several days (over the weekend) for. \r\nQuick, friendly, kept me updated on progress,  even apologised when feedback to a little longer then expected", "Interview Questions": "Quite a bit about my previous role, some scenario questions (\"What would you do to achieve x if we had already tried y and failed?\") "}, {"date": "6 Mar 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NESTA (London, England) in May 2016", "Interview Descriptions": "I was put through by a recruiter, and having seen my application, via the recruiter Nesta asked me to write about an innovation I thought was effective and why. Then put through to face to face interview for which I had to present on an article they provided.", "Interview Questions": "I was required to present. Then asked about my experience, they asked in particular whether I wrote a blog or put my ideas out there."}], [{"date": "23 Dec 2017", "title": "Programmer Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at NESTA (London, England) in Oct 2013", "Interview Descriptions": "Application was online, selection for final interview rounds took about 3 weeks. Frequent email contact, all very pleasant and informal. The interview itself was also pleasant, fun, informal and refreshingly direct.  Two rounds of personal interviews, no presentations, tests or the like.", "Interview Questions": "Past experiences, what would qualify specifically for the job, career aims now and in 5 years. Became clear quickly that I would not want and should not accept the job if offered, misreading of the advertisement text. All in agreement, loved the experience. Maybe one day."}, {"date": "13 Sept 2013", "title": "Rater Not Say Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at NESTA (London, England)", "Interview Descriptions": "Luckily the process was quite direct, just a CV and cover letter. There wasn't a long online application. This was followed by a first interview, a task completed at the office, a presentation and a second interview.", "Interview Questions": "The interviews focused primarily on the parts of the job spec labeled 'optional'. They aren't optional. "}, {"date": "25 Jul 2015", "title": "Programmer Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at NESTA (London, England) in Sept 2013", "Interview Descriptions": "The process included submitting a cover letter and CV, and then I had two interviews. The first was a shorter, less formal interview. The second required me to prepare information and a presentation ahead and was demanding. I spent days preparing at all stages. I can't recall if I needed to do a written exercise as well, but this is often standard practice at Nesta for many roles.", "Interview Questions": "What drew you to this role?"}]]