[[{"date": "19 Jun 2023", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The University of Kansas Health System", "Interview Descriptions": "The interview process was smooth and but thorough. They ensured that the interviewers were peers within the organization and wanted to make sure that the candidates were a good fit.", "Interview Questions": "I think it is improper to put specifics here."}, {"date": "18 Feb 2023", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The University of Kansas Health System (Kansas City, KS) in Feb 2023", "Interview Descriptions": "A talent acquisition person will contact you first and have a short phone interview. Then they scheduled a second interview with me in person at the Headquarters building. My interview was supposed to be a four person panel but two of the managers didn't end up logging on for the zoom interview at the building. They were very personable and made me feel at ease. I got a call back a couple days after the interview that I got the job and I accepted.", "Interview Questions": "Q: Are you tech savvy and good with multi-tasking? Q: How do you deal with conflict in the workplace? Q: Would you consider yourself a fast learner and how do you handle it when you need to ask for help? Q: What do you do if you need help getting something done and don't understand the task? What about if your coworkers need help with their task?"}, {"date": "19 Nov 2022", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System", "Interview Descriptions": "Now that interviews have resumed in person post-COVID, the interview panels are not selected based on volunteers or seniority; they’re selected by favoritism and those that can be steered by the individuals in power.", "Interview Questions": "The questions are all scripted. It’s a joke."}, {"date": "31 Aug 2022", "title": "Business Intelligence Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The University of Kansas Health System (Kansas City, MO) in Aug 2022", "Interview Descriptions": "Was scheduled as a phone interview, but it was a video Teams meeting, which threw me off a bit. \r\n\r\nAfter the interview they told me they would schedule a time in the following week for a second interview in person knowing that I was interested. I was completely given the impression that they were interested in me as a candidate, telling me they wanted me to come in soon as I could, also saying they were willing to work with my schedule. I thought everything was good to go. \r\n\r\nI sent follow up thank you emails with an additional question on salary range, which I was told to follow up on if I needed to know,  and I attempted to schedule the second interview. I received no response and then was declined the job. Really odd experience. Seemed disorganized.", "Interview Questions": "General information on what the job was, and what they do along with how I could fulfill the role (know SQL, data visualization tools,  etc...)."}, {"date": "10 Jun 2022", "title": "Learning Systems Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The University of Kansas Health System", "Interview Descriptions": "Did a phone screen, then interview with the hiring committee.  Interview process took about a week, had an offer from the recruiter within two weeks. The interview process for my position was very laid back, very clear expectations and communications from the hiring manager.", "Interview Questions": "What interests you in this position?\r\n\r\nWhat is your experience with the software related to this position?"}, {"date": "7 Apr 2022", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The University of Kansas Health System", "Interview Descriptions": "The interview process is very relaxed and well planned. They are open to any and all questions that you might have.  Typical questions are about experience, why you want to work in this setting, career goals, and why work at this hospital.", "Interview Questions": "What experience do you have in this setting? "}, {"date": "25 Mar 2022", "title": "Intake Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The University of Kansas Health System", "Interview Descriptions": "I had an initial phone screen scheduled with the person in HR. The interview went well, but at the end she was not willing to negotiate compensation with me. She kind of discredited my bachelors and told me that I didn’t have experience, which I disagree with. She ultimately said that if I can’t accept a certain wage then they’re moving on. I think it would have been wise to let the hiring manager actually do the negotiating because that’s a pretty minuscule thing to determine someone’s candidacy.", "Interview Questions": "She asked if I’m comfortable being in a crisis situation because I was interviewing for children’s behaviorism health department. "}, {"date": "8 Nov 2022", "title": "Clinical Nurse Entry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The University of Kansas Health System in Mar 2022", "Interview Descriptions": "Meet with unit managers, tour the unit and do some shadowing on the unit, and answer basic interview questions, meet future coworkers. It was very relaxed and a safe feeling environment. Come with questions!", "Interview Questions": "Tell us about a time you made a mistake at work"}, {"date": "19 Nov 2021", "title": "Patient Account Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System in Nov 2021", "Interview Descriptions": "Applied online and a recruiter sent me an email the next day to schedule a phone interview. We agreed the recruiter would call at a specific time and they never did. We rescheduled and I was once again stood up. They finally called me the 3rd time we rescheduled. They were completely unorganized, couldn't find my resume, couldn't  remember what job I was interviewing for. They then asked my salary requirements, when I told them, they said the position starts at $15. Even with my 5 years experience. Honestly insulting. I accepted a position with another local health system for the same job.  They actually valued my time and experience and offered me almost $10 more an hour. I went from thinking highly of KU to now thinking they're a complete joke.", "Interview Questions": "Tell me about your background and previous job experience. "}, {"date": "15 Sept 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The University of Kansas Health System", "Interview Descriptions": "The Talent Acquisition teams was very responsive and asked for feedback often throughout the process.  Communications outside of the actual interviews were thorough, professional, and quick. There was an opportunity to meet with multiple members at different levels in the team and the questions were thoughtful.", "Interview Questions": "Please describe your career journey."}], [{"date": "19 Jun 2021", "title": "Service Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The University of Kansas Health System", "Interview Descriptions": "There will be an initial phone screen from HR. Once you passed the initial screening, you will be invited for an onsite interview (pre-covid) with the IT director. Questions varies from how flexible you are on the schedule and current skills and certifications", "Interview Questions": "What certifications do you currently have?"}, {"date": "5 May 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The University of Kansas Health System", "Interview Descriptions": "I met with the manager. We clicked well. I was able to get the job after shadowing experience during my interview.  The staff were very accommodating. They love new grads and are willing to find a spot for you.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "24 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System (Kansas City, KS) in Mar 2021", "Interview Descriptions": "Quickly received correspondance regarding the position I expressed interest in. Scheduling process was simple, and straightforward. The application process was user-friendly and supported auto-fill features. I look forward to the actual interview!", "Interview Questions": "Tell us about what makes you want to work for our company."}, {"date": "8 Feb 2021", "title": "Information Associate-PRN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System (Kansas City, MO) in Feb 2021", "Interview Descriptions": "I have only gotten to the phone interview. It went well and I look forward to hearing back from them. The questions were the standard interview questions. It’s a PRN position so it’s accommodating to students schedules.", "Interview Questions": "They asked about my skills"}, {"date": "13 Aug 2021", "title": "Iam Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System in Feb 2021", "Interview Descriptions": "After applying online and going through a phone screen and, I had a 1 hr interview with the 3 manager then a second 1hr interview with team members. Question were very objective but didn't get an offer. Few weeks after I received an invitation because the position was open again, I had another manager interview. I contact HR to check on the status and never got a reply back. I believe it was very unresentful the way it was handle at the end.", "Interview Questions": "Why you want to work here?"}, {"date": "24 Aug 2021", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The University of Kansas Health System (Kansas City, KS) in Dec 2020", "Interview Descriptions": "The entire interview process was average. I applied on their website and a recruiter got in touch with me after a week. Communication could have been a little better from the recruiter but after a week of trying to schedule a phone call interview, we were able to connect. The initial phone interview was simple with asking questions about why I wanted to work with the hospital and speaking about previous jobs. Luckily I was passed to the second round of interviews and two weeks later, I had my second interview with a panel of two in-person interviewers and three on Zoom. Two weeks later I was offered a position and accepted.", "Interview Questions": "How would you motivate your coworkers?"}, {"date": "8 Aug 2020", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System in Jul 2020", "Interview Descriptions": "Within a week of applying online I received an email from a recruiter to schedule a phone screen interview. Interview was standard behavioral question, recruiter was easy to talk to, was advised that she’d send my resume to the hiring manager. I was contacted the following day to schedule with hiring manager. Interviewed with 2 hiring  was the following day. Interview was in the STAR format, however it was fun and engaging. I asked questions also at the end of interview. Was advised I’d be called within a week, however recruiter contacted me the next day with an offer.", "Interview Questions": "Describe a time you made a mistake, and what did you do to correct it."}, {"date": "14 Jun 2023", "title": "Rehab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The University of Kansas Health System (Kansas City, KS) in Jun 2020", "Interview Descriptions": "One round of interview. It was very engaging. Fast response after interview. The interviewers were nice, welcoming, friendly, and engaging. The interview lasted for about 30 minutes or more. The process was managed in a timely manner. The manager was diligent in replying quickly, and offering the position.", "Interview Questions": "Memorable patient interaction Why do I want to work as a rehabilitation technician What are my strengths"}, {"date": "12 Apr 2020", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The University of Kansas Health System", "Interview Descriptions": "I interviewed at my department, which was fairly low key (my manager and co-workers are very down-to-earth and personable, which helped). There were 2 people that headed the interview with a few general interview questions and then a few about myself. Probably 1/4 of the time was just having personal conversation to see how personable I was and how I would fit in with the unit. Then I had a quick tour of the unit with a meet and greet of staff that were there that day.", "Interview Questions": "Why do you want to work here? "}, {"date": "27 May 2020", "title": "Patient Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System in Mar 2020", "Interview Descriptions": "The hiring/interview process used by the University of Kansas Health System consisted of 2 phone interviews and a possible in person interview. The first phone interview is with a \"talent acquisition partner\".", "Interview Questions": "What will you bring to this position?"}], [{"date": "27 Aug 2019", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at The University of Kansas Health System (New York, NY) in Jul 2019", "Interview Descriptions": "I applied for a separate unit and ended up receiving a call from HR about another unit. I agreed to have my resume sent to the other unit's hiring manager and then scheduled a time to speak with her. \n\nI met her about a week later.", "Interview Questions": "Tell me a little bit about you and also the reason you applied for this position."}, {"date": "7 Jan 2020", "title": "Nursing Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The University of Kansas Health System (Kansas City, MO) in Jul 2019", "Interview Descriptions": "First they conducted a phone interview and then HR set up an in person interview which then resulted in a call back confirming selection for the position. During the in person interview I was given a tour of the unit and introduced to other management.", "Interview Questions": "Why do you want to be a nurse? Scenarios regarding who the priority patient would be, etc. "}, {"date": "9 May 2019", "title": "Scheduler and Insurance Verification Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The University of Kansas Health System (New York, NY) in Apr 2019", "Interview Descriptions": "I interviewed and thought the interview went good. I was asked about my job duties at my previous job and she felt I would be a perfect fit for either position. Told me training would begin May 6 and the surgery center would open on June 4. She told me she would contact me by the end of the week. I waited until Monday of the next week and reached out via email to follow up and never recieved an response saying anything or at least saying they choose another candidate.", "Interview Questions": "What did you do in your last job"}, {"date": "11 Feb 2021", "title": "BI Statistician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at The University of Kansas Health System (Kansas City, KS) in Apr 2019", "Interview Descriptions": "Call with recruiter, followed by an interview with the director, a fellow BI Statistician II, and a Data Engineer II. If you make it past that interview, you'll have a third and final interview with the one or both vice presidents. First interview is more technical. Second interview is to make sure you can talk and explain things to leadership as they will be your audience the majority of the time.", "Interview Questions": "Explain the results of T-Test as if you were talking to a medical doctor"}, {"date": "5 Jun 2019", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at The University of Kansas Health System (Kansas City, KS) in Mar 2019", "Interview Descriptions": "I got an email from a recruiter soon after applying to schedule a phone interview the following week. I replied to the email with my availability, and didn't hear anything back for a week so I sent a follow-up. She said that she didn't receive my email and scheduled my phone interview for the following week. \r\n\r\nThe phone interview was very short and one-sided, she did not tell me anything about the position and asked me a few questions. It seemed to go well enough, and the recruiter said that next steps would be to pass my information on to the director and schedule an in-person interview. Four weeks passed and I heard nothing, but assumed I would still be scheduled for an interview since that was the expectation that was set. \r\n\r\nI sent a follow-up email to the recruiter. She never responded to the email, but about a week after my follow-up I got an automated email saying that I wasn't selected. \r\n\r\nThis seemed like a long process, it was very impersonal, and there was poor communication from the recruiter I worked with.", "Interview Questions": "Tell me about your past experience."}, {"date": "23 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System (Kansas City, KS) in Feb 2019", "Interview Descriptions": "Online application was very user friendly. Less than a week later, there was a call about which units would like to interview me.\nI did in person interviews with three different units and got to choose which one I wanted to go with. Everything was well planned. \nI got a call about two days after the interviews asking if I would like to shadow any units to help me decide. \nThen it was up to me, where I wanted to work. I chose and I had a job!", "Interview Questions": "any difficult confrontation with other employees in the past. "}, {"date": "12 Feb 2019", "title": "Employee Relations Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System (Kansas City, KS) in Feb 2019", "Interview Descriptions": "The recruiter was personable and responsive.\r\n\r\nDuring the phone screen we started by going over resume and talking about dates of employments.\r\n\r\nShe then told me about the ER team and some of the projects they are currently working on. Explained to me some the organization structure and what they are looking for with filling this role. \r\n\r\nWe then transition into general questions.", "Interview Questions": "What is your philosophy in relations to ER?\r\nWhat do you most and least like about your current role?\r\nWhat are you looking for to find in this role?\r\nWhat type of leadership would best suit you?\r\nWhat type of investigations have you worked on?\r\nHow do you measure success?\r\nAlso asked, what sort of compensation ranges did i believe this role falls in?\r\n\r\n"}, {"date": "16 Jan 2022", "title": "PSR I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at The University of Kansas Health System (Overland Park, KS) in Feb 2019", "Interview Descriptions": "Very slow. A lot of people end up going elsewhere cause they take so long with the interview and hiring process. If you really want to work there follow up with them if you haven’t heard anything back", "Interview Questions": "How can you be beneficial to the company "}, {"date": "14 Nov 2018", "title": "Rehab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The University of Kansas Health System", "Interview Descriptions": "multi step process, application, phone interview, in person interview. Interview process took a little longer than expected. When moving from part time to full time it required going through the same interview process.", "Interview Questions": "What is your previous experience?"}, {"date": "18 Jun 2018", "title": "Patient Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The University of Kansas Health System (Prairie Village, Johnson, KS) in Jun 2018", "Interview Descriptions": "It was very easy. There whole interview lasted about an hour and a half. It was very informal and had an nice flow to it. They asked me questions off the top of their heads instead of pre-listed questions. At the end of the interview they gave me a tour and had me shadow them for about 15 minutes.", "Interview Questions": "What are you’re future goals?\r\nWhat qualities from your previous employment will you bring here?"}], [{"date": "16 May 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The University of Kansas Health System (Kansas City, KS) in Apr 2018", "Interview Descriptions": "- Good questions\r\n- Friendly atmosphere\r\n- Tour of unit \r\n- Interview with nurse manager and nurse educator\r\n- Got to meet co-workers \r\n- Casual and comfortable \r\n- Felt appreciated and at ease", "Interview Questions": "How do you handle conflict with co-workers? "}, {"date": "5 Dec 2018", "title": "Registered Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at The University of Kansas Health System (Kansas City, KS) in Mar 2018", "Interview Descriptions": "The hiring process went smoothly. I was contacted by the hiring manager fairly quickly to set up and interview. The interview process went smoothly, as I was well prepared for it. Shortly after I was contacted by HR and extended an offer.", "Interview Questions": "Why would you like to work for the University of Kansas Health Systems?"}, {"date": "3 Mar 2020", "title": "PCT Rehab Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The University of Kansas Health System (Kansas City, KS) in Dec 2017", "Interview Descriptions": "Quick and easy! like two weeks and I was hired. Just wear nice clothes and be bubbly and you got this. You'll do a phone interview with a HR person then get a call back for manager interview", "Interview Questions": "Why healthcare?"}, {"date": "27 Dec 2018", "title": "Human Resources Compliance Investigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The University of Kansas Health System (Kansas City, MO) in Nov 2017", "Interview Descriptions": "The online application took hours and crashed on me twice. I had a telephone interview followed by an in-person interview. After the interview they never followed up to notify me that I wasn’t selected for the position.", "Interview Questions": "I was asked to talk about each position listed on my resume."}, {"date": "28 May 2017", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The University of Kansas Health System in May 2017", "Interview Descriptions": "Applied online( was a long application). Had to take a personality-type quiz which took about half an hour. A week later was called for a phone interview and a in-person interview.  Phone interview took half an hour and was with a job recruiter. Was asked basic interview questions and then told about salary and benefits. Was told to wear business attire and to ask interviewer alot of questions for in-person interviews.", "Interview Questions": "Describe a time you had a conflict with a coworker and how did you resolve it?"}, {"date": "2 May 2017", "title": "Patient Account Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The University of Kansas Health System (Overland Park, KS) in Apr 2017", "Interview Descriptions": "I applied at the end of March received an email to do a phone interview mid April. Phone interview went well & was offered to interview for another position that I hadn't applied for but she thought it would be more of what my background is. Had an interview with department manager. Which I thought went really well. Was told they will make a decision by Friday of that week. Didn't hear anything from either interviews. But positions are still up on website.", "Interview Questions": "N/A"}, {"date": "13 Mar 2017", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 3 days. I interviewed at The University of Kansas Health System (Kansas City, KS)", "Interview Descriptions": "Within a week of applying, was asked to come in for an interview. I arrived a bit early for the interview (about 10 min). After 30 minutes of waiting,I was told that the doctor was not in the building and that no one know where he was, but to wait. After another 10 minutes, I was brought to another room to wait while the doctor interviewed someone else for another position. Finally, about 50 min after my scheduled time, I was brought in for a 10 min interview. He started firing off questions rapidly before I could even sit, and after about 4 questions was practically pushing me out the door! Since he didn't want to talk to me at all, I can only assume that he made up his mind about me based upon something else entirely!", "Interview Questions": "Strengths and weaknesses."}, {"date": "29 Mar 2017", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The University of Kansas Health System (Kansas City, MO) in Mar 2017", "Interview Descriptions": "After applying, I was required to complete a time-gobbling assessment. From there, I heard from a Lead Recruiter (that referred to herself as \"Senior Management\") who went through a list of standard prescreening questions, which seemed to have been read from a list. No insight provided as to the role itself. It was a one-way conversation. \r\n\r\nA week later, I heard from a virtual Consultant, who called to schedule a phone interview with the Chief HR Officer, for 8:00 AM on a Saturday morning. She called late, then proceeded to go through a list of standard questions as before. The call went 30 minutes. Low energy/enthusiasm again. I started to wonder if I should even continue on in the process. I was told that I would be hearing from the Consultant again re: an onsite interview. \r\n\r\nLater, I did get a call, but it was to set up a THIRD call, with her, for the following evening at 7:30PM. Once again, standard questions, a bunch of repeats that I had answered twice before. No real insight into the role, as she was not an employee, and didn't have any information to share about the working conditions, daily activities, etc. I was told I could expect an update within a few days. A week later, and I received an auto-generated email (no personal call, email) letting me know that I was not selected. \r\n\r\nAs a prospective employee, if you want to invest a lot of time and energy in seeking out employment (ex: the application, the personal assessment, 3 rounds of phone interviews) with KU, I'd suggest checking out some of the other employers in town first. They have the courtesy and professionalism to notify you by way of email or phone call, vs. a cold, auto-generated e-notification from KU. Clearly, growing pains (and possibly staff shortages) at this organization leak into the candidate experience. I think it is indicative of their views on candidates, and most likely, their employees.\r\n\r\nTrust your gut when exploring new opportunities. If you like working with intelligent, highly-qualified, experienced professionals, take note of the HR staff and the vetting process. In each of those conversations, if not one unique question was asked outside of a low-energy/enthusiasm pre-formatted screening battery, and very little time (if any) was allotted to sell you the organization, specifics about the role, and WHY you should want to work with them, then you might be happier elsewhere. I see it as a mentality that you should feel lucky to be called by them, a 1-way street. \r\n\r\nThe fact that they interview candidates at 7:30PM at night (via non-employee Consultant in Salt Lake City), and 8:00AM on a Saturday morning (via the Chief HR Officer) is a red flag in my mind. Very strange. SLOW moving as well.\r\n\r\nOverall, one of the worst impressions of an employer I’ve ever walked away with. I think I dodged a bullet.  They obviously do not care about their Employment Brand and have very little understanding of how easy it is for candidates to steer away future hires within their network.", "Interview Questions": "Why are you interested in this role, and KU Health? "}, {"date": "11 Feb 2017", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at The University of Kansas Health System (Kansas City, KS)", "Interview Descriptions": "Had a phone interview with a recruiter. I was impressed with her knowledge of the position. She was great at keeping me informed throughout the process. \n\nThe second interview was a phone interview with an existing instructional designer. We discussed eLearning programs, and the process for developing a training.", "Interview Questions": "Do you have a wishlist of eLearning applications?"}, {"date": "15 Mar 2018", "title": "Windows Systems Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The University of Kansas Health System (Mission, KS) in Feb 2017", "Interview Descriptions": "The process took several months. I got a call 2 weeks after applying and then had my first interview 2 weeks after that. I then waited 4 weeks for the second interview. From there, I had a drug test within 24 hours of hearing their offer if I accepted the position.", "Interview Questions": "Questions on applications that you have listed on your resume. How you handle certain situations. Pretty general interview questions. "}], [{"date": "1 Sept 2017", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System (Kansas City, KS) in Feb 2017", "Interview Descriptions": "Most of the questions are about how you handle your current job and tasks. Most of it was to see if the manager gets along with you. He basically took what i do and told me how it would be very similar but with more freedom.", "Interview Questions": "Do you like sports?\r\n"}, {"date": "18 May 2017", "title": "Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System (Kansas City, KS) in Jan 2017", "Interview Descriptions": "Thorough interview. The interviewer wanted to get to know me and make sure I would be a good fit for the hospital. We had a short session of getting to know each other and then my interviewer proceeded with questions about my work performance, past work experience, and what I would be able to contribute to the organization.", "Interview Questions": "Describe where you see yourself in 10 years?"}, {"date": "18 Jan 2020", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at The University of Kansas Health System (Kansas City, KS) in Dec 2016", "Interview Descriptions": "I was hired through a temp agency to begin the process and then was interviewed by the health system. It was about a 2-week process. During the holidays so I think it would have taken less time if it was at a different time.", "Interview Questions": "Tell me about a time....."}, {"date": "10 Mar 2017", "title": "Clinical Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System (Kansas City, KS) in Aug 2016", "Interview Descriptions": "Extensive, too many people and panels, full day. Reminds me of residency days. Like you are begging for a spot except this time feels like begging for a job", "Interview Questions": "Can you tell me of a time you received an unexpected feedback and how you handled it "}, {"date": "23 Jan 2018", "title": "Histology Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at The University of Kansas Health System (Kansas City, KS) in Dec 2015", "Interview Descriptions": "I had a several hour interview with management, pathologist, and tour of the lab.  I was asked several questions about how to handle a large lab with very complex cases and have several employees and several pathologist.", "Interview Questions": "How do I deal with employees that I do not get along with? "}, {"date": "24 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at The University of Kansas Health System (Overland Park, KS) in Oct 2015", "Interview Descriptions": "I thought it went well.  Their was a concern at first from HR for the position I had applied for in which they were thinking it required a BSN which in the application it didn't state it was preferred or required. During the interview the HR representative for the site had to verify this with the current nurse manager in order to proceed with the interview.", "Interview Questions": "Why did you choose a place like Marillac or mental health setting?"}, {"date": "12 Jan 2015", "title": "RN-2 Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The University of Kansas Health System (Kansas City, KS)", "Interview Descriptions": "Lengthy process.  Waited more than four weeks to hear anything from initial application.  Met with panel of managers and staff. Very nice.  Unfortunately, no feed back after that from HR. They need to update their website once position is filled.", "Interview Questions": "Asked questions related to experience and how you would handle conflict."}, {"date": "4 Jan 2015", "title": "House Keeping Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System in Dec 2014", "Interview Descriptions": "Two people interview you at a time , seems like they are looking for someone with stable work history , and a great personality . Not only did they won't someone who could push a brim , but also interact positively with patients.", "Interview Questions": "Who are you ?"}, {"date": "20 Sept 2014", "title": "Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The University of Kansas Health System", "Interview Descriptions": "Received a call for interview a month after applying. Interview went great. Was given all the info for drug screening, benefits and pay. Filled out for background check as well. Was told would be called for 2nd interview a month later no word. I sent an email asking next steps, was told still doing first rounds. A month later, no word. Sent another email, no response. Waited 3 weeks, sent another email to see if I was still in the running, was told my qualifications didn't match what they were looking for.", "Interview Questions": "The usual scripted questions from a recruiter."}, {"date": "14 Jun 2014", "title": "Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The University of Kansas Health System (Kansas City, KS) in Jun 2014", "Interview Descriptions": "Applied online. Got a call from them about 3 weeks later which consisted of an impromptu phone interview. Interview went alright, wasn't expecting them at that time. Said they would pass it on to the hiring managers and get back in touch with me. It's been a week and no response yet.", "Interview Questions": "What would you do to remedy a situation in which there was an upset patient?"}], [{"date": "11 Nov 2017", "title": "Patient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The University of Kansas Health System (Kansas City, KS) in Apr 2014", "Interview Descriptions": "THey asked pretty basic questions like previous job experience and why you want to work at KU Med. What was a difficult situation that you have been in. That kind of thing. The interview was not hard, there was no IQ or personality test.", "Interview Questions": "If you saw a coworker violating a patient's privacy like taking a picture what would you do? "}, {"date": "3 Dec 2018", "title": "G I Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at The University of Kansas Health System (Kansas City, KS) in Feb 2014", "Interview Descriptions": "It was the standard interview. Walk in and sitting there was the manager of the department, a few nurses and a few technicians. They asked a handful of question designed to assess if I would be a good fit for the position as well as able to the department. Then it was over. The total time of the interview was maybe 30 minutes.", "Interview Questions": "Do you think you would be a good fit for this department?"}, {"date": "26 Apr 2017", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System (Kansas City, KS) in Jan 2013", "Interview Descriptions": "I was interviewed by the nurse manager and assistance nurse manager. I was told about my job and asked if it was something I would be interested in. I was asked to do a drug screening.", "Interview Questions": "If I was interested in the job. "}, {"date": "15 Mar 2014", "title": "Exercise Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The University of Kansas Health System in Mar 2012", "Interview Descriptions": "Interviewed with a recruiter and went over salary range & benefits.  Met with department manager and was told they would give me a call.", "Interview Questions": "Can't remember"}, {"date": "11 Feb 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The University of Kansas Health System (Kansas City, KS) in Jan 2012", "Interview Descriptions": "After submitting my application online, it was two weeks before a recruiter contacted me. The Interview process involved an interview first with HR, and then with the unit manager and group panel. Often times the group panel can prove intimidating so definitely expect this and be prepared.  Interview questions in both interviews were very straightforward, and what had been anticipating. I then accepted the offer, scheduled a physical exam and drug screen and began orientation within a month. Overall great experience during the interview process and during my time of employment at this amazing institution. Highly recommend it both as a place of employment and for those seeking care!", "Interview Questions": "Why would you want to work here?\r\n\r\nWhy did you become a nurse?\r\n\r\nCan you recall an experience when you had a problem with a client and how did you resolve it?\r\n\r\nWhat are you most proud of?"}, {"date": "27 Jul 2015", "title": "Precert Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The University of Kansas Health System (Kansas City, KS) in Nov 2011", "Interview Descriptions": "Applied, got a call back within a couple of weeks.  Had a phone interview with a rep in HR, and then was asked to come in for an in person interview & testing the next week.  Testing took about an hour, and then had a quick interview with someone in the HR department at the main hospital.  After I passed her inspection, I was sent that same day to the administration building for an interview with the manager of the department I was applying to work in.  The map they gave showing how to get there wasn't accurate, but I eventually made it.  Had a second interview with three people involved.  I was told that they would not call if I was not offered the job, so just assume they had picked someone else if I didn't get a call.  Was offered the job the next day by the HR rep, and they overnighted employment paperwork to me.  I had to wait a few weeks until their next new employee orientation before starting.", "Interview Questions": "The HR interview wasn't bad, pretty standard.  The management interview was not so much difficult, but it was pretty intense because but they asked questions that were oddly specific, like where they wanted you to describe in detail situations you were in tat a past employer, and how you dealt with that. For example, \"When you were at your last job, what is an example of how a co-worker was difficult to deal with, and how did you resolve your conflict?\" or \"Explain in detail a situation at your last job where you saw a deficit in the processes and how you took a leadership role in resolving the issue?\"  Crap like that.  If I had a little bit of time to think about it, sure I could have come up with some sort of clever answer, but as it was It really put you on the spot with how specific the questions were. I'm sure most people just BS their way through that part because it's difficult to think of good examples for the questions they were asking. In addition questions like that, they asked me about my strengths and weaknesses, and a couple of silly questions just to see my personality."}]]