[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "There are many reasons why I love my job at Our Future Health and still enjoying coming to work after nearly 3 years!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Dec 2022", "job_title": "EA to CEO /Office Manager in London, England", "duration": "N/A", "pros": "Incredible work/life culture - lots of flexibility and autonomy. I have never once felt that I need to ask for permission to do anything. I am empowered to make decisions for myself and my team without being micromanaged which in my field of work is very rare! It's a bonus I actually like and respect my boss and I definitely can't say that for 70% of the people I have supported in previous roles! I am trusted to work with minimal supervision and I am accountable for my performance, learning and development. There is real openness, trust and transparency in working at Our Future Health! As start-up companies go, trying to accomplish an ambitious task, bringing together a wealth of talented individuals from various different backgrounds, industries and disciplines to achieve a common goal, there have been a lot of trials and errors but what I love most about Our Future Health is that we are resilient, we're not afraid to put our hands up and say 'what could we have done or do better?'. Most of all, we genuinely care about each other so when someone has something to say. we listen. The company is evolving rapidly. The amount of employees we have now speaks volumes to why Our Future Health is a great place to work!", "cons": "None for me, even after nearly 2 years and 8 months!"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Lost in chaos, poor leadership, and over promised milestones", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "7 May 2023", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "The company is filled with some really smart cookies and the office location is great. People are generally friendly and social and there is a generous holiday allowance. Tech for good.", "cons": "Unfortunately, the company feels increasingly chaotic, dysfunctional, top-down, and disempowering. Due to previous overpromising, teams are forced to run towards unrealistic milestones at an unsustainable pace with no space to think about what actually drives value. Teams are put under increasing pressure to churn out output after output for no other reason than \"this is what was promised\" which takes autonomy away from teams, is burning out really talented people and causing them to leave. There seems to be a real disconnect between the leadership level and the team level and strategy conversations seem to take place within a black box between a siloed few (if they happen at all). Rather than slowing down to get everyone aligned, the current approach seems to be to hire more and more upper and middle managers into the company which only adds to more instability to an already rocky foundation."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "A dysfunctional mess with no strategy and ego-driven management", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "31 Mar 2023", "job_title": "Technology Consultant in London, England", "duration": "N/A", "pros": "The team is comprised of capable and friendly individuals who are driven to succeed. The organization places a significant emphasis on employee well-being and provides a robust compensation package, which includes 30 days of leave plus bank holidays, as well as generous pension contributions. In addition, employees are allotted a dedicated learning budget, with no questions asked, that can be used for a variety of educational resources, including books, courses, subscriptions, and coaching. The company's high-level mission is truly inspiring, and being part of an initiative with the potential to revolutionize the field of medicine is a unique and exciting opportunity.", "cons": "The company, especially its technology team, is experiencing systemic structural issues, burning through significant amounts of money, and facing a high staff turnover due to poor management and a negative work environment. The inexperienced middle management cannot drive the necessary scale to move the program forward - the rapid expansion over the last year has been poorly managed with no alignment under a common vision. The executive team is now attempting to use command and control leadership to force alignment, but in reality it's led to disjointed siloes focusing on their own CVs rather than working together for the good of the program."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great place to work in general", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Mar 2023", "job_title": "Programme Manager in London, England", "duration": "N/A", "pros": "Great Culture and good mission overall", "cons": "public sector politics and dynamics"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Fast pace, exciting, fun, well bieng focused", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Jun 2022", "job_title": "Service Desk Manager in London, England", "duration": "N/A", "pros": "It is an amazing opportunity to be involved in a project that will have a huge impact our future generations. The culture is fast paced, lots of work to do, exciting projects to be involved in.\r\nColleagues are all very friendly and supportive. There are no red tapes or bureaucracy which mean I can be creative and share my thoughts and ideas without feeling scared.\r\nIt feels like the whole organisation together is working towards a joint goal and we are all moving ahead.\r\nSenior management is very honest and transparent.", "cons": "I honestly don't have any"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Exciting new initiative and a great team", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Sept 2021", "job_title": "Chief Operating Officer in London, England", "duration": "N/A", "pros": "Great culture, and a fantastic vision. A really talented team from all walks of life.", "cons": "The team have a very audacious challenge!"}], [], [], []]