[[{"date": "13 May 2023", "title": "Student Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Daytona State College (Daytona Beach, FL)", "Interview Descriptions": "30 minute panel interview with 3-6 person panel. The people on the panel may or may not be directly related to the job you are interviewing for. Sometimes the people on the panel know nothing about the job you are interviewing for. If offered the job, there isn’t flexibility with the offered salary.", "Interview Questions": "How would you respond to a specific student scenario"}, {"date": "11 Aug 2021", "title": "Payroll and Benefits Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Daytona State College in Aug 2021", "Interview Descriptions": "It was a committee interview,  which was a little intimidating,  but all that interviewed me made me feel very comfortable. They went around the table and asked me questions round robin.", "Interview Questions": "What are skills that you have and how proficient am I in them?"}, {"date": "5 Apr 2019", "title": "Enrollment Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Daytona State College", "Interview Descriptions": "Typical interview with a series of questions. A two-person panel, the total process takes about  4 weeks. The interview location was in a small room rather than being in a board meeting room. Which overall made things a bit more comfortable.", "Interview Questions": "What does customer service means to you?"}, {"date": "16 Feb 2019", "title": "Online IT Design Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Daytona State College (Daytona Beach, FL) in Jan 2019", "Interview Descriptions": "After posting application, I was called in for an interview. After interview I was told they will meet with committee and make a decision to recommend to board of directors to approve.", "Interview Questions": "What would be your strengths and weaknesses in a team setting. "}, {"date": "8 Jan 2019", "title": "Tutor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Daytona State College (Daytona Beach, FL) in Feb 2016", "Interview Descriptions": "The interview was fine. People were friendly and asked interesting questions related to mathematics.  They wanted to know my grades. I explained a little about what I like about math. They seemed serious during the process.", "Interview Questions": "Interest, grades, and so on"}, {"date": "4 Aug 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Daytona State College (Daytona Beach, FL) in Sept 2014", "Interview Descriptions": "The \"interview\" was more of an overview of the position and a check to see if you have a bachelor's degree and that you've taken enough math courses to qualify. I was required to shadow an instructor for each of the two math prep courses to determine if I felt I was a good fit for the position. After the shadowing, I completed formal paperwork, got fingerprints done and went through a short orientation during the next week. I should note that I applied in January and didn't get a call until September when they needed more faculty.", "Interview Questions": "Which math courses have you taken?"}, {"date": "29 May 2014", "title": "Student Account Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Daytona State College", "Interview Descriptions": "This job was being offered online and I applied for the position. About a week later I got a call for an interview. It was a formal interview with two individuals from the department I would be working in. Interview was about 20 minutes and the questions they asked were very easy to answer.", "Interview Questions": "Normal Interview Questions."}, {"date": "11 Aug 2017", "title": "Career Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Daytona State College (Daytona Beach, FL) in Aug 2013", "Interview Descriptions": "Typically 6-8 different level supervisors, directors and co-workers will be on the panel.  Start as part time to get my foot in the door, then after 6 months was full time for nearly 10 years.", "Interview Questions": "Tell us about your experience with cultural and individual diversity?"}, {"date": "9 Apr 2015", "title": "Professional Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Daytona State College (Deland, FL) in Oct 2012", "Interview Descriptions": "After receiving a call back, I was promptly scheduled for an interview. After discussing my experience and qualifications, I immediately filled out paperwork. I was told I would be called with a start date when everything was verified. I started approximately a week and a half later.", "Interview Questions": "I was specifically asked which math classes I had taken and my proficiency in them."}, {"date": "12 Jun 2012", "title": "Programmer I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Daytona State College (Daytona Beach, FL) in May 2012", "Interview Descriptions": "It was mainly just behavioral interview questions , no real technical questions. Just basically explain your experience.", "Interview Questions": "Have you ever dealt with racism in your workplace?"}], [{"date": "9 Sept 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Daytona State College in Jun 2011", "Interview Descriptions": "First, I was interviewed on the phone by the assistant chair of the department.  Then, it was scheduled for me to fly into Daytona and stay at a hotel for a full day of the interview process. I created a mock lesson plan and presented it to a group of faculty and staff at Daytona State College. After that, I was interviewed by the chair of the department. My last interview included talking to the president and VP.", "Interview Questions": "Where do you see yourself in the future? "}]]