[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great organisation, purpose and committed people", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Apr 2021", "job_title": "Coordinator in The Hague", "duration": "N/A", "pros": "Great atmosphere, conditions and wider community of staff, collaborators and alumni.", "cons": "Limited resources compared to some larger organisations, but compensated by strong commitment levels among staff."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "5 star potential, 1 star reality:  still deeply  mired in dysfunction", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Sept 2022", "job_title": "Anonymous Employee in Haag", "duration": "N/A", "pros": "Mission, (most) staff, flexibility, benefits: the IB has all the basic pieces in place to be a great place to work and make a difference in the world.\n\nThe new DG has set a vision for the organization that is inspiring and could make for a wonderful working environment and a highly functional, even groundbreaking organization. \n\nEntry-level and junior staff are benefitting from the organizational changes already.\n\nAs with the overall rating, the ratings below reflect current reality; the rating for the vision that has been presented would warrant 4 or 5 stars in most categories.", "cons": "TL:DR - Key executive leaders remaining from the previous DG's tenure are paying flamboyant lip-service to the exciting new vision and transformative culture change, but continue to exhibit bullying, self-serving, incompetent and short sighted behaviours in their day-to-day activities and interactions with staff and each other. Change will be impossible so long as this continues.\n\n----\n\nEither incapable of understanding the implications and requirements of the new vision or choosing to use this moment of change as an opportunity to expand their fiefdoms, key executive team members consistently undermine their colleagues and are rapidly eroding the IBO's credibility from within. Bullying runs rampant and significant decisions are being made based on who can respond to emails the fastest or speak the loudest, rather than on collaborative, thoughtful consideration of complicated issues, drawing on staff expertise and using the approaches and tools inherent to the \"new IB culture.\"\n\nThese same \"leaders\" are directly responsible for the failure of crucial long-delayed initiatives, some adding new items to long lists of their past disasters. Staff morale is plummeting as yet another round of vital projects falls apart with no acknowledgement from leadership that they take responsibility for the outcomes, no sign of the organisation holding them accountable for their repeated inability to deliver, and no indication that the IBO recognises these now clear trends of failure as signs of larger problems needing immediate attention. \n\nThis failure of leadership is also impacting the flagship initiatives of the \"new IB.\" One example is a recently launched global symposium, with the aim of engaging and listening to diverse voices, has been offered only in English, running counter to both the event's stated purpose and to a long-standing IB policy of always offering resources and services in the organisation's three working languages. \n\nThe organisation remains hamstrung by the brain-drain that took place under the previous leadership (and continues to occur, albeit at a slower rate). There is little substantive subject/curriculum expertise among the staff, which is rapidly eroding the IB's core value proposition -- an unimpeachable, innovative set of curricula -- due to short-sighted, ill-informed decision making. Efforts are made to compensate, but there is a limit to how much any organisation can work around such deficits and how quickly experts can be brought in or contracted to make up for lack of internal expertise. Many other departments are also struggling due to a lack of institutional and subject-matter knowledge. Staff are well-intentioned and hard working, but in many cases, they don't know what they don't know, and the leaders from whom they are taking direction don't know either and worse, don't care to find out.\n\nThere is little opportunity for advancement from mid-level management upward. The organisation's new culture has not yet been brought to bear on staff advancement, and the process and priorities for pursuing and achieving advancement remain murky. Quite a few recent promotions were set into motion by previous leadership and many are not aligned with the newly set priorities of the organization."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Too much politics", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Jul 2021", "job_title": "Project Coordinator in The Hague", "duration": "N/A", "pros": "Great organization's mission and values and mostly competent and collaborative colleagues. It's a great place to learn about international education.", "cons": "Not enough organization and direction, pushing amazing talented staff members to leave frustrated by not being enabled to perform their job.\nToo many micromanagers with big egos and attitudes very far away from the mission and value, which the organization is so respected for. It's a shame!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Low", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 May 2021", "job_title": "Associate in The Hague", "duration": "N/A", "pros": "Very international pool of employees. Diversity was the best. Education for a better world", "cons": "Poor management board. Career progress is not in their radar"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Development Experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "13 Apr 2021", "job_title": "Head Of Operations in The Hague", "duration": "N/A", "pros": "Lovely colleagues, stakeholders, board and committee members, schools, teachers and educators. Such a wonderful community of colleagues to engage with.", "cons": "Ambitious development initiatives in short turn around times."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Marketing and Communications Associate Manager", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 May 2021", "job_title": "Marketing and Communications Associate Manager in The Hague", "duration": "N/A", "pros": "Job security, organization's financial stability", "cons": "Siloed organisation, rigid hierarchy, loose processes"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Wasted Opportunity(ies)", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Jun 2016", "job_title": "Senior Global Role in The Hague", "duration": "N/A", "pros": "International atmosphere... The mission is truly attractive and there is an opportunity to truly see the world with the IB.\r\nNice people to work with along with very nice and comfortable settings.", "cons": "Poor leadership! The Senior Leadership Team has not shown the willingness to act upon clear issues that have been factually laid out in front of them at several times.\r\nKissing up to the boss will get you much further than actually doing your job and placing the best interest of the IB first; so if you're the very political type, you should just identify the people that you need to kiss up to and you'll be fine. \r\nThe IB has an educational business but at the end of the day, it is a business, so decisions need to be made by people who actually understand the business/financial implications of the decisions they make. Educational people are not business people, as much as they want to believe that they are.\r\nAs a responsible and engaged employee, it's tough to see all the money and resources wasted with very little accountability and consequences, pointing it out leads to being labelled a negative person."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Promises much; delivers little", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Jun 2019", "job_title": "Learning and Development Manager in The Hague", "duration": "N/A", "pros": "The international culture, relocation package, mission and vision brought to life in schools across the world", "cons": "If IB students are looking for a future career somewhere that models the values of their education, they should keep on looking - because sadly they will not find the Learner Profile or spirit of inquiry living and breathing in the culture of the IB. Creative talented people are drawn in by the powerful (and externally visible) mission and vision only to find the day to day processes and senior leadership so uninspiring they either leave or stay and accept defeat. I am truly saddened that such an organisation cannot - and will not - recognise its shortcomings or take action (in true IB style) to practice what it preaches. A waste of talent, energy, time and worst of all - as a not for profit - money that it should be ploughing back into its products and services for schools around the world."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Management out of touch with employees", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Nov 2018", "job_title": " in The Hague", "duration": "N/A", "pros": "Most of the people working at the IB are dedicated to the mission and are generally friendly and nice to get along with.  It's a nice place to get to know people in and outside of office hours.", "cons": "Management seems to be very out of touch with their employees. They only seem to see the bright side of everything, and they keep restructuring the organization, which ultimately leads to people losing their job or people quitting out of dissatisfaction. People often do not feel at liberty to speak up and voice their honest opinion, because in the end no real changes will be made to improve things."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "No vision and internal chaos", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Jun 2015", "job_title": "Anonymous Employee in The Hague", "duration": "N/A", "pros": "Strong brand, inspiring curriculum. Overall nice peer colleagues, beautiful offices, multicultural, travel.", "cons": "Weak Senior Leadership Team with no vision but \"grow the mission\". More money than quality driven. Poor services to authorized schools and to educators/examiners. Employees have to operate in a highly political, bureaucratic and utterly complex environment with disconnected not-fit-for-purpose systems. High pressure on dedicated people who tend to be abused, burned out and let go. Inferior support departments. No talent management, internal promotion is not encouraged."}], [{"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Toxic", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Sept 2016", "job_title": " in The Hague", "duration": "N/A", "pros": "Supporting the mission. Meeting committed IB educators. Some travel.", "cons": "Hierarchy, with many people in senior positions completely out of their depth. Still too many systems, despite years of fixing the problems! \r\nLack of respect for middle leaders and if you are not aggressive or negative, you become a target. Some very strange promotions to incompetent and bullying people. Some eventually were found out and dismissed. Others are still there. Siva has done a great job sorting some things out, despite her appointment in charge of leading the schools division who is manipulative and clueless."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "An organization with a powerful Mission that is changing itself for the better.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Oct 2015", "job_title": "Anonymous Employee in The Hague", "duration": "N/A", "pros": "I've been at the IB for a year and a half. The IB has a high standing in the educational world. In the past, I believe that was combined with a slightly bureaucratic, stand-offish, status-conscious way of doing things, but that's definitely changing. Professionally, my experience so far has been rewarding. I think I can help improve things here in terms of bringing in an outside perspective - and I can honestly say that I have been challenged (and never bored) here.\r\n\r\nThe IB has an overriding Mission - \"Education for a better world\": everything the organization does is aimed to that end. This sounds simple, but the IB is not a simple organization, with a sometimes confusing complexity in its working structures. This is something the management is acting on, and there is a refreshing hunger for change in the organization.\r\n\r\nFor the most part, colleagues are open, friendly, hard-working and intelligent. Working conditions and benefits (overall) are good. It is a well-designed office in a good part of town - quiet, international, with good shopping nearby.\r\n\r\nThe new DG, Dr Siva Kumari, who joined shortly before I did, works hard to make it less hierarchical and process-driven. The leadership team supporting her are fairly new to their jobs. New, senior IT people are improving the infrastructure.\r\n\r\nAll in all, it's a time of change, with all the reactions you'd expect, internally and externally.\r\n\r\nThe main criticism is that salaries seem quite low - HR have an unshakeable grip on this and on job development - this may also be changing, because otherwise there'd be a problem to attract and retain the best.\r\n\r\nOverall, I rate the IB highly as an employer with great colleagues, a strong and visionary DG, and a sense that they are looking for good, effective people who care about education and making a difference to the world.", "cons": "Salaries seem slightly below average given the location and the sector.\r\n\r\nReward and remuneration may be worth looking at to make sure the IB can recruit and retain the best people."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Associate manager", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Jun 2016", "job_title": "Associate Manager in The Hague", "duration": "N/A", "pros": "Mission, international environment, great work space, travel opportunities, contributing to provide better opportunities to young people to get a better future", "cons": "Too many changes. Structures and systems are not given the opportunity to settle down before new structures and systems are implemented."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great organization with an amazing mission", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Apr 2016", "job_title": "Head of Architecture in The Hague", "duration": "N/A", "pros": "The best reason to work for the IB is the mission of the IB to create a better world through education. To be a part of that is actually a great honor! Furthermore I have the privilege to work with a group of highly educated, motivated and nice bunch of people.", "cons": "I seriously cannot find a con."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Disappointing", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Nov 2016", "job_title": "Back Office Support in The Hague", "duration": "N/A", "pros": "Some great colleagues. Some good professionals. A very interesting mission. A glorious past.", "cons": "Very old fashion management style and a toxic organisational culture, almost no opportunity for professional and personal growth, slow decision making and no recognition. Complaining is proven useless, trying to change gets you into trouble. If you need a temporary job while looking for something better, this is just fine. Otherwise, do not waste your time."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Been too long, time to go", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "26 Jun 2015", "job_title": "Academic Division in The Hague", "duration": "N/A", "pros": "An initial feeling that you can make a difference to the lives of students", "cons": "Focus has switched from creating the best teaching and learning programmes to making money.\r\nAmateurish approach to business - SLT are clueless.\r\nNo opportunities for advancement - keep on employing incompetence into leadership roles"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great mission, strategy and serious planning", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "11 Aug 2018", "job_title": "Team Leader in Haag", "duration": "N/A", "pros": "Benefits are outstanding for an NFP. People return.", "cons": "Global meetings are really hard - especially between Bethesda and Singapore."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Good people, good work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Dec 2014", "job_title": "Administrator in The Hague", "duration": "N/A", "pros": "Dedicated staff, friendly environment, mission-oriented work, flexible time, travel, good professional development", "cons": "Company still in some disarray after restructuring 3 years ago, not a lot of room for upward movement, HR not helpful"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Excellent career and Development Opportunities", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "31 Mar 2014", "job_title": "Associate in The Hague", "duration": "N/A", "pros": "The IB has given me opportunities to work for a mission driven organisation on an international scale.  I have been able to really develop myself professionally, especially through the multitude of learning and development opportunities that I have completed.", "cons": "There are no cons that I really have at the moment.  It has been a great experience."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Challenging", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Aug 2019", "job_title": "Schools Administration in The Hague", "duration": "N/A", "pros": "Excellent colleagues, great networking, enjoyed it.", "cons": "Poor senior leadership team. Lack of transparency."}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Translation project coordinator", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Aug 2012", "job_title": "Translation Project Coordinator in Tampa, FL", "duration": "N/A", "pros": "Values, global organization, offices worlwide", "cons": "Salary, management, rewarding, social advantages"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "How it is", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "25 Apr 2016", "job_title": "Program Manager in The Hague", "duration": "N/A", "pros": "There are many travel opportunities", "cons": "Thre is a lot of poor admin"}]]