[[{"date": "1 Jul 2023", "title": "Clinical Trial Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Royal Marsden NHS Foundation Trust (London, England)", "Interview Descriptions": "A short presentation between 8 and 10 minutes was required and had to address running CTIMP trials and the challenges of doing so. This was then followed by role related technical questions. The Panel were welcoming and friendly.", "Interview Questions": "Pharmacovigilence, Trial commitees, trial managment, presenting, liasing with sites etc."}, {"date": "30 Nov 2021", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Royal Marsden NHS Foundation Trust in Nov 2021", "Interview Descriptions": "I applied online, and then received an  invite to a remote interview.\nAlthough the interviewers were nice, I felt as if the interview was rushed. I have attended lots of NHS interviews, which normally last 20-45 mins. This was over within 10-15. I felt like they already had a candidate lined up. After my interview I was told I would hear back by the end of the week. They did not get back to me by the end of the week, so I waited for Monday. Still no word from them, so I decided to chase them up via email. Two days later, they still hadn't responded to my email. I then called for an update to be told I need to email them (even though I already did that.) Anyway, I emailed again, and they finally told me I hadn't been successful. I studied for about 2 weeks for this interview, and I really wanted the job. In hindsight, I am glad I didn't get the job as the lack of professionalism in them getting back to me is quite telling of their character.  They also would not supply any feedback which I think is unfair, and hinders us job seekers. Overall did not enjoy the interview process and would not apply again in the future.", "Interview Questions": "Why the Royal Marsden?\nWhere do you think you will struggle?\n"}, {"date": "11 Jun 2021", "title": "Clinical Trials Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Royal Marsden NHS Foundation Trust", "Interview Descriptions": "Very smooth process. Interviewers made me feel very comfortable and were warm and welcoming. My interview was carried out on teams due to covid. There were two interviewers who both asked questions. There was a pre-interview task of filling in a form using doctors notes that they are looking for accuracy on.", "Interview Questions": "How did you prepare for the interview \nWhat would you find most difficult about the role\nWhat do you understand about clinical trials\nTalk through your work experience in the last 3 years \nWhat is GCP (good clinical practice) "}, {"date": "9 Nov 2021", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Royal Marsden NHS Foundation Trust (London, England) in Apr 2021", "Interview Descriptions": "Organized, clear instructions, very simple and considerate to my needs.\nTake time to consider oncology as a  career. Study the area and the skills required. Despite being a zoom interview it went very smooth, ensure you have practiced and rehearsed.", "Interview Questions": "Tell me about your understanding of oncology?"}, {"date": "11 Jan 2021", "title": "Healthcare Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Royal Marsden NHS Foundation Trust", "Interview Descriptions": "The interviewers were very friendly, had to do video interview because of COVID.\r\n8 questions in total. \r\nI prepared with the NHS interview questions on Google and YouTube, and the NMC code and it helped a lot.", "Interview Questions": "Tell me about yourself and why did you apply for this position?"}, {"date": "1 Dec 2021", "title": "MLA Band III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Royal Marsden NHS Foundation Trust (London, England) in Oct 2020", "Interview Descriptions": "Online interview, 2 people interviewed me, introduced themselves and asked me to introduce myself. Very pleasant experience. It was Via zoom, the link was sent by email need to click and activate, make sure the webcam is turned on.", "Interview Questions": "What is your primary goal ?\r\nWhat did you choose this job role?\r\nWhat do you hope to do in 5 years, what is you ambition?\r\nWhy did you choose royal Marsden?\r\nTell us about your previous experience "}, {"date": "14 Feb 2022", "title": "Clinical Trial Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Royal Marsden NHS Foundation Trust (London, England) in Dec 2019", "Interview Descriptions": "Make sure you know about the phases of a clinical trial. they are very friendly and nice. They don't really expect you to have a lot f experience, just be willing and eager to learn", "Interview Questions": "What are the phases of a clinical trial?\r\nTell us about yourself?\r\nTell us about conflict at work?"}, {"date": "13 Nov 2020", "title": "Medical PA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Royal Marsden NHS Foundation Trust (London, England) in Jul 2019", "Interview Descriptions": "Online Assessment with written answers of no word limit. The interviewer's most prominent concern was how many words per minute I could type since there is always a backlog of clinic letters to type across all the departments. The Interview took place in a room with your \"would be\" supervisor.", "Interview Questions": "Why do you think you're good for this role"}, {"date": "27 Apr 2020", "title": "Undergraduate Engineering Placement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Royal Marsden NHS Foundation Trust (Sutton, London, England) in Apr 2019", "Interview Descriptions": "Very Informal, Nice questions were asked- about sustainability, why the royal marsden - pretty standard questions, interviewed by energy manager and estates manager, welcoming friendly , asked about sustainability within the hospital.", "Interview Questions": "What type of energy saving measures would implement in this room."}, {"date": "1 Jul 2018", "title": "Clinical Trials Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Royal Marsden NHS Foundation Trust (Wallington, South East England, England) in Jun 2018", "Interview Descriptions": "Very fast- interview and assessment lasted about an hour. Interview panel friendly, atmosphere was relaxed. I was offered the job about 2 hours later. HR sent conditional offer email the following day and pre-employment docs", "Interview Questions": "What do you understand about clinical trials? What is GCP and what is your opinion of it? Walk me through your experience over the last two years. What are your long term career goals?"}], [{"date": "23 May 2018", "title": "Healthcare Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Royal Marsden NHS Foundation Trust (London, England) in May 2018", "Interview Descriptions": "There were  Maths and English assessment prior interviews.  The questions were relatively easy - level 1/2  functional skills. There was also clinically related questions such as calculating NEWS based on a small case study.  Afterwards, the panel will decide whether if the person is successful. The interviews are with two professionals, it may be nurses (ward based). Both will ask you questions in turns.", "Interview Questions": "From the 6c's, select two and state why."}, {"date": "20 Sept 2018", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at The Royal Marsden NHS Foundation Trust (London, England) in Mar 2018", "Interview Descriptions": "Dismal.  Irrelevant questions about a job I have never done and for which I was not applying.  They did not even have my CV to hand so that they could tailor their questions appropriately.  Plainly they had not even bothered to read it.  Exceptional at wasting time whilst drowning in clichés and platitudes which is their deluded idea of good practice.", "Interview Questions": "Grilled me about the pitfalls of being a ward clerk.  NB: I have never worked as a ward clerk, I was not applying for a role as a ward clerk and I have no ambition to work as a ward clerk."}, {"date": "13 Dec 2017", "title": "Programmer Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Royal Marsden NHS Foundation Trust in Oct 2017", "Interview Descriptions": "In summary, it was an easy and very well managed process. Quick process with shortlisting and interview arranged within a week of role closing. A single interview with a panel of 3, covering presentation and competence-based questions.", "Interview Questions": "Dealing with conflict"}, {"date": "23 Apr 2018", "title": "Clinical Trial Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Royal Marsden NHS Foundation Trust (Sutton, London, England) in Jul 2017", "Interview Descriptions": "Felt quite relaxed, not very intimidating. Questions were mainly asking about experience and how to handle certain situations such as how would you get hold of a consultant when they are hardly at their desk.", "Interview Questions": "Knowledge of human tissue act"}, {"date": "7 May 2017", "title": "Healthcare Science Practitioner Trainee In Nuclear Medicine Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Royal Marsden NHS Foundation Trust", "Interview Descriptions": "Four people gathered opposite to me (the candidate), one of the male members on the panel was intimidating and was somewhat impatient. He felt the need to answer the given question if not answered to his expectation. Before answering he stated he was the Professor of something (I can't recall) anyhow another panel member spoke out on my behalf and said the candidate did explain.", "Interview Questions": "What do you want out of it? The question the my the guy was What do you understand by the term radiopharmaceuticals? "}, {"date": "26 Feb 2017", "title": "Laboratory Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Royal Marsden NHS Foundation Trust (Sutton, London, England) in Jan 2017", "Interview Descriptions": "The interview was one hour however, the interviewers kept on talking and didn't ask many questions.  They kept on repeating the same things and doubted even when I said yes. They were more interrogating then conversational.", "Interview Questions": "A molar calculation question"}, {"date": "23 Oct 2016", "title": "Clinical Trials Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Royal Marsden NHS Foundation Trust in Oct 2016", "Interview Descriptions": "1 interview\n\n3 senior clinical trials coordinator\n\nLasted 20mins\n\nComfortable setting \n\nQuestions were based primarily on my prior experience and my knowledge of clinical trials\n\nVery calm and relaxing vibe. Ice breaker question to end the interview.\n\nWhat super power did you wish you have?\n\nI said flight to avoid traffic.", "Interview Questions": "What is GCP and how do we implement it"}, {"date": "8 Dec 2017", "title": "CBU Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Royal Marsden NHS Foundation Trust (London, England) in Apr 2015", "Interview Descriptions": "We had an informal discussion prior to the interview. The interview format was a presentation I  prepared in advance, a basic Q&A of the presentation and then formal interview questions", "Interview Questions": "What would you do if you had a patient that was due to be transferred to a different hospital, due to change in management, that recently suffered a hip fracture?"}, {"date": "16 Nov 2015", "title": "Work Experience Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at The Royal Marsden NHS Foundation Trust in Aug 2014", "Interview Descriptions": "I sent my CV and Cover Letter to an email address that I was given by a family friend. The contact then requested to interview me via phone to make sure that I was suitable to work at RMH and that the jobs I would be doing would be suited to me", "Interview Questions": "Why would you like to work at RMH?"}]]