[[{"date": "24 Apr 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bay Cove Human Services", "Interview Descriptions": "Contacted by HR partner to set up a time to chat. Got through some rounds (3-4 quickly) before they made an offer. Communicated timing expectations clearly, although they did take some time between rounds.", "Interview Questions": "How do you work under pressure?"}, {"date": "27 Jan 2023", "title": "Day Habilitation Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bay Cove Human Services", "Interview Descriptions": "this was very easy, talked about previous experiences and work oriented questions about organization and skills! the woman was very nice and it was over zoom, never had to do a secondary interview.", "Interview Questions": "do you have any direct care experience with adults with disabilities"}, {"date": "15 Aug 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bay Cove Human Services (Boston, MA) in Apr 2021", "Interview Descriptions": "Initial interview was by phone, which was understandable as both a screening tool and as pandemically responsible practice. Interviewer was well prepared, new the subject thoroughly, and had an inviting, pofessional phone manner.", "Interview Questions": "Why did I seek this position?"}, {"date": "24 Dec 2020", "title": "Direct Support Professional Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bay Cove Human Services", "Interview Descriptions": "Was called by a recruiter, then hiring package was sent to a manager who then contacted me and schedule for an interview. Went through my resume, then work experience and what I understand the organization does.", "Interview Questions": "What are your thoughts about the company?"}, {"date": "11 Aug 2020", "title": "Substance Abuse Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Bay Cove Human Services", "Interview Descriptions": "Applied online, was call within a few weeks and offered interview w/ two clinicians. Had a follow-up interview w/ two more clinicians. They were very friendly. Was offered the job a week after the second interview. I was told they wanted to start clinicians soon, so I'm not sure this is typical.", "Interview Questions": "What is your experience with (clinical) groups? "}, {"date": "16 May 2022", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bay Cove Human Services (Boston, MA) in Feb 2020", "Interview Descriptions": "The interview process was fairly straightforward and easy. Involved a zoom interview followed by an in person interview. Met with two people. Basically asked the same questions. There was not any trick", "Interview Questions": "What are your biggest strengths "}, {"date": "20 Mar 2023", "title": "Direct Care Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bay Cove Human Services in May 2019", "Interview Descriptions": "Quick and easy. The only thing I didn't like is that I didn't get to meet the person who was going to be my supervisor until after I was hired.", "Interview Questions": "What kind of supervision works best for you?"}, {"date": "5 Jun 2022", "title": "Help Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Bay Cove Human Services (Boston, MA) in Jul 2018", "Interview Descriptions": "Took about three weeks. HR and management were very descriptive and informative about role.  In the interview process they gave me a beautiful tour of the site. I met with all relevant company employees and management.", "Interview Questions": "Tell me about a difficult situation as help desk representative?"}, {"date": "8 Nov 2017", "title": "Administrative/Clerical Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bay Cove Human Services (Boston, MA)", "Interview Descriptions": "I applied online. It took approximately a month before hearing back from the agency. The hiring and screening process on the administrative side normally takes this long due to changes to the department and staff turnover. \r\n\r\nI was contacted directly by the hiring manager and all further contact was through the hiring manager.", "Interview Questions": "Interview was focused around experience working in the mental health field and knowledge/ skills around working with the population. "}, {"date": "2 Nov 2017", "title": "Group Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bay Cove Human Services (Boston, MA)", "Interview Descriptions": "I submitted an application for this position via Indeed. They reached out to me promptly to set up an interview. The interview was with a program director, who was professional and passionate about both the company and the specific program. Very informative interview and hoping I get the opportunity to return for an additional interview.", "Interview Questions": "What made you want to become a social worker?"}], [{"date": "30 Apr 2021", "title": "Activities Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bay Cove Human Services (Boston, MA) in Oct 2017", "Interview Descriptions": "First interview was with my soon to be immediate supervisor. The second interview was with the team that I would be working with/supervising. It was mainly a conversation about the programs that I would be working with and a few questions about my skills, background, and philosophies.", "Interview Questions": "How do you engage individuals who don't want to be engaged in the activities?"}, {"date": "23 Jan 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Bay Cove Human Services (Boston, MA) in Sept 2017", "Interview Descriptions": "Sat with three supervisors in a conference room. They asked me about my resume and what I was hoping to gain out of the experience. They explained what student interns typically do at Bay Cove.", "Interview Questions": "Tell us about yourself."}, {"date": "9 Jul 2017", "title": "Career Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bay Cove Human Services", "Interview Descriptions": "Laid back, honest conversation, honest presentation of the job and its perks/challenges. All of my questions were answered in an honest and genuine manner. The individuals who interviewed me are no longer at BayCove - they have been gone for years - but both were great managers who I enjoyed working with. I had one phone interview and one in person before being offered the job.", "Interview Questions": "There were a lot of scenario questions, which helped form an idea of the job ahead."}, {"date": "12 Feb 2018", "title": "Relief Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Bay Cove Human Services (Boston, MA) in Jul 2017", "Interview Descriptions": "Not really difficult. They will ask you why you want to enter the field, what is your experience . Then they will tell you what they can offer you and what the pay rate will be. Regardless of experience. They will tell you training dates and thats it . Easy hire.", "Interview Questions": "Why do you want to work with underserve population ( mental health or disability) "}, {"date": "17 Mar 2017", "title": "Clinical Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bay Cove Human Services", "Interview Descriptions": "Wonderful interview pleasant he department .accessible via mbta. Thank you for the opportunity to interview for that position. Pay rate could be much higher. Where as minimum wage is 11.00. Benefits are mediocre and could also be better.", "Interview Questions": "Experience"}, {"date": "15 Apr 2016", "title": "Vice President of Technology Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bay Cove Human Services", "Interview Descriptions": "Someone called and left a message to call back. I called back and heard a voice mail with instructions to leave a message. I did. Twice. Nobody called back after 3 weeks. Companies who do this to candidates don't deserve good employees. This is a ploy by HR personnel jockeys to justify their salaries - why call someone you're interested in, request that they call back, then ignore them? Do you really think qualified, experienced candidates will not report on this disrespectful behavior?\r\n\r\nAdvice: look elsewhere.", "Interview Questions": "N/A"}, {"date": "28 Apr 2016", "title": "Relief Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Bay Cove Human Services (Cambridge, MA) in Feb 2016", "Interview Descriptions": "It was fair and easy as long as you know what your talking about and if you have experience, also they look for people with passion for human services field", "Interview Questions": "What would you do in a high stress situation"}, {"date": "17 May 2016", "title": "Mental Health Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Bay Cove Human Services (Boston, MA) in Jun 2015", "Interview Descriptions": "I interviewed here originally for an internship, and when that was completed, I was hired per diem without a second interview, so the questions below are for the internship interview. Essentially, this was just a formality because my supervisor knew my internship coordinator, and the internship was given to me based on that relationship. I'm sure if I really did poorly, I would not have been offered the position, but I would have had to try to fail. I don't know how stringent their \"real\" interviewing process is, but given that they'll hire MHWs with no college degree it's worth a shot, especially if you're new to the mental health/social work field.", "Interview Questions": "Why do you want to work here? "}, {"date": "20 Jul 2015", "title": "Rehabilitation Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Bay Cove Human Services in Jun 2015", "Interview Descriptions": "Friendly interview. Asked standard questions related to the field. My interviewer was able to further elaborate on the process very well. Bay Cove Human Services was prompt about setting up an interview and calling with results of the interview. Found Bay Cove Human Services were eager to hear about my training and how I could add my unique skills to their company.", "Interview Questions": "What mental health experience do you have? Why do you want to work here? Required skills test/Formulate a treatment plan for mock client."}, {"date": "22 Oct 2015", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bay Cove Human Services (Boston, MA) in Jan 2012", "Interview Descriptions": "Lengthy process they were thorough of whom they hired. The reference  checks were done and cori background checks as well as driving record. I liked the fact that they required such thoroughness and i liked the fact i got the chance to meet the clients  before hand and i also got the chance to ask my own questions", "Interview Questions": "Why do i want to work here"}]]