[[{"date": "3 Jul 2023", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Queen's University (Kingston, ON)", "Interview Descriptions": "The interview process consisted of an initial meeting, followed by two behavioural interviews. Second interview involved answering two different scenario-based questions within a short time limit (I believe 15 minutes in total). The interviewers were all prompt, kind, respectful, and communicative throughout the whole process.", "Interview Questions": "Tell us more about your experience and how it translates to this position."}, {"date": "17 Jun 2023", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Queen's University", "Interview Descriptions": "Emailed and met with professor. Asked basic questions to gauge interest and understanding of background knowledge surrounding the research. Overall a pleasant experience, however your mileage will vary based on the professor you will be working with / interviewing with.", "Interview Questions": "What interested you about this research area?"}, {"date": "9 May 2023", "title": "Event Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Queen's University", "Interview Descriptions": "It was smooth. Got the questions 15 mins before the interview. There were three Interviewers and they were nice and explained the structure and role well. They was a lot of complex questions with different parts.", "Interview Questions": "What is it about this position that interests you and why do you believe you are a strong candidate?"}, {"date": "18 Mar 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Queen's University", "Interview Descriptions": "No interview, but you need to submit a application at OUAC Good luck for your future studies at Queen's University If you want to be a da/ba, please choose to computing science program or commerce(smith) program Best Wish", "Interview Questions": "No interview during Winter 2020."}, {"date": "26 Jan 2023", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Queen's University", "Interview Descriptions": "Very thorough and genuine, at each step of the way it felt as though they truly tried to get a good judge of character. It involved in person, remote and written interviews", "Interview Questions": "How do you think you'll make an impact?"}, {"date": "10 Mar 2023", "title": "Organizational Development Consultant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Queen's University (Kingston, ON) in Jan 2023", "Interview Descriptions": "Good process, didn't ask for salary range at the front end, range ended up being half of the market rate. Had a panel interview right away, then a call with HR, then confirmed salary.", "Interview Questions": "What process do you use for change management engagements?"}, {"date": "11 Oct 2022", "title": "Course Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Queen's University", "Interview Descriptions": "There was three interviewers, two course developers and  one media producer. They each asked one or two questions. The interview went well, very nice people. thirty word limit has been reached", "Interview Questions": "What is a challenge you have overcome?"}, {"date": "7 May 2022", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Queen's University", "Interview Descriptions": "3 people aside from me in the interview. Asked basic questions, none too technical, and the leading professor  explained the role. Explained the purpose of the research and why they need a research technician. They were friendly for most part.", "Interview Questions": "Tell us about yourself?\r\nWhy are you interested in research?\r\nWhat are your weaknesses? (This question the lady didn't want basic answers like I work too hard)\r\nHow can you multitask?\r\nWhat can you do to succeed with patient recruitment requirements?\r\nWhat are the first things you'll do when you come to work? Because the role requires you to be able to work independently"}, {"date": "3 Mar 2022", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Queen's University", "Interview Descriptions": "I met with the leading research professor to discuss the research opportunities and then filled out an application for the specific role (i.e. resume, cover letter, etc.) and submitted it formally through the portal", "Interview Questions": "What are your research interests"}, {"date": "5 Sept 2022", "title": "Facilities Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Queen's University (Kingston, ON) in Jan 2022", "Interview Descriptions": "the interview process was short to medium, I was comfortable and I enjoyed being there the hiring manager was friendly and had a great personally it was a lovely experience", "Interview Questions": "tell me about yourself\r\nHow do you handle conflict with colleagues\r\nHow do you describe yourself "}], [{"date": "26 Aug 2021", "title": "Student Support Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Queen's University (Kingston, ON) in Jun 2021", "Interview Descriptions": "The interview process was pretty straightforward, it consists of uploading the cover letter, resume and 1-panel interview (program director, marketing manager and program manager). The decision process was also quick, I received the feedback after a week from the interview.", "Interview Questions": "1. Why are you interested in this role?\n2. Tell me about yourself\n3. Tell me a situation that you are able to work independently and in team\n4. What are your strengths and weaknesses "}, {"date": "7 Nov 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Queen's University in Jun 2021", "Interview Descriptions": "Telephone over the phone with recruiter. Questions weren't that difficult but the overall experience was a waste of time because they clearly did not read my resume. Interviewer sounded bored and was clearly reading from their sheet. They want someone to do a million jobs but only want a dollar over minimum wage. Considering how high their tuition is and the amount of money they get from alumni, that's a bit absurd . I probably dodged a bullet by not getting an offer", "Interview Questions": "How do you prioritise your time"}, {"date": "3 Feb 2023", "title": "Master´s Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Queen's University (Kingston, ON) in Apr 2021", "Interview Descriptions": "It was so nice. Professor tried to understand my background, my passion and my motivation. After that we meet at the middle point because of my background and discuss for future project.", "Interview Questions": "They asked the project that i completed for my bachelor"}, {"date": "23 Feb 2021", "title": "Data Entry Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Queen's University", "Interview Descriptions": "Very basic questions, and friendly staff. It was very quick because the role was temporary and extra help was only needed for a few months until we worked our way through digitizing all of the paper files they had stored up.", "Interview Questions": "Why do you want this job?"}, {"date": "22 Oct 2020", "title": "Technical Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Queen's University", "Interview Descriptions": "The interview process was very straightforward: I applied through the website and had 1 online interview with the program managers. Questions are very easy, and I heard back from them soon after the interview.", "Interview Questions": "What was your experience with Zoom"}, {"date": "22 Sept 2020", "title": "Director of Marketing, Faculty of Law Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Queen's University in Aug 2020", "Interview Descriptions": "First interview was a friendly phone call about my experience and the role. Second interview was 2 hours long and I had to research and prepare a 15-min presentation to deliver during the interview. The topic for the presentation was not related to any of the requirements stated in the job description which was weird. The interview questions were very long--each question had a 4-part to it.\r\n\r\nIt was a panel with 5 people on Zoom, each asked 2 questions (each questions had 4 parts to it). It was more like an interrogation than an interview, not a very friendly bunch. Not a lot of time to ask questions at the end. The worse part was getting ghosted. They said they would follow up in a week. A month went by and still haven't head back despite following up after 2 weeks, my emails were always ignored. Overall they were are very disrespectful to the candidates.", "Interview Questions": "Describe something that one of your direct reports did that surprised you, or was unusual, but that it had a positive impact. What was it, how did it impact the business, what were the results. Explain in detail what was done."}, {"date": "19 Jul 2021", "title": "Finance Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Queen's University (Kingston, ON) in Aug 2020", "Interview Descriptions": "virtual interview, tow people, one manager, one accounting clerk, asked about 10 or so questions, nice people, casual environment, some questions are general and some are related to accounting and finance, based on the resume info", "Interview Questions": "tell us something about yourself"}, {"date": "7 Aug 2020", "title": "Peer Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Queen's University in Mar 2020", "Interview Descriptions": "I had an online interview with two of the coordinators. They asked me about 10 behaviour questions. It was a one-round interview. Overall it was a good experience and I received an offer two weeks after.", "Interview Questions": "Tell me about yourself, please."}, {"date": "20 Feb 2020", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Queen's University (Kingston, ON) in Feb 2020", "Interview Descriptions": "Interviewed by a panel of five. They were professional and friendly and took it in turns to ask questions. The questions were mostly in parts but they repeated them after each part which was helpful. They followed up the next day asking for three professional references.", "Interview Questions": "Working in a fast paced environment "}, {"date": "8 Jun 2021", "title": "Executive Education Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Queen's University (Toronto, ON) in Feb 2020", "Interview Descriptions": "Phone interview with hiring manager. Initial interview was about 30-45 minutes and five questions. They wanted to know that you had given some thought to how to develop business opportunities for their executive program and wanted to understand the sales process. Looks like they wanted to hire someone who was Toronto based as that is where they thought that most of the clients would come from", "Interview Questions": "What did I know about the executive education program and what challenges I thought they might face "}], [{"date": "10 Jan 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Queen's University", "Interview Descriptions": "Brief 30 minute meeting with professor discussing past studies in the relevant field and experience. Fairly informal and not a traditional structured interview. Quick turnaround time in terms of hearing back on candidacy.", "Interview Questions": "Why do you want to be a research assistant"}, {"date": "12 Jul 2021", "title": "Facilitator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Queen's University (Vancouver, BC) in Jan 2020", "Interview Descriptions": "It was a good experience overall and I learned a great deal of interview questions and types from it. I think it will be quite helpful to me in the future interviews.", "Interview Questions": "Why do you want this position?"}, {"date": "10 Nov 2019", "title": "Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Queen's University", "Interview Descriptions": "Four of the managers interviewed me. They asked only situational and behavioral questions. They did not provide any information regarding the job or company, and also they didn't ask any questions about my past experiences or educational background. It was a pretty difficult interview.", "Interview Questions": "Tell us about a time you made a mistake? "}, {"date": "23 Jun 2023", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Queen's University (Kingston, ON) in Jul 2019", "Interview Descriptions": "1 interview, met with the PI and we talked about the research objectives of the lab and how my experience was aligned with them. After the interview, the PI contacted my prof and asked for his feedback on my performance.", "Interview Questions": "How much experience do you have with optimizing procedures?"}, {"date": "1 Apr 2019", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Queen's University", "Interview Descriptions": "Need to fill a questionnaire, very simple questions. Duties were assigned based on this questionnaire. No interview if you are a grad student. They provided training before you start your job.", "Interview Questions": "N/A"}, {"date": "25 Feb 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Queen's University", "Interview Descriptions": "1 hour over skype interview only with the supervisor. Friendly environment and room to explain your experience and hear back about the project and prospective tasks. I also had the chance to ask about the work and benefit details.", "Interview Questions": "What  was your main duties during PhD?"}, {"date": "27 Jan 2019", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Queen's University", "Interview Descriptions": "The interview process took about a month - I applied online and received an interview in about 3 weeks. The interview itself was very laid back, and the panel was very friendly.", "Interview Questions": "How do you work under pressure\r\nWhy do you want to work here \r\nWhat makes you the right fit for this position \r\nTell me about yourself\r\nTell me about a time.... "}, {"date": "5 Aug 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Queen's University in Jan 2019", "Interview Descriptions": "Phone interview followed by two in person interviews. Was treated with dignity throughout, was given an excellent opportunity to describe my experiences. When I wasn't offered the position, I was given specific and helpful feedback.", "Interview Questions": "Very job specific questions that were clearly directly tied to the job posting. Asked great questions about my best and most difficult supervisor in the past. Very behaviour based interview. "}, {"date": "10 Nov 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Queen's University", "Interview Descriptions": "Got the interview after emailing the professor who had posted the job on the university's internal portal. Went to his office after emailing him that I would want to meet him in person to express my interest.", "Interview Questions": "All the questions that I was asked were very basic in nature. Why do you want this job? What interests you? Why are you a good fit for this role? It was more like a conversation than being an interview"}, {"date": "8 Nov 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Queen's University", "Interview Descriptions": "A referral from another professor followed by a resume screening and finally a Skype call with the future supervisor in which I was asked about specific research topics and scientific research skills and experience. The call lasted for an hour.", "Interview Questions": "Could you introduce one of your previous research publications?"}], [{"date": "8 Sept 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Queen's University (Kingston, ON) in Aug 2018", "Interview Descriptions": "It was a panel interview with four people where they took turns asking questions. It was a friendly environment, and I was never rushed to answer, and they responded to my questions in depth. They asked a lot of follow-up questions while everyone took notes. It was intimidating at first to have four people interviewing you, but they let you do most of the talking, so I felt like I controlled how the interview was going.", "Interview Questions": "Give an example of a project in which you needed to be detail-oriented."}, {"date": "20 Dec 2021", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Queen's University (King, ON) in Jun 2018", "Interview Descriptions": "It was via zoom and very straight forward. I was interviewed by two of the team members and it was the only interview I had. They were hiring for the front desk and asked me general customer service experience questions and about my retail experience.", "Interview Questions": "Describe your customer service experience? and do you have experience with working at a front desk?"}, {"date": "22 Nov 2022", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Queen's University (Kingston, ON) in Apr 2018", "Interview Descriptions": "Quite simple with typical questions. Prepare to have an answer to scenarios with basic fact basis and how you would respond to those facts. Overall, the interview process is not too complex.", "Interview Questions": "How have you assisted a client in a difficult situation?"}, {"date": "11 Oct 2018", "title": "Research Scientist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Queen's University (Halifax, NS) in Apr 2018", "Interview Descriptions": "They did the preliminary screening via Telephone after submitting my application. After one week, they started the second interview one on one. It was almost 30 mins about my ability, quality and capability  if I got an offer letter.", "Interview Questions": "About me in 90 sec"}, {"date": "20 Feb 2018", "title": "Summer Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Queen's University", "Interview Descriptions": "One student to multiple interviewers each asking standard situational based questions. I was also provided one question prior to the interview in which I was able to prepare a formal response.", "Interview Questions": "Give an example of a time you have experiences conflict in the workplace and how you handled it."}, {"date": "16 Oct 2019", "title": "Co-Director, Eco Adventure Camp Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Queen's University (Kingston, ON) in Feb 2018", "Interview Descriptions": "-Submit an application online through mycareer portal and should hear back within 1-2 weeks\r\n- The interview is two on one informal mainly personality testing \r\n- not meant to be stressful tests a little bit of first aid safety\r\n-  Lifeguarding is useful but not required\r\n- be prepared to talk about your experiences teaching/working with young children", "Interview Questions": "A time when you have shown leadership?\r\nCreate an activity to teach the campers?\r\nWhat would you do in an emergency situation?"}, {"date": "5 Jan 2018", "title": "Microscopist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Queen's University (Kingston, ON)", "Interview Descriptions": "questions about my work. Relax but specific and detail answers were expected. Six people conducted the interview because it was very important that everybody I will have contact with had an opinion of my. I got the impresion that knolodge was as important as personality", "Interview Questions": "About my knolodge and ipotetic  situations... how I will react and solve the problem"}, {"date": "22 Sept 2020", "title": "Master's Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Queen's University (Toronto, ON) in Jan 2018", "Interview Descriptions": "Performed a virtual interview where they asked about research interests and previous coursework. The supervisor also asked what the interviewee was looking for in a potential supervisor. The supervisor was then met  in person approximately 3 months later.", "Interview Questions": "Why are you interested in this program?"}, {"date": "22 Sept 2020", "title": "Janitor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Queen's University (Kingston, ON) in Jan 2018", "Interview Descriptions": "amazing, it was very professional and the process was great my favourite thing about the process was the process itself and the way the process was processed i aso really liked the hiring and the way they hired who they were hiring", "Interview Questions": "Kind of person i am "}, {"date": "25 Jan 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Queen's University (Toronto, ON) in Nov 2017", "Interview Descriptions": "I approached a professor at CORS conference in person. A few months late, he got back to me with an email. Then we had a chat over phone, and finally I met them in person for an hour, where they asked me to present my PhD work.", "Interview Questions": "Q: what's your experience with ML methods? "}], [{"date": "15 Nov 2017", "title": "Team Leader Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Queen's University (Kingston, ON) in Oct 2017", "Interview Descriptions": "First interview was with previous team leader, an HR rep, a physician, and two other bosses from different teams. I was invited by phone initially for an in-person, round table style interview where we went around and each interviewer asked some questions with a review period at the end for additional questions from themselves and from me.", "Interview Questions": "What is new in the world of health ethics in Canada?"}, {"date": "1 Sept 2017", "title": "Residence Don Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Queen's University", "Interview Descriptions": "There was a written application you submit in person to a drop box.  This was followed by an in-person interview. It does benefit to be a part of the residence team beforehand (e.g. RF or House Rep).", "Interview Questions": "Situational: e.g. what would you do in this scenario (e.g. residence room where occupants covered smoke alarm)"}, {"date": "17 Jul 2018", "title": "Makerspace Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Queen's University (Kingston, ON) in Apr 2017", "Interview Descriptions": "The interview was heavily scripted. The interviewers seemed somewhat disinterested at first. Eventually by asking questions it was possible to engage the interviewers and make a connection. I felt one interviewer did not particularly like me, but later learned that is simply his/her disposition: somewhat introverted.", "Interview Questions": "Tell us about your experience with CAD?"}, {"date": "27 Jun 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Queen's University (Kingston, ON) in Feb 2017", "Interview Descriptions": "Very fair and technical. They asked about my transcripts and interests. They perfectly matched me with the proper supervisor. I worked on Speech processing which had a high demand in market", "Interview Questions": "why did you choose queens university? "}, {"date": "30 Oct 2017", "title": "Switchboard Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Queen's University (Kingston, ON) in Jan 2017", "Interview Descriptions": "There was no interview I talked to the hiring manager and she offered me the job immediately so here are some more words so that I can get to 30", "Interview Questions": "N/A"}, {"date": "28 Jun 2018", "title": "Admission and Recruitment Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Queen's University (Kingston, ON) in Sept 2016", "Interview Descriptions": "Applied online - contacted for testing and interview within a few weeks, offered about 1 week later. Interviewed by two members of the management staff. Was easy going and went well.", "Interview Questions": "Tell us why you would be a good fit for this role?"}, {"date": "23 Nov 2017", "title": "Residence Life Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Queen's University in Sept 2016", "Interview Descriptions": "I had an hour long Skype interview with the Director and a Manager for Queen's University Residence Life. The interview was very comfortable and the interviewers made me feel at ease throughout the entire interview.", "Interview Questions": "What are some things you would do to assist in the first year student's transition to University?"}, {"date": "27 Jul 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Queen's University (Kingston, ON)", "Interview Descriptions": "Informal interview process with standardised questions. Selection was internal amongst students within the program. It is a single interview in a one on one setting. Not many questions. Interview was mainly behavioural based. The supervising professor will conduct the interview and describe the functions and tasks of the job.", "Interview Questions": "Why are you interested in the position?"}, {"date": "19 Jun 2016", "title": "Summer Research Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Queen's University (Kingston, ON) in May 2016", "Interview Descriptions": "A panel of 4 people, some questions were pretty vague. They asked a lot about my experience at Queen's and my thoughts on how to improve experience for others. The description of the job was not clear, and they didn't really explain well what I would have to do and what the end goal of the project would be.  They were pretty friendly, and I got back a detailed response on how I could improve during the interview, so that was very helpful.", "Interview Questions": "How would you organize ..................?\r\nHow well you know Queen's and community?"}, {"date": "12 Dec 2017", "title": "Recruitment Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Queen's University (Kingston, ON) in Mar 2016", "Interview Descriptions": "Applied online for the job and was called in for two interviews. The first interview was a presentation for two recruiters based on a very general prompt about Queen's, followed by general interview questions. The second interview was with two higher directors that asked more general/behavioural questions. The second interview fell right in the middle of the exam period.", "Interview Questions": "What sort of background do you have in delivering presentations, particularly to large groups?"}], [{"date": "10 Jun 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Queen's University (Kingston, ON) in Mar 2016", "Interview Descriptions": "Questions mostly pertaining to prior education. Questions were to guage any knowledge you have on relevant medical topics, and your ability to learn on the fly. A good deal of the interview was the gauge personality and fit within the office. A tight group required a well-suited employee.", "Interview Questions": "How do you usually fit within a team-based environment."}, {"date": "5 Mar 2019", "title": "Admin Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Queen's University in Jan 2016", "Interview Descriptions": "Very laid back, wanted to get to know me mostly. Asked a variety of basic interview questions, no surprises! It was a panel interview, ask a variety of basic interview questions. Was offered the job one week later through email.", "Interview Questions": "What are my top skills and strengths \r\nName a time you had conflict with a co worker\r\nTell me about yourself\r\nWhy would you be an asset \r\n"}, {"date": "9 May 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Queen's University (Kingston, ON) in Oct 2015", "Interview Descriptions": "Interview is usually taken by the Professor for whom you will be working with. It takes around 30 minutes. Generally, they ask you about the subject, whether you have done such courses in your undergrad or not.", "Interview Questions": "- Have you ever taken such courses in your undergrad ?\r\n-have you ever been a teaching assistant ?"}, {"date": "6 Apr 2019", "title": "Postdoctoral Fellow Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Queen's University (Kingston, ON) in Sept 2015", "Interview Descriptions": "a call from a professor and discuss about some research idea and ask some basic question about my research. nothing specific, very general question. and ask me to have review a paper.", "Interview Questions": "N/A"}, {"date": "8 Feb 2017", "title": "Electrical Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Queen's University (Kingston, ON) in Jul 2015", "Interview Descriptions": "1. Had a telephone interview with the HR representative.\r\n2. Then had an in person interview with the department manager and supervisor. They asked typical interview questions, nothing fancy.\r\n3. Then had another in person interview with various team members, which took half a day. We also toured the facilities. This seemed like a formality and that their decision was already made.", "Interview Questions": "How would you deal with a conflict in the workplace?"}, {"date": "27 Aug 2015", "title": "Study Coordinator - NCIC Clinical Trials Group Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Queen's University (Kingston, ON) in Jun 2015", "Interview Descriptions": "Applied online for the position after seeing the posting on the Queen's careers website. Sent in cover letter and CV directly to the hiring manager who was also a Clinical Research Associate. After a month I received an email offering me an interview. The interview was held two weeks later and consisted of a 4 person panel, each person having a list of questions to ask but follow ups to my answers were collective. The interview was a mix of technical questions specific to the position, questions specific to my background gained from my CV, and commonplace work-skills and personality discussions. Nothing was rushed - the interview was approx 75 min - and I could go back and answer something if I wanted to clarify. Definitely an interview to prepare for in terms of knowing exactly what the company is about, technicalities regarding clinical trials, and research but the rest was what one would expect in a management-type interview. Approx. two weeks later (expected time frame given after interview) I received an offer of employment but I declined the position for various reasons.", "Interview Questions": "What would you include in Informed Consent documents?"}, {"date": "20 Feb 2016", "title": "Intramural Official Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Queen's University (Kingston, ON) in Apr 2015", "Interview Descriptions": "Applied through A&R website. Got an interview with the intramural coordinator within the month. Interview was fun and casual. I was asked mostly behavioral questions and some questions related to sport that I would be officiating.", "Interview Questions": "If there was a dispute between players of opposing teams, how would you go about resolving the situation."}, {"date": "16 Sept 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Queen's University (Kingston, ON) in Jan 2015", "Interview Descriptions": "no interview process as such. professor usually chooses from a limited batch of students. as long as your research skills are adequate and you're a proven hard worker you'll get the position.", "Interview Questions": "are you interested in healthcare?"}, {"date": "23 Aug 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Queen's University (Kingston, ON) in Nov 2014", "Interview Descriptions": "Group interview style. Asked behavioural questions as you would expect. Also asked about past experiences. Concluding with a Q&A period. Interview process was pleasant. Expect a panel of 4 administrators interviewing you.", "Interview Questions": "Tell me about the worst thing working in a team"}, {"date": "4 Oct 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Queen's University (Kingston, ON) in Aug 2014", "Interview Descriptions": "There is no interview. As long as you are a graduate student at Queen's University you are guaranteed at least 4 semesters of paid positions as a teaching assistant. There is usually at least a few days worth of deliberations on class material.", "Interview Questions": "How familiar are you with the material we are about to teach?"}], [{"date": "24 Jan 2018", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Queen's University (Kingston, ON) in Apr 2014", "Interview Descriptions": "Panel of three, including hiring manager. One hour interview. Questions included technical and behavioural. Interview took place in a board room on Queen's Campus. They were flexible with interview time, allowing me to change the time and date they first offered.", "Interview Questions": "Mix of behavioural and technical questions. Technical related to databases, unix specific questions, and Active Directory. "}, {"date": "19 Mar 2014", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Queen's University", "Interview Descriptions": "Was given an agenda upon arrival. I met with various faculty, speaking for about 30-45 mins about teaching and research interests. Had lunch with faculty and students.", "Interview Questions": "How would you describe your teaching philosophy/style"}, {"date": "9 Nov 2017", "title": "Master Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Queen's University (Kingston, ON) in Jan 2014", "Interview Descriptions": "Apply online. You must include your GPA and other academic informaiton when applying. Make sure to have a copy of you transcript from your undergraduate school sent to Queen's .  Interviews depends entirely on prof. Some profs will not ask any questions. Others will ask you lots of questions.", "Interview Questions": "Please explain your background in academia in detail."}, {"date": "2 Dec 2013", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Queen's University", "Interview Descriptions": "Contact with the supervisor first, match research interest and funding", "Interview Questions": "Future research direction, working with projects as extra working load"}, {"date": "19 Nov 2015", "title": "PhD Candidate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Queen's University (Kingston, ON) in Oct 2013", "Interview Descriptions": "Few easy questions asking my interests and why I wanted to come to Queen's for graduate studies.  I had completed a masters with my supervisor beforehand and he was very interested in having me as a PhD candidate.", "Interview Questions": "Why do you want to come to Queen's?\r\nWhy do you want to work in this department?\r\nWhy do you want to work on a PhD?"}, {"date": "30 Sept 2013", "title": "Applications Advisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Queen's University", "Interview Descriptions": "Two rounds with two different committees", "Interview Questions": "we have all been declined for something in our life that we really wanted - how did it feel and how would you feel declining someone's application? "}, {"date": "24 Sept 2015", "title": "Chief Official Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Queen's University (Kingston, ON) in Jul 2013", "Interview Descriptions": "-You need to submit an application document and provide relevant work experience pertaining to whichever sport you are the chief official for.\r\n-Complete a forecast and mission plan for how you will impact the Intramurals community\r\n-Interview", "Interview Questions": "How your skills and assets will benefit the job position.\r\nWhat changes would you make, and how do you think the program could be improved"}, {"date": "15 Jan 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Queen's University (Kingston, ON) in Jul 2013", "Interview Descriptions": "There is no interviewing required. All graduate students in physics department need to conduct TA duties. The graduate assistant basically sent out an email to all prospective graduate students and ask then to indicate their preference in courses to TA.", "Interview Questions": "Which course would you prefer to TA?"}, {"date": "7 Apr 2013", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Queen's University (Kingston, ON) in Feb 2013", "Interview Descriptions": "Sending a CV to the potential supervisor or both after contacting to him/her by email. As everyone knows, it is very hard to get replies from professors so that you might need to ask your boss to contact to the professor otherwise they just ignore your email. After getting the response, you'll have an interview over Skype.", "Interview Questions": "N/A"}, {"date": "25 Feb 2014", "title": "Residence Don Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Queen's University in Jan 2013", "Interview Descriptions": "The interview was pretty straight forward. I had my in person interview followed by my group interview on the same day. There were two interviewers and they asked basic interview questions related to working in residence (e.g. describe a time where you were inclusive of others). \r\n\r\nThe group interview was interesting. Essentially, they're looking to see how you interact with others and how you are able to communicate your views/opinions.", "Interview Questions": "How would you deal with conflict with your supervisor?"}], [{"date": "19 Aug 2016", "title": "Queen's Walkhome Staff Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Queen's University (Kingston, ON) in Jan 2013", "Interview Descriptions": "First interview was a group interview, second was solo. General Questions about working and how you would deal in difficult scenarios. Very nice interviewers and seemed to facilitate discussion rather than grilling you. Seemed like they valued personality over experience.", "Interview Questions": "Why do you want to work here, Who would you walk with if you could walk with anyone past or present?"}, {"date": "12 Jan 2013", "title": "Science Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Queen's University (Kingston, ON) in Nov 2012", "Interview Descriptions": "Sent emails to professors that you are interested in working with. Then I had phone interviews with them, and email conversations as well, followed by the visit. Finally, we need to think about whether or not to take this position after the visit, and whether professors were also happy to take you. If yes, then you are hired.", "Interview Questions": "I did not encounter any"}, {"date": "13 Dec 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Queen's University (Kingston, ON) in May 2012", "Interview Descriptions": "From application to job offer process is long. Before panel interview there was a basic math/accounting test including a basic journal entry that would be done through Peoplesoft. Interview questions were pretty standard.", "Interview Questions": "How would my current skill set help in this job?"}, {"date": "25 Mar 2016", "title": "Atletete Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Queen's University in Mar 2012", "Interview Descriptions": "group interview with 5  other candidates - was useful to see other student athletes in the room and play off one another. i t was a great opportunity i dont regret it for one second cha gaiel", "Interview Questions": "relate own challenges in academics to how you can help freshman athletes"}, {"date": "11 Jun 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Queen's University (Kingston, ON) in Jan 2012", "Interview Descriptions": "Multi-stage process, traditional Q&A format. Final stage is a bit of a \"meet and greet\" where they go over pros and cons of position. In the end, I realized it wasn't the job for me, but I appreciated their process and their honesty.", "Interview Questions": "Tell us what you know about the position and the department"}, {"date": "18 Oct 2011", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Queen's University (Kingston, ON) in Mar 2011", "Interview Descriptions": "You will be asked about our relevant experience and past experience. Questions about the project management, group conflicts, dealing with clients, working in teams and leadership experience. They took notes when you were talking. At the end you will have a chance to ask questions. The interviewer was really nice.", "Interview Questions": "Do you have leadership experience? Provide your example."}, {"date": "11 May 2013", "title": "leitender Großkundenmanager / leitender Mitarbeiter im Außendienst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Queen's University (Kingston, ON) in Jun 2010", "Interview Descriptions": "Responded to Workoplis posting. Interview was scheduled. Interviewed with a group of people from various university departments and an external project manager. At the start of the interview the external project manager stated he did not feel this position was necessary which seemed strange. The other people interviewing asked relevant questions, listened to my answers and would ask follow-up questions as they saw fit. Their answers to my questions were polite and well thought out. With the exception of the external project manager's statement the tone of the interview was professional and polite while not being not overly formal.\r\n\r\nI was contacted two weeks later and told the other candidate got the job. The reasons were strange as they felt I was more of a testing person and not a QA person, yet the job posting and questions were geared to the testing aspects of the position and QA was not mentioned once.  I suspect an internal candidate got the job and I was used as a filler candidate to make the recruitment process seem fair.", "Interview Questions": "N/A"}]]