[[{"date": "6 Jul 2023", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical College of Wisconsin", "Interview Descriptions": "Good, it was a normal interview goi h over position & benefits. Took about 40 minutes from start to finish. The recruiter was very informative. The questions were your typical interview questions.", "Interview Questions": "Why do you want this position"}, {"date": "22 Apr 2023", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "I had an interview with a recruiter then two more interviews after that with members from the team. I applied in February and the process went on for about two months by the time I found out I did not get the job. I was frustrated that the recruiter emailed me telling me I was not hired and not the team members I built good rapport with throughout the interviews. It was a generic “thank you for apply…” email which was also really frustrating. When I asked for feedback on my interviews to help me in the job process, I did not hear back.", "Interview Questions": "What is your experience working with a team cross departmentally?"}, {"date": "11 Apr 2023", "title": "Education Program Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical College of Wisconsin", "Interview Descriptions": "HR interview to start which went very well! It was very conversational and easy to feel comfortable. After that, had multiple interviews which was a bit time consuming, but overall not too difficult", "Interview Questions": "How do your past experiences shape you to fit this position?"}, {"date": "7 Feb 2023", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical College of Wisconsin", "Interview Descriptions": "I had one phone interview with the human resources recruiter, followed by three video interviews with relevant department leadership. The interviews were all fairly standard in terms of length and difficulty. A job offer was provided within two weeks.", "Interview Questions": "Tell me about your experience managing databases."}, {"date": "25 Feb 2023", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Feb 2023", "Interview Descriptions": "Firstly, this is a entry level job, And they had five people interviewing a person. There was no diversity in the interviewers. And the interviewers asked uncommon situation related questions like : 1) describe a time where you had great listening skills 2) how do you finish tasks accurately vs timely. 3) how do you motivate yourself 4) how would you like your employer to provide you with feedback 5)how would you be creative with your work it was all like a rapid fire all uncommon situations and each question was built on the next. i dont think there is diversity at all in this team. the supervisor powepoint they shared had all non-poc names. the immediately sent you an email if you are rejected and do not provide a feedback.", "Interview Questions": "1) how would you be creative in this team"}, {"date": "30 Jan 2023", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Medical College of Wisconsin (Milwaukee, WI)", "Interview Descriptions": "A long, drawn-out process with terrible communication at the end of the process. Once someone has spent 3+ months interviewing over several rounds, they deserve more than an autogenerate HR rejection email.", "Interview Questions": "Please describe your experience and how it relates to this position."}, {"date": "27 Dec 2022", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2+ months. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "Round 1: Phone screen with HR. Round 2: Five 30 min one-on-one interviews with the team. Round 3: One day of observation in clinic and two final one-on-one interviews with the department chair and the department administrator.", "Interview Questions": "Why did you choose [specialty]?"}, {"date": "1 Oct 2022", "title": "Neuropsychology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "The recruiter conducts a phone interview to screen potential candidates. Afterwards a hiring team of two or three people conduct a 45 minute interview via zoom. If they are interested in the potential candidate they conduct a 2nd interview  in person asking additional questions and a tour of the workplace to allow candidates to picture themselves working there. ", "Interview Questions": "Q: What is your understanding of this role  and what interests you about it?\nQ: What stress management strategies do you use when feeling overwhelmed?\nQ: What are your long term career goals?"}, {"date": "2 Sept 2022", "title": "Research Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Sept 2022", "Interview Descriptions": "I applied and got an email about a week later to interview. I emailed back and never got a response then was told the position has been filled. I then got another email a week later to interview since they opened up another position. The interview was supposed to be 45 minutes on-site. I went to the interview and approximately 25 minutes of the 30 minutes actually spent with me was just talking about the center and the job duties, which the job duties were only barely the same as those listed in the job description. Job description never even implied anything regarding travelling, but they told me 50% of the job would be travelling to field clinics and patient homes. This felt extremely inappropriate to have a job description that lists stuff they did not even talk about while not listing 50% of the actual job. They asked me approximately 3-4 questions and told me they would get back to me within a week or two.", "Interview Questions": "Tell me about yourself."}, {"date": "18 Jul 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical College of Wisconsin", "Interview Descriptions": "There is a standard HR Screening process. HR then provides the hiring manager with impressions and recommendations. If the hiring manager sees potential, you get invited to a department interview(s).", "Interview Questions": "General HR questions for screening"}], [{"date": "21 Mar 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Medical College of Wisconsin (Dallas, TX) in Mar 2022", "Interview Descriptions": "It was a phone interview, and it was very chill and the interviewer was really nice. It lasted about 30 minutes, and it was basically a first round of interviews. Not exactly sure if I made it to the next step.", "Interview Questions": "What do I know about research? \r\nWhat has my experience been like?\r\nWhat type of skills do I have?"}, {"date": "17 Feb 2022", "title": "Administrative Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Feb 2022", "Interview Descriptions": "Phone screen interview with HR (where they determine if they will submit your information to the team). Two Zoom interviews with leaders in the department. Still waiting on hiring decision.", "Interview Questions": "Why are you looking for a new position? Describe a conflict you’ve had."}, {"date": "25 Feb 2023", "title": "Clinical Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Feb 2022", "Interview Descriptions": "rapidfire round- one hr long interview. they ask you personality related situational questions that are very uncommon. there is lack of diversity. im not sure why 5 ppl ( three crc's two managers, one of them BSN) were interviewing someone for an entry level job. And there is no diversity on the interview panel OR the team. so i felt me being ethnic they gave me really tough questions and 10 mins later sent me an email i was rejected and they moved with other candidates aligned with what they are looking for even though i had research experience and a foreign medical degree. they also dont send you a reply after you asked for a feedback email. they know candidates are overqualified but desperate for the job and ask unrelated situational questions. rejection is protection and i wouldn't want to work in a place where they are this way with interview candidates and there is NO diversity.", "Interview Questions": "1) describe a time where you had to show your listening skills?"}, {"date": "1 Jan 2022", "title": "Education Program Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical College of Wisconsin", "Interview Descriptions": "Employees who would have comprised the team I would manage were indifferent/hostile.   One even openly texted.  Job description was unclear, and interview made it even less clear.   Had to return for multiple days to interview.  Clear tension between administration and the staff I would lead.", "Interview Questions": "What do you fear?  [How is that an appropriate interview question?]"}, {"date": "26 Jan 2022", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jan 2022", "Interview Descriptions": "it would be 4 interview total. the first interview was over the phone with research manager. it took 20 min total. I am waiting for the next 3 rounds. and will update my answers.", "Interview Questions": "what will you see yourself in next 5 years?\nwhat was the mistake that you had in your job?\nwhat was a conflict that you had at work?"}, {"date": "17 Jan 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin (Wauwatosa, WI) in Dec 2021", "Interview Descriptions": "Everyone was kind, respectable, and informative of the whole process. They were encouraging as well, but there were lots of interviews that took place. It was all virtual too due to Covid.", "Interview Questions": "How do you see yourself in the next 5 years?"}, {"date": "3 Nov 2021", "title": "SPUR Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Medical College of Wisconsin", "Interview Descriptions": "Nice and smooth, they pair you with a research team and told a project. Most of the process depends on the cover letter you submit, make sure to get rec letter from research people.", "Interview Questions": "To say yes within a week"}, {"date": "18 Nov 2021", "title": "Bioinformatics Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Oct 2021", "Interview Descriptions": "Initially there was a phone call interview with the recruiter, after that there was a video interview for 45 min over Microsoft Teams. After that interview, either they let you know if they need another interview, you're hired, or they're not interested.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "27 Sept 2021", "title": "Clinical Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical College of Wisconsin in Sept 2021", "Interview Descriptions": "Four total interviews, one interview with HR, they were over zoom, very easy , it was more of a conversation than an interview to get to know the physicians and researchers", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "23 Jul 2021", "title": "Residnt Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical College of Wisconsin", "Interview Descriptions": "Interview process was standard to what you would see at any other academic institution. Was laidback and informative. PD's and Faculty just want to know they will get along with you.", "Interview Questions": "Name a challenging aspect of your life."}], [{"date": "1 Jul 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical College of Wisconsin", "Interview Descriptions": "First, they do a screening by phone, then they invited me for one day of interviews (6) of 20 min each. After that, 2 weeks later I received a phone call to talk about an offer. All the process is fast and very professional", "Interview Questions": "Examples of experience in health care"}, {"date": "14 Oct 2021", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jul 2021", "Interview Descriptions": "First, you have your phone interview with HR then you have an interview with the department manager.  The whole process took about a month before I started working, it was simple overall.", "Interview Questions": "What makes you a strong candidate for this position? "}, {"date": "14 Apr 2021", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "The interview process was about 90% straightforward and pleasant. HR called initially and discussed with me the role and whether I was okay with the compensation pay range. She informed me that someone was going to reach out from the hiring team. \n\nI next had a full day of interviews with the hiring team, including administrative members, physicians, and the lead PA. It was a pleasant set of interviews and I was to hear from the team regarding a decision by the end of the month. \n\nEnded up receiving no correspondence by the end of the month. Emailed the admin contact for an update twice and received no response. Emailed HR and received no response. Looked on my portal one day and saw that the position was closed. The last 10% of the process left a sour taste in my mouth. MCW lack of communication at the end of the process was very off putting.", "Interview Questions": "Q: What makes you the best fit for this position?"}, {"date": "15 Apr 2021", "title": "Learning Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Medical College of Wisconsin", "Interview Descriptions": "I had one round of interviews via Zoom, which lasted for 2.5 hours and included 8 people. There was a second round of interviews that lasted for one hour and included an additional four people. Everyone was nice, and it was a good experience. The interview process was well organized.", "Interview Questions": "Why did you apply for this position?"}, {"date": "28 Jun 2021", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Medical College of Wisconsin in Apr 2021", "Interview Descriptions": "Three rounds of interviews with people at several levels. This was all fine and routine. The absolute most disappointing thing is getting generic rejection emails, likely autogenerated when you have given them that much of your time. I understand people are chosen for different reasons.", "Interview Questions": "Asked about my experiences and gave me lots of time to ask questions."}, {"date": "25 Apr 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Apr 2021", "Interview Descriptions": "This was a zoom interview with the members of the team that would collaborate with the position. I learned about the laboratory and the processes. I was asked about my academic background and experience, as well as the standards that regulate the research.", "Interview Questions": "Do I know the standards necessitated to make educated calls in this analyst job?"}, {"date": "20 Mar 2021", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical College of Wisconsin", "Interview Descriptions": "First interview phase was a phone call interview with human resources to screen for minimum requirements. If you make it through, next is in person interview with potential new boss.", "Interview Questions": "Normal interview questions, strengths and weaknesses."}, {"date": "19 Aug 2021", "title": "Education Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical College of Wisconsin in Mar 2021", "Interview Descriptions": "Had an initital Phone interview with HR, then recieved a call back to schedule a virtual panel interview. When I arrived to my virtual interivew with the panel it included staff, instructors and current students.", "Interview Questions": "How do you manage your time, and how do you stay organized?"}, {"date": "2 May 2022", "title": "Librarian Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical College of Wisconsin in Jan 2021", "Interview Descriptions": "Average interview process. Half day long final interview which was online. Meet with the hiring committee, meet with the director, meet with the general staff, teaching presentation. Everything was online.", "Interview Questions": "Live PubMed Search on a question of their choosing. "}, {"date": "19 Dec 2020", "title": "Research Nurse II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "Initially I submitted a resume via the MCW website, and received an email for a request for a phone call interview 2 days later from a recruiter within MCW. After that, they asked for my references almost immediately (5 of them, 2 of which must be managers) which are all traceable via a website who has returned the survey and who hasn't. I believe that they wouldn't proceed with the interview process if they did not receive all of these back, but I am not sure since I chased back people to get them to return their surveys. The last interview was a virtual interview series lasting 2.5 hours long with 5 different people, each in 30 minute intervals. There was many audiological problems with the software used to conduct the interviews creating a bunch of echo feedback, distracting from being able to answer questions (with hearing my own voice in the background). There was also about 5-6 or more questions asked during each 30 minute interval which by the end was about 25-30 questions total. Only a few of them were repeat questions too but even 22-25 questions for a single interview session is pretty stressful. \n\nAfter the interview, I didn't hear anything for weeks until I sent a status update to check and see what was going on. I was told that they were still interviewing candidates and would have an answer in the following week. A couple weeks later I emailed the recruiter again and she told me the search was \"cancelled\". Not a single notification about this development was given to me without me having to ask about it. To say I am disappointed in how things unfolded is an understatement.", "Interview Questions": "Why do I want to go into research?"}], [{"date": "17 Feb 2021", "title": "Clinical Research Coordinator I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Dec 2020", "Interview Descriptions": "Three interviews, all within two weeks, got a call the next day after I applied. Was very lucky, at CTSI. Great experience thus far. Heavily enjoyed the process. \r\n\r\nWould recommend to future candidates", "Interview Questions": "Standard public health questions to understand demography and willingness to learn new skills such as phlebotomy "}, {"date": "4 Oct 2020", "title": "Clinical Research Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Sept 2020", "Interview Descriptions": "Had a phone interview for about 30 min. Then was asked to come back for a 2 hour WebEx interview, where I spoke with 4 different people for 30 minute slots each person. Following the interview that day, I had to complete an “assignment” and had 45 minutes to complete it. This involved answering questions about the position and analyzing a medical record for a patient. I then had to submit this to whom had requested the assignment.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Aug 2020", "title": "Community Programs Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jul 2020", "Interview Descriptions": "Applied online and was contacted by phone about a week later and told that they wanted to invite me interview for the position (via video). I said ok and waited for the email to come through. \r\n\r\nInstead, I received a link asking for 5 references - with a minimum being 3 professional. I was confused by this since I hadn’t even interviewed or received a date for the interview at this point, but completed the step regardless so I could proceed. \r\n\r\nInterview date came and I was on WebEx with 3 ladies who took turns asking questions and/or explaining their job roles within the department. \r\n\r\nOverall, I thought I did well for being a newbie to this virtual interviewing style.", "Interview Questions": "What is your experience working with the community?"}, {"date": "2 Dec 2019", "title": "Physician Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "No follow up in a timely manner. It was a slow and lengthy process. They let good qualified candidates fall through because of the time it takes them to get back to them.", "Interview Questions": "why do you want to work here?"}, {"date": "20 Jul 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "Phone interview with the principal investigator. Invited for onsite interview scheduled within two weeks. Interview with principal investigator followed by brief meetings with department faculty members. Next, scientific presentation to discuss research methodologies and results.", "Interview Questions": "What are your key scientific achievements?"}, {"date": "22 Feb 2022", "title": "Research Technician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical College of Wisconsin in Jun 2019", "Interview Descriptions": "Interview was simple. Went through an initial screening with HR to discuss the position and qualifications. Following this initial screening with HR, the lead PI reached out and set up a phone interview to discuss my background.", "Interview Questions": "What would you do if a particular assay was not working out after multiple attempts? "}, {"date": "15 May 2019", "title": "Talent Development Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical College of Wisconsin in May 2019", "Interview Descriptions": "I've had several phone screen with the same recruiter for different positions. The screens were not that far apart but the recruiter forgot who I was. Talk about being treated like a number. \r\n\r\nThe recruiter's explanations of the job descriptions were very different and actually deterred me from the organization. \r\n\r\nWhen waiting to hear back for a final decision, I was not notified. I had to check the careers page for myself and see my application status. \r\n\r\nHR Team, please train your recruiters on being more personable and actually treating candidates as humans. Also, invest the extra time in notifying applicants that have come very close to the final steps. The medical college of wisconsin has a massive reputation and needs to maintain it through well-trained and seasoned professionals.", "Interview Questions": "The typical HR questions in the initial call with the recruiter and STAR questions for screen with the hiring manager. "}, {"date": "10 Apr 2019", "title": "Clinical Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Medical College of Wisconsin in Apr 2019", "Interview Descriptions": "The phone interview is around 30 mins long, mostly them asking you questions. They asked about your previous positions and to go in depth for each one. She was very helpful in answering your questions at the end, but limited the interview to 30 mins.", "Interview Questions": "Three strong traits."}, {"date": "14 Jun 2023", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Mar 2019", "Interview Descriptions": "After completing online application, I was emailed by HR for a screening phone interview first then had department specific interviews about 1 week later. Clear communication and expectations were communicated by the teams.", "Interview Questions": "Many scenario questions but tried to answer sincerely"}], [{"date": "2 Feb 2023", "title": "Enterprise Programmer Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jan 2019", "Interview Descriptions": "Phone call followed by in-person meeting if the phone call interview goes well. Basic questions asked regarding your previous achievements, interests etc. Expect basic programming questions to be asked at the interview with the language being from what the role requires. If selected the interview process will follow referral check, background check.", "Interview Questions": "What was my salary expectation."}, {"date": "31 Oct 2018", "title": "Educational Program Coordinator I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Oct 2018", "Interview Descriptions": "I applied to a position on 10/10/18. I was contacted on 10/24/18 to set up a phone interview which I scheduled for 10/31/18. That morning, I was notified that the position was filled on 10/30/18. My main question is if I had been contacted when I had first applied, I could have been actually considered for the job.", "Interview Questions": "N/A"}, {"date": "9 Nov 2018", "title": "Senior Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin in Oct 2018", "Interview Descriptions": "Phone interview which took about 35 minutes and although the questions were clearly guided it felt like a conversation and was very comfortable.  Interviewer made it clear that if I would like, I could be made aware of any and all opportunities that might be a good fit.", "Interview Questions": "Experience, what I desired out of a work experience, future goals, salary expectations"}, {"date": "20 Sept 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Aug 2018", "Interview Descriptions": "Phone interview was really more of just a screen done by a consultant. She was not aware of job specifics that were in the listing and provided inaccurate job info which I discovered at the in person interview.\n\nI literally was no longer interested in the position after hearing her description of it but felt going to the in person interview was good experience.  I was so excited to find out I was qualified and interested in the actual job description that I feel I did not show enough interest in the company. \n\nThe in person interview was really just a conversation with 2 people. It’s probably the only time I have ever truly enjoyed an interview.\n\nI did not make it to the 2nd round.", "Interview Questions": "The consultant who did the phone interview really pressed me for my desired salary."}, {"date": "28 Sept 2018", "title": "Research Technologist I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Aug 2018", "Interview Descriptions": "I applied online, they responded pretty quickly (about a week), then a phone interview was set up. Within the next week the medical college of Wisconsin emailed me back with feedback from phone interview", "Interview Questions": "They asked me to go in detail the last experiment I performed"}, {"date": "22 Jul 2018", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "Met with my manager and an upper-level manager to discuss my background, qualifications, and expectations with the position. Management was very clear in outlining the position responsibilities and your role within the organization.", "Interview Questions": "Tell me about your experiences. What did you learn from your experiences? What challenges have you overcome?"}, {"date": "28 Jun 2018", "title": "Clinical Research Assistant III - Pediatric Emergency Medicine Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Medical College of Wisconsin in Jun 2018", "Interview Descriptions": "After applying to literally 20 different jobs here, I finally got lucky for a phone interview. Scheduled it, and it went smooth. Then after about 3-4 days (had the phone interview on a Thursday), they got back to me and wanted to schedule an in person interview. Went to that and it also went great! Even did a shadowing session of the research team I would be joining. After I got home that SAME DAY, I emailed a thank you to the coordinator and he actually called me back right after emailing me too. He said he wanted me to come back in a week later for the final round of interviews.\r\n\r\nAt this point, I felt I had it in the bag...everything had went so well and I actually felt confident in my long road of trying to get a job. Then the end of that week I get a strange email saying that things came up and that they would have to reschedule. I was wary about the wording of it, but since it did IN FACT SAY RESCHEDULE, I felt it might still be okay. Finally, after two emails, and three phone calls later, I get a hold of the coordinator to finally end up telling me there was a \"stellar candidate\". Not only did this not make any sense, as I was one of the first to be interviewed and the process took at least two weeks (so there is no possibility that this 'stellar' candidate went through all three rounds already), but I had basically been strung along for an additional week and a half. Simply crushed and felt led on.", "Interview Questions": "Why choose MCW?"}, {"date": "23 Aug 2021", "title": "Account Representative II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jun 2018", "Interview Descriptions": "The interview process was easy and smooth. I took a typing test which requires 35 wpm. I met with HR briefly and then was scheduled an interview with the hiring manager and team lead.", "Interview Questions": "How flexible was I with change."}, {"date": "22 Jun 2018", "title": "Research Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Medical College of Wisconsin (Wauwatosa, WI) in Jun 2018", "Interview Descriptions": "Applied online and about 5 days later a person in their department contacted me with a in-person interview with several people. Everyone I met was friendly and just wanted to get to know me as well as show me the lab and discuss their research.", "Interview Questions": "Why do you want to work in research?"}, {"date": "24 Apr 2018", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Medical College of Wisconsin", "Interview Descriptions": "Second  interviewed round-robin style with 5 different MCW staff/faculty members. Was asked to prepare for a 3 hour interview-interview lasted 3.5 hours. Staff was friendly and knowledgeable, but the position was described differently by all 5 staff members, this was a red flag for me.", "Interview Questions": "What is your working style? "}], [{"date": "6 Dec 2017", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI)", "Interview Descriptions": "Phone interview into in person interview with several staff members, talked to several people in different departments about career opportunities as well, thorough.  Friendly welcoming staff, however the application to interview to offer process took a long time.", "Interview Questions": "Relevant research experience and software experience?"}, {"date": "27 Oct 2017", "title": "Senior Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "I was reached out to on LinkedIn and went through an initial run down of the position they wanted to recruit me for, I expressed interest so they set me up for the Microsoft Office Test and an In-Person interview with their Talent Acquisition Specialist, I sent a thank you email and again expressed interest in the position.  I was then set up with another phone screen with the Sr. Talent Acquisition Specialist and again with the Talent Acquisition Specialist, they explained the next steps and I never heard from them again. I have reached out to the recruiter and the talent acquisition specialist at least twice since these interviews and have received no communication on their end. The professionalism in this part of the process is sorely lacking.", "Interview Questions": "What are your professional goals?"}, {"date": "15 Sept 2017", "title": "Nurse Practitioner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "Received email from HR looking to set up phone interview. I immediately responded with available dates and times. It took a few days for HR staff to respond and confirm phone interview.  During the phone interview, she was relatively friendly. I was told that I would be contacted within the next week if they wanted to move forward. I emailed a thank you the next day. Hours later I received a standard email that stated that the position was filled. I am doubtful that it was actually filled, as the day before I was told that there were 2 positions available.  I again emailed the HR staff to thank them for their consideration, express my continued interest, and ask for any feedback so that I could make myself a stronger candidate. I did not receive a response.  I felt that the lack of response from HR was unprofessional.  I may have not been a great fit for that position, but the fact that HR staff does not have the courtesy to respond to my emails makes me hesitant to apply to any other positions in the future.", "Interview Questions": "How have you handled a difficult patient?"}, {"date": "4 Mar 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Sept 2017", "Interview Descriptions": "pretty standard.  Took a while to set up.  It ran on time.  Asked the standard questions.  Seemed to have a good give and take discussion. The provided a good overview of the organization", "Interview Questions": "Why I was looking for a new job"}, {"date": "8 Sept 2017", "title": "Senior Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Aug 2017", "Interview Descriptions": "Met with staff and physicians . Had one group of four staff members interview for 45 minutes or so  and then two separate physician interviews of 20 minutes each.  Have thoughtful, relevant questions for them.", "Interview Questions": "How do you deal with criticism?  How well do you handle interruptions? Can you keep calm if others do not? "}, {"date": "20 Jul 2017", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "The process took almost two months. I had two very long (3hour) interviews with several people in the department, some were panel and some were 1 on 1.  Overall it was a good experience. Everyone was very nice and asked the typical interview questions. Make sure you know a lot about the company, the position you are applying for and how your skills fit with that position.", "Interview Questions": "What is your communication style? "}, {"date": "10 Aug 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin in Jul 2017", "Interview Descriptions": "First met with Human Resources and performed a skills test for Microsoft applications. I was then called in for another interview and it went swimmingly. I was even told I was in the top three for the position. I finally heard back and learned they chose a candidate that would be a \"better fit with the donors\". To be honest, that was a little disheartening on a personal level than just being told he/she was just better qualified. All in all, the committee was group of very nice people and they do great work.", "Interview Questions": "There wasn't any out of ordinary questions asked, but they did flip my questions back on myself. "}, {"date": "12 Sept 2017", "title": "Pediatric Orthopedics Engineer I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin in Jul 2017", "Interview Descriptions": "Applied online. First, HR emailed me asking for background check info and set up a time for a phone interview. I had the phone interview with HR and she told me I would be contacted within 2 weeks. I wasn't contacted, but reached out through email to check my status and was told if the manager was interested he would contact me.", "Interview Questions": "What interested you about this position?"}, {"date": "27 Jul 2017", "title": "Buyer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin (Wauwatosa, WI) in Jun 2017", "Interview Descriptions": "over 2 hours.  4 different people.  HR, and entire department thought they were hiring for Buyer.  New Director informed me that it was for Junior Buyer.  Current buyers only there less than a year.  They went through a few in the past year.  45-50 hours/week told to me by Dir.  50-55 hours/week told to me by buyers.  They do agreements but departments get to buy what they want.", "Interview Questions": "What was the latest book you read?"}, {"date": "13 Jun 2017", "title": "Research Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jun 2017", "Interview Descriptions": "General questions re: prior positions and office skills and ability to work for multiple people and manage multiple tasks.   Interviewer did not seem prepared, very knowledgeable about job, and lacked promised follow through.", "Interview Questions": "Can you work for multiple people with multiple agendas, and manage multiple projects?"}], [{"date": "29 Nov 2017", "title": "Research Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Mar 2017", "Interview Descriptions": "Three people interviewed me together, but it was more of light conversations to see if our personalities matched. They had already read my resume, so they wanted to talk about what wasn't on my resume. It was the best interview I have had so far.", "Interview Questions": "Tell me about your research experience"}, {"date": "3 Feb 2017", "title": "Research Technologist I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical College of Wisconsin in Jan 2017", "Interview Descriptions": "Did a phone interview that was very calm and casual. The person from HR was very nice and made me feel at ease. The questions were pretty basic HR interview questions. Answer using the STAR method and you should be fine. Also was asked about my lab technique experience.", "Interview Questions": "Describe a time where you had to deal with a difficult situation with a coworker"}, {"date": "26 Oct 2017", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Medical College of Wisconsin in Jan 2017", "Interview Descriptions": "First interview was in-person with the faculty I would be supporting. The second interview was in-person with the Supervisor of the Department. I received an offer shortly after that. Total time was about 1.5 months.", "Interview Questions": "Why do you want to work in academic medicine?"}, {"date": "27 Aug 2020", "title": "Postodoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Medical College of Wisconsin in Nov 2016", "Interview Descriptions": "Interview process depends on the PI but usually involves a day long visit with multiple interviews with people relevant to the lab of interest and a lab and facilities tour", "Interview Questions": "Tell me about yourself please"}, {"date": "16 Sept 2016", "title": "Systems Engineer I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Sept 2016", "Interview Descriptions": "An initial telephone interview.  I was told about the position I was interviewing for and the place that I would work for if hired.  I was asked why I left my previous employer.  I was asked about my UNIX experience, as well as other server experience, such as Windows and VMWare.  My EDI experience, I was told, was helpful to the interviewer, as well as the fact that I now like creating documentation, which I, early in my career, did not like doing.", "Interview Questions": "What type of work did I do in my previous employment?"}, {"date": "27 Jun 2016", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jun 2016", "Interview Descriptions": "Applied online and got contacted by recruiting agent via email. Set up a phone interview and was informed of how the process would develop if I was approved by the hiring manager. The next steps would have been a 1-1 face interview as well as a drug test and background check.", "Interview Questions": "What is the most interesting feature/what draws you in towards working in a laboratory?"}, {"date": "22 Apr 2016", "title": "IT Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Medical College of Wisconsin", "Interview Descriptions": "phone interview, two rounds of in-person interviews.  Had to provide very extensive supporting documentation with references, diplomas, transcripts, and even performance reviews from previous positions.  It was too much!", "Interview Questions": "Standard project management questions"}, {"date": "21 Jun 2016", "title": "Research Technologist I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Apr 2016", "Interview Descriptions": "Submitted my application, about a week later I recieved an email from a representative in HR requesting a phone interview. A couple days (1-2) after the phone interview I recieved an email from the PI of the lab that I applied to for a in person interview. Received an offer a week after that.", "Interview Questions": "Why would you like to conduct research within a lab?"}, {"date": "6 Dec 2016", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Mar 2016", "Interview Descriptions": "Long, very, very long,  I am an internal employee, I had to first meet with HR and take a series of test based on Microsoft outlook.  Then I met with department staff (people at the same level as the position).  I was called in to interview again with a division administrator.  Was called to interview again for the fourth time by a faculty member.  I essentially turned down the fourth interview because I was offered another position within my department.  In my opinion the amount of interviews for a position of this status is a bit ridiculous and very much overkill.", "Interview Questions": "Basic questions were asked such as how do you handle conflict, what are you long term goals, why are you seeking a new position, etc."}, {"date": "22 Jul 2016", "title": "Financial Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Medical College of Wisconsin (Wauwatosa, WI) in Mar 2016", "Interview Descriptions": "I applied in February and had my first interview in March with the HR department.  The second interview was about 3 weeks later and I spoke with my direct supervisor and one other person. I was offered the position about two weeks after my second interview and started three weeks after that due to having to give notice at the job I had.  The process overall went very well.", "Interview Questions": "What are your strengths and weaknesses?"}], [{"date": "15 Feb 2016", "title": "Administrative Coordinator 1- Gastroenterology Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI)", "Interview Descriptions": "The interview was very basic. Behavior and past experience. It is an entry level position, bachelors needed and a year or 2 of experience. I was told that I would hear back in the beginning of the following week. I didn't hear back so I sent an email to the HR person who interview me. My email was ignored. So 2 weeks later I sent another email, HR rep finally responded and was very rude. Which seems to be the trend that I am seeing on glassdoor with the MCW. Asked for feedback with the rejection and was told that they couldn't provide feedback. Very weird and unwanted experience.", "Interview Questions": "Tell me about a situation in the past job where you had to diffuse a bad situation and how you went along with doing it."}, {"date": "19 Feb 2016", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "Financial resolutions always top the list of America's most common New Year's resolutions… and for good reason. The benefits of achieving this resolution can help you become financially secure, lower your stress levels and increase your tax benefits.", "Interview Questions": "background"}, {"date": "14 Jan 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jan 2016", "Interview Descriptions": "Not a short process at all so be warned! From time of my application to time of offer was about 2 months. I had to go through Microsoft Office skills testing, 2 phone interviews/screens and a 2.5 hour in-person interview where I meet with 7 people in small groups of 1-2 at a time. Everyone I meet with was super nice and the interviews flowed well. They made me feel comfortable and I left thinking I had a good chance of getting an offer. Be prepared, friendly and confident. \r\n\r\nBecause the hiring process at MCW is decentralized, it's encouraged to apply to any position you are interested in and qualified for. Some departments do their own hiring while other go through the Human Resources Department.", "Interview Questions": "Why would you be a good fit for this position?"}, {"date": "9 Feb 2017", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jan 2016", "Interview Descriptions": "The phone screening was followed by another phone screening.  Then there was an in person interview where you meet with a number of groups, management, MDs, NPs, PA, and admins.  Everyone was very nice and professional", "Interview Questions": "in depth questions regard my experience"}, {"date": "21 Jan 2016", "title": "Data Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Dec 2015", "Interview Descriptions": "Applied in late November and received a call from HR three weeks later to schedule an in-person interview. Went to HR offices one week later to take excel and data entry tests and then met with a recruiter who was nice and casual, and made me feel very comfortable. She discussed the position that I was interviewing for in great detail. I thought that I did well, but I guess not b/c I received an email one week later that MCW chose to pursue other, more qualified, candidates.", "Interview Questions": "Tell me about yourself.\r\nTell me about a time that a supervisor praised you for your work.\r\nWhy are you interested in working for MCW?\r\nWhy are you interested in this position that you are interviewing for?\r\nWould you say that you prefer working on your own or with a team?\r\nWhat are your salary requirements?"}, {"date": "20 Sept 2016", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical College of Wisconsin in Sept 2015", "Interview Descriptions": "My interview process was unique because I was simultaneously interviewing for two positions within the organization. I started with an in-person interview with one person from the Central Human Resources department for a position in the Pediatrics department. During that interview, Central HR informed me that I seemed like a good fit for a position they were hiring for and asked if I would like to be considered for that position - I agreed. After this first interview, I was asked to complete several computer-based tests to prove competency in Microsoft Office products. \r\n\r\nI then came back for a larger interview with Central HR with several different interviewers (this interview took about two hours). I also came in a week or so later for a second interview for the position I originally interviewed for. Both of these second interviews had me placed in a room and cycled in different individuals to interview me. Fortunately, which I appreciated, not all interviewers asked the same questions over-and-over (although there was a fair amount of repeating answers).", "Interview Questions": "Each of my interviews included a lot of questions that started with \"Tell me about a time when X happened and explain how you handled the situation.\" "}, {"date": "5 Nov 2015", "title": "Research Technologist II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Sept 2015", "Interview Descriptions": "I came in for an interview for the Human and Molecular Genetics Center Research Technologist II position and was blown away by how comfortable everyone made me feel and by the ease of the questions. I interviewed with four representatives from laboratories that were very nice and it was apparent that they were happy with their current positions and/or projects.", "Interview Questions": "\"Why do you make a good candidate for this position?\""}, {"date": "25 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Medical College of Wisconsin in Sept 2015", "Interview Descriptions": "Phone interview with HR. Nirmal review questions. Onsite interview was an hour. the PI and lab managers were very friendly and made me want to work there even more. The process was fairly simple and not as intimidating as I originally thought it would be. There is opportunity to go back to school and earn higher degrees.", "Interview Questions": "What do you find challenging or a weakness."}, {"date": "21 Sept 2015", "title": "Physician Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Aug 2015", "Interview Descriptions": "I was contacted fairly quickly after applying and an Administrative Assistant set me up for a phone interview with the Hiring Manager.  The phone interview went well and I was contacted the following week to meet with the Hiring Manager in person along with her Supervisor.  They asked good questions and treated me nicely during their interviews.  Both indicated that I would hear back toward the end of the following week.  When I didn't hear from anyone, I contacted the Hiring Manager by email and simply asked her if they had reached a decision on who they wanted to move on to a final panel interview.  She never responded.  I do understand that they may not have felt that I was a good match for their position.  My only surprise was that they didn't provide the courtesy of at least sending me a \"canned thanks but no thanks letter.\"  Goodness knows that I've sent many of those myself.  So, my only suggestion is that they do better follow up just as a matter of professional courtesy.", "Interview Questions": "N/A"}, {"date": "24 Aug 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Aug 2015", "Interview Descriptions": "After applying online, I was called for an interview 1 week later. I met with two individuals who were hiring managers I would assume, they introduced themselves by name, not title. After going into a conference room, they both had my resume and a list of interview questions. They asked me three questions, asked if I had any questions, which I asked two. My impression was a substandard interview process and snide attitudes. Very uncomfortable and offstandish atmosphere here. I would not work here if they offered me the position.", "Interview Questions": "Do you think you can handle working here?"}], [{"date": "19 Aug 2015", "title": "Clinical Research Coordinator I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in May 2015", "Interview Descriptions": "i applied online, I was contacted by the HR department who took a phone interview that went smoothly , they told me that they would contact me in 2 weeks but i heard from them in 1 month, on my second interview my interviewers didn't seem very interested in me, they were asking questions half halfheartedly without eye contact and in low voices. i was informed 2 weeks later that they were not accepting me.", "Interview Questions": "typical questions."}, {"date": "15 Apr 2015", "title": "Program Coordinator - Cancer Center Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "The interview itself was good, the manager who I interviewed with was very nice and thoughtful. After each interview though, everyone was unresponsive. It took three months to find out if I had gotten the job or not, and through out that time period i emailed 3 times with no response. This seems like a common trend with Medical College, and based on the experience I had and how long it took (applied in September, first interview February, declined April), this has deferred me from wanting to apply to other positions at medical college. I would advise planning on waiting forever if you are serious about getting a position here. The interview process is very disappointing.", "Interview Questions": "N/A"}, {"date": "23 Jun 2015", "title": "Clinical Research Coordinator I Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Apr 2015", "Interview Descriptions": "First you submit your application online. Then it takes 2-3 months for the Human Resources department to get back to you. By then you've already forgotten that you applied. HR does their initial interview with you then forwards you on to the actual department. The department will call you in and have you meet one on one with the manager(s). It is a long process- much, much too long.", "Interview Questions": "How would you handle a situation in which a patient seemed overwhelmed?"}, {"date": "15 Nov 2015", "title": "Administrative Assistant III Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Mar 2015", "Interview Descriptions": "Very confusing once I got to the department I was going to work in.  It took over a month and a half to be hired and the start date was changed multiple times because of lack of people to train.  HR process was very organized and did an excellent job explaining the position and the benefits that the college offers.  The tour was quite impressive and the campus is beautiful.", "Interview Questions": "Why do I want to work there"}, {"date": "13 Apr 2015", "title": "Administrative Assistant III Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Feb 2015", "Interview Descriptions": "There was a computer skills test on the Microsoft Office Suite and traditional interviews with HR as well as the immediate supervisor and co-workers. Both the individuals in HR and in the office where the job was located were very professional and polite. The only drawback was that the decision-making process seemed to take a long time. I did not hear back for 6-8 weeks, I think. That said, everyone I spoke with was friendly and kind.  I think it would be a great place. to work.", "Interview Questions": "How did you use initiative to solve a problem at work?"}, {"date": "8 Dec 2014", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Medical College of Wisconsin (Milwaukee, WI)", "Interview Descriptions": "Interviewed with Manager and Administrator for about 20 minutes each. The Administrator took a non urgent phone call in the middle of the interview which I thought was extremely rude.", "Interview Questions": "What can you bring for us?"}, {"date": "20 Nov 2014", "title": "Division Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "I applied in June and had a phone interview within a few weeks. I never heard back until October when they called me in for a 6 hour interview. I got interviewed by 11 different people over the course of the day. Overall, the questions were pretty standard. There was nothing surprising if you've prepared. The interviewers all seemed like they'd be good coworkers, they all seemed passionate about their jobs and seemed like they enjoyed their work.\r\n\r\nThe position reported to 3 (or maybe 4...I'm not even sure because it was so convoluted) different people who all had competing interests, and all 3 (or 4) expressed their interests were the most crucial. I suppose that's human nature, and I would place the negative connotations from that on the structure and not the individuals. Of the 11 interviewers, there were different levels of desire outwardly expressed about changing the structure- I suspect it won't change any time soon. There seemed to be quite a disconnect from one functional area to the next. Each interviewer explained the administrator role in a completely different way, even to the point that I looked stupid as I repeated earlier explanations. At one point an interviewer literally laughed as I repeated what was told to me. I don't say this to be negative at all- just an honest assessment of what I saw. No job is going to be all sunshine and rainbows and this one is no different.\r\n\r\nIn so far as an interview can be a \"positive\" or \"enjoyable\" experience, I'd say MCW did pretty well. I didn't leave with any reservations about working with, or for, any of the people I met. I think I would have enjoyed working there had they offered me a position.", "Interview Questions": "How would you rally \"resistant\" troops around a common goal."}, {"date": "23 Jul 2015", "title": "Administrative Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jul 2014", "Interview Descriptions": "HR will conduct their own interview along with testing (word, excel, powerpoint, outlook). Once this interview is complete they will contact regarding meeting with the department. They will set up the interview and the process will take about 4 hours depending on how many people you need to interview with.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "26 May 2018", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical College of Wisconsin (Waukesha, WI) in Jun 2014", "Interview Descriptions": "Generally, the interviewers are polite and nice. However, I was frequently asked: Why did you come to America? \r\n\r\nPersonally I feel this question offensive because it is completely not relevant to the scope of work and the interviewers didn't even realize it. It's non of your business why I came here.\r\n\r\nSo you can have a taste on the working environment here for foreign workers.", "Interview Questions": "Data structure and common databases."}], [{"date": "16 Nov 2017", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jun 2014", "Interview Descriptions": "Phone interview fairly descriptive of position and salary. In person interview was not intimidating. Friendly and direct, genuinely interested in developing relationships. Sought personable conversation throughout interview. Post interview follow up fairly quick.", "Interview Questions": "What are your hobbies"}, {"date": "9 May 2014", "title": "Administrative Assistant III Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Medical College of Wisconsin", "Interview Descriptions": "Very impressed with interview process, casual. Interview gave very accurate description of job duties and introduced me to co-workers I would be working with most directly. Gave very accurate directions to location and met me at front desk. Took time to answer all my questions and was very pleasant.", "Interview Questions": "N/A"}, {"date": "20 Feb 2014", "title": "Financial Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Medical College of Wisconsin in Dec 2013", "Interview Descriptions": "They really drag their feet on initial interview and will take a while to set it up. Your basic lame HR questions i.e. name your biggest weakness. The questions seem to show they're looking for good actors not employees. Had an interviewer check his cell phone when I was talking. Had them tell me they'd let me know either way on the job within 2 weeks; ended up finding out on my own and then got an email 3 months later that I didn't get the job.", "Interview Questions": "Name a time you've had issues with a manager?"}, {"date": "8 Jan 2018", "title": "IS Project Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Nov 2013", "Interview Descriptions": "Initial phone screen by HR, then 4-hour on site interview with IS and client departments.  The onsite interview consisted of typical technical project management questions and behavioral/cultural fit questions.  It was of average difficulty.  A presentation was not required.", "Interview Questions": "Typical behavioral and technical questions for IS project manager"}, {"date": "1 Aug 2013", "title": "Administrative Assistant II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "One interview. Completed Microsoft Word, PowerPoint, Outlook, and Excel testing then met with HR. 2 hour long process total.", "Interview Questions": "\"Why do you think this job would be a good fit for you?\" No challenging questions. "}, {"date": "7 Mar 2014", "title": "Research Scientist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jul 2013", "Interview Descriptions": "The hiring process was extended partly because they were screening a lot of candidates. The interviewers were pleasant and friendly. I got adequate information when I asked questions. They notified me well in advance for interviews.", "Interview Questions": "Unexpected question was why how I would ask questions when I do not quite follow the conversions with my boss"}, {"date": "25 Jun 2015", "title": "Information Security Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jun 2013", "Interview Descriptions": "It was very long it took several months. I applied in Feb and did not get a call back until June. I had my phone interview and then I did not here back from that for a additional 2 weeks.", "Interview Questions": "the questions were normal"}, {"date": "15 Apr 2013", "title": "Bio Statistician Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Medical College of Wisconsin", "Interview Descriptions": "Applied online. There is a HR representative that arrange a time to talk with the Senior HR. During the phone interview, most questions are behavior questions.", "Interview Questions": "What will you bring to us except the Mathematical/Statistical skills."}, {"date": "8 Apr 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Apr 2013", "Interview Descriptions": "Behavior questions\r\n1. How do you react in a certain situation. \r\n2. What do you do when you have a conflict with team members? How do you solve the dispute? \r\n3. What do you do if you have a approaching deadline, multitasking skills? \r\n\r\nSpecial knowledge, career planning/goals.", "Interview Questions": "N/A"}, {"date": "23 Feb 2013", "title": "Human Resources Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI)", "Interview Descriptions": "Initial interview with Employment, then interviewed with manager of position, director of area, and then 3 interviews with managers of various areas would support.  In total 6 interviews.", "Interview Questions": "The initial interview with the recruiter and the hiring manager were very balanced and pleasant experiences.  The final interviews with the Director of HR and then managers of various area that the position would support focused on how political the environment is, as well as, in my case, their preconceived assumptions about my employer.  My employer is, by far, the largest employer in the health field in the area and each one of the final 4 interviews made me feel like I was the on the receiving end of their assumptive viewpoints.  "}], [{"date": "25 Jul 2017", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jan 2013", "Interview Descriptions": "The interview process is grueling in that the automated HR application system doesn't let anyone through unless you know someone on the inside. Having passed the first barrier of a friend telling a manager to force HR to select my application for an interview I was called. I asked if I could meet my boss-to-be at 8 am, but she refused and said it had to be 9 am. I showed up and waited from 8 until 9 because of my car situation at the time. Then the person interviewing me wasn't there and had insisted I was an hour late. I honestly don't know why I accepted the job from someone I thought disorganized other than I thought the company had great opportunity for advancement. The interviewer decided to hire me but then HR's automated reference system sends emails to all the junkmail folders of your closest work partners who cannot find it to say you're good to go. It was stressful, impersonal, and I don't think it has changed any.", "Interview Questions": "All the questions were in the realm of prove that you're over-qualified yet desperate enough to do this job."}, {"date": "3 Dec 2012", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Oct 2012", "Interview Descriptions": "Very unprofessional. \r\n\r\nWas called on Wed afternoon. The only slot the had was the next day at 3pm. \r\n\r\nMade it work. Had a 3 person interview. 2 admins nd head of department. 2 admin dint provide anything useful as it was a financial analyst interview. \r\n\r\nReceived email week later saying hey went with other candidate. \r\n\r\nI askedth HR person that found me for some constructive criticism so could improve. Never got a response.", "Interview Questions": "Can you handle a lot of red tape and drawn out long approval processes? "}, {"date": "24 Jun 2015", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Sept 2012", "Interview Descriptions": "Initial interview with HR, once that is was approved I then met with the disease team managers. I first met with the business administration manager who gave me a overview of how the facility was ran, how they started, where they are, and where they plan on going.  I then met with the clinical research managers.  This is 3 vs. 1 interview where you are interviewed by several managers within the CTO.  Basic interview type questions that you can find online anywhere.  The whole process took around 3-4 months.", "Interview Questions": "Typical questions, explain a time where you had to work with someone you didn't like?"}, {"date": "7 Aug 2014", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin in Jun 2012", "Interview Descriptions": "Plan on taking months...HR start the process but it is the dept that makes the decision.  It's all a joke\r\nYou can apply for different jobs but they all take months", "Interview Questions": "Why do you want to work here...you will understand once working there"}, {"date": "25 Aug 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Medical College of Wisconsin in Jun 2012", "Interview Descriptions": "Presented scientific research in front of the whole research group, and then met specific people in the lab for one-on-one interviews. People were very friendly, and open to all questions.", "Interview Questions": "nothing unexpected"}, {"date": "25 Mar 2012", "title": "Lab Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Feb 2012", "Interview Descriptions": "A difficult interview because there were a few of technical questions asked which I hadn't been expecting. The interview took about an hour, and the interviewer was generally very nice and helpful (happy to answer questions). Unfortunately, I wasn't offered the position and they just sent me a standard email to let me know, so no feedback was given.", "Interview Questions": "Can you name the bones in a human wrist?"}, {"date": "27 Jan 2013", "title": "Applications Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Medical College of Wisconsin (Wauwatosa, WI) in Aug 2011", "Interview Descriptions": "Basic questions at the start about object oriented programming, PHP, databases. After the phone interview was a basic programming skills test and some questions about PHP.\r\n\r\nThey don't really have any big challenges since they have a small website that doesn't really do anything too complicated - so there are no scalability challenges.\r\n\r\nI did get the feeling that the IT department in general wasn't really appreciated at this place and they were just a necessary part of the machine.\r\n\r\nI did get a PHP job that is one of the most challenging ones possible, so it ended up being a very good thing that they didn't want me.", "Interview Questions": "Nothing really too hard. They didn't ask anything difficult except for some questions about PHP experience I didn't have, although I had some PHP experience that was far more advanced than what they use. "}, {"date": "5 Sept 2012", "title": "Reimbursement Analyst II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jul 2011", "Interview Descriptions": "Very down to earth, genuine people in HR.", "Interview Questions": "Name a time where you made a mistake that affected yours or someone elses job(s), and what did you do about it."}, {"date": "26 Nov 2013", "title": "RF Design Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Apr 2011", "Interview Descriptions": "A call from the HR followed by technical phone interview and then a final onsite interview", "Interview Questions": "Some resarch related question I do not remember"}, {"date": "1 Jan 2016", "title": "Associate Business Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jan 2011", "Interview Descriptions": "Multiple rounds of interview and a logical written test . Prepare for one full day of interviews , with a number of people from different departments and various levels of seniority . HR round is mostly in the phone . Face to face is mainly with the peers and supervisor", "Interview Questions": "Why are  you leaving big current job ?\r\nWhat are your strength and weaknesses ?\r\nDid you ever have argument with your boss ?"}], [{"date": "4 Mar 2011", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Dec 2010", "Interview Descriptions": "The position I applied for was a middle-management administrative position.\r\n\r\nPositives: Judging from most of the people I met with, the physical work environment, the salary and benefits, and the location of MCW, I think it would be a nice place to work.\r\n\r\nNegatives:  It was the most exhaustive interview process that I have ever encountered.  I interviewed with 14 people over the course of 5 visits.  However, I only met with the hiring manager once, for 30 minutes, and that was not until the 4th visit.  Most of the interviews were with HR and other administrators (all of whom were very pleasant people).  I felt that everyone involved in the process took it seriously, however there seemed to be something going on between the hiring manager and the people responsible for finding candidates and setting up interviews.  In addition, although the job description was fairly thorough, there was a pretty severe disconnect between the job description and the understandings of the people I spoke with--including the hiring manager--about what the main responsibilities of the position were.  All of this on the backdrop of the politics, egos, and territoriality of a large academic medical center undergoing rapid change.", "Interview Questions": "Why have you worked for so many different companies in the past 15 years?"}, {"date": "12 Aug 2011", "title": "Clinical Research Coordinator I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Aug 2010", "Interview Descriptions": "The interview process with HR went perfectly fine - you meet with HR first, then they pass their notes onto the corresponding hiring managers.   The hiring manager who interviewed me though was very pushy and controlling.  He would not let me give a 2 weeks notice at my former employer .  I should have seen this as a huge red flag, but I needed a job in this city as I was relocating  so I accepted anyways.   HR needs to take more control in the interview/hiring process and ensure managers cannot coarse new employees into a guilt trip and not giving the needed 2 or 4 week notice to their previous employers.", "Interview Questions": "All the questions are behavior based - they simply ask for a time this happened and how did you deal with it, or when did you manage a difficult task and how did you get through it. "}, {"date": "17 May 2011", "title": "Research Technologist I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Jul 2010", "Interview Descriptions": "I was initially contacted by a admin assistant within the department I applied for an interview. I then had one face-to-face interview with 3 different P.I.'s and a group of the laboratory personell that I would be working with. The interview lasted approximately 3 hours. It is very important to research the specific position. I asked many questions about the work they were doing and how it affected the medical community. The work culture is mostly relaxed, but efficient.", "Interview Questions": "Do you have any plans for the future?"}, {"date": "6 Dec 2013", "title": "Clinical Research Coordinator III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Sept 2009", "Interview Descriptions": "Initial phone interview with HR. In person interview with HR and primary investigator. 2nd in person interview with primary investigator and research team.", "Interview Questions": "HR made me take a typing test. It was an HR  mistake and the primary investigator apologized, but it put me in the hot seat for a minute. Haven't done one of those since 7th grade."}, {"date": "4 Aug 2012", "title": "Systems Specialist III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Medical College of Wisconsin (Milwaukee, WI) in Dec 2008", "Interview Descriptions": "I first met face-to-face with HR to see f I was a good fit for the position.  Within a few days I was asked to return to meet with two department representatives with the opening.  My interview consisted of 2 hours of questions and answers from the department administrator and the person whom I would be replacing.   A few days later I was asked to come back to meet with the Dean in the office where I would be working.  So I met with the Dean and by the time I returned home the administrator called me back to offer me the job.  I started 2 weeks later.", "Interview Questions": "Probably \"What is your greatest weakness?\""}]]