[[{"date": "31 May 2023", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Michael Garron Hospital (Toronto, ON) in May 2023", "Interview Descriptions": "Overall the interview was a pretty simple one, it was a virtual interview. I had met the manager the day prior at Michael garrons career fair and had given her my resume. She requested an interview; it was short; about 15 minutes.", "Interview Questions": "Tell me about a time where you had a conflict with a coworker, and how did you deal with it."}, {"date": "1 Feb 2023", "title": "ITS Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Michael Garron Hospital", "Interview Descriptions": "expeGood rience overall - pretty much what you would expect an interview for this position to be. Questions revolve around training, communication, organization and time-management. Knowing a bit about systems and healthcare as well is helpful to fill in gaps and make answers better.", "Interview Questions": "N/A"}, {"date": "24 Feb 2023", "title": "RPN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 days. I interviewed at Michael Garron Hospital in Feb 2023", "Interview Descriptions": "Ist interview via zoom. 3 interviewers. Reviewed resume, discussed any additional certification (beyond CNO lisence) for the role, sfollowed by situational and time management questions related to the position. Each interviewer took turns asking questions. Some had to be written down as they were vast.", "Interview Questions": "Starting shift you are given patient load- 4 patients with different situations. What order would you prioritize your nursing care and rational why."}, {"date": "27 Jun 2022", "title": "Parient Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Michael Garron Hospital", "Interview Descriptions": "I applied online HR called after 1 month to set interview. Had interview with the manager and supervisor. I waited about 3 days for a xall and they got my reference. I waited another week for an offer.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Apr 2023", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Michael Garron Hospital (East York, ON) in Feb 2021", "Interview Descriptions": "Zoom call with hiring staff. Questions were straightforward and looked to understand your skillset and your personality. Weren't just application-type questions. Staff was kind and neutral. Quick to get back to you in relation to position.", "Interview Questions": "Describe a time when you faced a difficulty and how did you overcome it?"}, {"date": "23 Jan 2022", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Michael Garron Hospital (Toronto, ON) in Apr 2020", "Interview Descriptions": "Very comfortable, just prepare well and you should be fine. It's all basic interview questions, nothing technical. Make sure you have good problem-solving skills and highlight them in the interview.", "Interview Questions": "Tell me about yourself? \r\nWhat is an example of a time you had to think on your feet?"}, {"date": "27 Mar 2019", "title": "Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Michael Garron Hospital", "Interview Descriptions": "Received a call to come in for an interview after applying online. Panel interview with set questions. Explained the role and then asked the interview questions. Opportunity to ask questions after. Approximately an hour long.", "Interview Questions": "Background about yourself (i.e. education, previous experience, accomplishments); conflict management/communication questions and prioritization/delegation. "}, {"date": "7 Apr 2019", "title": "Medical Technologist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Michael Garron Hospital in Sept 2018", "Interview Descriptions": "Interview was conducted by a 6 people panel taking turns asking technical and behavioural style questions. The interview includes a 1 hour practical component as well regardless of the position applied for.", "Interview Questions": "Why are you the best candidate for this position? "}, {"date": "31 Oct 2017", "title": "RN W/Degree Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Michael Garron Hospital in Apr 2017", "Interview Descriptions": "Behaviour/situational questions. HR conducted interview with unit manager and coordinator. Received a call 3 weeks later saying I got the job. They were very nice during the interview and let me take my time answering questions.", "Interview Questions": "You walk into your patient's room and find them on the floor, what do you do?"}, {"date": "31 Mar 2018", "title": "Strategic Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Michael Garron Hospital (Toronto, ON) in Mar 2017", "Interview Descriptions": "Combination of personal and behavioural questions\r\nVery quick turn around after interview\r\nConversation based interview\"\r\nFriendly panel, 2:1\r\nCarried out at hospital with Supervisor and Alumni of School\r\nGreat work environment, overall loved working and interviewing there", "Interview Questions": "How do you handle stress?"}], [{"date": "18 Oct 2019", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Michael Garron Hospital (Toronto, ON) in Feb 2017", "Interview Descriptions": "Must apply to job postings online. Hiring manager will contact you either by phone or e-mail to request an interview. You will also need to do a computer skills, literacy and type speed test. If you get a job offer and accept, it is standard hospital regulations to get a bunch of shots, blood test and TB testing done. This will be the part that takes the longest.", "Interview Questions": "Very standard questions... \"How did you hear about us?\" \"What do you know about Michael Garron Hospital?\" \"Have you ever been involved in a customer experience related conflict and if so, how did you address it?\" (If you haven't, then you have to talk about what you WOULD do) etc."}, {"date": "16 Sept 2016", "title": "Human Resources Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Michael Garron Hospital (Toronto, ON) in Jul 2016", "Interview Descriptions": "Panel interview with 3 individuals -- 2 were at the manager level. It was round table type of questions, with a mixture of behavioral and situational questions. Some questions were difficult, but mostly they were straight forward and had to do with customer service. Had to do a typing, excel, and word quiz at the end. Overall interview took 3 hours, so it was quite long.", "Interview Questions": "When is it better to use written communication over verbal?"}, {"date": "31 Oct 2016", "title": "Social Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Michael Garron Hospital (Toronto, ON) in Apr 2014", "Interview Descriptions": "Call for an interview. 8 staff present at the interview - rotate asking questions. Questions related to the role, scenarios - what would you do if. Questions related to previous experience in a hospital setting.", "Interview Questions": "What is your understanding of client centred care?"}, {"date": "6 Oct 2015", "title": "Supervisr, Surgery Health Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Michael Garron Hospital in Sept 2013", "Interview Descriptions": "Initial phone interview advancing to a face-to-face interview.  Pleasant and open experience with a panel consisting of the Manager, HR representative, Supervisor and Nursing Practice Leader.  Excellent questions that pertained to the position.  Very professional with scripted questions to allow for fairness for all candidates.", "Interview Questions": "What makes you the best candidate for this position?"}]]