[[{"date": "20 Jun 2023", "title": "Recruiting Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of California - Office of the President (Oakland, CA) in May 2023", "Interview Descriptions": "I spoke with the recruiter, hiring manager and a couple members of the team. I heard from recruiter every step of the way. Unfortunately, I didn't get the position which I was bummed about. The team and position sounded amazing.", "Interview Questions": "Please tell us about background?"}, {"date": "17 Nov 2022", "title": "Health Career Connection Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of California - Office of the President (Oakland, CA)", "Interview Descriptions": "I was matched into UC Health internship program by the consulting company Health Career Connection. I was interviewed by one of the directors in the division and was asked a lot of general personal/character interview questions. Took a couple weeks to hear back. The interviewers and team members are super nice and love to respond to questions and follow up with questions about the experience you talk about.", "Interview Questions": "Speak about a time that you worked with a team to complete a goal. Tell us about yourself/career goals. Speak about a time when you went above and beyond."}, {"date": "19 Oct 2022", "title": "Sr. Business Systems Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of California - Office of the President", "Interview Descriptions": "There were two interviews. The first one was via phone - the robot 3 questions. The second interview was via Zoom with two managers. It was very short lasting 20 minutes.", "Interview Questions": "Please tell be about your last three positions"}, {"date": "20 Jul 2022", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of California - Office of the President", "Interview Descriptions": "The process moved quickly, the recruiter promised to follow up but did not provide any status updates. It was a panel interview with six people, it was over 90 minutes.  It felt excessive for the level of the role.", "Interview Questions": "The questions were very basic and repetitive. "}, {"date": "2 Jun 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of California - Office of the President", "Interview Descriptions": "It took months for HR to respond, months to set up multiple interviews and then 2 months to finalize. The process is so disorganized, and even the smallest counter offer required many approvals.", "Interview Questions": "Why do you want to work here ?"}, {"date": "14 Sept 2019", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of California - Office of the President", "Interview Descriptions": "The recruiter was awful. Pumping fear. Not selling the company at all. Made me feel like I should be privileged to work there. And made it sound like the CIO was royalty. Complete fail. I wouldn’t accept if they offered. I basically ended the interview and left.", "Interview Questions": "Panel: took turns reading a list of questions."}, {"date": "18 Jun 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of California - Office of the President (Oakland, CA) in Jun 2019", "Interview Descriptions": "Academic Affairs - phone call from HR. Applied in Mid April, Closed end of May, interviewed in mid June (email late Wed, for interview Th or Friday).  So very long process to get first interview. Interviewer confirmed late morning, a few hours before the interview and was late to the call, but went well. So last minute and with very little choice in terms of the first round (if you didn't get to that email that day, you might have missed your opportunity to interview). Next round was already scheduled in person several weeks out (with date already set), so that is also good. Issue- the role didn't have a payroll title or code, making it hard to know the seniority and hiring salary range going into the interview (very odd), but I asked in the interview and the interviewer gave me this information. It is an issue however- as if you don't ask you don't know if it is even what you are looking for (the JD's for UC roles tend to be very broad, making it hard to know the seniority level of the job).", "Interview Questions": "Various technical questions about ethics, choosing selection panels, blind review; then about how to avoid bias and encourage applications. "}, {"date": "6 May 2019", "title": "Operations Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of California - Office of the President", "Interview Descriptions": "There was a phone interview with the UC recruiter and an in person interview with 3 members of the investment team at the Office of the President in Oakland.  The interviews were fair and didn't give me far fetched scenarios to gameplan.", "Interview Questions": "I was asked to self rate my excel skills."}, {"date": "24 Apr 2020", "title": "Payroll Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of California - Office of the President (Riverside, CA) in Apr 2019", "Interview Descriptions": "It took about 3 months for the entire process. It was a good experience overall.  I have absolutely no complaints about the interview process. I would’ve taken it if I hadn’t accepted another position.", "Interview Questions": "What experience do I have that related to this position ?"}, {"date": "13 Feb 2019", "title": "UCal - Office of CIO Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 8 weeks. I interviewed at University of California - Office of the President (San Francisco, CA)", "Interview Descriptions": "Avoid UCal - Office of CIO.  I’m not happy because I never heard back from the interviewer or HR after my interview.  \n\nAlthough ghosting applicants may seem normal by today’s standards, ghosting reflects poorly on the hiring team.  I took a day off of work, traveled many miles and spent several days preparing for the interview.   This practice is extraordinarily unprofessional and arrogant!", "Interview Questions": "Tell me about yourself"}], [{"date": "16 Jul 2018", "title": "Data Conversion Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at University of California - Office of the President (San Francisco, CA) in Jul 2018", "Interview Descriptions": "Phone screen went well.  Panel was demeaning.  Did not accept that there were diff ways to accomplish task.  Looking for their ONE answer or you were discounted.  Shocked they needed 11 conversion developers since programs were complete and they were in phased impl.  Somebody us running a racket on UCOPS!", "Interview Questions": "Example of AE uou write"}, {"date": "12 Sept 2018", "title": "Cloud Infrastructure IT Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of California - Office of the President (San Jose, CA) in May 2018", "Interview Descriptions": "The phone call was about 30 minutes. They mainly asked questions based off your resume and some leadership questions. There were two people on the phone with one taking notes and both asking questions and follow up.", "Interview Questions": "If someone is not doing their work much like in the real world, what would you do to remedy it or to improve the situation? "}, {"date": "27 Aug 2018", "title": "Payroll Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of California - Office of the President (Riverside, CA) in Sept 2017", "Interview Descriptions": "Phone Interview - and then face to face after a week. Had to wait a month before background check was completed. Not a great final offer call experience since the manager offer was not up to my expectation after the talk with phone recruiter and no chance was given to negotiate.", "Interview Questions": "Tell us about your work attitude? How do you deal with co-workers that are not cooperative?"}, {"date": "23 Oct 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of California - Office of the President (Irvine, CA) in Aug 2017", "Interview Descriptions": "Takes about an hour. It is very low pressure, and understanding of your situation. They interview you in person after screening you through the phone a couple days before.", "Interview Questions": "How comfortable are you in an office setting?"}, {"date": "20 Dec 2016", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of California - Office of the President (Oakland, CA) in Oct 2016", "Interview Descriptions": "Initial interview process went well, and they hired me for a temporary position while they worked out the particulars on the permanent position. Their reasoning was that it's easier to get in doing temp, since their hiring process is so long and drawn out. I have been here nearly two months and haven't gotten an update about my permanent position status, even though I am aware that they have have a couple meetings to assess my status and job performance. As I am already fully integrated into the position, I do not understand what more there could be to deliberate.", "Interview Questions": "How do you respond to criticism or feedback?"}, {"date": "9 Jun 2016", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at University of California - Office of the President (Oakland, CA) in May 2016", "Interview Descriptions": "1st interview for brief interview to get to know recruiter and talk about the job opportunity (through video skype)\r\n2nd was with employer for more technical background, goals and applicable knowledge\r\n3rd interview was for more in-depth knowledge of performance and deeper acquaintance with employer about expectations", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "27 Apr 2016", "title": "Pre-Award Team Lead Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of California - Office of the President (Oakland, CA)", "Interview Descriptions": "I was contacted by phone and briefly answered/asked some generally questions about my experience and job at the time. I came in to meet with a manager for a 45min. interview and returned for a group interview which also ran approx. 45min. All of the interviewers were very friendly and responsive to any questions I had.", "Interview Questions": "How do you manage developing a plan for a project with different groups who each have their own unique interests?"}, {"date": "27 Oct 2015", "title": "Legal Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of California - Office of the President (Oakland, CA) in Aug 2015", "Interview Descriptions": "Tightly scripted group/ panel first round interview.  Five interviewers went around the table each asking a scripted question.  Only one or two of the interviewers dug in/followed up once an initial response was given.", "Interview Questions": "What would your last supervisor cite as your greatest weakness?"}, {"date": "3 Apr 2015", "title": "UC Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of California - Office of the President (Oakland, CA) in Mar 2015", "Interview Descriptions": "The interview process took 5 weeks. I had a phone interview with the manager for 40 minutes in which we discussed about my previous experiences and the job role I would be offered.\r\nSecond round was a group interview where panel of 4 people took my interview with all technical and functional related questions.", "Interview Questions": "I was asked about many technical questions from my technology and scenario based questions, also I was asked about why would I be hired"}, {"date": "29 Jan 2015", "title": "Research Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of California - Office of the President", "Interview Descriptions": "The interview process was congenial and clear. One data test--phone interview with three senior researchers--site visit. No offer becuase of potential misfit between their needs and my background. Seems to be a good place to work", "Interview Questions": "any thought on inequality in UC admission process?"}], [{"date": "10 Jun 2015", "title": "Technical Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of California - Office of the President (Oakland, CA) in Jan 2015", "Interview Descriptions": "There was a phone interview with a recruiter, followed by a phone call with my now-supervisor, and then an in-person interview with my supervisor and one other person. The interview was a \"round robin\" where the two people interviewing me asked questions, after which I got to ask a question.", "Interview Questions": "What is something you do now that you would like to never have to do again."}, {"date": "8 Feb 2015", "title": "User Experience Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of California - Office of the President (Oakland, CA) in Dec 2014", "Interview Descriptions": "Applied on the UofC website, received an email from the hiring manager that they wanted to interview and that if I was interested they would send me a test problem with 3 deliverables due within 24 hours. From there it was an in person interview with the full team where I completed 2 white boarding questions and then a 2nd round where they asked for another test problem completed. \r\n\r\nI was impressed with their interviewing process in the first round but by the 2nd round I felt they were not very competent or even understood what they were looking for. Asking for someone to take so much time to complete work they are not getting paid for without any indication of what they are looking for or how far into the process I was made me question their ability and clarity of what they were actually looking for. When they wrote to tell me they were not hiring me it was a very unprofessional email where they notified me that were not hiring anyone and re-opening the job for applicants. That is information does not help me and it solidified my opinion that they were unsure what they were doing during the whole process.", "Interview Questions": "The first round was a very good UX interview, they requested 3 deliverables including 2 personas, a document outlining your thought process on the problem and then 2 screens demonstrating an interaction. The 2nd round was unnecessary. Requesting another test problem completed without any details or context (which is what a UX designer needs) instead of an in person interview with zero explanation of where I was in the process."}, {"date": "3 Nov 2014", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of California - Office of the President", "Interview Descriptions": "Consisted of a 1.5-hour verbal interview with a panel of four current employees, including the hiring manager. It was very structured with typical interview questions. They went around the table and each asked a question from a long list. No follow-ups. Some paperwork involved with the background check, and all three references were checked.", "Interview Questions": "all questions were fairly typical"}, {"date": "26 Feb 2015", "title": "User Experience Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of California - Office of the President in Nov 2014", "Interview Descriptions": "I applied online through a very painful application process which took a very long time to complete--very institutional. Then there was a phone interview with an HR person which was okay. Passing that hurtle, I was invited in for a one-hour in-office group interview, and then finishing a 24-hour design test.", "Interview Questions": "The group interview felt a little tense. One or two of the questions were a bit rude, unless this was some type of emotional test, which seemed unfriendly. The UX test later was about a restaurant, which was totally off-topic for an educational institution. Never received any follow-up status about the position, which was also rude."}, {"date": "6 Mar 2014", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of California - Office of the President (Oakland, CA)", "Interview Descriptions": "Interviews are standard alternating questions between interviewers. My interviewers were looking for the \"cookie cutter\" responses with the right \"hot words\"", "Interview Questions": "If you are having a problem with a co-worker how would you resolve the issue"}, {"date": "30 Jun 2014", "title": "Technology/Strategic Architect Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at University of California - Office of the President (Oakland, CA) in Feb 2013", "Interview Descriptions": "After vetting, recruiter set up a 30-minute interview with the HM, who spoke at me for 45 minutes straight, barely fielding any questions. Despite that, after interrupting several times to agree with his perspective and offer a few experiences that resonated, I somehow went in for exruciating panel", "Interview Questions": "Solve a problem with zero prep-time on the whiteboard where apparently the \"right answer: was a solution they had already sold to the business/client, and thus, was the only right answer."}, {"date": "27 May 2014", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of California - Office of the President (Oakland, CA) in Sept 2012", "Interview Descriptions": "Fast and easy. HR was easy to get along with and turnaround time was about 2 days. Background check was done extremely fast. Make sure you input all words from the job description into your resume. They scan resumes to match the job description/", "Interview Questions": "All questions are under the HR page of the UCOP website."}, {"date": "20 Aug 2015", "title": "Customer Service Representative I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of California - Office of the President (Oakland, CA) in Aug 2012", "Interview Descriptions": "You apply online, received a phone interview (screen), if you passed that you came in for a group/panel interview and have to do a written sample to show your writing skills. If they like you, you'll receive a phone call back then an offer letter in the mail.", "Interview Questions": "Tell us about a time when you had to deal with an irate customer and how you handled this. "}, {"date": "17 Jul 2015", "title": "Assistant Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of California - Office of the President (Oakland, CA) in Nov 2011", "Interview Descriptions": "Resume found on Craigslist. Contacted by one of the researchers at the UARP who needed assistance. Was then referred to a different researcher for a positions that needed bac-kfilling due to maternity leave. Then three face-to-face.", "Interview Questions": "Why is it you want to take this position."}, {"date": "3 Jun 2015", "title": "Legal Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of California - Office of the President (Oakland, CA) in Apr 2011", "Interview Descriptions": "The interview process was by panel first and second rounds.  It takes a few months overall as a skills assessment is done first before you move to the first round of interviews.  Both attorneys and support staff will be present on the panel and the panels are no more than 5 people typically.  Interviews are difficult and challenging no matter how well you're prepared and particularly if you really want the position.  It's best to bring your a-game each time, smile so you appear friendly and ask questions so you come across as interested in the position and not simply a paycheck.", "Interview Questions": "How do you stay organized to meet deadlines?"}], [{"date": "15 Jul 2015", "title": "Director, Functional Area Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 months. I interviewed at University of California - Office of the President (Oakland, CA) in Mar 2011", "Interview Descriptions": "Extremely lengthy, lasting months and hearing nothing for very long periods of time. Very detailed interviews by committee. Many questions in the interview were not relevant to the position, to the factors that influence this public employer. No idea why some of those people were on the interview committee. In the end it seemed like perhaps the candidate(s) who were still available were the ones who had few other options", "Interview Questions": "A hypothetical open ended question, one of those out of the handbook, \"how would you handle...\" for a situation in which they wanted to hear an answer (\"instant dismissal!\") which would have violated their own policies."}, {"date": "10 Jun 2014", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of California - Office of the President (Oakland, CA) in May 2010", "Interview Descriptions": "Started with a phone interview with a member of the panel.  Next I had a panel interview with several staff members from across the organization.  The final interview was with the supervisor.", "Interview Questions": "Tell us about a time you made a mistake or chose the wrong path.  How did you know you were on the wrong path?  How did you resolve the situation?"}, {"date": "29 Sept 2013", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of California - Office of the President (Oakland, CA) in Jun 2009", "Interview Descriptions": "Excellent phone and written communications from the perspective employer. Impressed by the offices and how closely all levels of the office work with each other. The wait for a job offer and salary offer, however, can be excruciatingly long. As a state agency, there are many layers that the hiring manager must go through in order to make that offer.", "Interview Questions": "None. The questions were all very straightforward for the analyst position (business analyst, not technical)."}]][[{"date": "20 Jun 2023", "title": "Recruiting Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of California - Office of the President (Oakland, CA) in May 2023", "Interview Descriptions": "I spoke with the recruiter, hiring manager and a couple members of the team. I heard from recruiter every step of the way. Unfortunately, I didn't get the position which I was bummed about. The team and position sounded amazing.", "Interview Questions": "Please tell us about background?"}, {"date": "17 Nov 2022", "title": "Health Career Connection Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of California - Office of the President (Oakland, CA)", "Interview Descriptions": "I was matched into UC Health internship program by the consulting company Health Career Connection. I was interviewed by one of the directors in the division and was asked a lot of general personal/character interview questions. Took a couple weeks to hear back. The interviewers and team members are super nice and love to respond to questions and follow up with questions about the experience you talk about.", "Interview Questions": "Speak about a time that you worked with a team to complete a goal. Tell us about yourself/career goals. Speak about a time when you went above and beyond."}, {"date": "19 Oct 2022", "title": "Sr. Business Systems Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of California - Office of the President", "Interview Descriptions": "There were two interviews. The first one was via phone - the robot 3 questions. The second interview was via Zoom with two managers. It was very short lasting 20 minutes.", "Interview Questions": "Please tell be about your last three positions"}, {"date": "20 Jul 2022", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of California - Office of the President", "Interview Descriptions": "The process moved quickly, the recruiter promised to follow up but did not provide any status updates. It was a panel interview with six people, it was over 90 minutes.  It felt excessive for the level of the role.", "Interview Questions": "The questions were very basic and repetitive. "}, {"date": "2 Jun 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of California - Office of the President", "Interview Descriptions": "It took months for HR to respond, months to set up multiple interviews and then 2 months to finalize. The process is so disorganized, and even the smallest counter offer required many approvals.", "Interview Questions": "Why do you want to work here ?"}, {"date": "14 Sept 2019", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of California - Office of the President", "Interview Descriptions": "The recruiter was awful. Pumping fear. Not selling the company at all. Made me feel like I should be privileged to work there. And made it sound like the CIO was royalty. Complete fail. I wouldn’t accept if they offered. I basically ended the interview and left.", "Interview Questions": "Panel: took turns reading a list of questions."}, {"date": "18 Jun 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of California - Office of the President (Oakland, CA) in Jun 2019", "Interview Descriptions": "Academic Affairs - phone call from HR. Applied in Mid April, Closed end of May, interviewed in mid June (email late Wed, for interview Th or Friday).  So very long process to get first interview. Interviewer confirmed late morning, a few hours before the interview and was late to the call, but went well. So last minute and with very little choice in terms of the first round (if you didn't get to that email that day, you might have missed your opportunity to interview). Next round was already scheduled in person several weeks out (with date already set), so that is also good. Issue- the role didn't have a payroll title or code, making it hard to know the seniority and hiring salary range going into the interview (very odd), but I asked in the interview and the interviewer gave me this information. It is an issue however- as if you don't ask you don't know if it is even what you are looking for (the JD's for UC roles tend to be very broad, making it hard to know the seniority level of the job).", "Interview Questions": "Various technical questions about ethics, choosing selection panels, blind review; then about how to avoid bias and encourage applications. "}, {"date": "6 May 2019", "title": "Operations Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of California - Office of the President", "Interview Descriptions": "There was a phone interview with the UC recruiter and an in person interview with 3 members of the investment team at the Office of the President in Oakland.  The interviews were fair and didn't give me far fetched scenarios to gameplan.", "Interview Questions": "I was asked to self rate my excel skills."}, {"date": "24 Apr 2020", "title": "Payroll Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of California - Office of the President (Riverside, CA) in Apr 2019", "Interview Descriptions": "It took about 3 months for the entire process. It was a good experience overall.  I have absolutely no complaints about the interview process. I would’ve taken it if I hadn’t accepted another position.", "Interview Questions": "What experience do I have that related to this position ?"}, {"date": "13 Feb 2019", "title": "UCal - Office of CIO Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 8 weeks. I interviewed at University of California - Office of the President (San Francisco, CA)", "Interview Descriptions": "Avoid UCal - Office of CIO.  I’m not happy because I never heard back from the interviewer or HR after my interview.  \n\nAlthough ghosting applicants may seem normal by today’s standards, ghosting reflects poorly on the hiring team.  I took a day off of work, traveled many miles and spent several days preparing for the interview.   This practice is extraordinarily unprofessional and arrogant!", "Interview Questions": "Tell me about yourself"}], [{"date": "16 Jul 2018", "title": "Data Conversion Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at University of California - Office of the President (San Francisco, CA) in Jul 2018", "Interview Descriptions": "Phone screen went well.  Panel was demeaning.  Did not accept that there were diff ways to accomplish task.  Looking for their ONE answer or you were discounted.  Shocked they needed 11 conversion developers since programs were complete and they were in phased impl.  Somebody us running a racket on UCOPS!", "Interview Questions": "Example of AE uou write"}, {"date": "12 Sept 2018", "title": "Cloud Infrastructure IT Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of California - Office of the President (San Jose, CA) in May 2018", "Interview Descriptions": "The phone call was about 30 minutes. They mainly asked questions based off your resume and some leadership questions. There were two people on the phone with one taking notes and both asking questions and follow up.", "Interview Questions": "If someone is not doing their work much like in the real world, what would you do to remedy it or to improve the situation? "}, {"date": "27 Aug 2018", "title": "Payroll Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of California - Office of the President (Riverside, CA) in Sept 2017", "Interview Descriptions": "Phone Interview - and then face to face after a week. Had to wait a month before background check was completed. Not a great final offer call experience since the manager offer was not up to my expectation after the talk with phone recruiter and no chance was given to negotiate.", "Interview Questions": "Tell us about your work attitude? How do you deal with co-workers that are not cooperative?"}, {"date": "23 Oct 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of California - Office of the President (Irvine, CA) in Aug 2017", "Interview Descriptions": "Takes about an hour. It is very low pressure, and understanding of your situation. They interview you in person after screening you through the phone a couple days before.", "Interview Questions": "How comfortable are you in an office setting?"}, {"date": "20 Dec 2016", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of California - Office of the President (Oakland, CA) in Oct 2016", "Interview Descriptions": "Initial interview process went well, and they hired me for a temporary position while they worked out the particulars on the permanent position. Their reasoning was that it's easier to get in doing temp, since their hiring process is so long and drawn out. I have been here nearly two months and haven't gotten an update about my permanent position status, even though I am aware that they have have a couple meetings to assess my status and job performance. As I am already fully integrated into the position, I do not understand what more there could be to deliberate.", "Interview Questions": "How do you respond to criticism or feedback?"}, {"date": "9 Jun 2016", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at University of California - Office of the President (Oakland, CA) in May 2016", "Interview Descriptions": "1st interview for brief interview to get to know recruiter and talk about the job opportunity (through video skype)\r\n2nd was with employer for more technical background, goals and applicable knowledge\r\n3rd interview was for more in-depth knowledge of performance and deeper acquaintance with employer about expectations", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "27 Apr 2016", "title": "Pre-Award Team Lead Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of California - Office of the President (Oakland, CA)", "Interview Descriptions": "I was contacted by phone and briefly answered/asked some generally questions about my experience and job at the time. I came in to meet with a manager for a 45min. interview and returned for a group interview which also ran approx. 45min. All of the interviewers were very friendly and responsive to any questions I had.", "Interview Questions": "How do you manage developing a plan for a project with different groups who each have their own unique interests?"}, {"date": "27 Oct 2015", "title": "Legal Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of California - Office of the President (Oakland, CA) in Aug 2015", "Interview Descriptions": "Tightly scripted group/ panel first round interview.  Five interviewers went around the table each asking a scripted question.  Only one or two of the interviewers dug in/followed up once an initial response was given.", "Interview Questions": "What would your last supervisor cite as your greatest weakness?"}, {"date": "3 Apr 2015", "title": "UC Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of California - Office of the President (Oakland, CA) in Mar 2015", "Interview Descriptions": "The interview process took 5 weeks. I had a phone interview with the manager for 40 minutes in which we discussed about my previous experiences and the job role I would be offered.\r\nSecond round was a group interview where panel of 4 people took my interview with all technical and functional related questions.", "Interview Questions": "I was asked about many technical questions from my technology and scenario based questions, also I was asked about why would I be hired"}, {"date": "29 Jan 2015", "title": "Research Analyst Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of California - Office of the President", "Interview Descriptions": "The interview process was congenial and clear. One data test--phone interview with three senior researchers--site visit. No offer becuase of potential misfit between their needs and my background. Seems to be a good place to work", "Interview Questions": "any thought on inequality in UC admission process?"}], [{"date": "10 Jun 2015", "title": "Technical Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of California - Office of the President (Oakland, CA) in Jan 2015", "Interview Descriptions": "There was a phone interview with a recruiter, followed by a phone call with my now-supervisor, and then an in-person interview with my supervisor and one other person. The interview was a \"round robin\" where the two people interviewing me asked questions, after which I got to ask a question.", "Interview Questions": "What is something you do now that you would like to never have to do again."}, {"date": "8 Feb 2015", "title": "User Experience Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of California - Office of the President (Oakland, CA) in Dec 2014", "Interview Descriptions": "Applied on the UofC website, received an email from the hiring manager that they wanted to interview and that if I was interested they would send me a test problem with 3 deliverables due within 24 hours. From there it was an in person interview with the full team where I completed 2 white boarding questions and then a 2nd round where they asked for another test problem completed. \r\n\r\nI was impressed with their interviewing process in the first round but by the 2nd round I felt they were not very competent or even understood what they were looking for. Asking for someone to take so much time to complete work they are not getting paid for without any indication of what they are looking for or how far into the process I was made me question their ability and clarity of what they were actually looking for. When they wrote to tell me they were not hiring me it was a very unprofessional email where they notified me that were not hiring anyone and re-opening the job for applicants. That is information does not help me and it solidified my opinion that they were unsure what they were doing during the whole process.", "Interview Questions": "The first round was a very good UX interview, they requested 3 deliverables including 2 personas, a document outlining your thought process on the problem and then 2 screens demonstrating an interaction. The 2nd round was unnecessary. Requesting another test problem completed without any details or context (which is what a UX designer needs) instead of an in person interview with zero explanation of where I was in the process."}, {"date": "3 Nov 2014", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of California - Office of the President", "Interview Descriptions": "Consisted of a 1.5-hour verbal interview with a panel of four current employees, including the hiring manager. It was very structured with typical interview questions. They went around the table and each asked a question from a long list. No follow-ups. Some paperwork involved with the background check, and all three references were checked.", "Interview Questions": "all questions were fairly typical"}, {"date": "26 Feb 2015", "title": "User Experience Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of California - Office of the President in Nov 2014", "Interview Descriptions": "I applied online through a very painful application process which took a very long time to complete--very institutional. Then there was a phone interview with an HR person which was okay. Passing that hurtle, I was invited in for a one-hour in-office group interview, and then finishing a 24-hour design test.", "Interview Questions": "The group interview felt a little tense. One or two of the questions were a bit rude, unless this was some type of emotional test, which seemed unfriendly. The UX test later was about a restaurant, which was totally off-topic for an educational institution. Never received any follow-up status about the position, which was also rude."}, {"date": "6 Mar 2014", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of California - Office of the President (Oakland, CA)", "Interview Descriptions": "Interviews are standard alternating questions between interviewers. My interviewers were looking for the \"cookie cutter\" responses with the right \"hot words\"", "Interview Questions": "If you are having a problem with a co-worker how would you resolve the issue"}, {"date": "30 Jun 2014", "title": "Technology/Strategic Architect Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at University of California - Office of the President (Oakland, CA) in Feb 2013", "Interview Descriptions": "After vetting, recruiter set up a 30-minute interview with the HM, who spoke at me for 45 minutes straight, barely fielding any questions. Despite that, after interrupting several times to agree with his perspective and offer a few experiences that resonated, I somehow went in for exruciating panel", "Interview Questions": "Solve a problem with zero prep-time on the whiteboard where apparently the \"right answer: was a solution they had already sold to the business/client, and thus, was the only right answer."}, {"date": "27 May 2014", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of California - Office of the President (Oakland, CA) in Sept 2012", "Interview Descriptions": "Fast and easy. HR was easy to get along with and turnaround time was about 2 days. Background check was done extremely fast. Make sure you input all words from the job description into your resume. They scan resumes to match the job description/", "Interview Questions": "All questions are under the HR page of the UCOP website."}, {"date": "20 Aug 2015", "title": "Customer Service Representative I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of California - Office of the President (Oakland, CA) in Aug 2012", "Interview Descriptions": "You apply online, received a phone interview (screen), if you passed that you came in for a group/panel interview and have to do a written sample to show your writing skills. If they like you, you'll receive a phone call back then an offer letter in the mail.", "Interview Questions": "Tell us about a time when you had to deal with an irate customer and how you handled this. "}, {"date": "17 Jul 2015", "title": "Assistant Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of California - Office of the President (Oakland, CA) in Nov 2011", "Interview Descriptions": "Resume found on Craigslist. Contacted by one of the researchers at the UARP who needed assistance. Was then referred to a different researcher for a positions that needed bac-kfilling due to maternity leave. Then three face-to-face.", "Interview Questions": "Why is it you want to take this position."}, {"date": "3 Jun 2015", "title": "Legal Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of California - Office of the President (Oakland, CA) in Apr 2011", "Interview Descriptions": "The interview process was by panel first and second rounds.  It takes a few months overall as a skills assessment is done first before you move to the first round of interviews.  Both attorneys and support staff will be present on the panel and the panels are no more than 5 people typically.  Interviews are difficult and challenging no matter how well you're prepared and particularly if you really want the position.  It's best to bring your a-game each time, smile so you appear friendly and ask questions so you come across as interested in the position and not simply a paycheck.", "Interview Questions": "How do you stay organized to meet deadlines?"}], [{"date": "15 Jul 2015", "title": "Director, Functional Area Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 months. I interviewed at University of California - Office of the President (Oakland, CA) in Mar 2011", "Interview Descriptions": "Extremely lengthy, lasting months and hearing nothing for very long periods of time. Very detailed interviews by committee. Many questions in the interview were not relevant to the position, to the factors that influence this public employer. No idea why some of those people were on the interview committee. In the end it seemed like perhaps the candidate(s) who were still available were the ones who had few other options", "Interview Questions": "A hypothetical open ended question, one of those out of the handbook, \"how would you handle...\" for a situation in which they wanted to hear an answer (\"instant dismissal!\") which would have violated their own policies."}, {"date": "10 Jun 2014", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of California - Office of the President (Oakland, CA) in May 2010", "Interview Descriptions": "Started with a phone interview with a member of the panel.  Next I had a panel interview with several staff members from across the organization.  The final interview was with the supervisor.", "Interview Questions": "Tell us about a time you made a mistake or chose the wrong path.  How did you know you were on the wrong path?  How did you resolve the situation?"}, {"date": "29 Sept 2013", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of California - Office of the President (Oakland, CA) in Jun 2009", "Interview Descriptions": "Excellent phone and written communications from the perspective employer. Impressed by the offices and how closely all levels of the office work with each other. The wait for a job offer and salary offer, however, can be excruciatingly long. As a state agency, there are many layers that the hiring manager must go through in order to make that offer.", "Interview Questions": "None. The questions were all very straightforward for the analyst position (business analyst, not technical)."}]]