[[{"date": "17 Apr 2023", "title": "IT Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Freeman Health System", "Interview Descriptions": "Be prepared for a lot of questions, and possibly a second interview. The process seems to take a long time. Generic interview questions are expected. Freeman doesn't pay their IT department very well.", "Interview Questions": "If you could choose any job if money was not an option, what would you do?"}, {"date": "28 Jan 2023", "title": "Dialysis Technician Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Freeman Health System (Joplin, MO) in Jan 2023", "Interview Descriptions": "Lesson learned: do not apply if no salary is posted, lol. Also know that Freeman's minimum wage is $15 an hour - do you perform skilled work, have certifications, or are educated? Because you probably deserve more than that! I applied and received a text from a recruiter to set up an interview shortly after. The interview was pretty standard, the director was pleasant enough, though I was asked to shadow some current dialysis techs for 30 to 45 minutes which I was not expecting. Still an interesting experience. I got a call from the recruiter while I was at work, by the time I was off it was late. I had to go in very early next morning so was working again when I got a text to call him back. I called him on lunch and heard nothing until I texted him the following afternoon that I left him a voice mail. He said he would call in a few minutes and promptly called an hour later. Normally I would be salty about this, but I just find it hilarious because dealing with this guy was a complete circus. He called and discussed wages last - offered $15 an hour. By the way, that is Freeman's MINIMUM wage, so I would be getting paid as much as a receptionist or housekeeper to perform skilled work in a specialized area that requires a year of training to become proficient. I countered and was told that that was all they could offer, but got a text literally two minutes after ending the call offering 45 cents more. Like... which is it, your facility is in dire need to save 45 cents or not? Note that this is after the director told me the minimum wage AND expressed that they hoped I would be making more than that. For $15 I could go work at Target or Walmart and not have to bear the responsibility that comes with working in healthcare. Or, I could work as an HR recruiter and probably earn a few more peanuts. So yeah - know your worth. A job being posted and unfilled for over a month is also probably a red flag.", "Interview Questions": "How do you feel about occasional projectile blood sprays?"}, {"date": "30 Oct 2022", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Freeman Health System", "Interview Descriptions": "Interview process was fairly easy with several DBI/PAR questions. I was already prepared with scenarios and it was a smooth process. I was only interviewed by the director of the department which also made it simple.", "Interview Questions": "Tell us about a time where you worked independently?"}, {"date": "23 Sept 2022", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Freeman Health System", "Interview Descriptions": "Set up via text message by HR. The interviewer was late and they did not ask much about my previous job experience just the pre-written questions they had laid out on a piece of paper.", "Interview Questions": "Basic scenario type questions, like previous experiences."}, {"date": "15 Feb 2022", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Freeman Health System (Joplin, MO)", "Interview Descriptions": "Initial interview with Department Administrator and then the main psychiatrist. A your of the unit was given and then questions were asked about how you handle stressful situations with patients and staff.", "Interview Questions": "How would you handle an irate patient?"}, {"date": "17 Dec 2021", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Freeman Health System", "Interview Descriptions": "The interview was merely a description of the position. It took almost 2 months to get a response back after initial interview. Yet, They are hiring for over 30 positions. Orientation was extremely negative. They described their culture like a family yet herded people through the onboarding process like cattle.", "Interview Questions": "I was not asked questions."}, {"date": "2 Sept 2021", "title": "Utility Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Freeman Health System (Joplin, MO)", "Interview Descriptions": "The interview process was enjoyable and straightforward.  The management team was easy to get along with. They were very professional about the interview. I was offered a job before the interview was over.", "Interview Questions": "They asked where I heard about the job."}, {"date": "13 May 2021", "title": "Medical Billing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Freeman Health System", "Interview Descriptions": "Was interviewed by two supervisors. One answered a phone call during the middle of the interview, was rude, and laughed at me. Not respectful in any sense. I would not want to work for someone like that. I told them in the interview after all this happened. So I never got an offer. Not upset about it.", "Interview Questions": "What are your strengths and weaknesses "}, {"date": "24 Jul 2021", "title": "OR Orderly Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Freeman Health System (Joplin, MO) in Mar 2021", "Interview Descriptions": "Overall not a bad experience with my interview per se, but there were several things that happened that left me unwilling to work here.\n\nDuring my initial interview, I talked with 2 people. One of them answered his phone twice - I imagine if this had been me, I would have been thrown in the reject pile immediately. The other interviewer and I had a nice interview with him gone, so I guess that's something. The job posting was also incorrect - it was listed as a PRN position, and the interviewers got irritated when I brought that up. They quickly said it was full time, not PRN, and I was also expected to take call.\n\nI thought the experience and pay would be better than my job at the time so I agreed to shadow. Honestly, everyone outside of HR seemed tired and miserable, like they hated their lives. I've worked in several area hospitals and have never seen people act the way they did at Freeman. I don't believe this is just this department or a COVID issue either - I noticed this same general attitude almost 5 years ago at an internship in another Freeman department. This is a cultural issue with Freeman in my opinion.\n\nAfter the interview and shadow experience I withdrew my application and applied elsewhere. Overall not a great experience. If the right position for the right pay opened I might be tempted to apply and work there, but that's only because I have a good reputation at other hospitals and know I would be hired back fast if things didn't work out.", "Interview Questions": "How would your coworkers describe you?"}, {"date": "25 Jan 2018", "title": "Care Support Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Freeman Health System (Joplin, MO) in Nov 2017", "Interview Descriptions": "I filled out an application online and was emailed by HR asking to set up an interview.  I arrived to HR and was taken to the hiring manager for my position. It was a pleasant experience.", "Interview Questions": "Basic nursing skills and prioritization questions. "}], [{"date": "5 Oct 2017", "title": "Urgent Care Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Freeman Health System (Joplin, MO) in Oct 2017", "Interview Descriptions": "Very easy.  The lady made me feel very comfortable. Questions were very easy to answer. She explained the details of the job clearly.  She went through every detail and answered questions I had.", "Interview Questions": "What do you like best about customer service? "}, {"date": "15 Sept 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Freeman Health System (Joplin, MO) in Jul 2017", "Interview Descriptions": "Interviews with director of the unit and 2 other staff members and felt the interview went well. Each of the members would ask different questions and then they described and showed me around the unit and they escorted me to the entrance after I thanked them for their time.", "Interview Questions": "How would deal with a difficult client?"}, {"date": "28 Jun 2017", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Freeman Health System (West Joplin, MO)", "Interview Descriptions": "I interviewed for various positions that I have held over the years within the system. Only one bad interview where I was asked innapropriate questions that were illegal. Peer interviewers are probably not always aware that asking someone if they have childcare available at all times is illegal", "Interview Questions": "How do you handle stressful situations. "}, {"date": "6 May 2019", "title": "Cash Receipt Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Freeman Health System (Joplin, MO) in Sept 2015", "Interview Descriptions": "Apply online, all communication goes through HR from the initial interview call all the way through the job offer. Interview held with managers and co-workers in the department. The interview lasted about 30 mins", "Interview Questions": "N/A"}, {"date": "24 Apr 2017", "title": "Critical Care RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Freeman Health System (Joplin, MO) in Mar 2015", "Interview Descriptions": "Applied directly to FHS through their website. Was contacted by Human Resources via email and phone. An interview by phone time was scheduled. The director of the unit I applied to interviewed me, asked about 5 questions, including why I want to work for Freeman Hospital. The phone call took about 10 min. Overall, it was a positive experience.", "Interview Questions": "Name a time you had to deal with a stressful situation"}, {"date": "4 Jun 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Freeman Health System", "Interview Descriptions": "Took a couple of interviews to get the position.  They use a peer interviewing process that is good in theory but sometimes I don't think everything is relayed to upper management.", "Interview Questions": "The questions were relevant to the job, not unexpected if you know your stuff."}, {"date": "26 Mar 2014", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Freeman Health System", "Interview Descriptions": "All applications have to be submitted thru HR, they are then sent on to the manager of the dept that is hiring. The manager then picks top candidates and HR will schedule an initial interview with the manager. There is often a second interview required with HR or a senior manager before an offer is made. The offer will come via HR.", "Interview Questions": "Not difficult, just review resume and experience and talked about job requirements"}, {"date": "27 Jun 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Freeman Health System (Joplin, MO) in Aug 2012", "Interview Descriptions": "Interviewed with 2 supervisors then with peer. After they made a decision I was called back by HR to take 2 tests for my position. I was then sent to Occumed for a physical and any Immunizations I needed plus a drug screening. After everything came back clean I was called for orientation.", "Interview Questions": "Why I wanted to work for Freeman?"}, {"date": "2 Jul 2011", "title": "Clinic Tech Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Freeman Health System (Joplin, MO) in Apr 2011", "Interview Descriptions": "I was contacted by Human Resources and scheduled an interview for the following week. When I arrived to the interview, I waited at least a half hour in the waiting area before I was taken back to the manager's office. I then spent about an hour hearing about how many people had quit recently because of some \"strong personalities\" in the office. I returned for a second interview 2 days later with a nurse practitioner, and it was a standard interview. I chose not to return for an interview with the physicians in the office.", "Interview Questions": "I was not asked questions. I spent the entire interview (about an hour) hearing about the office drama."}, {"date": "16 Aug 2011", "title": "Nonclinical Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at Freeman Health System (Joplin, MO) in Feb 2009", "Interview Descriptions": "Interviewed/screened with Recruiter who asked basic questions. Passed the recruiter screening, then interviewed with hiring manager. Asked specific questions to the job and asked my knowledge of the company. That went well, then did panel interview with the department (of about 7 or so). That went well, then did exercise pertinent to job duties. About a month after that I was offered the position.", "Interview Questions": "Tell me a time when you dealt with a difficult situation or multitasked. "}]]