[[{"date": "10 Jul 2023", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stevens Institute of Technology", "Interview Descriptions": "Interview process was relatively simple; general questions about how the instiute is the best fit for you and how you can contribute to the community. Specific questions about your topic of interest were asked on a separate interview with potential advisors", "Interview Questions": "Why is Stevens a good fit for you"}, {"date": "4 May 2023", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stevens Institute of Technology (Jersey City, NJ)", "Interview Descriptions": "During the hiring process, there are three interview rounds. The initial round serves as a screening, during which you have the opportunity to ask any relevant questions. The second round consists of three administrators, each asking five questions. Lastly, the final round involves an interview with the lead ID.", "Interview Questions": "What is your ID process?"}, {"date": "20 Mar 2023", "title": "Graduate Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stevens Institute of Technology", "Interview Descriptions": "Ask some basic java questions and then coding. Then I think it's important that their queries focus on the expression of your thoughts. Because it proves your communication skills as well as showing your thinking skills.", "Interview Questions": "What is microservices？ Advantages and disadvantages of microservices architecture?"}, {"date": "15 Jun 2022", "title": "Career Center Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stevens Institute of Technology (Hoboken, NJ)", "Interview Descriptions": "I had 3 virtual, back-to-back interviews with 3 people (separately, on the same day).  They clearly didn't coordinate questions because they were asking me the same things.  On top of that, they were outrageously rude.  It felt more like an interrogation.  I had spent time researching the Career Center and the Institute online.  I was mocked that I was sharing the data that I read about and I was asked what else I knew besides the information on the website.  I honestly did not know what to say to that nasty comment since I thought part of the interview was for them to tell me more about it since I have never worked there.  Additionally, one of the interviewers was picking apart my work experience and educational experience from 10 years ago.  It was completely ridiculous and irrelevant (such a long time ago).  She was asking me when I worked part time and when I went to school part time, when I transitioned to full time, etc.  There have been times with I worked 2 part-time jobs to survive, while going to school, things in my life changed (I am a human, so sue me).  This privileged person probably had the luxury of being dependent on others financially and could simply not understand why anyone would leave a job or pursue their education.  She also made a comment about how it was strange that I took a new job during COVID-19 which was bizarre to me.  Wouldn't it be a strong point that I helped a company get through the pandemic?  She was blatantly judging me for very strange things.  It was very unpleasant and I wish I would have ended the interview in the middle.", "Interview Questions": "Are percentages all you know about us?"}, {"date": "13 Mar 2022", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Stevens Institute of Technology", "Interview Descriptions": "Basic Questions about tidiness and organization, asked how about availability and academic schedule. Makes sure  that you will be on time and attentive even when the boss is not in the room.", "Interview Questions": "What is your availability and class schedule?"}, {"date": "27 Aug 2021", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Stevens Institute of Technology", "Interview Descriptions": "Long interview process with multiple rounds. A lot of people are involved in interviews and will get varying questions. It can be an entire day process. Interviews with different departments, management, and even students.", "Interview Questions": "What is your perspective of student development? "}, {"date": "5 May 2021", "title": "Graduate Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stevens Institute of Technology", "Interview Descriptions": "It was a very easy interview. Basic questions asked regarding personal traits and Communication skills and curriculum. Good interviewer. Overall good experience. Just be confident and be prepared to talk on your resume.", "Interview Questions": "Tell me something about yourself"}, {"date": "14 Jan 2021", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Stevens Institute of Technology", "Interview Descriptions": "In linear classification algorithms, instances are viewed as vectors in multi-dimensional space. Since the range of values of raw data varies widely, some objective functions do not work properly without normalization. For example, if one of the features has a broad range of values, the distances between points is governed by this particular feature", "Interview Questions": "Data project and machine learning"}, {"date": "5 Dec 2020", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stevens Institute of Technology", "Interview Descriptions": "Describe what I studied and what I will do and when I will able to start to work. And asked me if I have an experience on lab set up.", "Interview Questions": "N/A"}, {"date": "7 Oct 2020", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stevens Institute of Technology", "Interview Descriptions": "Email, and a brief interview, nothing technical, only behavioral. Honestly will give jobs to anyone who needs it. Email, and a brief interview, nothing technical, only behavioral. Honestly will give jobs to anyone who needs it.", "Interview Questions": "Why do you want to work here?"}], [{"date": "18 Aug 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Stevens Institute of Technology", "Interview Descriptions": "Straightforward  easy to follow and they are upfront. Nothing hidden and open communication during the process . Would recommend to future employees, flexible and room to continue growing your career", "Interview Questions": "Basic "}, {"date": "30 Mar 2020", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stevens Institute of Technology", "Interview Descriptions": "The interview process was not too complicated. It was based on the behavioral questions. Also, described that the role was aligned with my area of interest.  The interview process is quite simple and easy. So no need to worry about it. Be confident and make sure you answer correctly.", "Interview Questions": "Describe about yourself and how are you fit for this role ?"}, {"date": "7 Feb 2022", "title": "Residential Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Nov 2019", "Interview Descriptions": "it was seamless. more about what you bring to the table and why you want to work with the division. it was more informal and friendly. easy to be comfortable with interviewee", "Interview Questions": "tell me about yourself\r\nwhy this position\r\nhave you had any previous experience with this position."}, {"date": "28 Oct 2019", "title": "Talent Acquisition Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Stevens Institute of Technology", "Interview Descriptions": "It was a 2 part process.  There was an initial 20-30 min phone screen that was conducted by the director.  I was later invited for an in person interview a few days later where I met with the director and the VP of the department.  The interview interview lasted about a hour or so, and felt more like a conversation of my skills and prior experiences.", "Interview Questions": "tell me why your looking for a job change?"}, {"date": "5 Feb 2020", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Oct 2019", "Interview Descriptions": "You can apply through Workday or you can approach all departments specially dining, mail services. They directly  hire without applying online through workday. All departments will say apply through workday some times reference works.", "Interview Questions": "Introduce yourself, What are you studying here, dont you think its a career change for you?"}, {"date": "17 Jan 2020", "title": "Associate Director, Digital Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stevens Institute of Technology in Oct 2019", "Interview Descriptions": "First was a phone interview with the hiring manager, then an in-person interview with various team members. The in-person interview took place over 3 hours, meeting with several groups throughout this session.", "Interview Questions": "What is your experience with digital communication?"}, {"date": "25 Jun 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Sept 2019", "Interview Descriptions": "Invited to the interview by confirming day and time. \nWent to the Office and was asked to wait patiently.\nCalled in to the office and conducted interview. Was taken to the tour of office and recruiter was very humble", "Interview Questions": "Tell me something about yourself"}, {"date": "22 Apr 2019", "title": "Rpa Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stevens Institute of Technology", "Interview Descriptions": "telephonic interview followed by two rounds of technical and HR interview. In which they will give you scenario based coding test and then a behavioral round with oral technical questions.", "Interview Questions": "The process you worked with Automation?"}, {"date": "15 Feb 2019", "title": "Student Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stevens Institute of Technology", "Interview Descriptions": "Apply through workday external of SIT and wait for the interview call. If you get the interview call then talk to student employees already working about the work environment and how things work.", "Interview Questions": "Do you have any experience related to hospitality"}, {"date": "10 Oct 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Stevens Institute of Technology (Hoboken, GA) in Jan 2019", "Interview Descriptions": "Describe about yourself. Tell them when did you graduate and what all projects have you done and tell them more about the projects which are related to that field. And when are you graduating and when did you complete your undergraduate degree.", "Interview Questions": "What projects have you done in Web technology and which languages did you use ?"}], [{"date": "15 Oct 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Stevens Institute of Technology", "Interview Descriptions": "Only apply for the position via online, then I was interviewed by some faculty, after two weeks, I got my part time job. This interview is not too hard. And I got the result of interview only 2 weeks.", "Interview Questions": "Describe yourself briefly"}, {"date": "23 Oct 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Oct 2018", "Interview Descriptions": "I learnt with my current professor during my master program. Later on, I had a good performance in her class and I did her project in last semester of my master. Then, I got the PhD offer for her.", "Interview Questions": "Why you want to be a PhD student?"}, {"date": "2 Jun 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in May 2018", "Interview Descriptions": "I researched the position online and talked to some professors about it. I applied online by submitting my resume and then was called in for a in person interview on campus with the professor in charge of the research.", "Interview Questions": "Asked technical questions with respect to the research and safety questions. Also asked a lot of best fit personality questions such as how you over came a struggle "}, {"date": "2 Jul 2018", "title": "Alumni Liaison Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in May 2018", "Interview Descriptions": "Recent graduates may apply by speaking with the office of alumni affairs - an interview can then be scheduled.  The interview takes around an hour.  They are looking primarily for people who can serve well in a marketing and \"client\" relations role, prior experience (of any kind, including informal/unpaid/for a student group) is considered pretty good proof of your ability to do that.", "Interview Questions": "How would you keep a hostile prospect who you have just cold-called on the line?"}, {"date": "1 Nov 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Apr 2018", "Interview Descriptions": "It's easy to take that with professor and other students in the lab. Just introduce yourself and show them the related projects you did, and answer some basic technical questions.", "Interview Questions": "Talk about yourself and your project."}, {"date": "9 Nov 2018", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Feb 2018", "Interview Descriptions": "Behavioural interview \r\nExcel Test followed by a designing test and final interview with the manager\r\nThe basic excel was taken by the students working in the office\r\nGood experience and faster process", "Interview Questions": "Vlookup, Pivot, Concatenate, and other functions"}, {"date": "21 Dec 2017", "title": "Full Time Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Stevens Institute of Technology", "Interview Descriptions": "Applied for the job several months prior forgot I had applied. Get a phone call, set up an interview for a week later. The interviewer was late for our arranged phone interview. Had an hour phone interview, asked questions that were not pertaining to my resume. The questions were regarding duties I had no experience in, nor did the job description advertise those would be duties I'd be handling. I was completely thrown in the interview, although having experience and knowledge of my area. When it was my turn to ask questions the interviewer was not paying attention, or said they were not applicable to Stevens.", "Interview Questions": "Why do you want to work at Stevens/Department?"}, {"date": "6 Nov 2017", "title": "Senior Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stevens Institute of Technology (Hoboken, NJ)", "Interview Descriptions": "Pretty basic stuff. Phone call followed by an in person with the hiring manager and then a second on site for a panel interview.  \r\n\r\nThe most shocking thing about the second interview was that one of the people sitting in on the interview actually had the audacity to take a phone call IN THE ROOM.  Didn't even have the courtesy to excuse himself and take it outside.\r\n\r\nIn hind sight, I should have walked out and not looked back.\r\nPretty much a prime example of the kind of respect given.", "Interview Questions": "All normal questions. Nothing specific other than what I do, where I've been, and why I think I'd be good for the role."}, {"date": "1 Nov 2017", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Stevens Institute of Technology", "Interview Descriptions": "I applied through Steven's career Workday site. I called for in-person Interview. It was nice.I applied through Steven's career Workday site. I called for in-person Interview. It was nice.I applied through Steven's career Workday site. I called for in-person Interview. It was nice.", "Interview Questions": "Describe your Past experience?"}, {"date": "14 Oct 2017", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stevens Institute of Technology", "Interview Descriptions": "Had a successful phone interview, followed by a grueling 2.5 hr interview with several departments and directors.  Was excited that I was asked to  come back for a final interview.   They wanted someone detail oriented so I pointed out some typos on their website.  \n\nI received a canned email several days later that they made an offer to an internal applicant.", "Interview Questions": "How would your colleagues describe you?"}], [{"date": "22 Dec 2021", "title": "Student Life Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Oct 2017", "Interview Descriptions": "The Director of Student Life and I chatted about my interests and how I am involved on campus.  We discussed ideas about the goal for the programming activities, what type of events were currently scheduled and ideas about events that we can run for the students in the future.", "Interview Questions": "How are you involved on campus?"}, {"date": "31 Mar 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Stevens Institute of Technology (New York, NY) in Sept 2017", "Interview Descriptions": "The interview was good and smooth. Not much difficult. But you have to hit the crisp point to land the job. Interviewers are quite particular about your work ethic. Also, you gotta know what u want.", "Interview Questions": "Given a particular situation how would you react?"}, {"date": "5 Jan 2020", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Jun 2017", "Interview Descriptions": "The interview process was relatively simple; I sent emails to the heads of the different labs that I was interested in working at and waited for them to respond either positively or negatively. I met with the lab heads, toured their facilities and equipment, and spoke with the other PhD candidates to get their opinions. The lab I choose seemed like the best opportunity for me and I accepted the offer.", "Interview Questions": "Which group would be your first choice to work in within the lab?"}, {"date": "5 Apr 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Apr 2017", "Interview Descriptions": "Apply on line first, then submit the application document with you past education history. Come to the office of the professor. Talked about 1 hour to ask for some personal interesting of future research.", "Interview Questions": "What do you want to be in the next 5 years?"}, {"date": "13 Mar 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Stevens Institute of Technology", "Interview Descriptions": "Interview was a friendly one, No technical questions asked. Sometime all the official members can conduct an interview. Friendly conversation, no stress or hectic questions. sometimes just one round or max two of them.", "Interview Questions": "About graduating year, timings of class and gpa and about your course ?\r\nWhat change can one bring in the existing system of work?"}, {"date": "9 Mar 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Stevens Institute of Technology", "Interview Descriptions": "It was a thirty mins long interview and the managers/recruiters taking the interview were very polite. They sent out the results very quickly and I loved the overall experience. The work culture seemed to be employee friendly.", "Interview Questions": "What is team playing according to you?"}, {"date": "29 Jan 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Stevens Institute of Technology (Jersey City, NJ) in Mar 2017", "Interview Descriptions": "Taking with Professors one by one. Then You can find a Professor you like. Taking more about your background and interesting. Professors are so kind. Do not worry.\r\n\r\nYou need to submit a writing sample if you want to apply.", "Interview Questions": "Area you are interested. "}, {"date": "10 Mar 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Jan 2017", "Interview Descriptions": "The process was pretty straight forward, I had to apply online and in person, both. Once selected I got called for an interview, based on my answers and skill set, I was assigned a position.", "Interview Questions": "Do I understand MATLAB "}, {"date": "5 Oct 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Sept 2016", "Interview Descriptions": "It was easy, quick and simple. I had two interviews spaced over three days, and the questions I was asked and skills I had to demonstrate were relevant and easy to perform.", "Interview Questions": "Only questions relevant to my job"}, {"date": "26 May 2017", "title": "User Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Aug 2016", "Interview Descriptions": "The interview process was situation based and was conducted in very friendly manner and also helped me learn about new concepts in networking , Hardware and servers. The interview was conducted by 3 high level mangers of the department who were friendly through the process and imbibe knowledge in me.", "Interview Questions": "What is VDE?"}], [{"date": "10 Jul 2016", "title": "Communications Marketing Writer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stevens Institute of Technology (Hoboken, NJ)", "Interview Descriptions": "The VP of Communications & Marketing talked the whole time and then it ended. Never asked about skills or experience or process or anything related to performing the work. He vented about his own frustrations. Got the offer.", "Interview Questions": "Are you married and do you have kids?"}, {"date": "13 Sept 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Jun 2016", "Interview Descriptions": "The professor asked me to introduce myself and to give a brief talk about my motivation to apply for this part time job.\r\nThen, he reviewed my CV line by line, project by project in detail, especially for the algorithm and computer software part.\r\nFinally, some chat about my school life and coursework.", "Interview Questions": "Do you have related work experience?\r\nWhat kind of software do you use?"}, {"date": "1 Sept 2017", "title": "IT Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Stevens Institute of Technology (Jersey City, NJ) in May 2016", "Interview Descriptions": "# interviews starting with Basic HR and leading it technical troubleshooting. Overall a though process, no tricks just making sure you knew your stuff. Would recommend going in with at least a techincal foundation to understand converstations, but prior expeerience is not a must", "Interview Questions": "How to remove and protect against viruses"}, {"date": "16 Jun 2016", "title": "Student IT Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Apr 2016", "Interview Descriptions": "It was easy going. I was called for the interview and showed around. Mostly HR type interviews. Nothing really to worry about. Anyone could get in. Plus luck is quite important", "Interview Questions": "Do you have knowledge about IT ?"}, {"date": "3 Feb 2017", "title": "Teaching Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Mar 2016", "Interview Descriptions": "Got an email for an on-campus interview (no telephone call). Interviewed by a few teaching faculty and taught a sophomore class.  I was also interviewed by the program chair and Deans. Overall not very complicated and the university paid for travel and accommodation. However it was a long hot day from 8:30am till 5:00pm. And then I had to wait for more than 1 month to hear back.", "Interview Questions": "What courses can you teach?"}, {"date": "12 Feb 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stevens Institute of Technology", "Interview Descriptions": "Meet with one professor and give you some academic questions. The best way is you took some course which this professor taught before. And it need to fill lots of paperwork.", "Interview Questions": "Some academic questions."}, {"date": "27 Feb 2016", "title": "Graduate Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Nov 2015", "Interview Descriptions": "Very Easy, just general behavioral questions. The recruiter was very pleasant and even seemed to be rooting for me.At the end he said the recruiter will get back to you.", "Interview Questions": "Do you have prior work experience"}, {"date": "24 Oct 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Stevens Institute of Technology", "Interview Descriptions": "There is no interview. You can apply for the position, but whether you can get the job depends on the dean decision. After hiring, you will take a training program, which is usually helpful to shape the teaching style. You performance will be graded by the students, which can also determine whether you can keep the position or not.", "Interview Questions": "N/A"}, {"date": "9 Sept 2016", "title": "Graduate Assistant, Stevens Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Aug 2015", "Interview Descriptions": "Interview process is pretty straight forward, you have to apply online, if they like your resume,  you get a call. Sometimes they do take people who go and visit them personally. And many a times employee referral might work for similar kind of job openings.", "Interview Questions": "they mostly asked about the projects I was involved in during my bachelors, and how would they help them in the position they were looking for. I happened to have a web programming experience and they were looking for the same. So it went ok"}, {"date": "23 Jul 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stevens Institute of Technology", "Interview Descriptions": "Applied online, was contacted by email a month or two later to arrange an interview. I interviewed in person a couple weeks later. The interview was pretty standard; met with some professors, discussed both my research and the research involved in the position. Toured the department.", "Interview Questions": "Describe your research."}], [{"date": "4 Aug 2015", "title": "Manager Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Jun 2015", "Interview Descriptions": "It is a short interview, just 10 minutes. Two interviewer with one interviewee. They want to hire a people who have patients and could communicate with students. And they just want you know how to use excel and other Microsoft software.", "Interview Questions": "Tell us the skills you know about excel?"}, {"date": "1 Dec 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in May 2015", "Interview Descriptions": "I applied online through the internal Stevens Portal and received an interview. Asked for brief go through of my resume and past work experiences. Behavioral questions about how to handle large number of students and tough situations with manager. Large emphasis on attention to detail. Asked for any follow up questions", "Interview Questions": "How would you handle situations where there are many students waiting to speak with you regarding immigration issues"}, {"date": "14 Apr 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Stevens Institute of Technology", "Interview Descriptions": "About your background, courses, and score. Easy, some normal conversation, the most important thing is your good transcript.\r\nApply on school's website, then the secretary will contact you. Previous related experience is better", "Interview Questions": "About your background, courses, and score. Easy, some normal conversation, the most important thing is your good transcript.\r\nApply on school's website, then the secretary will contact you."}, {"date": "14 Jul 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Apr 2015", "Interview Descriptions": "I applied to the Student Support Center, and got the interview maybe within a week, two rounds of interview in total, the first around was with two GAs, and the second round was with the Director and coordinator.", "Interview Questions": "I was interviewed by another two GAs during the first round, just routine questions, but the one they asked was interesting, they asked me to describe something interesting about myself"}, {"date": "17 Feb 2016", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Stevens Institute of Technology in Dec 2014", "Interview Descriptions": "Just talk with my professor how I matched with that position. Before you are the student and you must get A in that course. Actually it is determined by the professor himself, not the hiring committee. So I think it is easy for you to find position there.", "Interview Questions": "What is your favorite programming language, why?"}, {"date": "18 Nov 2014", "title": "Graduate Admissions Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Oct 2014", "Interview Descriptions": "I applied online and received a call from the office to come in for an interview. Went on the first interview then was asked to come in for a second. After the 2nd interview, I was under the impression that everything went well. I waited for a response. After not hearing from them, I sent several follow up emails over the course of two months to find out the status of my application or if a decision was made. Never heard from them again.", "Interview Questions": "Why do you want to work in higher education"}, {"date": "3 Dec 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in May 2014", "Interview Descriptions": "I met with the professor in charge of the research study and then with the professor in charge of the lab. It was very casual and relaxed. They were both very nice and were just trying to get to know me and my interests in the field.", "Interview Questions": "What do you know about environmental engineering?"}, {"date": "2 Mar 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Mar 2014", "Interview Descriptions": "I filled out the online application through the employment portal of the college and was called for the first round of interview within a week. The first round was behavioral and turned out to be a very good and long conversation. The same afternoon, I was called for the second round of interview with the Dean of the college. She also took a behavioral round and then asked me about the skills required for the job, the main being the Microsoft excel. The interview lasted for about 25minutes. The same evening, I got the mail confirming that I got hired :)", "Interview Questions": "Q. I was asked to briefly describe myself?"}, {"date": "30 Nov 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Sept 2013", "Interview Descriptions": "I applied the job in April and got a phone call to interview in late May then I was already out of the states. I came back in August and applied again, and got hired at late Sept.. Can't say short.", "Interview Questions": "Questions are easy, bosses asked about excel, how to handle emergent request from students etc."}, {"date": "27 Feb 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Stevens Institute of Technology", "Interview Descriptions": "just an interview by other CAs.", "Interview Questions": "N/A"}], [{"date": "6 Apr 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Jan 2013", "Interview Descriptions": "The committee interviewing me consisted of three people who were not well-qualified: they understood very little about the role I was interviewing for or the place of such of role in American universities today.  For me it was very easy as a result.  I also brought valuable good experience.", "Interview Questions": "No scenario questions."}, {"date": "24 Oct 2015", "title": "Federal Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Aug 2012", "Interview Descriptions": "They talked to me and got to know me better and they made me take a test. The interviewer was very nice and gave me a lot of attention. The interview was in public and was not behind closed doors. I felt that the interview was pretty fair and they listened and heard me out.", "Interview Questions": "How much experience do you have filing?"}, {"date": "12 Jan 2016", "title": "Professor, Adjunct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Aug 2012", "Interview Descriptions": "Easy.  Interview process was very brief and impersonal but relevant to my experience and professional background. No pretense of trying to engage in something more complicated than actually getting to the real nuts and bolts.  h", "Interview Questions": "N/A"}, {"date": "25 May 2012", "title": "Administration Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Apr 2012", "Interview Descriptions": "I applied online and was contacted to set up a phone interview about 2 weeks later.  The phone interview was a 1-on-1 with the hiring manager.  I was then called in for a 1-on-1 on-site interview with the same person.  The interview lasted about 90 minutes.  They said they would call me within 2 weeks, which they did not.  I never heard from Stevens again.", "Interview Questions": "Why are you interested in this position?"}, {"date": "30 Sept 2015", "title": "Web Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Feb 2012", "Interview Descriptions": "I was called for a phone interview and then followed up for an in-person interview with the department manager to discuss the position. The process was smooth and when I arrived I was greeted with a friendly smile and sat in the office awaiting for the Manager to arrive.", "Interview Questions": "How do you handle multiple projects at once?"}, {"date": "17 Aug 2013", "title": "Sales Person Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Jan 2012", "Interview Descriptions": "The process started with a phone screen from HR and then with one skype interview for 45 min before giving a flyout to Boston. The skype interview was mostly from my resume and my experience in handling huge datasets (using SQL) nothing technical as such. The role also needs good presentation skills along with simple data visualization for presenting to client", "Interview Questions": "N/A"}, {"date": "26 Aug 2010", "title": "Network Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Mar 2010", "Interview Descriptions": "it's nomal, nothing exciting", "Interview Questions": "see urself in five years "}, {"date": "17 Mar 2010", "title": "Web Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Stevens Institute of Technology (Hoboken, NJ) in Nov 2009", "Interview Descriptions": "Just checked my basic skills and my experienced.", "Interview Questions": "Whats your experience in learning new Technology ?? "}]]