[[{"date": "20 Jun 2023", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Tampa, FL)", "Interview Descriptions": "Panel-style interview for new grad nurse. Multiple nurse managers from different units there asking you questions. Not hard questions but it is nerve wracking being in front of that many people.", "Interview Questions": "Tell us a little about yourself"}, {"date": "1 May 2023", "title": "Clinical Application Support Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "It was a fairly straightforward HR phone interview. The recruiter was unable to answer the questions I asked of him, though. The interview felt rushed and like he was just checking a box on his end. He kept pressing why I wanted this position and said he felt I was overqualified.", "Interview Questions": "What is one thing you liked and one thing you disliked about your previous employer?"}, {"date": "10 Apr 2023", "title": "Healthcare Navigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at BayCare Health System", "Interview Descriptions": "1st interview via phone call. The HR scheduled for 2nd interview which it was a hiring even. I was told to join it as my 2nd interview. \n\nThe manager showed up with pencils and post-it notes. After explained the job and questions. Then she asked if I have my resume. I was like what? How did the manager go for my 2nd interview without my resume or she didn’t even know who was the candidate. At the end of conversation and questions, the manager asked me my resume or email my resume to her assistant. (That how I found out that I had been going the hiring event not my 2nd interview). \n\nI was super disappointed about their lack of management. I’m currently employed.  So, I didn’t really expect to join any hiring event if the HR told me as the beginning. I felt it was a waste of time that I had been through.  \n \nJob was simple. Basically, you will have to get medical assistance certificate to assist people applied for affordable care or insurance plan that patient eligible for. Benefits sound right. But it doesn’t matter for me, because I don’t apply for benefits if not I had accepted John Hopkins’ offer already. I applied BayCare because it’s close to my house. \n\nAnyway, they’re not professional in my opinion.", "Interview Questions": "Can you tell me about yourself?"}, {"date": "24 Apr 2023", "title": "Student Nurse Apprentice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System (Bartow, FL) in Apr 2023", "Interview Descriptions": "1st phone call by HR, asked basic questions and moved me on to a video call interview with a manager Video call is scheduled for later this afternoon so I will update later.", "Interview Questions": "What was a difficult situation that you handled and learned from? Education, location, experience, and pay were discussed"}, {"date": "9 Jan 2023", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at BayCare Health System", "Interview Descriptions": "Very comforting and casual conversation while still remaining professional. Worked around my busy schedule to choose an appropriate interview time. First interview was conducted via phone call. Second interview to be conducted via google meet.", "Interview Questions": "What are my goals and how can I ensure patient safety and satisfaction?"}, {"date": "8 Nov 2022", "title": "Programmer Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System", "Interview Descriptions": "After selecting preferred dates for an interview, I asked the hiring manager what the salary range was for the role. The manager's response was they moved forward with another candidate.", "Interview Questions": "Select from a list of days/times for you to interview."}, {"date": "13 Feb 2023", "title": "Urgent Care Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Clearwater, FL) in Nov 2022", "Interview Descriptions": "Extensive interview process. Be prepared to take drug screen, have your blood drawn and a long a wait time while doing this. Phone interview, in person interview, then an appointment to get the screening done and your photo taken for the badge.", "Interview Questions": "Positive interview to see how I would react if someone was upset or in need of immediate health care."}, {"date": "25 Oct 2022", "title": "Medical Office Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "The interview process started with an interview with an HR representative. Afterward there was a second interview. The second interview at the time was over Microsoft Teams. When it was over, I was notified later on by email.", "Interview Questions": "Why are you interested in BayCare?"}, {"date": "16 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "The hiring process was smooth and thorough. I felt comfortable speaking with the interviewers and they were very patient with allowing me to answer questions. They answered any questions I had thoroughly and called me back within a few days.", "Interview Questions": "Tell me a time when you were presented with an ethically challenging situation and how did you handle it?"}, {"date": "6 Dec 2022", "title": "PCT Patient Care Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BayCare Health System (Lakeland, FL) in Oct 2022", "Interview Descriptions": "They called me for an interview just to tell me the position was already filled. Honestly was a complete waste of time. Also, their starting pay is low compared to Adventhealth", "Interview Questions": "What made you consider this position"}], [{"date": "5 Nov 2022", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BayCare Health System in Oct 2022", "Interview Descriptions": "I applied online very easily and received an email the next to schedule an appointment time. The time options were very flexible. After I chose my time, I received my confirmation. Then the interviewer called at the exact time had scheduled and asked me questions over the phone.", "Interview Questions": "Mostly questions about my experience"}, {"date": "19 Sept 2022", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Met with recruiter then told I’d meet with the hiring manager! Waiting to meet with them in October! I’m hoping I get the position. The recruiter was very nice and easy to talk with. ", "Interview Questions": "Why do you want to become a PCT? "}, {"date": "31 Aug 2022", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Very welcoming and nice. the interviewer was kind and understanding. there was no need to be anxious about the interview. she answered all of my questions. she provided all the information i asked for and more.", "Interview Questions": "what are some of your biggest strengths?"}, {"date": "17 Aug 2022", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Virtual interview over Microsoft Teams using audio and visual. Was very professional and interviewer asked great questions. It was a very relaxed and comfortable environment. Very grateful for the opportunity.", "Interview Questions": "Can you please describe a time that you made a mistake and how you handled it?"}, {"date": "13 Aug 2022", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at BayCare Health System (Tampa, FL)", "Interview Descriptions": "Face to face interview with the hiring manager and one team member. They asked typical situational questions. We reviewed my accounting and computer related skills and reviewed my resume. The interview lasted about 45 minutes.", "Interview Questions": "Tell me a time when you had multiple assignments due at the same time, how did you handle this?"}, {"date": "8 Aug 2022", "title": "Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at BayCare Health System (Tampa, FL) in Aug 2022", "Interview Descriptions": "Recruiter emails applicants to schedule a phone interview and never actually calls number provided when meeting is scheduled. So the interview never even occurs. There is also no follow up to their interview process especially if it’s done on places like indeed.", "Interview Questions": "N/A"}, {"date": "10 Jul 2022", "title": "Office Staff Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Very cordial. Formal. Straight forward as to what they were looking for. They explained the doctor:patient ratio. The benefits of keeping the doctor on time and task. Also a tour of the office.", "Interview Questions": "How are your triaging skills?"}, {"date": "5 Sept 2022", "title": "Nurse Graduate (RN) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at BayCare Health System (Saint Pete, FL) in Jul 2022", "Interview Descriptions": "The only interview I had was with a recruiter. They have you do a bunch of stuff before you even interview with the managers there so it was basically a whole waste of my time. They offer specific units and only allow new grads in certain specialty units if they know them/currently work for the company. I understand that, but telling me that a new grad can work in the ER but that they aren't fit to work in psych is honestly wild. They offered me a few different units to interview with and asked me to provide my license info after I passed my NCLEX. I did that, and never heard back. I then emailed them again to see how the process was going, again no response. I emailed them a third time asking if I could at least get confirmation that they weren't going to proceed with having me interview with a manager and again, nothing. They were extremely unprofessional and did not respect my time. While yes, Baycare is a great company, I feel as though they have this complex where just because they're Baycare they can do whatever they want. The recruiter got my hopes up saying I would initially hear back after a few days to interview but nothing happened and that's when I proceeded to be ghosted 3 times. ", "Interview Questions": "Why do you want to work here? \nWhat experience do you have in a hospital setting?"}, {"date": "5 Jun 2022", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Had a phone interview with recruiter, then came in person to meet with manager and few other members of the team. It was mostly laid back, with the interviewers just trying to understand my experience, my skills, and if I would be a good fit.", "Interview Questions": "What is your experience in healthcare?"}, {"date": "30 May 2022", "title": "Food Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "They're picky on who they choose; no matter what position you try to get. Every advice or practice they will just be picky about you. They'll get your hopes up and destroy it.", "Interview Questions": "Why do you want to join Baycare?"}], [{"date": "4 May 2022", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "I was first asked contacted by a member from the recruitment group. She asked me a series of questions to see if I had the qualification. After completing that, I was asked to submit three references. After submitting three references I was told I will be contacted by the manager of the unit. Overall, very easy to follow and clear interview process.", "Interview Questions": "What are three strengths about yourself? "}, {"date": "23 May 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Tampa, FL) in May 2022", "Interview Descriptions": "I wouldn’t know because they ghosted me twice. I was sent an email to select a screening time. I scheduled my appointment and at the appointment time was not contacted. I sent an email and then rescheduled the appointment. Still nothing. Pretty unprofessional and rude.", "Interview Questions": "N/A"}, {"date": "7 Apr 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Application online, Email with link to schedule interview. Phone interview with recruiter, in person interview with manager at the hospital. Reference check request after phone interview.              REquired words listed here because it won’t save. There is nothing else to list here about the interview process.", "Interview Questions": "Tell me about a difficult patient situation you handled."}, {"date": "19 Jun 2022", "title": "Nurse Residency Program Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Clearwater, FL) in Apr 2022", "Interview Descriptions": "In a panel of 6-9 managers and they all ask you questions, one at a time. Whichever ones like you, then they'll offer you a job. You'll know a couple days later.", "Interview Questions": "What is a strength of yours?"}, {"date": "30 Mar 2022", "title": "Social Media Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System", "Interview Descriptions": "The HR/talent acquisition is a joke at this company.  They are the gatekeepers to get through but they constantly drop the ball.  In phone interviews it is abundantly apparent they aren't even listening and have not even taken the time to do a periphery scan of a resume.  One I spoke to in an advanced position wasn't even sure the position I was applying for fell under the jobs that they fill.", "Interview Questions": "What is your highest level of education?"}, {"date": "24 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Go through screening process with recruiter and if they think that you are a good fit then they set you up with in person interviews. After that, your recruiter will tell you if you got it or not. Interview process is not too bad. They ask your standard interview questions and want you to draw on clinical experience. They also ask personality questions like how do you handle stress. Just be yourself. They can tell if you are genuine or not.", "Interview Questions": "How do you handle stess?"}, {"date": "10 Mar 2022", "title": "Recruiting Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at BayCare Health System", "Interview Descriptions": "Communication with the senior recruiter was difficult due to them stating in email that they would send a formal job description, but did not include an attachment. I replied the following day requesting the attachment, and that it wasn’t included in the initial interview request email. I then got a generic email, that did not have the attachment and did not answer my questions. I later asked again in email for the attachment, and was finally sent the formal job description for review. The interview itself was informal, and was difficult to hear the recruiter over their typing. No matter how many times I explained that I was having a hard time hearing them, there was no change. They also had me provide 3 letters of reference before the interview. Lots of hoops to jump through for a job with no benefits, low pay, and no job security.", "Interview Questions": "We don’t have the FTE for this role, are you comfortable being PRN (no benefits, no guarantee for hours, higher pay rate)?"}, {"date": "5 May 2022", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BayCare Health System (Riverview, FL) in Mar 2022", "Interview Descriptions": "The entire process took about 2 months. You start by filling out the application online and list 3 references. The references will receive an email survey that they have to fill out and submit. Once all the references submit the survey, a recruiter will reach out via email to schedule a screening interview. The screening interview will be by phone call. During the phone interview, the recruiter will ask you basic questions such as “what are your strengths” or “why do you want to work for us”.  They will also explain the position you applied for. If you impress the recruiter, they will get back with you in a few days to set up a second interview in person or by video call. The wait in between interviews was about 3.5 weeks. The second interview will likely be a panel interview. Mine was a total of 5 managers from different units. My interviewer introduced herself and the others, and then went right for the interview questions. At the end she asked if I had any questions and then the interview ended. It was quick, about 15 minutes. After the interview, it took 4 days for the recruiter to call me about the hiring managers decision.", "Interview Questions": "Why did you become a nurse?\r\n"}, {"date": "8 Jan 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BayCare Health System", "Interview Descriptions": "It was the typical interview format. There were a series of questions and upon completion, I was giving an opportunity to ask them questions. The process was smooth and professional.", "Interview Questions": "Why do you want to work for BayCare?"}, {"date": "2 Jan 2022", "title": "Staff RN Nights Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BayCare Health System", "Interview Descriptions": "A  phone interview, interview with unit manager, then group interview with charge nurse and one or two staff members. All interviews were relaxed, informal and low stress. Unit manager very personable and interested in finding staff with teamwork.", "Interview Questions": "What are your strengths and weaknesses. Give an example of a time you provided exemplary patient care that went above and beyond."}], [{"date": "11 Nov 2022", "title": "Food and Nutrition Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BayCare Health System (Saint Pete, FL) in Jan 2022", "Interview Descriptions": "Managers were very down to earth interview was pretty easy, they really just want to make sure you have good customer service skills and open availability. Environment was nice as well I loved the people that I did work with.", "Interview Questions": "Tell us about yourself What’s your availability How did you hear about the company"}, {"date": "29 May 2023", "title": "Real Estate Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BayCare Health System (Clearwater, FL) in Jan 2022", "Interview Descriptions": "The interview process consists of phone, virtual, and in person interviews. The process was very laid back and i was able to speak and meet with many existing employees, managers, and directors. Overall, the process was very pleasant.", "Interview Questions": "Your experience in the industry"}, {"date": "27 Jan 2022", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BayCare Health System in Jan 2022", "Interview Descriptions": "Talked to management. We discussed training job duties. Benefits, hours, uniform policy. I was asked if I felt comfortable doing certain duties, and informed me that there would be proper training.", "Interview Questions": "Tell me a little about yourself"}, {"date": "5 Mar 2022", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System in Dec 2021", "Interview Descriptions": "I applied online. 2 weeks later I had a phone interview with talent acquisition. I didn't think I performed well but I had a video interview with the \"boss\". I received a generic decline email about 3 weeks later. The job has since reopened after a very short time.", "Interview Questions": "Typical interview questions with talent acqusition. More casual with the \"boss\"."}, {"date": "20 Feb 2022", "title": "Healthcare Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BayCare Health System in Nov 2021", "Interview Descriptions": "Went through three interviews with the company and then never heard back. Imagine being entitled enough to take up three hours of your time and then never follow up with your candidates. Incredibly unprofessional.", "Interview Questions": "What is your sourcing workflow?"}, {"date": "24 Oct 2021", "title": "RNC Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Applied position was filled but manager took time to verify if interested in alternative positions.      I appreciated the extra effort from the company even though I wasn't interested.   Thank you.", "Interview Questions": "If I would work nights"}, {"date": "19 Oct 2021", "title": "Software Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at BayCare Health System", "Interview Descriptions": "I was contacted by an  HR recruiter for the position of a software developer. My résumé was submitted to the hiring manager, but was told the job description for the position was completely different than what the position would be doing. Also the HR Recruiter submitted the wrong résumé. \r\n\r\nAfter that, the hiring manager scheduled additional interviews for the next round, which was a complete waste of time. One member of the team asked all the questions and gave smart remarks throughout the interview and had a very unprofessional stand off attitude. Not just with me but with her fellow team members as well. If that’s how this department operates then I want no parts of working in that type of environment.", "Interview Questions": "Oracle based questions on sql….."}, {"date": "25 Jan 2022", "title": "IT Helpdesk Support Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at BayCare Health System in Oct 2021", "Interview Descriptions": "Interviews showed up on time for the teams meeting and were professional. The interviews consisted one person from HR and a manager you would work under. Seems like a great place to work at.", "Interview Questions": "Asked alot of technical questions but nothing you wouldn't learn from earning an A+ cert. "}, {"date": "2 Sept 2021", "title": "Associate Counsel Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at BayCare Health System", "Interview Descriptions": "This company really cares about finding the right fit for their culture. The interview process is rigorous but I thoroughly enjoyed each step. They will give you the opportunity to meet the entire team both in one one one and small group settings.", "Interview Questions": "Tell me about a time you had to negotiate a contract from start to finish by yourself."}, {"date": "17 Sept 2021", "title": "Security Engineer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at BayCare Health System (Tampa, FL) in Aug 2021", "Interview Descriptions": "Everyone was very friendly.  After applying, I got a call from HR to discuss the position.  She asked if I could quickly relocate due to the urgency of the position and had me fill out some references which sent out surveys.\n\n2 months later I get a text from the hiring manager asking if we could talk on the phone.  After he rescheduled twice after we got on the phone he asked if we could switch to video call.  The interview was pretty casual.  He never got my resume from HR so I sent it over. He was very kind, but a comment was made about making sure I was dressed properly for further interviews (even though he changed to video last second).\n\nUsually the team interview would be next, but due to vacations I met with the interviewing manager's director.  This was also fairly casual giving me half the time to ask questions.\n\nThe team interview also went well.  All very friendly and plenty of time to interview them as well as being interviewed.\n\nNext was an interview with the CTO, but that never happened.   Instead I got a call with an offer.  HR was very nice, but she didn't know much about company benefits or policy.  I had to ask for documentation a couple times to find out that information.  \n\nI declined the offer not only because of the interview process, but concerns with the position and relocating.\n\nAfter declining the position, the hiring manager very kindly texted/called me a few times to see if we could make something work.  He also was not aware of their retirement package, but was happy to talk through all of my concerns.  It did feel kind of strange that a hiring manager was having these conversations instead of HR.  We clarified things like needing to use your vacation on federal holidays (they have 6 that you must use vacation time, the other 5 federal holidays you are expected to work.), financial concerns, retirement benefits, and concerns with the position.\n\nUltimately, they couldn't change much else other than salary, so the hiring manager mentioned a process (again, not sure why not HR) that they could request to increase the offer.  When asked if I would accept the offer if the maximum increase was approved, I responded with a 95% chance of a yes, but they wanted 100% immediately and we decided to part ways.", "Interview Questions": "Where do you see yourself in 5 years?"}], [{"date": "30 Jul 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Interviewed with HR for screening interview.  After about a week had three interviews with peers, directors and VP over the course of about two weeks.   No written or presentation requirements.", "Interview Questions": "What are adjectives that describe you?  Why should I hire you over other candidates?"}, {"date": "31 Jul 2021", "title": "Social Service Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at BayCare Health System (Pinellas Park, FL)", "Interview Descriptions": "Terrible hiring process. They take months to update their job portal and then when a recruiter reaches out they ghost you after you talk. Or I was told that my application was sent to hiring manager and got my hopes up and then weeks later saying not selected, they only hire within very obvious", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "14 Jul 2021", "title": "Lab Medical Assistant I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Phone interview is first. If you pass through, this is then followed by an interview with a hiring manager. Standard interview process and they want to hear about your work experience, strengths, and so forth.", "Interview Questions": "What do you like most and least about your current job?"}, {"date": "4 Jun 2021", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Need references to do a survey first and then interview.  Interviewed with nurse supervisor, asked basic questions.  Heard back 4 days later, positive experience.  Answered all my questions, professional. Thorough", "Interview Questions": "Why do you want to work for us"}, {"date": "23 Apr 2021", "title": "Coder 2 Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Very long time between steps, very difficult coding assessments that take hours, but when you get to the interviews they do more talking than asking questions. They want to sell you on the idea of working there but take over two weeks to contact you after they're done", "Interview Questions": "How long would you need to give notice"}, {"date": "17 Apr 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "No interview process. Fill out a packet, get TB shot, then hired as volunteer. They schedule passed on how you fill out the packet they give you. They also choose where you work based on the packet they give you.", "Interview Questions": "They did not ask any interview questions. "}, {"date": "16 Mar 2021", "title": "Healthcare Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "In a group setting, challenged me to find a different response if someone in the group had already stated my answer so I could stand out amongst the rest.   This type of interview was new to me and helped me alot in the interview process.", "Interview Questions": "What are your most important strengths?"}, {"date": "14 Mar 2021", "title": "IT Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Their IT is really family oriented - they only hire friends and family. What a waste of time! They interviewed me even though their hiring manager already had his buddy lined up,  less qualified than I am", "Interview Questions": "No good questions"}, {"date": "7 Mar 2021", "title": "Assessment Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Awesome , not hard , average questions. Process was fairly quick , not too long . I enjoyed this interview and the company seems very family oriented and works as a team.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "5 Apr 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Tampa, FL) in Mar 2021", "Interview Descriptions": "Very casual and friendly.She asked me qualities about myself ,strengths,weaknesses,and why I would be a great fit for the program. Provided me with information about the program such as pay,hours,and floor units", "Interview Questions": "What strengths and weaknesses can you tell me about yourself "}], [{"date": "16 Mar 2021", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Dunedin, FL) in Mar 2021", "Interview Descriptions": "Just had relocated to the area, was late due to traffic and lights and would not bother interviewing me. They wouldn't even give me a chance to talk and continue to cut me off. Their stuff is extremely rude when coming in for 2nd interview.", "Interview Questions": "1. When is a time you encounter a difficult Situation with a coworker and how did you handle it.\r\n2. What would previous employers say about you.\r\n3. What are some of your best traits."}, {"date": "24 Feb 2021", "title": "Talent Acquisition Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BayCare Health System in Jan 2021", "Interview Descriptions": "I applied online and was reached out to schedule a phone interview. I had the phone interview via video meeting. After the interview, I never heard back one way or another about my status. I even followed up and no one responded to me. Ghosting candidates is definitely not a best practice in recruiting, so as a recruiter myself, I would never want to work for a recruiting team whose practice is to ghost candidates.", "Interview Questions": "Tell me about yourself, tell me about your background, why are you looking for a new opportunity, what do you know about BayCare?"}, {"date": "25 Aug 2022", "title": "Care Coordination Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at BayCare Health System in Jan 2021", "Interview Descriptions": "I was interviewed by 3 awesome women, they were friendly and made you feel comfortable. It was more of getting to know each other and talking about things we did in the past", "Interview Questions": "Tell us a little about yourself?"}, {"date": "10 Jan 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Lutz, FL) in Jan 2021", "Interview Descriptions": "I did a phone interview and it went quick within the 30 mins. The recruiter is thorough explaining everything about the position and the pay along with the hours and what positions are open.", "Interview Questions": "What made you choose BayCare?"}, {"date": "22 Nov 2020", "title": "Social Services Specialist II Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at BayCare Health System (New York, NY)", "Interview Descriptions": "Normal phone interview with recruiter. They will discuss pay. Baycare is a non for profit so be ready to hear below the market value for salary. Quoted me $25.50/hr for 4.5 years of experience and an MSW.  I declined next steps due to this.", "Interview Questions": "How does your experience relate to this job position?"}, {"date": "17 Oct 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BayCare Health System", "Interview Descriptions": "Very pleasant straight forward. Recruiter was very nice and second round of interviews were straight forward as well. First round all basic questions were asked and the job position was explained in full second interview is when questions became more in depth and open ended", "Interview Questions": "What do you think your strengths are "}, {"date": "21 Mar 2023", "title": "MHT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at BayCare Health System in Nov 2020", "Interview Descriptions": "It was great and easy and the interviewer was friendly. They explained to me the job requirements. That same day I got an offer. I got 4 offers from different managers", "Interview Questions": "Why do you want to work in behavioral health"}, {"date": "16 Sept 2020", "title": "Site Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Tampa, FL)", "Interview Descriptions": "Overall pretty good. Virtual interviews for the first 2 rounds then I flew to Tampa for the final interview with the team I would be supporting.  I was also paired with a seasoned manager to have a conversation about the daily operations, I very much enjoyed this because we connected instantly and the meeting was extremely productive.", "Interview Questions": "What would your current providers say about you?"}, {"date": "18 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Lengthy process .  Interviews with multiple peers.  The process is necessary but I think it is a little bit over the top.  The hiring process took several weeks.  Normal screenings and drug testing.  The onboarding process and training are ongoing unlike other companies that get it done all at once.  This place spreads it out", "Interview Questions": "Why do you like baycare"}, {"date": "7 Aug 2020", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Clearwater, FL) in May 2020", "Interview Descriptions": "Phone screen with recruiter who had minimal information on the role 2-3 weeks after I applied. Manager interview was informal- no prepared questions (despite disclosing that there were multiple interviews that week for the role- this is a red flag for me about dept organization and interview objectivity). Scheduled for 30 minutes, but I was there for over an hour. The interviewer joked at the end of our meeting that she was so caught up on our conversation that they forgot to take notes.  Said they were 'absolutely' putting me through for a meeting with next level manager. After three weeks of silence I was rejected via generic email. No responses to my emails regarding that second interview.", "Interview Questions": "What is your management style? How do you deal with difficult employees and personality? "}], [{"date": "5 Feb 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System", "Interview Descriptions": "Phone interview with recruiter then in person interview with management. Very organized process with detailed instructions on exactly when and where. The staff was helpful and non-judgmental. After initial interview, you are asked to submit 5 references online via website/email. Once that is completed then they move forward with hiring process.", "Interview Questions": "How would you benefit the company?"}, {"date": "29 Dec 2019", "title": "Office Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BayCare Health System", "Interview Descriptions": "Brief in an office setting with a second employee. They asked many questions. The other employee seemed nervous and unprepared. They were not looking for someone with much educational background.", "Interview Questions": "Experience "}, {"date": "31 Mar 2020", "title": "Nurse Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System in Dec 2019", "Interview Descriptions": "Applied online and immediately received an email asking me to set up a phone interview based on the recruiter's schedule.  Recruiter called for a phone interview and moved me on to an in-person interview with a manager from the unit I was interested in.  Once I interviewed with the unit manager, I heard back within a week about being hired.", "Interview Questions": "Why did you chose nursing?\r\nTell me about a time you offered excellent patient care?\r\nWhat are your weaknesses?\r\nWhat are your strengths?\r\nWhere do you see yourself in 5 years?"}, {"date": "21 Jun 2021", "title": "Scheduler/Abstractor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System (Tampa, FL) in Oct 2019", "Interview Descriptions": "Pretty average interview. Act comfortable and be yourself. They ask behavioral based questions/situational, like how you would handle an upset doctor or how you handle a lot of work on your plate. Helps if you give examples from pst experiences.", "Interview Questions": "Why do you want this job? "}, {"date": "26 Sept 2019", "title": "ER Financial Assistance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Talked to 4 different people . Claimed the work to be do difficult. They only things difficult is managing the workload in the ER considering the population of people", "Interview Questions": "N/A"}, {"date": "1 Sept 2019", "title": "Staff RN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BayCare Health System (Riverview, FL)", "Interview Descriptions": "Interviewed with manager and department head. Easy and friendly.  Had to answer typical interview questions about team work, conflict resolution, handling stress, and the typical where do you see yourself in five years.", "Interview Questions": "How do you handle conflict?"}, {"date": "6 Nov 2019", "title": "Finance Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at BayCare Health System (Tampa, FL) in Sept 2019", "Interview Descriptions": "I applied online and met some recruiters at a career fair. Everyone was very nice. The recruiter I spoke with only gave me very limited time to choose a second interview with a manager. Because of my class and work schedule, I was not able to make an interview time within the very select hours. The flexiablity rubbed me the wrong way.", "Interview Questions": "Experience "}, {"date": "24 Jul 2019", "title": "Case Management Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at BayCare Health System", "Interview Descriptions": "Behavioral interviewing and open ended questions. Don’t forget to smile and show your personality a little!  Always ask questions at the end of the interview, it shows you are interested in the position and are taking the interview seriously.", "Interview Questions": "How do you handle difficult situations?"}, {"date": "9 Jul 2019", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at BayCare Health System (Tampa, FL) in Jun 2019", "Interview Descriptions": "Phone call interview first around 30 minutes to go over qualifications and see if youre fit enough to go in for an interview and then on site interview with unit manager and I had a patient care technician in the room as well.", "Interview Questions": "Tell me a time when you had to deal with a difficult patient or family member"}, {"date": "16 Oct 2019", "title": "Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BayCare Health System (Tampa, FL) in Jun 2019", "Interview Descriptions": "It was a lot like speed dating. Two dozen candidates were rotated to 7 different tables where sat a nurse manager and usually a preceptor. You had 10 minutes at each table to answer questions and impress. Interview questions were pretty generic", "Interview Questions": "Why Baycare?"}], [{"date": "13 Apr 2019", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BayCare Health System in Apr 2019", "Interview Descriptions": "Easy step by step email process then phone interview. Once phone interview completed then went in for panel interview. Panel included eight team members including the manager. Overall pleasant experience.", "Interview Questions": "What is a skill that I could be better at?"}, {"date": "5 Mar 2019", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at BayCare Health System (Clearwater, FL) in Mar 2019", "Interview Descriptions": "Apply online.  20 minute phone call with HR. Email survey sent to at least 5 references. 80 minute phone call with manager.  80 minute panel-style  interview with manager and 6 members of the team. They were all very pleasant the manager was very respectful - taking the time to talk to me afterwards about the company and waking with me all the way to the exit.", "Interview Questions": "Difference in SQL queries, data normalization, experience with dashboard reporting tools, change management,  past projects completed, solutions to analytical scenarios."}, {"date": "17 Jul 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BayCare Health System (Tampa, FL) in Mar 2019", "Interview Descriptions": "Quite a long process - they go by a 360 model.  HR department was a bit slow with communication.  Team members were very responsive.  Overall a good experience.", "Interview Questions": "How do you handle criticism?"}, {"date": "8 Feb 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Very friendly and well organized. First had a phone interview with the recruiter, than was invited to an on-site interview with management. Interview questions were pretty typical, everyone I met was very kind and welcoming.", "Interview Questions": "Work history and clinical experience/areas of interest. Why did I want to work for Baycare?"}, {"date": "12 Feb 2019", "title": "Medical Records Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at BayCare Health System (Plant City, FL) in Feb 2019", "Interview Descriptions": "Very friendly  and courteous and upbeat answer questions best that i can. Try to be very honest to each question that was ask of me. But over all i like the interview. And i really want to work for the hospital. Because i can benefit to be able to work there", "Interview Questions": "What is a,situation about a rude and unpolite patient and how did you deal with it"}, {"date": "12 Apr 2019", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System (Augusta, ME) in Feb 2019", "Interview Descriptions": "Applied online, then 2 days later heard from recruiter from HR. Then after phone interview moved on after I accepted the hourly wages. Then they passed on my credentials to the hiring managers who were hiring for specialty offices that I sought out. Within a weeks time I received an email for a email with manager, I informed them I was out of state and requested a Skype interview which they welcomed. It was new to me but was very professional although they could see me they stated there Skype wasn't working well so I couldn't see them, kinda of uncomfortable in that aspect.", "Interview Questions": "Asked about how I handle irate patients and what was the outcome. "}, {"date": "20 Mar 2019", "title": "Home Health RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at BayCare Health System (Tampa, FL) in Feb 2019", "Interview Descriptions": "Phone interview with recruiter, then in person interview with hiring manager. Very long process. Very simple process. Nothing difficult. Causal conversation with the hiring manager not real interview questions", "Interview Questions": "What is your strength and weakness "}, {"date": "6 Nov 2018", "title": "Medical Records Coder II (Remote) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 months. I interviewed at BayCare Health System", "Interview Descriptions": "Recruiter reached out to me 1st and after emailing my resume never heard back. I sent few email follow ups since i was really interested in this position, my friend that works there also tried reaching out for referral but never heard back. Very disappointed how this recruiter handles application process.", "Interview Questions": "N/A"}, {"date": "22 Apr 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BayCare Health System (Clearwater, FL) in Oct 2018", "Interview Descriptions": "The first interview at the MLK office went average, but I didnt get hired there. Then the second interview in Clearwater with Brittany was nice, friendly and good conversation with whom I interviewed with. We laughed and had a good time, then i got hired the same day.", "Interview Questions": "Why do you want to work at an urgent care?"}, {"date": "17 Oct 2018", "title": "CT Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System (Clearwater, FL) in Oct 2018", "Interview Descriptions": "Call from manager, very casual interview with an invite to come back for a two hour wishing interview. This was very nice because it gave way to actual processes and to valuable questions I may not have thought of.", "Interview Questions": "Tell me about your background."}], [{"date": "14 Dec 2018", "title": "Onsite Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BayCare Health System in Oct 2018", "Interview Descriptions": "the overall interview process was good! I applied online & following day received email asking to set up an interview.  My first phone interview went really well maybe 20 mins long.  about a week later i had second interview asking a few additional questions & later a one on one in person interview", "Interview Questions": "typical interview questions such as why baycare. none of questions were unexpected "}, {"date": "4 Jan 2019", "title": "HIM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BayCare Health System in Aug 2018", "Interview Descriptions": "Received the Job offer really quickly  very low key. However be  very careful of what is told to you during the interview. Also pay very close attention to the benefits that are offered. and the amount of hours worked during slow seasons", "Interview Questions": "where do you see your self in the future "}, {"date": "15 Mar 2019", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at BayCare Health System (Tampa, FL) in Jul 2018", "Interview Descriptions": "1 hour phone interview with the Marketing Manager, 30 minute in-person interview with the Marketing Director, and 1 hour in-person group interview with the Marketing Team. Took about 2 weeks total, very enjoyable experience. Group interview was fun and informative. Everyone was very transparent and honest about the position. I felt comfortable asking questions and talking to everyone throughout the process.", "Interview Questions": "Tell us how your past job experiences would contribute to this position. "}, {"date": "26 Jun 2018", "title": "Social Service Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System", "Interview Descriptions": "The hiring process was a good experience for me. I applied and received a call within a week. I had a phone interview, and then a face to face with 5 staff members. I was offered the position a day later.", "Interview Questions": "What is a weakness of yours? "}, {"date": "11 May 2018", "title": "Pharmacy Technician CPhT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BayCare Health System", "Interview Descriptions": "It was surprisingly quick at first. I got a phone call and email in two days or so, then I called to set up an interview the following week. After the 1 on 1 interview there was a quick meeting with other team members. The longer part was the wait between the offer and orientation as everyone is forced into going to an orientation at the office in clearwater and that appears to only happen once a month.", "Interview Questions": "If I knew how to do the job and had the appropriate training"}, {"date": "12 Feb 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BayCare Health System (Tampa, FL) in Jan 2018", "Interview Descriptions": "Applied online.  Contacted via email by HR.  Had phone interview with HR representative.  Then had in person interview with members of the leadership team.  Offered the job same day by phone call.", "Interview Questions": "Name a strength and a weakness you have. "}, {"date": "23 Aug 2018", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BayCare Health System (Tampa, FL) in Jan 2018", "Interview Descriptions": "I received a call from HR to set a 30-60 minute interview with HR via phone.\nWhen they called me they asked me a series of questions related to my work experience, personality, and education. \nExamples:\nWhat is your work experience? \nHow long have I been a nurse?\nVerify my degrees\nWhat are my certifications?\nEtc...\n \n\nAfter this, the HR recruiter said that I would be a good candidate and he would set me up with an interview with two managers from the main facility. \nI set up a date and time.\nWhen I arrived, I went to the information desk in the front lobby. It was great that the parking was free and convenient. \nA lady from the front desk called them upstairs to tell them I arrived. I was escorted by a greeter to the elevators which was really nice because for sure I would have gotten lost in the maze of the facility. I went up to the designated floor and one of the managers met me at the elevator and escorted me to a classroom. The told me to have a seat and they would go get the other managers. I was interviewed by a panel which included the MICU and ICU manager and a charge nurse from one of the units. \nAfterwards, they gave me a tour of both ICUs and introduced me to staff.\nOverall it was very pleasant. Everyone from the front desk up and up was super helpful and kind. the unit itself was clean, organized. They patient rooms of the MICU was spectacular.", "Interview Questions": "Have I ever been tardy"}, {"date": "10 Jan 2019", "title": "Housekeeper Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at BayCare Health System (Tampa, FL) in Jan 2018", "Interview Descriptions": "went great! everything was as planned and the professionalism of the interviewer was evident. She was polite and she gave me time to answer all of my questions. I would highly recommend this hospital as everyone is kind there.", "Interview Questions": "rough situation"}, {"date": "14 Oct 2017", "title": "Anesthesia Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Bartow, FL) in Oct 2017", "Interview Descriptions": "I had a phone interview with the recruiter followed by an interview at the hospital. The interviewers made me feel very welcomed which helped with my nervousness. They asked very good questions as did I.", "Interview Questions": "What made me apply for the position at their institution?"}, {"date": "25 Aug 2017", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at BayCare Health System", "Interview Descriptions": "The initial process is grueling for a PCT. I've heard other people say that they got a call within a week of putting in an application, I put in around 70. I started getting some calls, got scheduled for a phone interview, then scheduled for a face to face with the hiring manager. One of my other friends who works for the system said if you get the face to face, you pretty much got the job. I received an offer a couple days later and accepted. After the initial call backs, the process was swift. Getting to that point is a waiting game.", "Interview Questions": "What do you think you can improve on?"}], [{"date": "10 Oct 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BayCare Health System (Largo, FL) in Sept 2017", "Interview Descriptions": "Phone interview followed by in office interview. The recruiter emailed with a date for the phone interview. We chatted for about an hour and she was a wealth of info and went through company openings to make sure I had applied for all relevant positions.", "Interview Questions": "Experience"}, {"date": "10 Mar 2018", "title": "Food Service Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System (Saint Petersburg, FL) in Aug 2017", "Interview Descriptions": "short, basic questions. there were 5 people there. only 2 asked questions, the rest stared at me and then i left. lasts 15 minutes if that. intensive references process, email survey sent via email to references", "Interview Questions": "why do you want this job"}, {"date": "21 Jun 2017", "title": "Master Level Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System", "Interview Descriptions": "I applied and a week later received a call from a supervisor to do a in-person interview. After the in-person interview, the recruiter emailed me re: references and we set up a date to speak.", "Interview Questions": "How do you encourage someone to change? "}, {"date": "9 Jun 2017", "title": "Medical Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Confusing. Why do I have to know someone to work here or wait a month to see if I was hired? Horrible most troubling process on how people are treated when they are clearly qualified.", "Interview Questions": "Fair questions "}, {"date": "6 Jun 2017", "title": "Clinical Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 6 weeks. I interviewed at BayCare Health System (Lutz, FL)", "Interview Descriptions": "I Applied online through Taleo, passed the initial computer screening , and  got a call from HR for a in person interview. The interview was panel style with 3 hiring managers. I was called back 2 weeks later by HR and had a final phone interview that took about 35 min. Then I was offered the position.", "Interview Questions": "Why do you want to work at Baycare?"}, {"date": "22 May 2017", "title": "Registered Nurse, Critical Care Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System", "Interview Descriptions": "Applied through Job Board, easy to submit. Called by educator to set up first interview, approximately  one week from closure of application. First interview with floors nurse educator assistant and unit charge nurse. They were nice, provided clear description of the program and asked several interview questions. Interview lasted about 30 minutes. Called for second interview about a week later, this is tomorrow. Sorry night shift, all interviews are done during days.", "Interview Questions": "Why do you want to be a critical care nurse?"}, {"date": "5 Apr 2017", "title": "Social Service Specialist I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BayCare Health System in Apr 2017", "Interview Descriptions": "I am currently going through the interview process and came here to get information. I struggled finding anything on this particular position and because of that, I thought it'll be nice of me to share my experience for others applying for the Social Services Specialist I position. \r\n\r\nI originally applied for the position on Monday, March 27, 2017. On Thursday, March 30, 2017, I received an email from a recruiter informing me that she would like to schedule a phone screen as part as the first step in the interview process. \r\n\r\nToday, April 4, 2017, I had my phone screen at 1:30pm. The questions were very basic. She discussed salary and the next steps if I were to be selected to continue. After the \"phone interview,\" she asked if I was comfortable with the salary and informed me that my information would be passed off to the hiring manager. A few hours later, I received an email asking me to submit my references. \r\n\r\nI'm praying and keeping my fingers crossed! I really want this position. \r\n\r\nBy the way, I was told the starting salary is $21.00 for my 5 years of experience and having a Bachelor of Arts in Psychology degree (A bachelor's degree in some type of social service field is required for this position) \r\nThey also hire for Social Service Specialist II and I'm sure the pay will be higher. The requirement for that position is to have a Masters degree in some type of social service field (i.e, Psychology, Healthcare Administration, Counseling, and etc.) I graduate this June (2017) with my Masters of Science degree in Counseling, so hopefully I'm offered a position now and able to transition later. *Fingers Crossed*", "Interview Questions": "Why do you want to leave your current job? "}, {"date": "18 Dec 2019", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at BayCare Health System (Saint Petersburg Beach, FL) in Mar 2017", "Interview Descriptions": "Short, panel interview with the charge nurses and the manager of the unit. Asked about prior experience and educational experience and several behavioral questions. The interview was no longer than 30 minutes and came with an offer soon after.", "Interview Questions": "What experience do you have to be an educator?"}, {"date": "20 Feb 2017", "title": "Emergency Services Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System (Riverview, FL)", "Interview Descriptions": "Submitted an application and received an email several days later regarding a phone interview. Had my phone interview and was asked to come in for a f2f. Had the f2f interview, which lasted approximately 30 minutes and went very well in my opinion. Was escorted around the ER and given a tour. Was told that I would be contacted in a week and never heard anything again. I called the manager and inquired about my application and was told that I would be contacted the next day regarding yet another interview. Well, nothing ever happened. Why can't companies send out a do not reply email if you haven't been selected? It's very disrespectful to leave someone waiting for an answer and doesn't give people a good impression of the company.", "Interview Questions": "What was a scenario that put me in a high stress situation and how did I handle it."}, {"date": "25 Feb 2017", "title": "Advanced Practice Provider Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at BayCare Health System (Tampa, FL) in Feb 2017", "Interview Descriptions": "Communication between HR and myself was poor. Went through interview process only to learn they had extended offers to other candidates before my interview. Dinner was great but overall my experience was poor.", "Interview Questions": "What's your story?"}], [{"date": "25 Apr 2017", "title": "MHT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Dunedin, FL) in Jan 2017", "Interview Descriptions": "MULTI LEVEL INTERVIEW...Step ONE Application Selection Process (This took 2 weeks).Step Two Recruiter Phone Interview (1)(30 Min Interview). Step Three Site Interview(45 Min Interview). Step Four Recruiter Phone Interview (2)(15 Min Interview).", "Interview Questions": "If you saw a co-worker yelling at a patient or becoming borderline abusive how would you handle the situation ?  "}, {"date": "2 Feb 2021", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Riverview, FL) in Jan 2017", "Interview Descriptions": "Quick and fast. Usual interview questions. Talk about your experience level and how you can improve the cleanliness of hospital. Team player who works hard. \r\nAlways want to give the best ossicle customer service you can. Strive for excellence", "Interview Questions": "Why do you want here at Baycare? "}, {"date": "10 May 2019", "title": "Assistant Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BayCare Health System in Dec 2016", "Interview Descriptions": "Phone screening, in person interviews, panel interviews. Involved staff to allow questions and discussions about the unit from an employee perspective. Professional and informative of benefits and organizational values.", "Interview Questions": "Why work there? "}, {"date": "14 Dec 2016", "title": "Lab Assistant IV Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BayCare Health System (Tampa, FL) in Nov 2016", "Interview Descriptions": "I applied online and was called by the recruiter the same day. She scheduled an interview with the lab manager the next Monday morning and another phone call with her the afternoon after my interview. The lab manager and supervisor were very nice, and so was the recruiter. Unfortunately, I didn't get the job.", "Interview Questions": "They gave several scenarios and asked me to rate myself on a scale of 1 to 10"}, {"date": "17 Jan 2017", "title": "Management Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Clearwater, FL) in Oct 2016", "Interview Descriptions": "excellent interview, actually thought it went well, i thought i was going to be hired, but never heard back from them, so i guess they chose someone else for the position", "Interview Questions": "How long have i been in practice management"}, {"date": "24 Oct 2017", "title": "MA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at BayCare Health System (Tampa, FL) in Oct 2016", "Interview Descriptions": "Very simple and straight forward, they only asked what was necessary and dint have you fill out a personality quiz. Once the interview was over you knew right away if you got a job offer or not", "Interview Questions": "what can you contribute to the company"}, {"date": "9 Nov 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at BayCare Health System (Clearwater, FL) in Jul 2016", "Interview Descriptions": "Very straight forward. Most of it is over the phone afterwards, you are scheduled to go into the Clearwater, FL office and complete the interview in person with the nurse manager.. I submitted all of my certificates. Completed some paperwork and moved on to the health screening interview.", "Interview Questions": "Worst scenario you have encountered."}, {"date": "3 Nov 2016", "title": "Director of Ecommerce Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Tampa, FL) in Jun 2016", "Interview Descriptions": "Applied Online.Got an email from HR person-Alison Raab for phone screening. 30 mins call. No email or follow up call. Sent a couple of follow up emails to the HR person requesting status update.No response. \r\nHere is my 2 cents: Just like you are interviewing the person, the person is interviewing your company too. Its 2 way road. When HR does not respond and let the candidate know of the result(either yay or nay)-it is a reflection on the company and their process and not just that HR person. Courtesy and empathy are two key attributes which obviously this company or the HR lacks.", "Interview Questions": "Experience"}, {"date": "31 Jul 2016", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at BayCare Health System (Tampa, FL) in Jun 2016", "Interview Descriptions": "Interviewed with hiring manager & coordinator. Was told I would hear something in 2 weeks. The next week received call from Team Resources with a few more questions and a job offer.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "23 May 2016", "title": "Medical Office Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at BayCare Health System (Clearwater, FL)", "Interview Descriptions": "Amazing. Thorough, professional, respectful. A recruiter emailed me to schedule a phone interview. After the phone interview I was called by a few site managers. I interviewed in office, and was called the next day with an offer.", "Interview Questions": "What career goals do I have? \r\nWhat is my ideal job duties? \r\nWhat is my ideal working environment? \r\nGive an example of a time where I had to deal with a difficult patient/client."}], [{"date": "26 Jul 2016", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at BayCare Health System (Tampa, FL) in May 2016", "Interview Descriptions": "Phone call very long time to wait ((2 months) and than interview F2F. Process is very time consuming - unfortunately they have very loond delay to provide you with answer.", "Interview Questions": "Typical questions related to resume."}, {"date": "20 Jan 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at BayCare Health System (Tampa, FL) in May 2016", "Interview Descriptions": "It was a great interview. They made me feel very comfortable, they were interactive, and also very informative. The interview flowed like a normal conversation. They also asked scenario questions.", "Interview Questions": "My experince"}, {"date": "7 Oct 2016", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at BayCare Health System (Clearwater, FL) in Apr 2016", "Interview Descriptions": "good, didn't have to prepare much. I spoke with 5 different people in one room, very personal one on one. not hard, very friendly and i was able to be myself", "Interview Questions": "N/A"}, {"date": "28 Dec 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System (Tampa, FL) in Apr 2016", "Interview Descriptions": "The process was as expected. During the interview the staff was very friendly. The questions weren't very difficult or entrapping. Immediately after the interview I was offered a tour of the unit. This gave me an opportunity to further interact with the staff.", "Interview Questions": "Where do I see myself in five years?"}, {"date": "5 Dec 2017", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BayCare Health System (Nashua, NH) in Apr 2016", "Interview Descriptions": "no phone interview,  just in person and tour of the hospital. got to meet some of the staff and talked with 2 or the 3 unit managers. no tour of the hospital just unit. talked about qulifications and schooling", "Interview Questions": "what is my 5 year plan"}, {"date": "11 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BayCare Health System (Clearwater, FL) in Mar 2016", "Interview Descriptions": "The interview was very straightforward. I applied to a position as a nurse resident, as I jsut graduated school. The initial interview was a 'round-up' style interview where a large number (close to a hundred) of applicants were interviewed by managers from all of the med/surg and m/s/tele units across the Morton Plant Mease portion of BayCare. After moving forward at the round-up, I received another interview for the unit that I requested and was offered a position.", "Interview Questions": "A lot of theoretical nursing quesitons were asked in addition to team work questions, prioritization questions, and goals/future outlooks."}, {"date": "28 Apr 2016", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at BayCare Health System (Palm Harbor, FL) in Mar 2016", "Interview Descriptions": "The interviews were very short and informal; comfortable, yet a little more knowledge could be shared. The communication was frequent and good. I was told I would hear back - one way or the other - within a few days.  After not hearing for almost 2 weeks, I sent a detailed follow up email; only to receive a stock \"regrets\" email in response.", "Interview Questions": "The normal questions were asked; nothing out of the ordinary."}, {"date": "9 Apr 2016", "title": "Certified Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Clearwater, FL) in Mar 2016", "Interview Descriptions": "I'm not 100% sure the exact date i applied. But it was in February of 2016. I got called for an interview around the end of March. Interview process was so smooth. It was as if we were having a casual conversation over coffee. Not in a bad way, it just wasnt so nerve wracking and uptight and i wasnt petrified to be interviewed.", "Interview Questions": "What is one thing you feel you have to work on?"}, {"date": "30 Mar 2016", "title": "Customer Service Support Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BayCare Health System (Tampa, FL) in Jan 2016", "Interview Descriptions": "Applied for the job and it took about a month to get a response. If you know someone that works for baycare see if they can help you speed up the process. Took a month to get an interview in. The next day i was notified I got the job. Right before the interview HR called to reconfirm some questions. After the interview, HR called again to talk salary, benefits etc, and let you know where to report for 1st day orientation at Baycare HQ in clearwater. Then you get your own orientation at your respective location. Ask as many questions as possible. Sometimes the job posting doesnt really entail everything, quite vague.", "Interview Questions": "Are you planning to continue your education?"}, {"date": "15 Jan 2017", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BayCare Health System (Tampa, FL) in Jan 2016", "Interview Descriptions": "I was first screened by HR on the phone. I was then interviewed by the manager, the assistant manager, and the educator in the manager's office. They reviewed my resume with me and asked me the standard interview questions. They obviously wanted me to have questions about the job, instead of just answering their questions.", "Interview Questions": "They asked me to describe what I thought the specialty was going to be like."}], [{"date": "4 May 2020", "title": "RN Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at BayCare Health System (Clearwater, FL) in Jan 2016", "Interview Descriptions": "The interview occurred on time, with one HR person. Then I met with the manager and had a little interview with him. The questions were average, not difficult. Submitted application on-line and within 2 days was called for the interview.", "Interview Questions": "Tell me about a difficult situation you had with another team member and what you did?"}, {"date": "6 Nov 2015", "title": "Customer Service Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BayCare Health System", "Interview Descriptions": "I had a total of 2 interviews, one phone and one in person panel interview. The formats were very relax with typical interview questions related to personality and past work experience.", "Interview Questions": "Describe a time you had a disagreement with a co-work. How did you handle this situation?"}, {"date": "3 Oct 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BayCare Health System (Safety Harbor, FL) in Oct 2015", "Interview Descriptions": "Met with the Manager and 3 Coordinators, they were very professionals and thorough in the interviewing process. Each asked me a set of questions based on my experiences and the reason I chose Baycare to work for.", "Interview Questions": "Why did want to work for Baycare."}, {"date": "13 Jun 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at BayCare Health System (Tampa, FL) in Sept 2015", "Interview Descriptions": "Three coordinators had worked with me previously. They told our Manager to offer me the job. They asked if I wanted the job.  I said yes, I was hired.", "Interview Questions": "Did I want the job?"}, {"date": "9 Oct 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BayCare Health System (Tampa, FL) in Aug 2015", "Interview Descriptions": "Computer based application, emailed a manager my resume, got a call from team resources to interview, then had the in person panel interview and then reference review where I had to submit names and email addresses of my professional references then phone interview with team resources", "Interview Questions": "Describe a typical shift/ how you set up your day"}, {"date": "21 Aug 2015", "title": "Site Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BayCare Health System (Saint Petersburg, FL) in Jul 2015", "Interview Descriptions": "I first received a call to be set up with a phone screen. The date was set and it came and went with no call. I contacted the person that initially set up the screening and she apologized and reset the date. I then received a phone call to set up an interview. I was also set up with an online site to list my references which I did and all answered back but the next day.I receive another call to change the interview date with the Practice Administrator and a doctor in a different office than what I applied for. \r\nThe day of the interview the Practice Administrator was impressed and also mentioned that she would like me to interview with a different office as well. The doctor that I came back and met with that day told me that my resume was impressive and that she hoped I would consider working for her. At that time the Practice Manager gave me her card and encouraged me to contact her with questions or to check on the status. That afternoon I sent her a thank you email and a question that I had thought of. No return email. \r\nThe next week I received a call and was set up with an interview for the second doctor office. I met with three doctors and was told that the Practice Manager was unable to make it. The interview appeared to go well. I wrote a second thank you to the Practice Manager and a question regarding the second position that I interviewed for. No return email. \r\nA week went by and I tried to call the Practice Manager and get an update. I left a message with her assistant. About an hour and a half later I received a generic email stating that I was not being considered for the position that I originally applied for and never even interviewed for.\r\nI find the way that I was handled very unprofessional. It's too bad because Bay Care appears to be a great company to work for.", "Interview Questions": "There really wasn't any difficult or unexpected questions for the position that I was interviewing for. "}, {"date": "5 Apr 2016", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at BayCare Health System (Tampa, FL) in Jul 2015", "Interview Descriptions": "Overall the experience was pleasant and atmosphere was not stressful, the interviewer was thorough and was  asking us on how to handle several\r\nScenarios .. She question us on our eligibilities and reasons why we  are appropiate with this job.  The interview lasted for an hour but seems like we were just having a comversation . The interviewer was knowledgable in her foeld and was able to answer all\r\nOur concerns with the offer", "Interview Questions": "Why should we hire you?"}, {"date": "12 Jul 2016", "title": "Chaplain Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Clearwater, FL) in Jul 2015", "Interview Descriptions": "I initially interviewed with one of the CPE Supervisors, after which I interviewed with a group of individuals in the Pastoral Care department. The interview was congenial yet challenging and served as excellent experience for future interviews.", "Interview Questions": "What was the most difficult feedback that you received during your last unit of CPE?"}, {"date": "20 Jan 2018", "title": "ICU RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at BayCare Health System (Winter Haven, FL) in Jun 2015", "Interview Descriptions": "Basic interview questions such as why you wanted to become nurse. A tour of the department I was interviewing for along with starting pay, benefits, job role, etc. Also basic body lift dynamics, stretching and drug test were done", "Interview Questions": "Why did you choose nursing?"}, {"date": "26 Aug 2019", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System (Brooksville, FL) in Jun 2015", "Interview Descriptions": "After initial HR outreach one interview. Done by supervisor and several members of the team.  I was not told that I was going to be interviewed by that many people at once so it was a little unnerving when I walked into meeting room and I sat at one table and 10 other people sat at two other's on either side of me.", "Interview Questions": "a lot of questions about time management and how you handle workload and documentation. "}], [{"date": "28 Jul 2017", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at BayCare Health System (New Port Richey, FL) in Jun 2015", "Interview Descriptions": "met in persons office, sat down after shaking hands and exchanging greetings and introductions, then they asked about my past experience and what qualified me for the position, I answered that I have been cleaning houses since I was 8 years of age and its basically all I know how to do, cleaning is my life pretty much, its what I am good at and surprisingly it is actually enjoyable to be and its a great stress reliever for me as well.", "Interview Questions": "what qualified me for the job?"}, {"date": "30 Apr 2015", "title": "Master Level Practitioner Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System", "Interview Descriptions": "I applied online for the position. About 1 week later, I received a phone call from a supervisor screening if I enjoyed working with children/families and if I wanted to work in-homes. After that a 1:1 interview was set up. I met with the supervisor and the interview was standard (normal interview questions) and professional. The interview lasted about 1 hour.", "Interview Questions": "What would you do if a child started attacking a parent?"}, {"date": "25 Apr 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at BayCare Health System in Apr 2015", "Interview Descriptions": "I applied online, and received a phone call from a Nurse Recruiter a few days later to set up an interview.   I interviewed with a Nurse Recruiter and the Nurse Supervisor for the position/floor I applied for.  I was required to have 5 references that could fill out an online survey,  with two of the references being current or former managers. A couple days later I received a job offer.", "Interview Questions": "Name something you did to resolve a problem a patient was having?"}, {"date": "26 Oct 2019", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at BayCare Health System (Tampa, FL) in Mar 2015", "Interview Descriptions": "face to face with manager, questions and statements regarding culture of the unit applied for and expectations. Future goals of interviewer. Understanding of baycare values. follow up phone call from team resources for job offer.", "Interview Questions": "Know baycare values and how you use them daily. "}, {"date": "17 Apr 2015", "title": "RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at BayCare Health System in Jan 2015", "Interview Descriptions": "Dont waste your time. After doing a phone interview, which the recruitor called 20 minutes late, this should have been the first bad sign.This company tells you they will have someone call you either way within one week. Here its been three months and I get a rejection email.If a person takes the time to do a phone interview and go through the reference process, they should have common courtesy to keep you informed.", "Interview Questions": "Scenario questions"}, {"date": "12 Oct 2016", "title": "Sterile Processing Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at BayCare Health System (Tampa, FL) in Jan 2015", "Interview Descriptions": "Standard questions. They want to make sure you are willing to learn something new and can get along with different people. There are some tricky questions, as long as you give examples you are ok.", "Interview Questions": "How well do you work in a team? Give us some examples.\r\nCan you work overtime on holidays?"}, {"date": "21 Dec 2014", "title": "Locum Tenens Psychiatrist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at BayCare Health System", "Interview Descriptions": "Locum company made the contact.Then there were phone interviews with two people after submitting cv and filling out many forms.The senior psychiatrist quit in the middle of the process and the woman who finished was an administrator who was impersonal and not very clinically sophisticated.Then a second mid level administrator spoke to me several times,but after hiring was unavailable to discuss possible improvements in the clinical program.", "Interview Questions": "They had none for me. I asked them why they had trouble keeping psychiatrists"}, {"date": "23 Feb 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at BayCare Health System (Tampa, FL) in Nov 2014", "Interview Descriptions": "Telephone interview with HR followed by in-person interviews with department managers.  Follow up offer by telephone from HR.  I made sure I thoroughly researched the company and position prior to the interview.  During the interview process, I asked several questions to make sure BayCare and this specific department and position was a good fit for me.  Not only was I being interviewed but I also was interviewing them at the same time.", "Interview Questions": "Why do you think you're the right candidate for our department?"}, {"date": "25 Sept 2014", "title": "Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System (Safety Harbor, FL)", "Interview Descriptions": "The phone interview portion was appropriate and professional.  The one-on-one with the hiring manager was interrupted several times, as she was going through Joint Review at the time of my interview.  It was distracting and chaotic.  There was overwhelming number of people in the room for the final panel-style portion, that did not seem to have a purpose and did not know how to conduct an interview.", "Interview Questions": "This is the most surprising part.  There were no difficult questions and I still did not get the job.  I believe that this was because the members of the panel did not know how to conduct an interview."}, {"date": "13 Nov 2015", "title": "Lab Medical Assistant III Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at BayCare Health System (Clearwater, FL) in Aug 2014", "Interview Descriptions": "it was great interview. people are were nice. it was group interview with superviers i dont know what else to say about it. just go thru,...........Stop asking me more about it.", "Interview Questions": "flexable hours"}], [{"date": "15 Sept 2014", "title": "IDM Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BayCare Health System (Clearwater, FL) in Jul 2014", "Interview Descriptions": "The overall process took over a month with 4 interviews the first one a phone interview with the manager, the second with HR over the phone, the third interview was with the manager and two of her senior IDM analysts the last one was with the Info Security Manager.", "Interview Questions": "Brought into the Info Sec Managers office on the last interview and was asked to ask him any questions I had about the position and company."}, {"date": "11 Aug 2015", "title": "Chaplain Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BayCare Health System (Wetumpka, AL) in Jul 2014", "Interview Descriptions": "Interview took place via FaceTime; Interview Panel asked questions related to pastoral care visits and expectations; The Director of Pastoral Care; The CPE Manging Supervisor; and The Staff Chaplain were included in the interview.The panel discussed extending the invitation for me to join the team and followed up via telephone within the hour.", "Interview Questions": "How would I, with a Christian background, respond to the needs of a diverse hopsital census. Example: how would I address the needs of a Muslm woman with stage 4 breast cancer."}, {"date": "25 Jun 2014", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at BayCare Health System", "Interview Descriptions": "This  process had  a  lot of  paperwork and  requirements. Overall the interview was  not  very scary the manager  was to  the  point   with expectations  and  requirements.", "Interview Questions": "most difficult scenario you have had to deal with and how  did  you  handle it."}, {"date": "14 Sept 2015", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at BayCare Health System (Tampa, FL) in Jun 2014", "Interview Descriptions": "Short, brief, fairly pleasant, not alot of questions were really asked. Brief description of the job. Recruiter was rude, but kept a pleasant tone. Overall interview process was easy and short. There were 2 interviews before an offer was made and the background and drug and reference check.", "Interview Questions": "Positives and negatives in the field"}, {"date": "2 Nov 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System (Tampa, FL) in Jun 2014", "Interview Descriptions": "it was a group interview. everyone that was applying for the position was all in the same room. they do things differently now. they went around the table and asked everyone the same questions, it was hard because sometimes the person before you truly said what you wanted to say. all 5 of the nurse managers from each floor spoke to us. then at the end asked us which floor we wanted to work on.", "Interview Questions": "why do you want to work here"}, {"date": "16 Mar 2014", "title": "Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System", "Interview Descriptions": "I was called by a recruitor who set up a phone interview for following week. I did the phone interview and was advised that I would get a call early the following week by practice manager. It has been 1 month and still have not heard anything. I have left 2 voicemail messages with no return call.", "Interview Questions": "What bothers you about co workers and what would you do"}, {"date": "8 Aug 2015", "title": "Corporate Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System in Dec 2013", "Interview Descriptions": "Detailed phone interview with recruiter which lasted approximately 1 hour at least. Review of application,work history and behavioral based questions. Interview in person with recruiter and hiring manager. Detailed and thorough.", "Interview Questions": "Give me an example of the most difficult position you had to fill. What was the situation and what did you do?"}, {"date": "20 Apr 2017", "title": "RN Professional Role Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BayCare Health System (Clearwater, FL) in Dec 2013", "Interview Descriptions": "The interview process was great and there were staff key employees present also for input  during this interview proceed also from other departments which would be in contact with you", "Interview Questions": "What would be your dream job if not this one "}, {"date": "21 Feb 2016", "title": "Contract Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System (Clearwater, FL) in Nov 2013", "Interview Descriptions": "Two group panel interviews. Second was Sit down meeting In conference room with potential manager, co-worker and staff attorney. That interview appeared to be normal until the last question. No answer provided was acceptable. The same question was asked four times. Then the interview ended abruptly. See question below.", "Interview Questions": "What do you do if you have too many projects coming due and you might not make a deadline?"}, {"date": "5 Nov 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at BayCare Health System", "Interview Descriptions": "Was called for an interview after about 2 weeks. Interview by 4 members of their staff. Asked questions about my resume why I choose them and a few other basic questions. Nothing difficult if you are prepared.", "Interview Questions": "Nothing overly difficult."}], [{"date": "9 Oct 2013", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BayCare Health System", "Interview Descriptions": "Extremely long and grueling interview process. I had 3 separate interviews where they rapid fire questions and scenarios. It was very intimidating. They were very professional through out the interview, but not very personable. Lots of questions starting with \"Tell me about a time that you did this...\" or \"Tell me when you have been put in this situation and what you did to resolve it...\"", "Interview Questions": "What would you say to your boss if you didn't agree with their way of doing something?"}, {"date": "9 Sept 2013", "title": "Social Media Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BayCare Health System (Clearwater, FL)", "Interview Descriptions": "Following the online application, I received a phone call from a recruiter. After that, I had a phone interview with the hiring manager. After that, I was asked to come in for a 1-1 interview with the hiring manager. And then I was asked to come in again for a larger interview with about 10 different people.", "Interview Questions": "I don't recall there being a particular question that surprised me."}, {"date": "19 Oct 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at BayCare Health System (Tampa, FL) in Jul 2013", "Interview Descriptions": "My interview with BayCare was over 5 years ago.  The process was professional and the interviewers were proficient when describing the company, benefits, policies and procedures.  The questions asked were typical for a registered nurse.", "Interview Questions": "N/A"}, {"date": "9 Oct 2017", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at BayCare Health System (Clearwater, FL) in Mar 2013", "Interview Descriptions": "I met with the hiring manager and the rest of the team.  They had several questions for me regarding my education, experience, and work style.  They explained to me what they were looking for and also the benefit package.", "Interview Questions": "They asked me about my experience and why I wanted to work with BayCare."}, {"date": "6 Aug 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at BayCare Health System (Dunedin, FL) in Feb 2013", "Interview Descriptions": "Phone interview that was very easy. They ask very general questions and are very nice. Then there is an in person interview with a panel of interviewers. They were not very friendly and asked a lot of questions off of a sheet of paper. They asked questions that I didn't have answers for because I had never worked as a nurse before. I thought that was strange. Although the interview didn't seem to go well I got the job.", "Interview Questions": "Tell me about a time when you didn't like how management did things and what did you do about it?"}, {"date": "10 Aug 2015", "title": "Medical Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at BayCare Health System (Tampa, FL) in Feb 2013", "Interview Descriptions": "Quick HR initial interview and turnaround time for interview with management was fairly quick. Interview was with hiring manager as well as other managers in order to have a panel interview. Questions focused on experience and team work as well as career goals. I was able to ask questions in turn about the management style, work assignment, opportunities for advancement, and other benefits such as the ability to work from home.", "Interview Questions": "Why should we hire you?"}, {"date": "22 May 2013", "title": "Copywriter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BayCare Health System (Clearwater, FL) in Jan 2013", "Interview Descriptions": "I got a call from a BayCare in-house recruiter, who interviewed me and scheduled me for an in-person interview. At the in-person interview, there were three people present: Creative Director, Art Director, and Sr. Copywriter. It was a laid back, casual interview, which accurately reflects the work environment. These folks are as they appear: no phony corporate shills here. This is good because if you respond well in the interview, then you probably will like working for/with them.\r\n\r\nOne thing later in the process was how long it took the company to process my background check. I was unemployed, so waiting extra weeks for red tape was a financial struggle. It finally cleared, needless to say.", "Interview Questions": "Be prepared to copy edit a handout. "}, {"date": "10 Jul 2013", "title": "Systems Marketing Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at BayCare Health System (Clearwater, FL) in Oct 2012", "Interview Descriptions": "Interview process is extensive.  I met with approximately 15 people on multiple occasions. Last interview was 5 hours long.", "Interview Questions": "N/A"}, {"date": "22 Dec 2015", "title": "Patient Financial Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System (Oldsmar, FL) in Sept 2012", "Interview Descriptions": "A phone interview then face to face interview with hiring mgr and coordinator then another phone interview with HR to negotiate salary. They will negotiate based on years of experience. It was an easy process overall. The process was also very transparent as I was guided and explained everything every step of the way.", "Interview Questions": "Name a time when you had to deal with a difficult customer."}, {"date": "28 Aug 2012", "title": "Lab Medical Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at BayCare Health System (Tampa, FL)", "Interview Descriptions": "takes time and be sure to follow up, they paid my expense to move to Tampa if i signed a year contract", "Interview Questions": "N/A"}], [{"date": "8 Oct 2015", "title": "Security Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at BayCare Health System (Tampa, FL) in Jun 2012", "Interview Descriptions": "Submitting paperwork for all my credentials at the time, as well as online forms which were a bit tricky, then Waiting in the lobby to get called into an interview and asked a few generic questions.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "26 May 2014", "title": "Diabetes Educator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at BayCare Health System (Safety Harbor, FL) in Jun 2012", "Interview Descriptions": "I had 2 interviews in person. One was with both the manager and program director, one was with the manager only. I was a team member transferring. At least I received an email while waiting to hear. When hired, I simply got an email. \"Hey!\". Nothing more", "Interview Questions": "Do you think you will be able to handle the transition from being an administrator to being a patient caregiver? What will be the hardest transition?"}, {"date": "18 Apr 2013", "title": "Radiology Tech Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BayCare Health System (Largo, FL) in Mar 2012", "Interview Descriptions": "Long process.  Seems the personnel in Human Resources were a little off.  I had to speak to them several times before I finally got an interview.  I had to wait for the manager at least half an hour past my appointment time.", "Interview Questions": "Unexpected question, do I work well with others?  Who is going to say no?"}, {"date": "24 Mar 2015", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at BayCare Health System in Feb 2012", "Interview Descriptions": "The interview process was way too lengthy for the level of job. Had to come in four separate times in addition to phone interview. No one had established questions except for the HR person who conducted the phone interview. Made the process feel disorganized and thoughtless.", "Interview Questions": "Why did you leave your last job?"}, {"date": "27 Jul 2016", "title": "Pst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System (Lutz, FL) in Feb 2012", "Interview Descriptions": "it was long and very good they only hire the best. the interviewer was very nice and professional. They made me feel good and positive.they asked very good question and when i asked questin they answer them very good", "Interview Questions": "how well you get along with other"}, {"date": "13 Jan 2012", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at BayCare Health System (Tampa, FL) in Jan 2012", "Interview Descriptions": "They called me in for an interview. Required a one page report on questions like \"why do I want to work for baycare\". I chose the date and time to interview, then came in and interviewed.", "Interview Questions": "More situational questions like how would you give report on a patient. "}, {"date": "2 Aug 2015", "title": "Ultrasound Technologist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at BayCare Health System (Tampa, FL) in Sept 2011", "Interview Descriptions": "HR is very slow to respond to applicants. You have to follow up and be persistent. \r\nThey seem to have a lot of control and little accountability when it comes to responding in a reasonable time frame. Even as a current employee they ignore application request and take weeks to reject or accept.", "Interview Questions": "N/A"}, {"date": "17 Aug 2011", "title": "Office Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BayCare Health System (Safety Harbor, FL) in Aug 2011", "Interview Descriptions": "Applied online. Called for interview the following day. Went to HR interview, told to interview the following week with office manager. Went to that interview and was told to come back next week to interview with the physicians. Went to that interview and was told that they would call me at the end of the week with the final decision. Was called at the end of the week and asked to come in next week for another interview with office staff, went to that interview and was told they would know in a few days and call me. Never heard back. I called and spoke to manager who said they would call me by the end of the following week. Still heard nothing. Left voice mail, nothing. Finally sent email, and got a response saying they were sorry for not getting back to me but they went with someone else.", "Interview Questions": "I was asked to come in and sit down with all of the other employees, who asked me personal questions about if I had kids and so on."}, {"date": "5 Oct 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at BayCare Health System (Clearwater, FL) in Jul 2011", "Interview Descriptions": "It was a very positive interview. I felt a connection to the interviewer and wanted to work for her.  She told me at the end of the interview that an offer would be made.", "Interview Questions": "Situational questioning."}, {"date": "28 Jun 2012", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at BayCare Health System (Dunedin, FL) in Apr 2011", "Interview Descriptions": "Sat down and was asked questions about my work history and qualifications.", "Interview Questions": "How did handle a difficult situation with a customer in the past. "}], [{"date": "11 Oct 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at BayCare Health System (Tampa, FL) in Mar 2011", "Interview Descriptions": "My first interview was very professional. The people in charge of HR however, are not as professional in my opinion. Continuing education should be required for everyone working in healthcare.", "Interview Questions": "N/A"}, {"date": "30 Jul 2015", "title": "Patient Accounts Receivables Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at BayCare Health System (Clearwater, FL) in Mar 2011", "Interview Descriptions": "There was six of us interviewed for an Internship Program from The Medical Billing & Coding Program at the Technical College .After several months the supervisor asked me if I would like to be come full-time permanent employee. I had to go through drug testing, background & criminal check. Pass a physical.", "Interview Questions": "Could I should up for work to 40 hrs a week with a smile on my face. I had to dress in business attire.\r\n"}, {"date": "5 Aug 2015", "title": "Clinical Pharmacist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at BayCare Health System (Tampa, FL) in Jan 2011", "Interview Descriptions": "Unprofessional behavior and asked personal questions not relevant to the job. Experience in the job market was not valued, and dismissed as standard. The interviewers did not know what questions to ask, and were very unprofessional in their personal questions.", "Interview Questions": "Would you work outside the company on your days off?"}, {"date": "25 Jul 2010", "title": "IT Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at BayCare Health System (Clearwater, FL) in Jul 2010", "Interview Descriptions": "I applied on a for the position and was contacted for an interview within 2 days. The interview was in person, the interviewer was very nice and first asked what my background was, then followed up on my response, then described the position some, but was sort of vague in the positions specific duties. Asked about what their 5 core qualities meant to me, they were up on the wall in posters, they were trust, respect, and a 3 others I cant remember.  Stated they were going make a decision in 1-2 weeks.", "Interview Questions": "Tell me what trust means to you."}, {"date": "3 Jan 2010", "title": "Health Care Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at BayCare Health System (Clearwater, FL) in Sept 2009", "Interview Descriptions": "Applied online to position listed on web site, and was called for telephone interview by recruiter.  This was followed by a personal interview held with two program managers.  Thoughtful dialogue ensued and I responded to questions with solid, practical answers.  I also followed up on the intervew by sending additional information that would be useful for program consideration.  \r\n\r\nAt the end of the process, it seemed that the program directors were not sure what they wanted in a candidate, or where to take the program.  They continue to consider these factors and the position is still advertised.", "Interview Questions": "What have you done in that prepares you for this position?"}, {"date": "9 Sept 2013", "title": "MRI Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BayCare Health System in Aug 2009", "Interview Descriptions": "The hiring process was seamless and pleasant.", "Interview Questions": "there were no unexpected questions during the interview process.  The human resource people were very courteous."}]]