[[{"date": "8 Feb 2023", "title": "Executive Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Republic Polytechnic", "Interview Descriptions": "Digitized as their first interview was using video interview tool. It was quite interesting to me. The people and HR seem nice during the final interview and asked relevant work experiences of mine.", "Interview Questions": "What is your expectation of your supervisor?"}, {"date": "11 Oct 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Republic Polytechnic", "Interview Descriptions": "There were 2 interviewers, if I remember correctly the Head of Department and vice-Head of Department. It was a pretty casual interview, asked about my past experiences, CCAs etc, quite basic and typical questions", "Interview Questions": "Basically asked about your past experiences, CCAs, what makes you a better candidate than others"}, {"date": "5 Apr 2022", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Republic Polytechnic (Singapore)", "Interview Descriptions": "Online application followed by basic phone screening. Relatively straight forward interview; panel with line manager, HR and other reps from across the organisation. Mostly competency based, related to lecturer role.", "Interview Questions": "Problem Based Learning - you will need to know something about this."}, {"date": "16 Feb 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Republic Polytechnic", "Interview Descriptions": "Interview process was smooth and able to answer with previous experiences. Questions asked during interview were manageable such as type of Microsoft excel word used, rating on skills like vlookup, pivot table.", "Interview Questions": "Describe your past work experiences."}, {"date": "10 Feb 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Republic Polytechnic", "Interview Descriptions": "Friendly group of people during interview. Will ask about your prior experience and knowledge in stats recommend you just be yourself during the process. This is a good place to work and find your collaborators", "Interview Questions": "What prior experience do you have in research ?"}, {"date": "16 Nov 2021", "title": "Assistant Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Republic Polytechnic (Singapore) in Aug 2021", "Interview Descriptions": "Had 2 rounds of interview many months back - quite easygoing and simple questions to present yourself. However HR took 6 weeks to get back (after 2nd interview). Not sure if its the red tape or paperwork that took such a long time.", "Interview Questions": "What was your greatest achievement at work?"}, {"date": "26 Nov 2020", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Republic Polytechnic", "Interview Descriptions": "I have to submit my resume and fill up an online application and display my interest towards the job. Clarify doubt  regarding the job perspective .  Express my strengths and correlate it with the job description.", "Interview Questions": "what are your strengths and weaknesses"}, {"date": "14 Sept 2020", "title": "Academic Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Republic Polytechnic", "Interview Descriptions": "Friendly interviewers. I was interviewed by the top 3 in the department. But they did not ask me tough questions like my other colleagues. They seem to just want to find out more about me as an educator and to see if I fitted into the PBL environment.", "Interview Questions": "Why choose to join RP?"}, {"date": "17 Sept 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Republic Polytechnic", "Interview Descriptions": "Interviewers were welcoming and it was quite a casual interview. Interview questions were also not too difficult to answer. Interviewers mostly asked about my experiences in the past and the software skills that I have.", "Interview Questions": "Why do you want to intern here?"}, {"date": "3 Oct 2021", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Republic Polytechnic in Nov 2018", "Interview Descriptions": "The interview has two phases usually.  The two phase interview process will determine if the suits you and if you are the best fit for them. The first interview is with the person who will be your boss (usually the Program Chair) and then Second interview is with Director of the School you are applying for and HR.", "Interview Questions": "Why do you want to join us?"}], [{"date": "31 May 2018", "title": "Administrative Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Republic Polytechnic (Singapore)", "Interview Descriptions": "Interview was interesting and engaging. Interviewers were welcoming and enthusiastic about introducing the job profile to me. A sample lesson was given to me and I was given some time to think about how I would facilitate the lesson.", "Interview Questions": "How would you facilitate this given lesson?"}, {"date": "16 Dec 2018", "title": "Associate Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Republic Polytechnic (Singapore) in Mar 2018", "Interview Descriptions": "Phone Call - Initial feeling call to see if you're a good fit.\r\nIn-person interview consists of the following.\r\nWritten Paper - Tests your domain knowledge and writing ability.\r\nMock Lecture - Tests your ability to handle students.\r\nInterview - Dreams, aspirations, goals and why you are here.\r\n\r\nThere's also a training session that teaches you to teach after.", "Interview Questions": "Why are you joining RP?"}, {"date": "9 Aug 2022", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Republic Polytechnic (Singapore) in Jan 2018", "Interview Descriptions": "3 interviews, working level, and mod lesson presentation, meet senior management. Friendly , cordial, professional. Mod lesson about 20 minutes. Took about a week to prepare. Use power point and printed some worksheets.", "Interview Questions": "What are your strength and weaknesses"}, {"date": "7 Oct 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Republic Polytechnic (Singapore) in Nov 2017", "Interview Descriptions": "It was a good and enjoyable process. The interviewer was friendly and explained the role clearly. There is a need to know your resume clearly as the interviewer will ask in details what is it about.", "Interview Questions": "What did you choose to apply for this role?"}, {"date": "10 Jun 2021", "title": "Associate Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Republic Polytechnic (Singapore) in Oct 2017", "Interview Descriptions": "My interview was in the afternoon. I was asked to be there before 30 mins near the reception for people to check my certificates. Interview was very relaxed, friendly style.", "Interview Questions": "What are the inbuilt strengths in you"}, {"date": "15 Apr 2021", "title": "Senior Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Republic Polytechnic (Singapore) in Apr 2017", "Interview Descriptions": "Great interview process - interviewers are approachable and puts you at ease.  They do not ask you pointed questions and gave you an opportunity to share your expertise.", "Interview Questions": "What prompts you to apply for this job?"}, {"date": "27 Mar 2016", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Republic Polytechnic", "Interview Descriptions": "2 rounds of interviews, one with middle management and one with senior management. They asked questions relating to my prior experience and why I want to join RP. First round was made up with 2 ADs and a SL, 2nd round was with the directors.", "Interview Questions": "Why do you want to join RP?"}, {"date": "10 Oct 2014", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Republic Polytechnic (Woodlands New Town, )", "Interview Descriptions": "Very slow. Takes ages to get back to you. HR is overwhelmed and understaffed. \r\n\r\nInitial offer might not be what you expect. Most of us expect a pay cut when we move the poly.\r\n\r\n2 rounds. First round with some senior lecturers who will suss out your expertise. That's what we look for, expertise.\r\n\r\nSecond round with director and another member of senior management.", "Interview Questions": "Expect to be asked about why transition to education. How your expertise is relevant. What courses can you potentially teach, what courses can you suggest that are relevant to what the school you're applying to need, what kind of industry network do you have and how can the school benefit from it."}, {"date": "20 Jun 2017", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Republic Polytechnic (Singapore) in May 2014", "Interview Descriptions": "1st round by hiring department to establish your experience; RP utilizes PBL, so that probably accounts for them not using a demo session like other Polytechnics as all Lecturers have to go for training before being assigned a class; \r\n2nd round with director of school and HR, mostly to confirm choice and to make sure we do not run a business on the side. \r\n\r\nIf you're successful, HR will inform you 3 months later; if you're not successful, they probably will inform you in the same timeframe?", "Interview Questions": "The purpose of applying"}, {"date": "23 Feb 2018", "title": "Associate Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Republic Polytechnic (Singapore) in Apr 2014", "Interview Descriptions": "Interview with the diploma and department head that lasted an hour. Started off with the usual \"walk me through your resume\", followed by asking some of the past teaching experience. Questions include - describe your curriculum development experience, additional contributions outside the classroom, other areas of educational interests.", "Interview Questions": "Why did you apply for a job at RP?"}], [{"date": "11 Dec 2012", "title": "Lecturer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Republic Polytechnic (Singapore)", "Interview Descriptions": "Firstly I met up with the Program Chair and Assistant Director in person in the school. It was an informal interview and it felt more like a get-to-know-you session.\r\n\r\nSecond one was a formal interview with the school director, HR executive an Program Chair. In this interview, the director was speaking most of the time and the rest was rather quiet. During the interview, the director was abrasive and arrogant. Treated the interview like an interrogation. Instead of asking about my technical abilities and experiences, she asks personal questions like family relationships and marital status.", "Interview Questions": "Why are you divorced?"}]]