[[{"date": "15 Feb 2023", "title": "School Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Burrell Behavioral Health in Feb 2023", "Interview Descriptions": "easy to apply, call back the next day, got scheduled to interview immediately. flexible with scheduling. also easy to talk to interviewers they were very informative in the process and what next steps are/ what they look like", "Interview Questions": "what made you interested in this position"}, {"date": "13 Dec 2022", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Burrell Behavioral Health (Springfield, MO) in Sept 2021", "Interview Descriptions": "I was interviewed by a variety of supervisors who had openings on their team. They asked a variety of questions, but mainly wanted to get to know me as a person to see if I would be a good fit.", "Interview Questions": "Tell me about a time where you had to overcome a difficult situation."}, {"date": "17 Sept 2021", "title": "Revenue Cycle Benefits and Eligibility Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Burrell Behavioral Health in Sept 2021", "Interview Descriptions": "Telephone interview. Two interviewers, one didn't say anything.  Horrible rapport. Job description didn't match the job described. There were only three questions. The interview took less than 10 minutes.  I withdrew my application after the interview.", "Interview Questions": "What are your strengths? What are your weaknesses? Where do you see yourself in 5 years?"}, {"date": "15 Dec 2020", "title": "Youth Community Support Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Burrell Behavioral Health (Columbia, MO) in Dec 2020", "Interview Descriptions": "I applied online for the position, which state that the requirement was Master's degree in my field. I completed an interview via Zoom duringing which time it was discussed that I had not completed a practicum or one year of experience under the supervision of a mental health professional and was told that would be okay but my documentation would just need to be signed off on by a supervisor once I began working. I was then told would be hearing more shortly about next steps. I sent the customary thank you and heard no reply. I sent a follow up email and was told that there may be an issue with my degree because I had not completed a practicum or one year of experience under the supervision of a mental health professional. I had in the meantime applied for another position of the same title also with Burrell, and they reached out to schedule an interview.  I at that time mentioned that for another position I was told that there was an issue with my degree being sufficient, and they check and replied that was not in fact the case. Then I received an email from the first position to which I applied instructing me to complete a waiver for criminal history exception with the DMH, and to ignore the part about criminal history (which is the whole form) and when I replied seeking clarification my emails have been ignored.", "Interview Questions": "What do you think will be the most difficult part of this position?"}, {"date": "25 Jun 2021", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Burrell Behavioral Health (Columbia, MO) in Aug 2020", "Interview Descriptions": "Interview was very lax. More of a conversational style. I think I asked more questions than my interviewer did. It was a neutral experience and I was hired only an hour or two after the interview.", "Interview Questions": "What brought you to apply to Burrell? "}, {"date": "26 May 2019", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Burrell Behavioral Health (Springfield, MO)", "Interview Descriptions": "I applied for the job through Indeed. They got back to me in under a week and wanted to interview me. The interview was... odd. I was brought back into the Office Manager's office and we didn't really interview much. We mostly talked about our children. So, there's that.", "Interview Questions": "How old is my kid"}, {"date": "17 Jul 2018", "title": "Community Support Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Burrell Behavioral Health (Columbia, MO) in Jul 2018", "Interview Descriptions": "I applied online and was e-mailed interview questions within days. After answering the questions I waited a week and began calling to see where they were in the hiring process. I have since called multiple times and left a message each time. The machine says that they will respond within 24 hours. I have not received a call back or any other e-mails.", "Interview Questions": "Do you have any concerns about using your own vehicle for transporting clients?"}, {"date": "19 Nov 2017", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Burrell Behavioral Health (Springfield, MO) in Nov 2017", "Interview Descriptions": "I met with two different members of the hiring committee, each for an hour. They asked me fairly standard interview questions.  They were open about what the position required, and they answered my questions without difficulty. It was a warm interview process, and I felt quite comfortable.", "Interview Questions": "They asked me to tell them about myself, my weaknesses, strengths, what I could offer that would make me stand out as a candidate."}, {"date": "11 Jan 2018", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Burrell Behavioral Health (Springfield, MO) in Nov 2017", "Interview Descriptions": "I was contacted over the phone and set up an appointment. I showed up and the supervisor was very welcoming. The person interviewing me would be my direct supervisor so it was nice to get to know her.", "Interview Questions": "Do you plan to stay in this area for more than a year?"}, {"date": "15 Nov 2017", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Burrell Behavioral Health (Springfield, MO) in Nov 2017", "Interview Descriptions": "I went to the place of employment and talked with the supervisor as well as fill out an official application.  The interview process was very easy and was more of the supervisor getting to know me and more of my background information than a formal interview, which I appreciated.", "Interview Questions": "Do you have any questions about the job?"}], [{"date": "12 Jan 2018", "title": "HIM Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Burrell Behavioral Health (Springfield, MO) in Nov 2017", "Interview Descriptions": "My interview was one of the few interviews where I didn't feel anxious. I was interviewed twice for two different positions and both times I felt comfortable with the hiring agent.", "Interview Questions": "How would your employees describe  you?"}, {"date": "27 Jan 2018", "title": "Residential Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Burrell Behavioral Health (Nixa, MO) in Jul 2017", "Interview Descriptions": "Talked about my work history, certifications, and work ethic. They showed me around the facility and described what I would be doing and introduced me to all the staff that were on shift at the time.", "Interview Questions": "Why I wanted to work here. "}, {"date": "5 Dec 2017", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Burrell Behavioral Health (Springfield, MO) in Jun 2016", "Interview Descriptions": "Was called to schedule an interview. Attended interview that lasted approximately 20 minutes and asked many questions about how I would handle situations with clients or coworkers. I was offered the position at the end of the interview.", "Interview Questions": "Tell us how you would handle a client who is non-compliant. "}, {"date": "9 Sept 2017", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Burrell Behavioral Health in Jun 2016", "Interview Descriptions": "Easy application but the review section was a pain. I had to get email addresses from previous employers to have them do a survey about me. Took awhile for previous employers to do the survey.", "Interview Questions": "Why do you want to work in the mental health industry?"}, {"date": "21 Jul 2016", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Burrell Behavioral Health (Springfield, MO) in Jan 2016", "Interview Descriptions": "The interview process was pretty standard. You apply online. The administrative assistant/office manager called to set up an interview. Interview was scheduled and included asking questions relating to past experience/job history, education, qualifications, what would make you an asset to the company, what your strengths and weaknesses are, past situations where you had to deal with an issue or problem and how you resolved it. From my experience it was the typical interview. It was with 1 member of upper management and 1 other individual. Time was given to ask questions and learn more about the position and company. Interview was nice and interviewers were friendly. Pay scale was given based on position and education level. After the interview, I was offered the position pending a criminal background check and references being called. I accepted the position and training started a few weeks later.", "Interview Questions": "Name a situation where you had to deal with a difficult client or situation and how you handled it?"}], [{"date": "11 Jan 2018", "title": "Nurse Care Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Burrell Behavioral Health (Springfield, MO) in Jan 2016", "Interview Descriptions": "I applied online, than when I was called for an interview I met with the HCH director for a casual but professional interview and was introduced to the Assistant Director during our interview.", "Interview Questions": "About my work experience"}, {"date": "6 Sept 2017", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Burrell Behavioral Health (Columbia, MO) in Jun 2015", "Interview Descriptions": "First interview included sitting down with the Program Manager as well as the director.  Consisted of regular interview questions and going over my resume. The second interview consisted of meeting with the rest of the team members and going over goals of the program. The team members were very polite and welcoming.", "Interview Questions": "How would you deal with a tricky situation with a client."}, {"date": "16 Jun 2017", "title": "Community Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Burrell Behavioral Health (Springfield, MO) in Apr 2015", "Interview Descriptions": "I interviewed at a job fair and was hired immediately. It was super easy and laid back. I have heard that the regular interviews are in group form and are more intense. That being said, the easiest way to land a job with Burrell is finding them at a job fair.", "Interview Questions": "Are you comfortable going to your client's homes?"}, {"date": "22 Mar 2015", "title": "CPRC Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Burrell Behavioral Health (Springfield, MO) in Mar 2015", "Interview Descriptions": "I was called in for an interview and was told I would get a call back regardless of whether or not they wanted to hire me. I have not gotten a call back yet, but whether or not I get offered the position, I will not accept it. The interviewer was extremely rude to me, condescending, and asked very personal questions that I was not comfortable answering. The questions were worded in a very offensive way. The interviewer asked me why I had a bachelor's degree and why I was applying to this job that required no experience, which was very offensive. Also, the interviewer never described the job duties or gave me a paper copy of the job description. \r\n I do not recommend interviewing with this company. My views are if you are being treated badly by the interviewer, you probably won't be respected as an employee.", "Interview Questions": "Why do you have a degree but you applied to this job that doesn't require you to have a degree?"}, {"date": "15 Sept 2016", "title": "Residential Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Burrell Behavioral Health (Springfield, MO) in Jan 2015", "Interview Descriptions": "The interviewer was wonderful. Very pleasant and non judgmental. The interview was not difficult if you are aware of mental health terms. The interviewer really prepared you for the job.", "Interview Questions": "N/A"}, {"date": "5 Dec 2014", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Burrell Behavioral Health (Columbia, MO)", "Interview Descriptions": "I applied online and had forgotten I had even applied as I didn't get called for an interview until 6 months after applying. I was interviewed for a job I never applied for then several weeks later was given a clinic job. Bunch of questions that didn't really relate and no nurse/medical people involved.", "Interview Questions": "No difficult questions."}, {"date": "11 Nov 2014", "title": "Community Support Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Burrell Behavioral Health", "Interview Descriptions": "Panel interview with several supervisors.  Seems to be high turnover so many supervisors are always hiring for this position.  Questions were not difficult but there were many of them.", "Interview Questions": "Lengthy interview with many questions.  None of the questions were difficult."}, {"date": "6 Aug 2014", "title": "Community Support Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Burrell Behavioral Health (Sedalia, MO) in Jul 2014", "Interview Descriptions": "Got a call and set up an interview. Arrived at Burrell about 10 minutes early and interview started about 5-10 minutes after appointed time, no big deal. The interviewers seemed a little nervous at first. They mainly described the position and asked a few questions that gauged my comfort in certain working situations. Asked me some situational questions, but not a whole lot about myself. Asked if I had any questions. Then I filled out an employment application and gave a copy of my drivers license. A couple hours later I got word from a reference I put down that they had called.", "Interview Questions": "What is an ethical dilemma you have encountered and how did you deal with it?"}, {"date": "12 Jan 2018", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Burrell Behavioral Health (Springfield, MO) in Mar 2013", "Interview Descriptions": "I had a phone interview and then a face to face formal interview. I submitted my resume online and was quickly contacted by the person who would be my supervisor for a phone and then a face to face interview.", "Interview Questions": "What is my biggest challenge with becoming a Supervisor at Burrell."}, {"date": "11 Jan 2018", "title": "Office Support Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Burrell Behavioral Health (Columbia, MO) in Jan 2013", "Interview Descriptions": "they called, we set up an interview date and time. I arrived on time, they called me in within a few minutes. We talked for about an hour with them asking about my experience, work history and why did I want this job.", "Interview Questions": "why I was looking for a job with Burrell"}]]