[[{"date": "30 May 2023", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Suffolk University", "Interview Descriptions": "Turned in resume and then few days later they reached out asking to interview me. The interview last roughly 20 minutes, and it was with library staff. Discussed availability and why I wanted to work at the library.", "Interview Questions": "Why do you want to work at the library?"}, {"date": "11 May 2023", "title": "Assistant Registrar Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Suffolk University", "Interview Descriptions": "I received a call to sent up an interview. The person first started with strolling me the salary range and it was too low to continue with the process. The person who called was very pleasant", "Interview Questions": "They told me the salary range and it was too low to continue the process. Very pleasant person."}, {"date": "9 Jun 2023", "title": "Student Leader Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at Suffolk University (Boston, MA) in Jan 2023", "Interview Descriptions": "My discussion with the HR manager went smoothly. They were very knowledgeable, empathetic, and attentive, and I didn't detect any red flags when reviewing the materials presented. The exchange lasted for half an hour.", "Interview Questions": "Could you please provide some information about yourself?"}, {"date": "27 Sept 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Suffolk University", "Interview Descriptions": "5 rounds of interviews total. Phone screening with HR. In person with upper admin., then 3 hour in person interview in a board room with 5 members of the Department.  Then another phone interview with Department with more questions. Then another phone interview with HR.  Process took 2 months. Once I accepted the offer HR asked me to wait to onboard 2 weeks later until the first of the year which I agreed to which prolonged the process.\n", "Interview Questions": "What do you see as the greatest challenges of this position?\nWhy us? Why now?\nWhat is the most recent book you've read?\nHow are you a change-maker?\n"}, {"date": "26 Sept 2022", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Suffolk University", "Interview Descriptions": "Phone screen, zoom interview and in person third round interview.  The phone screen was with HR (recruiter) and was pretty general.  The other interviews were with the department you would be working with. ", "Interview Questions": "How do you stay organized in your work? "}, {"date": "14 May 2022", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Suffolk University", "Interview Descriptions": "It was awesome, I managed to answer all the questions correctly during the short quiz.  \r\n\r\nIt was awesome, I managed to answer all the questions correctly during the short quiz.", "Interview Questions": "Differences between Preterite and Imperfect  "}, {"date": "24 Jan 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Suffolk University", "Interview Descriptions": "I recorded a two minute video interview and a written essay. I spoke with advisers they organized and submitted all the required information and I was accepted into the grad program within a week.", "Interview Questions": "Why do you want to attend grad school here?"}, {"date": "16 Nov 2021", "title": "Alternative Spring Break Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Suffolk University in Nov 2021", "Interview Descriptions": "The interview was great, I got asked 5 questions about why I wanted to apply for it and my experience with teamwork. It was on zoom meeting and the interviewer \n was very polite and friendly", "Interview Questions": "Why I chose to attend ASB"}, {"date": "7 Sept 2021", "title": "Talent Acquisition Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Suffolk University (Boston, MA) in Jul 2021", "Interview Descriptions": "I applied online and was asked to complete a recorded interview. Within a few days I got a request to do an interview via Zoom. In the middle of the Zoom interview she got a phone call and said it was important and had to take it. This phone call lasted 15 minutes and her explanation was that her boss had called her asking if she would be attending a payroll meeting but she said no as she isn't involved in payroll (But why this took 15 minutes I do not know). She then told me she would be on vacation for a week and she would have an update for me then. On Thursday I got an email that I was being moved to next steps and they were requesting 4 references. So of course I let my references know to expect to hear from them. In the middle of the next week after my references hadn't heard from her I emailed asking for an update. After a week and a half after my email I emailed again and asked if they could please give me an update so I could let my references know to no longer expect a call or exactly what was going on. It took another few days for her to email back telling me they selected another candidate. Overall, this was one of the most unprofessional experiences I have had during an interview process. Whether it be the interruption (Which normally I wouldn't have minded but her excuse was sub par), the asking to check my references (Which is generally the final step to an offer), or the attempt at ghosting me. Overall extremely disappointed at the treatment I received and will not apply again.", "Interview Questions": "Can you please tell me a little bit about yourself?\nWhat would you do if a hiring manager was having trouble utilizing certain systems?"}, {"date": "1 Mar 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Suffolk University", "Interview Descriptions": "I applied through a staffing agency for a temporary contract position. The interview was relatively straightforward.  After meeting with the Director, I was asked a few questions and offered the job a few days later.", "Interview Questions": "Do you have experience with graphic design?"}], [{"date": "31 Mar 2021", "title": "Assistant Director of Career Communities Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Suffolk University in Feb 2021", "Interview Descriptions": "Quick and efficient interview process. Started with a pre-recorded interview over Jobvite, followed by 3 Zoom interviews in the span of two weeks. Interviewers were transparent and communicative throughout the whole process and even though I did not get an offer, it was overall very positive.", "Interview Questions": "Use three words to describe yourself. "}, {"date": "15 Oct 2020", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Suffolk University", "Interview Descriptions": "Very pleasant experience with professional staff. I found the questions and interaction to be very memorable. Would recommend institution to others seeking comparable position. Nothing bad to share or say. Overall positive.", "Interview Questions": "What led you to Suffolk University?"}, {"date": "6 Aug 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Suffolk University (Boston, MA) in Oct 2020", "Interview Descriptions": "Amazing! I really loved that they created a welcoming environment. It felt like a conversation that took off a lot of pressure. The team there is amazing. I would say that this was indeed the best interview I had.", "Interview Questions": "How do you manage stress "}, {"date": "27 Sept 2020", "title": "Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Suffolk University (Boston, MA) in Sept 2019", "Interview Descriptions": "5 people were interviewing at the same time, but the atmosphere was informal. It wasn't a long interview​, took me around 30 minutes. After I answered all questions they told me they'll contact me in 3 days. Then they send me the email saying that I'm a match and I can start working next week.", "Interview Questions": "What is the best part of the job that I'm going to do?\r\n\r\nWhat are the struggles I faced in my previous​ job and how did I overcome them?\r\n"}, {"date": "20 Mar 2019", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Suffolk University", "Interview Descriptions": "First, submit application via on line. I did an in-person interview and then selected the area/departments where I would like to work. After that interview with your supervisor - it was not that difficult to do it.", "Interview Questions": "why did you apply to suffolk?"}, {"date": "23 Jan 2019", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Suffolk University", "Interview Descriptions": "The whole process consistent of the job application, one phone screen and one in person interview for the work study program. The work study program was overall very helpful as i got the chance to work with great people and get a valuable experience out of it.", "Interview Questions": "Questions regarding past experience and why do you consider your self being a good fit."}, {"date": "20 Aug 2018", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Suffolk University", "Interview Descriptions": "Pleasant overall. Good planning on the HR side. Good two days of teaching and research presentations, lunches and dinners. First impression on people was good and was confirmed later. Did not have any idea about the management though. Turns out most of the faculty was unhappy but no one told me)) Many people left since.", "Interview Questions": "Future plans for research."}, {"date": "16 Aug 2018", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Suffolk University", "Interview Descriptions": "Absolutely amazong interview. The work environment is very welcoming and diverse. The supervisors are very straight forward and they will let you know every thing that they are lookong for. Very approachable as well", "Interview Questions": "Why should we hire you"}, {"date": "20 Apr 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Suffolk University (Boston, MA)", "Interview Descriptions": "I had a phone interview that was the most thorough one ever.  The interviewer asks good questions and some that brought out my experiences. I thought it went really well the interviewer was professional, seemed genuinely interested in hearing about my background. Overall felt like a conversation.", "Interview Questions": "What is something unique and interesting about you that is an asset for a role like this?   What keeps you motivated?  "}, {"date": "1 Feb 2018", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Suffolk University", "Interview Descriptions": "The phone interview was a disaster. The interviewer was almost an hour late when they called. They asked one question which was why I was wanted the position, then had to go. I received word a day later to schedule an in person interview. Talk about a poor first impression to a business!", "Interview Questions": "Why are you interested in this position?"}], [{"date": "27 May 2018", "title": "IT Lab Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Suffolk University (Boston, MA) in Sept 2017", "Interview Descriptions": "It was a very easy and straightforward interview. Manager asked very few questions about your experience with computers! After that s/he will walk you straight to the lab if s/he wants to hire you and train you on the spot. It only take half an hour to complete the interview and the training! But as you work there, you will learn more stuffs!", "Interview Questions": "What can you contribute to the lab?"}, {"date": "30 Nov 2020", "title": "Student Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Suffolk University (Boston, MA) in Sept 2017", "Interview Descriptions": "Interviewed on campus it was very pleasant. It was with two managers and lasted about a half an hour. Questions were both professional and personal to get to know me all around.", "Interview Questions": "What is your employment history. "}, {"date": "6 Oct 2017", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Suffolk University (Boston, MA) in Jun 2017", "Interview Descriptions": "All communication went through HR - first, I had a brief phone screening that got the basic interview questions out of the way, a week after that, I was invited to interview with the team in person; within the next couple of weeks, I received a couple of e-mails and calls from HR to clarify/answer some other questions... and soon after that, I received an offer.", "Interview Questions": "What is your preferred management style?"}, {"date": "30 Aug 2021", "title": "Gradate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Suffolk University in Jun 2017", "Interview Descriptions": "Questions were based on the previous job experience and situational questions.\n\nWhat are your career goals.. short-term and long-term?\n\nHow do you handle stress?\n\nHow do you manage time  - full-time student and a part-time job?", "Interview Questions": "What are your career goals short term and long term"}, {"date": "30 Mar 2017", "title": "Orientation Leader Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Suffolk University (Boston, MA) in Dec 2016", "Interview Descriptions": "Multiple people, multiple interviews. One was a group interview which was basically tested how well you work with others, the other was me being interviewed by the director of Orientation and the Orientation Student Leader.", "Interview Questions": "Why do you want to be an Orientation Leader?"}, {"date": "26 Aug 2016", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Suffolk University (Boston, MA)", "Interview Descriptions": "Very straightforward and quick, much appreciated\r\nI applied online and was contacted by HR\r\nFrom there we set aside time for a brief phone interview and a longer Skype interview\r\nI heard back promptly in all areas of the process", "Interview Questions": "How do you manage your time effectively?"}, {"date": "29 Oct 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Suffolk University (Boston, MA)", "Interview Descriptions": "Sent my resume in and was contacted the next day.  Brought in for an HR interview the following day and an interview with the boss the next day.  Offer made and accepted the following day.  \r\n\r\nHR interview was typical.  Strengths and weaknesses, why you want to work here, what you expect, what you do on a day to day basis now.", "Interview Questions": "You've been here for 3 years and just won an award.  What was it for?"}, {"date": "28 Jul 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Suffolk University", "Interview Descriptions": "There was no formal process. They had an immediate need, felt I was competent enough, and offered the position on the spot.  There were few questions... it was more of a general conversation.", "Interview Questions": "They were interested in the work I did in my primary job & career."}, {"date": "13 Apr 2015", "title": "Work-Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Suffolk University", "Interview Descriptions": "Went to an activities fair of sorts before beginning my freshman year (I do not remember the specifics of what kind of fair it exactly was). I approached the SOULS Community Service and Service Learning Center table and after a short conversation they sent me up to the office for a brief interview. I began the work-study position once school began.", "Interview Questions": "Simple interview questions including specific ones about volunteering and community service."}, {"date": "25 Nov 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Suffolk University", "Interview Descriptions": "Online application with essay questions and two references. Then everyone is offered a group interview as long as they meet requirements and submit the application on time. I was studying abroad so I was offer a one on one interview right away. I did it over skype and it lasted about 45 minutes. I was offered the position a couple weeks later", "Interview Questions": "How would you enforce a policy you might not agree with?"}], [{"date": "27 Apr 2015", "title": "Data Entry Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Suffolk University (Boston, MA) in Jun 2014", "Interview Descriptions": "Interview was very fast, about five minutes. General questions that you'd expect at an interview. Emphasized on teamwork, but there weren't much teamwork needed for work. Very independent at the Admissions department. Waiting wasn't long for interview, remember to dress in office attire. Answer honestly. The questions asked were not difficult or require much thinking. It was rather repetitive. One-on-one interview was great and interviewer was nice. Not much of a fuss.", "Interview Questions": "What can you offer? How is working as part of a team important."}, {"date": "6 May 2014", "title": "Office Assistant (Work Study) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Suffolk University (Boston, MA)", "Interview Descriptions": "Initial contact with supervisor was by email, they asked when I could come in for an interview. The interview was very brief, the only real questions asked was do you have experience in an office (I did not), and do you have experience with microsoft office (I did). Then there was a general description of the responsibilities associated with the position and I was asked when I could start and what hours I was available. Then a little paper work and I was in.", "Interview Questions": "Have you used Microsoft Access?"}, {"date": "12 Nov 2017", "title": "Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Suffolk University (Boston, MA) in Mar 2014", "Interview Descriptions": "the process started with over 50 applicants, tailored down to about 10 interviews to gain the 5 open positions per year. By doing so, there were multiple interviews to achieve the best talent pool and to identify a diverse group of applicants.", "Interview Questions": "what are your strengths?"}, {"date": "4 Feb 2014", "title": "Staff Assistant Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Suffolk University", "Interview Descriptions": "Straight forward process. Applied online, was called by HR, came in to interview with my supervisor.  After this I heard back within a few days and scheduled to come into fill out the paperwork", "Interview Questions": "N/A"}, {"date": "27 Jul 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Suffolk University (Boston, MA) in Mar 2013", "Interview Descriptions": "It was a panel interview with 3 people and several one one one integer views. They asked all the normal interview like questions, nothing out of the box or out of the norm or highly unusual don't really know what else to say about it.", "Interview Questions": "Last book I read"}, {"date": "14 Jan 2014", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 days. I interviewed at Suffolk University (Boston, MA) in Aug 2012", "Interview Descriptions": "The interview process was pretty low-pressure. I was referred by a staffing agency, so it seemed during the interview that it was already a done deal and they just wanted to meet me. The people were friendly, complimented me on my new purse, and told personal anecdotes about things we had in common to make me feel comfortable.", "Interview Questions": "N/A"}, {"date": "10 May 2016", "title": "Technical Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Suffolk University (Boston, MA) in Feb 2012", "Interview Descriptions": "Surprise panel interview by a group of executives. The recruiter did not provide prior notice of the interview format nor who the attendees would be or what their positions were at the university. After I was sandbagged and humiliated, the recruiter was unavailable for questions. The panelists questions were fairly overall however.", "Interview Questions": "Describe experience around hiring and firing."}, {"date": "9 Jun 2015", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Suffolk University (Boston, MA) in Sept 2011", "Interview Descriptions": "Met with hiring director, and then the dean, separately. Both were fair processes with a wide variety of questions about skills and career goals. Also asked about interest in pursuing degree while working. Both were friendly and encouraging of goals and career outlook.", "Interview Questions": "Where do you see yourself in five years? What are your strengths in weaknesses?"}, {"date": "23 Sept 2011", "title": "Assistant Director of Student Leadership and Involvement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Suffolk University (Boston, MA) in Jul 2011", "Interview Descriptions": "The interview was very interesting. The staff seemed very nice but it was quite clear that they had several candidates applying for the position, some external but some from within the university who were already employed. The vibe I got during the interview was that they were just interviewing to see what was out there, and seemed like they already had someone for the position.", "Interview Questions": "What were some of the most challenging aspects of your previous job and how did you handle those situations?"}, {"date": "21 Oct 2015", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Suffolk University (Cambridge, MA) in Jan 2011", "Interview Descriptions": "A very informal meeting over coffee, outlining the course I was to teach. She asked about my graduate work, about my dissertation, and about my teaching style. She told me about the student population and about some of the variations people had made on the course I was being asked to teach.", "Interview Questions": "Mostly it was along the lines of \"this is what we need, can you do it?\""}], [{"date": "3 Sept 2010", "title": "Events Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Suffolk University (Boston, MA) in Aug 2010", "Interview Descriptions": "The interview started off with very basic questions. Then each candidate was asked to take two exams, writing and proofreading. After that, the candidates were asked to go to a different building for the second part of the interview. Each candidate got lost since the room did not actually exist in the building and the building was difficult to locate. After rooming around the building and asking security for help, each candidate had to call the HR department to get help. Finally, each candidate was to find the room and then had an hour interview with two people.", "Interview Questions": "What kind of event system would you recommend?"}, {"date": "17 Aug 2014", "title": "Associate Professor, Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4+ months. I interviewed at Suffolk University (Boston, MA) in May 2010", "Interview Descriptions": "Group interview focusing on the quality of my research and my intentions to do research.  It was fairly standard as faculty interviews go.  I thought everyone was very nice and polite.", "Interview Questions": "N/A"}]]