[[{"date": "13 Jun 2023", "title": "Campaign Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "process was straightforward with: phone screening interview with hiring manager interview with ED fairly simple interview with behavioral questions and resume questions HR is a bit unresponsive with next steps communication i did not get an email about next interview until nearly a week after the first interview. after my final interview i did not hear back about their decision until almost a week after.", "Interview Questions": "why do you want to work here"}, {"date": "6 Apr 2023", "title": "Manager, CDM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society (Washington, DC)", "Interview Descriptions": "three interviews with different levels of management - starts with a phone interview, then zoom with direct report manager, then executive director. expected questions on how you work, your background, and an explanation of the role", "Interview Questions": "what do you enjoy outside of work"}, {"date": "20 Feb 2023", "title": "Outreach Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "the process was informative and amazing!! Everyone was friendly and wanted to get to know you. The staff actually listened to what you had to say and how you wanted to reach the goals and be creative.", "Interview Questions": "tell us about yourself. Why LLS?"}, {"date": "23 Oct 2022", "title": "Communications Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "I had a phone interview and in-person interview. The in-person interview was with two people and I was asked to do a writting assignment after. The writting assignment had PR and social media questions to answer.", "Interview Questions": "How has your course work prepared you for this position?"}, {"date": "1 Sept 2022", "title": "Campaign Development Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Everyone I spoke to throughout the hiring process was very nice and asked thought-provoking questions. It was a little drawn out - I applied in July and was made an offer but wasn’t able to start until November which was difficult since I was unemployed at the time. Also, 3 interviews seemed a bit excessive for an entry level role. Expect many situation-based questions (“tell me about a time when you..”).", "Interview Questions": "Tell me about a time when being organized was critical to the task at hand?"}, {"date": "6 Jul 2022", "title": "Business Development Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Leukemia & Lymphoma Society (Miami, FL) in Jun 2022", "Interview Descriptions": "I was screened by an LLS HR officer who asked me questions about my past roles.  We talked for over 40 minutes and the HR rep explained what would be next steps and scheduled my second interview for a week later.  I was then ghosted.  This was recently.", "Interview Questions": "How my past roles give an edge on working for a not for profit organization."}, {"date": "16 Apr 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "I interviewed for a coordinator position and the interviewer, who would be leading the department I would be working in if I were hired, was super helpful and informative. Seems like everyone who works with this organization is passionate about its mission.", "Interview Questions": "Where do you currently work?"}, {"date": "13 Nov 2022", "title": "Campaign Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Leukemia & Lymphoma Society in Apr 2022", "Interview Descriptions": "Met with recruiter and then my boss, and then my bosses boss (ED). Everyone was super friendly in the interview, but what they do not tell you is that 60% of the company is new within the last two years,", "Interview Questions": "Really just wanted to know about your intra personal skills."}, {"date": "7 Mar 2022", "title": "Campaign Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Went through 6 rounds of interviews, and was offered a job in a different department that was a better fit. Managers were easy to talk to and made the process enjoyable although lengthy.", "Interview Questions": "Tell me a little about yourself?"}, {"date": "14 Feb 2022", "title": "OPeration Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Interviewed with two people on that day for one position and then was asked if I was willing to stay to talk to someone else about another opening. The entire interview process was maybe slightly longer than 2 hours. (This was in 2019) All three people I spoked with were extremely nice and took their time to explain what the roles are and what it would entail.  I can tell they follow a certain format with the interview and they would ask a lot of behavioral questions.\r\n\r\nThe entire experience was positive probably besides the parking (parking lot was cramped!) and no one offered me anything to drink so I was very dehydrated after 2 hours of basically nonstop talking. So bring your own water.", "Interview Questions": "How do you handle multitasking all at once?"}], [{"date": "26 Jan 2022", "title": "Campaign Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Very entry level job. Interview was focused on past work experience (if any) and internships. They didn’t ask any hard questions or STAR questions. Interviewed with direct manager - campaign manager and direct managers assistant - campaign specialist. Both very nice and informative!", "Interview Questions": "Tell me about yourself and your experience "}, {"date": "20 Jan 2022", "title": "Campaign Fundraising Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "First interviewed with the recruiter. Had a call set up a few days later with the hiring manager. Then, I spoke with the ED. All interviews were via Zoom! Everyone was super helpful and communicated well throughout the whole process.", "Interview Questions": "Tell me about your current role. How do you handle being under pressure."}, {"date": "11 Jan 2022", "title": "Advancement Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Phone Screen with recruiter, Zoom interview with hiring manager (ED) and Territory Advancement Director (National staff). The interview asked for examples of moves management plans, increasing gifts, stewarding donors, etc. There was also a draft proposal that had to be submitted based on a case given by the TAD.", "Interview Questions": "Provide an example of when you closed a major gift. What were the steps you took and what was the timeline? "}, {"date": "8 Sept 2022", "title": "Manager, CDM Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Leukemia & Lymphoma Society (Atlanta, GA) in Jan 2022", "Interview Descriptions": "great process and nice people it was full of good questions and prompt responses. I liked it just fine and I was excited to keep moving forward. It took 3 rounds and I met with the entire team", "Interview Questions": "N/A"}, {"date": "2 Dec 2021", "title": "Spring Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "First, there was a phone interview that outlined my interest in the company and what the internship would entail. Then I got a call back a week or two later asking me to come in for an in-person interview where I met with 2 managers who would be on my team. Everyone was so friendly and kind. They got back quickly with everything.", "Interview Questions": "Q: Why did you apply to LLS?"}, {"date": "4 Jan 2022", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Leukemia & Lymphoma Society in Nov 2021", "Interview Descriptions": "Participated in an HR video screening just a few days after applying online.  The next week, I had a video interview with the ED, followed by a video interview with the Territory Dir.  about 2 weeks later.  The interviews occurred in quick succession, but then about 2 weeks passed without any feedback.  I contacted the HR rep and requested an update regarding my candidacy, but weeks have passed and I have yet to receive a response.", "Interview Questions": "What type of work environment do you prefer?\nWhat will your first 30/60/90 days look like?  "}, {"date": "29 Oct 2021", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Good amount of questions with not that many people on the panel and an average time spent in the interview which was fully virtual but manageable and appropriate given the circumstances", "Interview Questions": "Typical interview questions were asked"}, {"date": "7 Nov 2022", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society (Charleston, SC) in Oct 2021", "Interview Descriptions": "The process was set up to take multiple interviews. Ultimately, it was not a good fit. They had high expectations for the role. Seemed like they had great benefits, but did not disclose the salary of the position on the posting.", "Interview Questions": "Experience with specific donor stewardship tactics."}, {"date": "2 Sept 2021", "title": "Campaign Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Met with a few people - basic interview questions. Hiring manager, national partner, and a few other people in the region. It was pretty straight forward, but rather long. In total, I had three interviews with a range of people.", "Interview Questions": "How do you like to be managed?"}, {"date": "6 Apr 2022", "title": "Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society (New York, NY) in Sept 2021", "Interview Descriptions": "Three interviews with fairly casual conversations. After the recruiter call I spoke with the Campaign Director via Zoom, then her and the Executive Director for the final interview. They were very friendly and easygoing. Genuine and wanted to know why I wanted to be part of their organization and what the mission meant to me.", "Interview Questions": "- Why LLS?\n- What does the mission mean to you?\n- Extensive dive into past experiences"}], [{"date": "22 Jul 2021", "title": "Patient and Community Outreach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "1st Round: Spoke to an internal recruiter over a phone interview\n2nd Round: Video interview with directors (1 hour)\n3rd Round: Video interview with VP and ED for 1 hour (would have been in person)", "Interview Questions": "Tell me about a time where you encountered a difficult time with a volunteer and how did you handle it?"}, {"date": "21 Jan 2021", "title": "Campaign Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "I emailed and had a call with one team member on operations. I went into the office and met with 4 team members ( 2 peers and 2 directors). I had a final call with who would be my direct manager and the executive director. I would say the entire process takes around 3 weeks", "Interview Questions": "How do you help upkeep moral and deal with difficult situations?"}, {"date": "23 Mar 2021", "title": "Campaign Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society in Oct 2020", "Interview Descriptions": "Below is the step by step interview process, which took place over two months:\r\n1. Phone interview\r\n2. Panel interview \r\n3. Interview with Regional Executive Director \r\n4. Interview with Territory Director\r\n5. Submit three references \r\n6. Hiring Manager called all three references", "Interview Questions": "What is your experience with fundraising?"}, {"date": "28 Sept 2020", "title": "Anonymous Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "A phone screen, followed by a panel interview, then a final interview with the executive director. First two rounds of the interview process were great. Really friendly team, had in-depth honest conversations about my experience and why I was interested in the position. They followed up asking if I'd be interested in applying for the same position for a different campaign, looking to help \"find the best fit\" which I appreciated. Then during the final round with the ED, she aggressively interrogated me about why I was changing jobs and my lack of experience hitting quarterly KPIs. I had been quite upfront about my experience at smaller non-profits and why I was looking to transition out of my current role, so to be aggressively grilled about it during the final round instead of being cut loose earlier on in the process was incredibly jarring. She then revealed the starting salary, which had never officially been given and it was very low, even for a non-profit job. She tried to justify the pay and talk up the benefits and work culture, after spending the first half of the interview making it clear she didn't think I was qualified for the position. After all of those red flags, I planned to withdraw my application but ultimately received a very prompt rejection email from the hiring manager. Definitely one of the worst interview experiences I've ever had with an organization.", "Interview Questions": "How do you hold yourself accountable for goals?"}, {"date": "8 Sept 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "I had a screening phone call with the hiring manager. I then had an interview with the manager of the team over Zoom. The interview process was easy and straightforward. Make sure to do research about the position and non-profit beforehand.", "Interview Questions": "Why did you apply for this role?"}, {"date": "26 Aug 2020", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Panel interview with the entire leadership team.  Mostly behavioral questions . The staff is on the website, so look people up before you go in and check out their annual report so you can talk about things they're working on / have done in the last year.", "Interview Questions": "Behavioral mostly and a panel style interview with the leadership team\n"}, {"date": "1 Jun 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society (Palm Beach, FL) in Jul 2020", "Interview Descriptions": "Successful candidates proceed to in-person or virtual interviews with hiring managers and team members. Assessments, reference checks, and background checks may also be conducted. Ultimately, a final decision is made, and the selected candidate receives a job offer, which can be negotiated before acceptance.", "Interview Questions": "Please tell me about yourself?"}, {"date": "25 Nov 2020", "title": "Retail Management Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society (New York, NY) in Jan 2020", "Interview Descriptions": "They got back to me quickly and communication was easy. All the questions were about my personality, past work experience, and situational questions. I was interviewed by the director of the program and someone on their administrative team. They were very warm and friendly.", "Interview Questions": "Q: What is a situation you have been in where you had to step up when no one else would? "}, {"date": "13 Apr 2023", "title": "HR Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society (New York, NY) in Jan 2020", "Interview Descriptions": "I went through 2 rounds of interviews and it was such a great experience. It didn't even feel like an interview, more like an informal discussion just to get to know each other", "Interview Questions": "What is your greatest accomplishment? Why did you choose LLS? What are your strengths and weaknesses? What is something that we didn't talk about that you would like the hiring manager to know about you"}, {"date": "31 Oct 2019", "title": "Campaign Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "It was a very easy process that started off with a phone interview and then an in-person one. I was hired a week after the interview and it took about a month to start.", "Interview Questions": "What do you know about the company? Tell me some responsibilities you had at your previous role"}], [{"date": "10 Jan 2020", "title": "Senior Director, Advocacy Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Leukemia & Lymphoma Society (Washington, DC) in Oct 2019", "Interview Descriptions": "A marathon.\r\n\r\nStarted with virtual/phone interviews with a recruiter, a director-level employee and a VP based at the NY headquarters. Then,  was brought to the DC office for 3 hours of interviews. Three separate groups, each interview an hour long. Then, the next day, another virtual/phone interview the following day with an external consultant. The hiring manager and recruiter both reached out a few days later to say they were still working through some things but were expecting to resolve everything shortly. During the in-person interview, each group reiterated with excitement that they were looking forward to have someone on board ASAP. \r\n\r\nThen, radio silence. \r\n\r\nIt's been several months and no word to at least say I'm out of the running. I'm assuming I am, because it's been several months. But who knows?\r\n\r\n*I say virtual/phone interviews because each one was communicated as a video interview using Zoom, but in both cases, technology issues on their end resulted in a simple phone conversation.", "Interview Questions": "How do you plan to communicate with everyone in the office?"}, {"date": "3 Jun 2020", "title": "Intern Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Leukemia & Lymphoma Society (New York, NY) in Oct 2019", "Interview Descriptions": "Asked do you know what LLS is? What's your relevant work experience? What are you hoping to get out of LLS? Had a prelim interview for 10 mins, then an in person interview the next day for 30 mins.", "Interview Questions": "Do you know what LLS is?"}, {"date": "22 Oct 2019", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Leukemia & Lymphoma Society (Dallas, TX) in Jul 2019", "Interview Descriptions": "I applied online. I had a phone interview, followed by an in-person interview. There was no HR involved anywhere in the process. The phone interview and the in-person interview were with the Hiring Team. They had a number of positions open and were simultaneously checking my fit with all the open positions, which kind of became tricky - not knowing what they were looking for.  Fundraising questions were the focus of the in-person interview. Early in the process, they were good with keeping you posted on the next steps, etc. After the interview, they kind of ghosted me and I had to chase them to find out if we were moving forward. Wasn't very professional of them to do that.", "Interview Questions": "Standard questions like Tell me about yourself, Why LLS, Strengths and Weaknesses. Lots and Lots of questions about fundraising. That is all they want to know - how much can you fundraise?"}, {"date": "25 Aug 2021", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society (Columbus, OH) in Jul 2019", "Interview Descriptions": "I had an initial phone interview with someone from HR. I was originally contacted by email and they were willing to work with my schedule. the person I spoke with was very friendly ans engaging.", "Interview Questions": "What I knew about the organization "}, {"date": "12 Jul 2019", "title": "Campaign Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Leukemia & Lymphoma Society (Omaha, NE) in Jul 2019", "Interview Descriptions": "It was all very quick. Application in Friday, call by Monday, interview Tuesday, offer Wednesday, etc... Unlike a lot of non-profits I have worked with, this seems to be quicker in their decision making process. \r\n\r\nThe only way to apply to work with this organization is through their website, be prepared to do that all in one sitting.", "Interview Questions": "They asked me to describe relevant experiences applicable to this position."}, {"date": "29 Jun 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Phone interview that explained the work I’ll be doing for the campaign. Very friendly staff searching for enthusiastic and positive individuals. Explained that Internships for non profits are not paid.", "Interview Questions": "Why are you interested in non profit?"}, {"date": "8 May 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Very positive, interviewer was helpful and knowledgable about the position. They wanted to know more about the kind of person you were. They were open to teaching you more about the position.", "Interview Questions": "Why LLS?"}, {"date": "1 Mar 2019", "title": "Operations Administrator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Leukemia & Lymphoma Society (Los Angeles, CA) in Feb 2019", "Interview Descriptions": "Straight forward: I applied online and received an email soon after to schedule an in-person interview. I interviewed with the person I would be replacing and the Director. Interview was listed to take 30 minutes, however, it went over 2 hours.\r\n\r\nThe very next day I receive an email advising they selected another candidate. However, the job posting is still online. Dishonesty raises a RED flag - will not consider this employer in the future.", "Interview Questions": "Why are you interested in the position?"}, {"date": "5 Apr 2020", "title": "Campaign Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society (Montreal, QC) in Feb 2019", "Interview Descriptions": "Met an HR rep at a career fair, then applied for the position online. Supervisor then called me to ask a few behavioral questions, and then I went to the office to do a final in person interview. Overall, very casual experience.", "Interview Questions": "Why LLS?"}, {"date": "9 Jan 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "I applied online for the position. Shortly after I was contacted via email for a phone interview.  Once I cleared that I had an in-person interview and received an offer shortly after.", "Interview Questions": "Tell us about yourself. "}], [{"date": "7 Dec 2018", "title": "Outreach Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "I applied with the recruiting company that they work with, I was told that they reviwed my resume and was very impressed with my background, she said I can get you $20/hr. and set me up with a phone interview with the campaign Mngr. Lisa, that went well, she said they would call people back by weekend to come in for in person interview, the agency called me the next day and said she really likes you after the interview how soon could you start!\n\nThe day of the interview 30mins. before I received a email that the position has been cancelled and the interview because they do not have enough revenue to support the position any longer and if it becomes available they will call me. That was a few weeks ago, now the position is back online with no pay amount advertised and I was never informed because I'm sure the pay is less now and I was over qualified.\n\nWhy attempt to hire people, get them to the final stage then say you don't have the revenue to support the position, it makes candidates feel you guys are incapable of paying them if they were to gain a position. And hearing that about a foundation is quite scary. Makes you appear to have financial issues. Also, don't waste people's time. Don't wait 30min. On the day of the interview to have the temp agency you work with to wait to tell someone you guys can not financially support the position at the last minute then you guys post the job up at a later date with no pay at all advertised.", "Interview Questions": "how soon can you start"}, {"date": "22 Apr 2021", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society (Atlanta, GA) in Sept 2018", "Interview Descriptions": "Telephone Interview with HR for 30 mins to provide overview of responsibilities and my skill sets.  Situation based interview within two weeks of phone screening in person with Hiring Supervisor and Senior Leadership.\r\nVirtual interview with Senior National Director.\r\nReceived offer within 7 days and I boarded within the next week.", "Interview Questions": "How to recruit and engage volunteers?\r\nHow to cultivate relationships with new and returning corporate donors?\r\n"}, {"date": "8 Feb 2022", "title": "Associate Director of Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Leukemia & Lymphoma Society in Aug 2018", "Interview Descriptions": "I went through 4 rounds of interviews. Started with HR outreach and initial phone interview, then an interview with the national office on the phone. Then I met the team in person at the chapter office - interviewed by the Executive Director. The last step was a final interview with national office.", "Interview Questions": "What is your experience soliciting $10K+ gifts? $100k+ gifts."}, {"date": "29 Sept 2018", "title": "Project Assistant; Talent Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society in Aug 2018", "Interview Descriptions": "I applied online and received an email a month later from HR asking if I'd like to do a phone interview which I agreed to. Everything seemed to be going pretty well; the HR representative seemed kind and lighthearted, typical interview questions, felt more like a conversation than an interview. Then we finally get to the big question: why are you looking to leave your current company? I explained to her that I didn't really enjoy working in the toxic environment that I was currently in. It made it difficult to really enjoy my creative work when everything was based on fear. The HR rep decides to put her two cents on \"difficult\" work environments:  she confesses that she has been lucky enough to have never experienced a \"bad\" work environment and that LLC treats its employees like family. She then goes on to lecture me on how I should remain at my current job, toxic work environment and all, and REALLY take it all in and experience it. That it would be good for me. I am sorry lady but until you've experienced a manger, a grown adult,  who literally bullies you on the daily, do not lecture me about \"experience\" when my mental well-being is on the line. Completely offensive.", "Interview Questions": "Is $35k enough? "}, {"date": "31 Jul 2018", "title": "Campaign Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society (Dallas, TX) in Jul 2018", "Interview Descriptions": "Had a phone interview to begin with. Then was called in for an in-person interview which did not seem too structured. I was asked about part time positions which I had only applied for full time and was clear about that during my phone screening. Was told I would hear back within 7-10 days. Did not hear back for two weeks asking if I was still interested. I said yes and gave some time and dates I would be able to speak about this. Was NEVER emailed or called back. Completely disregarded. Very unprofessional on the employees part, they could have at the least responded to an email.", "Interview Questions": "How do your skills prepare you for this role?"}, {"date": "31 Oct 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society (Madison Heights, MI) in Jun 2018", "Interview Descriptions": "Very easy and straight to the point. Questions are more about you and how you feel about LLS as a non-profit. Questions about what you hope to accomplish to in your time interning.", "Interview Questions": "Why do you want (to intern) here?"}, {"date": "24 Jan 2020", "title": "Area Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Leukemia & Lymphoma Society (Boise, ID) in Mar 2018", "Interview Descriptions": "A recruiter set up an interview time, then never EVER called, even after I sent follow up emails.  I sent a follow up email to the Executive Director, who also never followed up or offered an explanation or apology.  I've never applied or given money since", "Interview Questions": "N/A"}, {"date": "2 Nov 2017", "title": "Texas Works Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 6 weeks. I interviewed at Leukemia & Lymphoma Society in Nov 2017", "Interview Descriptions": "I applied on the 17th, got the phone call on the 25th and interviewed on the 1st. I went in for my interview and was promptly given a small word math quiz. I was instructed to read one paper and answer the questions accordingly. It was how they calculated their benefits. After that was over (10-20), it was time for the 7 questions. He sat across from me and wrote down my responses. After that he then showed me a small packet that gave a total breakdown of what the job entailed in full detail.", "Interview Questions": "How to you feel about a predictable work schedule?"}, {"date": "16 Feb 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Leukemia & Lymphoma Society (New York, NY)", "Interview Descriptions": "Interview process was short. Three people interviewed me for approximately 20 minutes. Nothing complicated- basic interview questions. Received an offer an hour later. Do your research so you know which department you would like to intern for.", "Interview Questions": "Why LLS?"}, {"date": "7 Feb 2018", "title": "Events Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Friend connected me to opportunity . Set-up an appointment with email.  Asked me about connection to the organization and why I want to work there. It went pretty well. It turned in a nice coffee conversation and less than a formal interview. It was a great process and gave me insight on the company culture.", "Interview Questions": "Basic questions"}], [{"date": "3 Oct 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society (New York, NY) in Feb 2018", "Interview Descriptions": "The interview process was a phone call and then an in person interview where they would ask you questions about your work ethic and interests. It was a very pleasant experience. They whole process took about 2 weeks.", "Interview Questions": "If you could have a super power, what would it be?"}, {"date": "24 Sept 2017", "title": "Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at Leukemia & Lymphoma Society (Nottingham, MD)", "Interview Descriptions": "Many questions, and it was helpful with interviewing experience. They were very interesting and very nice.it was great experience. They asked a lot of good questions and made me think", "Interview Questions": "What salary do you expect"}, {"date": "9 Oct 2017", "title": "Senior Systems Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society in Oct 2017", "Interview Descriptions": "Initial interview. Phone interview. Told it would be in the STAR format. Instead, asked all technical questions. Haven’t heard anything yet, but then, the interview was only two days ago.", "Interview Questions": "Why do you want to leave your current position?"}, {"date": "7 Sept 2017", "title": "Campaign Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society (Santa Ana, CA)", "Interview Descriptions": "They scheduled back to back interviews with 3 people and with candidates back to back also.  It was very informative with the other positions they have open. They didn't give a eta on when they'll have an answer and haven't heard back.", "Interview Questions": "What I know about the organization"}, {"date": "8 Aug 2017", "title": "Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "I applied for the job online. A few days after applying, I got an email about a phone interview. The phone interview lasted about 15 minutes and from there I got an email about the next step. I was brought in for an in-person interview and was offered the job over the phone the next day", "Interview Questions": "How does your experience prepare you for this job?"}, {"date": "10 Sept 2017", "title": "Bank Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Leukemia & Lymphoma Society (Villianur Taluk) in Sept 2017", "Interview Descriptions": "Working experience is a only my thoughts because experience is a best teacher in the world because im a fresher,  but one year experience with retail shop for billing and supervisor.", "Interview Questions": "What is our job in this office"}, {"date": "19 Apr 2018", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Leukemia & Lymphoma Society (New York, NY) in Sept 2017", "Interview Descriptions": "I went through a phone interview after which I was invited to the office in NYC. I met with the Donor Development Head and two other employees. We all sat in a circle and we talked about my skills and interests, as well as the details of the position and ongoing projects they had.", "Interview Questions": "Why are you interested in working at LLS?"}, {"date": "11 Sept 2017", "title": "Civil Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society (Multān) in Sept 2017", "Interview Descriptions": "Using best technology for survey and work with people and good behavior with labour and then we can complete our project before of time or in time and I will try my best to do it", "Interview Questions": "about trade"}, {"date": "27 Oct 2017", "title": "Campaign Manager - Team In Training Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Leukemia & Lymphoma Society (Charlotte, NC) in Aug 2017", "Interview Descriptions": "First interview was a phone interview, second was Skype but there was a technical difficulty so it ended up being a phone interview again, third was in person.  I had a very positive experience, everyone was friendly and kind except when they never said anything even though they said they would \"let me know either way\". I sent an  email to check in and was ignored. I can take a hint but I just feel it's rude and unprofessional to not at least say \"We have gone a different direction\" especially when I took time out of my work day for the interview(s).", "Interview Questions": "When was a time you worked with volunteers"}, {"date": "25 May 2017", "title": "Senior Campaign Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society in May 2017", "Interview Descriptions": "I first had a phone interview with the hiring manger. Pretty straight forward about past experience, etc. The next stage was an in person interview with a panel of three managers. All were very nice and the questions were about past experience, my experience as a manager overseeing direct employees, a couple behavioral questions. About  a week later I was asked back to do a half hour presentation to display public speaking skills. They provided me with materials and I had 30 minutes to prepare a presentation was given to the same three managers. The overall process was really enjoyable, the interviewers were straight forward and very nice. I ended up rejecting the offer simply because I had received other offers that were better compensated, but it seems this place has a great company culture and of course a great cause.", "Interview Questions": "Tell us about the rewards and challenges of being a direct manager? When was a time you worked with high ranking executives who you were trying to get involved in fundraiser? What is your experience in fundraising. "}], [{"date": "28 Apr 2017", "title": "Senior Campaign Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society (San Jose, CA) in Apr 2017", "Interview Descriptions": "I was contacted via email about 3 weeks after submitting my application on a job board website. I had 4 interviews over the course of a week and felt pretty certain based on excellent feedback after each interview that I would receive an offer. I was told to wait a couple of weeks for the process of interview completion. Reached out via email after 10 days to inquire on status and was informed they were not proceeding with an offer of employment. Very nice group of folks, however.", "Interview Questions": "Was is your experience in fundraising and why do you think you would be a fit for this role?"}, {"date": "13 Mar 2017", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "It was a phone interview. Apparently it is a small shop. A lot of do it yourself in that Manager does most of the writing. It struck me that there are no direct reports.", "Interview Questions": "Why are you looking to leave your current job?"}, {"date": "6 Mar 2017", "title": "Campaign Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Leukemia & Lymphoma Society (San Francisco, CA)", "Interview Descriptions": "Brief. Quick resume overview and job description. Nice interviewers and a very relaxed interview in general. No tests: IQ test, drug test; only background test required. Do bring your charm and your A game though.", "Interview Questions": "What kind of fundraising experience do you bring to the table?"}, {"date": "9 Mar 2017", "title": "Senior Campaign Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society (Fayetteville, AR) in Mar 2017", "Interview Descriptions": "I have just completed the phone interview which lasted approximately one half hour.  I was interviewed by one of the women with whom I would be working.  I was told that they would contact me within the next few days if they were going to bring me in for a further interview.", "Interview Questions": "They asked why I was passionate about their mission."}, {"date": "16 May 2021", "title": "Campaign Development Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society (New York, NY) in Feb 2017", "Interview Descriptions": "The process was easy and efficient. In total there were around 3 meetings that focused on different competencies. Everyone made me feel welcomed and I was able to ask questions thoroughly", "Interview Questions": "What is your background in fundraising?"}, {"date": "17 Nov 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Leukemia & Lymphoma Society (New York, NY)", "Interview Descriptions": "Did a phone interview with the intern coordinator and then an in person interview with the intern coordinator as well as the people on the team I would be working on", "Interview Questions": "How has your past leadership prepared you for this role?"}, {"date": "28 Mar 2017", "title": "Senior Campaign Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Leukemia & Lymphoma Society (New York, NY) in Nov 2016", "Interview Descriptions": "I applied for and was screened for the role within the organization, then called for an in-person interview. I believed the in-person went well as I connected with whom would have been my direct report. I never received a callback, however. Where it gets stranger is the fact that I received a call about a week later from a totally different person that I'd never heard of, and she proceeded to screen me again. I had to stop her in the midst and advise her that I was already interviewed in person. She also tried to lowball me when inquiring about salary requirements. My salary expectations had already been discussed, so I was basically waiting on an offer (that I obviously never received). What is most strange about this whole scenario is that I was more than qualified for the role, interviewed well, and got the interview from a personal referral! I was floored at the lack of follow-through and thoroughness in this case. Very disappointing, but perhaps for the best!", "Interview Questions": "How did I recruit volunteers for campaigns and what was my strategy for team-building?"}, {"date": "30 Apr 2018", "title": "Campaign Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Leukemia & Lymphoma Society (Pittsburgh, PA) in Nov 2016", "Interview Descriptions": "First was a short phone interview, which I'm guessing was to gauge personality and ease of communication, considering that's primarily what the job entails. In person is super relaxed as well. The people are incredibly easy to talk to and get excited about what they're doing, even if they're just pretending to be excited", "Interview Questions": "Previous experience; including situational questions to see how you'd handle different tasks/problems."}, {"date": "31 Oct 2016", "title": "Campaign Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "First, there was an in person interview with two team members and then a phone call with the executive director. Overall, it was a pretty standard and easy interview process.", "Interview Questions": "Tell me about yourself"}, {"date": "4 Oct 2016", "title": "Outreach Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Over the phone interview was typical and positive experience. However, I applied for one job and once hired they did the bait and switch. I ended up working on the right campaign but in a lower position with less stability. It seemed the campaign manager was not too keen on what my role was even though she interviewed me. They ended up hiring another person in the role I was hired to be. Their employee portal said one job title and they used a lower title for me in office.", "Interview Questions": "Why do you want to work for LLS?"}], [{"date": "2 Sept 2016", "title": "Campaign Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "When talking to the hiring committee they tried to make the atmosphere as easy to talk in as possible. They seemed to really want to get to know you and what drives you as a person. They are okay with you not having the most experience because they will train you.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "15 Aug 2016", "title": "Outreach Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society (Cincinnati, OH) in Jul 2016", "Interview Descriptions": "Easy phone interview followed by an in person interview.  More of a conversation than an actual interview.  Interview was the person I would have reported to...she was very personable and honest about position.  The only reason I declined the position was the schedule. I was hoping for a more flexible part time schedule and this was a Monday-Friday requirement.  It would be a great company to work for with so much passion for their mission.", "Interview Questions": "How would you handle rejections in order to reach decision maker?"}, {"date": "2 Feb 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society (San Antonio, TX) in Aug 2016", "Interview Descriptions": "Submitted resume online. I was contacted via email for an interview. Met with senior campaign manager in the conference room for the interview. Very informal, lots of dialogue. Overall interview process took 30 minutes.", "Interview Questions": "Tell me about yourself?"}, {"date": "7 Jun 2016", "title": "Campaign Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Leukemia & Lymphoma Society (New York, NY)", "Interview Descriptions": "Interview went well. They asked a lot of questions for a temp position. I had an initial phone interview then interviewed with panel of three a few days later. Overall it was a very quick process. They emailed back saying I didn't get the position which I appreciated. I was referred to apply for another position which I had a phone interview for and did not make the cut. Overall I feel like this company doesn't give people who have passion a chance.", "Interview Questions": "Tell us about a time you used good judgement?"}, {"date": "24 Apr 2016", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "two interviewers in total, one is campaign manager, the other one I don't remember, they are both really nice, first of all, introduce your self, then go through the resumes, ask behavior questions, last, show around the company", "Interview Questions": "tell me about the experience on the resume"}, {"date": "14 Feb 2017", "title": "Event Planner Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Leukemia & Lymphoma Society (Buffalo, NY) in Apr 2016", "Interview Descriptions": "Horrible. The two women who emailed me were so unprofessional. They made me feel so uncomfortable and talked about their own personal lives while I sat there for a while. The job description was misleading and they were actually looking for someone to cold call for donations-not an event planner.", "Interview Questions": "Why do you want to work here?"}, {"date": "2 May 2016", "title": "Senior Campaign Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society (Oklahoma City, OK) in Mar 2016", "Interview Descriptions": "Very professional but very comfortable at the same time. Basic questions were asked. A few interviews beginning with a phone screening, one on one, and then met with others from the office as well. It lasted about an hour and they were very welcoming.", "Interview Questions": "What do you know about LLS?"}, {"date": "26 Feb 2016", "title": "Senior Campaign Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Applied online, was called for a in person interview. I came to the interview prepared and ready. I waited for someone to greet me at the door and there were two women who brought me into a conference room to interview. We spoke for almost an hour. I wrote a thank you note quickly after, but did not hear back from them until 3 weeks after letting me know they were moving forward with their search. I only wish they would have given me more information about why I was not qualified for the position.", "Interview Questions": "What experience do you have with fundraising?"}, {"date": "28 Apr 2016", "title": "Campaign Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Leukemia & Lymphoma Society (Alexandria, VA) in Mar 2016", "Interview Descriptions": "I was contacted via LinkedIn for a position with this organization.  Was very interested. Did a phone interview that lasted about 20 minutes. Then was brought in for an interview a few weeks later.  This lasted about 45 minutes.  Thought it went great, the two women I meant seemed very nice.  Tried to follow up about a week later with any updates.  No response.  Made a phone call the next week for the same reason.  No response.  Got a phone call the next day with a voicemail saying they went with someone else.  I found this to be tacky and unprofessional.  I was not able to ask any questions about what made me unqualified especially when I was the one approached or inquire about any other positions with LLS.", "Interview Questions": "Talk about your history with fundraising, how were you successful etc."}, {"date": "11 May 2016", "title": "Campaign Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Leukemia & Lymphoma Society in Mar 2016", "Interview Descriptions": "They spent about half an hour asking me questions about my experience and skill set. Basic interview stuff. We initially did w quick phone interview and I was then called in for a face to face meeting.", "Interview Questions": "What are your strengths and weaknesses?"}], [{"date": "7 Jul 2016", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Leukemia & Lymphoma Society (White Plains, NY) in Feb 2016", "Interview Descriptions": "Submitted resume, was contacted 3 months later by an in-house recruiter. Had a phone call with her, then an in house interview. It was a 360 - meeting my supervisor, my peers and my direct reports. After all that, radio silence. It took them about a month after this to tell me they went with another candidate.", "Interview Questions": "What brought you here?"}, {"date": "1 Mar 2016", "title": "Campaign Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Leukemia & Lymphoma Society (Atlanta, GA) in Jan 2016", "Interview Descriptions": "I applied online and received an email shortly thereafter. After setting up a phone interview, the director called me in for a face-to-face interview, followed up a week later with an additional phone interview with the district manager. All very pleasant and thorough. Didn't get the position but was runner up--the director was very nice after I inquired why I didn't get the job.", "Interview Questions": "I was asked how I handled difficult personalities and how I resolved conflict"}, {"date": "21 Jan 2016", "title": "Special Events Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society (Pittsburgh, PA) in Nov 2015", "Interview Descriptions": "The interview was very relaxed.  I interviewed with two of the campaign managers who are also the internship supervisors and they were very interested in learning about my previous experiences and wanted to make the internship interesting based on what I was studying in school.", "Interview Questions": "They asked me to describe previous jobs/internships I had, why I was interested in the Leukemia and Lymphoma Society, etc. "}, {"date": "8 Mar 2016", "title": "Part Time Campaign Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society (Sacramento, CA) in Oct 2015", "Interview Descriptions": "The interview process wasn't too bad and was fairly easy. I found the position for a part time campaign assistant online on indeed.com. It was for the Light the Night campaign and it was only a temporary job that was good for 3 months.\n\nIt took a couple of weeks but eventually I received a phone call from one of the hiring people who just told me about the positions duties, months that I'd be working and the salary, which was hourly. I agreed and she had set up an interview with me the next week.\n\nI went to the interview which was in a small office here in Sacramento and I was a little early so I reviewed a bit before I went into the office which was Ina building full of other offices. There I met met one of the hiring managers and another girl who would also be interviewing me. The interview was relaxed and they asked me questions about myself and about what it was that I wanted to do after graduation. I was also told that I was the only person that they had brought in and from talking with both of them, I assumed they liked me. At one point me and the hiring woman started talking about our lives and football and how we'd talk about much more if I were to get the job. Both women told me that they had liked me but needed to interview just one more person and that I'd be hearing back from them in a couple of days once that interview happened. However, I never got a call or heard from them again.", "Interview Questions": "Where do you see yourself in the future?"}, {"date": "13 Sept 2015", "title": "Campaign Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society (Seattle, WA)", "Interview Descriptions": "I found the job on Indeed.com and emailed my resume and cover letter. 2 weeks later I received an email and scheduled a first round phone interview. The phone interview was really simple and I was able to ask some questions about the role, however the person I was talking to was in recruiting in California and I was applying for a role in Seattle. She didn't know much about the people I would be working with, but just said everyone in the Seattle office is really nice! About 1 week later I received an email from the Seattle office inviting me in for an in-person interview. \r\n\r\nThe woman at the front desk was a little rude when I came in. I got there 15 minutes early and she seemed annoyed by that. I met with who my direct supervisor would be and one other woman who has a similar role to Campaign Manager. It was an uncomfortable seating arrangement with me and one woman on one side of a desk, and the supervisor on the other side of the desk. I didn't know who to look at. The interview went fine, they were both really nice and welcoming. They told me I would hear back in three days if I got it. Two weeks went by, I checked in twice, and I finally heard back that I didn't get it.", "Interview Questions": "Describe your experience at your last job "}, {"date": "8 May 2017", "title": "Campaign Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Leukemia & Lymphoma Society (Cranford, NJ) in Sept 2015", "Interview Descriptions": "Applied through a referral. Process took 2 weeks. Both interviews were in the office. The first interview was a sit down with my potential boss and co-worker, while the second interview was with my potential boss, a director from a different department and the executive director of the entire chapter. I had to prepare a PowerPoint presentation about leadership that I presented in my second interview. Got a call a week later telling me I got the job.", "Interview Questions": "What is The Leukemia and Lymphoma Society's mission?"}, {"date": "28 Aug 2015", "title": "Campaign Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "This interview was overall good. They didn't asked me anything I wasn't prepared for. The lady seemed really nice and she was writing notes during the interview. I found it weird in the first over the phone interview that she didn't ask me if I had any questions because I did. So that would be the only thing I didn't like about the interview.", "Interview Questions": "what are two of your accomplishments?"}, {"date": "14 Aug 2015", "title": "Campaign Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 5 days. I interviewed at Leukemia & Lymphoma Society (San Jose, CA)", "Interview Descriptions": "interviewed with director and managing director; two separate interviews.  Very easy process.  Just went over resume and asked a few questions. Truly should have been a more thorough interview to ensure that I had the proper skills and understand of the job.  Not a very organized interview process at all.", "Interview Questions": "N/A"}, {"date": "13 Jul 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Standard interview process. Phone interview, in-person group interview, in-person interview with Executive Director. Easy process, they made me feel comfortable and asked questions relevant to the position, mainly focusing on fundraising experience.", "Interview Questions": "Tell us about your previous sponsorship successes."}, {"date": "15 Aug 2017", "title": "Fundraising Campaign Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society (San Diego, CA) in Jun 2015", "Interview Descriptions": "The process took FOREVER. I interviewed over the phone in June of 2015 and didn't come in for an in-person interview until July of that year. Then, they hired me over two months later and I didn't start until October of 2015. It was so ridiculous. The interview itself was pretty standard and straightforward.", "Interview Questions": "Why do you enjoy working for non-profits?"}], [{"date": "25 May 2015", "title": "Campaign Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society (Pittsburgh, PA)", "Interview Descriptions": "Interview process included a phone screening and two in person interviews. During the phone interview, they described the position in full as well as salary and benefits. Most organizations don't seem to be as upfront with this information, but it was nice to know all the details before the process began. The whole process took about two weeks. Would have liked to receive a phone call or email after the final round of interviews. In my mind it was poor taste that it took 3-4 weeks after the final interview that I had not been selected. Overall, great experience and fantastic organization.", "Interview Questions": "If XX happened during an event, what would you do? How would you fix the problem?"}, {"date": "16 Nov 2015", "title": "Patient Services Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Leukemia & Lymphoma Society (Dallas, TX) in Apr 2015", "Interview Descriptions": "I got the phone interview first with the Development Specialist. The questions were all common questions. The second round of the interview is in-person interview. I met the Development Specialist and the Patient Access Management at the office. They went through my resume and asked me some questions regarding to me past experiences. The questions were not difficult, and the interviewers are kind. It was a relaxing talk.", "Interview Questions": "What is your goal for being an intern at LLS"}, {"date": "14 Nov 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Leukemia & Lymphoma Society (Madison Heights, MI) in Apr 2015", "Interview Descriptions": "They asked great questions and were very friendly, which made the whole process much more comfortable. It was one on one, which is preferable. Anything more than that winds up feeling like an inquisition. It is the worst, especially for people like myself with social anxiety", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "6 Feb 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society (Chicago, IL) in Apr 2015", "Interview Descriptions": "First was contacted over the phone. Then they emailed me back asking for a Skype interview. If I had been in the city at the time I would have gone in but I was still in school so I got interview but two executive members via Skype for about 46 minutes", "Interview Questions": "What have you learned from past experience that would contribute to this role"}, {"date": "23 Jan 2015", "title": "Campaign Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Leukemia & Lymphoma Society (Cary, NC)", "Interview Descriptions": "The Director followed up by email to get the interview process rolling. The first interview consists of meeting with the Campaign Director and the Executive Director. If they are interested, they will follow up by email to schedule a second interview. At the second interview you, again, meet with the Director and Executive Director to talk more about past experience and personal traits but you also must give a presentation. They bring in other employees to listen to your presentation and ask questions. If they are interested in hiring, they will call you and give you an official offer. Once you take the offer, they will provide you with the necessary materials and web links to complete the hiring process.", "Interview Questions": "Give an example of a time when you had to problem solve."}, {"date": "23 Dec 2014", "title": "Recruitment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "All interviews were over the phone.  The first interview was from the manager and the second was from the coordinator I would be working under.  The interviews were easy and relaxed.  Very Conversational.", "Interview Questions": "Management wanted to ensure that you would be able to work from home"}, {"date": "27 Oct 2014", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Leukemia & Lymphoma Society (White Plains, NY)", "Interview Descriptions": "The interview process was easy and quick. I applied for the position through school, and was contacted almost immediately. We scheduled an interview over the telephone. The interview was professional as to be expected. I was asked a series of questions pertaining to the society, and my experiences.", "Interview Questions": "What interested you about the society, and why would you be an asset to our team?"}, {"date": "15 Oct 2014", "title": "Campaign Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Leukemia & Lymphoma Society (Hollywood, FL)", "Interview Descriptions": "I got refered by a friend. I was interviewed by the Campaign Director a week after I sent my resume. The interview was very short and precise. A few days later, they called me with and offer and I started a month after. A few days later, they called me with and offer and I started a month after.", "Interview Questions": "Why do you wan't to work with us?"}, {"date": "17 Oct 2016", "title": "Grant/Development Position In Western US Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society in Oct 2014", "Interview Descriptions": "Applied online then had a long phone interview with a very obnoxious interviewer from the East Coast.  BTW, I am from the East Coast and she displayed all the undesirable communication skills of those living there that I certainly do not miss.  She seemed very interested in the consulting work I did between jobs and reasons for job changes.  Gee, lady if you saw those as red flags, then why did you chose me for the interview, or continue the conversation for an hour?!!   She kept asking how I supported myself between jobs and was unaware of something called unemployment.\r\n\r\nI wasn't interested in continuing the process even if they wanted to do so.", "Interview Questions": "How did you support yourself between jobs?"}, {"date": "16 Mar 2017", "title": "Campaign Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Leukemia & Lymphoma Society (San Juan, PR) in Sept 2014", "Interview Descriptions": "The whole process is very thorough and complete. They require a background check, since this is a Non Profit Organization. A decent amount of paperwork to fill out. One on one interview that was very well done.", "Interview Questions": "Background check"}], [{"date": "30 Jun 2014", "title": "Campaign Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Within one week of submitting the online application, I received an initial email from Human Resources to set up a phone interview -- expectation for 45 mins. After this conversation, the Recruiter advised they would be speaking with the local chapter and would follow-up within one to two weeks, whether or not the decision was to move forward.  About 2 weeks later, I was invited for an in-person with the local Operations Director.  We met for about an hour and spoke more specifically about the role, requirements and culture within the chapter.   They advised they would be in touch and about 1 week later, I was invited to meet back with that same Ops Dir, the Executive Director, Patient Services Manager and a Board member. About 1 week later, I received the verbal offer and was asked to verify 3 professional references as well as submit to a background check.", "Interview Questions": "Nothing too unexpected and mostly standard behavioral questions."}, {"date": "15 Apr 2014", "title": "Campaign Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "5 interviews over a period of 3 months. Began with a phone interview where basic experience type questions were asked. Second interview was a series of interviews with all of the local staff. Everyone from the office manager to the Director got a turn to interview. Third interview was back to phone. Fourth interview took place about an hour and a half from my home. I needed to travel from my home to another city to meet the \"team\" there. Then i was  interviewed by the ED, a national director, my director, and every member of the team, one at a time.  After hours of interviewing, I was given a vague outline, 5 minutes to prep, and told to give a \"sales pitch\" to the entire team. Finally one more phone interview and a hiire", "Interview Questions": "What is the first thing you will do if you get the job?"}, {"date": "4 Apr 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "2 telephone interviews and 1 in person interview with a team. Realized none of the interviewers knew what they were talking about pertaining to the position. They all looked and talked like they came from the same neighborhood. Workplace culture seemed insular, closed.", "Interview Questions": "None. These guys had no idea what they were doing. It felt like they just wanted to get over with it."}, {"date": "2 May 2015", "title": "Senior Campaign Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Leukemia & Lymphoma Society (Hauppauge, NY) in Apr 2014", "Interview Descriptions": "Approximately 1-2 weeks after submitting an online application and resume, I received an email asking if I was still interested in the position and would I be interested in proceeding further on to the next step in the process and would I like to set up a day and time for a telephone interview.  This was scheduled for approximately three weeks after I had completed the original online job application. It took approximately 30 minutes and was lead by a member of the human resources team.\r\nI received another email asking again if I were still available and interested in continuing on to the next step in the interview process and was I free to set up a personal one on one interview at their local chapter office.\r\nThis  interview took place at their office with the person on the development team who would be my direct supervisor.  At the conclusion of the interview, it was explained that the next step in the process would be to set up an interview with the chapter director.\r\nThe process ended when I received a gracious thank you email approximately six weeks after the time the online application was first submitted explaining the position had been filled.", "Interview Questions": "What fundraising campaign experience did I have that was not event oriented?"}, {"date": "5 Feb 2014", "title": "Marketing Assistant: Pennies for Patients (TEMP) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "For the Marketing Assistant position for LLS they asked you to create a Powerpoint presentation about the program itself and present it to your interview committee.  They would then ask you several questions about the program based on your presentation to answer.", "Interview Questions": "N/A"}, {"date": "6 Mar 2014", "title": "Campaign Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Leukemia & Lymphoma Society (Phoenix, AZ) in Dec 2013", "Interview Descriptions": "I had an initial interview as an intern. I got hired on on the spot and started working three weeks later. It was all very casual and easy going.", "Interview Questions": "There really weren't any surprised"}, {"date": "27 Apr 2016", "title": "Campaign Coordinator Team In Training Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society (New York, NY) in Dec 2013", "Interview Descriptions": "It did seem a bit long and they asked fairly standard questions. The biggest curveball was the presentation. You typically have a phone interview with the most senior person in the campaign, the director, and they determine if they would like you to move forward or not. Then 1-2 in person interviews (the first with one person, who you had the phone interview with) and then the other with one or two other staff members (hiring manager or manager, and coordinator). From there there's a presentation that you have 20-30 mins to prepare after being given the topic. That was the most difficult part to me.youre presenting to a group of about 5 and then they ask you questions after based on your presentation.", "Interview Questions": "If you're given 200 participants to manage, how do you go about working with them?"}, {"date": "27 Nov 2013", "title": "Campaign Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "The interview process fit well with the position.  I was interviewed on a one time appointment by three people.  Just review typical question and answers and mean what you say and your feelings will show for this great organization", "Interview Questions": "There was not one difficult question - just make every question an opportunity to turn things into a positive experience."}, {"date": "27 Mar 2014", "title": "Campaign Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Leukemia & Lymphoma Society (Atlanta, GA) in Nov 2013", "Interview Descriptions": "Started with a phone interview, then had in-person interview with two people, then an in-person with three people (never including my manager), and one meeting with the director. The interview for three people consisted of a presentation I had to come up with, based on a short outline they give you literally the day before.", "Interview Questions": "What do you think your daily job duties will be / what the job will be like"}, {"date": "22 Aug 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society (Los Angeles, CA) in May 2013", "Interview Descriptions": "It's a 2 step process: a phone interview and then an in person interview. I felt like getting the in person interview means you have a pretty good chance at getting the position.\r\n\r\nThe phone interview asked the standard interview questions: team building, interests, goals, etc. It wasn't extremely casual, nor was it super professional. The in person interview asks a few more questions. It's definitely a lot more casual and laid back. Overall, a positive interview process.", "Interview Questions": "Mostly behavioral questions, nothing really unexpected"}], [{"date": "26 Mar 2013", "title": "Campaign Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society (New York, NY)", "Interview Descriptions": "First round is phone interview, then you get called in for an interview with a panel of staff (3-4 people will be in the room). Questions asked are standard for all interviews and staff will read them word for word. They're looking for specific examples, and for questions to be set up in full, comprehensive ways. Depending on the position, the next round is a presentation for this same staff (typically on another day), and then after that, you may meet with the head of the department.", "Interview Questions": "Know how to relate your experience to fundraising, even if you've never done it before."}, {"date": "25 Mar 2013", "title": "Light the Night Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Leukemia & Lymphoma Society (Baltimore, MD)", "Interview Descriptions": "I scheduled an interview quickly with the LTN Manager. Dress business professional, a full suit isn't needed. They asked a series of questions about weaknesses, and big picture or detail oriented, generic questions. Make sure you ask questions about the job. They are very polite and fun, so make sure you smile. Dress clean and professionally.", "Interview Questions": "none, very generic"}, {"date": "10 Mar 2013", "title": "Campaign Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "I submitted my resume with a friend and was contacted by LLS.  Initial interview was a casual phone interview.  After that I met with the Campaign Director for about an hour, and met the Executive Director for a little bit as well.  I got called back for a third interview which will consist of a presentation.", "Interview Questions": "The Executive Directer was a bit off-putting, but nothing too crazy or out of the ordinary."}, {"date": "1 Dec 2012", "title": "Campaign Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Leukemia & Lymphoma Society (New York, NY)", "Interview Descriptions": "Three rounds. First is the phone interview (very simple). Their entire interview process is scripted. Their staff is NOT allowed to ask anything more than what is written (hence the lack of creativity and robotic employees they are looking for). Second round is a book full of questions, suggestion: respond to each question with an example. VERY generic questions. Third round is a presentation. They give you a packet to read from and ask you to \"sell a campaign\" to a fake audience. They give you markers and a flip chart to use. They also ask you to input numbers on an excel document to see how you work with excel (know how to make a graph/chart on excel!)", "Interview Questions": "N/A"}, {"date": "11 Oct 2012", "title": "Campaign Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society", "Interview Descriptions": "Any information I might give is no longer relevant, as the people with whom I interviewed have left or been fired.  I first had a phone interview and then an in-person interview, both of which lasted about an hour.", "Interview Questions": "N/A"}, {"date": "17 Apr 2012", "title": "Campaign Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Leukemia & Lymphoma Society (Natick, MA) in Mar 2012", "Interview Descriptions": "1) Phone interview, 2) 1:1 interview 3) Group interview and a presentation on a case that they provide you when you come in for the interview.  You have 20 min to prepare a 10 min presentation on the case. \r\n\r\nStaff was very friendly, especially the lower management staff.  They encouraged lots of questions and were very interested in getting to know you.  Presentation was very appropriate in terms of assessing skill set but it was a little awkward.  The staff asked virtually no questions and just stared; but was told I did an exceptional job.  Other presentation style interviews were far more participatory and engaging.  \r\n\r\nThe only other negative was that they were very vague on the hiring requirements and timeline (especially for a final candidate) which made it difficult to navigate other offers.  They didn't really keep you in the loop and often went days to weeks between interviews before hearing anything.  Sent the decision in the mail with no real explanation.  \r\n\r\nOverall, the interview process is intensive, but not overly difficult.", "Interview Questions": "What are you greatest strengths and weaknesses?"}, {"date": "6 Sept 2016", "title": "Senior Campaign Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Leukemia & Lymphoma Society (Washington, DC) in Feb 2012", "Interview Descriptions": "Multiple rounds. Standard Q+A, but also a role playing part where you have to make a big pitch. Talking about your past experience particularly fundraising and year over year success was important. Have numbers prepared. Be able to talk about resilience and overcoming obstacles. Be able to talk about your management experience and problem solving!", "Interview Questions": "Describe an event you were in charge of that was successful."}, {"date": "1 Dec 2015", "title": "Campaign Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Leukemia & Lymphoma Society (Calgary, AB) in Dec 2011", "Interview Descriptions": "First was an hour long phone call with ED then the next week there was a second interview over Skype with Manager, one hour, average, mostly positive and laid back", "Interview Questions": "Past experience"}, {"date": "23 Jun 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Leukemia & Lymphoma Society (Houston, TX) in Jan 2011", "Interview Descriptions": "It was a few years ago and the process has changed since.  At that time I only met with the Office Manager. Now the process is to come in for a face to face, then they may ask you back for a presentation and to meet with other highlevel managers.", "Interview Questions": "About my experience and how that would benefit the postion."}, {"date": "4 Oct 2011", "title": "Campaign Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Leukemia & Lymphoma Society in Jan 2011", "Interview Descriptions": "Very kind and enthusiastic interviewers. Small work culture: it's just one branch of many. The interview on the phone seemed very easy and conversational. The group interview was with two of the higher up people in the branch. I felt comfortable.", "Interview Questions": "Have you ever had a problem with a co-worker? If so, how did you handle it?"}], [{"date": "7 May 2012", "title": "Payroll Temp Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Leukemia & Lymphoma Society in Oct 2010", "Interview Descriptions": "Recruiter called me and scheduled interview for the next day.  I had a group interview with 4 people that lasted about 1 and 1 half hours.  Lots of detail.  It was only for what I was told a temp assignment. It ended up that I was hired 5 months later full time.", "Interview Questions": "Tell me specifically how you handled this situation... garnishments, year end, adjustments, corrections, research etc."}, {"date": "15 Mar 2011", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Leukemia & Lymphoma Society in Nov 2009", "Interview Descriptions": "Asked questions about past experience and non-profit sector.", "Interview Questions": "How has past experience led me to applying here."}, {"date": "17 Jun 2010", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Leukemia & Lymphoma Society (Washington, DC) in Dec 2008", "Interview Descriptions": "I was already working as a temporary assistant for the Leukemia & Lymphoma Society and my superiors expressed interest in me applying for a full-time position there. I spoke with several management-level employees of the company about opportunities for me there. Although the process was very informal, it was clear that they had a place for me if I wanted it.", "Interview Questions": "What is your interest in the Leukemia and Lymphoma Society, specifically, if any?"}, {"date": "25 Sept 2012", "title": "Campaign Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Leukemia & Lymphoma Society (Shawnee, KS) in Oct 2008", "Interview Descriptions": "The interview process was very normal, but the salary was never mentioned until the offer was made.", "Interview Questions": "I was asked if I had any life changes/expectancies coming up that would effect my work."}, {"date": "18 Mar 2009", "title": "Executive Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Leukemia & Lymphoma Society in Sept 2008", "Interview Descriptions": "The recruiting firm called and asked me for a detailed resume with salary history.  I was reluctant to give the salary history but they pressured me to do so.  After a lengthly phone interview with the recruiter I was scheduled for an in-person interview with a staff person from the national office.  She was in town for one day to do all her interviews.  She described the former candidate as having \"bad boundaries\".  When I inquired about what that meant, she said they were \"too close\" to their Board members.  She said she had to \"straighten out\" the problems the former candidate had caused.  I asked how willing she felt the Board members would be to follow a new leadership style or strategy.  She made it clear that she would be very \"hands on\" in seting any future strategy.  Pay was good but I left feeling the next candidate would face a rocky road between \"reporting up\" and seeking to bring a new vision to the organization.", "Interview Questions": "\"How would you meet the goals?\""}]]