[[{"date": "10 Sept 2019", "title": "Financial Planner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Stevens-Henager College (Provo, UT) in Oct 2018", "Interview Descriptions": "Three interviews with higher and higher levels of management. First, I met with my direct manager and coworkers. Then with my direct manager and his manager, and then lastly my direct manager and other managers of the same level as him", "Interview Questions": "Why do you want this job?"}, {"date": "20 Sept 2018", "title": "Marketing Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stevens-Henager College", "Interview Descriptions": "Phone first, then a series of in person interviews. They took me around to meet the team and ask as many questions as I'd like. Questions on the interview were about my past experiences and successes at my job.", "Interview Questions": "relevant to the job"}, {"date": "13 Mar 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stevens-Henager College (Murray, UT) in Jan 2018", "Interview Descriptions": "Two interview process. First was with direct supervisor. Second was to meet the team to see if I was a good fit. Overall, it was an extremely easy process. I was almost extended a job offer in the first interview.", "Interview Questions": "What is your experience with reviewing applications?"}, {"date": "21 Apr 2016", "title": "Nursing Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Stevens-Henager College (West Haven, UT)", "Interview Descriptions": "Poorly organized meeting with Dean. Interviewer had poor knowledge of all Nursing Department administration.  Faculty seemed uninterested in College, students, and in meeting possible New faculty members. Very low education instruction experience on part of nursing faculty overall. Vague answers to specific questions on instructional expectations, curriculum outcomes and of student grad feedback.", "Interview Questions": "What I'd like to be paid."}, {"date": "10 Jul 2017", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stevens-Henager College (Layton, UT) in Apr 2016", "Interview Descriptions": "The hiring process was simple, submit a resume and schedule interview. The interview was short and lacked any in-depth questions. I sat with two supervisors for maybe ten minutes and don't remember them asking much about my skills or interest in the position. The questions were very basic and I did not feel I got a very thorough chance at explaining why I wanted the position or why I would be a good fit within the company.", "Interview Questions": "If you could pick one Disney character you are like, who would it be?"}, {"date": "5 May 2015", "title": "Marketing and Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stevens-Henager College (Chelmsford, MA) in Apr 2015", "Interview Descriptions": "Applied online, had a phone screen through HR, scheduled in-person interview, met with HR first, then 2 project managers and then the manager of the team. One of the team did not look as though she wanted to be at the interview and was very negative and grumpy. The job description seemed to change from what the ad said, to what the job actually was. Followed up with friendly thank you email, never heard a thing back. Spent a lot of time at interview and prep for interview to never even receive a thank you but no thank you email.", "Interview Questions": "Asked me to describe Communications and what that meant, as stated on my resume. "}, {"date": "2 Apr 2015", "title": "Junior Financial Planner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Stevens-Henager College (Murray, UT) in Mar 2015", "Interview Descriptions": "I interviewed with 2 people who asked a lot of important questions, and were extremely friendly and answered all my questions as well.  I could tell they enjoyed their jobs and they had both worked there for at least 2 years", "Interview Questions": "How I would overcome objections?"}, {"date": "24 Sept 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stevens-Henager College (Salt Lake City, UT) in Jan 2014", "Interview Descriptions": "3 part interview process. Phone, group, presentation. The setting was slightly uncomfortable because the entire team was involved in the hiring process and all were able to ask questions. the room was set up in a way that I couldn't tell who was asking the questions unless I turned all the way around.", "Interview Questions": "Please sell one of our programs to us."}, {"date": "15 Jun 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Stevens-Henager College (Salt Lake City, UT) in Aug 2013", "Interview Descriptions": "Submitted current curriculum vitae,   Confirmed level of education.  Confirmed teaching, research and administrative experience.  Interviewed with department head and college dean.  Dean confirmed previous employment at state university.", "Interview Questions": "Teaching experience and philosophy."}, {"date": "13 Nov 2012", "title": "\"High School\" Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Stevens-Henager College (Ogden, UT)", "Interview Descriptions": "Began with a group interview. Individuals who asked questions were selected for 2nd. interview. Interview questions were scenario based. Wanted sales experience and an animated, friendly personality. Admissions consultants must have the ability to immediately relate to people.", "Interview Questions": "Nothing too difficult. Average interview questions. "}], [{"date": "14 Aug 2012", "title": "Admissions Consultant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at Stevens-Henager College (Salt Lake City, UT) in Jul 2012", "Interview Descriptions": "Not organized, not professional. They  made a job offer to me  and pulled all backgrounds and reviewed references(all great),I signed all hr paperwork as well, then the recruiter called me on the day I was supposed to start to tell me they decided not to move forward, she would not name a reason. Tried to contact HR and they had the very rude recruiter call me back,saying that's what they decided. The recruiter was not very honest, called me over the weekend to ask for references, called me late Friday to discuss other possibilities with me, remote work etc, then she said all good to go and I am excited to work with you. When she called me to tell me I was not starting with SH, her attitude changed, she was extremely  rude and aggressive. I was not given a chance to talk to management or HR. This is frustrating because I declined three offers knowing I had a job with SH when she called me to come in and sign all the paperwork. This is unacceptable.", "Interview Questions": "Nothing difficult, i think they hire based on symphaty and not qualifications."}, {"date": "5 Dec 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Stevens-Henager College (Provo, UT) in Apr 2011", "Interview Descriptions": "I submitted an application and received a phone call shortly after sending in my resume. The phone interview was brief and to the point. I found out a couple of days later that I had secured the job.", "Interview Questions": "1. Have you had any previous tutoring experience?\r\n2. Can you work flexible hours?"}]]