[[{"date": "18 Jul 2023", "title": "ESTÁGIO Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vetor Brasil (São Carlos, São Paulo)", "Interview Descriptions": "Eu fiz a entrevista e fiquei esperando o feedback da empresa, e nunca recebi. Mandei e-mail pra ele perguntando e nem se deram ao trabalho de responder e nem me deu um posicionamento ou a razão de eu não ter sido selecionada, ou mesmo o feedback do que melhorar.", "Interview Questions": "N/A"}, {"date": "4 Feb 2023", "title": "Estagiário Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vetor Brasil (São Paulo, São Paulo)", "Interview Descriptions": "Foram 2 entrevistas pessoais, uma direto com o RH e outra com a Coordenadora da área em questão. Foram feitas perguntas relacionadas a administração de tempo, situações de conflito e maiores realizações pessoais.", "Interview Questions": "- Cite uma situação que voce teve que resolver algum conflito muito rápido. - Uma crítica ou feedback negativo que você já recebeu e como reagiu? - Como você organiza suas atividades da semana? - Qual foi a sua maior realização pessoal/profissional até o momento?"}, {"date": "14 Dec 2022", "title": "Analista De Projetos Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vetor Brasil", "Interview Descriptions": "O processo seletivo passou da fase de currículos para uma etapa de dinâmica em grupo, que aconteceu de forma virtual. Acho que não foi um momento em que todo mundo conseguiu participar, o que acaba impactando na qualidade do processo. O maior problema disso na verdade foi que nunca tive uma resposta, um email, uma devolutiva, nada. Ainda escrevi por email para quem havia me convidado para o momento e nunca tive resposta. Achei desrespeitoso com quem dedicou tempo e esforço para participar e não teve a mínima devolutiva.", "Interview Questions": "Não me lembro exatamente das perguntas."}, {"date": "17 Feb 2023", "title": "Trainee Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vetor Brasil in Nov 2022", "Interview Descriptions": "O processo para marcar a dinâmica foi bastante confuso, cancelaram o primeiro horário e insistiam que eu tinha que entrar no site e marcar outro, mas o site não permitia. Foram semanas muito estressantes. A avaliação final da entrevista foi estranha, disseram algo que nada tem a ver com a minha personalidade, preferia que eles não tivessem inventado desculpa e só dito que preferiam outros perfis.", "Interview Questions": "Desafios que você enfrentou na vida e assumiu a liderança, o de sempre."}, {"date": "24 Oct 2022", "title": "Trainee De Gestão Pública Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vetor Brasil (Recife, Pernambuco) in Oct 2022", "Interview Descriptions": "Muito bem estruturada. Várias etapas diferentes que questionam todos os nossos aspectos pessoais e profissionais para nos avaliar. Dinâmica em grupo, entrevista individual, formulários complementares, currículo, tudo é avaliado para ver se você se encaixa na vaga que eles nem te disseram qual é.", "Interview Questions": "Desafios da vida profissional, motivação para aceitar, o que a faria desistir..."}, {"date": "24 Mar 2023", "title": "Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vetor Brasil (Porto Alegre, Rio Grande do Sul) in Oct 2022", "Interview Descriptions": "O processo seletivo demora em torno de 4 meses. São muitas etapas, com questionários, dinâmicas em grupo entrevista individual com questões bem aprofundadas sobre valores e ética no trabalho. O tempo de resposta entre as etapas pode demorar mais de 3 semanas.", "Interview Questions": "Muitas perguntas pessoais, é uma oportunidade de reflexão e trabalhar o autoconhecimento"}, {"date": "21 Apr 2023", "title": "Gerente De Projetos S Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vetor Brasil (São Paulo, São Paulo) in Sept 2022", "Interview Descriptions": "Fiz o processo seletivo até a última etapa, a pessoa gestora que ficou de me dar a resposta positiva ou negativa nunca entrou em contato e, quando mandei e-mail perguntando, disse que iria me escrever assim que possível e nunca o fez.", "Interview Questions": "Foi uma entrevista por competencias."}, {"date": "26 Sept 2022", "title": "Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at Vetor Brasil (Rio de Janeiro) in Sept 2022", "Interview Descriptions": "O processo foi uma dinâmica de frupo voltada para resolução conjunta de desafios. A dinâmica é bem fluída e a coordenadora do processo deu indicações consistente.\r\nA dinâmica é bem inclusiva e valoriza o bem estar do entrevista, evitando um ambiente de excessiva pressão.", "Interview Questions": "Apresentação pessoal e como o trabalho e valores da vetor brasil se encaixam na sua trajetória pessoal"}, {"date": "5 Sept 2022", "title": "Trainee Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vetor Brasil (Vitória, Espírito Santo) in Aug 2022", "Interview Descriptions": "Todas as etapas são virtuais, e ao longo do que vai se fazendo vão liberando as próximas etapas. Primeiro me increvi com minhas informações, depois descrevi meu histórico escolar, falei de experiências passadas ded trabalho e voluntariado, prova de lógica, português, fiz testes de personalidade, e dinâmica em grupo", "Interview Questions": "Como superei o meu maior desafio"}, {"date": "7 Jul 2022", "title": "Trainee De Gestão Pública Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vetor Brasil (São Paulo, São Paulo)", "Interview Descriptions": "Depois da fase das provas e vídeo pessoal, passei por uma dinâmica em grupo. Acho que minha maior contribuição foi sempre conduzir os demais candidatos à gestão de tempo. Éramos 6 pessoas. Um dos candidatos queria falar muito para aparecer mais. Chamei atenção que uma outra candidata ainda não havia falado e faltavam apenas 2 minutos para o termino.", "Interview Questions": "Na entrevista pessoal, falar qualidades e defeitos, uma situação em que enfrentei resistencia das pessoas, motivo de trabalhar como trainee etc."}], [{"date": "8 Mar 2022", "title": "Analista Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vetor Brasil", "Interview Descriptions": "Foram 3 etapas de entrevista, sendo a primeira para me conhecer, a segunda sobre um case e a terceira para entender como seria a oportunidade e como funciona a organização.", "Interview Questions": "Maior desafio que enfrentei  em meu trabalho"}, {"date": "16 Feb 2022", "title": "Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Vetor Brasil (Rio de Janeiro)", "Interview Descriptions": "Entrevista foi muito boa e bastante receptiva.\r\nApesar de nao ter sido aprovado, pude mostrar meus talentos e também refletir sobre minhas habilidades para futuras entrevistas e processos seletivos. Acho que o feedback da Vetor Brasil poderia ter sido melhor.", "Interview Questions": "Como você enxerga as diferenças em uma equipe?"}, {"date": "17 Jul 2022", "title": "Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Vetor Brasil in Nov 2021", "Interview Descriptions": "A entrevista final do processo é bem coerente com o que foi estabelecido desde o inicio do processo. Buscam pessoas proativas, com boa comunicação, que defendam aquilo que acreditam e pelo que trabalham. A entrevista durou cerca de 30 minutos, foram feitas perguntas sobre a vida acadêmica, profissional e sobre o futuro. Além disso, são dados cases do tipo \"como você agiria em tal situação\".", "Interview Questions": "Contar sobre sua trajetória profissional\r\nRelacionar o Vetor Brasil com o que deseja para carreira (futuro)"}, {"date": "23 Jan 2022", "title": "Trainee Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vetor Brasil in Oct 2021", "Interview Descriptions": "Longo, falta objetividade e não cumprem prazos. Recrutadores criaram um processo de seleção completamente deslocado da realidade. Vários colegas desistiram pela mesma razão. Os prazos são enganosos, caso você não cobre um retorno, nem ao menos é avisado de que o atraso ocorrerá.", "Interview Questions": "Gravar um vídeo de 5 minutos se apresentando. Avaliam esse vídeo exigindo que você consiga falar amplamente de sua trajetória pessoal e profissional. Após o vídeo. Gravar a entrevista é um processo complicado demais, nunca há horário de entrevista. Entrevista com perguntas pouco objetivas."}, {"date": "4 Nov 2021", "title": "Trainee Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Vetor Brasil in Sept 2021", "Interview Descriptions": "Processo totalmente online ,desde a etapa da inscrição até a entrevista por competência foi totalmente estruturado, me senti foi confortável em cada etapa e um dos diferenciai foi o feedbacks dado  para cada etapa do processo.", "Interview Questions": "Qual foi a sua maior conquista? Qual foi o feedback mais difícil que você recebeu?"}, {"date": "9 Jun 2021", "title": "Trainee Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Vetor Brasil", "Interview Descriptions": "Processo seletivo padrão. Teve prova, dinâmica de grupo e entrevista individual. Depois tem um curso em SP e começa o processo de alocação de vagas em diferentes estados do Brasil. No entanto, não necessariamente passar em todas as etapas do processo seletivo garante alocação.", "Interview Questions": "Perguntas específicas sobre a pessoa e a empresa."}, {"date": "18 Apr 2021", "title": "Trainee De Gestão Pública Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 months. I interviewed at Vetor Brasil", "Interview Descriptions": "Processo muito estruturado, conduzido inteiramente de forma online e com candidatos do Brasil inteiro. Feedbacks estruturados depois de cada etapa, dando visibilidade para o candidato de pontos a desenvolver que apoiaram para as outras etapas do processo.", "Interview Questions": "Qual o feedback mais dificil que você já recebeu/deu?"}, {"date": "7 Jan 2021", "title": "Estagiário Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vetor Brasil", "Interview Descriptions": "Candidatei-me online. O processo levou um dia. Fui entrevistado pela Vetor Brasil via Google Meet. Achei a gestora bastante desinteressada e as perguntas foram bem... básicas. Parece que pesquisaram no Google \"Perguntas para entrevista de emprego\" e fizeram as primeiras que apareceram. Não me senti bem avaliado, não perguntaram nada sobre meu currículo ou minha trajetória profissional/acadêmica. Também nada do tipo: Por que você quer trabalhar aqui? Nada. A impressão que eu tive é que elas não estavam interessadas em saber nada além das perguntas padrão de sempre. Fiquei decepcionado, pois esperava uma entrevista boa, como as avaliações aqui no site dizem que as para trainee são.", "Interview Questions": "Pediram para que eu me apresentasse e em seguida fizeram perguntas como: \r\n1. Conte sobre uma conquista da qual você se orgulha\r\n2. Fale sobre uma vez em que você cometeu um erro\r\n3. Conte como você lidou com uma situação difícil\r\n4. Conte sobre uma situação na qual você discordou do seu chefe\r\n5. Conte sobre alguma experiência em liderança"}, {"date": "23 Feb 2023", "title": "Treinee Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at Vetor Brasil in Dec 2020", "Interview Descriptions": "Muitas etapas, durante um longo processo. Ao chegar na fase de entrevistas tinha um questionário pronto que a valiadora seguia com perguntas sem nexo e nenhum tipo de personalização. Ao final recebi um email negando a vaga após meses da entrevista.", "Interview Questions": "Conte uma situação em que os seus valores foram ameaçados por ganho profissional."}, {"date": "9 Dec 2020", "title": "Treinee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vetor Brasil (São Paulo, São Paulo) in Oct 2020", "Interview Descriptions": "Um dos processos mais humanos que eu já participei! Os feedbacks são personalizados e acabam te favorecendo o crescimento tanto profissionalmente como pessoalmente.\r\n\r\nHá algumas etapas são elas:\r\n\r\n1º Preencher um formulário com os seus dados básicos (idade, formação acadêmica, genêro etc ...);\r\n2º Prova de atualidades (caso passe nessa etapa, o candidato segue para a próxima);\r\n3º Prova de português (caso passe nessa etapa, o candidato segue para a próxima);\r\n4º Prova de raciocínio lógico  (caso passe nessa etapa, o candidato segue para a próxima);\r\n5º Vídeo de motivação (Nele o candidato terá que fazer um vídeo pitch, falando sobre a sua trajetória e motivação em relação a candidatura .Tudo isso em 1 minuto!);\r\n6ª Entrevista (resolução de case baseado no cenário que você irá cursar).\r\n\r\nPontos positivos: Processo humanizado, onde há um crescimento pessoal e profissional;\r\nPontos negativos: a não possibilidade de escolher qual teste você vai fazer primeiro e esquema de teste antigo (não gamificado etc..)", "Interview Questions": "Entrevistas se baseia na solução de case, onde cada pessoa será um personagem da vida real. Atente-se aos dados."}], [{"date": "21 Apr 2021", "title": "Graduate Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vetor Brasil in Oct 2020", "Interview Descriptions": "O processo seletivo foi ótimo, o ponto alto dele é que cada fase contou com um feedback totalmente personalizado. A entrevista foi tranquila, durou cerca de 30 minutos, foi com um único membro da Vetor, ele foi gentil.", "Interview Questions": "Cite uma situação profissional desagradável, onde houve algum problema, e como você reagiu ou resolveu isso. Tiveram umas 3 perguntas nesse sentido."}, {"date": "13 Sept 2021", "title": "Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Vetor Brasil (Belo Horizonte, Minas Gerais) in Sept 2020", "Interview Descriptions": "O processo extremamente humanizado. Entretanto, longo e demanda que o candidato passe por muitas fases (o que não é algo ruim). Feedback é um pouco vago em alguns pontos, o que dificulta que o candidato melhore os pontos necessários.", "Interview Questions": "Objetivos de vida / Por que tem interesse/ o que você já fez de relevante na sua trajetória. "}, {"date": "7 Nov 2019", "title": "Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vetor Brasil (Ribeirão Preto)", "Interview Descriptions": "foi ótimo. analisam sua trajetória, conquistas, fracassos e origem. a ideia é ver como tudo isso se relaciona com a vontade de ser trainee e trabalhar no setor público. é preciso ter um propósito claro.", "Interview Questions": "Me conte um pouco sobre você"}, {"date": "1 Jul 2019", "title": "Trainee Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vetor Brasil (São Paulo, São Paulo) in Apr 2019", "Interview Descriptions": "1) Avaliação Curricular e demográfica\r\n2) Testes de conhecimentos gerais/matemática/português\r\n3) Video Entrevista\r\n4) Dinâmica online em Grupo: 5 participantes, fomos estimulados a imergir num case simulando uma reunião entre secretários de um município fictício, cada um recebeu um briefing diferente e tivemos que decidir sobre o projeto de ampliar uma escola ou construir uma nova. \r\n5)Entrevista com o Gestor", "Interview Questions": "Me perguntaram qual motivação para transformar o setor público.\r\nQual a relação do propósito da Vetor com a minha trajetória.\r\nOnde eu pretendo chegar."}, {"date": "27 Aug 2019", "title": "Trainnee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vetor Brasil in Nov 2018", "Interview Descriptions": "Entrevista feita por chamada de vídeo, necessário mostrar carteira de identidade ao iniciar a entrevista. Primeiras perguntas de cunho pessoal, onde o recrutador pergunta sobre questões familiares, gostos pessoais, experiência acadêmica. Depois, pergunta as motivações para o trabalho em organizações governamentais, histórico profissional, planos de futuro, como o programa de trainnee se encaixa nos planos pessoais etc.", "Interview Questions": "Uma situação em que você teve que agir contra seus princípios/aquilo que acredita. Qual a meta de vida e como o programa de trainnee se alinha nessa meta. "}, {"date": "9 Jun 2018", "title": "Treinee Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vetor Brasil (São Paulo, São Paulo)", "Interview Descriptions": "Achei o processo bem interessante, principalmente por todas as fases serem online, inclusive a dinâmica de grupo. A dinâmica teve a participação de 5 candidatos e uma avaliadora/mediadora, cada pessoa recebeu por email uma parte das informações do case. Achei até melhor que dinâmica presencial, pois como dependia da internet as pessoas realmente precisavam esperar uma pessoa terminar de falar senão as vozes se sobrepunham e ninguem entendia nada. Já para a entrevista final, eu a entrevistadora muito cansada, eles haviam mudado de plataforma e eu não havia recebi o email solicitando o download do aplicativo, perdemos tempo mudando de plataforma, a entrevistadora parecia desinteressada.", "Interview Questions": "Uma decisão que você teve que tomar de surpresa."}, {"date": "13 Dec 2017", "title": "Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vetor Brasil (São Paulo, São Paulo)", "Interview Descriptions": "Completo e eficiente para avalização de competências diversas dos candidatos, sempre levando em consideração os valores do Vetor e da mudança que se deseja pra o País.", "Interview Questions": "Perguntas de âmbito pessoal"}, {"date": "21 Oct 2017", "title": "Trainee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at Vetor Brasil (Espírito Santo do Pinhal)", "Interview Descriptions": "Super transparente, com feedbacks individuais. Foi incrivel sentir a proximidade e o interesse da empresa em nossa historia sempre nos deixando a vontade para sermos nos mesmos.", "Interview Questions": "Uma derrota, uma vitória, porque a empresa.... O de sempre."}, {"date": "9 Sept 2019", "title": "Trainee De Gestão Pública Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Vetor Brasil (Brasília, Federal District) in Oct 2017", "Interview Descriptions": "O processo seletivo é intenso e carece de bastante dedicação, porém é recompensador. A equipe de recrutamento é focada em avaliar trajetórias e compreender características profissionais que muitas vezes passam despercebidas em processos seletivos convencionais", "Interview Questions": "Indique uma situação que no seu histórico profissional que você considera ter fracassado "}]]