[[{"date": "3 Jul 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Auburn University (Auburn, AL)", "Interview Descriptions": "Interview for graduate assistantship where the PI interviewed the student to judge eligibility.knowledge of relevant software, theoretical knowledge of the concerned subject, etc. face to face interview in the department for an hour.", "Interview Questions": "What made you change Auburn University?"}, {"date": "25 May 2023", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Auburn University (Auburn, AL)", "Interview Descriptions": "Very straightforward and professional. I spoke with a real person who I would be collaborating with on a team. They gave me a brief description of the types of projects I would be working on.", "Interview Questions": "What does your programming experience look like?"}, {"date": "2 May 2023", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Auburn University (Auburn, AL)", "Interview Descriptions": "I was contacted as soon as the job posting closed about an interview. I was able to schedule the j yet view over the phone and had an interview a week later which was followed by an additional round and after just over a month I had a job offer. They were very nice and I enjoyed working for them.", "Interview Questions": "Tell me about yourself, what value do you bring, why do you want to work at AU, conversational, lots of scenario based."}, {"date": "7 Feb 2023", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "The application and interview process was simple and straightforward, as I was already an Auburn University student when I applied and knew my current employer. Just a written application, oral interview, and review of expectations.", "Interview Questions": "What are your teaching and research goals?"}, {"date": "13 Jan 2023", "title": "Career Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "2 steps for the interview process- Zoom and then in-person. Process is slower than expected and follow up with HR is needed- stay on them and ask on the front end timeline.", "Interview Questions": "Tell us about a time you worked with a difficult campus partner."}, {"date": "19 Oct 2022", "title": "Flight Instructor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "Asked general technical questions and few hr questions. What made you to be a pilot and what kind of instructor you want to be. Then you move to standardization class and fly with their own instructor.", "Interview Questions": "Describe va with weight shift Reading instrument approaches"}, {"date": "24 Oct 2022", "title": "Office Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Auburn University (Auburn, AL) in Oct 2022", "Interview Descriptions": "I recently had a zoom meeting that went very well with Human Sciences at AU. The panel who interviewed me were all excited to get to know me, they asked relevant questions, they also had good responses to my questions, and the interview went well. I accepted a second upcoming interview in person.", "Interview Questions": "1. Tell us about yourself 2. What made you want to apply for this position; what makes you a good fit? 3. Tell us about your experience working with different kinds of people? 4. \" What type of people do you find difficult\" - my answer: \" People who are having a bad day or attitude can be difficult. Showing positivity, being professional, and showing kindness can go a long way in improving someone's day. \""}, {"date": "18 Jul 2022", "title": "Human Resource Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Auburn University (Auburn, AL) in May 2022", "Interview Descriptions": "I applied to be a student intern at Auburn University Library. The interview was formatted to start with a lot of information about the job, then questions asking how you would handle the tasks presented in the first part of the meeting.", "Interview Questions": "Q: Why do you have an interest in HR?"}, {"date": "2 Apr 2023", "title": "Extension Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Auburn University (Tuscaloosa, AL) in May 2022", "Interview Descriptions": "I applied online, very long detailed application, phone screen with manager and interview a couple months later. Had to give presentation over Zoom. Several weeks later I got a rejection email. Long involved process. They didn't provide salary range in posting, but I looked it up through open records.", "Interview Questions": "What topic are you interested in creating an outreach program. How would you address questions in the 3 different areas of the specialty."}, {"date": "29 Mar 2023", "title": "Executive Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Auburn University (Auburn, AL) in Apr 2022", "Interview Descriptions": "Standard interview. Took about a month. HR can take a while, but overall an easy process. If you are not familiar, be sure to research before hand to understand Auburn culture.", "Interview Questions": "Why are you the best candidate for this position?"}], [{"date": "30 Mar 2022", "title": "Lab Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "It was a great experience working with the faculty members! They are friendly and always keep their safety at first! It's a very nice college. Working with them is the best experience ever", "Interview Questions": "Mostly part-time questions are asked"}, {"date": "31 Jan 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "I went through 2 interviews which were really quick and easy going. They ask your basic and standard job interview questions. I had quite a few questions about the position myself so the interview was quite long but i think it helped me get the job", "Interview Questions": "What is your experience with marine boating"}, {"date": "28 Jun 2023", "title": "Recreation and Wellness Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Auburn University (Auburn, AL) in Jan 2022", "Interview Descriptions": "Very casual as everyone who works at the rec has a great time and everyone is super friendly towards one another. If I were you I would just be yourself during the interview because the main thing that they look for is that you are hard working and able to fit the culture of the Rec.", "Interview Questions": "What you would do doing a medical emergency."}, {"date": "10 Nov 2021", "title": "Membership Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "Panel style, more professional than expected but not overly formal. Had to think on toes a lot for the questions they asked but it went by quickly and were timely with a response.", "Interview Questions": "What is an example of you helping a coworker or teammate?"}, {"date": "13 May 2022", "title": "Flight Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Auburn University (Auburn, AL) in Sept 2021", "Interview Descriptions": "Overall a pretty easy interview. I had done all my training there so everyone already knew me and my abilities. I was asked a couple generic aviation questions, and was given a mock CFI \"checkride\" flight. Passed it and that was it.", "Interview Questions": "Explain Va and how it increases with weight"}, {"date": "3 Jul 2021", "title": "Human Resources Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "This interview was both professional and genuine. Enjoyed speaking with the supervisor - was very informative and paid attention to everything I had to say. This interview would be great experience for both undergraduate and graduate students.", "Interview Questions": "How do you see yourself growing in this position?"}, {"date": "15 May 2021", "title": "Internal Auditor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "Zoom interview went smoothly, five interviewers for the first stage, and then one on one with the head of the department for the second stage. Everyone was very professional and cordial.", "Interview Questions": "Multiple scenario based questions during the 2nd round. "}, {"date": "3 May 2021", "title": "Interior Design Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Auburn University", "Interview Descriptions": "The interview process was comprised of two parts. We first talked, asked questions, and answered questions. Then they gave a floor plan shell to complete and select furniture and finishes for.", "Interview Questions": "What is your biggest weakness?"}, {"date": "23 Jun 2021", "title": "Student Affairs Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Auburn University in May 2021", "Interview Descriptions": "I was invited for a 5 hour second round interview. Everyone seemed friendly but out of the 10+ people who interviewed me, there were no people of color on the team. After dedicating hours of my time I expected the courtesy of a decision email but never got one. Overall, the team seemed eager to hire a token person of color and had no regard for the pandemic. One even said “the pandemic is basically over & the students are returning in the fall”. I am glad that I chose to apply to other colleges, it’s apparent this office wasn’t the right fit for Me", "Interview Questions": "-Describe a difficult situation \r\n-What is your ___ philosophy?\r\n-How do you deal with drama at work?"}, {"date": "28 Sept 2021", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Auburn University (Auburn, AL) in Apr 2021", "Interview Descriptions": "The interview was held over Zoom and lasted about 30 minutes. It was a very relaxed atmosphere with about 5 questions and time for Q/A from the interviewee at the end.", "Interview Questions": "If a student came to you with a question you did not know the answer to, how would you respond and what would you do to aid this student in the best way possible?"}], [{"date": "28 Mar 2021", "title": "Executive Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "The interview process was straightforward but slow (2 months) with 2 interviews and then an offer.  Everything goes through the same University process which can take some time, but it is understandable.", "Interview Questions": "Why would you be a good fit for this role?"}, {"date": "18 Jun 2021", "title": "SGA Chief of Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Auburn University (Auburn, AL) in Feb 2021", "Interview Descriptions": "It was very long and they asked me lots of questions but really just go in their and be yourself and remember that every day you walk on campus is an interview, they will think about more than just the 30 minutes you sat in front of them with a suit on.", "Interview Questions": "Why do you want this position?"}, {"date": "9 Mar 2021", "title": "Veterinary Technician- Oncology Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Auburn University (Auburn, AL) in Feb 2021", "Interview Descriptions": "It was a pretty standard interview. There was an extra person in the interview that I was not prepared for, so that was a little bit stressful once the zoom meeting started. (There were 2 people interviewing me at once as opposed to just 1.) \nThe questions were pretty standard- \"tell me about a time when...\" questions. Also, \"what interests you about oncology, phlebotomy, etc.?\" \nThat type of stuff. It only lasted about 15 minutes, and it seemed like there were a lot of forced smiles from their end. They saw me the entire week after my interview, but nothing was said about it. (I was doing an externship, and I spent a week over there.) At the end of the week, I was told , \"well, it's been fun working with you. thanks for playing.\" \nThey mentioned after the interview that it would take a week or two to make a decision. I have yet to hear a single word, and it has been a month.", "Interview Questions": "tell me about a time when there was a conflict in the workplace, and how/if you resolved it."}, {"date": "26 Sept 2021", "title": "Student Services Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Auburn University (Auburn, AL) in Feb 2021", "Interview Descriptions": "The interview process is 2 stages. The first stage is where they interview everyone they are interested in and this is a shorter interview. Once they narrow down the pool to a few candidates, they enter the second stage where they require each candidate to give a presentation followed by a question and answer period. Then they have two sets of follow-up interviews with different people in the office you are interviewing in. The second stage usually takes place in one day", "Interview Questions": "How would you handle an online student who receives orders to deploy in two weeks and will be unable to complete their semester? "}, {"date": "8 Oct 2021", "title": "Athletic Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Auburn University (Auburn, AL) in Feb 2021", "Interview Descriptions": "Responded in a timely manner and interview was very professional and enjoyable. Very personable and made me feel welcome to this job without being there. Overall I would say it was a great interview experience", "Interview Questions": "Why Auburn over other institutions? "}, {"date": "6 Jan 2021", "title": "Journalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "Good interview process very calm and did not stress at all very welcoming interview and people truly is the loviest village on the plains war Eagle go orange and blue", "Interview Questions": "Describe yourself and what you do "}, {"date": "29 Nov 2022", "title": "Doctor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Auburn University (New York, NY) in Jan 2021", "Interview Descriptions": "Fine it went smoothly it was great people were very nice and professional and we did an online interview they asked about 7 questions and that was all! It was fine in the end but i did not end up working there anyways though.", "Interview Questions": "Tell me about yourself and what are your hobbies"}, {"date": "20 Nov 2020", "title": "Area Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "On-campus interview experience with several helpful tours and multiple levels of interviews with professional staff, students, and campus partners. Take time to explore campus and the city yourself if you have the time!", "Interview Questions": "What relevant experience do you have in housing?"}, {"date": "27 Oct 2020", "title": "Engineering Co-Op Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "Interview process was quick and easy. It included a programming question and other questions about different programming thing. It was with 4 people who worked there and would be working with me.", "Interview Questions": "What does HTML stand for?"}, {"date": "19 Apr 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Auburn University", "Interview Descriptions": "Simple but long process. Had a face to face interview with manager in his office. The work was for part time student work with the IT department back in spring 2010.", "Interview Questions": "What made you want to apply for this job?"}], [{"date": "23 Mar 2020", "title": "Supplemental Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Auburn University", "Interview Descriptions": "It was a group interview. It was a long process, but the time passed very quickly. Part of it was spent answering traditional interview questions, but the majority of the interview focused on giving the candidates a sneak peek of their potential responsibilities.", "Interview Questions": "What are three skills necessary to achieve success?"}, {"date": "23 Feb 2020", "title": "Administrative Assistant for CADC Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Auburn University", "Interview Descriptions": "Interview process was with a panel.  I was called back for a second interview the same day as my first interview. Second interview was on 11/22/19 and it was a one on one with the dean. I was told it the job offer was between me and one other candidate. After two months of waiting to hear either way, I called HR and they said that the status was still the same. I dont think it was a coincidence that the executive coordinator contacted me that afternoon via email stating that I was not chosen and how competitive the jobs were at Auburn. I thought that was unprofessional considering I was told by the dean that I was the top two. It reallymade me not want to even apply for any other jobs at Auburn. I'm still a Auburn fan just not impressed by my experience with a career there.", "Interview Questions": "What is your greatest weekeness?"}, {"date": "13 Dec 2021", "title": "CWE Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Auburn University in Nov 2019", "Interview Descriptions": "There is a 3 round interview process: a written application, a traditional style interview, and an interview where you are asked to wear a costume that represents your personality with a short prepared speech.", "Interview Questions": "How have you overcome adversity? \r\nWhy do you think you’d be a good orientation counselor? \r\n"}, {"date": "12 Jul 2022", "title": "Academic Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Auburn University (Auburn, AL) in Oct 2019", "Interview Descriptions": "Blind interview process until the virtual/in-person interview. Questions informed by person-centered theories, higher education, and adult education foundations. Interviewers included two people, the Academic Coaching Coordinator, and an Academic Coach or a member of the Academic Support Professional staff.", "Interview Questions": "How would you help a student of color who is experiencing oppression on-campus?"}, {"date": "16 May 2021", "title": "Student Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Auburn University (Auburn, AL) in Aug 2019", "Interview Descriptions": "They got back to me quickly and the interview was very low stress. They were very willing to work with my schedule as a student, which was incredibly helpful. They took about a week to get back to me after, which was still pretty fast to me. Overall, a positive experience.", "Interview Questions": "Do you have experience editing photos in Photoshop?"}, {"date": "28 May 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Auburn University (Auburn, AL) in Aug 2019", "Interview Descriptions": "Meet with student services and line up opening and interviews to find the job that best suits you as a college student in present day college student job hunts like normal", "Interview Questions": "How much time can you work?"}, {"date": "27 Mar 2023", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Auburn University in Jun 2019", "Interview Descriptions": "Direct questions and. feedback from the professors. Good staff handling the communications. International office was helpful for international students and they provided insurance after you accept an offer from them", "Interview Questions": "What are you motivated about the project?"}, {"date": "19 Apr 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Auburn University", "Interview Descriptions": "the whole process took about a month. I applied in person, got the in-person interview within one week. the interview questions were all related to my previous research experiences.", "Interview Questions": "What projects have you been working on?"}, {"date": "7 Mar 2021", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Auburn University (Auburn, AL) in Apr 2019", "Interview Descriptions": "The interview was conducted in a meeting room. It was me and one other person in a group interview. They asked a few casual questions and then at the end told us we had gotten the job.", "Interview Questions": "Why do you want to work here? Why should we hire you over other people?"}, {"date": "12 Feb 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Auburn University (Auburn, AL) in Apr 2019", "Interview Descriptions": "It wasn't a formal interview because it was only part-time when I don't have class. It was basically a phone call to see when I would be able to work and then an in person interview that was questions about why I think I would be a good fit to work there.", "Interview Questions": "Why do you think you would be a good fit to work here?"}], [{"date": "17 Jan 2023", "title": "IT Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Auburn University (Auburn, AL) in Mar 2019", "Interview Descriptions": "Interview was light hearted with casual conversation and a few technical questions about background and interests. I had to explain my background in IT which was limited but I complemented my lack of experience with high interest in learning.", "Interview Questions": "Can you assemble a computer"}, {"date": "7 Sept 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Auburn University in Mar 2019", "Interview Descriptions": "Applied for PhD program, selected in grad program, emailed to professor whom I wanted to work with. He asked me for 30 minutes of skype interview. It went fine overall", "Interview Questions": "Basic Questions like: Where did you do your undergrad? what is your research focus?\r\nany publications? what area you would choose for research?"}, {"date": "12 Apr 2019", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Auburn University (Auburn, AL) in Mar 2019", "Interview Descriptions": "I received a phone interview and then an invitation to visit their campus. They were all very nice and kind to me before and during my visit, but after the interview they stopped being responsive until they declined my application in a very rude manner by insulting my technical preparation and background", "Interview Questions": "Can we insult you?"}, {"date": "10 Jan 2019", "title": "Study Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Auburn University", "Interview Descriptions": "One interview with the office head it was fairly simple and not to bad just bring a resume and submit 2 letters of recommendation. They also sometimes have you do a practice tutoring session if they feel they want to see your techniques in action.", "Interview Questions": "What helped you succeed in your class"}, {"date": "24 Feb 2022", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Auburn University (Auburn, AL) in Jan 2019", "Interview Descriptions": "Got into contact with the DVM and met with them.  After speaking, I was hired right away to help their research. After I was introduced to the other employees, and shown around the labs.", "Interview Questions": "What experience do you have?"}, {"date": "19 Jul 2018", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Auburn University", "Interview Descriptions": "There was no interview. I simply applied for the department I wanted where I to study and received an acceptance letter. Because I was accepted to study in the English Department, I was automatically accepted as a graduate teaching assistant. It was part of the package.", "Interview Questions": "N/A"}, {"date": "17 Oct 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Auburn University (Auburn, AL)", "Interview Descriptions": "Employee referral, normal. Just make sure to go over pretty basic interview questions on strengths and weaknesses etc.  They like if you think on your feet the most. Be prepared to have ideas for your department.", "Interview Questions": "Q: What would you do if given xyz project."}, {"date": "22 Jan 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Auburn University (Auburn, AL) in Aug 2017", "Interview Descriptions": "Just had to ask the professor for a position, and after a few meetings, he offered me the job. At the time I did not know much about programming (I had only taken two programming classes) so there wasn't many options for me.", "Interview Questions": "What are you specializations in computer science?"}, {"date": "29 Nov 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Auburn University (Auburn, AL) in Jun 2017", "Interview Descriptions": "I was told to come in to talk about the job. I wasn't expecting a formal interview so I came unprepared. It was a 3 person interview panel. They asked questions about me and told me about the position. They were very friendly.", "Interview Questions": "What experience do you have working with children? "}, {"date": "16 Jul 2018", "title": "Plainsman Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Auburn University (Auburn University, AL) in May 2017", "Interview Descriptions": "More like a chat. She had already seen my portfolio and chatted with my friend about how I am a reliable worker. We only met for her to tell me I got the job.", "Interview Questions": "If I know how to use the Adobe Suite"}], [{"date": "23 Apr 2017", "title": "Coordinator of Research and Instruction Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Auburn University (Auburn, AL) in Feb 2017", "Interview Descriptions": "I applied online through the website, it took a full three+ months until the initial contact.  I did a brief phone interview with the person who would be my supervisor, followed by a Skype interview with several faculty from the department.  I then had a follow up phone interview with the head of the department.  I was offered the position the following week and then spent about a week doing salary negotiations.  However, it took another three weeks to get the official offer letter.  The downside was that once everything was completed they wanted me to start almost immediately even though I had to move in from out of state.", "Interview Questions": "What interested you in Auburn University?"}, {"date": "31 May 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Auburn University (Auburn, AL) in Feb 2017", "Interview Descriptions": "Basics of Computer Science, More focused on exactly the job applying for. Very welcoming experience, everybody is very helpful and accommodating. A homely experience and interview lasted for 40 minutes", "Interview Questions": "Tell me about yourself and long term goals"}, {"date": "9 Dec 2018", "title": "ESL Teacher Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Auburn University (Auburn, AL) in Jan 2017", "Interview Descriptions": "The interview process was fairly standard. It involved three rounds of interviews. I thought this was a bit excessive for an entry-level position that only required two years of experience.", "Interview Questions": "What is your teaching philosophy?"}, {"date": "15 Feb 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Auburn University (Auburn, AL) in Dec 2016", "Interview Descriptions": "Two in person interviews. I had previously been working as a graduate student in the department, and I was offered to apply for the position. The interview process was fairly short compared to other interviews I've had, mainly because I was already very familiar with the interviewer. \r\n\r\nThe second interview was much longer and involved a brief teaching demonstration. Overall it was a fairly easy interview, as I had previous experience in the subject to be taught.", "Interview Questions": "Teaching experience."}, {"date": "4 May 2020", "title": "Supplemental Instruction Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Auburn University (Auburn, AL) in Nov 2016", "Interview Descriptions": "The interview is with a manager and current supervising supplemental instruction leader.  You are only granted an interview if you pass the application process. It's pretty selective and was more stressful than entry level job interviews.", "Interview Questions": "If you had a superpower what would it be and why?"}, {"date": "11 Oct 2016", "title": "Administrative Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Auburn University", "Interview Descriptions": "Online application process requiring resume, references and additional questions.  Was selected for an interview - - a roundtable of 6, with somewhat disjointed and unrelated questions that did not provide for a good flow or opportunity to drill deeper - - just answer the question, then on to the next unrelated question.  Was there almost 2 hours so hoped for the best.  Followed up with a personal email to all on the committee within 2 business days - no response from even one person.  Followed up again 2 weeks later and again no response, no \"we enjoyed meeting you as well\" or update on where things were in the process.  I finally learned 4-5 weeks after interview on the job site that I was not chosen when the status of the job went from \"interviews in process\" to \"candidate selected\".  I am a passionate Auburn University grad, and must say I am very disappointed in the lack of professionalism given to candidates who put many hours into this rigorous employment process time and time again.  This has been going on for years, and the reputation for this has been long standing.  Many colleagues have sworn they will never apply with Auburn again.  Very disappointing Auburn.", "Interview Questions": "An overly broad question:  What do you think is the greatest challenging in ____ (insert job/industry) at this time?"}, {"date": "15 Oct 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Auburn University (Auburn, AL) in Oct 2016", "Interview Descriptions": "The interview process for being accepted into the graduate school highly depends on your area of research interest.  If you can identify a faculty member that conducts research in an area that you are interested in, I suggest reaching out to them and ask about available research opportunities.", "Interview Questions": "Do you have enough interest in the area of research to dedicate at least 2 years of your time on the material?"}, {"date": "17 Apr 2017", "title": "Assistant of Communications and Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Auburn University (Auburn, AL) in Sept 2016", "Interview Descriptions": "I sent my resume to them. It got reviewed and called in for an interview. It lasted about 30 minutes and heard back the next week. It was a simple, basic interview.", "Interview Questions": "Why do you want this job? What skills are you good at?"}, {"date": "22 May 2016", "title": "Telecounselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Auburn University (Auburn University, AL)", "Interview Descriptions": "The first phase was a brief phone interview after they reviewed and approved my application. They mostly asked about why I love Auburn and other general questions. The second stage was an in-person interview with three interviewers. It lasted no more than ten minutes and was somewhat laid back. They were mostly interested in how well you can communicate professionally to prospective students and want to make sure you will represent Auburn well. Only apply for this job if you truly love Auburn and want to give back!", "Interview Questions": "Why do you want to be a telecounselor?"}, {"date": "1 Nov 2016", "title": "Line Crew Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Auburn University (Auburn, AL) in Apr 2016", "Interview Descriptions": "Was referred to work line crew by a current employee. Called the airport to ask if there was job availability. Came in to interview about a week later one-on-one with the manager. Brought in a resume and was offered a job the same day.", "Interview Questions": "Are you okay with working weekends?"}], [{"date": "23 Sept 2016", "title": "Marriot Hotel, Management Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Auburn University (Auburn, AL) in Apr 2016", "Interview Descriptions": "I went through 3 interviews and as a student i have not been able to work many jobs so i was not chosen to work the job that i had chosen, i however was offered another job with the company. due to  my school at the time i was unable to take the position", "Interview Questions": "Are you good at working in a team"}, {"date": "3 Apr 2020", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Auburn University (Auburn, AL) in Jan 2016", "Interview Descriptions": "same as the other university\r\nOnline Interview Practice\r\nCreate an InterviewStream account to digitally record multiple interviews, select questions to practice answering, and email videos to career counselors, professors, or employers.\r\n\r\nYou will need:\r\nComputer\r\nWebcam\r\nUp-to-date software\r\nAn Auburn email address\r\nFor your convenience, computers are also available in the University Career Center  for student use.-", "Interview Questions": "same as the other university "}, {"date": "1 Sept 2016", "title": "Operations Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Auburn University (Auburn, AL) in Dec 2015", "Interview Descriptions": "The interview was conducted with Facility and Operations Supervisors alongside the Informal Recreation Coordinator and Events and Reservations Coordinator. It was not stressful at all, and they were seeking your knowledge about the facility and getting a better judgment on your personality type. Also, the interviewers were asking scenario questions to see how you would react under a particular circumstance.", "Interview Questions": "If a Facility Attendant was behaving negatively, how you you approach him or her? "}, {"date": "8 Feb 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Auburn University (Auburn, AL) in Dec 2015", "Interview Descriptions": "Professor asked my experience and projects I did.\r\nI described the skills I was familiar with. And list the projects I had done before. And also, I described the technology difficulties I met during the work, and how I solved them.", "Interview Questions": "What skills are you familiar with?"}, {"date": "9 Nov 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Auburn University", "Interview Descriptions": "It was very brief and included a tour of the facility where I would be working.  The only questions asked were about my schedule, how long I would be able to work, when I planned to graduate and when I would be able to start.  It was very much entry level and they helped to train me after I was employed.", "Interview Questions": "What is your schedule like?"}, {"date": "4 Aug 2015", "title": "Administrative Support Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Auburn University", "Interview Descriptions": "I sat with the director and assistant director of the office. I was a very pleasant interview with standard questions that related to the department. I felt very at ease during the interview. They laid out the job as much as they could and also expressed the changes they wanted for my position. Overall, I felt like I had a good idea of what the job was, expectations, and the future of the position.", "Interview Questions": "What do you hate most about your current job?"}, {"date": "13 Jul 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Auburn University (Auburn University, AL)", "Interview Descriptions": "Panel Interview with the entire staff and they each asked their own behavioral questions. Intimidating because there was no warning of 8+ attending interview but overall was a pleasant experience.", "Interview Questions": "There wasn't anything difficult. Mostly questions about experience and how I would handle different customer service related scenarios."}, {"date": "20 Jun 2016", "title": "Equal Employment Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Auburn University (Auburn, AL) in Jul 2015", "Interview Descriptions": "Went really well, the office staff was extremely nice. I was Interviewed by a panel which was intimidating at first, but ended up going really well. Once that interview was over I was introduced to the Director, who was extremely nice.", "Interview Questions": "Was I okay with talking about uncomfortable situations with students?"}, {"date": "9 Oct 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Auburn University in May 2015", "Interview Descriptions": "It was an incredibly casual process. I didn't even need to submit a resume. I went in and talked about my class schedule and how much I wanted to work.", "Interview Questions": "how many hours are you willing to work a week?"}, {"date": "7 Jul 2017", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Auburn University (Auburn, AL) in May 2015", "Interview Descriptions": "The interview was entirely based on a single phone call. This definitely made it easier in terms of not having to travel. But I did not get the sense that the department was completely invested in people applying for this position. Instructors get a 1-year contract and the department expects that they will often move on.", "Interview Questions": "Have you taught applied ethics before? (e.g. business ethics, medical ethics...)"}], [{"date": "9 Apr 2015", "title": "Resident Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Auburn University", "Interview Descriptions": "The hiring process involved a written application, video submission, and 4 hour interview session. During the interview they divided the applicants into groups to assess team dynamics before holding one-on-one interviews with the graduate coordinator. The questions were fairly expected and behavioral in nature.", "Interview Questions": "They asked a few RA specific questions to assess potential job performance. "}, {"date": "10 Jul 2015", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Auburn University (Auburn, AL) in Feb 2015", "Interview Descriptions": "it goes very well and i really enjoy it. The professors are very nice and they ask you some academic questions and your dissertation. You have to show up your passion as well as professional attitude.", "Interview Questions": "regular questions and not very hard"}, {"date": "8 Aug 2015", "title": "Membership Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 days. I interviewed at Auburn University (Auburn, AL) in Feb 2015", "Interview Descriptions": "I walked into the office and there was a lady asking me interview questions.  She was very cordial and very professional.  I answered the questions to the best of my ability selling myself when I felt it was appropriate.  She wrote down some things I was saying then told me she would contact me if I got the job.  I received an email 3 days later and showed up for my first day of work it was a great situation.", "Interview Questions": "What would you do if a blind person was attempting to get into the recreation center?"}, {"date": "14 Feb 2017", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Auburn University in Jan 2015", "Interview Descriptions": "I got it through my advisor , and he helped me in the process. It was good for me cuz they waived my tuition , and the interview was easy.", "Interview Questions": "Why do i want to work for them?"}, {"date": "20 Apr 2017", "title": "MDRL Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Auburn University (Auburn, AL) in Nov 2014", "Interview Descriptions": "Quick sit down with the manager and brief discussion about expectations, experience, and schedule constraints. The staff is very understanding and easy going so unless you royally screw up the interview, you pretty much have the job.", "Interview Questions": "What software do you have experience with?"}, {"date": "16 Sept 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at Auburn University (Auburn, AL) in Nov 2014", "Interview Descriptions": "Approach a professor and work with him for a semester. Then, if the professor is satisfied, he may give you an offer. Again, it depends on the number of funds the professor may have. If the professor cannot sponsor, he may ask you for a part time on a monthly pay basis.", "Interview Questions": "No interviews at all erer"}, {"date": "26 Oct 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "Talking about my experience with professor and few basic questions on Java and data structures. Questions on exceptions, casting, linked lists and doubly linked lists and few behavioral questions about my experience in working with a team.", "Interview Questions": "Nothing in specifc, very easy and basic java questions"}, {"date": "24 Sept 2014", "title": "Development Officer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Auburn University (Auburn, AL)", "Interview Descriptions": "Online application. Panel interview with 8 people. Some from office of development with pharmacy school, some from libraries and others from deans office.  Typical interview questions within a defined script. Bureaucratic process was obvious. No individual thought was put into these questions.  They definitely think highly of themselves because they work at Auburn University.", "Interview Questions": "What specific experience do you have that lends itself to being successful in fund raising"}, {"date": "18 Aug 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "Contacted the professor directly. Questions relating to wind tunnel testing and aerodynamics are dealt with. Professor is extremely helpful and friendly. We have then discussed about how the laboratory course spans out through the semester and the responsibilities that I entail for the same.", "Interview Questions": "Can you handle increasing work load for a 100 students,given your coursework?"}, {"date": "21 May 2014", "title": "Student Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Auburn University (Auburn, AL)", "Interview Descriptions": "We were asked to send in an electronic application by December, which included letter of interest, recommendation letters, etc. Then we sent in a video resume (in lieu of a face-to-face interview) . After which they invite you to visit the campus (lodging provided).", "Interview Questions": "Why haven't you chosen to come here yet?"}], [{"date": "1 May 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "This job came with acceptance to my academic program.  If you got into the program, and didn't have a research assistant position lined up before you came in you were assigned to this job.", "Interview Questions": "N/A"}, {"date": "15 Nov 2018", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Auburn University (Auburn, AL) in May 2014", "Interview Descriptions": "Since I did my undergrad there the school knew me and offered me this position with my acceptance into their graduate program. So if you are looking to do grad work and you are already there I would highly recommend talking with the department so you have a higher chance of being selected.", "Interview Questions": "N/A"}, {"date": "21 May 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Auburn University in May 2014", "Interview Descriptions": "The interview process was simple, it was based on your qualifications. Since they knew me from undergrad I did not have a hard time. I really did not have an interview because they knew me and they pair you with a teacher who needs a GTA, but from my standpoint usually they pair you with who you will work well with. All of the teachers are fun to work with and there should not be an issue with them.", "Interview Questions": "Interview was all from resume qualifications and negotiation with staff."}, {"date": "13 Jul 2014", "title": "Commercialization/Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Auburn University (Auburn, AL) in May 2014", "Interview Descriptions": "Acquired interview through online application process. In person panel (the three bosses that you'd be working under) interview. Go through the online application rather than emailing the people. After being selected for an interview you select various times that'd work for you and they are very helpful at working around your schedule.", "Interview Questions": "Not many unexpected questions, read up online about what common questions are and be prepared to answer things on your resume. My answer: How does the ______ information on your resume meet the _____ needs of our position. "}, {"date": "10 Apr 2014", "title": "Student Athlete Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Auburn University", "Interview Descriptions": "Very informal process, I came in and talked for about 30 minutes, gave my resume, and then was given the tour and hired on the spot.", "Interview Questions": "I was asked about academic record if I was interested in tutoring."}, {"date": "18 Mar 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "Work was contingent on acceptance into doctoral program.", "Interview Questions": "N/A"}, {"date": "26 Feb 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Auburn University", "Interview Descriptions": "Several emails, and the professor called me and gave me a phone interview.", "Interview Questions": "Talk about your previous research."}, {"date": "14 Aug 2017", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Auburn University (Auburn, AL) in Feb 2014", "Interview Descriptions": "Interviews were largely done in groups - applicants were assessed on their ability to work in teams and resolve conflicts. Applicants were judged by previous Resident Assistants to determine if they would be appropriate fits for the roles. The interview process lasted the majority of the day.", "Interview Questions": "Q: What do you do if one of your residents tells you they are contemplating suicide?"}, {"date": "25 Mar 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Auburn University in Feb 2014", "Interview Descriptions": "Hiring process seems pretty clear. Applied online. Got phone and Skype interview.  After that,  they arranged the onsite interview. Overall enjoyed the full program. Then after several weeks they sent offer letter", "Interview Questions": "Details about my past research experience and behavioral questions"}, {"date": "16 Nov 2015", "title": "Athletic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Auburn University (Auburn, AL) in Jan 2014", "Interview Descriptions": "I was in contact with the academic director for a month before the semester I wanted to apply for. The interview was very relaxed. My employer asked me a series of questions about my tutoring style and academic life. I then presented a short mock-lesson, signed some paperwork, and was hired on the spot.", "Interview Questions": "What is your tutoring style?"}], [{"date": "21 Nov 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Auburn University", "Interview Descriptions": "Waiting for Technical Phone Interview", "Interview Questions": "On MATLAB"}, {"date": "6 Dec 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Auburn University (Auburn, AL) in Nov 2013", "Interview Descriptions": "You submit an application for the graduate school through your individual department. Is very much like other graduate school applications- personal info, transcripts, personal and academic statements. I came down, on my own, to tour before I applied and interviewed with some of the professors who asked me about my research background and future interests.", "Interview Questions": "What kind of research I would like to do in grad school. Did I feel prepared for the graduate level."}, {"date": "30 Mar 2015", "title": "Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Auburn University (Auburn, AL) in Sept 2013", "Interview Descriptions": "It was a smooth interview. Nice professors and good interview experience. Some questions like what you have done and what you may like to do besides the normal research? Just like normal conversation like friends.", "Interview Questions": "what you may like to do besides the normal research?"}, {"date": "1 Jul 2013", "title": "LRC IT Support Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Auburn University (Auburn, AL) in Jun 2013", "Interview Descriptions": "The interview process included your typical vague questions like, if you could fix anything with software, what would it be?\r\nOther questions are what is your greatest talent. All of that.", "Interview Questions": "The question that is always difficult for me that they also asked was, \"Give us an example of a conflict/issue and how you handled it.\""}, {"date": "10 Feb 2014", "title": "IT Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Auburn University (Auburn University, AL) in Jun 2013", "Interview Descriptions": "Talked with school of architecture; nice folks, interview panel had good detailed questions and was very organized; they'd clearly done this process a few times before.", "Interview Questions": "No real surprises or crazy questions."}, {"date": "18 May 2013", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "just apply for the school hang in your study plan and applicatino form", "Interview Questions": "there seem to be no unexpected questions and interview"}, {"date": "9 Mar 2017", "title": "Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Auburn University (Auburn, AL) in May 2013", "Interview Descriptions": "IF you know someone you only have to go in and apply. They are very prompt at returning phone calls, and do not mess around with the hiring process. They are super chill, very relaxed working environment until it isn't.", "Interview Questions": "How well do you work on a team?"}, {"date": "7 Jul 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Auburn University (Auburn, AL) in May 2013", "Interview Descriptions": "Was invited by the professor to attend the interview. Asked questions about engineering basics, and those specific to my job, such as experience in handling machinery. Also asked questions regarding technical exposure to aerodynamics, fluid mechanics, and instrumentation including hot wire anemometry and PIV.", "Interview Questions": "What is the difference between an open circuit and closed circuit wind tunnel?"}, {"date": "16 Jun 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Auburn University (Auburn, AL) in Apr 2013", "Interview Descriptions": "I applied the job on Auburn University website and a few months later I got an email, stating that I got Teaching Assistant offer. So there is no interview in this job application, I only sent my GPA, GRE and TOEFL scores, Personal Statements and Recommendation Letters to the Admission Department.", "Interview Questions": "I applied the job online and got Teaching Assistant offer without any interview. "}, {"date": "27 Apr 2017", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Auburn University (Auburn, AL) in Apr 2013", "Interview Descriptions": "long process with multi-step. expect a long wait and standard interview questions. some of the interviewers tried to be intimidating. also did a presentation. would recommend practicing first and be prepared to follow up", "Interview Questions": "what is your greatest weakness and how would it impact your job here?"}], [{"date": "22 Mar 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "Minimum requirement for graduate research assistant (GRA) position . Students are expect to have undergraduate degree (Mechanical, Material Electrical, Physics). For example: for mechanical area, students are expected to have good knowledge in Mechanics of Materials, Finite Element Analysis, Heat and Mass Transfer. Apply for the graduate program at Auburn University, AL. Once the college accepts your application for higher education and if you get selected then apply for the graduate assistant award at CAVE3 research center.", "Interview Questions": "Emphasis is on technical knowledge. For example ( Difference between tensile and creep test? or Stress matrix on a 2D principal plane."}, {"date": "12 Feb 2013", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Auburn University (Auburn, AL) in Feb 2013", "Interview Descriptions": "In the management department for the Ph.D. program: exam requirements are moderate, less challenging. Interview process is much more casual than other programs you will visit. Do NOT wear a suit, do prepare for BBQ, do talk about your family,and be super clear your research interests (have two or three hard examples). The loose coupling system employed by the department means that you must make it clear that you will fit with several different faculty members, rather than into the research group of a single advisor.  \r\n\r\nPS- think carefully. there is no culture- no movies, no art, no politics, no ethnic food, no ethnic people (aside from the local Korean culture, whom I heard described by students at an orientation meeting as \"smelling of kimchi.\"", "Interview Questions": "Family structure, goals and living negotiation of relocating to Auburn with a spouse. "}, {"date": "4 May 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Auburn University (Auburn, AL) in Feb 2013", "Interview Descriptions": "I was asked to visit the campus.  It was a 2day program . I met with couple of faculty and students.They were friendly . Interview with faculty went very well  and finally i got admission for graduate school.", "Interview Questions": "what type of research I like etc. "}, {"date": "14 Jul 2014", "title": "Assistant Professor of Clinical Pharmacy Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at Auburn University (Auburn, AL) in Feb 2013", "Interview Descriptions": "The interview process is a day or more, and I met with several different faculty and leadership. A few of my interviews were using Skype because many faculty are in different locations in Alabama. \n\nI left with a positive experience about the interview, but the trouble came after. Because it was my first time interviewing for a faculty position, I asked for feedback after I received a letter (6 weeks later) saying I wasn't offered the position. I did not receive any responses, even after running into faculty I interviewed with at national meetings. They definitely burned a bridge with me, as I never want to work with an institution that doesn't realize the importance for growth for all clinical pharmacists.", "Interview Questions": "Who do you serve as faculty - patients or students?"}, {"date": "17 Jan 2013", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Auburn University", "Interview Descriptions": "Meet the graduate program officer to get interviewed for the job", "Interview Questions": "Nothing"}, {"date": "7 Oct 2015", "title": "Campus Rec General Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Auburn University (Auburn, AL) in Jan 2013", "Interview Descriptions": "Apply online with a resume and short question list, then come in for a group interview followed by an individual interview. The group interview focused on team skills while the individual interview focused on individual strengths.", "Interview Questions": "Name one time you handled a difficult situation and how you handled it."}, {"date": "26 Apr 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Auburn University (Auburn, AL) in Jan 2013", "Interview Descriptions": "It was a standard and well organized interview processes. The way they handled the interview was good. Would recommend it for applicants. It will start with an 1-1 interview and then with the panel", "Interview Questions": "Asked about my experience and how I can be a value"}, {"date": "24 Aug 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Auburn University (Auburn, AL) in Jul 2012", "Interview Descriptions": "it included meeting with the course professor and the department Graduate Program Officer. The interview course professor lasted for 30 minutes and with the Graduate Program Officer lasted for 20 minutes", "Interview Questions": "N/A"}, {"date": "24 May 2012", "title": "Administrative Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Auburn University (Auburn, AL) in Feb 2012", "Interview Descriptions": "Email from Dean's assistant to setup the interview in a matter of days.  Arrived at interview and was greeted and welcomed.  All female panel interview.  Each person was friendly yet quite reserved.  Told that a decision would be made by the end of week and would be told either way.  No communication for a month after the interview.  Finally, recieved postal mail letter of rejection after positon was filled.", "Interview Questions": "How does this fit your long and short term goals?"}, {"date": "13 Jan 2012", "title": "Engineering Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Auburn University (Auburn, AL) in Jan 2012", "Interview Descriptions": "first is phone interview, then onsite interview, and now I am waiting for the reply.", "Interview Questions": "Why you think you match this position?"}], [{"date": "5 Apr 2012", "title": "Administrative Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Auburn University (Auburn, AL) in Jan 2012", "Interview Descriptions": "The interview process took several weeks.  After the initial one on one interview, I waited almost a month before getting an offer.  This is due to all the different checks that the HR department had to do.", "Interview Questions": "Why do you think you could do this job better than anyone else?"}, {"date": "9 Jul 2014", "title": "Quality Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Auburn University in Sept 2011", "Interview Descriptions": "The hiring process took a long time to get the first contact from the department.  The research group was funded by a grant and was tied to the signing of the contract before hiring could start.  Once the contract was signed, the director of the project moved quickly to get me on board.", "Interview Questions": "The interview was very basic and not very high pressure.  The interviewers were courteous and offered good detail about the nature of the project and the open position."}, {"date": "19 Sept 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Auburn University (Auburn, AL) in May 2011", "Interview Descriptions": "Two round interviews. First the department head called me and asked about basic information about me. Like GPA and preferred area. Second onsite interview. Meet professors and talked about details about the graduate study. Department information. They asked me do  I have any research experience in my undergraduate study.", "Interview Questions": "Why are you pursuing a phD degree?"}, {"date": "29 Dec 2011", "title": "PR Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Auburn University (Auburn, AL) in May 2011", "Interview Descriptions": "I was informed through email that the position was open. I sent in my resume, cover letter and a few writing samples via email. I was contacted about an interview time, which was flexible. I believe there were about 5 other people interviewing. I came in to a small panel of the people I would be directly working with. The questions were basic such as:\r\n-Tell us about yourself\r\n-Tell us about a time you faced a challenging situation\r\n-How do you handle balancing several projects at once\r\n-What is your favorite type of writing and why\r\n\r\nI was informed via email I was extended the offer about a week after, and was given a week to accept or decline the position.\r\n\r\nThe interview was laid back, but I was still expected to act and look business professional, of course. Humor was freely accepted, as well as interacting with all members of the panel.", "Interview Questions": "What kind of writing do you like best and why?"}, {"date": "12 Nov 2013", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Auburn University in Jan 2011", "Interview Descriptions": "All day interview\r\nFirst interview was with committee\r\n2nd was with Vice President and Associate Vice President\r\n3rd was with direct report", "Interview Questions": "What are your plans 180 days in"}, {"date": "21 Dec 2011", "title": "Lab Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Auburn University (Auburn, AL) in Nov 2010", "Interview Descriptions": "Very simple questions, situational mostly.", "Interview Questions": "What's the most challenging obstacle you've ever had to overcome?"}, {"date": "7 Oct 2010", "title": "Bank Teller Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Auburn University (Auburn, AL) in Sept 2010", "Interview Descriptions": "the interview was pretty smooth, thye ask some basic  questions like to describe your work expenrience, give an example to prove you are a fast learner, etc,  the brancgh manager and teller supervisor are very nice, they gave me a plenty of time to ask questions.  you felt like you would get the offer. I waited for a week and no one notified me bout their decision.", "Interview Questions": "desrcibe your past work experience"}, {"date": "16 May 2011", "title": "GRA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Auburn University (Auburn, AL) in Jul 2009", "Interview Descriptions": "call me and ask general questions of previous research experiences and skills", "Interview Questions": "How much do you know about C/C++, nonlinear optimization and signal process?"}]]