[[{"date": "4 Jul 2023", "title": "QA Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Give", "Interview Descriptions": "questions were asked acc. to the field chosen. Everything went swiftly and very well. IT team was rolling out mails on regular basis so that there is no loss in info.Hr's connected often regarding calls and all", "Interview Questions": "They asked my name and"}, {"date": "3 Jul 2023", "title": "SDE-2 Backend Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Give", "Interview Descriptions": "It was great, interviewer firstly makes the candidates comfortable so that candidate can express his/her talent beyond their potential. At last they also gives you suggestions regarding the improvements part.", "Interview Questions": "Intro, About node.js, some coding problems"}, {"date": "12 May 2023", "title": "Senior Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Give (Chengalpattu) in May 2023", "Interview Descriptions": "it was an impressive interview process and also the interviewers were profound in their field of knowledge. The coordinating personalities were so professional and helpful. I could learn a lot during the process of the interview.", "Interview Questions": "What are my strengths and learnings during my previous work structure?"}, {"date": "3 Mar 2023", "title": "Associate Stakeholder Delight Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Give (Bengaluru) in Mar 2023", "Interview Descriptions": "The interview process was very streamlined. I initially had a screening call from the HR team to acknowledge my interest in the job, post which I had an interview with the Senior Associate stakeholder Delight personal. After this I completed an assignment. After the assignment I had an interview with the hiring manager. The entire process was completed within two weeks.", "Interview Questions": "They try to understand if I'm aware of the position and it's responsibilities. They asked me a few questions about the challenges I might have faced in my previous job. Asked about the instances where I powered through an unfavourable situation. A few questions on how I can handle the challenges in the current job."}, {"date": "21 Mar 2023", "title": "SDEII/SDE1 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Give in Mar 2023", "Interview Descriptions": "Interview process to nearly 3 weeks. Went through 4 rounds of tech . 1st round was basic tech skills and included a problem to solve For 2nd round, they shared a problem statement and I had to submit the solution within 3 days 3rd round was a tech round. Mostly talked about my previous project experiences 4th round was tech/managerial round talked extensively on the type of work/tech stack I am familiar with", "Interview Questions": "1.REST APIs, a probem to check problem solving skills 2. JWT tokens/ Authentication 3. How logging works in NodeJS 4. questions on ReactJS"}, {"date": "24 Feb 2023", "title": "UX Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Give", "Interview Descriptions": "The whole interview process seems very good and quick. Couple of rounds with Human resource team. People are friendly here in Give. Also, the HR clarify any doubts you might have.", "Interview Questions": "Ask about, likes and your passion."}, {"date": "23 Feb 2023", "title": "Software Engineer II SDE2 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at Give", "Interview Descriptions": "There were 3 Rounds of Interview majorly and in the 1st round they given Coding test. Second round - Technical discussion, Third round - Manager round followed by HR discussion.", "Interview Questions": "Python , Django, Database and Project related questions."}, {"date": "25 Jan 2023", "title": "Product Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Give", "Interview Descriptions": "The first interview started with an Intro Call/Exploratory call with the Leadership member. The process went smoothly with deep dive into technical insights. The interview process is of 3-4 rounds.", "Interview Questions": "Round 1: Technical screening on product strategy and improvements."}, {"date": "18 Jan 2023", "title": "Associate Stakeholder Delight Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Give (Bengaluru) in Jan 2023", "Interview Descriptions": "I applied via Give.do and got a call from HR the next day. She explained the Job description and confirmed the date and time for the next round of interviews. Every round went smoothly and was on time. Overall I has a great experience and expectations were clear from the start.", "Interview Questions": "They asked why do I want to join Give and my motivation behind joining the social sector."}, {"date": "18 Jan 2023", "title": "Stakeholder Delight Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Give (Bengaluru) in Jan 2023", "Interview Descriptions": "I applied through the website and got a call from HR the next day she scheduled the interview process after confirming the date of time for the next round. After I cleared the next round then she scheduled it for the final round.", "Interview Questions": "Why do I want to join Give and what is my primary motivation behind joining the social sector?"}], [{"date": "1 Dec 2022", "title": "Senior Product Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Give (Bengaluru) in Nov 2022", "Interview Descriptions": "Had multiple rounds of evaluation: R1 - Conversation with Product Lead R2 - Assignment Submission, Product based (time given ~2.5 days) R3 - Conversation with People & Culture Head R4 - Discussion on Submitted Assignment with Product Lead (in person) R5 - Conversation with CMO R6 - Conversation with CEO", "Interview Questions": "Questions asked were about experience, product management, design & strategy. A significant amount of time with non-product leaders was spent to determine cultural compatibility."}, {"date": "7 Sept 2022", "title": "Senior Associate - Social Media Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Give (Mumbai) in Aug 2022", "Interview Descriptions": "There are multiple rounds of interviews which enables the organization to evaluate your skills and understanding on the subject.  After each rounds of interview you would receive the feedback on the same day or next day latest. There is always clear communication and transparency with your job application.", "Interview Questions": "1. Tell us about your experience?\r\n2. What was your best campaign?\r\n3. According to you which brand has best social media presence and why?"}, {"date": "6 Sept 2022", "title": "Short-term Consultant (STC) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Give (Bengaluru) in Aug 2022", "Interview Descriptions": "The interview process was quite rigourous. 4 rounds of interviews with 1 assignment was conducted on an elimination basis. The hiring team is in touch throughout the process and there is zero ambiguity on how things will progress or what is the next step. The managers were always ready to answer any questions and responded very quickly. Appointed times were respected to the last second with absolutely no delay. The interviewers themselves were incredibly respectful and the questions were very thought provoking.", "Interview Questions": "Questions were aimed entirely on analysing level of skill and fit for the role. The questions also aimed at discovering if the candidate was truly passionate about making an impact. "}, {"date": "6 Sept 2022", "title": "Associate Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Give (Lucknow) in Aug 2022", "Interview Descriptions": "Experience was really great, I really like the people I met in the interview. I must add this they people who took my interview were very senior as per their roles and with that very soft spoken and supporting. Giving an interview in Give added a great experience in my career.", "Interview Questions": "Why you want to join Giveindia "}, {"date": "8 Sept 2022", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Give (Bengaluru) in Aug 2022", "Interview Descriptions": "There were 3 interviews that I took part in as part of the selection process. The panel member had been patient each time to help me understand the key responsibilities that the position would require and how i could contribute towards the team.", "Interview Questions": "Prior experience related to the position i applied for. "}, {"date": "6 Sept 2022", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Give (Bengaluru) in Aug 2022", "Interview Descriptions": "The interview process was conducted online and went very smoothly with the next steps communicated clearly by the HR team. \r\n\r\nRound 1: HR round + Written questionnaire \r\nRound 2: Video Interview with the reporting manager \r\nRound 2-3: Take home assignment & discussion call \r\nRound 5-8: Video interviews with leads of various teams within the organisation \r\n\r\nEveryone at GiveIndia was very professional and the interview process. The entire process helped me understand more about the organisation & took around 2 weeks.", "Interview Questions": "1. Why GiveIndia\r\n2. Previous work Experience "}, {"date": "26 Sept 2022", "title": "AM- Reporting Analytics Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Give in Aug 2022", "Interview Descriptions": "There were three rounds of interviews (2 written tasks and two interview rounds) and took about two weeks.\r\n\r\n The hiring person wants someone who has 6 years of experience but can't offer a salary as per market standard because its the \"Social Sector\".\r\n\r\nBefore starting an interview one must ask the hiring person to clearly mention the salary package and JD over email because after completing the interview process they have the tendency of changing the salary scale (they will tell you that there is another candidate for hire if you don't accept the low pay) \r\n\r\nAlso, they mention that if work calls, one has to work on Saturday or Sunday though it's an off. This is their work culture as they give an option of working remotely (also a reason to deduct your salary from the lovely hiring person).", "Interview Questions": "Questions are mostly based on your work profile and previous project failures and success."}, {"date": "24 Aug 2022", "title": "Associate Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Give (Mumbai) in Aug 2022", "Interview Descriptions": "1st round - Telephonic interview with HR for 15 minutes\r\n2nd round - Video interview with a team member of NGO partnerships for an hour\r\n3rd round - 2 Assignments and 2 excel tests\r\n4th round - Video interview with an Associate Director of Institutional Giving for 45 minutes\r\nFinal round - Video interview with a VP, Head of Institutional Giving  for an hour", "Interview Questions": "Generic interview based on work experience, education background, and technical questions."}, {"date": "7 Sept 2022", "title": "SDE 3 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Give (Bengaluru) in Jul 2022", "Interview Descriptions": "It was a 3 step interview process, 1st round is a general HR round followed by a Technical discussion. And then a few assignments in the 3rd round. People were very friendly and made me very much comfortable during the entire process.", "Interview Questions": "Why are you keen to move to a role at GiveIndia?"}, {"date": "2 Oct 2022", "title": "Senior Manager, Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Give (Bengaluru) in Jul 2022", "Interview Descriptions": "It was really well structured and LOB heads of each verticals took my interview and it a sheer pleasure interaction and enriching experience for me. The people from the HR side are very nice and supportive which also reflects the warmth of the organisation.", "Interview Questions": "The questions were akin to my last profile assignments handled and scenarios I am expected to come across in this new role and how I am going to handle those scenarios. Data and system proficiency etc."}], [{"date": "4 Nov 2022", "title": "Associate Manager, Content Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Give in Jul 2022", "Interview Descriptions": "I found the screening process to be exceptionally organised and in-depth. I went through four rounds of interviews and all the interviewers were cordial and supportive. The written test was also designed in a manner in which I could showcase my skills and prove my capabilities.", "Interview Questions": "Tell us more about your past experience."}, {"date": "8 Sept 2022", "title": "Associate NPP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Give (Bengaluru) in Jul 2022", "Interview Descriptions": "Had initial interview which was coupled with few situational based questions in the first round. Got an assignment. Had another round of interview with the head, had another assignment for the same after which there was a last round of interview followed by an HR call", "Interview Questions": "Not able to recall as of yet"}, {"date": "18 Aug 2022", "title": "Associate Manager - People and Culture Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Give in Jul 2022", "Interview Descriptions": "The interview process had 3 steps and was carried bout in the most professional and swift manner. It took just 5 days for the entire process to get over and the offer letter  to be rolled out.", "Interview Questions": "1) Why do you want work in the non-profit sector?\r\n2) Are you ready to work at a comparatively lesser compensation than what the other sectors offer?\r\n3) What is your idea of a successful HRBP?\r\n"}, {"date": "31 May 2022", "title": "SEO Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Give", "Interview Descriptions": "Give India is one of the best places to work and Overall It was good and some are questions based on your old experience and a lot more to go so just \r\nThanks for having me.", "Interview Questions": "Tell me about yourself ?"}, {"date": "4 Jul 2022", "title": "Senior Associate Content Curator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Give (Calcutta) in May 2022", "Interview Descriptions": "It was a general 3-step interview process where the 1st round is taken by the HR, next is the reporting officer that you will report to if you are hired followed by a final round of interview by the Head who leads the whole team. In the 2nd round of interview, you are given an assignment, which will obviously change as per designation and role specification. Overall, the interview process was completed pretty fast compared many other organisations where it takes 2 to 3 months to process.", "Interview Questions": "How well do you understand the job role and whether you will be willing to work at a low-compensation?"}, {"date": "21 Jan 2022", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Give (Bengaluru) in Jan 2022", "Interview Descriptions": "Great experience. The team was extremely respectful and clear with the role and expectations. Also the process was fast, transparent and the HR team was in continuous communication.  There was a small assignment but everything was paced right with clear communication. I thoroughly enjoyed the process.", "Interview Questions": "Working in a non-profit which is at its growth phase will come with challenges- long work hours, lot of handa on work..how do you envisage to navigate?"}, {"date": "22 Nov 2021", "title": "Director, Program Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Give in Nov 2021", "Interview Descriptions": "Very professional and smooth.  Friendly and supportive culture. Candidate was given very good information by all interviewers. \nConsistent messaging from all parts of the organization. Prompt follow up and minimal delay from each interview to the next.", "Interview Questions": "How will you be successful in the role?"}, {"date": "16 Dec 2021", "title": "State Project Manager-Livelihoods Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Give (Bengaluru) in Nov 2021", "Interview Descriptions": "The interview has 3 rounds with institutional giving program team and 2 rounds with HR team. Very smooth and prompt response from the HR specially Ms. Ramanjeet who handles the onboarding. The 3 rounds with Ms. Lahar, Ms. Some and Mr. Saurabh were quite friendly, smooth and professional. I was given a good amount of detail about the role and the organisation. Very prompt results.\nThere was a written assignment also on designing a livelihood project.", "Interview Questions": "Interview questions were about the past experience, knowledge about the sector and motivation behind joining the GI. "}, {"date": "24 Feb 2023", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Give (Bengaluru) in Nov 2021", "Interview Descriptions": "More focus on fit and intent with multiple rounds of interview. Was given adequate background about the role and objectives. It was well organised and I could sense internal coordination.", "Interview Questions": "Why give? Why development sector? long term goals? how will you map old skills to new role?"}, {"date": "29 Oct 2021", "title": "Senior Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Give (Mumbai) in Oct 2021", "Interview Descriptions": "1st HR Round with RamanJeet Kapur\n1st Interview Round with Lahar Bhasin\nAssignment Work\n2nd Interview Round with Somedutta Chatterjee\n3rd Interview Round with Saurabh Adeeb\nAssignment Work Presentation with Lahar Bhasin & Somedutta Chatterjee\n\n2nd HR Round with Ramanjeet Kapur\n3rd HR Round with Ruchi Sharma", "Interview Questions": "Interview Question were around the following areas:\n\n1) Candidate Profile\n2) Skill set and math for the role\n3) Assignment Presentation and Review based question\n4) Hypothetical Situation based question to understand risk managing ability\n5) Overall personality interaction  for organization match review"}], [{"date": "22 Oct 2021", "title": "Associate, NGO Partnerships Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Give (Bengaluru) in Oct 2021", "Interview Descriptions": "I was first given a call by the HR who subsequently scheduled an interview with the Manager, Program Management, NGO Ecosystem. The interview lasted for approximately 50 minutes after which I qualified for the assignment round. I was given a time-bound excel worksheet assignment along with two written assignments. Post this phase, another interview was scheduled with the Director, NGO Partnerships which lasted for about 20-25 minutes. Within two days, I received a final call from the HR regarding my education, experience and salary expectations. I received the offer within another two days which I have accepted.", "Interview Questions": "Questions on\n1. internship background and which internship I have enjoyed the most and why.\n2. why I opted for GiveIndia.\n3. why I want to be involved in the social sector\n (and more)"}, {"date": "13 Nov 2021", "title": "Senior Director - Marketing and Growth Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Give (Bengaluru) in Oct 2021", "Interview Descriptions": "GiveIndia's interview process is well laid out and all interviews/interactions were on time. The leadership team including the CEO spent a whole lot of time understanding the candidate and what he/she brings to the table.  Post that I was given an assignment which I had to complete in 24 hrs . In the next 48 hrs I got a call updating me about my selection and the role where I can add most value.  The HR process and other formalities were very smooth and highly professional.", "Interview Questions": "Why GiveIndia and especially when we can't match corporate salaries"}, {"date": "15 Sept 2021", "title": "NAP Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Give", "Interview Descriptions": "Fairly simple, laid back and stress free. Give case studies and have 2-3 rounds, instead would make sense to have a panel interview. Salaries are very, very low, hiring has picked up pace.", "Interview Questions": "About yourself, your projects, why do you want to move to social sector"}, {"date": "9 Sept 2021", "title": "Senior Associate - Hospital Partnership Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Give (Bengaluru) in Sept 2021", "Interview Descriptions": "At first, I seem a bit nervous, but once I started the interview, I revealed myself to be an articulate, well-read professional. Over all my Interview was very interesting. There were four rounds and each round was thought provoking.  Interviewers were cooperative. All the discussions were goal oriented.", "Interview Questions": "What is the motivation behind joining GiveIndia ? "}, {"date": "23 Feb 2023", "title": "Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Give (New Delhi) in Aug 2021", "Interview Descriptions": "It was easy to find all the information regarding the position Recruiter told me how to prepare for the interview Recruiter was friendly Recruiter was professional I got all the responses from recruiter I needed All my questions were answered in a timely manner It was easy to apply for the position It was easy to find the company for the interview It was clear how did I need to compare for the interview I felt I was very welcomed when I came for the interview I was happy with the time between the application and the response I was happy with the time between the interview and feedback", "Interview Questions": "Checking my Social Intent , my experience"}, {"date": "10 Jan 2023", "title": "Associate Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Give in May 2021", "Interview Descriptions": "Interview process was very detailed. RA 1 - HR round, RA2 - assignment round, RA3 - all leads, RA4 - CEO. Very professional and friendly culture. follow ups and no delay", "Interview Questions": "Why do u want to work for Give?"}, {"date": "23 Feb 2023", "title": "Software Development Engineer (SDE) II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Give (Gorakhpur, Uttar Pradesh) in Mar 2021", "Interview Descriptions": "Interview process is little long. It took more than 20 days to complete the hiring process. It includes 4-5 rounds inclusing HR, tech and manager discussions. The results of rounds is little late than expections.", "Interview Questions": "For tech mostly node js & react js question asked."}, {"date": "16 Dec 2020", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Give", "Interview Descriptions": "Well the experience was good, the HR wss very humble and kind, she made md feel comfortable and was very open and easy to talk with me. hr was very easu to talk to, very interesting experience", "Interview Questions": "Very general"}, {"date": "8 Nov 2020", "title": "Senior Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Give", "Interview Descriptions": "There were multiple rounds of interview which were both telephonic as well as video calls. The interviews were precise and to the point - well structured. However, I did have multiple rounds of interview as they thought that my skill set would be applicable for another role. But they did own up to their mistake and handled the situation well.", "Interview Questions": "How comfortable are you working in the social field? "}, {"date": "10 Nov 2020", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Give (Nalanda) in Nov 2020", "Interview Descriptions": "The process was good. I was given an assignment in Excel. After clearing that, I have been interviewed by the Head Manager of the Team. Relevant questions were asked in it.", "Interview Questions": "Why have you choosen the social sector to work in?"}], [{"date": "14 Oct 2020", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 5 weeks. I interviewed at Give (New Delhi)", "Interview Descriptions": "The interview and hiring process overall was completely pathetic, lack of professionalism and no concern for the candidate's time. Multiple follow ups to know the interview outcome. Don't waste precious time of candidates when you don't want to hire them. Reject them in the initial rounds not after they put all their hard work at the last stage. \n\nHire good people in HR from reputed organizations or B schools as currently HRs have very little understanding.\n\nBefore being a philanthropic oriented organization improve your own deficiencies.", "Interview Questions": "why social sector"}, {"date": "12 Oct 2020", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Give", "Interview Descriptions": "The hiring process consisted of multiple (>5) rounds of interviews including a written assignment and was conducted over the course of a month and a half. I felt it was extremely thorough and helped me understand the organization and job requirements better.", "Interview Questions": " What are the top 5 metrics to track for the crowdfunding platform as a a) business leader and b) product manager? What different cuts of the data would we look at? "}, {"date": "16 Oct 2020", "title": "Software Engineer II SDE2 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at Give (Bengaluru) in Sept 2020", "Interview Descriptions": "There were 5 rounds. \r\nFirst round was a take home assignment which had to be completed in 2 days.\r\nAfter that there were 2 technical rounds of about 45 mins each. These werr to test basic software developer skills and some scenarios. \r\nAfter that, there was a round with the CTO which was a mix of technical and culture fit. After that there was a HR and salary discussion round.", "Interview Questions": "Basic Javascript and database related questions."}, {"date": "21 Sept 2020", "title": "SDE 1 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Give (New Delhi) in Sept 2020", "Interview Descriptions": "1st round telephonic interview: 30 min interview, easy-medium questions asked.\r\n2nd round assignment: easy-medium level assignment that has to be completed within 2 days.\r\n3rd round interview: 1 hr medium level technical questions and some questions from the previously completed assignment.\r\n4th round: non-technical general interview to see if the candidate fits in the atmosphere.\r\n5th round: HR, general questions, and salary negotiation", "Interview Questions": "describe the JSON Web Token structure."}, {"date": "22 Jul 2020", "title": "Finance Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Give", "Interview Descriptions": "Interview process took Three days. Its all about basic concepts of Finance and Accounting Standards, Analyzing the Financials of last two years and compliance matters as per Foreign Contribution Regulation Act.", "Interview Questions": "When to recognize a contribution or donation as a Foreign source"}, {"date": "8 Aug 2020", "title": "Software Development Engineer II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Give (Bengaluru) in Jul 2020", "Interview Descriptions": "The interview process was very exciting.\r\nIt started with a Task that was sent via email post application on the website.\r\n\r\nThe task comes with the two day deadline and upon submission of that I had my first interview round with a Head of the Team I was to join which upon selection was followed by another interview.\r\n\r\nSince I was looking to apply for a senior position, I got another task during the process which again came with the 2 day deadline.\r\nUpon completion, I got an interview call from the Director Tech which was a non-technical interview.\r\n\r\nOverall, the process was covered in a duration of 3 Weeks and it was a great experience to go through the process. All Interviews were scheduled prior by the Head of People Operations and all queries were answered promptly.", "Interview Questions": "1. Box Sizing Property of CSS\r\n2. Use of Hooks/Contexts in React\r\n3. Preference of Using React over other frameworks.\r\n"}, {"date": "18 Jun 2020", "title": "NGO Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at Give", "Interview Descriptions": "The interview process was very organized and smooth. The first round was with Rimona, Lead - People Operations, and subsequently, I had an interview with Pranav Varma - Associate Manager - Partnerships. Post the same, I had an interview with Neha Joshi - Head - NGO Partnerships. I was also given an assignment to submit. The interview process was a healthy mix of personal questions and role-related questions.", "Interview Questions": "What do you understand about this role?"}, {"date": "15 Jun 2020", "title": "Front End Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Give in Jun 2020", "Interview Descriptions": "1. First Round was introductory call and basic technical knowledge .\r\n2. Assignment - Asked to create a SPA Radio app ( Validate the youtube url links, Loop the video, delete the completed video, reorder the playlist videos, sync the player on other tab ) \r\n3. Technical Round - Questions on React JS, HTML, CSS, JS \r\n4. Head of Tech -  Short call on basic questions on right candidature selection.\r\n5. HR round", "Interview Questions": "1. React Life Cycle Methods \r\n2. CSS Box Model \r\n3. Promises and async await in JS \r\n4. Virtual DOM in React \r\n5. Advantages of React compared to other lib\r\n"}, {"date": "25 Feb 2020", "title": "Senior Engineering Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Give (Bengaluru) in Feb 2020", "Interview Descriptions": "The interview process itself was quite straightforward.\r\n\r\nStep-1: 30 minute telephonic interview with their product head. We mainly covered a detailed summary of my career, the broad strokes of GiveIndia as an organization, and the reason for my interest in GiveIndia.\r\n\r\nStep-2: Three face-to-face interviews (1 hour each) with (i) a Tech Lead (ii) a Division Head and (iii) the CEO. All three interviews were conversational, friendly/non-adversarial while still probing the breadth and depth of my career experience with respect to tech., management and my commitment to the cause. Specific examples were cited from my explanations and asked to be expanded upon.\r\n\r\nA very positive experience and completely unlike a 'gotcha'-type interview where the interviewer attempts to prove intellectual superiority over the interviewee rather than explore the interviewee's skillset. I immediately built a lot of trust with key members of the organization, and (I hope) vice versa.\r\n\r\nStep-3: Small coding assignment designed to be straightforward while still testing one's fundamentals. It should have taken about 5-8 hours, but I took some extra time as I wasn't satisfied with my first submitted attempt and requested them to accept a second one.", "Interview Questions": "What experience do you have with managing/leading a team and/or a distributed team?"}, {"date": "17 Feb 2020", "title": "Chief Financial Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Give (Bengaluru) in Jan 2020", "Interview Descriptions": "The entire interview process was well thought and completed in short period. of time. All interviewers were on time and the interview discussions were open and relevant for the job.", "Interview Questions": "Why do  want to join Give Foundation. How can I add value to the organizational?"}], [{"date": "22 Dec 2019", "title": "Associate Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Give (Bengaluru) in Dec 2019", "Interview Descriptions": "As a process, it was a smooth interview process with friendly and very motivating team, screening the candidate was also very smooth without taking much time. Overall, I would give a 4.5 out of 5.", "Interview Questions": "Regarding FCRA, how to identifying the FCRA Remittance from a donor if its by an NRI.!??"}, {"date": "9 Jan 2020", "title": "SDE1 - Web Developer - React Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Give (Bengaluru) in Dec 2019", "Interview Descriptions": "Interview Process consisted of - \r\n1. Initial assignment (Mini Web Application) - Asked to create a SPA which allows a user to add youtube videos, verify the links added, autoplay, remove the completed videos, reorder the video list, how to make sure new tab open will keep the react state\r\n2. Technical Round 1 - Asked more on the basics of web development and React framework, javascript trick questions\r\n3. Technical Round 2 - More questions on Javascript, React\r\n4. HR Round", "Interview Questions": "1. What happens when you input a link in browser and press enter (How web works)\r\n2. Describe the React component lifecycle methods, which component methods are de-scoped from newer React version\r\n3. Trick questions in Javascript on the concatenation of strings, arrays\r\n4. Higher-order components\r\n5. State vs Props in React\r\n6. jsonwebtoken - what it is comprised of and how it changes based on data (basics)\r\n7. Closure in javascript"}, {"date": "31 Oct 2019", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Give", "Interview Descriptions": "Once you have applied for the position, if shortlisted you will be asked to complete an assignment which is to build a SPA. On completion of the task, you will be asked for face to face interview which includes basic frontend questions.", "Interview Questions": "Build a SPA that acts as a Radio for YouTube videos. Users can add/remove the YouTube link. The player will play the videos in the FIFO order."}, {"date": "4 Nov 2019", "title": "Donor Engagement Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Give (Bengaluru) in Oct 2019", "Interview Descriptions": "The interview process basically processed through 3-4 stages comprising telephonic interrogation, written assessment, video call interview and finally a final interview. The entire interview process was exciting, straightforward, cooperative and greatly enriching.", "Interview Questions": "How would I contribute towards a non- profit organisation?"}, {"date": "30 Oct 2019", "title": "Senior Associate - Donor Engagement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Give (Bengaluru) in Oct 2019", "Interview Descriptions": "Around 4 interview rounds with 1 Assignment. Met Multiple people in the department and it was really interesting.\r\nGot to know many things as to how these NGO work and also hire. NGO hiring is slightly different from corporate Hiring", "Interview Questions": "Tell about Yourself? Tell about GiveIndia? and many other interesting questions"}, {"date": "27 Sept 2019", "title": "Associate, NGO Partnerships Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Give (Pune) in Sept 2019", "Interview Descriptions": "It was very smooth, efficient and professionally conducted. Overall a comfortable and friendly experience. They conducted 3 interviews overall and gave me an excel assignment as a task. The process took 3 days.", "Interview Questions": "My community and social sector experience "}, {"date": "5 Aug 2019", "title": "Partnerships and Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Give", "Interview Descriptions": "The hiring process was well streamlined and interviewers were on schedule to complete the process within predefined timelines. Enough time was given for the assignments and the HR and hiring manager were always available for any queries during the interview process.", "Interview Questions": "How will your skills in the corporate sector translate into business development domain in the social sector"}, {"date": "25 Jul 2019", "title": "Business Strategy Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Give (Bengaluru) in Jun 2019", "Interview Descriptions": "HR Round followed by Case study. Then case evaluation and discussion with leadership team and the CEO. This was followed by meeting with CEO, negotiation process and final offer made by the team", "Interview Questions": "Why move to social sector?"}, {"date": "17 Sept 2019", "title": "SDE1 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Give (Bengaluru) in Jun 2019", "Interview Descriptions": "I had applied through Angel. The interview process was pretty swift. The interview consisted of three rounds - Two Technical Rounds with two team leads across two of their locations and finally the HR round for the Salary Negotiation and general policies. I got the offer letter in about two weeks.", "Interview Questions": "General NodeJS questions and the kind of applications that I have worked on previously.\r\nBasic dev-ops related questions.\r\nBasic MongoDB related questions."}, {"date": "6 Feb 2019", "title": "Head of Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Give", "Interview Descriptions": "experienced based questions, multiple discussions/interviews/meetings, met several people in the org that was informative . Recruiting team was diligent in following up and providing updates as and when required.", "Interview Questions": "experience based questions"}], [{"date": "17 Apr 2019", "title": "Senior Associate, Social Media and Content Marketing  Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Give (New Delhi) in Feb 2019", "Interview Descriptions": "Interview with different people gave me different insights and helped me understand the role I was opting for. The interviewers were very cooperating in making me understand the organization's vision and mission.", "Interview Questions": "If I am comfortable working long hours if the work demands?"}, {"date": "18 Jun 2019", "title": "Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Give (Mumbai) in Nov 2018", "Interview Descriptions": "The interview process was quite smooth and the HR ensures that the candidate is in the most comfortable state. It comprised of multiple telephonic interviews followed by the face to face interaction with the CEO.", "Interview Questions": "About yourself"}, {"date": "27 Dec 2018", "title": "Engagement Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Give (Guwahati) in Nov 2018", "Interview Descriptions": "The interview process was quite intense. It was thorough and friendly.  A very warm receiving of my experience and interests. An innovative perspective towards giving and good conversations with the team.", "Interview Questions": "Mostly about my previous work experience and how I would fit the role. Technical assignment was also given."}, {"date": "2 Sept 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Give (Bengaluru) in Aug 2018", "Interview Descriptions": "The interview began with an detailed discussions with HR mostly on resume and evaluation of personality based on  responses to specific questions. The second round was  by the reporting manager to assess  technical aspects , skills and expereince . The final toll gate was a brief ,short , meeting with the CEO .", "Interview Questions": "Skills and abiity to adapt in challenging / dynamic \r\nsituations"}, {"date": "3 Dec 2018", "title": "Relationship Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Give in Aug 2018", "Interview Descriptions": "Honestly, it didn't seem as if i were applying for a job in the social sector. The interview process was very similar to the ones that happen in the corporate sector.   \r\nWhen I shared my experience with my friends and colleagues, they too were surprised with the way the interviews were conducted. \r\nReally appreciate the level of professionalism and the effort which is put into the entire on-boarding process.", "Interview Questions": "The reason or the driving factor behind joining social sector?"}, {"date": "13 Jul 2018", "title": "Head - Non Profit Ecosystem Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Give (Bengaluru) in Jun 2018", "Interview Descriptions": "The interviews were conversations with 4 people from the team. Everyone was extremely warm and friendly. Questions asked were precise and on thoughts on managing the role. Each discussion lasted about an hour.", "Interview Questions": "Motivation to Join, Leadership style, Challenges from Past work experience."}, {"date": "10 Mar 2018", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Give (Bengaluru) in Mar 2018", "Interview Descriptions": "Consists of two rounds. First round on Aptitude, puzzle and all. Second round more about technical. Need to have good knowledge on Html, css, JavaScript. Interview process was good. Focused on more and more depth questions", "Interview Questions": "Bootstrap way"}, {"date": "4 Feb 2018", "title": "Donor Experience Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Give (Mumbai)", "Interview Descriptions": "I was called for interview by phone, first coo interview me then director was joined for interview. They confirmed the job and they have taken some two three test. Some confusion, HR person told me about final confirmation. There  was miscommunication between  management and HR. When I was called by coo and confirm back of offer.", "Interview Questions": "What is your current salary "}, {"date": "30 Oct 2018", "title": "SDE1 Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Give (Bengaluru) in Feb 2018", "Interview Descriptions": "Interview process went through stages. To start with HR screening to shortlisting my profile. Tele Interview was first done by Hr and then tech lead.  Face to face interview with tech lead. Finally, an offer was made.", "Interview Questions": "Basic question DSA, OS, DB, JS, HTML, and CSS"}, {"date": "5 Jun 2017", "title": "Senior Software Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at Give (Mumbai) in May 2017", "Interview Descriptions": "First they give you an assignment that you have to do from home, time limit for the task is 2-3 days which can be easily done. After that you have a telephonic round with CTO who asks about your background, the domain you have worked and currently working on, some technical questions on .NET & SQL. \r\n\r\nAfter clearing the telephonic round you will be called at their office for other rounds. There will be another technical F2F round with the CTO. After that a non-technical round with the COO and salary negotiation.\r\n\r\nBe clear about your salary expectation, don't give in to what they say. They cannot offer much salary like tech companies since they are a NGO. So they will offer try to lure you in with whatever your current salary is plus a little extra which is performance linked variable. But we all know what \"performance linked variable\" is ;)", "Interview Questions": "Basic .NET & SQL questions. Nothing out of the ordinary"}], [{"date": "8 Nov 2015", "title": "Junior Software Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Give (Mumbai) in Oct 2015", "Interview Descriptions": "Aptitude test followed by Interview the next day, In interview we were mainly quizzed about SQL and database. Most of the questions were application based ones. They varied from easy to difficult.\r\nI was quizzed about various keys, how to use them in e-commerce website, snowflake schema and how we implement it, etc.", "Interview Questions": "Basics about SQL"}, {"date": "23 Oct 2018", "title": "Junior Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Give (Mumbai) in Oct 2015", "Interview Descriptions": "The company had visited our campus for placements, wherein they gave a small pre-placement talk. Post this was an aptitude test which was mainly technical and related to the programming languages used in the organization. This was followed by 2 rounds of interview. 1st was a technical interview and second was an HR round.", "Interview Questions": "Code for mobile number textbox validation"}, {"date": "20 Dec 2016", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Give (Mumbai) in Mar 2015", "Interview Descriptions": "The whole of process was concluded within three days including the issuance of Job Offer.\r\nMy interview consisted of just two rounds, An online test from home pc(normal logical ability and psychometri,iq test). Then was scheduled for a telephonic round with the CTO whi actually is not a core tecchnical person. The overall difficulty was easy.", "Interview Questions": "Basic .net questions and Sql server questions."}, {"date": "18 Aug 2017", "title": "Head of Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Give (Mumbai) in Aug 2014", "Interview Descriptions": "It was done over a Skype call since I was based at a different location at the time of the interview. There were 2 rounds - one with the immediate reporting manager and the other with the CEO.", "Interview Questions": "Reasons for wanting to join the social sector, salary expectations, questions about my current role, etc."}, {"date": "2 Nov 2018", "title": "Senior UI Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Give (Gurgaon, Haryana) in Jan 2014", "Interview Descriptions": "Interview process is step by step mentioned below:\r\nHR round with IQ test\r\nTechnical round with manager\r\nSkill test on machine\r\nIf you qualify above these steps then salary negotiation with HR person and meeting with CEO", "Interview Questions": "They asked some questions and gave me a task that was related to my skills."}, {"date": "23 Aug 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Give (Mumbai) in Oct 2013", "Interview Descriptions": "Interview process went through stages. To start with HR screening to shortlisting my profile. Tele Interview was first done by Hr and then by CEO, Face to face interview with CEO, Test, and finally, offer was made", "Interview Questions": "Why do you want to join the Organization"}, {"date": "9 Sept 2014", "title": "Junior Software Developer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Give in Aug 2013", "Interview Descriptions": "1. Online technical aptitude test.\r\n2. Telephonic technical round with tech lead\r\n2. telephonic round with tech head. \r\n3. I.Q test at organization\r\n4. Final round (2-3 technical questions and salary negotiation) with CEO.\r\noverall process took 10 days.", "Interview Questions": "What is deadlock?\r\nWhat is inner join in sql?\r\nDifference between server.transfer and response.redirect?"}]]