[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Job I've ever had!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 May 2018", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "If you want to work at a place that is full of nice people and is making a real difference in the world- then CareMessage is the place for you! \r\n\r\nAwesome leadership- very approachable, humble and are eager to constantly learn, innovate and grow. Managers truly care about your personal well being as well as your professional development. \r\n\r\nGreat work/life balance. Option to WFH. \r\n\r\nChallenging work, but so rewarding. \r\n\r\nThe team works great together and has a real community feel. Which is pretty amazing being that half the team is remote. \r\n\r\nGreat benefits- commuter reimbursement, catered lunches and team outings!", "cons": "I honestly, can't think of one."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Please read all reviews from former employees before making a decision?", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Apr 2022", "job_title": "Account Executive in Atlanta, GA", "duration": "N/A", "pros": "Flexible work hours, Decsent pay, Chance to work with those who need it most.\r\nThere are great people here but they are not in charge!", "cons": "When I first looked into this company I was excited about making a difference in underserved communities. So I looked past the reviews here from Former employees. It did not take long to find out that every word was true. \r\nAfter a legnthy interview process that results in you leaving a stable enviorment to come to a very unstable one where you are seeing employees leave one after the other all saying it is because of the CEO who will not even allow the Managers to do their job and every word is negative. ( Almost like a child emporer who bullies because there is no oversite!) I found it true that the mission to help the underserved is a Facade when you can not even show common respect for those who are employed by you. I am not sure if there is a board are any oversite but the amount of turnover has to be a concern to someone! At least do a Parting Interview?\r\nTo those reading this, make sure you read all the comments from the Former employees? \r\nNot everyone is posting because they are disgruntle and current employees are too afraid to address any real issues on a platform like this!"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Startup with great potential and mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Dec 2017", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Good work-life balance, lots of bonding events like team dinners and volunteering\r\n\r\nMeaningful work, great mission\r\n\r\nNice, talented, and mission-driven coworkers. You can sense that people care about each other here\r\n\r\nVery inclusive culture, mindful of remote team members\r\n\r\nThe leadership is improving on communication and transparency\r\n\r\nCompany provides funding for professional development (books, tutorials, etc.)\r\n\r\nBroad responsibilities, allows you to develop different skillsets\r\n\r\nEncourages initiative and new ideas from all employees\r\n\r\nOn-site massage, yoga area promotes healthy lifestyles\r\n\r\nGreat work-from-home policy\r\n\r\nCatering twice a week! Delicious food, healthy snacks. Dietary restrictions not a problem", "cons": "Company infrastructure is still a work in progress. Things like long term career development and performance reviews are still improvised\r\n\r\nProjects have slowed as the company forms new teams, trains new hires\r\n\r\nDifficult to transfer between projects"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Don't be fooled by the positive reviews", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Jul 2019", "job_title": "Will Not Disclose in Remote, OR", "duration": "N/A", "pros": "The ability to work from home.", "cons": "The founder and co-founder do not care or value their employees. They have a high turnover rate. The founder is verbally abusive lacks communication skills, and if he doesn't like you he'll find any reason to get rid of you. The mission is amazing but the mission doesn't reflect the morals and values of the founder and co-founder. They lack direction, they don't care about the customers just about how much money is brought in. They only cater to companies that pay the most. Everyone else's feedback is dismissed and if the feedback doesn't meet the product teams vision, then it's not going to happen. There is no work-life balance you end up working 10-12 hr days. There is no organization or proper training, lack of resources. There is so many cons that I can't list them all. Don't be fooled by all of the positive reviews. They told their currrnt employees to write positive reviews in order to make them look better because the rating here was really low."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Mission-driven with thoughtful, caring leadership and hard-working team", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Feb 2018", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "CareMessage is truly mission-driven. It feels good to know that our hard work goes toward helping real people, and often the people most in need of help. Coming into work each day is easy when you know the impact you're having on real lives.\r\n\r\nThe team here is hard-working, thoughtful, and mature. We trust each other, and that shows in the support and thoughtfulness around the strong remote-work culture. The team is still relatively small and growing at the right pace, and we stretch ourselves to achieve big results.\r\n\r\nI admire the senior leadership's care and concern they have for all aspects of the business, whether it is culture, employee happiness and growth, managing a healthy budget, or building the best product possible. We have already implemented solutions or are thinking ahead about the problems that arise as a company scales, and it's good to see the thoughtfulness there. The business itself is very healthy with good growth, strong customer retainment, and a solid balance sheet. We also have a supportive, experienced, compassionate Board of Directors.\r\n\r\nFor my own role, I have never felt quite as empowered, trusted, and supported, and I feel as if I'm relishing in that and growing all the time. We worked hard on ensuring a good alignment before I joined, and that has paid off in the time I've been here.\r\n\r\nPractically speaking, the compensation is on the generous side of fair, the office benefits are satisfactory in the general tech world and excellent when looking at the broader job market (we are technically a non-profit, so are judicial with our funds), the work-life balance is healthy, the office is spacious and comfortable and in an amazing location.", "cons": "I don't have many cons to say, so these are a bit of a reach, but I would note that the office can feel a bit quiet at times with several employees being remote-based and other folks being rather heads-down and focused on work, and perhaps slightly introverted. I do think this will continue changing as we hire more people and the energy livens up a bit. This may not be a \"con\" as it's easy to focus, but at times I do crave a bit more of a buzz and interpersonal engagement around the office — of course, we can all do our part to improve this, including me.\r\n\r\nWe have a few talent gaps in the team currently, but are working on filling them actively. This shows as a \"con\" in the meantime as some folks are spread a bit thin, but the company does recognize that and is working to address it.\r\n\r\nFinally, we are technically a non-profit, which has certain limitations (e.g. there are no stock option incentives). This can be a con in some regards, but I feel that the salaries are strong enough to make up for that, and the company is truly run as a tech startup at its core, so you wouldn't really know we're a non-profit."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "LOL (Lack of Leadership)", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Mar 2019", "job_title": "Non-Leadership Role in San Francisco, CA", "duration": "N/A", "pros": "CareMessage is laughable at best. The lack comes from the top down.  There is a lack of leadership, a lack of communication, and a lack of culture. This is just the beginning of where the lack begins. However, there is not a lack of ego, narcissism, and immaturity that blankets the culture of CM like a cheap blanket. The executive team consists of a clique of several bodies with one head.  It is this narrow, shared group thought that will be the ultimately be the downfall of CareMessage.  With that being said, everyone on the executive team knows their part and how to play the role. Do not say too much or disagree with the founder or co-founder. When the company knowledge is limited to a few key players there is no room for growth and development and eventual failure. \r\n\r\nThe mission of CM is “CareMessage is a nonprofit organization whose mission is to empower healthcare organizations with mobile technologies to improve health outcomes and reduce the cost of care.”  CareMessage has prided itself on its mission and vision. CM uses this to pull on the heartstrings of its customers, donors, philanthropist, and employees. \r\n\r\nThis mission is what has and continues to bring potential employees in for interviews.  As you begin to read this post, I want you to write down the “WHY” you want to work for CareMessage. The “WHY” is very important and can save you a lot of wasted time, energy, anger, frustration, disappointment, but most importantly your sanity and sense of self.  If you believe in the mission and the story CareMessage tells I understand why this may have you considering CM as a viable work option.  However, you may be one of the few (everyone else has left or been fired) who truly understand and believe in the mission including the founder and co-founder. If it is the warm and fuzzy pictures on Glassdoor do not be fooled. Be sure to ask in your interview how many of those people are still employees of CareMessage.  \r\n\r\nIf you are looking for a paycheck with an opportunity to learn what not to do come on board. In addition, you will receive no professional development, recognition, or opportunity to grow.  Sorry, those positions are already filled. \r\n\r\n\r\nPros:\r\n1.    Remote friendly. Although it can still be intrusive as people are not considerate and mindful of other people’s schedule, priorities, and time zones.  \r\n2.    There are some smart and talented people at CM who actually believe in the mission even if they don’t understand the mission.", "cons": "Cons:  What CM will not do:\r\n1.    Respect or value employees \r\n2.    Reward/promote hard working staff with praises and raises\r\n3.    Make sound decisions that aren’t personal\r\n4.    Respect and appreciate experience and skills without being intimidated\r\n5.    Provide a safe environment for employees to feel safe, secure, and heard\r\n\r\nIf these are things you can live with then, Welcome to CareMessage."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": "N/A", "review_title": "Toxic work environment caused by upper management and CEO", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Feb 2018", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "-Flexible work schedule\r\n-Talented co-workers\r\n-Many opportunities for learning", "cons": "-True creativity, innovation and independence are not encouraged, appreciated or rewarded.\r\n-Toxic work environment created by upper management and CEO, and nurtured by executive leads and managers.\r\n-Culture of micromanagement and fear.\r\n-Arrogant and inexperienced CEO and upper management. They are not open to feedback and fire or punish people who disagree with them or voice opinions contrary to theirs. Most managers and directors lack management experience and are sycophantic. Other people in senior executive positions who may be more experienced are there only because they don’t challenge upper management.\r\n-In my experience, promotions aren’t based on past results and performance, but on how well you are liked by upper management (i.e., if you are their friend or don’t disagree with them.)\r\n-Fluid staffing structure and changes are understandable given that CareMessage is a startup, but, when I was there, there was a high turnover rate that was not adequately addressed by executive leads or managers. This lead to way too frequent team restructuring, rushed organizational changes and low employee morale.\r\n-Harsh firing practices and lack of transparency in hiring pipeline.\r\n-Upper management tries to make up for toxic culture with perks such as snacks, catered food, and team events that almost nobody wants to go to. A good dose of acknowledgement and empathy will go a far longer way than all those perks combined.\r\n-Lack of clear company vision due to zero leadership from CEO. When I was there, the direction of the company changed every quarter.\r\n-In my opinion, the company has lost touch with its mission by heavily pushing for profits in an effort to become ‘self-sustained.’ \r\n\r\nFor me, the flexible work arrangement and possibility of working remotely were by far the best things about working in CareMessage. The noble inspiration of working for a mission-driven company dissipated once I realized that people who are running the company are so arrogant and self-absorbed that they cannot truly embody the empathy required to help improve people’s health, which is a the core of the organization’s mission. This is such a shame because I truly enjoyed the work that I did there.\r\n\r\nThis disillusionment also carried through when I witnessed the leadership’s lack of empathy for employees. For the most part, employees are considered to be expenses rather than assets, and there is little concern for their well-being. If someone is liked (and by that I mean they are friendly with the bosses) they are rewarded and praised; if they aren’t liked for whatever reason, probably having nothing to do with work performance, they are disparaged and criticized. Experiencing any kind of satisfaction while working there, in my experience, is only an option when not speaking up against the broken culture and management style; not bringing up innovative ideas or making decisions within one’s scope that upper management doesn’t approve of first; and staying away from the mess as much as possible (if at all possible)."}], [], []]