[[{"date": "15 Jul 2023", "title": "Experiences Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust", "Interview Descriptions": "Carousel of activities such as working in a group to solve a puzzle/escape room style activity and creating a poster. Also had to do a spontaneous discussion activity describing a random topic.", "Interview Questions": "No formal questions in this interview"}, {"date": "15 Jul 2023", "title": "Food and Beverage Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust (London, England) in Jul 2023", "Interview Descriptions": "Initially there was a telephone screening call where the hiring manager asked my availability and why I wanted to work for the National Trust, and I was contacted within 2 days for an interview. It was a strength-based interview. I applied for the food and beverage assistant role in a cafe area. Overall the interview experience was a very positive and friendly one. I was interviewed by 2 managers.", "Interview Questions": "Why work for the National Trust? What are your hobbies and why do you like them? Demonstrate a time when you have handled a difficult situation and how you went about this. If you had a coworker who you didn't get along with, what would you do and why? Give an example of when you have worked in a team?"}, {"date": "11 Jun 2023", "title": "Welcome and Service Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust (Shere, England) in May 2023", "Interview Descriptions": "Very interesting and thorough application process. They have a survey that you fill out to give them a thorough idea of who you are, how you work and what you like. It was really quite enjoyable to fill in (coming from someone who's filled in 45+ prior applications). Unfortunately I have yet to hear back from them. I don't know if they confirm with you whether you've been considered or not, but I will assume if I don't hear from them, that I've not been chosen.", "Interview Questions": "1. If you were running late for your shift, and knew you still had preparations to make before the site opened, but you were approached by a visitor outside and asked questions, what would you do? (multiple choice) 2. You overhear some visitors discussing a trip to another site in an area you aren't familiar with, but Benjamin, who is also standing nearby, is a local from that area. What do you do? (multiple choice)"}, {"date": "13 Mar 2023", "title": "Collections Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The National Trust (Warwick, West Midlands, England) in Mar 2023", "Interview Descriptions": "Firstly, you are introduced to another candidate for the same role and left alone together while the final interview preparations are made. You two will meet several times during the process as there were three stages to the interview: a tour of the property, an object handling exercise and a sit down interview. For entry level positions, such as this one, the NT now does not use CVs or cover letters. They are employing a \"strengths based interview\" so be forewarned that the interviewers will know absolutely nothing about you or your background. The answers to the questions can from from any aspect of your life, not strictly from you previous experience. Ultimately, I was not offered the job because I was \"overqualified\" and had \"too much\" experience leading the representative to assume that I had \"no idea what the job entailed\". Distressing .", "Interview Questions": "What is a project you worked on which inspired you? Questions about prioritising visitors, basic and sensible object handling."}, {"date": "2 Mar 2023", "title": "Visitor Experience Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The National Trust", "Interview Descriptions": "Group interview that had multiple rounds of discussion including a 2 minute timed talk on a topic of your choice. Focus on teamwork and listening skills demonstrated through completion of tasks.", "Interview Questions": "Demonstrate a time when you have handled a difficult situation and how you went about this."}, {"date": "29 Apr 2023", "title": "Collections and House Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The National Trust (London, England) in Mar 2023", "Interview Descriptions": "The questions were straightforward, a series of twelve single part questions and a scenario that you were able to write down your response and think through before responding to the question", "Interview Questions": "How would you create a risk assessment for an exhibition."}, {"date": "27 Feb 2023", "title": "Welcome and Service Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The National Trust", "Interview Descriptions": "Applied online with a cover letter and CV and was invited via email to interview. Interviewed with two very friendly employees. It was an atmosphere and no tricky questions. Helps to do research about the National Trust beforehand.", "Interview Questions": "What do you know about the National Trust?"}, {"date": "3 Feb 2023", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The National Trust", "Interview Descriptions": "The interview process was simple, had to apply online, then had to complete an online scenario assessment, which gave feedback on what my best strengths and weaknesses were. Passing that I then had a face-to-face interview which was relaxed and asked for examples of my strengths.", "Interview Questions": "give an example of a time you worked effectively with a team?"}, {"date": "31 Jan 2023", "title": "Visitor Welcome Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The National Trust", "Interview Descriptions": "A 20 minute interview with 2 managers. Standard interview questions, examples of good customer service, what would you do in this scenario etc . Helped to have done research on The National Trust. Quite relaxed overall.", "Interview Questions": "If someone came and told you the pay machine in the car park wasn’t working what would you do?"}, {"date": "27 Jan 2023", "title": "Project Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust (Swindon, Wiltshire, South West England, England) in Jan 2023", "Interview Descriptions": "Invited to interview in Swindon. Fairly standard interview questions plus a financial literacy task to do. Two people interviewed me, both very friendly and professional. I found out a lot about the job and team and was able to ask lots of questions about the project.", "Interview Questions": "Tell us a time you had to track and manage financial details as part of a project."}], [{"date": "21 May 2023", "title": "Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The National Trust (Belfast, Northern Ireland) in Nov 2022", "Interview Descriptions": "Outdated process, very intimidating. Wording questions in a way that is only suited to internal candidates with terminology and working knowledge of the day to day of the business which would confuse anyone", "Interview Questions": "What order would you do this in"}, {"date": "20 Aug 2022", "title": "Retail Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust", "Interview Descriptions": "It was the most comfortable group interview I have ever done. It took place in a lovely annex space with drinks available. The 2 senior management members were lovely and welcoming. 3 different activities took place. Role play, creative ideation and then identifying priorities in the working day.", "Interview Questions": "Choose a role i.e a student and as a welcome team member how would you sell a membership to this individual?"}, {"date": "20 Aug 2022", "title": "Chef Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The National Trust", "Interview Descriptions": "Great, comfortable and streamline interview process. Made to feel welcome and encouraged that the job was for me. Lovely company to work for and place to work. Highly recommend if looking for a role at a recognised company", "Interview Questions": " thorough to find out skillset "}, {"date": "1 Aug 2022", "title": "Food and Beverage Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The National Trust", "Interview Descriptions": "Informal chat with the manager in one of the food and drinks outlets on site. Friendly manner. Checked my food and hygiene certificates etc. Asked general customer service questions. Knowledge about the Charity.", "Interview Questions": "Working rotas are different each week based on the availability of staff and events at the property . Will you be able to fit into this working pattern? (Actual phrasing might have been slightly different -but this was the gist of it)."}, {"date": "26 Jul 2022", "title": "Assistant Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The National Trust", "Interview Descriptions": "Panel of 2 online, some questions didn’t seem relevant to the role description and seemed aimed at a much lower grade. Didn’t ask any technical questions - seem obsessed with the management of email.", "Interview Questions": "What would you do if someone was having problems dealing with all incoming emails. "}, {"date": "13 Jun 2022", "title": "Conservation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The National Trust", "Interview Descriptions": "Process took about 2 weeks, at the interview I had a tour of the property followed by a basic health and safety exercise, and 30 minute formal interview which included a object handling exercise", "Interview Questions": "How do you work differently when working in a team compared to working on your own?"}, {"date": "6 Jul 2022", "title": "Retail Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust (Wolverhampton, England) in Jun 2022", "Interview Descriptions": "I did not get a job offer in the end so asked for the reasoning/any feedback to aid me in future applications and interviews, and they did not get back to me which was disappointing. However, the interview it’s self was ran by very friendly people that phrased questions in a very simple and open way, they also catered to me by having my interview virtually on teams due to covid which was very helpful.", "Interview Questions": "Name a time where you had good repoire with a customer "}, {"date": "12 May 2022", "title": "Collections Care Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust (Exeter, England) in May 2022", "Interview Descriptions": "A tour of the property was followed by a 30-minute interview and an object a short handling test which consisted of 3 objects from the property's collection. The interview was conducted by two people, both from the collections department.", "Interview Questions": "Give an example of when you used your initiative. "}, {"date": "7 Apr 2022", "title": "Visitor and Membership Welcome Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The National Trust", "Interview Descriptions": "I had a really great interview experience at Stowe. I was interviewed by two members of staff who were both super friendly. They asked me why I wanted to work at Stowe, my experience with the national trust, the importance of the national trust, and typical personal interview questions.", "Interview Questions": "Why do you think the National Trust is important?"}, {"date": "29 Nov 2022", "title": "Visitor Experience Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust (Grantham, England) in Apr 2022", "Interview Descriptions": "Two person panel, very friendly interview where I was made to feel at ease although with some tough exercises and questions. Before the interview was asked to access the visitor experience for people when the first arrived at the property and suggest improvements.", "Interview Questions": "What have you done in your life that you are the most proud of?"}], [{"date": "15 Mar 2022", "title": "Welcome and Service Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust", "Interview Descriptions": "Over the top, formal interview for a temporary,  minimum wage car parking job. The interview consisted of two interviewers taking it in turns to ask lots of lots of questions like: \"What positive impact can you individually make on the National Trust while working for us?\". Yet not once did they ask a bit about me or why I wanted the job.", "Interview Questions": "What positive impact can you individually make on the National Trust while working for us?"}, {"date": "16 Aug 2022", "title": "Service Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The National Trust in Mar 2022", "Interview Descriptions": "Group interview with other candidates interviewing for the same job role as well as other roles at the property. The interview was definitely an enjoyable experience so long as you knew a bit of background information about the National Trust and the property you are applying at.", "Interview Questions": "Important aspects of customer service "}, {"date": "10 Feb 2022", "title": "Welcome and Service Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The National Trust", "Interview Descriptions": "You have to submit a simple application for with your CV and cover letter. If successful at this stage you will then be invited for an interview with the managers.", "Interview Questions": "What do you know about working with volunteers?\r\nWhat do you know about the National Trust?\r\nWould you consider working at any of the other local National Trust sites?"}, {"date": "9 Feb 2022", "title": "Gift Shop Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The National Trust", "Interview Descriptions": "Group interview. Everyone split into groups of four and took it in turns to do different tasks and act out various situations. It seemed very over the top for a part time  job of 10 to 16 hours per week", "Interview Questions": "What kind of animal would you be and why?"}, {"date": "26 Feb 2022", "title": "Business Support Services Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The National Trust (South Harting, England) in Feb 2022", "Interview Descriptions": "Application on the National Trust portal.\r\n4 weeks process from application to interview.\r\n1 week for the interview outcome.\r\nThe team at Uppark House and Garden were welcoming, the interview was well structured and it seemed a really nice place to work.", "Interview Questions": "Describe an experience of good customer service and what it means to you."}, {"date": "30 Dec 2021", "title": "Food and Beverage Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The National Trust", "Interview Descriptions": "Very easygoing. Interviewer put me at ease and did not try to catch my out with difficult questions which I appreciated given that it was a food and beverage assistant role", "Interview Questions": "When can you start work"}, {"date": "29 Nov 2021", "title": "Parking Attendant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The National Trust", "Interview Descriptions": "Bizarrely thorough, verging on over the top for essentially a minimum wage weekend casual job directing cars in a car park for a couple of hours each week. Two person panel for a 45 minute formal interview.", "Interview Questions": "Describe a time when you've had to balance complex competing demands under pressure?"}, {"date": "20 Nov 2021", "title": "Food & Bevrages Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The National Trust", "Interview Descriptions": "This was a face to face interview in person, with 2 interviewers. Casual, sat in the restaurant. The interview lasted around 20 minutes, with about seven  questions. They asked about experience of good and bad customer service that I had received.", "Interview Questions": "what do you know about the National Trust? \r\nTell us about a time you experienced excellent customer service? "}, {"date": "13 Oct 2021", "title": "Visitor Welcome Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust (Belfast, Northern Ireland) in Oct 2021", "Interview Descriptions": "Online due to Covid, the interviewers were very pleasant. It was a general chat about previous experience and what I could contribute to the team. Heard back the following day.", "Interview Questions": "What characteristics do you have that make you a good team member, and when have you displayed these?"}, {"date": "25 Aug 2021", "title": "Waitress Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The National Trust", "Interview Descriptions": "Quick and simple very easy to do explained everything carefully good job and a good role enjoyed the interview very much so very good interviewer was very well presented and kind", "Interview Questions": "How many years have you been waitressing "}], [{"date": "14 Oct 2021", "title": "Food and Beverage Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The National Trust in Jul 2021", "Interview Descriptions": "Applied online with easy application and CV. The interview was in the form of an informal chat with pre-selected questions. Questions varied from personal experience-based to mock situation questions. The manager and Team Lead in the interview were very kind, setting a welcoming tone.", "Interview Questions": "Tell me about a time when you received great customer service?"}, {"date": "29 Dec 2022", "title": "Learning and Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The National Trust in Jul 2021", "Interview Descriptions": "Kind, fair and a lovely call afterwards to give very measured and specific feedback - I didn't get the role but was super impressed with the care and attention they took.", "Interview Questions": "What kind of coaching environment did you create?"}, {"date": "18 Jun 2021", "title": "Food and Beverage Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The National Trust", "Interview Descriptions": "It was a pretty relaxed interview with some typical interview questions and then some questions about your availability etc. It was held over zoom. It lasted about 30 minutes in total", "Interview Questions": "Do you agree with the philosophy the customer is always right?"}, {"date": "14 Jun 2021", "title": "Business Support Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The National Trust in Jun 2021", "Interview Descriptions": "Applied online (CV, Cover Letter and some questions to answer), received an interview, showed up on the day. The room was sat so we were sat at either ends of the room, they went through a list of 10 or so questions, and recorded everything down, had 2 people asking questions; they took it in turns to ask the questions but they both recorded the answers I gave.", "Interview Questions": "What was your last role?"}, {"date": "21 May 2021", "title": "Barista Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust (Newcastle upon Tyne, England) in May 2021", "Interview Descriptions": "Started with application being sent off, then got an email for the time and necessary information of the interview. On the day, got onto the video call site they requested and then they proceeded after a brief introduction to therefore ask questions to find out what I know about the job.", "Interview Questions": "What do you know about the National Trust?"}, {"date": "8 Apr 2021", "title": "Food and Beverage Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust (Dover, England) in Apr 2021", "Interview Descriptions": "Interview lasted around  10mins, was pretty easy, mostly questions on what would you do if and tell me a time you did excellent customer service type questions.  Was told I would get a phone call but no one phoned to let me know I was unsuccessful.", "Interview Questions": "Tell me about a time you delivered good customer service?"}, {"date": "23 Jan 2023", "title": "Visitor Services Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust (Lewes, England) in Apr 2021", "Interview Descriptions": "Two person panel interview Situation based questions Questions re the NT's history and values Friendly staff Made welcome Time to ask questions Quite thorough questions, have examples prepared Learn about the place you are applying for in advance", "Interview Questions": "Give us an example of a time when you demonstrated outstanding customer service"}, {"date": "12 Mar 2021", "title": "Interpretation Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The National Trust", "Interview Descriptions": "Group activities, no individual interview, very chilled. Activity on the property itself so best to do some research. Think they just wanted to see how you engaged with others and how well you understood visitor habits.", "Interview Questions": "Come up with an activity based on an object."}, {"date": "14 Jul 2021", "title": "Visitor Attractions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The National Trust in Mar 2021", "Interview Descriptions": "Generic interview, very impersonal as questions were taken from a template. Answers written down but no interest in you as a person. Many questions totally unsuited to the job role. A very cold and demeaning process. Despite stating not a corporate company they totally want corporate answers. NT are no longer giving each place a 'personality' and want each place to be exactly the same with a corporate outlook but they don't seem to understand what the word means.  I left the interview knowing I would not accept the job and that it had already been allocated to an internal candidate which was obvious from the moment I arrived and the closing comments- the panel were not engaging and not particularly interested. They already knew they would not be working with me.", "Interview Questions": "There have been many changes in NT and many people are in roles that they did not necessary plan and change has been difficult. How would you deal with that? (This was not a management role so totally in appropriate question that just portrayed how unhappy the staff are at this venue)."}, {"date": "2 Mar 2021", "title": "Food and Beverage Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The National Trust", "Interview Descriptions": "Discussion with the manager about the role and my previous experience, then a few standard questions asking what I would do in certain situations. I then had the chance to ask questions about the role.", "Interview Questions": "How would you deal with an upset customer?"}], [{"date": "16 Feb 2021", "title": "Assistant Content Producer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The National Trust", "Interview Descriptions": "Was called in for an interview which was friendly and relaxed with two people, and had to complete a couple of writing tasks in about 30 mins. Everyone was really welcoming and friendly.", "Interview Questions": "Tell us about your relevant experience."}, {"date": "17 Dec 2020", "title": "Digital Designer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust", "Interview Descriptions": "Very welcoming.  Good preparation, clear and well thought through. All the interviewers worked well to create a calming and reassuring atmosphere, which is helpful to allow you to get the best out of the interview.", "Interview Questions": "To start by just talking about my not my career. "}, {"date": "25 Nov 2020", "title": "Food and Beverage Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at The National Trust", "Interview Descriptions": "Really quick and easy applied on line, phone call with supervisor the proceeded to have an interview in person with the supervisor and manager of the food and beverage sector", "Interview Questions": "What the national trust was"}, {"date": "6 Oct 2020", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The National Trust", "Interview Descriptions": "Consisted of a formal presentation and then a set of questions.\r\nPresentation based on communication styles, and dealing with volunteer role changes. Who else would you involve? The interview itself had structured questions, panel often interpreting them as desired. I wasn't made to feel relaxed, and the interview went on for over an hour and a half.", "Interview Questions": "-What is your managerial approach? How would you effectively manage volunteers?\r\n-What do you think of the current volunteering recruitment processes?\r\n-What would you do if a volunteer didn't show up?\r\n-How would you manage difficult behaviour of a volunteer.\r\n-What personal training and development have you completed? How are you working to better yourself?"}, {"date": "9 Aug 2020", "title": "Student Helper Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The National Trust", "Interview Descriptions": "They were nice and friendly. I was looking to volunteer in a Stately Home for my history degree and the interviewer was very flexible with timings and keen to have me as part of the team.", "Interview Questions": "Would you like this job?"}, {"date": "18 May 2021", "title": "Chair/NED/Trustee Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at The National Trust (London, England) in Apr 2020", "Interview Descriptions": "I was contacted out of the blue by a headhunter who had been recommended to talk to me about this role - i shared CV and we had a verbal deep dive which showed a good fit and they wanted to put me on short list. However on assessment of timescales it became clear i would not be able to be released from current government contracted role in time so by mutual agreement i pulled out before final panel", "Interview Questions": "Content knowledge re investment and climate change"}, {"date": "10 Mar 2020", "title": "Visitor Welcome Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The National Trust (Dunstable, England) in Mar 2020", "Interview Descriptions": "Online application, interview assessment centre type.\r\n6 people interviewing at same time, 4 assessors. \r\nFirst task to each describe a quarter of an image to the rest of the group who had to attempt to draw based on your description. Then asked 2-3 questions based on the task.\r\nSecond task individual interviews, all in same room, asking same questions. Given a warm up question of 'tell me about your hobbies outside of work', then asked 6 questions.\r\nThird task we were given a booklet of challenges such as draw an envelope without taking your pen off the page, answer these riddles, name as many names and animals beginning with L, sudoku, build the tallest tower you can out of cups, write down all the blue objects in the jar. There was only ten minutes to do all these so they wanted to see how you would fare when presented with an impossible amount of challenges to complete in the given time.", "Interview Questions": "How did you contribute to the task?"}, {"date": "5 Mar 2020", "title": "Assistant Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The National Trust (Newcastle upon Tyne, England) in Mar 2020", "Interview Descriptions": "Interview process quite straight forward, but the distinct impression I got was that they already had someone in mind. \r\nAsked me to bring evidence of being a uk citizen - they didn’t ask me for this at interview.\r\nI was asked if they could email me instead of phoning me - never have I experienced this before. \r\nSeemed a bit board when answering questions.", "Interview Questions": "Describe how you would handle a complaint. "}, {"date": "27 Aug 2021", "title": "Member & Visitor Welcome Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust in Mar 2020", "Interview Descriptions": "I applied online and was invited to a group interview.  During the interview we started with a short tour of the site, and then back to the office for some team activities. The activities were things such as writing down as much information as we could about the National Trust.", "Interview Questions": "Team activities and questions.\n- Firstly we had to chat with the person next to us, and after a few moments we had to tell the rest of the group their name and something interesting about them.\n- Our knowledge of the National Trust was tested as well as knowledge of the history of the specific site we were appyling to work at."}, {"date": "10 Feb 2020", "title": "Retail Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The National Trust (Worksop, England) in Feb 2020", "Interview Descriptions": "Online Application. \r\nTook a week for a response,  I was then interviewed it was a waste of my time, do not apply if you are a young person as you will not have a chance. Unfortunately, this trust is\r\nonly interested in older candidates.", "Interview Questions": "Customer service questions "}], [{"date": "2 Mar 2020", "title": "Finance Business Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust (Alcester, England) in Jan 2020", "Interview Descriptions": "(Prior to application deadline there was an informal 'drop-in' opportunity at an NT property to meet the Senior Finance Business Partner and some of the staff, and to find out more about the role.)  If the application was accepted, there was an initial telephone interview with Senior Finance Business Partner.  Then,  if successful,  there was a half-day assessment process at NT regional office, consisting of role-play and problem-solving.", "Interview Questions": "What mistakes have you made in your career?"}, {"date": "10 Mar 2020", "title": "Conservation Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at The National Trust in Dec 2019", "Interview Descriptions": "Only one day/time option was given for the interview at short notice, so not very accomodating to those who already have jobs or caring responsibilities. I have been invited to interview at the NT once before but was not able to make the interview and not given another chance despite no date/time being listed on the job advert.\r\n\r\nThe interview consisted of ten questions that were specific to the role. They were based on my skills and previous experience, as well as some behaviour questions like 'what would you do in this situation..' or to give examples of good teamwork.\r\n\r\nI had previously volunteered at the site for almost a year and a half, so the interviewers knew me. However, they didn't seem that interested in what I had to say and didn't seem to know much about my previous experience.\r\n\r\nThey checked my passport; I was also asked to bring degree certificates which I offered but they did not check them.\r\n\r\nI was emailed the next day with the decision. Later I found out the position was offered to another volunteer. If the interviewers already had someone in mind for the position, it is very unfair to waste people's time in applying.", "Interview Questions": "What attracted you to the role?"}, {"date": "27 Oct 2019", "title": "Food and Beverage Team Member Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust", "Interview Descriptions": "Online application with questions then a group interview with several irrelevant group tasks. There was ice-breaker questions (two truths and a lie) then we had to build a bridge out of straws and name things that made good customer service.", "Interview Questions": "N/A"}, {"date": "4 Dec 2019", "title": "Environmental Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The National Trust (Swindon, Wiltshire, South West England, England) in Sept 2019", "Interview Descriptions": "Online application through National Trust jobs website. Confirmation of interview details by email.  Blind computer/mathematics exercise before presentation of results during face to face interview. The exercise was at least undergraduate mathematics degree level. Face to face interview at head office was with three people; the direct line management, another departmental manager and head of the division.", "Interview Questions": "Why do you want to work for the National Trust and what do you know about the organisation?"}, {"date": "13 Aug 2019", "title": "Customer Journey Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at The National Trust", "Interview Descriptions": "Applied in February and the had a telephone interview with hiring manager in July. Went through to assessment centre mid July. Problem solving and leadership exercises. Then top 4 were taken through for 1:1 and presentation", "Interview Questions": "What are key drivers for customers and how would bring this to life for teams."}, {"date": "27 Aug 2019", "title": "HR&Payroll Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The National Trust (Swindon, Wiltshire, South West England, England) in Aug 2019", "Interview Descriptions": "Easy questions. The interview lasted for 20mins. Not sure what they are looking for.", "Interview Questions": "Competency based"}, {"date": "14 Aug 2019", "title": "Operations Manager Lytes Cary Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust (Somerton, East of England, England) in Aug 2019", "Interview Descriptions": "Totally over the top!  Five hours long for an 8 month temporary contract suggests a level of arrogance that you don't often see in the charity sector.  Required to lead a skills session, deliver a presentation, interpret a set of accounts, have a walk round teh garden with a volunteer and have an interview.  Interview was conducted by two people - both had the poorest body language ) crossed arms and legs and the HR rep wore a scowl throughout.   A real sense that this was a waste of  time for us all.", "Interview Questions": "Perhaps I'm out of touch but the interview was like an obstacle race probably dreamt up by a bright-spark in HR.  Not just about providing an answer to a list of standardised questions (yawn) but also having to do so quickly.  Perhaps the NT needs to invest in a Countdown clock?   They hadn't seen CV's - we were told not to assume they knew anything about our background.  "}, {"date": "25 Jul 2019", "title": "Low Carbon Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust (Swindon, Wiltshire, South West England, England) in Jun 2019", "Interview Descriptions": "Interview consisted of a 10 min presentation followed by answering a series of competency questions.\r\n\r\nThe interviewers were friendly but at times it seemed they had not read my application e.g. they did not seem to know where I was based currently.\r\n\r\nI was told I had been unsuccessful by email (no call) and did not receive any feedback on my application or presentation which was quite disappointing.", "Interview Questions": "Series of competency questions on dealing with conflict, gaining internal buy in etc."}, {"date": "4 Apr 2023", "title": "Catering Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The National Trust (Montacute, England) in Jun 2019", "Interview Descriptions": "Interview conducted in person on location, asked standard questions from a list they had. Lasted approximately 20 minutes and received call of job offer a couple of days after. Basic procedure for a catering assistant roll.", "Interview Questions": "Why do you want to work for us?"}, {"date": "1 Jul 2019", "title": "Estates Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust (Derby, England) in May 2019", "Interview Descriptions": "Well organised and a warm welcome.  The interviewers were warm and informative.\r\nThe interview was held by 2 Estates managers who told me about the role and gave good background information about the role. They steered the interview back on track when it went slightly off tangent and i felt comfortable during the interview.", "Interview Questions": "Tell us about any experience of coaching that you have and how you would bring it to this role?"}], [{"date": "11 Apr 2019", "title": "Working Holiday Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The National Trust (Birmingham, England)", "Interview Descriptions": "Full assessment day - it is a volunteer role, but you are responsible for a group of 12 adults for a week. Day consisted of interview, team building exercise, interaction with others, trust exercise, presentation and a written planning exercise.", "Interview Questions": "How you have coped/ reacted in an unpredictable stressful situation"}, {"date": "12 Feb 2019", "title": "Commercial and Visitor Experience Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust (London, England)", "Interview Descriptions": "Fairly formal interview with two members of staff from the property following what seemed to be quite a structured, one size fits all framework followed by a written excercise describing a hypothetical situation", "Interview Questions": "Give an example of a time you have worked collaboratively with other members of staff"}, {"date": "4 Jun 2021", "title": "Membership & Visitor Welcome Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust (Newtownards, Northern Ireland) in Feb 2019", "Interview Descriptions": "Application form submitted online - invited to a  group team interview a few weeks later. Team interview well organised - approx 40 attendees or so.  Broken down into groups of 6 to carry out the various activities / questions.", "Interview Questions": "What are your strengths and how would you apply these to this position?"}, {"date": "27 Feb 2021", "title": "Food and Beverage Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The National Trust (Dorking, England) in Feb 2019", "Interview Descriptions": "Was a relaxed interview where they asked about any previous experiences and times when you had worked in a team. There was no group work and it was quite easy. I would go knowing the basics of making coffees and serving customers.", "Interview Questions": "Why do you want to work for the national trust?"}, {"date": "22 Feb 2019", "title": "Shop Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The National Trust (Wakefield, England) in Feb 2019", "Interview Descriptions": "Weird. Not like any interview I've had with commercial retailers. Did not ask the relevant questions for the job. Get the feeling they are not as results driven as the high street and feel that a confident and knowledgeable attitude is seen as aggressive. Other well known retailers have appreciated this as a passionate approach to getting the job done.", "Interview Questions": "To look at some figures and remark after 30 mins."}, {"date": "6 Dec 2018", "title": "Visitor Experience Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust (Durham, England) in Dec 2018", "Interview Descriptions": "Easy online application.  Phone call a couple of days after closing date offering me interview with two weeks notice. Asked to prepare a presentation and allow two hours for interview.", "Interview Questions": "N/A"}, {"date": "9 Oct 2020", "title": "Active Outdoors Development Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust (Poole, England) in Oct 2018", "Interview Descriptions": "Completed an cover letter when applying. \r\nHad a general 1:1 interview with a member of the team\r\nFollowed by an interview with 2 other members of the team, including the line manager for the role.", "Interview Questions": "What would I bring to the role?"}, {"date": "16 Sept 2018", "title": "Visitor Services Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The National Trust (Bristol, England) in Sept 2018", "Interview Descriptions": "Interview was with two people in a panel. Taken to a room and was asked questions based on relevant skills. Interview lasted about 30 mins and was quite relaxed.", "Interview Questions": "Experience "}, {"date": "21 Jul 2022", "title": "Food and Beverage Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The National Trust (Ripon, England) in Aug 2018", "Interview Descriptions": "Informal interview at a table in the coffee shop, asking questions about my CV, and what I'd bring to the job.  Also had to explain how I'd contribute to the values of the National Trust.", "Interview Questions": "'Can you describe a time you received good service?'"}, {"date": "27 Jun 2018", "title": "Philanthropy Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust (Swindon, Wiltshire, South West England, England) in Jun 2018", "Interview Descriptions": "Applied online, very simple application. The task was to write a letter (scenario and laptop provided), then interview with two people for about an hour, and after that, meeting the team. It was very friendly.", "Interview Questions": "Q: Describe a time when you received criticism and how you responded.\r\nQ: Tell us about a time you requested  and received  a four or five figure donation"}], [{"date": "6 Mar 2019", "title": "Retail Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The National Trust in May 2018", "Interview Descriptions": "I was already doing the job as described in the advert so thought I'd go for it to try and boost my pay slightly (very slightly). Was interviewed in a 'group' of 2 of us, the other person very clearly unprepared. My existing manager and a manager from another property conducted the interview which involved a 'group' task, a sales figures excercise, a property observation exercise and a face-to-face interview.\r\n\r\nI was asked leading questions and got the feeling my existing manager was trying to make me look incompetent (I had previously challenged her on pay and working conditions so not the perfect mold-able employee they were looking for).\r\n\r\nNeither of us got the job, they held more interviews just (conveniently) one on one was no external help and ultimately hired the manager's friend who had no experience and was incapable of functioning in the job even months later. I continued to do her job until I left and they advertised for a new supervisor in my place.", "Interview Questions": "Give you a scenario you have to answer how you'd deal with it"}, {"date": "20 Jul 2018", "title": "Business Support Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The National Trust (Cheltenham, England) in May 2018", "Interview Descriptions": "Great Communication, waited a couple of weeks before being called for interview. Had a 2 step process both face to face. There was a competency test before the first interview but this was simple and was a good way for them to see someones thinking process.", "Interview Questions": "Times when you have dealt with difficult situation and how did the problem solve."}, {"date": "31 Mar 2022", "title": "People Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 5 days. I interviewed at The National Trust (Swindon, Wiltshire, South West England, England) in May 2018", "Interview Descriptions": "Very easy and relaxed process. Companancy based questions about skills and attitude. Overall good experience.  \r\nThis was based at the main office and regionally could be different depending on what job you apply for.", "Interview Questions": "Questions vary depending on job - n/a"}, {"date": "2 Apr 2018", "title": "Catering and Retail Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust", "Interview Descriptions": "There were 7 positions available - there was a group interview with 10 people altogether. Interviewed by 2 establishment managers + guided by current supervisor. took place 5pm - 7:30pm. Asked questions individually and in teams. Involved Roleplay and Presentation work.", "Interview Questions": "What is an example of good customer service?"}, {"date": "24 May 2018", "title": "Membership & Visitor Welcome Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust (Washington, North East England, England) in Apr 2018", "Interview Descriptions": "The interview was a group first one was 8 people and 2nd interview was 5.  It was the 2nd time I had applied for work and was unsuccessful each time. Petty silly and downright stupid reasons for not getting the job. Please avoid this place.", "Interview Questions": "Scenario - someone has walked onto the property without paying. How do you approach it?"}, {"date": "11 Apr 2018", "title": "Ranger Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The National Trust (Manchester, England) in Mar 2018", "Interview Descriptions": "I was interviewed by three people on a panel. One of them was very obnoxious and constantly interrupted my answers to correct them. I understand if she was not happy with my answers, but I found her rude and arrogant. The other two people were perfectly friendly and lovely. \r\n\r\nI had to give a presentation on a task I could deliver. I did a quick ten minute presentation using powerpoint, and they asked me a few questions about. \r\n\r\nI left with an overall negative opinion due to the woman's constant interruptions and corrections. Without her, I would have left feeling very positive about the location and role of the job.", "Interview Questions": "What do you see as the biggest challenge of this role?"}, {"date": "27 Mar 2018", "title": "Long Term Volunteer Ranger Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The National Trust (Coniston, England) in Mar 2018", "Interview Descriptions": "Assessment day - practical conservation work on National Trust land, consisting of clearing felled tree branches and then burning them. The task was to test our team work and ability to carry out practical tasks. There was an assessed walk through woodland where we were asked questions on the surrounding landscape and how to solve some of the issues there. Finally, there was a formal interview woth two existing members of staff.", "Interview Questions": "This is a developmental role, aimed to improve your iwn skills. Hat do you think the biggest challenges will be?"}, {"date": "28 May 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The National Trust (Swindon, Wiltshire, South West England, England) in Mar 2018", "Interview Descriptions": "Its was a standrd type interview. There were questions ranging from experince to knowledge of the trust. The questions were set and the same for all that applied. The process was simply and straightforward. The whole process took around 30mins. There werw question on the my knowledge of the Trust and why I wanted to work for them. I was put at ease and the process was very simple. It looked like a friendly place to work.", "Interview Questions": "Why did you aplly? "}, {"date": "26 Mar 2018", "title": "Assistant Building Surveyor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The National Trust (Swindon, Wiltshire, South West England, England) in Mar 2018", "Interview Descriptions": "150 candidates for 6 jobs... There is no pre assessment centre phone screening which would have been the most logical way to start the process so as not to invite so many people down to Swindon. Instead they invite 150 odd people across two days from all corners of the country out of your own pocket with no reimbursement(£120 train return).\r\n\r\nOn the day there is no real structured 1 to 1 or opportunity to speak to a panel of assessors away from the interruptions of other pushy candidates.\r\n\r\nThe day itself is a bit lax and not as strict or challenging as most assessment centres are. There were several tasks throughout the day the first of which was a quiz styled around the National Trust and itself as an organisation.. More of a trivia type thing than any actual competency to the role.\r\n\r\nThis was followed on by some talks; one of the tasks was the classic rank 10 set items in order of importance according to the US coast guard to help you survive a shipwreck in the Atlantic ocean.\r\n\r\nThe final task which was a bit out there involved crafting your favourite National Trust property from play doh and then speaking about the property for 5 odd minutes and what it means to you and why it's so good.\r\n\r\n\r\nI understand this was only the second year of doing this on the end of the National Trust however as an organisation as big as this the process shouldn't have been so amateurish.  Good luck in the future, there's a lot to be learnt when recruiting your future grads.", "Interview Questions": "What is your favourite National Trust Property"}, {"date": "17 Feb 2018", "title": "Visitor Experience Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The National Trust", "Interview Descriptions": "Application was online - straightforward process. They got in touch with only 2 days prior to the interview date, which led to some manic preparation. Interview consisted of about 2 hours: 1 hour of 2 written exercises followed by 45 min interview with panel. Staff were friendly throughout, which helped to put me at ease. For the written exercises, I was asked to respond to an email complaint and then create a business plan to improve on 3 areas of the organisation. Interview felt friendly and relatively informal - felt able to be a bit more relaxed. The panel were polite and allowed time for questions at the end - they made me want to work there.", "Interview Questions": "What do you consider the challenges/ rewards of working with volunteers?"}], [{"date": "16 Mar 2018", "title": "Membership & Visitor Welcome Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust (Derby, England) in Feb 2018", "Interview Descriptions": "Completed an application form, covering letter, and two 500 word questions online. After about a week I was invited to an interview.\r\n\r\nThe interview began with short presentation about my favourite NT property, then two interview question, a tour of the grounds, and group activities. For the first group task were were split into two teams of three and asked to build the tallest tower from leaflets (looking for teamwork and communication skills). The second task was to go through a list of 15 objects and choose 7 that would help us survive as a team in a jungle (looking for teamwork and presentation skills). After these group task there was a written exercise. We were given 10 minutes to answer three questions regarding a hypothetical family buying NT membership: What should they do today while visiting the property? What membership would be best for them? What properties should they visit when they return home to North Wales? This concluded the interview\r\n\r\nI was told I would hear back by the end of the week and was offered the job over the phone that evening. I declined the job as I was waiting to hear back from other applications.", "Interview Questions": "Can you give an example of when you have delivered excellent customer service?"}, {"date": "17 Feb 2018", "title": "Catering Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The National Trust in Feb 2018", "Interview Descriptions": "Very informal interview on site. Interviewer worked down a list of standardised questions. Very friendly, felt more like a chat than an interview. Lasted for around an hour. Even though only one position was advertised, I got the impression they were looking to hire a small team.", "Interview Questions": "What would you do if you witnessed another member of staff being rude to a customer?"}, {"date": "13 Mar 2022", "title": "Catering Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust (Northiam, England) in Jan 2018", "Interview Descriptions": "In person interview with the food and beverages manager and a supervisor. Fairly laid back, sat across the table and started by speaking about the position on offer then ran through a double sided A4 sheet of standard interview questions.", "Interview Questions": "How would you handle conflict at work?"}, {"date": "12 Jan 2018", "title": "Assistant Facilities Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The National Trust (Haywards Heath, England) in Dec 2017", "Interview Descriptions": "Very casual approach with Group exercises and quiz.  Interviews deferred as not all NT staff available.  Included tour around the facilities and gardens and opportunity to meet staff. Emphasis was on meeting NT values rather than competency for role.", "Interview Questions": "What is good customer service?"}, {"date": "5 Dec 2017", "title": "Business Support Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The National Trust (Chedworth, England) in Nov 2017", "Interview Descriptions": "1. Send off an online application form which is accessed through an online sign in process on their website. \r\nThe National Trust website already states it will take up to three weeks to let you know if you have been successful for a face to face interview. \r\nThey got back to me in a week and a half to invite me to interview. \r\n\r\n2. Invited to a face to face interview with a task about how you would handle different scenairo on your own \r\n\r\nThe face to face interview was in a small room, interviewed by two people this felt very informal and also impractical layout of the room, Which lead me to feeling uncomfortable. They tried to outline the job role at the beginning but was still very confused in what the job role would entail. Only by the end of the interview did I seem to understand what they wanted this person to cover in the role. The two people interviewing started off stating they were looking for slightly different answers to the questions. Additionally, was not clear on really who you would be line managed by if offered the job. \r\n\r\nWhen I answered questions at times I was challenged about the answer but almost felt like I was being bullied or not believed. \r\n\r\nI had stated on my application process that I had a disability, this was not brought up if they would need to make reasonable adjustments to the working environment if offered.", "Interview Questions": "Tells us how you managed to turn a negative attitude into a positive outcome.\r\nHow does your current/previous role align and differ with this role. \r\n"}, {"date": "24 Jun 2021", "title": "Assistant Environmental Practices Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The National Trust (York, England) in Nov 2017", "Interview Descriptions": "Relaxed panel interview with  three interviewers, competency questions and a short role play.  I was asked to prepare for a short role play with a property 'general manager'. This tested my ability to form a good relationship and understand priorities as well as some technical understanding about what I might suggest to reduce energy consumption at a property.", "Interview Questions": "Give an example managing difficult relationship. "}, {"date": "1 Feb 2018", "title": "Digital Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The National Trust in Sept 2017", "Interview Descriptions": "Very, very slow. Expect at least 6 - 8 weeks before an interview invite then another 2 weeks wait for interview. Be prepared for generic auto responses, and an unreliable careers site.\r\n\r\nAll in all, an outdated and impersonal process -  although the Hiring Managers are a lot more helpful.", "Interview Questions": "Lengthy form to fill in qualifications and school history, regardless of role."}, {"date": "26 Jul 2017", "title": "Visitor Experience Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The National Trust", "Interview Descriptions": "Highly structured consisting of 4 different activities, a group exercise, a 1-to-1 interview, a marketing written exercise and a visitor feedback written exercise. There were 8 candidates interviewing for 1 position over 2 different sessions.  Some candidates were already working for the National Trust which gave them a distinct advantage, especially in the group exercise and in the 1-to-1 interview questions. \r\nThe National Trust states that it appoints on merit and this is shown in the interview process and the way that your answers are scored by a number of different people. This interview process is pretty dry, it is not about how you work or you as a person, it is purely about hitting the right words for the scoring system. The interview is all competency based questions so preparation is key!", "Interview Questions": "How would you respond to someone enquiring as to accessibility of the National Trust property you are working at?"}, {"date": "1 Sept 2017", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust (Swindon, Wiltshire, South West England, England) in Aug 2017", "Interview Descriptions": "The interview process would involve an informal interview followed by meeting key team members and a tour of the work environment. However, I was out of the country and was able to interview over Skype.", "Interview Questions": "Why work for The National Trust over a design agency for example?"}, {"date": "3 Feb 2019", "title": "Catering Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at The National Trust (Swansea, Wales) in Jul 2017", "Interview Descriptions": "Process was easy, application done online followed by and quick 10 min interview. After this they took me on for a trial shift. Overall it was a very good process, the people were lovely and helped with any questions I had. It was the perfect job for me.", "Interview Questions": "There weren't really any? it was more of a trial shift"}], [{"date": "22 Mar 2021", "title": "Events and Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The National Trust (Cardiff, Wales) in May 2017", "Interview Descriptions": "Very welcoming and helpful staff. I felt very relaxed, which helped calm my nerves. A professional process, but throughout staff were very approachable. Throughout interview, the interviewer would show examples and current projects, asking for my input.", "Interview Questions": "What is your previous experience and skill set? How would you be able to adapt them to this current position ? "}, {"date": "1 Dec 2020", "title": "Food and Beverage Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust (Worksop, England) in Mar 2017", "Interview Descriptions": "The interview consisted mainly of group exercises such as describing what makes good customer service. There was also a role play portion where we had to act out how we would deal with different customer complaints.", "Interview Questions": "What does good customer service mean to you?"}, {"date": "16 Dec 2019", "title": "Catering Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The National Trust (London, England) in Feb 2017", "Interview Descriptions": "Phone call interview followed by a casual in-person interview at the property I applied to.  I was accepted on the day of the interview. Part of the interview was discussing how my first day was going to run and what information I would need for it.", "Interview Questions": "How has your previous experience prepared you for a job in catering "}, {"date": "2 May 2019", "title": "Front of House Staff Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust (Hebden Bridge, England) in Jan 2017", "Interview Descriptions": "Informal and casual, interviewer came across rude & uninterested. Got the job but left after a few months due to poor management and nasty conflicts between management and other employees; making it a stressful place to work", "Interview Questions": "N/A"}, {"date": "5 Dec 2016", "title": "Communications Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust", "Interview Descriptions": "I was asked to prepare a 15 minute communications strategy presentation with one week's notice.  After the presentation, there was a general interview including public relations dilemmas and how you would handle them.", "Interview Questions": "Have you visited x National Trust site?"}, {"date": "10 Oct 2020", "title": "Food Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The National Trust in Aug 2016", "Interview Descriptions": "Why the NT? How do my skills align with those required for the job? Give an example when you showed team work skills? What would you do if there was a spillage?", "Interview Questions": "Situational style questions - e.g. what would you do when.... "}, {"date": "28 Oct 2016", "title": "Visitor Welcoming Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The National Trust (Sevenoaks, England) in Jun 2016", "Interview Descriptions": "Very rushed, was not greeted by anyone at the reception or told that the interview was held in a room about a 15 minute walk from the reception up a hill, so had to find it on my own and arrived quite flustered. Entered with all my belongings and the manageress interviewing me didn´t give me any time to sit down and get comfortable but immediately laid out a pre-interview activity, although I had arrived 10 minutes early and hadn´t been told this would be happening. \r\n\r\nRest of the interview was with two manageresses one was fine and the other, of the main site who had given me the activity, rushed through and was fairly bolsh. She was wearing an extremely low cut top which I found extremely unprofessional and made me feel really uncomfortable. She also asked me questions about how I would provide a great, friendly customer service when she was providing none of that herself at all. She rushed through the questions and when I had answered my last one she stood up and said \"Thanks for coming\" before the other interviewer could say, \"Hang on, do you have any questions to ask us?\". Felt like I was just one of a number on a conveyor belt she had to get through and she made it clear she was quite tired. Tried to make friendly chit chat but she wasn´t interested and I got sent out of the room not knowing where to head to (I needed the toilets but she closed the door behind me in such a rush, couldn´t get me out of there fast enough it seems...)\r\n\r\n\r\nI then didn´t hear anything for a week and emailed her to ask if the position had been filled. She just said she had been very busy and gave no apology, but no, I hadn´t got the job. I wonder if she would have even got back to me if I hadn´t contacted her. I think I had a lucky escape because I felt totally unappreciated as a candidate.", "Interview Questions": "How would you sell National Trust membership?"}, {"date": "4 Sept 2020", "title": "Event Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The National Trust (London, England) in Jun 2016", "Interview Descriptions": "Interview  with head of Visitor Services, Property Manager and HR representative. Straightforward questions around the table. I had applied through the online portal system, and subsequently been given the interview. The interview lasted approx 40 mins.", "Interview Questions": "Q: What is your experience in managing volunteers?"}, {"date": "30 Jun 2016", "title": "Membership and Welcome Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The National Trust in Apr 2016", "Interview Descriptions": "Standard questions on application regarding experience followed by a two part interview. the first part is a sales section the second is personal. depending on whom is conducting depends on whether this is an improv exercise.", "Interview Questions": "Whay makes The National Trust the best visitors experience"}, {"date": "29 Sept 2016", "title": "Visitor Services Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The National Trust (Northampton, England) in Apr 2016", "Interview Descriptions": "A chat with two members of staff. Very formal, only a glass of water offered, and hostile body language. I got the impression that I had only been shortlisted for form's sake: I was applying for a job my boss was acting up into (which did not go down well)\r\n\r\nNo feedback was ever given afterwards, even though it had been promised.", "Interview Questions": "Roleplay: what would you do if the toilets pack up at a National Trust site?"}], [{"date": "4 Dec 2017", "title": "Catering Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at The National Trust in Feb 2016", "Interview Descriptions": "Not very good person interviewing did not seem interested and the interview was very short . The interview was very short and not many questions the. The interview was over", "Interview Questions": "N/A"}, {"date": "15 Apr 2018", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The National Trust (Swindon, Wiltshire, South West England, England) in Feb 2016", "Interview Descriptions": "A technical task, which was writing a response to an enquiry related to the area of work, followed by a panel interview where around 20 situational based questions were asked.", "Interview Questions": "What do you think will be the three biggest challenges working in this role at The Trust?"}, {"date": "25 Jan 2017", "title": "Catering Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The National Trust (Worcester, England) in Jun 2015", "Interview Descriptions": "An informal interview process where the manager took me round the cafe whilst it was open. SHowed me around the kitchen etc asking questions on my expereince, hours i could commit to.", "Interview Questions": "Have you had experience working in the catering environment previously?"}, {"date": "15 Jan 2016", "title": "Catering Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The National Trust (Newtownards, Northern Ireland) in Mar 2015", "Interview Descriptions": "it was a semi casual interview, arrived in reception and waited, greeted by one of the managers and brought to interview room where another was waiting, both very friendly, they took it in turns asking me questions about previous experience and my skills and qualities etc whilst taking notes, was then told i would hear from them by the next night as i was the last to be interviewed.", "Interview Questions": "How would you keep the restaurant tidy and presentable?"}, {"date": "9 Jan 2019", "title": "Membership Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The National Trust (Plymouth, England) in Feb 2015", "Interview Descriptions": "Good information beforehand. Very informal interview process although the interview was not with who I was expecting based on advanced info. Felt a bit cobbled together but was a relaxed atmosphere. Very welcoming interviewers.", "Interview Questions": "What do you know about the National Trust?\r\nHow would you deal with awkward people? \r\nWhat difficult situations have you dealt with? \r\n"}, {"date": "8 Nov 2015", "title": "Catering Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The National Trust (Reading, England) in Sept 2014", "Interview Descriptions": "The interview process was relaxed and friendly and the management I met gave good feedback. I received an offer by the next morning and enjoyed my initial training phase. I would recommend looking up the companies new strategy and change on organisational structure.", "Interview Questions": "What does excellent customer service look like to you?"}]]