[[{"date": "17 Jul 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at North York General Hospital (North York, ON)", "Interview Descriptions": "It went well, 45 mins long interview. Need to provide covid vaccine, need to finish online modules before you land in the unit. Orientation phase was great, clinical educators are the support team for newly hire nurses", "Interview Questions": "Nursing skills and background check"}, {"date": "6 Apr 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at North York General Hospital", "Interview Descriptions": "Nursing based questions . With manager and educator, virtual during COVID. Many question related to experience and then behavioral questions. This was for a surgical ward. Scenarios related to post op, how to deal with doctors and distressed family.members", "Interview Questions": "How do you deal with an unhappy client"}, {"date": "23 Jan 2023", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at North York General Hospital in Jan 2023", "Interview Descriptions": "Microsoft teams, 3 people on the panel. Lasted around 25 minutes, each person took turns asking one question. Absolutely boring, mean people, difficult interview. It was the worst interview in my life (I had 6 more around same time from other facilities). Arranged by HR through email confirmation, meetings information sent by HR.", "Interview Questions": "Tell me about situation you would like to change and act differently"}, {"date": "19 Aug 2022", "title": "Registered Nurse, Telemetry Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at North York General Hospital (Toronto, ON) in Aug 2022", "Interview Descriptions": "Microsoft teams, 3 people on the panel. Lasted around 20-30 minutes, each person took turns asking one question. 4 patient based scenario questions. 3 “personality” type questions. Arranged by HR through email confirmation, meetings information sent by HR. Rejection email received from HR around a day later.", "Interview Questions": "Where do you see yourself and your career in the next 5 years? \r\n"}, {"date": "20 Mar 2022", "title": "Registered Nurse, Mental Health Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at North York General Hospital", "Interview Descriptions": "Always a bunch of job postings but never gets back to applicants. Average interview with scenario questions from the nurse manager and clinical educator, you do get a small chance to talk about yourself though", "Interview Questions": "Why do you want this job"}, {"date": "18 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at North York General Hospital", "Interview Descriptions": "It's a panel interview wherein they ask series of questions. First few questions are typical nursing questions like why did you choose this hospital, then after that questions are behavioral and situational.", "Interview Questions": "How do you handle a situation wherein a colleague did a medication error."}, {"date": "11 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at North York General Hospital", "Interview Descriptions": "Interview between the Unit Coordinator and the Nurse Educator. They asked me about 5-6 scenario questions and the interview lasted about an hour. The interview questions were average difficulty, but the interviewers were quite helpful and wanted me to succeed.", "Interview Questions": "How would you handle a situation where you and a co-worker disagreed?"}, {"date": "18 May 2022", "title": "Unit Secretary/Ward Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at North York General Hospital (Toronto, ON) in Mar 2022", "Interview Descriptions": "Basic interview questions about prioritizing, time management, what is your understanding of this role and few experiences that you think are relevant, and patient centered care. All situational questions to help elevate patient experience at the hospital.", "Interview Questions": "You face multiple demands: physician giving you an urgent task, phone calls are coming through, nurse asked you to do a task, patients family is in front of you, call bells are ringing. How do you prioritize and explain your reasoning as to why? "}, {"date": "3 Feb 2022", "title": "Clinical Extern (Student Nurse) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at North York General Hospital", "Interview Descriptions": "Very detailed and situational questions. The interviewers were really nice and welcoming. Review the job description in relation to the candidate's qualifications. They would like to know your educational background. They are interested in how you would show compassion as an extern.", "Interview Questions": "Situational questions related to scenarios in the hospital setting"}, {"date": "1 Nov 2021", "title": "RPN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at North York General Hospital", "Interview Descriptions": "Applied online. Took 1-2 week to get a call after applying. Long interview process. No firm answer after the interview. Took reference. Can do better if prepared for the interview. I was not intimidated during the interview.", "Interview Questions": "What is patient centered care"}], [{"date": "6 Oct 2021", "title": "Physiotherapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at North York General Hospital", "Interview Descriptions": "Have four people in the interview process. Received communication through email. The interview process was simple and quick. Staff were very friendly and made the process easy. The entire process was smooth.", "Interview Questions": "Talk about yourself and experience"}, {"date": "13 Jan 2022", "title": "RPN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at North York General Hospital (Toronto, ON) in Sept 2021", "Interview Descriptions": "2 memebrs on the panel \r\nsenario questions \r\nweakness and strengths \r\nwhat to imrpove what you would want to learn \r\nwhat dose besdide nursing mean to you \r\ngive a time whre you made a mistake and how you fixed it", "Interview Questions": "what does family centered care mean "}, {"date": "30 Aug 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at North York General Hospital", "Interview Descriptions": "Can be intimidating when the educator ask you go into details of how certain medications work (ex. nitroglycerin spray). And they ask you about your acute experience. Some of my colleagues reflected that the hiring managers & educators are choosy in terms of how much acute experience you have prior to joining them.", "Interview Questions": "What do you anticipate the physician would order when a patient has chest pain?"}, {"date": "25 Aug 2021", "title": "Medicine Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at North York General Hospital", "Interview Descriptions": "Got an invitation email for a virtual interview in the morning that has an indication of the date, time, and people who will be interviewing me and the interview  will take about 45minutes", "Interview Questions": "Tell me about yourself and strengths and weakness"}, {"date": "3 Jun 2021", "title": "Quality Improvement Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at North York General Hospital", "Interview Descriptions": "I had two interviews: in the first one I was asked the basic behavioural questions and specific questions related to my resume and in the second interview I was asked more generally about what I want out of the job.", "Interview Questions": "How would you show compassion?"}, {"date": "29 May 2021", "title": "RN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at North York General Hospital", "Interview Descriptions": "I Received an email after 1 day of submision of resume. They booked me an virtual interview, however I am not available to the given schedule. I sent an emailed if I can choose my preferred time. Then they agree. Very professional and looking forward to work with them at the right time.", "Interview Questions": "Why did you choose this career?"}, {"date": "13 May 2021", "title": "Patient Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at North York General Hospital (North York, ON) in May 2021", "Interview Descriptions": "Invitation sent my Human resources to pick a time they provided. Interview was done through Microsoft Teams meeting. There was three people in the panel and one person asking quesitons.", "Interview Questions": "Tell me about yourself, why do you want to work at the hospital?"}, {"date": "28 Apr 2022", "title": "Patient Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at North York General Hospital (Toronto, ON) in Mar 2021", "Interview Descriptions": "They will send you a message and invite you to attend the virtual interview and give you some details and tips for your upcoming interview. Prior to the meeting/interview they want you to feel comfortable.", "Interview Questions": "If NYGH hired you. What would you accomplish first? "}, {"date": "24 Mar 2021", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at North York General Hospital in Mar 2021", "Interview Descriptions": "Very professional and friendly interviewers. It was on zoom with a panel of interviewers with questions that pertains to their department and clinical situational questions. Everything was organized in a way that applicants are less anxious for the interview and can focus on their answers.", "Interview Questions": "Describe an instance where you displayed leadership. Be honest and tell them what you don't know and what you would do as RN in that case."}, {"date": "21 Apr 2021", "title": "RPN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 5 days. I interviewed at North York General Hospital (North York, ON) in Mar 2021", "Interview Descriptions": "HR contacts you for interview. Will ask for your availability and preferred date and time for the interview.  They will send a verification once you choose the time and date. You will need to use Zoom or TEams for the interview.", "Interview Questions": "What would you do if you have seen a fall patient, assessed that he/ she has no pulse? What would you do next?"}], [{"date": "27 May 2023", "title": "Junior Laboratory Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at North York General Hospital (Toronto, ON) in Mar 2021", "Interview Descriptions": "The technical coordinator and lab technologist will conduct the interview. It will be around 45 mins to 1 hour. Only one round. There will be no hand on portion performed for the interview. All interview questions will be theoretically based. It will be conducted on team", "Interview Questions": "Do you have experience using any laboratory software? How many years of data entry experience do you have? How you prevent errors from reading information? Do you have any previous lab experience? how will that experience benefit you? Do you have any research experience (data collection or interaction with different external stakeholders) some basic question about freezers operation and how to perform the office duty"}, {"date": "11 Feb 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at North York General Hospital (North York, ON) in Jan 2021", "Interview Descriptions": "Image result for Describe the Interview Process*\r\nThe interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire", "Interview Questions": "“Why did you decide on a career as a nurse?” \r\n“What do you find rewarding about this job?” \r\nHow you deal with someone who isn't satisfied with your patient care? .\r\n“Tell me what you feel your greatest skill as a nurse is.” \r\n“How do you handle the stress of the job?"}, {"date": "3 Nov 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at North York General Hospital (Toronto, ON) in Jul 2020", "Interview Descriptions": "Took about 40mins, two people interviewing you, following the paper and jot down your answer. few behavioural questions and few clinical questions. The first time did not get the offer, but then the job posting re-open and so the hiring manager said I was the next person, and ask me for references to do checkester references checks. After a week of completed the references checks, I didn't get any response so I emailed them and they said they have hired someone else. People are nice but the process is chaotic which is disappointing, giving me hope that I got hired and then tell me \"sorry, we got someone else.\"", "Interview Questions": "what do you think medicine unit do? how does cpr works?"}, {"date": "15 Jun 2020", "title": "RPN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at North York General Hospital", "Interview Descriptions": "study hard and know your head to toes and case scenarios, and know your area you are applying to whether it be surgery, oncology etc. interview was done by a panel, asked varying questions around knowledge and skills.", "Interview Questions": "how would you handle if you entered a patients room and found them slumped over"}, {"date": "2 Mar 2023", "title": "RPN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at North York General Hospital in Mar 2020", "Interview Descriptions": "2 panelists during the interview process. Microsoft teams virtual meeting. with one clinical educator and clinical instructor. Interview lasting about 25 minutes. turns were taken in asking of interview questions.", "Interview Questions": "Why would you be a good candidate for his job?"}, {"date": "21 Nov 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at North York General Hospital", "Interview Descriptions": "I applied online and got a call after a week. It is a panel interview with the manager and a nurse educator. The whole interview is around 30-45 min long. Mostly situational and clinical questions to assess your clinical judgement", "Interview Questions": "What are common reason of falls?"}, {"date": "24 Aug 2019", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at North York General Hospital in Jul 2019", "Interview Descriptions": "The recruitment process was done effectively, got email invitation a few days after the posting was closed.  The interview was done with the unit educator & manager, and they asked a lot of scenario questions as to nursing interventions.", "Interview Questions": "Introduce your background + all scenario based questions"}, {"date": "15 May 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at North York General Hospital", "Interview Descriptions": "I applied online. Interviewed with a panel. I was asked behavioural and a few clinical questions. They were welcoming and made me feel comfortable. Standard behavioural questions were asked.", "Interview Questions": "Give an example of working in a team?"}, {"date": "20 Feb 2019", "title": "Staff RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at North York General Hospital (Toronto, ON)", "Interview Descriptions": "Manager was very nice and knew processes really well. Clinical educator also present who was very knowledgeable. They weren’t very clear on the daily duties. We’re very personable and made me feel comfortable", "Interview Questions": "Why I wanted to work there "}, {"date": "15 Feb 2019", "title": "RN - EMERGENCY Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at North York General Hospital", "Interview Descriptions": "Amazing, well rounded and very thorough .  The process included a stimulation, and alot of cause scenarios. There was also an ECG test that was to be completed.", "Interview Questions": "A lot of case scenarios "}], [{"date": "16 Aug 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at North York General Hospital (North York, ON)", "Interview Descriptions": "I was interviewed by the unit manager and one of the nurse interview. I'm a new grad and they were both very nice which eased my nervousness. They asked me the classic question, \"tell me about yourself\" but the rest of the interview were scenario based questions.", "Interview Questions": "Pt with SOB: what would you do, anticipated orders."}, {"date": "30 May 2018", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at North York General Hospital", "Interview Descriptions": "The interview consisted of a stations interview  style. This meant that the interview took place with 2 other applicants in the room and 3 different interviewers, 1 at each station. All applicants interviewed at the same time.", "Interview Questions": "How do you plan on dealing with fluctuating patient assignment?"}, {"date": "19 Dec 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at North York General Hospital (North York, ON) in Oct 2016", "Interview Descriptions": "Two rounds of interviews both behavioral and the panel had 4 people from different departments. Several questions were related to patient experience and team work. The questions were similar to what you get in most place like teamwork, managing priorities, dealing with difficult people", "Interview Questions": "Tell us about your previous work experience "}, {"date": "17 Aug 2015", "title": "Laboratory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at North York General Hospital (North York, ON)", "Interview Descriptions": "over 40 mins, long and check my character and opinion\r\nFar more experience than required\r\nunderpaid offer, but i need job close to home, so I take the job.\r\nI stayed on for over 14 years and happy mainly because work is close home. I can pick up my child after school whereas I could not do that when I work downtown hospital.", "Interview Questions": "N/A"}, {"date": "27 Jul 2017", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at North York General Hospital (North York, ON) in Aug 2015", "Interview Descriptions": "Was asked number of food related and patient related questions. Including my past experiences from my previous Dietary Aide job at Kingston General Hospital. Gave my answers and examples using past experiences from my previous jobs.", "Interview Questions": "N/A"}, {"date": "23 Dec 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at North York General Hospital (North York, ON) in Apr 2015", "Interview Descriptions": "I applied by fax. They called me in about two-three weeks. No police check required. I was interview by James. Nice person, positive attitude. It was a very easy interview process. Nothing special, regular questions. Took me about 15 minutes.", "Interview Questions": "Tell me about yourself."}, {"date": "20 Jun 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at North York General Hospital (North York, ON) in Mar 2015", "Interview Descriptions": "I was interviewed by James (unfortunately he is not working there any more). He was a really nice person with positive attitude. The interview process and paperwork took about 20 minutes.", "Interview Questions": "Tell me about yourself. How do you describe yourself? What your friends could tell you about you?"}, {"date": "20 Sept 2014", "title": "Human Resources Management Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at North York General Hospital in Jul 2010", "Interview Descriptions": "three interviews were conducted.  First was a telephone interview then a panel interview and final interview with VP and Manager.  Panel interview was with 5 others from the department. It was well structured and timely.  It was welcoming and professional.  the questions were relevant.  It gave me them what they needed to learn about my background and who I was and gave me the opportunity to spend time with the team I would be working with.", "Interview Questions": "Tell us in your opinion what are the challenges facing healthcare now and 5 years from now"}]]