[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Wonderful place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Jan 2023", "job_title": "Head of HR in Finsbury Park, England", "duration": "N/A", "pros": "Inspirational, values led and caring CEO with a strong vision for the furture - a great leader. Highly capable and effective Board of Trustees Strong focus on Diversity and Inclusion as well as employee welbeing It is highly rewarding working at Freedom from Toture as it strives to become the Centre of Excellence in providing much needed outstanding therapuetic and legal support to torture survivors as well as holding the UK government (and others) to account for their policies and practices which violate the human rights of their people.", "cons": "There is no getting away from it - the work is challenging; but this is what makes it so rewarding. Knowing that, collectively, your and your colleagues efforts are delivering such important work is highly motivational."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Freedom from Torture is a magical organisation", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Feb 2022", "job_title": "Head of Estates and Facilities in London, England", "duration": "N/A", "pros": "I walked through the main doors 4 years and 6 months ago, as an individual to start my role as The Head of Estates and Facilities. On Thursday 17th February 22, I walked out of the same doors to start my retirement, but this time as a full family member of Freedom from Torture.\r\n\r\nFreedom from Torture is an organisation where you can't help but be touched by the compassion, caring and passionate staff who work there.\r\n\r\nThe exceptional work that is carried out by the clinicians at Freedom from Torture provides real hope for our clients.\r\n\r\nThe Covid19 pandemic brought the entire organisation together as one, with the sole aim to continue providing a much needed service for our clients who we are all here to serve. If i had to recommend one Charity above all others to work for, Freedom from Torture would be my number one choice. I have been privileged, honoured and lucky to have worked for such a passionate, \r\n compassionate and caring organisation.\r\n\r\nThank you to my team, colleagues, friends and Freedom from Torture Family.", "cons": "None that come to mind"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great organisation, but many internal issues", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Apr 2021", "job_title": "Staff Member in London, England", "duration": "N/A", "pros": "The important work FFT does, and the majority of its staff are incredible, and it has been an honour to work alongside this highly skilled and passionate team. It’s great to see the organisation becoming increasingly survivor led.", "cons": "I have witnessed and experienced, intimidation and gas lighting often being used, particularly in recent years. Management can be hostile, aggressive and dismissive in their approach at times. Many talented staff are undervalued and experience undermined, there is overwhelmingly a lack of support from management.\r\nWorkload is often unacceptable, when this is raised this as too much pressure by staff they have been reminded that they are disposable. It is almost impossible to take TOIL. COL increases and wages in general have been frozen for quite some time. Wellbeing activities offered are no more than a tick box exercise. There is a lack of opportunities for personal or career development."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Does great work with torture survivors but no longer so great to work for.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "5 Feb 2021", "job_title": "Prefer Not To Say in London, England", "duration": "N/A", "pros": "A lot of the staff are really great, dedicated people. The charity really helps victims of torture.", "cons": "Work atmosphere has become somewhat toxic due to behaviours and actions of senior management team. SMT talk the talk about valuing staff but their actions and how they communicate with staff tell another story.\r\n\r\nIf you speak to colleagues, very few are happy and many are leaving or actively looking for new jobs. No longer a great place to work for many."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great to work at Freedom from Torture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Feb 2021", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Provides lots of great support for Survivors of Torture, \r\nFriendly staff and volunteers - all who are working towards providing best experience for our clients.\r\nWell lead by Senior Management Team \r\nRecognises importance of staff wellbeing - particularly for the front line roles", "cons": "I have been working here for 18 months and cannot think of any cons."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 May 2021", "job_title": "Physician in Manchester, England", "duration": "N/A", "pros": "Helping people in dire need", "cons": "Not enough funding meaning work can't be done"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Rewarding work in a high stress environment", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 Mar 2017", "job_title": "Fundraiser in London, England", "duration": "N/A", "pros": "- Well respected charity with a brilliant mission\r\n- Wonderful, passionate colleagues across all departments; friendly atmosphere\r\n- Opportunity to build your knowledge about human rights issues in many countries\r\n- Clinical work is of high quality; clients receive excellent care from clinicians who care deeply about their clients and value professional ethics", "cons": "- Staff, especially clinicians, are overworked with high caseloads. This is especially the case in the charity's regional centres located outside of London. \r\n- Unapproachable, unsupportive HR and senior management\r\n- High burnout rate for clinical staff, and high turnover in other depts: in my 3 years at the charity there were 3 fundraising directors\r\n- Notably high number of staff leave at very short notice\r\n- Fundraising teams are often expected to meet unrealistically high targets handed down by senior management"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Amazing cause and teams, some way to go on well being ok:", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Jul 2019", "job_title": "Fundraising & Communications Department in London, England", "duration": "N/A", "pros": "Amazing organisation delivering the most amazing work. \r\n\r\nReally great, passionate staff who are totally committed.", "cons": "It can feel quite chaotic, lots of staff turnover especially outside of front line staff.  Many projects appear to come out of nowhere and are expected to slot into an already tight workload. Opportunities for training and progression are limited."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Avoid!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "18 Jan 2020", "job_title": "Legal Consultant in London, England", "duration": "N/A", "pros": "Employees are driven and committed. Professional people go the extra mile to provide service to clients and to support each other.", "cons": "Terrible management! Culture of bullying and intimidation. There is a lot of pressure on employees and especially on clinical staff.  As a result legal and welfare need to work extra hours with no compensation.\r\nThere is a constant fear amongst employees of persecution from management. Unsafe environment to work in."}], []]