[[{"date": "30 Jun 2023", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UEI College (Redondo Beach, CA) in May 2023", "Interview Descriptions": "Phone screening. Two in-person interviews. 2 follow-up phone calls. 2 email messages.  Phone call to offer position. Employer requested a final in-person meeting before determining the details of the offer.", "Interview Questions": "Why are you here?"}, {"date": "13 Apr 2023", "title": "Senior Admissions Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at UEI College (Sacramento, CA) in Dec 2022", "Interview Descriptions": "Contacted by regional director, brief phone interview, schedule in person interview on campus with Director of Admissions, then interview with campus director, then discuss final decision, if proceeding forward with company, must submit to background check", "Interview Questions": "Why should we choose you?"}, {"date": "14 Dec 2022", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UEI College (Tempe, AZ) in Dec 2022", "Interview Descriptions": "Was rejected on the way to the final interview. Was going to be the third interview. First one (after initial screening call from recruiter) was a panel in-person interview, the second was a panel zoom interview", "Interview Questions": "Past Experience relevant to job position"}, {"date": "22 Nov 2022", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UEI College", "Interview Descriptions": "Average questions, interviewed with three different people all in the same day. They say all employees have to be fully vaccinated. I was hired the same day and they scheduled a follow-up appointment to complete onboarding process.", "Interview Questions": "Do you like talking on the phone a lot"}, {"date": "29 Sept 2022", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at UEI College (Stockton, CA) in Sept 2022", "Interview Descriptions": "Met and talked with multiple people in the facility through out the entire interview. Interview was a total of two days. First day was interviewing with some staff, second day was the same thing but more in depth about the job. Very satisfied with the professsionalism. Company was open to anwsering my question's thoroughly. Great interview process! ", "Interview Questions": "Tell me about yourself. Previous work history. "}, {"date": "31 Jan 2022", "title": "Assistant Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 weeks. I interviewed at UEI College (Morrow, GA)", "Interview Descriptions": "Two step interview process. Met with Lead Instructor for initial interview , director and one additional person . I was asked about my experience, why I wanted to be an instructor and informed about the structure of the program.  Second step was a “Teach-back.” Make it unique .  Talk about a subject you’re well versed on . You are presenting career information to other instructors as if you’re lecturing a class .", "Interview Questions": "Why do you want to be an instructor?"}, {"date": "17 Dec 2021", "title": "Medical Assistant Instructor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UEI College", "Interview Descriptions": "It was a very long process. I had to interview several times with multiple people. Took almost a month. I was told I was hired, but the list of requirements", "Interview Questions": "Honestly, I do not remember there was a lot"}, {"date": "28 Nov 2022", "title": "Admissions Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UEI College (Las Vegas, NV) in Oct 2021", "Interview Descriptions": "Phone interview. Group interview with an impromptu in front of the group about why they should choose you. Interview with the supervisor explaining day to day life. Discussed shift work, cold calling and raise structure. Interview with campus president to explain the mission of the school.", "Interview Questions": "How are you a fit for this job? What do you bring to the table that is different? Are you willing to work a rotating shift and occasionally on Saturdays? What is your preferred salary?"}, {"date": "17 Sept 2021", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at UEI College (Las Vegas, NV) in Sept 2021", "Interview Descriptions": "Two part interview. Really friendly, inviting environment. Met with department head and campus president. I was greeted and welcomed by several people. No pressure. Never felt uneasy. I left the initial interview really excited about the possibility of working here. I was called in for a follow up interview where I was really educated on the school and their mission and I knew I was done looking for a job.", "Interview Questions": "Tell us about your experience. "}, {"date": "28 Mar 2022", "title": "Admissions Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UEI College (Las Vegas, NV) in Aug 2021", "Interview Descriptions": "The interview process was easy and quick. I was expecting to meet with just 1 manager but ended up meeting 3.  The process took about an hour. The vibe was definitely inviting and exciting. The idea of helping people change their lives got me going!", "Interview Questions": "How would you answer the phone"}], [{"date": "4 Aug 2022", "title": "Receptionist/Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at UEI College (Bakersfield, CA) in Jun 2021", "Interview Descriptions": "Interviewed with three different people. Waited an hour for the fourth interviewed and was told to come back the next day. Everyone seems very uncoordinated. Many red flags were shown.", "Interview Questions": "What would you do if I were to assign a project that takes months to complete and I decide to completely change it a week before the deadline "}, {"date": "14 Jun 2021", "title": "Director of Career Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UEI College (Huntington Park, Los Angeles, CA) in Apr 2021", "Interview Descriptions": "Most of the interview process was conducted through Microsoft Teams which made the process easy to use and a great way to get people together that might be in different locations.", "Interview Questions": "Describe your experience working in Career Services."}, {"date": "9 Mar 2021", "title": "Admissions Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UEI College", "Interview Descriptions": "I had applied through Indeed and received a message to confirm my interest, once I did this UEI was very responsive and proactive in arranging an interview time. There are 3 rounds and all were right after another in my experience.", "Interview Questions": "Would you consider yourself as being  coachable?"}, {"date": "1 Feb 2021", "title": "Director Career Services Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at UEI College", "Interview Descriptions": "extensive. Several interviews with different entities from the corporate office in California. A very numbers driven, immediate results type a place . Didnt get a good vibes from the process.", "Interview Questions": "only focused on profit margin"}, {"date": "14 Jun 2023", "title": "Medical Assistant Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UEI College (Phoenix, AZ) in Jan 2021", "Interview Descriptions": "Very easy; especially when they need help. Some of these programs can be revolving doors. However its about the students and as long that is known upfront; you are a sure in.", "Interview Questions": "Why should I choose you as a teacher?"}, {"date": "14 Jul 2020", "title": "Financial Aid Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UEI College (Riverside, CA) in Jul 2020", "Interview Descriptions": "Quick process. Submitted resume online was contacted a few days later and scheduled interview within that week. The interview was standard with typical previous employment questions and a few FAA questions to test Title IV knowledge.", "Interview Questions": "Why did you leave your previous employer?"}, {"date": "6 Sept 2019", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UEI College (Ontario, CA) in Aug 2019", "Interview Descriptions": "I applied on indeed and got a call the next day for an interview. I was under the impression that I would be the only one coming in for an interview, but there were several people getting interviewed for the same position.  After waiting until everyone showed up, all of us were sent into a computer room and asked to sit down. There we met Robert Pope the \"Campus President\", he stated out of all of the people who were in the room there were only 3 open positions. He described the position which is pretty much a sales job and asked all of us to fill out scenario-based questions.  The whole process seemed to sketch and unsettling. As people turned in their papers we were called in one at a time for a one on one interview. However, this was a panel interview with two female Admission Reps. The energy they gave off was fake and the interview was rushed. Since this a for-profit school that is not nationally accredited or regionally accredited I was not surprised I did not hear anything after the first interview. If you have integrity and you don't want to scam young vulnerable people into taking out loans, then find something else. All this position is doing is selling the school and loans to naive broke people. DO NOT WORK HERE and DO NOT GO HERE. The money may sound good, but tell people you know that if you are a California resident, you can go to community colleges for free if you apply for financial aid which will grant CA residents the BOGWaiver.  Yes, 2 year and 4-year colleges take more time, but it is better than this place. Community colleges and UC and Cal states are accredited colleges and will transfer to 98% of colleges. Grants and scholarships are easier and almost guaranteed if you choose to go to a CC, Cal state, or UC. Again, don't work here. This place will end up like Everest and all of the other scamming colleges.", "Interview Questions": "Why is this place so trash? Why are we not accredited? Why do we only accept loans? Why do we scam people who are in dire financial situations into taking out a \"school loan\" to keep our quota up? Why are we pretending like this \"open positions\" is an audition for an independent film, that will be filmed on a Motorola razor cell phone? Why don't we know how to conduct professional interviews when we are trying to teach people to be professionals? Why do we call from unreachable phone numbers?"}, {"date": "22 Aug 2019", "title": "Career Services Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UEI College (New York, NY) in Aug 2019", "Interview Descriptions": "I applied via indeed. I received a call promptly the next day from the Director. I met with him 5 days later. When I arrived, I filled out a paper application and a few questions and then waited for about 20 mins.\n\nI was interviewed directly with the Director. He was extremely nice and attentive. He was informational and conversational. He told me liked my answers and was going to recommend me and I should hear a follow up within 2 weeks. After 2 weeks of hearing nothing and no response to my email checking on the status, I still haven't heard anything. But, I've spoke to a few people that have interviewed there and never hear back. So I'm not sure they're actually looking to hire.......\n\nAll in all, they were nice people though.", "Interview Questions": "Where do you see yourself in 3-5 years ?"}, {"date": "25 Jul 2019", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UEI College (Phoenix, AZ) in Jul 2019", "Interview Descriptions": "The initial interview I had with the Director resulted in a no call no show on the employers side. I got a call days later and came in for a second attempt at interviewing and again the Director was late in the morning so I was waiting to be interviewed for 30 minutes before the Sr. Recruiter interviewed me. Then when the Director got into work he interviewed me and was very unprofessional saying comments like, “Wow! A hockey. How professional!” To an obvious birthmark! Along with statements like, “Did you really work at these spots if you can’t remember some of the details to them?” And, “Tell me what you want to my questions because I know all your old bosses personally so they’re just a phone call away!” So, in a nutshell, I’m not only insulted by my experience but also frustrated and bewildered how this guy even has a job! While I’m the only professional looking for one. That’s the real WOW factor of this whole thing!!!! The world these days.", "Interview Questions": "Why are you no longer working for your past employer?"}, {"date": "20 Aug 2018", "title": "Career Services Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UEI College in Aug 2018", "Interview Descriptions": "The interview was very unprofessionally handled. The interviewer made me wait almost 20 minutes, and interviewed me for only 5 minutes. It seemed as though he did not previously review my resume before inviting me to the interview because he asked for a copy of my resume during the interview, and appeared to be reading it for the first time.  After scanning my resume for around 30 seconds, the interviewer immediately decided that my skills did not match the position requirements. I am left wondering why I was invited to the interview at all...", "Interview Questions": "I wasn't asked any relevant interview questions"}], [{"date": "13 Nov 2019", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at UEI College (Riverside, CA) in Aug 2018", "Interview Descriptions": "Hired on within the company which they do often so my interview was easy and pretty straight forward. I spoke with my previous director in my dept and the new director I would be under and the campus president. They did a background check, negotiated pay with me and approved.", "Interview Questions": "why do you want to be in admissions"}, {"date": "2 May 2018", "title": "Dental Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UEI College (Atlanta, GA) in Sept 2017", "Interview Descriptions": "Great interview!! Staff was very friendly and professional! If I was offers a interview again I would definitely do it ! The overall atmosphere is nice!! I had to interview with the admission rep.. Interviewing is very nerve wrecking for me but they made it a breeze for me", "Interview Questions": "Why do I think you would be a good candidate for this position "}, {"date": "27 Oct 2021", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UEI College (Ontario, CA) in Aug 2017", "Interview Descriptions": "I met with 3 Managers and they were very nice,  At the end of the interview they offered me a position I excepted and started working a week later. I was there for about 2 1/2 years and went on to a new position but I am very grateful for the experience", "Interview Questions": "Why do I want the position "}, {"date": "7 Aug 2015", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UEI College (Stockton, CA) in Jun 2015", "Interview Descriptions": "1st Interview is with Director of Admissions (more conversational that questioning)\r\n2nd Interview is with Campus President (if you have metrics from your last admissions or sales position bring them)\r\n3rd Interview is phone or in person with the Regional Director of Admissions (much more casual, if you made it this far you probably already have the job, but be prepared and be yourself)", "Interview Questions": "What would your last employer say about you?\r\nWhy UEI?"}, {"date": "20 Feb 2018", "title": "Medical Billing Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at UEI College (San Diego, CA) in Mar 2015", "Interview Descriptions": "Campus President/Director insured all instructors had at least 5 yrs of experience and all continuing education certificates. All references  both professional and pesonal were thoroughly checked as well. I was personally referred by the Director of Education who is a prior professional colleague of mine at two other campuses in the past.  The interiew was held in the Campus President/Director's office. She had me shown around the campus after the interview and to the classroom I would be taking over. We both gained a mutual understanding that we had a similar work ethic and she expected 100% from her staff as the students deserved that for the time, distance driving (many came from across the border or further East to one of the only UEI campuses in San Diego) and the money students paid in tuition for their education.", "Interview Questions": "Why did I choose to become an instructor?"}, {"date": "19 Nov 2015", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at UEI College (San Diego, CA) in Jan 2015", "Interview Descriptions": "Called by the Director who setup an interview with me. Director of Finance met with me after I interviewed with my director. I met with the President of Campus 2 days later and my final interview was a phone interview with my Regional. The people here are great!!!", "Interview Questions": "Tell me about yourself? Why do you want to work for this department? What are your strengths and weaknesses"}, {"date": "1 Jul 2014", "title": "Assistant Registrar Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UEI College", "Interview Descriptions": "One in-person interview before they made a decision. Was called by HR within 2 weeks of submitting my resume, met with the director of education. It was a friendly interview, no pressure or hardball questions.", "Interview Questions": "None really, if you are prepared for the usual, i.e. \"describe a situation where you dealt with conflict in the workplace.\""}, {"date": "17 May 2014", "title": "Career Service Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UEI College (Huntington Park, Los Angeles, CA)", "Interview Descriptions": "went to their website to apply. Was called in for an interview by Director of career Services. He interviewed me first then I came back for a second interview with the College president and then he brought in the regional director who happened to be visiting who did my final interviewing.", "Interview Questions": "Needed to give many examples of how I helped students, handles stressful situations, being under pressure, and my communication skills. My relevant experience is what they honed in on asking how I handled students and their grievances and my strategies in getting students hired and getting employers to hire them. "}, {"date": "29 May 2012", "title": "Substitute Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at UEI College (Morrow, GA) in May 2012", "Interview Descriptions": "The interview process is a joke. I interviewed with the Associate Director of Education, and that was the most informal interview ever. I was then asked to come back for a second interview, which was a teaching presentation in front of two other instructors. I was never called for 3rd interview which was promised, and they have conducted a background investigation, yet have not called to make an offer or to tell me that I did not get the position. VERY UNPROFESSIONAL.", "Interview Questions": "N/A"}, {"date": "30 Sept 2013", "title": "UEI Boa Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UEI College (Huntington Park, Los Angeles, CA) in Apr 2012", "Interview Descriptions": "Interview 10-15 mins\r\nMock Lecture: you do a lecture to a group of students and/or faculty; the main goal is to demonstrate presentation skills and audience engagement.", "Interview Questions": "What do you think the demographics of a UEI student is in Hungtinton Park?"}], [{"date": "9 Feb 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UEI College (Bakersfield, CA) in Jan 2012", "Interview Descriptions": "unprofessional and I was actually not considered, but with my persistence and company understanding (built a portfolio) allowed me a chance.", "Interview Questions": "n/a"}, {"date": "8 Sept 2011", "title": "Financial Planning Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at UEI College (Anaheim, CA) in Sept 2011", "Interview Descriptions": "UEI called a week before to schedule an interview with me for the Financial Planning position.  Basically, the interviewer along with her associate asked me about 20 in-depth financial aid questions, really quizzing me on the details.  Although I answered all of the questions correctly, I did find out at the end of the interview that they had been interviewing for several weeks to fill just ONE , yes ONE position.  So, basically I knew at that point that my chances were slim because that opens the door for superficiality when you're quizzing that many applicants to fill 1 spot.\r\n\r\nAt this point, we must all accept that in this economy the employer treats 1 job opening as a pageant of sorts..pageant of unemployed freaks if you will...trying to see who will suck up or beg for the job the most and choose 1 pathetic soul for the honorable PAPER pusher role.  Don't worry, I'm not bitter...\r\n\r\nBased on what I've seen on this site, don't go if asked because you may just be wasting your time as it seems customary that this company overinterviews based on how few openings are available.", "Interview Questions": "didnt really have any unexpected question, just be prepared to discuss anything financial aid related in depth and to actually bring in real-lie experiences of how you handled certain things, i.e. verification, c-codes, etc."}, {"date": "4 Sept 2011", "title": "Career Services Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at UEI College (Irvine, CA) in Aug 2011", "Interview Descriptions": "My interview experience along with the 100+ individuals who interviewed was absolutely horrible!!!  Unfortunately UEI College preys on unemployed individuals desperate for work.  Imagine being brutally interviewed by 4 people in front of 100+ candidates and told that you must “sell yourself”.  This went on for 3 days!!!  Stay Away!!", "Interview Questions": "The interview was conducted by 4 UEI College employees.  They had a group of 100+ candidates being interviewed in front of each other.  That right there was the most insane interview process I've ever been through!!!  All the questions were ridiculous!!!"}, {"date": "26 Jun 2011", "title": "Customer Service Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UEI College (Ontario, CA) in Jun 2011", "Interview Descriptions": "The interview was somewhat unorganized.  I felt the interview was rushed and not well presented.  While I didn’t see any red flags, there were a few warning signs about how the position was described in the job description and what it actually is.  I interview on a Wednesday and the position “had to be filled by that Friday”. \r\nI feel sorry for the poor soul who takes the job thinking it’s one thing, but then turns out to be some totally different.", "Interview Questions": "N/A"}, {"date": "11 Nov 2010", "title": "Financial Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at UEI College (Huntington Park, Los Angeles, CA) in Mar 2010", "Interview Descriptions": "Brief interview process, explanation of experience and education and i was in...", "Interview Questions": "what is an MPN"}]]