[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great mission and supportive environment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Sept 2021", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "BAMA is on a mission to help others with training geared towards getting people into stable jobs in healthcare. Everyone who works here seems to care about that mission. The various departments meet regularly, communication is good, and co-workers are supportive of one another. Staff members and instructors really care about the students.", "cons": "I haven't experienced any significant cons to working here."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Would not recommend", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Jul 2023", "job_title": "Instructor in San Francisco, CA", "duration": "N/A", "pros": "Providing education to the students.", "cons": "Everything else. Especially the CEO. stay clear."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Wouldn't work there", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 Nov 2022", "job_title": "Bookkeeper in San Francisco, CA", "duration": "N/A", "pros": "Employees were very friendly and helpful", "cons": "Management doesn't know how to manage. They let me go after a week and a half and gave me absolutely no explanation. The ad I answered stated that it was a hybrid role and full time and when they offered me the position it was part time and in office. Very dis organized. I was struggling a bit but never was told there was a problem, I thought they would consider the learning curve and maybe offer a probationary period"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great Mission Awful CEO", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Dec 2021", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Staff is supportive of each other, willing to help one another out, and are receptive to feedback. Their role in serving and offering underprivileged individuals the opportunity the medical field is admirable.", "cons": "However, this is terribly marred by the fact that the CEO is a pompous, domineering, tyrannical menace that terrorizes her staff with her top-down micromanaging tendencies. The review from May 4, 2019 hits the nail on the head when describing the CEOs antics towards other personnel. She thrives on humiliating/degrading her staff when things do not go her way, and since there isn't an HR /upper management/ a mediator, she makes it her personal mission to rain hell down upon said individual. The worst part is, she doesn't care who she does it in front of, as she's known to go on a tirade, berating and condemning the individual in front of other staff, and both current and prospective students. She is the most unprofessional individual I have ever had the displeasure of knowing and working with."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Opportunity to make an impact in a shifting org", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Feb 2021", "job_title": "Externship Coordinator in San Francisco, CA", "duration": "N/A", "pros": "Growing organization - opportunity to make an impact", "cons": "Decisions felt rushed and unintentional at times."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good facility", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Oct 2020", "job_title": "Certified Phlebotomist in San Jose, CA", "duration": "N/A", "pros": "Very informative and helpful staff", "cons": "Nothing bad to say about it"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Toxic environment", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Nov 2018", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Provides employment to San Franciscans.", "cons": "Students are learning nothing by experiencing negative influence of CEO and staff. Externship and employment placement are fake just to maintain the school accreditation as they are doing now for 2019 accreditation. I don't know why this school has not being audited by the California Department of Public Health and Federal Department of Education. \r\nThe CEO yells at everyone. There's not communication and coordination. \r\nSome instructors and students are concerned about expired tools for venipuncture and other procedures. There's high risk of blood-borne disease but they don't care.\r\nTheir mission is to help low-income students. In fact, they exploit and humiliate low-income students. It's a fraud."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Would Not Recommend To Anyone.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 May 2019", "job_title": "Administrative in San Francisco, CA", "duration": "N/A", "pros": "Please see column below.", "cons": "The company is a complete mess from top to bottom. \r\n\r\nThere is no HR, and trust me, a company like BAMA drastically needs HR. \r\n\r\nThe technology that the staff uses is very dated and is not adequate for the volume of people that the company is servicing forcing the staff to work/ track our work manually and on google sheets.  Which was a total headache for everyone involved.\r\n\r\nThe CEO, herself,  is an absolutely terrible human. \r\nWhen it comes to actual change, innovation and restructuring for the better, she will intensely push back. \r\nThere are no tiers of upper management so you have direct access and communication with the CEO at all moments. There are no formalities when staff members need to be \"reprimanded\" about their behavior(s). More on that below. \r\n\r\nNow, having close proximity to the CEO wouldn't be such a huge issue if the CEO was someone who carried courtesy, respect for others, and common sense; she does not. \r\n\r\nThe CEO is an angry and unstable person. \r\nShe will micromanage you and nitpick you for doing something \"wrong\" or not exactly how she wanted it to be executed (when often she doesn't even explain to you on how she wants/needs it to be done).  And If you have grown to be someone she doesn't like--she will scream at you and publicly humiliate you in front of students, other staff members; it doesn't matter who it is. She has no respect for her workers in the matter that she speaks to them when she is angry and feels the need to degrades\\ them. Some days, she will come into the office in a good mood and other times, she will not in a good mood and she may go off on you-- for no reason at all. None of this is appropriate or professional behavior for upper management and it should not be tolerated on any premises. But, interestingly, that is the culture at BAMA. Staff members have turned a blind eye to it or have just altogether accepted the CEO's behavior. The CEO has made some staff members cry on multiple occasion and other former employees have left their position precisely because the CEO's terrible conduct. \r\n\r\nThe CEO has no integrity, and her moves are according to numbers and ratings. If she's meeting her number of enrollments and there are no bad reviews on Yelp, she is satisfied for the moment. The CEO does not care about her team's growth or well-being and she does not genuinely care about students' endeavors in the medical field. \r\n\r\nIf you are seeking jobs, keep looking elsewhere."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst company and CEO ever", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Jun 2020", "job_title": "Instructor in San Francisco, CA", "duration": "N/A", "pros": "I felt great when I left this company", "cons": "Disrespectful CEO who treats you as disposable by-product\r\nUnsupported staff\r\nToxic environment\r\nNo career advance\r\nOutdated curriculum\r\nPoor coordination concerning support to students"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Intersting Company to work for", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Mar 2016", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "Insturctors are great and very open and helpful in manuvering through situations with upper management", "cons": "No communication between employees, not a team-oriented company. Difficult to work with upper management"}], []]