[[{"date": "29 May 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Children International (Kansas City, MO)", "Interview Descriptions": "Informal coffee shop initial, phone screen by HR, 1:1 with hiring manager, panel interview with team to discuss how they do their work then and inspiring 1:1 with Executive Leader", "Interview Questions": "Why do you want t his role? \r\n"}, {"date": "3 Apr 2014", "title": "Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Children International (Kansas City, MO) in Feb 2014", "Interview Descriptions": "I was first contacted by the HR manager via email a few days after I applied via CareerBuilder. After talking with her on the phone for a bit, she asked that I complete a writing test before actually meeting with anyone about the job — something I think is probably unique to the position. I turned it in three days later and heard from her a few days after that and scheduled the first interview. Met with three people at then — the person whose position I'd be filling, the future boss and someone in marketing. It lasted about 45 minutes. During the conversation I gathered that it was a pretty laid-back atmosphere. Didn't seem like they micro-manage you there. I didn't feel too intimidated at that interview because they all were so nice.\r\n\r\nAfterward, they said they'd let me know in a week or so. They never followed up so I called the HR manager and asked about it. Left a message; never heard back. A few days later I emailed one of the people I'd interviewed with and she said they'd filled the position. But mentioned there were other positions opening up for which I'd be qualified for. Low and behold, the HR manager called me a few days later and scheduled a second interview for a different position. \r\n\r\nThe second interview took place with the same future boss, a writer, a designer and an editor. The interview took place in one of their conference rooms, with all four of them on the opposite side of me. Still not too intimidating because they joked around. This interview was about the same length as the first. After we concluded, I went to meet with the HR manager while they deliberated, I guess. I was in the HR manager's office for 20 minutes or so before she said that she'd gotten the OK to offer me the job.", "Interview Questions": "Most unexpected: What would each of your former bosses have to say about you? This was was particularly difficult because the interviewer happened to know all three of my former bosses. (Small industry in these parts.)\r\n\r\nMost difficult: Trying to describe my working style. How I prepare to write a story, how long it takes me to research, interview, write, edit. Difficult because it depends on the type of story and length and how in-depth I'm supposed to be. Plus, I've never really given it much thought."}]]