[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Best place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Feb 2023", "job_title": "Product Manager in Tampa, FL", "duration": "N/A", "pros": "Awesome honest reputable fun happy culture", "cons": "Could be a more closed information sharing company"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Please replace upper management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Jun 2023", "job_title": "Manager in Chicago, IL", "duration": "N/A", "pros": "AHIMA has the ability to be an excellent organization with many talented, hardworking staff. Unfortunately, staff leadership, put in place by an ineffective ceo, who is thankfully now leaving, has failed to produce increased membership, revenues, or products for membership. Perhaps now the organization can take off!", "cons": "Remaining executive leadership now that the ceo has been let go."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "There's always room for improvement at AHIMA", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "13 May 2022", "job_title": "Applications Developer in Chicago, IL", "duration": "N/A", "pros": "After the pandemic hit, everyone was able to work remotely. Even after most other places started returning to the office, remote work remained an option. For people like me who are not the biggest fan of commuting daily, that was a huge benefit.\r\n\r\nWhen we were in the office though, the location was great. Tons of restaurants were within walking distance. The building had many food options in the concourse, although they took a huge hit due to the pandemic and last I saw, a lot of them closed. But it was nice to just go downstairs to get food and not have to leave the building.\r\n\r\nThere is always something to do and I was never bored. The company is always planning and making changes to improve and further themselves to reach their goals. I was always accruing a backlog of things to go back and fix or improve as I worked, so I always had something to do even when I wasn't given anything by the business.\r\n\r\nThere are great people to work with. I've met and worked with some of the coolest people I've ever known throughout my career. Don't get me wrong though, not everyone I've worked with there was great. Everywhere you go, there will be good apples and bad apples.\r\n\r\nBenefits were great. I liked the 401k, health, dental, vision, and especially the PTO system. I never had an issue with running out of PTO. I especially liked the summer hours program where from Memorial Day to Labor Day, you can work a little extra every day and then take a half day off every week or a full day off every other week.", "cons": "As a preface, everything I mention here is my opinion and based on my personal experience.\r\n\r\nThere is a lot of lying, manipulation, and sucking up to upper management. I've seen and been the victim of someone in middle management or above throwing those that work below them under the bus in an effort to please upper management (or the business) or in an effort to make themselves look good to upper management (or the business).\r\n\r\nAlong the same vein, management doesn't listen to the bottom level workers that are the experts in their field. I'm specifically referring to IT, where I worked, but I believe it applied in other departments as well. When we estimated how long something would take to build or fix, people were rarely ok with it because in their mind it had to be yesterday or they already had a date they decided on or communicated, which as always, was not realistic. This meant having to stress and work extra to get things done \"on time\". The process is backwards and release dates need to be based on how long development takes at a realistic pace instead of based on arbitrary dates that the business chose based on their schedule.\r\n\r\nAs a result, a lot of our development was poorly done and resulted in a lot of my time being spent putting out fires instead of focusing on new development.\r\n\r\nThere is no QA, other than the developers themselves. The business rarely changes they requested unless there is a lot riding on the fix or new feature.\r\n\r\nThere's little to no accountability. I was working with another developer who was under-performant, who needed to change how he was doing things (he was doing some bad practices and making things worse for me). I brought it up to management and the developer in question was told to stop doing that and start doing it differently, but there was no accountability. No follow up to ensure the change in behavior stuck around. So he continued to do what he was doing before. The issue is prevalent in other areas as well because a lot of issues and bad practices in the business never get addressed.\r\n\r\nThere isn't a great emphasis on documentation. A lot of how things should be are based on who knows what. Many times I had to correct SMEs by verifying the code or data and telling them that the system is working as intended and as designed despite them claiming that it should be behaving another way. They were often times changing the rules and expecting the system to keep up. Without documentation, it's harder to argue against such claims. Also the lack of documentation makes life harder for the remaining employees after a knowledgeable employee leaves the company.\r\n\r\nPolitics. A lot of process and design decisions are based on internal strife or in regards to making money and collecting customer data, even if it comes at the cost of the customer's experience. Or if a small subset of customers are causing or having a problem, the solution involves changing the process to please them while making things harder for everyone else that was never affected by the issue to begin with. I've seen greed and short sightedness have priority over providing quality service to the customers and making sure things are easier for the customer in the long term. Also, for a non-profit organization, they sure care a lot about profit. I know a company needs to make money, but some of it comes with a \"by any means necessary\" mentality.\r\n\r\nThe 4-5 star reviews submitted in the time frame of 3/23/22 - 3/25/22 by a bunch of directors was likely done by the organization to inflate the rating here on GlassDoor. I can't say for sure, but it seems awfully sketchy to me. This is another problem I've noticed while working here - instead of addressing root causes of problems, they tend to cover it up with band-aid fixes. They may work in the short term, but the amount of technical debt they cause is staggering.\r\n\r\nLastly, a lot of organizational restructures happen, resulting in some of the better low level employees getting let go just to rehire someone else to do the same or similar job. Why not focus on training the employees to fit their new positions? A couple times the lay offs happened because a new VP or middle management person was hired."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good job", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Sept 2022", "job_title": "Manager in Chicago, IL", "duration": "N/A", "pros": "Positive coworkers and work enviroment", "cons": "None that I can think of. I enjoyed my experience."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Right Strategy to move the organization forward", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Nov 2020", "job_title": "Senior Director in Chicago, IL", "duration": "N/A", "pros": "I have worked in non-profits, healthcare and associations throughout my career. At AHIMA, they have a solid strategic plan to move the association out of decline and into growth for the future of health information professionals. In any organization, change is the constant and needs to be accepted and embraced to align the organization. Also, key to change efforts, strong communication needs to come at all levels of the organization. The CEO and Sr. Leadership team regularly communicate to employees in meetings and in emails to let staff know how we are progressing as an association. In addition, during the COVID pandemic, staff have been working remotely and have the proper equipment to do so. I would not feel comfortable commuting to the office at this time, so I am thrilled to be able to work remotely and feel totally supported.", "cons": "Change for anyone can be difficult. AHIMA has an aggressive agenda to move forward. Not all staff understand and appreciate that plan. There has been some resistance from some staff and external stakeholders who want things to stay the same. Unfortunately, status quo will result in the demise of the association. Staff and members need to realize the rapid changes in healthcare and how we need to adapt at AHIMA to stay relevant."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Culture-conscious and on-purpose", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Mar 2022", "job_title": "Global Chief Marketing & Brand Officer in Tampa, FL", "duration": "N/A", "pros": "Financially stable, mission-driven, impacting healthcare globally", "cons": "Pandemic has impacted our ability to meet in person"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Mean girl behavior", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Nov 2021", "job_title": "Manager in Chicago, IL", "duration": "N/A", "pros": "Great location - on the pedway so protected from weather with multiple shops and food venues; close to transportation (train); and office located downtown Chicago near Mag Mile and river. Beautiful and recently renovated office space with outstanding views, hard working dedicated staff and senior team, great mission with dedication to AHIMA members by staff.", "cons": "Mean girl behavior by a few staff members and board members"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "A decent company to work for", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Sept 2021", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "The employees were nice and collaborative.", "cons": "The company lacked organization when it came to upper management."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Used to be great", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Oct 2021", "job_title": "Accounting Director in Chicago, IL", "duration": "N/A", "pros": "Non profit mission, great location", "cons": "More recent regimes cleaned out a lot of institutional memory."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible Upper and lower management", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Nov 2020", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "The company is broke, staff is terrible, and only for themselves. Literally, no perks, but work from home that will be taken away once COVID is over. Do not treat employees like adults, and a bunch of liars that will smile in your face. I would never recommend this to people I know, even if they were unemployed looking for a job.", "cons": "Everything about the CEO, COO, CFO, Directors, Managers are terrible"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not for the weak", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Mar 2021", "job_title": "Accounts Payable Representative in Chicago, IL", "duration": "N/A", "pros": "The people there are nice.", "cons": "The pay is very low"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Don't go 50 feet near this place", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Apr 2013", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Some great and hardworking folks in low and mid tiers.  They all follow to the mission and very protective of the organization in a good way.  They do have great benefit and did have a great flex policy which has been taken away.  At times they do have fun with different employee engagement", "cons": "Senior leadership stinks! And that is a understatement.  They brought in bullies who only cared about their own personal agenda.  All they wanted to was destroy the credibility of the organization.  Do not care what you have done in the past or the success.  They blame  you for failure that was set forth  by previous leaderships.  If you are not liked, they will make it impossible for you to survive.  If you speak against, you will be looked down upon and no abritration process to resolve conflicts.  Management will call you out but cannot provide proof to substaniate their claims.\r\nThey hired incompetent folks who have no previous HIM experience."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Team member", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Feb 2019", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "-Company offers travel expense stipend. (If you travel by CTA/metra)\r\n-Casual dress\r\n-Met a few genuinely nice people\r\n-Location. Close to CTA lines and accessible by pedway.\r\n-Pay", "cons": "-Really tough and demoralizing team culture (specific to the team I was on)\r\n-Manager often was upset and would raise his/her voice out loud.\r\n-Manager wanted perfection and got the vibe that the team should work a lot of hours.\r\n-There was another person in a management role on the team had a reputation of being very lackadaisical. The people below him/her were miserable and contributed to the demoralizing team culture.\r\n-Had a bad experience with an employee of upper management. In my honest opinion, he/she had a very big ego and came off very unpleasantly.\r\n-I would say work here if you are very strong mentally and are very strong in your skills (hope that makes sense)."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Don't believe the recent reviews, they are fabricated by management.  Look at the trend in reviews, not plausible!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Aug 2014", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "If absolutely have no idea what you are doing, you can get a paycheck...at AHIMA.  There are people that would consider this a positive, and AHMIA manages to find them....and keep them, forever.  Whether they show up or not.", "cons": "Absolute dishonesty from senior management.  HR is solute joke.  These people couldn't run an ice cream truck.  No one can make a decision or provide leadership because they have never done it before.  When we did have a real leader at the top, peoples feelings got hurt and there was a revolt.  This place can't and won't change....ever."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great benefits, management has gone downhill", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Apr 2014", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Great medical benefits, annual bonus, casual dress two days per week, decent salary", "cons": "Complete turnover in upper management over the past two years.  New management came in and tried to reinvent the wheel, not bothering to find out from the \"worker bees\" how things have been done or tried in the past or even what the \"worker bees\" do.  A silo environment in which various departments don't communicate much, let alone work together to create a unified environment."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Best Place to Leave", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "18 Aug 2015", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Prior to 2011, it use to be a wonderful place to work. Management was very supportive, and all staff were on board to promote the field of healthcare. Benefits are good.", "cons": "Since 2011, the association's focus is on generating revenue rather than truly supporting a strong HIM workforce. Management lack basic management and communication skills, honesty, and trust. The result is the majority of staff are left unclear about strategic decisions that affect the association, staff roles and responsibilities, and vague messaging both internally and to the public."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great place to work... hard.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Nov 2013", "job_title": "Employee in Chicago, IL", "duration": "N/A", "pros": "People at AHIMA genuinely want to work hard and do a good job. They are becoming more collaborative and performance-oriented, and the culture feels much more relaxed than it did two years ago. The AHIMA members are engaged and loyal which makes daily work even more meaningful.", "cons": "There are currently a lot of changes in the works and many employees are overwhelmed with the number of projects and initiatives going on simultaneously. AHIMA needs to learn to focus and take things off its plate that are no longer vital to the company's success."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Rudderless Sorority for longtime members to live out their control and self esteem fantasies", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 Oct 2013", "job_title": "Director in Chicago, IL", "duration": "N/A", "pros": "Located in the heart of downtown Chicago, steps from everywhere cool and exciting", "cons": "Petty, ignorant, venal managers do well here. Talent not recognized let alone rewarded. The most mean-spirited, egomaniacal meddlesome board members ever. Resistant to anything resembling positive change or evolutionary effort. Lacking imagination at every turn. Rewards those who always say yes and do the misguided, political and sexist (anti-male) bidding for board that uses organization to feel important despite being over-populated with limited middle managers. Hostile to men, minorities, (especially African Americans and gay men) and those who challenge leaderships limited world view. Lots of looting of the till through phony bonus program, international travel to fake conferences, etc."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "There was a time I loved working at AHIMA.  There were opportunities to learn new skills and to succeed.  It changed.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Mar 2015", "job_title": " in Chicago, IL", "duration": "N/A", "pros": "Good insurance and there were some really great benefits like \"summer hours\".   It used to be an \"all hands on deck\" organization", "cons": "The culture and communication deteriorated after Linda.  It makes doing your job difficult, if not impossible, if you're the type of person who is dedicated to doing your best."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Some Positives but Several Negatives", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Jan 2013", "job_title": " in Chicago, IL", "duration": "N/A", "pros": "Nice and good staff members who work hard and are the bedrock of an organization that has gone through a lot of senior leadership changes.  Three CEOs in 3 years.\r\nStaff works with HR to create periodic social events as well as activities to improve health and wellness.", "cons": "Leadership. Culture is politcal and can sometimes appear unfriendly and non-inclusive. More people need to be heard and more importantly - valued.  Leadership is overly influenced by a relatively small few - some who appear self serving."}], [{"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Horrible senior management staff, lack of vision and focus.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Nov 2013", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "The people here are very friendly and they all want to do a good job and do right. I think the people who work here truly care about their work and want AHIMA to be all the things that are being told to them.", "cons": "The problem here is the lack of leadership from the senior executives to a CEO who doesn't do a good job of supporting staff against a micro-managing Board who doesn't understand a lick of strategy or their roles. Instead, staff need to constantly change and accommodate a self-serving Board and its members and as a result, nothing ever gets done around here."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "AHIMA Terrific work experience and environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Aug 2014", "job_title": "Intern in Chicago, IL", "duration": "N/A", "pros": "I have worked in many different fields but AHIMA's work-life balance is probably the best I have ever encountered. Staff members are incredibly friendly and work very hard. The summer hours are especially accommodating but there is still enough of a challenge to keep work interesting. There are many talented employees with a lot to teach you and morale is very high. Monthly meetings keep everybody on the same page and there are plenty of nice perks from the company.", "cons": "AHIMA appears to be going through some major changes which can be confusing but I think they are heading the right direction."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 0, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Work here if you believe your work will be leading to change, a change that can ultimately benefit humanity overall", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "11 Nov 2014", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "I will forever be grateful for the opportunity that AHIMA gave me.  I was able to grow at this organization and was looked at a leader just before I left. It was a very hard decision for me to leave this organization yet at the end I left not for any politics but for personal monetary gain.  Its still a decision I am coming to grips with because at AHIMA we care about change ( in the healthcare system) where I am now well its all about the $$$ I should have figured that when a Kardashian made an appearance at our place of business. If I could go back I would.  Maybe in the future I will look out for positions that I may fit into.", "cons": "For me work life balance was difficult.  I found myself in the office and then found myself working from home often this lead to some distrust in my opinion with upper management.  They felt if you are in the office things are getting done as opposed to being home and things not getting done."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Unsettled Corporate Culture", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Jul 2012", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "The people at AHIMA are very friendly and genuinely want to do a good job.  Customer service is a huge focus for the association and they bend over backwards to keep the members happy.", "cons": "No direction for the company due to substantial turnover.  The employees don't trust upper management and as a result the atmosphere is toxic.  Employees are afraid to make mistakes as they think they will be the next one terminated.  The current culture is not easy on the person tough on the problem, but rather the complete opposite."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Overrall work atmosphere", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Nov 2017", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "You can learn alot about HIM and meet some nice people with this company. There are staff who actually cares about the members and their best interest.", "cons": ". Hard work is not recognized but favoritism is. It is extremely hard to move up in the company if you are a male or a minority. Most of the minorities works in the customer service department and have no chance of getting out of those positions. Upper management mainly consists of old women who thinks they are right about everything. The company doesn't value the opinions of staff even though those staff members are the ones involved in the everyday responsibilities upper management are making the decisions for. People will leave or get fired and the position is never replaced so that work is place onto another employee; doesn't matter if you weren't trained on the new work; management will expected you to do \"that\" work and also your work in a timely manner. Upper management has made horrible decisions and staff pays the price.\r\n\r\nThe HR department is a joke. HR has no idea when it comes to HR guidelines. HR pretends like they are there looking out for your best interest but really they do what ever management tells them to do. Management can say or do what ever they want to an employee and HR will still be on their side. HR can even witness the incident and still be on management side so it doesn't matter if you have proof HR for this company with uphold management no matter what.\r\nCustomer service provided to its members are also not so good. Not sure if it's because everyone is drown in work or if staff just somewhat stop caring. I'm thinking could be a little of both. Certain staff members are also coddle due to favortism.\r\nRacism and discrimination are also prevelant among minorities and men."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Greatly improved", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Nov 2019", "job_title": "Manager in Chicago, IL", "duration": "N/A", "pros": "Poor performance is  being addressed.  New staff that are hired compliment existing staff.  Company is also growing.  Things that need to be fixed are getting budget dollars.  Internal promotions have occurred.  Can make an impact, if you want to.", "cons": "Open plan seating is not ideal.  Lots of things need to be fixed, so it still feels chaotic."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Buyer Beware", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Nov 2011", "job_title": " in Chicago, IL", "duration": "N/A", "pros": "Company was restructured from top to bottom to remove inefficiencies and to help make it a more safe and collaborative environment.", "cons": "Company is now restructured from top to bottom with new inefficiencies and with uncertainty of future, making it an unsafe and guarded environment."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Director", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "24 May 2016", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "I grew a lot there as a person and as a professional. They had a great deal of trust in staff to perform as adults and professionals.", "cons": "When I left, the organization was experiencing much change. It majorly impacted morale because staff did not always feel they new or understood the nature of the changes."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Great Experience", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Oct 2015", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Smart and hard working individuals that care about their work.", "cons": "Company started going through changes and great people were let go.  It caused a lot of anxiety and mistrust."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Customer relations rep", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Oct 2017", "job_title": "Customer Relations Representative in Chicago, IL", "duration": "N/A", "pros": "Good company to work for.", "cons": "Favoritism and unfair treatment from management."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "I would look elsewhere", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "3 Apr 2016", "job_title": "Not Applicable in Chicago, IL", "duration": "N/A", "pros": "It used to be a pretty nice place to work.  Then the culture completely changed and managers started micromanaging their staff.", "cons": "Everything.  Managers are terrible.  Everything is always broken.  Micromanaging.  Don't you dare suggest anything is wrong.  You'll be told everything is just fine and you just need to go along with every ridiculous idea the leadership has."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "lots of issues", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Sept 2011", "job_title": " in Chicago, IL", "duration": "N/A", "pros": "interesting work and lots of projects", "cons": "too many. it is going through some trouble. Steer clear till the leadership is fixed. organization does not value and respect employees who actually produce. political and lots of management and staff turnover and firings. truth is hard to come by and it is not an open environment --- trust does not exist"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Great Benefits lacks direction", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "23 Oct 2015", "job_title": "Director in Chicago, IL", "duration": "N/A", "pros": "The organization provides great benefits to its employees.", "cons": "The organization lacks strategic  direction, organization, and communication."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Customer service rep", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Nov 2016", "job_title": "Customer Service Specialist in Chicago, IL", "duration": "N/A", "pros": "flexible work environment, remote workers nationwide", "cons": "transitions in management and many departments and managers"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Certified Coding Specialist", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Nov 2019", "job_title": "Medical Coder in Baton Rouge, LA", "duration": "N/A", "pros": "Great Environment and very busy.", "cons": "I am looking to move."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Worst Non Profit Ever", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Jan 2016", "job_title": "Staff Accountant in Chicago, IL", "duration": "N/A", "pros": "If you're a feminist or a bitter, man-hating woman, this place is perfect for you.", "cons": "Too gynocentric, too many women in power who shouldn't be managers."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "None", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "26 Jun 2016", "job_title": " in Chicago, IL", "duration": "N/A", "pros": "The field is consistently and growing", "cons": "No room for advancement. Racism is prevalent."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Director", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Sept 2017", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Great employees, passionate about their work.", "cons": "Unstable. Declining market and company performance."}]]