[[{"date": "8 Aug 2021", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at MOKA", "Interview Descriptions": "The interview process was great. The environment was cordial and questions were good. \nThe questions asked there were of medium difficulty.\nThe interviewer had good amount of knowledge.\nOverall it seemed like a great working place. Looking forward to working there someday", "Interview Questions": "Tell me something about yourself."}, {"date": "19 Jun 2017", "title": "Community Supports Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at MOKA (Grand Rapids, MI) in Jan 2017", "Interview Descriptions": "I was asked to come in for an in-person interview. Two supervisors interviewed me, and they took turns asking several questions. It was a very comfortable environment that had room for open discussion.", "Interview Questions": "Describe a time when you experienced conflict within the workplace."}, {"date": "6 Jul 2015", "title": "Residential Support Staff Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at MOKA (Grand Rapids, MI)", "Interview Descriptions": "Very straightforward interview process. What-if type questions that give you hypothesis to deal with. Be honest and objective. There are no wrong answers just an assessment of your characteristics given different circumstances.", "Interview Questions": "How did you handle a coworker that was obviously breaking the rules at your work."}, {"date": "26 Jul 2016", "title": "Residential Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at MOKA in Jun 2012", "Interview Descriptions": "You go to the main office and meet up with a few people, it's super relaxed, they try and get to know you as a person. They ask you about your education, past employment, where you want to work in the area.", "Interview Questions": "they will ask you the most basic interview questions, try and see if you are a good, caring human."}], []]