[[{"date": "11 Feb 2022", "title": "Radiologic Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Conemaugh Health System", "Interview Descriptions": "Overall it took about an hour. You meet with two managers and they each ask several questions. It’s a pretty relaxed environment. I’d say there was probably 15 questions total", "Interview Questions": "What is a good reason to miss work?"}, {"date": "11 Feb 2022", "title": "Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Conemaugh Health System", "Interview Descriptions": "Questions about work history and about yourself. What your availability was if you could work all shifts. If you had a reliable way to get to work. Your work ethic how well you can work with other people.", "Interview Questions": "About what my availability looked like."}, {"date": "11 Feb 2021", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Conemaugh Health System (Roaring Spring, PA) in Feb 2021", "Interview Descriptions": "Very friendly and relaxed. Interviewed with 3 people. Benefits were explained really well and so was the description of the practice and the position. Interview process moved smoothly and took about 40 minutes.", "Interview Questions": "Why did you apply for this job?"}, {"date": "28 Mar 2017", "title": "Student Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Conemaugh Health System", "Interview Descriptions": "I applied online and got a phone call the next day for an internship. I think I got that call so fast because the deadline was really soon. I was given the choice of an in-person interview, FaceTime, or phone interview. I then scheduled a FaceTime interview for the following week. There was only one interview and she asked very straightforward and typical interview questions. The following week I was offered the position.", "Interview Questions": "Why do you want to work for us?, Strengths and Weakness type question"}, {"date": "28 Jan 2020", "title": "Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Conemaugh Health System (Johnstown, PA) in May 2016", "Interview Descriptions": "They ask about how you are with people and your work life I had two interviews for the job they give you a tour of the kitchen they ask you the temperatures of what food should be to be cooked  how you cool it down", "Interview Questions": "Name a Time you had to deal with a difficult customers and how to took care of it"}, {"date": "25 Apr 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Conemaugh Health System (Johnstown, PA) in Apr 2016", "Interview Descriptions": "Phone interview. I would say be prepared about what you would look forward to with the internship and why you are interested in it. Also think of any questions you have for the interviewer.", "Interview Questions": "What might set you apart, or differentiate you for this position?"}, {"date": "7 Jan 2019", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Conemaugh Health System (Johnstown, PA) in Jan 2016", "Interview Descriptions": "It was nice, the people were nice as well and very good company. I would've loved the job but under circumstances with family I had to decline. Would love to have another interview to accept for once!", "Interview Questions": "My intentions"}, {"date": "11 Apr 2015", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Conemaugh Health System (Ebensburg, PA) in Dec 2014", "Interview Descriptions": "Met with practice manager who managed several sites and was questioned why HR told her to interview me as the on line form did not adequately give room for experience or skills on the form. \r\n\r\nDiscussed her site where I used to work, discussed issues that we had \"back in the day\" and how they were overcome. \r\n\r\nTalked about why giving great care is important and why you need to be a team player and not leave your co-workers stranded. \r\n\r\nTalked about what the employees did in down time (read) and how they handled the stress of being a sole provider on the weekends. \r\n\r\nAsked how long the orientation process usually took, how long to learn the scheduling and payment posting system, and ins and outs of the EMR. \r\n\r\nDiscussed rotations and met with other staff. Asked them what they liked best- everything was their answer and what they liked least- nothing was the answer. \r\n\r\nFelt confident I had the skills and abilities they were looking for but did not get a call back or anything to tell me for weeks later they hired someone else.", "Interview Questions": "How do I feel about working 4 10 hour shifts ?"}, {"date": "14 May 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Conemaugh Health System (Johnstown, PA) in Mar 2013", "Interview Descriptions": "Standard interview process, HR impossible to communicate with other than in person, took at least 2-3 weeks to hear a decision, orientation for hospital was 1-2 days long,along with 1-2 day computer orientation.", "Interview Questions": "Name a challenge in your lifetime that you overcame."}, {"date": "29 Jun 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Conemaugh Health System (Johnstown, PA) in Jan 2013", "Interview Descriptions": "First contacted hr, than interviewed by a floor mamager,where I was asked a series of questions.  Then I went to another floor to interview with another manager.\r\n\r\nAsked many questions.", "Interview Questions": "N/A"}]]