[[{"date": "25 Oct 2022", "title": "Donor Information Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Donor Network West", "Interview Descriptions": "Interview was pretty standard really. Had some good thought provoking questions with a focus on situational question and answers. Have good examples of critical thinking examples ready to go. Overall it was a good experience and I’ve had much tougher interviews.", "Interview Questions": "How have you handled a tough team member?"}, {"date": "12 May 2022", "title": "Tissue Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Donor Network West", "Interview Descriptions": "two managers were interviewing me, clear with intent and polite, asked really good questions and understood my situation and worked with me. nothing else to note, interview was fast and i basically knew I had the job afterwards", "Interview Questions": "How do you deal with death ? "}, {"date": "30 Apr 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Donor Network West", "Interview Descriptions": "The interview process was straight forward. The recruiter was nice, easy to talk too, and was very detailed. They asked basic questions and it wasn’t too hard. Questions were about work ethic, balancing time, and skills. I would recommend this for any administrative assistant with at least one year of experience. Knowing healthcare helps.", "Interview Questions": "1. What is your level of experience supporting healthcare?"}, {"date": "12 Nov 2021", "title": "Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Donor Network West", "Interview Descriptions": "Phone interview then in person interview at the corporate office in San Ramon. The managers were not present so it was a zoom interview with HR present.  I was unsure why they flew me out there for a zoom interview", "Interview Questions": "What experience did I have "}, {"date": "9 May 2021", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Donor Network West", "Interview Descriptions": "In-depth.  Multiple video interviews, phone calls and finally an in person interview.  Lots of essay type questions. Took a few weeks to interview and another week or so to hear back.", "Interview Questions": "Give an example of when you failed and how you fixed it. "}, {"date": "6 Oct 2020", "title": "Tissue Recovery Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Donor Network West", "Interview Descriptions": "Flew me out to main offices for in person interview with HR manager, and Zoom call with hiring managers who were not present at the main offices on day of interview", "Interview Questions": "What are good leadership qualities others see in you "}, {"date": "23 Aug 2021", "title": "Events Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Donor Network West (San Francisco, CA) in Apr 2020", "Interview Descriptions": "The interview with Donor Network West was a quick and easy process with recruiter. The recruiter shared results with me fairly quickly. Overall the interview was a average experience as expected.", "Interview Questions": "Can you me about yourself?"}, {"date": "28 Nov 2018", "title": "Surgical Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Donor Network West", "Interview Descriptions": "Over the phone for the first interview. Then 3 different in person. The first two were with two members of the team I would become a part of and the next with a manager. They asked some pretty off the wall questions that I have never been asked before or since. Be prepared to answer some tough ones. Every interviewer ask the same thing. They have a packet they follow, but you can answer the same way for each person.", "Interview Questions": "What is one time you failed to do the right thing?"}], [{"date": "15 Apr 2018", "title": "Placement Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Donor Network West (San Ramon, CA) in Apr 2018", "Interview Descriptions": "Initially received an email then a phone call from their recruiter.  Completed two, online skill exams: 1) typing speed test, 2) medical terminology. Since I passed/got good scores, I got scheduled for a phone interview with one of the managers; for reference, I got about 80 something wpm and a 94% on the medical terminology test. After phone screen, went in for an in-person interview at their San Ramon office; the interview took about 3 hours and separated per hour for  3 groups of people—shift leaders, supervisors, and managers. Save but a few, all the interview questions were pretty general, all of the formal interviews were scripted—like the other reviews have said, they did not deviate from their sheet.  Then I got called in to shadow, which was really awesome getting to meet potential coworkers and see first hand what the job entails; I also met with some other supervisors and had another interview with one of their education department supervisors. Very lengthy but thorough, they just want to make sure they find the right people.", "Interview Questions": "Tell me your biggest mistake and how you handled it? Tell me about a time you bent the rules to get the job done? How do you manage stress?"}, {"date": "28 Jun 2013", "title": "Logistics Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Donor Network West", "Interview Descriptions": "Phone screen followed by two sets of panel interviews. One with future  co workers and one with supervisors and managers from department and sister departments. Questions were typical scripted questions.... What do you do in situations like this or that?  Would you cover up for a fellow employee? Tell me about a time you experienced conflict and how did you deal with it..", "Interview Questions": "What do you do to manage stress. "}, {"date": "24 Nov 2013", "title": "Tissue Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Donor Network West (Oakland, CA) in Jan 2013", "Interview Descriptions": "Interview after being hired, due to being hired from temp agency", "Interview Questions": "What are your worst attributes"}]]