[[{"date": "20 Jul 2023", "title": "Volenteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Heart Foundation (Chingford, England)", "Interview Descriptions": "It was quick, they asked me questions about myself and why I wanted to volunteer with them. Then they showed me a tour of the shop and I started a few days later.", "Interview Questions": "Tell me a bit about your self? Why do you want to volunteer here?"}, {"date": "13 May 2023", "title": "Customer Service Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Heart Foundation (Birmingham, England)", "Interview Descriptions": "2 panel interview, questions asked different answers needed based on previous experience. Pleasant panel lovely relaxed environment. Can't remember questions, but covered cv and transferable skills as well as why I wanted the job", "Interview Questions": "Explain your cv and what skills can you transfer to this role"}, {"date": "27 Apr 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Heart Foundation (Ilford, England)", "Interview Descriptions": "I first applied online then I received a phone call a few days later asking what location I would like to volunteer at and what days I could come in.", "Interview Questions": "What days are you available?"}, {"date": "6 Apr 2023", "title": "Digital Product Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Heart Foundation", "Interview Descriptions": "The interview process was the right balance of professional and relaxed. The panel asked good questions and were able to answer the questions I had as well very candidly. I think the interview was fair and I would be expected to have a similar experience throughout the industry.", "Interview Questions": "1. Present an end-to-end case study that you have worked on showing your process 2. What do you use to inspire your design? 3. How do you work with stakeholders with different views? 4. What is a challenge you face when working on design projects?"}, {"date": "4 May 2023", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Heart Foundation (Barnet, England) in Apr 2023", "Interview Descriptions": "Prepping for your interview is always required. The first stage of the interview process was a telephone interview. This initial interview is usually conducted by a member of the HR team and is used to assess the candidate's suitability for the role. During this interview, the interviewer may ask questions about the candidate's experience, skills, and qualifications.", "Interview Questions": "Why do you want to work for BTF?"}, {"date": "23 Feb 2023", "title": "Project Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Heart Foundation", "Interview Descriptions": "Competency-based interview questions with senior management for 1 hour, around 40 minutes for interview questions and 20 minutes for Q&A. Invited to attend interview after submitting application through their website.", "Interview Questions": "How did you problem solve?"}, {"date": "18 Feb 2023", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Heart Foundation", "Interview Descriptions": "very good question so that it got me thinking efficiently asked about what i like doing in my free time and asked why i want to work here and asked why i am good candidiate", "Interview Questions": "when do it happen to you"}, {"date": "1 Feb 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at British Heart Foundation (Leicester, England) in Feb 2023", "Interview Descriptions": "It was quick and efficient. They asked if I had done volunteering before and if I thought it would help me settle in better. Other skills were mentioned, like customer service. Overall, it was pretty relaxed.", "Interview Questions": "Have you done volunteering work before?"}, {"date": "26 Jan 2023", "title": "Senior Business Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Heart Foundation", "Interview Descriptions": "Lovely process with great interview questions that were relatable to the role. Very calm setting even on Teams which can often be hard to do. Would recommend the process. HR system was easy to use", "Interview Questions": "Role specific questions that were easy to answer if you had the right experience"}, {"date": "6 Jun 2023", "title": "Brand Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Heart Foundation (London, England) in Jan 2023", "Interview Descriptions": "First stage was a quick MS Teams screening chat, second stage was a presentation with 2 people. Interviewers were very nice and the questions weren't too tough, and the communication throughout was good, with the recruiter contacting me by phone rather than on email", "Interview Questions": "Why do you want to work for BHF?"}], [{"date": "12 Nov 2022", "title": "Health and Safety Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation", "Interview Descriptions": "I got the feeling they were going through the motions as the questions weren't very tough or probing. They seemed very enthusiastic and then never got back in touch. I saw they had appointed someone internally so I think I was the victim of a tick box exercise.", "Interview Questions": "Why did you apply for the role?"}, {"date": "21 Dec 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Heart Foundation (London, England) in Nov 2022", "Interview Descriptions": "The interview panel consisted of two people, who started the interview process formally by introducing BHF and the existing team. After 10 minutes of the interview, the questions were quite casual, and the panel expected me to answer them in a STAR fashion, by providing detailed examples. Guess, they were asking questions for the sake of the interview, while the decision had been already made in their mind. The feedback was provided after two follow-ups, but this was generic enough.", "Interview Questions": "Have you worked in a matrix environment? What project management methodologies and project tools have you used in the previous experience?"}, {"date": "2 Dec 2022", "title": "Area Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at British Heart Foundation (Maidstone, England) in Nov 2022", "Interview Descriptions": "Applied online. Received a call several months later for an interview with somone one from HR. The \"interview\" was then held locally at a BHF store in a tiny overheated office.", "Interview Questions": "Irrelevant questions about how I would influence stakeholders. This has nothing to do with a field based manager as the only people who where this question may be relevant is at board level."}, {"date": "22 Nov 2022", "title": "Health Content Creator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Heart Foundation (London, England) in Sept 2022", "Interview Descriptions": "During the interview it sounded like content creation was not a huge part of the role, so it felt like the job title and description was misleading. I had a first interview with two senior members of staff and was invited back for a final interview with the same staff and another senior staff member. I almost cancelled the second interview as I did not like the interview style (I believe it was competency based) - one of the interviewers came across as particularly unfriendly and didn't seem to have read my CV.", "Interview Questions": "1. What would you like least about this role? 2. What is your favourite word? 3. What is a health campaign you like at the moment?"}, {"date": "1 Aug 2022", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation", "Interview Descriptions": "Two part interview process: First interview was a virtual one with the regional manager. The second one with store manager - similar questions. \r\n\r\nI had both interviews in the same week. These lasted an average of 30 minutes.", "Interview Questions": "2 interviews: First one virtual - asked basic questions (tell me about yourself, why do you want to be a part of the BHF.)\r\n\r\nSecond one with store manager - similar questions. "}, {"date": "22 Nov 2022", "title": "Sales Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Heart Foundation (Birmingham, England) in Aug 2022", "Interview Descriptions": "Applied online and received a call straight away for an interview after 2-3 days. I was interviews by store manager who asked questions around my previous experience and why the career gap, The interview after that was with the area manager which went on for about 40 minutes and apart from the similar experience questions and some more scenarios.", "Interview Questions": "1. Since the shop requires a lot of sorting , how do I sort and store things around the house? 2. Information of some High end, medium and low budget retail stores as I needed to know this to ascertain prices for come clothes 3. How will I handle the volunteers? As they were not paid staff really"}, {"date": "23 Sept 2022", "title": "Head of Policy and Public Affairs Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (Cardiff, Wales) in Jul 2022", "Interview Descriptions": "For this interview, I had to prepare and present a 10 minute presentation in response to a BHF policy report, followed by 40 minutes of questions, with time left over for my own questions.", "Interview Questions": "What are some of your strengths?\r\nTell us about a time you've won someone over?"}, {"date": "22 Aug 2022", "title": "Stockroom Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (London, England) in Jul 2022", "Interview Descriptions": "online test and if successful an email/call to invite you for an interview to ask general questions like hours available and why you are right for the job. did almost all of interview bwfore they asked for my age and i was a year too young", "Interview Questions": "hours, experience, why you want to work, availability "}, {"date": "19 Jun 2022", "title": "Retail Store Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Heart Foundation", "Interview Descriptions": "Organised, friendly and encouraging. Thorough with lots of questions asked, but felt comfortable and taken care of from the offset. Nice that the interview was given by somebody local and felt non corporate", "Interview Questions": "What my past experience was "}, {"date": "29 Sept 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at British Heart Foundation (Huddersfield, England) in Jun 2022", "Interview Descriptions": "I went in expecting a formal interview but all I did was  sign some forms, no interview was conducted. Not a single interview question.  They showed me around and had me sign training sheets.", "Interview Questions": "What day would you like to come in for your first shift "}], [{"date": "14 Apr 2022", "title": "Digital Content Co-ordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Heart Foundation (London, England) in Apr 2022", "Interview Descriptions": "I was given a 5 to 10 minute take to proofread and format a page. I then had to write a meta description for this page, speak about accessibility and about some HTML knowledge.\r\n\r\nAfter this I was asked some questions", "Interview Questions": "What does equality and inclusivity mean to you?"}, {"date": "30 Nov 2022", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (Newcastle upon Tyne, England) in Apr 2022", "Interview Descriptions": "It’s a casual conversation with the store manager. There are not trick questions, and in my case I was asked about my hobbies, what I enjoy doing, and finally when I can start working!", "Interview Questions": "Why is British heart foundation for you?"}, {"date": "30 Mar 2022", "title": "Book Room Personnel Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Heart Foundation", "Interview Descriptions": "Easily scheduled, very quick process, overall a pleasant experience. I felt welcomed and at ease during the process. Felt respected and appreciated for my time. A great experience and would recommend.", "Interview Questions": "Why do you want this role."}, {"date": "25 Mar 2022", "title": "Fundraising Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Heart Foundation", "Interview Descriptions": "Sitting in a room on a chair with a table in between me and the interviewers. They held some paper from which they read questions and expected me to respond to. There was a glass of water on the table.", "Interview Questions": "Why do you want this job"}, {"date": "19 Jan 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Heart Foundation", "Interview Descriptions": "Very easy, the shop manager just wanted to know my motivation for volunteering. I just explained my passion for the charity and explained I had to volunteer somewhere on Friday afternoons due to school.", "Interview Questions": "Why do you want to volunteer here?\r\n"}, {"date": "17 Jan 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Heart Foundation", "Interview Descriptions": "Phone interview, very informal and pleasant. Asked about why you want to volunteer and where you can apply. Took less than 30 minutes. When I arrived at the store, further interview in back.", "Interview Questions": "Do you have a criminal Record? "}, {"date": "15 Dec 2021", "title": "Health content manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (London, England) in Dec 2021", "Interview Descriptions": "Animal research  and ghosted twice when I asked  for feedback.\r\n\r\nI found it misleading that there was no mention of animal testing in the detailed job pack. The interviewer mentioned it as a footnote right at the end of my first interview. \r\n\r\nIn my second interview they couldn’t answer any of my questions about their animal research. I had to ask the recruitment team who sent me a leaflet which I’d already read before the interview. \r\n\r\nThis inability to answer my simple questions was a red flag for me. \r\n\r\nTwo interviews. First involved presentation and competency questions. The second was a panel interview. This was more relaxed and they repeated questions they asked in the first. They asked me hardly any questions I worked hard prepping  for.\r\n\r\n I received a generic rejection email the next day. I asked for feedback twice but no response.", "Interview Questions": "Why do you want to join BHF? \r\n\r\nWhat can you bring to the role?"}, {"date": "18 Nov 2022", "title": "People Business Partner Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Heart Foundation in Dec 2021", "Interview Descriptions": "I applied online for the role. I had two remote panel interviews. I was asked to prepare a presentation for the second panel interview. The process was fairly fast, there was two weeks between the first interview and the outcome of the interview being communicated.", "Interview Questions": "Can you tell me about yourself?"}, {"date": "15 Nov 2021", "title": "Sales Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation", "Interview Descriptions": "Friendly face to face interview. Ask you what you know about the charity and ask you questions about yourself to get to know you better. \nAccommodating. Well organised and professional.", "Interview Questions": "What do you know about the British Heart Foundation?"}, {"date": "3 Nov 2021", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation", "Interview Descriptions": "Very easy and quick, in person conversation about why you want to volunteer and what you could bring to the team. After this you speak about your availability and what type of work you would like tk be doing", "Interview Questions": "Why do you want to volunteer gere"}], [{"date": "18 Apr 2022", "title": "Retail Sales Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (Dunfermline, Scotland) in Nov 2021", "Interview Descriptions": "Took a while to hear back from the company itself, was lucky enough to be offered a interview. \r\nDuring the interview it was very causal questions & then the interviewer just seemed like he didn’t care about my responses was odd.", "Interview Questions": "What is your availability over 7 days? "}, {"date": "17 Oct 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Heart Foundation", "Interview Descriptions": "very nice and welcoming staff with an  easy interview process which only took a few mins and just a form to fill in. you can go anytime and any day", "Interview Questions": "a situation you dealt with that was challenging "}, {"date": "2 Oct 2021", "title": "Customer Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation", "Interview Descriptions": "Interview was a mixture of standard questions and behavioural based questions.  Held online due to the pandemic, around 30 minutes long. Interview was not too difficult, but it is necessary to think of quite a few examples of situations you have faced in the past.", "Interview Questions": "Tell us of a time you faced a challenging situation, how did you deal with it?"}, {"date": "14 Sept 2021", "title": "Home Store Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (Middlesbrough, England) in Sept 2021", "Interview Descriptions": "Applied for this online and had a first interview through Microsoft Team.\n\nInterview was with the area manager and lated roughly 30 mins. The area manager was very nice and asked competency based questions and delved into my work history.\n\nThe interview was very pleasant and an overall positive experience. After the interview he explained that the next steps were a face to face interview with the regional manager and a work trial that would last a few hours in one of their stores.\n\nAfter the interview i was invited for the face to face interview but i decided not to carry on with the process as the job was very similar to what i am currently doing, and no real progression for me. This is no reflection on BHF, their processes were very professinal and effecient. I do feel they woud be a great charity to work for as they are very focused on development and a nurturing culture!", "Interview Questions": "Tell me about yourself and your work history"}, {"date": "4 Sept 2021", "title": "Retail Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Heart Foundation", "Interview Descriptions": "After sending my application form, I was invited to an interview two days later. Interview was very relaxed and welcoming. The interviewer was polite and it involved a brief introduction to the company.", "Interview Questions": "why do you want to work here?\nwhat skills can you bring?\nwhat do you think accounts for good customer service?"}, {"date": "27 Sept 2021", "title": "Health and Safety Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation in Sept 2021", "Interview Descriptions": "Awkward, clunky. Felt like I knew more about the job requirements than they did. I had done a lot of research regarding the job description yet they seemed to be asking questions nothing to do with it.", "Interview Questions": "Example of implementing a safety culture."}, {"date": "24 Aug 2021", "title": "Customer Care Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Heart Foundation (London, England) in Aug 2021", "Interview Descriptions": "Very friendly. Aked about CV, had practise questions. Briefed about day-to-day role.\r\nHad telephone interview which mostly surrounded questions from CV. Then aked to meet over Zoom, where answered more specific questions about experience and job suitability. Met a few team-members and colleagues who then practised phone presence and briefed on the role some more.", "Interview Questions": "How would I suit the role?"}, {"date": "12 Jul 2021", "title": "Community Outreach and Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at British Heart Foundation", "Interview Descriptions": "Went into shop asked if they had any volunteering opportunities, then was asked what days and hours I wanted to work, then was talked through and shown what the job evolved. Asked when I could start.", "Interview Questions": "Do you have any criminal convictions? "}, {"date": "31 May 2021", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation", "Interview Descriptions": "Interview with area manager asking questions and shop manager present.\r\nWas the dirt of questions you would expect focussing on experience.  Research charity beforehand and sone knowledge of gift aid processes would be advantageous.", "Interview Questions": "The difference between managing volunteers and paid staff?"}, {"date": "18 Jun 2021", "title": "Sales Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Heart Foundation (Halifax, England) in Jun 2021", "Interview Descriptions": "I applied a month ago, had to do an online assessment, then a quick interview on Microsoft Teams, after passing that an in-person interview at the store with two managers which was honestly quite awkward.", "Interview Questions": "What makes you suitable for the role?"}], [{"date": "10 May 2021", "title": "Digital Content Producer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation", "Interview Descriptions": "I was contacted by a member of the HR team inviting me to attend a 60-minute first-stage interview. I confirmed the date/time and received details for joining the video call, held via Teams.", "Interview Questions": "What area of the job description might I want to develop my skills in?"}, {"date": "7 May 2021", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Heart Foundation", "Interview Descriptions": "very simple process, had 2 in person interviews and went over CV, and previous work experience and then moved onto why I was interested in the role. Process took approximately 3 three weeks.", "Interview Questions": "why are you interested in this role"}, {"date": "19 Jun 2021", "title": "Sales Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Heart Foundation (London, England) in May 2021", "Interview Descriptions": "I applied for a Sales Assistant position at British Heart Foundation through Indeed.co.uk. A few weeks later I received a call from one of the store's managers for the first interview, TBH I was not told beforehand that they'll be calling to interview so I was caught off guard but the manager I spoke to was really friendly and nice.\r\n\r\nHe went through the job description, the hours I would be working if hired and what is expected of me as an employee. He explained that sales assistants are like second managers in the store and that I would be expected to run the shop on the weekends.\r\n\r\nHe only asked a few questions so you do not really need to prepare or panic about the first interview.\r\n\r\nAfter the interview, he said I would hear back from them in a week for a second interview with another manager. The following week I received an email to book my video call interview which I initially did book, but video interviews make me extremely anxious (I would much prefer a face-to-face interview instead) and so despite preparing for the interview, in the end, I couldn't attend.", "Interview Questions": "Describe yourself using three words."}, {"date": "10 Apr 2021", "title": "Marketing Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (London, England)", "Interview Descriptions": "There were two interview rounds. There was a SQL test during the first round and a presentation during the second. Questions for the presentation were emailed a few days before the interview.", "Interview Questions": "In what scenario would you use a Select Into statement?"}, {"date": "12 May 2021", "title": "Assistant Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at British Heart Foundation (Newry, Northern Ireland) in Apr 2021", "Interview Descriptions": "Online interview on Teams Microsoft\r\nIt was easy to apply and the interview itself. Questions were basically just to know you. It was one on one interview with simple style and easy choice", "Interview Questions": "What is your previous experience and what did you do "}, {"date": "16 Mar 2021", "title": "Volunteer Shop Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Heart Foundation", "Interview Descriptions": "Very informal and pleasant. Generally focused around what I was hoping to gain.  Staff were very flexible about the amount of time needed. Generally, I think the most important factor is coming across as pleasant.", "Interview Questions": "What time I could commit. "}, {"date": "25 Jan 2021", "title": "Retail Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at British Heart Foundation", "Interview Descriptions": "It was informal. I met with the head of department and manager. Was asked interview questions and questions about the company. Was very casual and the interviewers were easy to get along with. They were most interested in my experience and what I could bring to the charity.", "Interview Questions": "- What do you think is the number 1 priority for our shops?\r\n- What do you know about our research?"}, {"date": "16 Jan 2021", "title": "Sales Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation", "Interview Descriptions": "Unprofessional and time wasting, I was asked more questions about my hair colour than anything relevant to the job or my experience. When I asked if they had any interview questions, I was met with a change in personality and felt I was being rushed through it to get me out.", "Interview Questions": "Nothing relevant to the role and were more interested in my opinions on their social life"}, {"date": "14 Jan 2021", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at British Heart Foundation", "Interview Descriptions": "2 stage interview process. It was with 2 members of the team. I was invited to the offices and told exactly what I should expect. Overall it was an clear process and the culture of the organisation it good.", "Interview Questions": "My relevant experience and what I could bring to the team?"}, {"date": "15 Sept 2020", "title": "Volunteer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Heart Foundation", "Interview Descriptions": "Laid back interview with the manger discussing the role with them getting to know you. This was then followed by a difficult trial shift where you were thrown in at the deep end.", "Interview Questions": "Why this job?"}], [{"date": "15 Oct 2020", "title": "Volunteering Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (Greenock, Scotland) in Sept 2020", "Interview Descriptions": "I called in personal my as I had heard nothing back. I was really keen to do the voluntary work here. However I have heard nothing back and phoned several times to see if there was any developments.", "Interview Questions": "filled in a form giving 2 references."}, {"date": "4 Feb 2021", "title": "Volunteer Shop Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Heart Foundation (London, England) in Sept 2020", "Interview Descriptions": "I completed an online questionaire on the British Heart Foundation Website. A few weeks later I recieved a notification that I would recieve a telephone interview in the following days. The telephone interview was suprising, occuring in the middle of the day with no pre-arranged time.", "Interview Questions": "What makes you the best candidate for the role? What can you bring to the job? Can you provide me with the contact information of both your referees?"}, {"date": "27 Aug 2020", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at British Heart Foundation (London, England)", "Interview Descriptions": "I was a volunteer and the manager told me that it was a vacancy and suggested me to apply. I did it and I had the interview after a week or two weeks.  \r\nThe interview was one to one with the manager and the questions were typical.", "Interview Questions": "How do you prioritize the task for the day? "}, {"date": "14 Sept 2020", "title": "BCP DR Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at British Heart Foundation (London, England) in Jun 2020", "Interview Descriptions": "The intervew process was panel based. There were a number of competency based questions designed to ensure that the candidate was a good match for the role and its requirements. There were two interviews in total.", "Interview Questions": "Please tell us how your current experience will enable you to succeed in the role."}, {"date": "6 Nov 2022", "title": "Sales Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (London, England) in Apr 2020", "Interview Descriptions": "very easy and straightforward, asked about why you would like to work here etc. the interview was very relaxed and no pressure was there what so ever. lasted about 10 mins", "Interview Questions": "why would you like to work here?"}, {"date": "19 Feb 2020", "title": "Recruiting Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Heart Foundation (London, England) in Jan 2020", "Interview Descriptions": "I found the recruitment process, fantastic.  The recruitment team and hiring managers were actively engaging and efficient.  The recruitment portal is really easy to use.  They gave me really useful feedback and when I had questions the team where helpful and generous with their time.", "Interview Questions": "Why do you want this role?"}, {"date": "2 Mar 2020", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at British Heart Foundation (Rugby, England) in Jan 2020", "Interview Descriptions": "Got the email off of Google \r\nI emailed in and got very quick correspondance from the manager it was very quick\r\nThe actual process thereafter was very slow and many things had to be completed over many weeks", "Interview Questions": "Why did I apply to be a volunteer?"}, {"date": "6 Feb 2020", "title": "Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Heart Foundation (London, England) in Jan 2020", "Interview Descriptions": "Video Interview and 2 x face to face Interviews on 2 separate days.  Interview with the team first, then with manager and stakeholder on 2nd interview.  Disappointed that after such an in depth interview process, and having taken 2 x 1/2 days to visit the London office for face to face interviews, the rejection was by email, and without any feedback.  Still awaiting feedback but my expectation is low.  Great organisation, lovely offices, great benefits, but sadly my experience upon rejection is probably the reason they need change in Recruitment/HR.  Disappointing to have the head nods in interview when asked about giving candidates a good experience whatever the outcome, but it's not something that is actually lived through their values.\r\n\r\nMy feedback would be:\r\nHave candidates meet the manager first, don't waste candidates time.\r\nWhen you meet candidates face to face, have the respect for them to pick up the phone with the outcome of the interview.\r\nIf you offer feedback from the interviewers, please provide it, rather than just not reply.", "Interview Questions": "Tell us how to increase Diversity within the workforce"}, {"date": "10 Mar 2020", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (London, England) in Dec 2019", "Interview Descriptions": "The interview was in the shop where I am currently working for 35 minutes. The interview was with the Shop Manager. \r\nThe questions were simple, direct and the regular you can practice in advance. Good atmosphere and you feel relax and comfortable.", "Interview Questions": "Who do you decide the priority on your duties?"}, {"date": "21 Nov 2019", "title": "Sales Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at British Heart Foundation (London, England)", "Interview Descriptions": "I had gone online to learn that there was a paid Saturday sales assistant in the same shop I had been volunteering at for roughly 4 and a half years. I managed to get as far as an interview with the area manager and told to wait roughly half a week to hear back which I thought was a pretty good turn around time compared to some other companies. I had come to realise that I was up against not much competition at all for getting the job. \n\nI then got feedback from the area manager saying that my experience in general which was shown through the interview questions that I was asked along with the fact of security aspects of things for being in charge at such an age of 20 years old would not be worth the risk of letting me get the job.\n\nYet they decided to employ someone who was external to the company over someone aka myself who has had years worth of experience first hand as a volunteer.\n\nThe system of promotion to staff internally within to be able to work their way up the ranks from volunteer to certain levels of manager are not worth trying no matter how much experience internally you have had with the charity. \n\nStaffing issues seem to be an issue more and more so as time goes on in the shop I volunteered in for numerous years but is not helped by the staffing not being there that would prevent the whole security issue being there in the first place. It is one big horrible circle to go through as the reasons of staffing and security all lead back to each other in one big mess.\n\nNot only to mention of how do you expect a 20 year old to have experience in any kind of management role at all of any kind. The so called training on the job is meant to be what that covers which would include aspects such as paperwork and cashing up for example. \nI have all the customers service experience and stock sorting and replenishment skills so why let security due to poor staffing issues and what seems to be lack of willingness to be trained on the job let someone down.", "Interview Questions": "How would you cope individually and manage your team if there was a big load such as a donation when you are short on staff?"}], [{"date": "14 Sept 2019", "title": "Sales Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Heart Foundation (Lewisham, England) in Sept 2019", "Interview Descriptions": "I turned up for an interview as a Sales Assistant. The manager took me into his office and claimed the lightbulb was broken so he had to interview me in the dark. He hadn’t bothered to read my CV. The then proceeded to tell me that the job I had applied for wasn’t actually the job he was interviewing for. He was instead interviewing for someone to work on the telephone booking collections in their “call centre”. He said he didn’t have a job description for this role. Would I like to continue? Alarm bells were ringing at this point. Several things occurred to me. \r\nA. The position had already been filled\r\nB. He already had someone else in mind and was hoping his ploys would put me off\r\nC. He was terribly disorganised and I should give him the benefit of the doubt\r\nD. My face didn’t fit from the get go\r\nHe then proceeded to tell me he didn’t have any prepared questions for the role he was interviewing for. He asked a few questions in a disinterested manor. Showed me around and then dismissed me.", "Interview Questions": "Why British Heart Foundation?"}, {"date": "10 Oct 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at British Heart Foundation (Sutton in Ashfield, England) in Sept 2019", "Interview Descriptions": "You walk in to ask Volunteer then you sit down talk about why you want to help then they see if you're free for a time and day then you start.", "Interview Questions": "N/A"}, {"date": "4 Aug 2019", "title": "Volunteer Warehouse Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Heart Foundation (Birmingham, England)", "Interview Descriptions": "It was more of an informal chat rather than an interview. I was just told that I required two references and after that I could start working. You also need to bring ID with you, such as your driving licence.", "Interview Questions": "How many hours I could work a week and on what days"}, {"date": "18 Jun 2019", "title": "Volunteer Shop Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at British Heart Foundation", "Interview Descriptions": "The interview was a incredibly brief experience, the manager just asked for passport and went through health and safety procedures. She then filled out a form and I started volunteering from that day onwards.", "Interview Questions": "How many days can you volunteer?"}, {"date": "3 Jul 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at British Heart Foundation (Aberdeen, Scotland) in Jun 2019", "Interview Descriptions": "After applying online, I received an email calling me in for a quick chat in-store. After being asked a few questions about my experience and availability by the store manager, I was offered to come in whenever available.", "Interview Questions": "What is your experience working with customers?"}, {"date": "27 Jan 2020", "title": "PSO Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (London, England) in Jun 2019", "Interview Descriptions": "It was a two-stage interview process which involved an in-tray style test that lasted about 20 minutes. There were competency based questions and a few on soft skills. It was a standard interview experience.", "Interview Questions": "They asked about a time when I had to deal with a challenging stakeholder."}, {"date": "29 Jul 2019", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at British Heart Foundation (Glenrothes, Scotland) in May 2019", "Interview Descriptions": "Applied online. Got an email asking when I could come in and went in later that week. Went to the shop upstairs in the staff room and sat down with the managers. They asked me general interview questions and then discussed when I could start and volunteer there.", "Interview Questions": "Basic questions about yourself. Like whats your age?"}, {"date": "21 May 2019", "title": "Legacy Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Heart Foundation in Mar 2019", "Interview Descriptions": "Competency based question and answer interview where the two interviewers (who have to be in a more senior role than the role you are applying for) asked questions to get to know me, and gage my relevant experience and technical knowledge.", "Interview Questions": "How to prioritise different incoming tasks."}, {"date": "2 Apr 2019", "title": "Digital Strategy Lead Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at British Heart Foundation (London, England) in Feb 2019", "Interview Descriptions": "Received a phone call from HR about 2 weeks after applying online, inviting me to an interview the following week. \r\n\r\nThe interview was with the line manager and a project manager from a tech team who asked questions in turn. They were forthcoming with information about the role and how the company works and happy to answer all my questions.\r\n\r\nI asked for feedback which I received 3 weeks after the interview. It was well thought-out and useful feedback.", "Interview Questions": "Are you ok with animal testing because the company does it"}, {"date": "7 Nov 2019", "title": "Customer Service Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at British Heart Foundation (Cricklewood, England) in Feb 2019", "Interview Descriptions": "Very simple and easy question that I was asked, It last for a good amount of time I was focused on every detail of the question, i was confident, asking question on things I need to know about the job to be on top things when I get taking into the job", "Interview Questions": "My experience working at a charity shop"}], [{"date": "15 Jan 2019", "title": "Sales Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation", "Interview Descriptions": "had to complete cv and survey questions then I was invited a few weeks later for a 1 to 1 interview at the back of the shop with couple pages of questions but a chilled/relaxed atmosphere and good interview experience overall", "Interview Questions": "Why do you want to work for the BHF?"}, {"date": "12 Apr 2019", "title": "Assistant Manager F&E Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at British Heart Foundation (Chelmsford, England) in Jan 2019", "Interview Descriptions": "I had a 45-60 minute interview with the area manager. Relaxed atmosphere and very nice interviewer. There was some skills based questions and some scenario based., However the interview was informal and put my mind at ease.", "Interview Questions": "What do you know about the BHF?"}, {"date": "25 Oct 2019", "title": "Fundraising Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (Manchester, England) in Dec 2018", "Interview Descriptions": "Quite heavy and thorough - 1st interview with a presentation (2 area managers) and 2nd interview again with 2 managers and  a  3rd skype call with the head of the north.", "Interview Questions": "How would I develop the area / connection to cause / skills can contribute "}, {"date": "9 Nov 2018", "title": "Reporting Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at British Heart Foundation", "Interview Descriptions": "I had four interviews  - a telephone call and three face to face meeting.\r\nEach was concise, clear, thorough and extremely pleasant.\r\nI was kept informed of my progress on a regular basis.", "Interview Questions": "What experience would I be bringing to the foundation and how would I make use of it."}, {"date": "7 Sept 2018", "title": "Fundraising Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at British Heart Foundation (London, England)", "Interview Descriptions": "2 round interview process. First interview in person, was required to bring a presentation on a USB which the interviewers were unable to use. Didn't plan enough time to do the presentation and ask all the questions so they left a lot of the questions out. \n\nGot through to 2nd round which was a Skype interview. Less than 24hours notice and was told I was one of the final 2 candidates. Line manager never phoned or even emailed to tell me the outcome and ignored when I emailed him. Eventually heard from HR - an email template. Feedback when I finally got it was vague and HR didn't respond to my questions.", "Interview Questions": "How would you manage home working?"}, {"date": "18 Sept 2018", "title": "Paid Search Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Heart Foundation (London, England) in Sept 2018", "Interview Descriptions": "Applied online via the BHF website. 3 or 4 days after the closing date I received a phone call from HR and arranged an interview for the upcoming week.\r\n\r\nThe interview was with my would be line manager, but somewhat oddly, also with the two people I would be managing if I got the role.\r\n\r\nThe interview was a pretty standard, bland affair, with all 3 taking it in turns down the row to recite prepared questions. Mostly standard questions for this area, but then a few that were so niche to how BHF works that it wouldn't be possible to prepare in any real way for. There was also a fair few questions about how to handle internal issues and agencies going above your head, which didn't suggest good things!\r\n\r\nUltimately I didn't get offered the job probably down to my lack of managerial experience and being very hand-ons with the actual work, but I think I would have turned it down if offered anyway as there just wasn't a good vibe about the job.", "Interview Questions": "How would you handle working with an external agency who then goes against your thinking and above your head to stakeholders and leaves you out of the loop on your work? (!!!)"}, {"date": "15 Jul 2018", "title": "Warehouse Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at British Heart Foundation", "Interview Descriptions": "I applied within store to the staff I was already working with at the time, I got an interview as expected and had it with the Area manager and Store Manager. \r\n\r\nI got declined because the Area manager considered at the time that I had a \"Lack of Experience\" \r\n\r\nNow, I'd be fine with this normally. A perfectly valid reason I can understand and reason BUT.\r\n\r\nA week or (couple of weeks) later, I overheard the manager of the store offer the exact same role to an 18 year old who had no prior experience either. \r\n\r\nI understand the term was \"A shot in the dark\", with the said person. Which in all honesty was pretty degrading to me.", "Interview Questions": "What's your experience in such a role. "}, {"date": "16 Jul 2019", "title": "Electrical Functional Pass Test Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at British Heart Foundation (Liverpool, England) in Jul 2018", "Interview Descriptions": "my friend recommended me for an interview \r\ni met with manager \r\nfill up application form then submitted to the shop then next day they called me for an interview.  I have been given a day for an interview.\r\nInterview was for short because i was working as volunteer.", "Interview Questions": "Where did you hear about us"}, {"date": "3 Aug 2018", "title": "Senior Customer Service Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Heart Foundation (Claygate, England) in Jun 2018", "Interview Descriptions": "Applied online which gave the dates of interviews. Heard back within a week. Initial telephone interview followed by face to face interview   with 2 members of staff", "Interview Questions": "What do you know about the BHF retail division"}, {"date": "6 Oct 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Heart Foundation (London, England) in Jun 2018", "Interview Descriptions": "I was interviewed by two female members of staff. One would be the direct report and the other a manager in the team. The questions were tough but fair. There was a lot of emphasis on needing to bring your passport and a copy to the interview but I was never asked for it - maybe a telltale sign I had been unsuccessful. They took a long time to get back to me after the interview to let me know the outcome.", "Interview Questions": "They asked why I was moving sectors which I thought was a fair question considering BHF is a charity."}], [{"date": "25 Jul 2021", "title": "Assistant Store Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Heart Foundation (Birmingham, England) in Jun 2018", "Interview Descriptions": "Informal chat about the role based around the experience on my CV and the expectation of the shop/role, had a trial shift, found out my success a few days later.", "Interview Questions": "Very basic about current experience (voluntary), working with other people, what makes me tick, expectations of the role. The recruiting manager did more of the talking than I did! "}, {"date": "27 Aug 2019", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Heart Foundation (Birmingham, England) in Jun 2018", "Interview Descriptions": "Called in for interview then basic questions about retail amd the company. It is all about them getting to know you and how well you work in retail. Very chilled and relaxed.", "Interview Questions": "Why do you want to work for us"}, {"date": "6 Aug 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (London, England) in Jun 2018", "Interview Descriptions": "Relaxed; friendly environment with a panel of 3 people. I was able to be myself and could see myself working with the organisation and also my line manager, who was on the panel of interviewers.", "Interview Questions": "What do you want to work for BHF"}, {"date": "3 Jul 2018", "title": "Warehouse Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Heart Foundation (Huntingdon, England) in May 2018", "Interview Descriptions": "Invited to the store, the mangeress lets say showed too much leg to start with, thought that was a bit bizarre, easy questions, asked me 1 question and knew I was too educated/experienced for the role, it’s was part time 20 hrs, it would have fitted with my lifestyle, let me know- of course she didn’t, wouldn’t apply again and there was me thinking charities were open to anyone, think if you were let’s say “thick “, they would employ you...", "Interview Questions": "One question was if we had too much delivery what would you do?"}, {"date": "31 Jan 2018", "title": "Sales Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Heart Foundation (Exeter, England) in Jan 2018", "Interview Descriptions": "Applied online first, then got a call to arrange an interview 2 weeks later. Face to face interview took about 40 minutes. Questions about your skills, personality, experiences. The atmosphere was good. People are nice, but don't let the friendly environment make you so relaxed.", "Interview Questions": "How would your friends say about you?"}, {"date": "6 Dec 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Heart Foundation (London, England) in Jan 2018", "Interview Descriptions": "Really nice interview, loved it. 2 steps process: HR introduction call and in person meeting with the technology lead. I was presented current projects and met the team. I was really impressed by the passion and knowledge of the team.", "Interview Questions": "It was more a discussion"}, {"date": "19 Jul 2022", "title": "Sales Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at British Heart Foundation (London, England) in Jan 2018", "Interview Descriptions": "Great Interview process, very streamlined and very welcoming staff and management. The questions were straightforward and could be answered using the basic method of reviewing. I liked this interview process.", "Interview Questions": "Have you had sales experience before?"}, {"date": "8 May 2018", "title": "Area Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Heart Foundation (Edinburgh, Scotland) in Jan 2018", "Interview Descriptions": "2 interviewers- however only 1 spoke and the other  did not make any eye contact or speak.\r\nStandard competency based interview and being given time at end to ask any questions.\r\nWas told at end of interview would be contacted within 10 days for feedback.\r\nDid not hear back.\r\nEmailed to follow up and ask for feedback\r\nDid not receive any acknowledgement", "Interview Questions": "What do you know about the company ?"}, {"date": "21 Dec 2017", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Heart Foundation (London, England) in Dec 2017", "Interview Descriptions": "Interview process was relatively easy. I applied online and received an email about a week later asking me to come in for an interview. I interviewed with two people, one being my report lead and the other being the department head. They made for a very welcoming and friendly environment and explained the interview process very simply. The asked questions on a rotational basis.", "Interview Questions": "What attracted you to this role? "}, {"date": "22 Oct 2017", "title": "Retail Sales Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Heart Foundation", "Interview Descriptions": "2 interviews with different managers over a 3 week period.\r\nDifferent Interviewers each time, the first interview was much more relaxed and chatty. The second interview was way more tough with many more questions. \r\n\r\nThere were way more questions than this but I couldn’t remember them all.\r\n\r\nDress smart casual e.g smart trousers with plain top or black dress with smart jacket.", "Interview Questions": "Tell us what you know about the British Heart Foundation"}], [{"date": "10 Oct 2017", "title": "Store Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at British Heart Foundation", "Interview Descriptions": "Telephone interview.\nFace to face with Area Manager. (2 hrs long.)\nWork day trial in another store for 5 hours.\n3rd stage interview with Regional manager. (2 hrs long.)\n\nVery intense questions about you as a person & what drives you career wise to stay at a job. \nWhat are you searching for.\nVery physco-analysing you & your traits.\n\nThey go in detail & want too know why you left other jobs. Reason behind it. \nHow you will focus on consistently getting stock & volunteers? \nAs well as hitting budgets.\nWhat makes you tick? \nWhy should they invest in you personally.\n\nLong non-typical work related interview questions. \nMore finding out about you & your life so far, to see if you fit there growing brand image.", "Interview Questions": "how would you cope with sourcing daily stock to sell & up keep of this?"}, {"date": "18 Mar 2021", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at British Heart Foundation in Oct 2017", "Interview Descriptions": "Very informal interview, with little to no questions asked. There was also no privacy as we were just in the back room where they take donations. I was handed some very basic forms with information on health and safety and regulations.", "Interview Questions": "Why do you want the Job? "}, {"date": "22 Sept 2017", "title": "Sharepoint Adminsrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (London, England)", "Interview Descriptions": "after a phone interview was invited to a 2 nd interview were I meet the  it manager and his directors. The interview was for a hour and covered my current experience, why I was wanting to work for the heart foundation, brief explanation on the position, and general conversations on IT problems and experiences", "Interview Questions": "how would I deal with a user who had a problem that had to be elevated to a 3rd line engineer "}, {"date": "19 Aug 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at British Heart Foundation in Jun 2017", "Interview Descriptions": "Really easy process, filled in an application form in the store and read a booklet on health an safety, there were questions at the end of each section so I was re scanning some pages but was told that I don't need to do that as I wasn't going to be questioned on it. Started volunteering a few days later.", "Interview Questions": "when are you available to start"}, {"date": "7 Mar 2020", "title": "Shop Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at British Heart Foundation (Lincoln, England) in Mar 2017", "Interview Descriptions": "was referred to the store and went in got interviews, the person interviewing seemed uninterested in the whole process and was just reading lines off a sheet, it was not a very nice experience and I do now regret being at the place", "Interview Questions": "How to survive a Zombie apocalypse"}, {"date": "3 Apr 2018", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (Sheffield, England) in Mar 2017", "Interview Descriptions": "Takes about 30 mins alot of talk about them so brush up on the company will be asked if you have ever work with vulnerable people your interests if you have ever bought anything from any of their shops what was it where did you buy it etc etc alot of long winded questions", "Interview Questions": "If id ever done any sort of fund raising"}, {"date": "26 Feb 2017", "title": "Retail Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at British Heart Foundation (Edinburgh, Scotland) in Nov 2016", "Interview Descriptions": "- Asked me for availability, what I liked about retail. That's about it.\r\n- They don't really ask anything, they seriously need volunteers so if you go in and ask for a job you'll get one. No need to prep with an interview process. \r\n- Unless it's a paid position, in which case I can't help ya", "Interview Questions": "Q: What do you like about Retail."}, {"date": "11 Aug 2020", "title": "Retail Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation in Aug 2016", "Interview Descriptions": "The interview process very at the bhf was welcoming, email you to set an interview date, ask you questions and reply very soon to see if you got the job or not.", "Interview Questions": "when are you available to work?"}, {"date": "12 Aug 2016", "title": "Fundraising Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at British Heart Foundation (London, England) in Jun 2016", "Interview Descriptions": "Group interview with around 20 other people. We were asked several questions including what is your favourite colour and what it represents to you and why. I was also asked to come in the next day to the assessment center where we were given group exercises", "Interview Questions": "What is your favorite colour and why?"}, {"date": "28 May 2016", "title": "Supporter Care Administration Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at British Heart Foundation (Birmingham, England)", "Interview Descriptions": "Had one face to face interview with a manager a team leader. Pretty straight forward, no really difficult or strange questions. Questions about customer service and administration and your experience.", "Interview Questions": "What is your biggest achievement?"}], [{"date": "22 Jun 2016", "title": "Innovation Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Heart Foundation (London, England) in May 2016", "Interview Descriptions": "The interview wasn't too bad but Marketing Manager wasn't a pleasant guy. The rest of the team was fine. \r\nThey should have informed people that the new person will build the innovation department when they haven't got one", "Interview Questions": "Why do you think you may not fit this position"}, {"date": "2 Feb 2016", "title": "Assistant Store Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation in Jan 2016", "Interview Descriptions": "1 hour interview from Area Manager, who read from a list of questions. \r\nThe atmosphere was easy going and friendly. I enjoyed the interview, and so did the interviewer. I felt relaxed and the questions were at a comfortable level. I was asked a lot about my experience, and how i can use that in the vacancy, the interviewer answered my questions promptly, and i left feeling positive.", "Interview Questions": "Would you treat the paid staff and volunteers any differently?"}, {"date": "23 Jun 2016", "title": "Sales Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at British Heart Foundation (Glasgow, Scotland) in Dec 2015", "Interview Descriptions": "A 15 minute interview discussing previous retail experience. How I enjoyed working with the public and dealing with any difficult incident's How to handle working the till and banking plus cashing up.", "Interview Questions": "Why did you pick the British Heart Foundation"}, {"date": "25 Sept 2016", "title": "Head of IT Project Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Heart Foundation in Sept 2015", "Interview Descriptions": "There were two interview stages - first with the CIO and CFO, then with the CIO and chief strategy officer\r\nThe first interview was very relaxed and informal, then second less so, but both were done well.  \r\nThe second interview included a presentation, and then a set of 'tell me about a time when you' competency based questions.  The presentation topic was related to what you would do to help them deliver their five year strategy, The competency based questions were fairly normal - influencing change, dealing with teams and dealing with a lot of conflicting priorities.\r\n\r\nThey seemed to know what they were doing, and had a very clear idea of the person they were looking for (sadly not quite me), which is refreshing in this sector where so often organisations have no idea what they need in IT project management.", "Interview Questions": "how would you deal with 70 projects"}, {"date": "13 Jan 2019", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at British Heart Foundation (Kidderminster, England) in Aug 2015", "Interview Descriptions": "There was an online multiple choice section based on situations that may occur and how you would react after which I had an interview with the manager and assistant manager. Later I was called in to informally speak with the area manger and was offered the job.", "Interview Questions": "N/A"}, {"date": "9 Jul 2017", "title": "Shop Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (East Grinstead, England) in Jul 2015", "Interview Descriptions": "Applied online and got a call and asked to go in that day, i was in horsham at the time so i popped in on my way home and was wearing a white t-shirt and ripped black jeans and trainers. Had a short interview with the manager and covering area manager. Got shown around the shop and offered the job while i was there. Started two days later for training.", "Interview Questions": "What do you know about the British Heart Foundation?"}, {"date": "11 Sept 2015", "title": "Communications/Brand Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at British Heart Foundation (London, England) in Jul 2015", "Interview Descriptions": "Online application including CV and cover letter. They provided a very thorough job description which was good to know exactly the role you are applying for (don't always get such detailed descriptions!) and this made the interview easier to approach.  The interview was a positive experience - interviewers very friendly and welcoming. However, I felt it was very structured in which they asked very specific questions. For example there was no \"Tell me about yourself\" the questions were a lot more specific to the role and to the BHF itself - not very much chance to talk about yourself or your experiences which was surprising.", "Interview Questions": "Why are you applying for the BHF? Why this role?"}, {"date": "9 Jul 2016", "title": "Nutritionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at British Heart Foundation (London, England) in Apr 2015", "Interview Descriptions": "It was pretty straightforward, filled out an application form, explained why i want to work there, then they called me in for an interview. Interview was about 30 minutes and it was me being interviewed by the 2 dietitians who were lovely. The building was nice and I felt really welcomed. One of my best interviews.", "Interview Questions": "Why do you want to work here"}, {"date": "12 Jul 2015", "title": "Volunteer Retail Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at British Heart Foundation (Newcastle under Lyme, England) in Feb 2015", "Interview Descriptions": "There wasn't much to the interview process at all because it was a volunteer position and the store were in need of help at the time. I gave my details and times I would be available and the following day I arrived to go through the health and safety booklets and started working that day.", "Interview Questions": "When are you available? Why do you want to work here?"}, {"date": "9 Oct 2018", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation (London, England) in Jan 2015", "Interview Descriptions": "the hiring and interview process was very easy and they are informal when talking to you. It was a non paid position so they would definitely hire you. I did it when I was in high school and still got the job.", "Interview Questions": "experience?"}], [{"date": "12 Jun 2019", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at British Heart Foundation (Sunderland, North East England, England) in Jan 2015", "Interview Descriptions": "Quick and casual in a small room and was a one to one interview. Most questions where based on my personality and why I want to work in this area and if I had experience.", "Interview Questions": "Employment history "}, {"date": "3 Oct 2014", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Heart Foundation", "Interview Descriptions": "Starts with an online application and scenario based multiple choice questions. If successful they will call you to arrange a face to face interview (usually with the area manager) in one of their shops. Next stage is a work trial in one of their shops which I was told would be 2 hours but ended up over 4 simply because the manager didn't have time for me (too busy chatting to visiting friends) left in back areas not knowing what to do, so just asked volunteers if I could help them. Last stage is another interview with the area and shop manager and then you find out if an offer is made.", "Interview Questions": "Do you know how many shops we have?"}, {"date": "1 Feb 2018", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at British Heart Foundation (Liverpool, England) in Apr 2014", "Interview Descriptions": "Wasnt an interview, got the job through volunteering. Through in at the deep end. Was expected to telepathically know the job. They change the goal post and your expected to already know what them goal posts are", "Interview Questions": "Do you want the job"}, {"date": "5 Aug 2015", "title": "Sales Merchandiser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at British Heart Foundation (Nottingham, England) in Oct 2013", "Interview Descriptions": "I initially undertaken an online application form via the BHF website, after being referred by my manager to apply for the position. I was asked to plan a presentation, hand in a CV and covering letter.", "Interview Questions": "I was given a range of competency test questions, personality test questions and background and employment history. About 24 questions in total. If you were successful the candidate would then be invited back to work for a day to train up then if all goes well the candidate would start their new job on the following Monday."}, {"date": "17 Jan 2017", "title": "Volunteer Fundraising Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at British Heart Foundation (Oxford, England) in Sept 2013", "Interview Descriptions": "Went into the shop, spoke to the lady behind the till and then the manager, who asked me a couple of questions about how I was etc and invited me to come back to start a small shift the following weekend.  I volunteered for the Duke of Edinburgh Award, which she knew about and had had students in before, so she knew what to expect.", "Interview Questions": "when would you like to start?"}, {"date": "21 Aug 2015", "title": "Stock Room Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at British Heart Foundation (Oxford, England) in Feb 2013", "Interview Descriptions": "I met with the manager briefly but they are always on the look out for volunteers so were happy to take me on board which is nice and I had a good time. I forgot to get a referral afterwards though.", "Interview Questions": "How much working experience do you have?"}, {"date": "8 Sept 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at British Heart Foundation (Birmingham, England) in Oct 2012", "Interview Descriptions": "Searched online and handed in my CV to the store. Got called back and had an interview with the manager in store. Easy informal interview asking a few basic questions after which I was told I could start the same day.", "Interview Questions": "Why do you want to volunteer at BHF?"}, {"date": "22 May 2016", "title": "Research Graduate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at British Heart Foundation (London, England) in Jul 2012", "Interview Descriptions": "Online advertisement I contacted the group leader and sent my cv.  I was invited for a informal chat which turn out to be the actual one hour interview. I was showed the facilities and was told about the research. I heard nothing for 3 weeks, and finally got an email with the offer.", "Interview Questions": "I was asked about my interest in the position and future goals."}, {"date": "24 Sept 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at British Heart Foundation (Walthamstow, England) in Apr 2012", "Interview Descriptions": "As the job that I applied for was only for a volunteer position, there was no interview required to get the job. They simply made sure that I was 16 and possessed the relevant physical attributes needed for the job. I believe that this process will be the same for all volunteer positions", "Interview Questions": "No interview"}, {"date": "28 Feb 2016", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at British Heart Foundation in Feb 2012", "Interview Descriptions": "Informal one to one with area manager after online pre interview questions and cv upload. General questions re knowledge of charity and its targets and general personal skills questions. Approx 40 mins in total and heard I'd got the job five days after interview.", "Interview Questions": "What qualities could you bring to the organisation?"}], [{"date": "15 Apr 2015", "title": "Service Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at British Heart Foundation (Claygate, England) in Feb 2011", "Interview Descriptions": "Very thorough, 2 stage interview with questions from HR and IT angles.  I had a technical assessment which covered basic networking skills as well as questions to assess my familiarity with the retail side of the organisation - i.e. the estate of 730+ shops across the UK.  Brushing up on the values of the British Heart Foundation is essential for interview and everything you need to know can be found on their website.", "Interview Questions": "How would your colleagues describe you as a person to work with?"}, {"date": "5 Nov 2014", "title": "Retail Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at British Heart Foundation (Scarborough, England) in Nov 2010", "Interview Descriptions": "I applied for the job through the job centre and had an initial interview there. About a week later I had an interview with the store manager at the store. There was just a standard interview process whereby simple questions relating to the CV were asked. The whole interview lasted about ten minutes max. I was offered the job there and then on the day.", "Interview Questions": "N/A"}]]