[[{"date": "4 May 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Maimonides Medical Center", "Interview Descriptions": "the entire interview process was very easy. asked very basic questions about myself and what i wanted to pursue in the future and why i wanted to become a volunteer here. i would recommend this place", "Interview Questions": "why do you want to be a volunteer"}, {"date": "21 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Maimonides Medical Center", "Interview Descriptions": "Screened by recruitment, followed by an interview with unit manager. Discussed the institution, her background; and my experience first. Very direct interview questions such as “tell me about yourself,”  followed by nursing theory questions.", "Interview Questions": "Tell me a time when you handles a stressful situation"}, {"date": "18 Jun 2023", "title": "RN New Grad Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Jul 2022", "Interview Descriptions": "At the hiring event, each candidate was given an appointment time and was interviewed for at least 15 minutes. If selected; you were brought to HR for processing and hiring.", "Interview Questions": "3 Words to describe yourself"}, {"date": "22 Jul 2022", "title": "Staff Nurse (RN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Maimonides Medical Center (New York, NY) in Jul 2022", "Interview Descriptions": "I Attended the Open House Hiring Event and was interviewed. The nurse managers were very pleasant and it was a very smooth process. The interview took about 20 minutes and was asked generic questions.", "Interview Questions": "Tell me about a time you faced conflict in your previous job.\n\n"}, {"date": "14 Jun 2022", "title": "HR Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Maimonides Medical Center (New York, NY) in Apr 2022", "Interview Descriptions": "I was contacted via phone/email for an interview. The person was very pleasant. I was cycled through 6-7 interviews with the HR team. I could tell from the interviews that I was doing really well and it appeared promising. \n\nNegative - I asked during the second interview what the salary range was for the position. I was advised that they didn't share that early on in the interview process and recommended that I do not ask in the other interviews. This is an outdated suggestion. In order to ensure we are on the same page there should be transparency on salary ranges. I went through 6-7 interviews without a direct answer on salary and then after the 7th interview I was GHOSTED. I emailed the person who coordinated the interviews for an update or at the very least feedback on my interview and received no response. The great interaction I had with the HR team was soured by the fact that they did not share any salary ranges and more importantly by the fact that I was completely ghosted after spending WEEKS on calls with them. \n\nI won't be applying to this hospital again.", "Interview Questions": "Tell us about your experience"}, {"date": "28 Feb 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Maimonides Medical Center", "Interview Descriptions": "The interviewer was very friendly. It was not an intimidating experience for a new graduate nurse and it felt more like a relaxed conversation. I was able to answer her questions without fear and with confidence.", "Interview Questions": "Describe a time that you faced a challenge and how you overcame it "}, {"date": "22 Mar 2022", "title": "Project Management & Transformation Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Maimonides Medical Center in Mar 2022", "Interview Descriptions": "Submitted application via LinkedIn and was contacted the next day by someone on the team. We set up a video meeting for a quick screening. Things were going well until I was asked my compensation standards. A role like this should really be $90k and up. I shared that as my range. The interviewer stated that their max is $85k and the range is actually $75-$85. I stated my flexibility would depend on the rest of the package but I'd definitely need the top of the range so.... We closed the meeting with her confirming she would let me know either way the following week if I'd moved on. It has been 3 weeks and nothing.  Just close the loop! How hard is it to do that?", "Interview Questions": "What salary are you looking for?"}, {"date": "23 Nov 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Maimonides Medical Center", "Interview Descriptions": "Sloppy and unorganized. Interview was rushed and given in a small mop closet. The don’t take the time to get to know you. And brush you off.  Horrible experience waited for over 2hours", "Interview Questions": "Tell me about your weaknesses"}, {"date": "20 Feb 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Oct 2021", "Interview Descriptions": "It was a quick process and very organized. The process took 2 weeks and I got an answer on the 3rd week. The work environment is fast paced. There are a lot of things that need to be updated within the hospital so that the job results can be more effective.", "Interview Questions": "What made you change careers?"}, {"date": "23 May 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Maimonides Medical Center", "Interview Descriptions": "The interview process was very simple. Took at most for me 15 minutes. Questions asked about my work experience, what I can contribute, what I would like to do as a volunteer (department preferences), and my career goals.", "Interview Questions": "Why do you want to volunteer here? Which department?"}], [{"date": "19 May 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Maimonides Medical Center in May 2021", "Interview Descriptions": "Filled out applications while waiting for the interviewer, they collected necessary documents like license, degree, BLS ecard. Interview took around 30 minutes per person, interviewer was very nice, they take you around to show you the unit they worked in.", "Interview Questions": "What is the nursing process?\nHow do you handle conflict resolution?\nCritical thinking questions regarding patient care and priority care."}, {"date": "12 Jun 2021", "title": "Patient Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Jan 2021", "Interview Descriptions": "General Idea about Emergency Room. Was told about working as a team also  Manager spent most of time talking about her children. I felt inclined to speak on my family since she brought up hers. I was told about a position that in reality is not true. Only Rewish staff gets to pick their schedule. I wont say the interview was bad but certainly not what you would expect in a hospital in NYC 2021", "Interview Questions": "Tell me about yourself and last question any other opinions?"}, {"date": "4 Feb 2022", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Maimonides Medical Center (New York, NY) in Jan 2021", "Interview Descriptions": "Applied via Indeed. HR called me to set up a video interview. Spoke with two individuals for the interview. The 2nd person was late to joining the interview and did not turn on their camera, but asked a lot of questions in a roundabout way about my work situation whether it was remote or not. Then confirmed that the role is hybrid where I would WFH twice a week. It would've been nice if they would've addressed that in the job description and at the beginning of the interview since I was located 2 hours from Brooklyn. They seem desperate to hire someone though. It was an awkward end to the interview and no follow up.", "Interview Questions": "Do you have experience with Accounting?"}, {"date": "4 Dec 2020", "title": "Volunteer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Maimonides Medical Center", "Interview Descriptions": "Simple and quick.  I got a phone call, went in person with my resume. Talked to them for a bit and they told me what to expect from this role and asked what setting I would prefer.", "Interview Questions": "What does your schedule look like?"}, {"date": "29 Sept 2020", "title": "Staff Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Maimonides Medical Center", "Interview Descriptions": "Awesome hospital. They ask regular interview questions, and ask for examples and stories to get to know you better. They let you know within a week of you get the job or not", "Interview Questions": "Tell me of a time you went above and beyond for your patient"}, {"date": "10 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Maimonides Medical Center", "Interview Descriptions": "Interviewed first with nursing recruitment. Waited for 2 weeks and then heard the call back to schedule an interview with the nurse manager. The interview with manager was smooth. Received an offer on the day of interview.", "Interview Questions": "What are your strengths and weaknesses "}, {"date": "5 Mar 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Maimonides Medical Center", "Interview Descriptions": "Interviewed With Recruiter then Nurse Manager. Both very pleasant and willing to give me an honest outlook on how working there would be. Encouraged me to ask many questions which kind of helped guide the interview.", "Interview Questions": "As a New Grad, what clinicals did you find most difficult?"}, {"date": "30 Apr 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Maimonides Medical Center", "Interview Descriptions": "Interviewed with nursing recruitment first and was asked some basic behavioral questions. Recruiter took up to unit and introduced to unit manager. Entire process was around 2 hours.", "Interview Questions": "What does pain mean to you?"}, {"date": "2 Dec 2021", "title": "Financial Investigator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Maimonides Medical Center in Dec 2018", "Interview Descriptions": "Very informal and fast. As long as you are competent you will pass.  They asked what your schedule is like, do you have experience working with patients and how tech savvy are you.", "Interview Questions": " do you have experience working with patients or insurances?"}, {"date": "30 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Maimonides Medical Center in Oct 2018", "Interview Descriptions": "Lots of paperwork approximately 5 years ago, but thorough. Saw that there was religious accommodation, which was a plus. Interview ended with a tour of the unit, which was nice. Even met the manager and future co-workers", "Interview Questions": "Why did you choose nursing?"}], [{"date": "9 Jan 2019", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Sept 2018", "Interview Descriptions": "I got the interview through the 1199 union, met with HR, took 2 pre screening tests. The person I interviewed with was very nice and straight to the point. She informed me I would definitely get a call and I can contact her if anything and she gave me her business card so I can email her if they never called me.", "Interview Questions": "What was the worst experience you had in your past jobs with patients and how did you resolve the issue ? "}, {"date": "26 Aug 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Jul 2018", "Interview Descriptions": "I'll share what I remember from the interview but I only remember couple questions such as a brief introduction of what I have been doing now, and some skills question from the past work experiences.", "Interview Questions": "brief introduction about yourself, the skills you have and what you have been doing lately."}, {"date": "8 Apr 2018", "title": "Information Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 day. I interviewed at Maimonides Medical Center (Brooklyn, NY)", "Interview Descriptions": "I was Interview by a nurse manager and the head of the Department of Nursing full of my personality and hired me on the spot and I love my job no matter where I work.", "Interview Questions": "They asked me if I had compassion"}, {"date": "21 Jun 2018", "title": "Staff RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Maimonides Medical Center in Apr 2018", "Interview Descriptions": "I was there for a 8:30AM interview. The recruiter did not show up until 10:30AM. I interviewed with the nurse manager first since I had waited for 2 hours. She asked a lot of clinical questions. There was only one question about myself. The recruiter asked more about my resume and my work experiences.", "Interview Questions": "What do you know about pain?"}, {"date": "13 Mar 2018", "title": "Social Work Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Maimonides Medical Center (Brooklyn, NY) in May 2017", "Interview Descriptions": "The interview was very informative and gave me a sense of the type of work i would be doing. The interview focused less on my experience and more on who i am as a person.", "Interview Questions": "What is your five year plan?"}, {"date": "1 Apr 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at Maimonides Medical Center", "Interview Descriptions": "I first met with the recruiter; they were very nice and friendly. I met with them in their office for questions/resume review/reference review. After that I had a short break and then we met with the nurse manager who was hiring, and we did a tour of the unit.", "Interview Questions": "I honestly don't remember too many questions they asked me -- just about my career goals, what makes me unique as a nurse, etc."}, {"date": "31 Mar 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Maimonides Medical Center", "Interview Descriptions": "I recieved a call, for an interview by the nurse recruiter, she then set a date, then I went I went for the interview. Business outfit. Nurse recruiter was very professional and warm.", "Interview Questions": "If a family of a heavy patient that was just repositioned, request to be repositioned again, what will you do?"}, {"date": "2 Apr 2017", "title": "Marketing Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Maimonides Medical Center (New York, NY) in Mar 2017", "Interview Descriptions": "It was a pretty quick interview, relatively easy with easy questions. I interviewed and applied for the position on the spot at a career fair! The problem was the location was extremely inconvenient so I couldn't take the job.", "Interview Questions": "What was your previous work experience?"}, {"date": "4 Feb 2017", "title": "Rehab Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Maimonides Medical Center", "Interview Descriptions": "The first stage was a short phone interview and a few emails with the supervisor to find out about my level of experience to prepare for the hospital setting.  Once this was done they scheduled me for an interview with the department supervisor and another manager.  I toured the facility and waited a few days before receiving information about my application status.", "Interview Questions": "I was asked a series of situational question and had to verbally explain my plan of care"}, {"date": "29 Aug 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Jul 2016", "Interview Descriptions": "The questions were very easy and straightforward. The interviewer was really nice and the people there were helpful too. Although waiting for your turn might take hours but when you first walk in you will be occupied with papers to fill out, after the interview there will be a mandatory orientation to attend. There they will tell you which department you are assigned to.", "Interview Questions": "Why Maimonides?"}], [{"date": "10 Jul 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Jul 2016", "Interview Descriptions": "Maimonides Interview Process took 4+ weeks. I kept calling HR and finally landed an interview. You do a initial interview with the recruiter and if she likes you she will see what your interest is and place you in a unit which will seem best for you. Then the second interview is with the unit manager and he/she will show you around the floor and ask you some clinical and past work related question and tell you HR will contact you in a week or so if you are selected. I received a call after a week and accepted the job, esp bc I am a new grad and its hard to find a job in a hospital. Basically you have to shine and make sure you know your clinical knowledge.", "Interview Questions": "Describe did you resolve a situation you encountered with a troublesome patient?"}, {"date": "2 Feb 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Maimonides Medical Center (New York, NY) in Apr 2016", "Interview Descriptions": "Brief questioning if you already work there in another capacity/role. For current employees all paperwork requested needed to be submitted before being granted an interview. Interviewer was polite and direct.", "Interview Questions": "Nursing theory question"}, {"date": "4 May 2016", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Maimonides Medical Center (New York, NY) in Mar 2016", "Interview Descriptions": "I had an interview at first with the head of recruitment. She asked tough questions but it was not as bad as I thought. 2 weeks later I was asked to come back to meet with the Nurse manager on a specific floor. She did not ask me any questions, just showed me around and made it seem like I got the job- I did not.", "Interview Questions": "What are your qualifications? What is your experience? Describe a patient handoff."}, {"date": "18 Mar 2016", "title": "Registered Nurse, Emergency Room Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Nov 2015", "Interview Descriptions": "Two interviews, one with recruiter , one with manager, Impress both. Most likely will let you know on the spot if they like you or not. If you pass round one with the recruiter , you will get a tour of the unit you are applying for. If the manager is not sure, they will decide in about a week weather or not they really want you.", "Interview Questions": "why Emergency RN?"}, {"date": "10 Aug 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Oct 2015", "Interview Descriptions": "My hiring process includes dropping resume off in person, then got phone call back in a month for the first interview with nurse recruiter. After passing the interview with recruiter, I was schedule with a unit manager and after that will be a unit staff interview.", "Interview Questions": "Why nursing? Why MMC? What would you do in such situations? "}, {"date": "20 Sept 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Maimonides Medical Center", "Interview Descriptions": "I applied through SYEP (summer youth employment program) for a summer job.  SYEP interviewed me directly, not Maimonides. All that was asked was pretty much just asking about myself, why am I a good fit for the position, and why I want to work for them.", "Interview Questions": "Why do you want to volunteer for us?"}, {"date": "18 May 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Sept 2015", "Interview Descriptions": "The interview process was quick. What took a long time was getting the second interview set up, orientation, background check, and medical clearance. In total the process took 1 month.", "Interview Questions": "Why do you want to work here? \r\nWhat are you research interests?"}, {"date": "25 Aug 2015", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Aug 2015", "Interview Descriptions": "Received a phone call from an OT working at Maimonides and asked few questions about my resume and previous experience. Set up an interview with the OT and the administrative director few days later.", "Interview Questions": "If you were familiar with the ICU lines and if you can transfer max assist."}, {"date": "16 Apr 2017", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Jan 2015", "Interview Descriptions": "Emailed resume to director through the school and scheduled an interview. I was called the next day to schedule an in person interview. There were two interviewers. Do expect a test during the interview, asking many questions related to pharmacy.", "Interview Questions": "Why do you want to be a pharmacist? \r\nWhat were your hours like?"}, {"date": "19 Apr 2015", "title": "Resident Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at Maimonides Medical Center (New York, NY) in Jan 2015", "Interview Descriptions": "it was the match. Long drawn out and overly complicated. Overall it was great. Just be willing to wait and play by the rules. I love this place. Overall it was easy.", "Interview Questions": "what are you interested in doing with your career when you finish residency?"}], [{"date": "17 Jul 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Jun 2013", "Interview Descriptions": "I just went in to one interview and was matched based on that to my department. The interviewer was friendly and warned me about their strict dress code, particularly in regards to my department. She asked about my education background and my interests in an ideal job.", "Interview Questions": "What is your ideal job?"}, {"date": "16 Feb 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Maimonides Medical Center (Brooklyn, NY) in May 2013", "Interview Descriptions": "Interviewed with nurse recruiter, then interview with manager. The interview had a lot of personality questions, and \"What would you do in this situation.\" \"Describe a time when ..\" Interviewed with the nursing recruiter, then interviewed with the manager and a nurse on the floor. Received a tour of the unit.", "Interview Questions": "How would you deal with an angry patient?"}, {"date": "15 Jan 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Maimonides Medical Center in Nov 2012", "Interview Descriptions": "basic questions  tell me about yourself, how would you handle difficult situations, time management how do you think your experience in other facilities can benefit this department and facility", "Interview Questions": "what skills do you have?"}, {"date": "16 Oct 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Sept 2012", "Interview Descriptions": "Shanon will go easy on you. The other one (forgot her name) will not. I question their values n education or even how much they cares about the nurse vs staffing. I told them I was in school for my fnp and they pretty much told me I needed to pick one...the full time 5 day a week outpatient RN position....or go to school. It was a no brainer. Also, this interview was a floor transfer, my education was paid by them,  they they did not support it. Huh?", "Interview Questions": "What do you suspect to the older patient who passed out in the bathroom?"}, {"date": "3 May 2012", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Apr 2012", "Interview Descriptions": "I put in for a transfer within the hosp.", "Interview Questions": "How I would i  handle a very sick patient and one who may be close to death. a patient who wanted to talk to me and vent."}, {"date": "9 Apr 2015", "title": "Volunteer/Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Jul 2011", "Interview Descriptions": "Applied through the SYEP program and chose to work at Maimonides Medical Center. I was sent to the volunteer department and then to be sent to the hospital auditorium where I would be put in a different department for help needed. I was given the MMC department.", "Interview Questions": "what are your interests or which department would you like to work at?"}, {"date": "3 Nov 2015", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Maimonides Medical Center (Brooklyn, NY) in Jan 2011", "Interview Descriptions": "Hiring was straighforward. Apply and once you've been selected there is an interview process. Interview was first comducted by human resources and then with manager of the unit. If it is a match, then references are needed. A test is administered to determine knowledge base of job description. Background check as well as medical clearence follows therafter.", "Interview Questions": "What is one of your strengths?"}]]