[[{"date": "30 Jan 2023", "title": "Monitoring and Evaluation Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Relief International (Hasan Kiye) in Nov 2022", "Interview Descriptions": "There are three panel members and all of them ask one specific job related questions. The questions were competency based. At the end, they also asked when i could be available to start and salary expectation", "Interview Questions": "Describe the situation when you worked on several overlapped project How did you feel about the competing demands?"}, {"date": "24 Jul 2022", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Relief International", "Interview Descriptions": "they asked to talk about myself and then they asked how my previous jobs could benefit this position and they asked what are my strengths and weakness and they asked how to solve a problem with line manager", "Interview Questions": "what are the protection principles"}, {"date": "4 Apr 2022", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Relief International", "Interview Descriptions": "The interview was held on zoom with an HR manager and the direct supervisor. It was brief and fairly simple; the first question was for me to talk about my professional experience and the rest were ways to expand on said experience.", "Interview Questions": "Tell us about your professional experience. "}, {"date": "15 Jan 2022", "title": "HR-Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Relief International", "Interview Descriptions": "Fairly easy. Total of two rounds. One phone interview and one in-person interview with two other HR managers. I thought my interview overall was pleasant. They were very open and receptive to hearing my responses. The interview lasted less than 40 minutes.", "Interview Questions": "What are your strengths at work?"}, {"date": "17 Nov 2021", "title": "Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Relief International", "Interview Descriptions": "Had an interview for a temporary consultancy position. It was run by one HR person and another team member too who I would be reporting to. The interview started off fine, not my best performance (not their fault). However, after a few questions, I heard a message ding on the HR staff person's screen, she made a look of acknowledgment to the other team member on the call, and then they just promptly ended the interview. It was clear they no longer wanted to interview me, which is fine, but at least close out the interview. Overall, the rudest and most unprofessional interview I've dealt with.", "Interview Questions": "Asked about my experience with proposals"}, {"date": "28 Jul 2021", "title": "Independent Contractors Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Relief International", "Interview Descriptions": "It was thorough but the interviewers were kind and did not make me feel nervous, they sat with me and had a flowing conversation with me. Their culture promotes kindness and respect towards one another", "Interview Questions": "Did you get to the company alright? "}, {"date": "11 Aug 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Relief International (Gaziantep) in Jun 2021", "Interview Descriptions": "First I was invited to a written test.  After I passed the test, I was interviewed twice. First by HR, the department head and the deputy country director. Secondly only by HR. After, they offered me the position.", "Interview Questions": "Tell us about yourself.\nHow do you access to correct information?"}, {"date": "29 Jan 2021", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Relief International", "Interview Descriptions": "This was a fine process. The questions were not very hard. The process went quickly. Just two people in the interview - one technical, on from HR. The interview lasted about 45 minutes.", "Interview Questions": "They asked mostly about my experience."}, {"date": "28 Jan 2021", "title": "Accountability Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Relief International", "Interview Descriptions": "it was long and tough but the position was worth all the questions. the panel seemed friendly. however, there was no immediate feedback from the interviewers. Also, there was no opportunity to ask questions about the organization....because the information had been provided earlier.", "Interview Questions": "N/A"}, {"date": "21 Jan 2021", "title": "Development & Coms Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Relief International", "Interview Descriptions": "3 rounds of interviews, with the last being a writing test. 2nd round of interviewing was with two people. Writing test was only a few pages, and was an exercise meant to be sent back within a few hours.", "Interview Questions": "Comment on something on our website and what you think of it."}], [{"date": "5 Jan 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Relief International (Washington, DC)", "Interview Descriptions": "The process took forever with no responses from the HR or the hiring manager. I had an interview with HR, no response for ten days despite the follow-up email. Then when I decided to move on, I then received  an email for English written test, same no response for two weeks, then invitation for a panel interview, I was told that I would receive a response in  the next week. But they went radar silence, despite my several emails after three weeks of that interview no one responded at all. Two months after the whole process I learned that I was not selected after I emailed both hiring manager and HR.  \n\nJob hunting is a stressful enough process, I put a lot of efforts working on my resume and preparing for the interviews. Not being responsive means you are unprofessional and do not respect the candidate's time or efforts. My advise you either say not selected, selected or the position will remain open to get more application!!  so the job seeker dethatch and move forwarded", "Interview Questions": "How will you work remotely during COVID!! "}, {"date": "26 Sept 2020", "title": "M&Amp; E Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Relief International (Peshāwar) in Jan 2020", "Interview Descriptions": "I was contacted for an open position in Peshawar - Pakistan. I showed up 15 minutes earlier but was interviewed two hours after the scheduled time and they had no waiting room so I had to sit inside the security guard room👎. There were 5 interviewers some of which had little understanding of the questions they were asking. From the look of it I would say they were rushing it because they had to be somewhere I guess or probably the candidate was already selected and the interview was a formality. Overall the interview was average I would say, I have seen worst interviews.", "Interview Questions": "Asked me questions about MEAL"}, {"date": "26 Jul 2019", "title": "Field Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Relief International (Duhok) in Jul 2018", "Interview Descriptions": "Interview was straight forward. The process was two weeks long from first contact to job offer. Interviewers were supportive during the process, asked about prior experience and motivation to join the team.", "Interview Questions": "Support activities experience."}, {"date": "5 Mar 2018", "title": "Budget Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Relief International", "Interview Descriptions": "Overall it was a good experience. 3 people interviewed me at the same time, but questions were not hard, and people are easygoing. But do prepare what is the value of the organization.", "Interview Questions": "What's your goal in 5 years\r\n"}, {"date": "2 Feb 2017", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at Relief International (Washington, DC) in Feb 2017", "Interview Descriptions": "I have a coordinator, so she sent my resume to company.\r\nI don't know when did she send it exactly.\r\nI got an interview request 3 days ago from interview day. \r\n\r\nWe did skype during 40min, but I couldn't see her because web-cam doesn't work.  \r\nThere were intern who is helping her right now, so that I can hear some information of responsibilities and duties of HR intern.", "Interview Questions": "Q. Why would you like to work for Relief International?\r\n Explain to us what makes you suitable to do an internship with our organization."}, {"date": "9 Oct 2016", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Relief International (Los Angeles, CA) in May 2016", "Interview Descriptions": "The questions are basically behavioral. They will first ask you to go over your resume and then they will ask additional questions based on your answers. Overall, the interview is not difficult. You just need to make sure that you know your stuff and can explain them in an organized way.", "Interview Questions": "How do you keep yourself organized? "}, {"date": "28 Dec 2016", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Relief International (Los Angeles, CA) in Jan 2016", "Interview Descriptions": "Was interviewed by two department heads and the branch office chief. Stressful three-on-one environment but questions were straightforward. I applied in December but didn't hear back until several weeks later. The interview offer was very enthusiastic so I don't know why the delay was so long. After the interview I got an offer within a week.", "Interview Questions": "How will you use your experience here to grow professionally?"}, {"date": "11 Nov 2015", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Relief International", "Interview Descriptions": "Easy questions about experience, expertise, career goals. Got the interview and maybe a week later i was offered the position. The process was very fast but that could also be due to the fact that they needed someone to start right away", "Interview Questions": "N/A"}, {"date": "10 Oct 2015", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Relief International (Los Angeles, CA) in Jul 2015", "Interview Descriptions": "Interviewed in person at the Los Angeles office. Spoke with Head Hiring Manager and two other members of HR team. Very conversational but in-depth interview. Definitely probed to see motivations behind wanting this position and asked about everything listed on my resume. Interview lasted about one hour and covered all the typical personality and experiences questions.", "Interview Questions": "Why do you want to work at Relief International? What makes you the best candidate? "}, {"date": "28 Nov 2014", "title": "Human Resources Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Relief International", "Interview Descriptions": "Easy, was contacted directly by the organization when they found my resume online.  After initial interview had second and third interviews within 2 weeks span.  Was offered position shortly after", "Interview Questions": "N/A"}], [{"date": "21 Oct 2014", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Relief International (Los Angeles, CA)", "Interview Descriptions": "Simple and straight forward, nothing too difficult and was referred by a friend. The employee's are super friendly and they really looked for fit. Be yourself and you'll be fine.", "Interview Questions": "N/A"}, {"date": "11 Mar 2015", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Relief International in Jul 2014", "Interview Descriptions": "Online application, email request for more information and interview, 2 person phone interview, then 2 more 1:1 phone interviews, followed by 1:1 phone interview with CEO.  Although I was told early on that I was the top candidate, I was drawn out with little further information for 5 months, finally to be told \"we have decided to move forward with another candidate\".  Not once was I asked for a face to face interview at HQ, nor a live face to face skype interview.", "Interview Questions": "When would you be able to start as we are looking for someone to start ASAP (obviously misrepresenting, as the search took over 5 months from when I joined)."}, {"date": "29 Mar 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Relief International", "Interview Descriptions": "Phone interview with HR manager and the supervisor of position applying for both on the line.  I was asked the typical interview questions, including to walk them through my resume.  Overall, the interview was fairly short and was followed up with an offer via email a week or so later.", "Interview Questions": "What computer programs are you familiar with?"}, {"date": "10 Sept 2015", "title": "Business Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Relief International (Washington, DC) in Jan 2014", "Interview Descriptions": "Process was well organized and thorough.  They made every effort to accommodate my schedule. I met with three people throughout the entire process.  One on the phone and then an in person interview followed by a final phone interview.  This was all finished with a phone offer followed by an internet official offer via email.", "Interview Questions": "Why do you want to leave your current role?"}, {"date": "8 Sept 2016", "title": "Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Relief International (Los Angeles, CA) in Sept 2013", "Interview Descriptions": "I applied online and followed-up a week later. I talked with a very wonderful HR manager on the phone, who ended up being my supervisor! She reached out after my follow-up and the process was quite smooth.", "Interview Questions": "They asked me to go through my resume "}, {"date": "25 Aug 2013", "title": "Management Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Relief International (Washington, DC)", "Interview Descriptions": "Contacted for phone interview with one individual - quite thorough. Heard nothing for 6 weeks, then a second phone interview by the same person, another very long delay, then 'exploding offer' emailed.", "Interview Questions": "N/A"}, {"date": "8 Dec 2014", "title": "Country Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Relief International (Petit Abidjan-Youkou) in Dec 2012", "Interview Descriptions": "During the overall process, I was interviewed three times. The first time there were two person, the HR person and the Program person, less than ten days after that first interview, I was invited in a Skype interview with a member of the board and somebody from the HR, a week later I had another interview this time with the Director of Program", "Interview Questions": "No not really, people were very kind and opened to dialog"}, {"date": "17 Oct 2013", "title": "Programs Intern Interview Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Relief International (Los Angeles, CA) in May 2012", "Interview Descriptions": "The hiring process was easy enough. I was interviewed by a full department and by the time I was hired on, most of the department apart from one person had left.", "Interview Questions": "There wasn't anything too difficult"}, {"date": "30 Nov 2014", "title": "Finance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. I interviewed at Relief International in Apr 2010", "Interview Descriptions": "Applied then interviewed through a 3rd party. Interviewed professionally by HR and the CFO. Negotiated salary through the outsourcing agency. The process was speedy and I got hired quickly. Orientation was a bit limited but things have improved after that.", "Interview Questions": "A question about flexibility and responsiveness vs quality of work."}]]