[[{"date": "19 Apr 2023", "title": "New Grad RN Emergency Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Arrowhead Regional Medical Center", "Interview Descriptions": "Arrowhead Regional Medical Center Panel interview with managers, charge nurses, fellow nurses, typical behavioral interview questions and skill assessment questions. Be early, bring licenses, bring certifications, and bring a couple extra copies too.", "Interview Questions": "Strengths and weaknesses, a time you worked w a difficult coworker"}, {"date": "20 Mar 2023", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Arrowhead Regional Medical Center in Mar 2023", "Interview Descriptions": "I went in for a interview during a hiring event Was interview by 2 individuals they asked me about 6 questions all about past job experiences all the questions were from a print out that they let you look over before interview itself", "Interview Questions": "Tell me about a difficult work situation and how you overcame it."}, {"date": "4 Jan 2023", "title": "Clinic Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Arrowhead Regional Medical Center", "Interview Descriptions": "Easy through registry. They don't interview you just apply. I heard through regular interviews it is very easy process but cannot say for sure. Just know there is a lot of employee turn over", "Interview Questions": "No questions if you apply through registry"}, {"date": "3 Dec 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Arrowhead Regional Medical Center (Colton, CA) in Sept 2021", "Interview Descriptions": "The first step is putting your application in, and writing a cover let for the specific unit you’re applying for. Be sure to know why you want to work in that unit over others. They ask you about your personal life. They want fulfilled, we’ll rounded people.", "Interview Questions": "Tell me about a time that you had to deal with a disgruntled patient. How did you handle it."}, {"date": "19 Aug 2021", "title": "ED Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Arrowhead Regional Medical Center", "Interview Descriptions": "The interviewer was very direct and to the point. His questions were easy to follow. On top of that he was very optimistic and understanding. I felt the interview was conducted professionally and efficiently.", "Interview Questions": "How do you deal with emotional stress? "}, {"date": "18 Aug 2021", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Arrowhead Regional Medical Center", "Interview Descriptions": "The interview was held online via Zoom. The coordinator who scheduled the interview was not particularly helpful. They provided me with very little information about the interviewers and sent me a Zoom invitation for the wrong time date and time which caused confusion. When I joined the meeting I was surprised to see 7-8 different panelists. Then with very little introduction or meet and greet each panelist asked challenging interview questions.", "Interview Questions": "It's 2:00AM and a server goes offline. The manager who is responsible for the server is at home asleep. How do you proceed?"}, {"date": "3 Jul 2021", "title": "OR Circulating Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Arrowhead Regional Medical Center", "Interview Descriptions": "It was great and very well delivered.  Interviewer was very cheerful and understanding.  Questions were very clear and direct to the point.  Interview process was well organized and conducted in a very professional manner.", "Interview Questions": "Why will we hire you?"}, {"date": "11 Aug 2021", "title": "Student Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at Arrowhead Regional Medical Center (Colton, CA) in Aug 2020", "Interview Descriptions": "I was referred to The unit manager by a recent new grad who graduated from the same RN program as me. The manager went over case study scenarios and asked what you would do (medical surgical unit).  It is very nice working per diem since you get to chose the hours and days you work. My unit has a lot of psych patients who require 1:1 sitters, so it is not as much work compared to other units where the whole floor is split in half between two NAs.", "Interview Questions": "What are your strengths? What are your weaknesses? What would you do if you were asked to ambulate a 200 lb. patient? What would you do if you seen a puddle on the floor?"}, {"date": "21 Nov 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Arrowhead Regional Medical Center", "Interview Descriptions": "Was called for an interview with the managers of the department. When I went in I spoke with two unit managers with each of them taking turns asking me questions and discussing the unit itself.", "Interview Questions": "What is one thing you can tell me about yourself that isn't on the resume"}, {"date": "5 Apr 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Arrowhead Regional Medical Center", "Interview Descriptions": "wonderful. they were very kind and thoughtful. the process was smooth and organized. i am thankful for the experience. i recommend this hospital because of this great experience. they read the questions off of a list.", "Interview Questions": "why do you want to work here?"}], [{"date": "26 Jul 2018", "title": "ER RN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Arrowhead Regional Medical Center (Colton, CA) in Apr 2018", "Interview Descriptions": "I applied online to attend the job event Apr. 2018. There were 4 interviewers. They normally  ask around 10 questions but they only asked couple questions, and then stopped and offered me a Per-Diem Day because I only wanted Day shift. I wanted the full time day shift job, but due to the union, they can't offer full time day shift job.\n Some people told me it may take 3 months or longer. They don't give you any timeline. \n\nI did everything, like background check, health exams, and so on. (took around 1 month)\n\n\nAfter that, went to the HR and signed the paper. They said wage was not determined so I had to wait.  I have around 10 years of experience but some were in my home country. HR said they would give you credit for the experience so my wage would be determined by all of my experience. \n\nAfter signed the paper, I have never got any email or contact from HR for 3 months.  \n\n\nAlmost after 4 months, I emailed/ called HR to get an update. \n\nBecause the person who was working on my job application quit, everything was stopped from that moment. After call and email, within 2 weeks I received the real orientation dates which was 3 business days later. \n\n\nThe worst part is that the wage. \n\nThey offered me the wage for the new graduate which is $37/h (no over time after 8 hrs, $37 for 12 hrs. )\n\n\nI waited 4 months for nothing. I am still waiting for the response from supervisor. Never replies. \n\n\nThere are reason why there are so many people quit. HR is awful, pay is low, insurance cost is almost $200 per person for 2 weeks($400 per month).\n\n\nOverall, this is the worst experience ever. \nThis is work, not volunteering.", "Interview Questions": "Simple medical related questions"}, {"date": "18 Apr 2018", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Arrowhead Regional Medical Center in Apr 2018", "Interview Descriptions": "Pleasant process. Interview was short and to the point. Questions asked regarding department you may be working in.  I was able to ask questions and did not feel to nervous since the nurses doing the interviews were very personable and kind throughout the process.", "Interview Questions": "Tell me about yourself "}, {"date": "1 Sept 2017", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Arrowhead Regional Medical Center (Colton, CA)", "Interview Descriptions": "I interviewed with the unit manager for about 20 minutes.  We interviewed in her office with no other people.  She described the unit and the benefits first, then proceeded to ask me questions.", "Interview Questions": "Why do you want to work on this unit?"}, {"date": "2 May 2017", "title": "Physician Assistant ER Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Arrowhead Regional Medical Center (Colton, CA)", "Interview Descriptions": "Many critical thinking and character questions. Interview started off with a group project among the candidates then we each went before a panel of faculty and current fellows for the remainder of the interview", "Interview Questions": "What is your most prized possession "}, {"date": "11 Apr 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Arrowhead Regional Medical Center", "Interview Descriptions": "It was straightforward and to the point. The assistant manager interviewed me along with the charge nurse. The interview was one on one and they went through a list of questions. Then after the interview I was toured around the unit", "Interview Questions": "Are you involved in any associations"}, {"date": "22 Mar 2017", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Arrowhead Regional Medical Center", "Interview Descriptions": "Simple, asked a few patient care questions and questions regarding availability. Additionally asked questions on whether would be able to work holidays and weekends. Make sure you are available to work", "Interview Questions": "Would you trim the nails of a diabietic patient"}, {"date": "5 Apr 2017", "title": "L&D RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Arrowhead Regional Medical Center (Colton, CA) in Mar 2017", "Interview Descriptions": "Panel interview with director of department, manager, and two others. Hardly any ethical questions, almost all scenario. Not new grad friendly, although position was for nurse trainee. Prepare extensively. Not new grad friendly, although position was for nurse trainee. Prepare extensively.", "Interview Questions": "What are the risk factors of a 16-year old pregnant girl with no prenatal care?"}, {"date": "23 Apr 2015", "title": "Health Unit Assistance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Arrowhead Regional Medical Center (Colton, CA) in Apr 2015", "Interview Descriptions": "One person interview for Behavioral Health in a secured area \ncame at least 45 min prior to interview because it's located in a strange part of Medical Center with limited parking. ..", "Interview Questions": "It was a situation question if doctor, and phone ringing who would you attend to first?"}, {"date": "1 Oct 2015", "title": "Critical Care RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Arrowhead Regional Medical Center (Colton, CA) in Mar 2014", "Interview Descriptions": "First meeting was informal but second interview had both manager and assistant managers providing interview questions. We sat down in an office and both managers were able to ask me questions. After the interview, the manager offered me the job. The process didn't take long because I began my orientation later that week. It really depends on how soon they need someone to fill a spot. Others have told me it took them awhile after meeting the managers before getting a call back or job offer.", "Interview Questions": "Typical questions include \"what are your strengths and weaknesses\" \"where do you see yourself in 5 or 10 years\"."}, {"date": "2 Feb 2014", "title": "Clinical Dietitian Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Arrowhead Regional Medical Center", "Interview Descriptions": "Panel of 3 people: Clinical Nutrition Manager and 2 other dietitians.\r\nLots of clinical questions, including TPN and TF.", "Interview Questions": "Don't remember the exact wording, but I was asked a question on hepatic tube feeding formula and protein content."}], [{"date": "20 May 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 8 weeks. I interviewed at Arrowhead Regional Medical Center (Colton, CA) in Oct 2013", "Interview Descriptions": "I knew someone who worked there so I applied, then they picked me to interview because I knew my friend.  I came in and interviewed with the nurse manager and assistant nurse manager for the floor that wanted to hire me.", "Interview Questions": "What do you with a potassium level of 6?"}, {"date": "12 May 2014", "title": "Family Medicine Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Arrowhead Regional Medical Center (Colton, CA) in Jan 2010", "Interview Descriptions": "thru the match. visited facility with current resident, then 2 interviews. meet with program director. then wait for the match to happen. if they like you, you are golden. must show your dedication to working for a county hospital and serving the underserved. program director is quite lay back.", "Interview Questions": "pretty standard questions. no surprises."}]]