[[{"date": "12 Oct 2022", "title": "program manager lead in public relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at California College of the Arts (San Francisco, CA) in Sept 2022", "Interview Descriptions": "I only got through the first phone interview only to be ghosted. I interviewed on a Monday and was told that I would know the statues by the end of the week or beginning of next week. Mid next week came around so I sent a follow up email to see if I could get an update, waited an extra week and a half but got no reply. I already wasn’t sure if I would get another interview but I would’ve liked at least some confirmation or communication.", "Interview Questions": "Walk me through your previous job. What is your understanding of this position?"}, {"date": "15 Mar 2022", "title": "Press Relations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at California College of the Arts (San Francisco, CA) in Jan 2022", "Interview Descriptions": "Completed a 45 minute phone screening. Head of the department said to email with any questions. I did. He never responded, but he did use my questions for the next stage of the interview (which was conducted during an employee strike). Overall I wasn't impressed.", "Interview Questions": "How would you source stories for the media? Explain how your background relates to the duties described. "}, {"date": "27 May 2022", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at California College of the Arts (San Francisco, CA) in Jan 2022", "Interview Descriptions": "Application through LinkedIn or workday. It is easy to apply if you have a student account because I am currently a student in the school and they allow me to", "Interview Questions": "We are already able to communicate in the CCA community while studying as a student."}, {"date": "3 May 2022", "title": "Student Activities Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at California College of the Arts (San Francisco, CA) in Nov 2021", "Interview Descriptions": "4 rounds of interviews with the manager, colleagues, students and director. They sent the questions of the interview in advance, which helped preparing. The staff was nice and responsive, the questions were challenging. They pay attention to who they hire", "Interview Questions": "What approach do you take in communicating with people? In-person and online."}, {"date": "28 Jul 2022", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at California College of the Arts in Jun 2021", "Interview Descriptions": "Fairly smooth with good communication by hiring manager. First interview was through phone, second was a panel zoom interview that included a short presentation. Scenario based questions. Process took roughly a month.", "Interview Questions": "Tell me about a time when you had to deal with a difficult situation with a colleague."}, {"date": "18 Mar 2021", "title": "International Student Adviser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at California College of the Arts (San Francisco, CA) in Feb 2020", "Interview Descriptions": "It was just a phone interview (audio interview) and the process was quite simple and short. The questions are composed of standard interview questions. It would have been more effective as a video interview.", "Interview Questions": "How is your experience relevant to the role? "}, {"date": "3 Jun 2019", "title": "Marketing Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at California College of the Arts", "Interview Descriptions": "Hiring manager was a consultant working out of the East Coast. We had a video chat. I appreciate that they were transparent and shared the salary right away, as it was below market rate for the Bay Area.  As much as I would have loved to have done the job, there is no way someone with the qualifications they were looking for could afford to live in the Bay Area on that salary.", "Interview Questions": "The salary is $70,000- are you OK with that?"}, {"date": "3 Apr 2019", "title": "Director of Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at California College of the Arts (New Paltz, NY) in Mar 2019", "Interview Descriptions": "Zoom interview with consultant from her home in New York. Very awkward. Realized immediately that I had more experience than the interviewer. Moreover, I felt something was off with her and the haphazard way they were managing marketing and public relations. News releases on their website are not written in AP style and contain questionable content. I question how this consultant finagled her way into this role with CCA and it certainly raised red flags.", "Interview Questions": "Didn't ask any questions.  Just gave a long history of her role with the college.  Then I detailed my current role. That's it. She was humorless and clearly uninformed about major artists and architectural landmarks in the Bay Area which immediately made it seem like a pointless endeavor.  Seems odd for a place like CCA to employ a conservative homophobe from clear across the country.."}, {"date": "18 May 2022", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at California College of the Arts (San Francisco, CA) in May 2018", "Interview Descriptions": "The interview process was straightforward - I felt that there was good, honest communication from their team. The panels I interviewed with were warm and genuine people, who truly cared about the institution. I felt welcomed and listened to.", "Interview Questions": "Name a situation in which you overcame a workplace obstacle."}, {"date": "5 Apr 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at California College of the Arts in Apr 2018", "Interview Descriptions": "Relatively fast hired within a month of applying. First phone screening, then team interview via Zoom and a third interview was scheduled, but instead, it was actually an offer call. Friendly initially and then more formal and challenging in the panel interview.", "Interview Questions": "What was your experience managing crises? How do you work with demanding faculty and competing interests?"}], [{"date": "19 Feb 2018", "title": "Assistant Director of Career Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at California College of the Arts (Oakland, CA) in Nov 2017", "Interview Descriptions": "Quite extensive process, phone screening, 20 minute Skype panel interview with 3 department staffers, then 3 hour on campus interview including a 10 minute presentation. This was expected during normal business hours, so needed to take time off of work. Also, at the in person interview, I was told the salary range was substantially lower that what had originally been posted. I assumed they goofed with the original listing. The job offer allowed for minimal salary negotiation only after I had accepted the position. \r\n\r\nAt the end of the 3-hour interview, I was told I would need to provide 4 references, requiring one to be my current supervisor. I found this to be quite a surprise, as it is an obvious risk to my current position and standing with the company. When I expressed my concern, the interviewee insisted that it would be required or that I would be taken out of the running.  I was pretty turned off by the experience as there were multiple unprofessional and disorganized elements of the process. For instance, they were late for the meeting and the room they had scheduled was not available. I was not offered the position and they didn't bother to even send an email letting me know their final decision. Disrespectful to the time put in to go through the process. \r\n\r\nEspecially coming from the Career Development office, the experience was highly unprofessional. I honestly feel sorry for students who look to this department for guidance as they go out into the world and apply for positions.", "Interview Questions": "Asked about past experiences, challenges I have faced with clients, something I consider as one of my greatest accomplishments, etc."}, {"date": "26 Oct 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at California College of the Arts (San Francisco, CA)", "Interview Descriptions": "Process as follows:\nTelephone screening interview (40 minutes)\nFirst interview (45 minutes) with hiring manager, two program managers and subject advisor.\nSecond interview (1 hour) with hiring manager, another hiring manager, chairs of two academic programs, followed by 1:1 meeting with dean.", "Interview Questions": "How would your colleagues describe you?"}, {"date": "12 Sept 2017", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at California College of the Arts (Oakland, CA)", "Interview Descriptions": "The interviewers were very pleasant and easy going. Was a good interview experience. I had three interviews. They will keep me in mind for future opportunities. Would interview again if another opportunity comes up during my job search.", "Interview Questions": "what if scenario questions and cultural fit questions"}, {"date": "14 Sept 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at California College of the Arts (Oakland, CA) in Aug 2017", "Interview Descriptions": "Had one phone, one panel and a one on one. Enjoyed the people I interviewed with. Very relaxed.  Very welcoming. Did not get an offer but they really enjoyed meeting me and will keep me in mind for future opportunities.", "Interview Questions": "Situational and cultural fit questions"}, {"date": "12 Jan 2016", "title": "Director of Annual Giving Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at California College of the Arts (Oakland, CA) in Dec 2015", "Interview Descriptions": "I submitted a résumé through the usual methods -- through the organization's website. I also had a personal, internal referral. I was contacted by the hiring manager who set up a phone interview. They have been searching to fill the position since the summer and are finding it to be a challenge to find people who have the right combination of skills and experience. The interviewer was smart, kind and organized. I have not been offered the job but I have also not been eliminated as a candidate.", "Interview Questions": "They asked about my fundraising skills and experience. They asked about my understanding of data analytics. "}, {"date": "24 Feb 2016", "title": "Lab Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at California College of the Arts (Oakland, CA) in Aug 2015", "Interview Descriptions": "I was hired on the spot and wasn't really asked any questions besides what my availability is and when I can start. The Supervisors are previous students so they are incredibly chilled out but also sensitive to your needs.", "Interview Questions": "When can you start"}, {"date": "15 Jul 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at California College of the Arts (Oakland, CA)", "Interview Descriptions": "Phone interview followed by a panel consisting of half a dozen or more participants from across the organization.  The panel consisted of a number of structured questions about your values and interests, and your personal interests. How do you handle work stress?  Do you have any creative interests?  Why do you want to work at CCA?", "Interview Questions": "How do you work with persons involved in creative endeavors."}, {"date": "20 Jun 2017", "title": "Ops Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at California College of the Arts (San Francisco, CA) in Nov 2014", "Interview Descriptions": "Great, friendly people. There was a phone screening first, then in person. Hiring manager kept in touch the whole time.  3 people in screening, 5 in the interview. There were 2 other candidates, as I found out later.", "Interview Questions": "Difficult situation "}, {"date": "1 Apr 2016", "title": "Film Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at California College of the Arts (San Francisco, CA) in Aug 2014", "Interview Descriptions": "The superviser asked me questions and I answered them. We had a conversation about my major and work background. Overall, the experience was positive. The interview was not hard as it is a work study.", "Interview Questions": "How many hours do you want to work?"}, {"date": "25 Feb 2013", "title": "Enrollment Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at California College of the Arts", "Interview Descriptions": "pretty standard phone and in-person interview", "Interview Questions": "expectations from the supervisor"}]]