[[{"date": "12 Apr 2023", "title": "Academic Staff Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at HCT (Dubai)", "Interview Descriptions": "Interview with HR, followed by a panel interview online. The panel consisted of five (assistant) professors from different locations of HCT across the Emirates. Afterward, a final HR call on the package. Overall very smooth and quick process.", "Interview Questions": "Experience with online learning environments. Experience with online teaching and learning."}, {"date": "3 Nov 2022", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HCT (Dubai) in Nov 2022", "Interview Descriptions": "Introduction from HCT side in 5 minutes, Introduction from the candidate side in 5 minutes, Candidate presentation 10 minutes (selected topics), Interview questions 15 minutes in coding and about academic background.", "Interview Questions": "What is polymorphism in OOP?"}, {"date": "21 Mar 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at HCT", "Interview Descriptions": "Not a structured interview and it depends on your connection in the organization. You might get interviewed by people who have  a Master degree or people from East Asia which means you won't get the job if you are really skilled", "Interview Questions": "what would you do if a student asks for more marks?"}, {"date": "25 Jan 2022", "title": "Faculty Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 6 months. I interviewed at HCT (Dubai) in Dec 2021", "Interview Descriptions": "I was not expecting that HCT for the 2nd time will reject my candidacy based on my religion's sect. Both times I have successfully completed my technical as well as Executive Dean interview with position remarks. I got salary details with allowance but the last step is when they send the applicant the \"Introductory form\", which decides whether you will be hired or not. I have been rejected both times and upon search on the internet, I concluded that if you are a \"Shia Muslim\", there is no space for you in HCT whatever you are a skilled and qualified professional person. They still doubt your honesty and denies to get a job for which you qualified successfully for the series of interviews.", "Interview Questions": "Technical and behavioral interview questions."}, {"date": "28 Aug 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at HCT", "Interview Descriptions": "Depends on department. Generally questions about how you deal with students in difficult situations. For example,  if you have a student who is giving you problems in class and does not follow instructions.", "Interview Questions": "How do you deal with a difficult student"}, {"date": "5 Mar 2021", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at HCT", "Interview Descriptions": "I applied in February  and I received an interview request after few months, they sent  me an email  containing the date and the timing and also describing the interview process, the arrangements,  and the committee members", "Interview Questions": "what is your research interest"}, {"date": "2 Feb 2021", "title": "Lecturer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at HCT", "Interview Descriptions": "Not good, they didn't care about my knowledge as much as my home country I was pumped by the fact they didn't care about all the degrees that I have", "Interview Questions": "Alot of questions I was asked "}, {"date": "5 Jun 2021", "title": "Laboratory Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at HCT (Abu Dhabi, Abu Dhabi) in Feb 2021", "Interview Descriptions": "They contacted me over the position, asking for a next day interview with teaching demonstration, I asked for a two days delay as I have my job and I am busy. \n\nThe panel consists of 2 PhD holders from the department I intend to join + HR officer. The interview was smooth and friendly, different technical questions related to my experience and to the position, I answered most of the questions, the questions I didn’t answer where not related to my background at all. \n\nThey sent me an email the 2nd day saying the interview came with very positive feedback and we need to continue the hiring process after the team and HR agreed on me. So it is a matter of time to receive the offer or joining letter.\n\nThen, they asked for a bunch of documents, references and certificates which I all provided and the process was going smooth until here.\n\nTHE SHOCK is that after 3 weeks they sent me a rejection letter as the committee (higher management) rejected my application, without mentioning any clear reason, which left me in denial and confusion????\nI contacted my references to make sure they provided a good feedback on me and they confirmed and sent me a copy of the reference letter. It was more than perfect.\n\nThe management or what ever committee was there, who didn’t interview me, didn’t see me, and seems like they didn’t take in consideration the panel positive feedback + good references, just rejected my application for no clear reason! \nNote: it was not related to security clearance as mostly this is the critical part in the hiring. Security clearance came clean already as the HR mentioned after I called them. I called the HR to ask for the reason, she didn’t know, it came from the management, Even the HR mentioned that everyone is upset ad they wanted you in the department.\nAnyway, hct still a good place to work in as I asked some employees, but I didn’t get lucky this time.", "Interview Questions": "If you had an assignment that all the class got very low grades? What would you do?"}, {"date": "22 May 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at HCT (Dubai) in Apr 2020", "Interview Descriptions": "Interview process is generally Panel Interview, extremely comprehensive, at times serialized interviews over a period of 2 to 3 months for several campuses. Expect either Face-2-Face or via Video... Very professional", "Interview Questions": "Achievements at current job, Define and qualify Industry Expertize Explain Higher Education accomplishments."}, {"date": "3 Jul 2018", "title": "Faculty IT Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HCT (Abu Dhabi, Abu Dhabi)", "Interview Descriptions": "The overall feeling can be described in one word\" uncomfortable \", the video conference interview makes you feel really ode... i believe that when you interview people face to face is more respectful way, the interview it self was lame, as other previous feedbacks here about the interview said that there is one guy plays the role of \"mean interviewer\" this guy was really disrespectful, started stating technical questions assuming that you are aware of EVERY single field of IT, however the CV tells that im not involved in that topic, i felt that his point just to let you feel that you are worthless... the same guy started to ask about my the research activities and asked why my name is not listed in Scopus ranking as a researcher.. i debated him about this that i am already indexed any i have a paper published in journal which is indexed by scopus. After the interview was done i looked and searched for this guy's research history to find out that his last published paper was in 2015 ... 3 years ago... and its even not published in journal indexed by scopus. The other members gave several questions most of them are technical \" which i still didn't understand .. whats the point of such a questions\" ...i suppose that getting more information about my teaching methods is much important than such a shallow questions. Overall it was time waisting disappointment and  bad experience.", "Interview Questions": "How to deal with a student which asked you to repeat an exam for him/her."}], [{"date": "24 Jul 2018", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at HCT (Abu Dhabi, Abu Dhabi) in Jul 2018", "Interview Descriptions": "I was informed about the interview one week before it append. It started on the specified time. It took about 30 minutes. I was interviewed by 6 people. Four of them asked their questions but the other two were watching and they didn't ask any question.  The place and the atmosphere were comfortable and freindly.", "Interview Questions": "Tell us about your experience?"}, {"date": "4 Apr 2021", "title": "Technical Role Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at HCT (Abu Dhabi, Abu Dhabi) in Jun 2018", "Interview Descriptions": "It was very comprehensive. Leaders from different divisions were involved and the interview was recorded for quality assurance purposes. It was a pleasant experience and the interview process is very valid in the selection process", "Interview Questions": "Questions included my experience, various scenarios on how i had or may manage. I was asked about my people management skills."}, {"date": "16 May 2022", "title": "Head-HR Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at HCT (Dubai) in Feb 2018", "Interview Descriptions": "Excellent...   Well organized, indepth, panel interviews and serialized interviews across 17 campuses... with layered screening, validation till final interviews....  Extremely professional, at global level.... fantastic cultural and regional dynamic integration with reach to attract both regional and international professionals", "Interview Questions": "Role Play and Scenario questions on behaviour, capability and capacity to perform"}, {"date": "24 Jul 2021", "title": "Faculty Member Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HCT (Dubai) in Jan 2018", "Interview Descriptions": "online interview , i received the appointment for the interview three days before the fixed time, they ask me to prepare a lecture for 20 minutes then three faculty members start interviewing me they ask technical questions and some general question totally the interview take 50 minutes, after one day i received an email saying that they have a positive feedback from the committee and they will send offer i received the offer and i accepted the offer, after one month i received another email saying that they propose now lecture position instead of assistant prof with less salary .", "Interview Questions": "how you can deal with students have different levels of understanding"}, {"date": "25 Nov 2017", "title": "Academic Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HCT (Abu Dhabi, Abu Dhabi) in Jun 2017", "Interview Descriptions": "They changed the appointment on Skype three times and only half of the board appeared. Questions about my studies (1991-1996) seemed more relevant than my professional experience and my 2 y/o MBA. Absolutely disengage team which probably needed to complete a number of interviews to justify giving the job to “their”candidate.", "Interview Questions": "What would you do if students turn to their mobiles during your lesson?"}, {"date": "24 May 2017", "title": "Adjunct Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at HCT (Abu Dhabi, Abu Dhabi) in May 2017", "Interview Descriptions": "HR employee refused to introduce himself on the phone. He rescheduled the interview three times. He said I wouldn´t need to prepare a PowerPoint or a master class, which it would have been very much useful. One of the three board members did not appear. I was interview online from 20 kms. distance from the place, they did not set up a personal meeting. \r\nThe interview lasted about 50 minutes and I did not feel any strong preparation from the interviewers about what they were offering, instead they ask to \"improvise\".\r\nMy feeling about their lousiness is that another candidate was already chosen but they have to justify a number of interviewed candidates. None of the interviewers working at the College of Media had a degree in Journalism - Media - Communications.", "Interview Questions": "How many credit hours of your degree are about the position you are interviewing today?"}, {"date": "18 Apr 2017", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HCT (Dubai) in Jan 2017", "Interview Descriptions": "It was just a normal interview; recruiters were not very interested; they didn't listen carefully to what I said. I was told that I will be given a chance to ask questions but at the end nobody seemed to bother if I had any question.", "Interview Questions": "Tell us about your education and job history"}, {"date": "5 May 2019", "title": "Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at HCT (Dubai) in May 2016", "Interview Descriptions": "I was aware that they are well-known for bullying and playing bad cop/good cop during the interview, but I was unprepared for the utter rudeness and bullying that did occur.  It almost felt that they wanted to shame and humiliate me as much as possible. I have an MA and 20 years experience in the field of teaching, and have interviewed people quite a bit in my life so was quite taken aback at how unprofessional it was. A friend did end up getting the job and loathed it there to the point where she has since gotten out of teaching, so I guess it was lucky I stayed put in my current position.  (Please note: the interview was via Skype and the selection below on GlassDoor requires a city but the entire interviewing process was done online)", "Interview Questions": "What level of Common European Framework of Reference for Languages my textbooks fell under. I am American and at the time, was unfamiliar with this tool. Now  some time later it has become more common where I teach and I could easily answer this. This wasn't a difficult question but it was after ignoring my answers and scorn in the earlier interview that it came so it tripped me up. "}, {"date": "26 Jun 2019", "title": "English Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HCT (Al Fujayrah, Fujairah) in Jun 2015", "Interview Descriptions": "I sat with chair of the department in the conference room with one other interviewer via video call. She asked about 15 questions which took an hour. They were questions that I had seen on google searches mostly.", "Interview Questions": "How was the PD at your previous schools?"}, {"date": "17 Nov 2015", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 9 months. I interviewed at HCT (Abu Dhabi, Abu Dhabi) in Mar 2015", "Interview Descriptions": "I was interviewed over a form of skype by two people representing University management. The interview lasted about an hour and was very interesting. The interview was actually a very interesting conversation and I found the questions to be excellent. The interviewers were interested in critical reflection and in-depth answers. I actually really enjoyed it.", "Interview Questions": "They asked me about my research interests."}], [{"date": "13 Apr 2016", "title": "Senior OFFICER - Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at HCT (Sharjah) in May 2014", "Interview Descriptions": "Video recorded interview with a three member panel including a senior college head, HR representative and department supervisor. This was followed by state security check, although I was already an existing staff and applied to an internal vacancy. (If lucky, the process from interview to job start date could take 3-4 months.)", "Interview Questions": "What are the two most important skills required to be a successful HR professional?"}, {"date": "16 Feb 2016", "title": "Business Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at HCT (Dubai) in Mar 2014", "Interview Descriptions": "Three tier process. Telephone interview by the chair. Then it was followed by panel interview comprised of three interviewers. Two in person and the third one virtually Then a presentation in the class.", "Interview Questions": "Work experience and teaching style"}, {"date": "8 Apr 2017", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at HCT (Dubai) in Jan 2014", "Interview Descriptions": "Was interviewed by a panel of two. Not much structure but standard questions on how I would deal with contentious situations. Then discussed how would I attempt to make the department more cohesive and the type of training/professional/personal development I would encourage with the staff.", "Interview Questions": "How would you deal with a staff member who does not get on with other staff?"}, {"date": "9 May 2017", "title": "Associate Dean Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HCT in May 2013", "Interview Descriptions": "Submit an on-line application, you are then contacted by HR and asked to update or provide  reference details. If you are screened in you will be informed on-line in a few days. After a couple of weeks, you may be asked to attend an interview with 3 or more senior level staff, although uncommon, you may be called for a second interview. Wait several weeks for a result.", "Interview Questions": "What is your management style?"}, {"date": "9 Dec 2017", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at HCT (Dubai) in Jan 2013", "Interview Descriptions": "It takes for ever to get through the bureaucratic process of recruitment. No transparency on how nationality plays a role into the selection process or even the final offer provided to applicants.", "Interview Questions": "previous experience"}, {"date": "15 Feb 2016", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at HCT (Abu Dhabi, Abu Dhabi) in Dec 2012", "Interview Descriptions": "Extensive on-line application, attestation and equivalency required from State Department and Ministry of  Foreign Affairs. Many submissions of hard copies of materials. Face to face encounters with faculty and HR staff. Finally had to leave the country to actually receive  a formal invitation for interview.", "Interview Questions": "How do you deal with students that show little initiative?"}, {"date": "12 Oct 2016", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HCT (Dubai) in Jun 2012", "Interview Descriptions": "It was ok with three people interviewing me.  There were moderate type of questions some situational.  the interview lasted 1 hour as we were also talking about other things at the same time.", "Interview Questions": "How would you handle a class with mixed study skills?"}, {"date": "22 Mar 2016", "title": "English Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at HCT (Sharjah) in Feb 2012", "Interview Descriptions": "The chair of the Foundations department and one other via Skype or similar from another college.  Both asked me questions about previous jobs and hypothetical situations concerning learners, there was nothing too difficult.  They asked me about what my previous job entailed, my strengths and weaknesses in the classroom and when I would be free to join.  I felt quite confident during and after the interview as they were both pleasant and made me feel comfortable.", "Interview Questions": "If your supervisor walked into your classroom what would s/he see?"}, {"date": "9 Aug 2013", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at HCT (Dubai) in Feb 2011", "Interview Descriptions": "The interview was done using Skype.  I interviewed with two department heads simultaneously.  One department head played 'mean interviewer' and one played 'nice interviewer'.  I found out that other faculty had had the same experience.", "Interview Questions": "One interviewer was intentionally rude.  This seems to be part of the HCT interviewing strategy."}]]