[[{"date": "15 Jul 2021", "title": "Psychiatric Inpatient Social Worker Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Hendricks Regional Health (Avon, IN)", "Interview Descriptions": "Interview was fine, they reached out to me months after I applied. I had an initial discussion about the job and my experience over the phone before they wanted me to come in. \nI received an offer, but declined- the pay offered was very low, no benefits info was offered and the offer included me starting before what was agreed upon in the interview.", "Interview Questions": "What are you areas of interest for your career?"}, {"date": "17 Apr 2021", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hendricks Regional Health (Abilene, TX) in Apr 2021", "Interview Descriptions": "My interview was kinda lengthy but not bad, I was shocked when they called me for a second interview,  it was pretty short, and was blessed to get the job", "Interview Questions": "How long are you going to stay,  and what brought you to Hendricks medical center "}, {"date": "13 Dec 2020", "title": "Human Resources Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 months. I interviewed at Hendricks Regional Health (Danville, IN)", "Interview Descriptions": "All interviews were very easy. Just expect to wait 30 days in between each one. Don’t bother reaching out because they won’t respond, or be helpful with any questions. The entire team is Middle Aged white women with no diversity so overall I’m glad another opportunity became available.", "Interview Questions": "All questions were very common. Tell me about yourself, why Hendricks, what are your goals, and other behavior based questions."}, {"date": "4 Aug 2020", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Hendricks Regional Health in Aug 2020", "Interview Descriptions": "I applied for a specific position and followed up through HR the following week. I received a call from HR and then was asked for an interview the next day. I met with the manager the very next day.  I was extended an offer within 3 days.", "Interview Questions": "Out of all seven company values, which do you relate to the most and why?"}, {"date": "6 Aug 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hendricks Regional Health (Abilene, TX) in Jul 2020", "Interview Descriptions": "Done via Facebook msg video call!  Was outstanding to see and meet the people I would be working with! The explanation of job duties and expectations was phenomenal. Covered all aspects of the position.", "Interview Questions": "Why do you want to work here?"}, {"date": "16 Jun 2020", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Hendricks Regional Health (Danville, IN)", "Interview Descriptions": "Went in for an HR interview.  After the interview, they called me to tell me I did not get the job but wanted me to interview for this “unknown” HR job.  No job description, job title or any information was provided about the potential job.  I interviewed with someone high up in HR over the phone.  She was unfriendly & cold in her demeanor on the phone.  Even she wouldn’t tell me what HR job I was interviewing for so it made it extremely hard to know how to interview.  Never heard back from anyone.  If this is how they interview for jobs, it’s no wonder they have open positions.", "Interview Questions": "Wanted to know about my background."}, {"date": "13 Feb 2021", "title": "Database Administrator (DBA) Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hendricks Regional Health (Danville, IN) in Jun 2020", "Interview Descriptions": "More what if scenarios on your overall work and team ethic then extremely technical questions. I did a round with an executive and then the director. Both seemed like really good employees and things went smoothly.", "Interview Questions": "Do you prefer working with a large team or work better independently?"}, {"date": "25 Mar 2021", "title": "Smoking Cessation Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Hendricks Regional Health (Indianapolis, IN) in Oct 2017", "Interview Descriptions": "I was but in contact by a board member for the NP I worked at and had been downsized from. I sent my resume, followed up and got a phone interview.  While it seemed interesting, it did not end up being a good fit logistically for me and I stopped here.", "Interview Questions": "How much do you know about the methods used for smoking cessation?"}, {"date": "31 Aug 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hendricks Regional Health (Danville, IN) in Jul 2014", "Interview Descriptions": "In a room with director, clinical manager and a couple staff nurses. My application in hand. Casual calm interview environment. Discussed why applied, where do I see myself in 5 years, past experiences, how I’d handle conflict with other staff. Then a tour of the unit.", "Interview Questions": "Where do you see yourself in five years?\r\nHow would you handle conflict with another employee? "}, {"date": "20 Nov 2016", "title": "Support Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Hendricks Regional Health (Danville, IN) in Feb 2014", "Interview Descriptions": "I applied online.  I was called within a day.  There are almost always openings in Support Services. It was quick and easy.  I applied for the day position, but changed my mind at the last moment to 2nd shift (pays $.25 more an hr) and they said no problem and I started within a few days.", "Interview Questions": "Why do you want to work for Hendricks Regional Hospital"}]]