[[{"date": "12 Apr 2023", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Pretty straightforward questions. Nothing out of the blue. Usually the interview will have around four people, so expect to kind of switch off who you’re answering to. Otherwise it wasn’t too stressful and they were very genuine people.", "Interview Questions": "Name a problem you faced at a previous job and how you resolved it."}, {"date": "12 Mar 2023", "title": "Product Management Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Super comfortable interview, felt like a discussion instead of an interrogation. They asked lots of questions to get to know me instead of just asking specifically about the qualifications. It was a very easy and comfortable interview environment", "Interview Questions": "Asked about prior experience and skills that will fit with the position"}, {"date": "11 Feb 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "It was a one way online interview. There were 3 questions asked and each question had a time limit. You could redo your answers if you were not happy with them.", "Interview Questions": "What is Sucess to you?"}, {"date": "10 Feb 2023", "title": "Facilities Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "The interview process is too long, it took 2 months. but it is all worth it. Too many interview levels, it is very hard to pass through with the interview. thanks", "Interview Questions": "Why do you want to work here"}, {"date": "1 Feb 2023", "title": "Finance Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Pre-interview (where you have to virtually record your answers); interview over zoom with recruiting manager basic questions regarding your resume, etc.; next interview with 3 different people in the company. More specific questions about you and your prior work history.", "Interview Questions": "Q: Describe a project that you contributed heavily on?"}, {"date": "22 Dec 2022", "title": "Travel Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Dec 2022", "Interview Descriptions": "5 women in the interview each taking turns asking me questions. Mood was jovial. Everyone was very kind. Gave a feel for the future work environment. Comfortable setting. I need thirty words. :(", "Interview Questions": "I do not remember the questions asked. Remember that they were thought provoking."}, {"date": "28 Apr 2023", "title": "Preach IT the Bible Minister of Lord Jesus Christ Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Wesleyan Col, NC) in Nov 2022", "Interview Descriptions": "Poorly planned and lacking references. A rush job to get someone on quickly. Why not just bring the developments up front to the client. I have nothing more to say", "Interview Questions": "How many years have you been in the field"}, {"date": "2 Jan 2023", "title": "Software Engineer(Internship) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints in Oct 2022", "Interview Descriptions": "Extremely friendly representatives who go to different colleges looking for interns. Professional but friendly. Willing to interview students who have never had a technical interview before and provide feedback if requested.", "Interview Questions": "They asked me about how I solved a problem that I did not know how to fix when it was encountered and how I learned to overcome the problem."}, {"date": "22 May 2023", "title": "Audio Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Oct 2022", "Interview Descriptions": "Online interview that I just filled out and answered questions asked by the screen. Did not do a in person, though there was another interview stage i didn’t make. Was quick and easy.", "Interview Questions": "What kind of worker would you describe yourself as?"}, {"date": "11 Dec 2022", "title": "Security Analyst Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at The Church of Jesus Christ of Latter-day Saints in Oct 2022", "Interview Descriptions": "2 easy and quick interviews, personable and knowledgeable interviewers, did not waste my time, just wanted to see evidence of knowledge and my applications of it outside of the classroom.", "Interview Questions": "What is the difference between TCP and UDP? *scenario role play* How would you respond to someone opening a link in a phishing email and then deleting the email?"}], [{"date": "31 Oct 2022", "title": "Web Development Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID) in Oct 2022", "Interview Descriptions": "I was asked a few questions about items on my resume and some basic interview questions. I was then given a coding question in JavaScript. My interviewer was very kind and even helped during the coding question when I got stuck. I was allowed to google whatever as well.", "Interview Questions": "Tell me about a time when you were working in a team and you had differing ideas. How did you approach the situation?"}, {"date": "13 Oct 2022", "title": "Software Engineer Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID) in Oct 2022", "Interview Descriptions": "The interview started off with questions geared toward getting to know how you work in a team and what kind of background you have in the field. The interview was 45 minutes long and that portion of the interview took about 20 minutes. The last portion was coding. You can use any language you want but they prefer you use Java or C#. This portion of the interview they are wanting you to ask questions of what the program should or shouldn't be able to do. They also want you to talk out loud about what you are thinking and to write those thoughts in comments with what you are programming.", "Interview Questions": "How would you program a deck of cards? How would you shuffle the cards?"}, {"date": "31 Oct 2022", "title": "Data Warehouse Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at The Church of Jesus Christ of Latter-day Saints in Oct 2022", "Interview Descriptions": "I applied through college or university. The process took 1 week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Orem, UT) in Oct 2022 Signed up through the job fair, and submitted my resume through an online form. The interviewers came to the school for the interview. It doesn't take a long time to process it.", "Interview Questions": "Tell about myself, non-coding problem-solving questions, and SQL coding questions that I have to write on the whiteboard or on paper."}, {"date": "7 Sept 2022", "title": "Student Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "It was good! They were nice. Asked a lot of interesting questions. Be ready to be really introspective, and think outside of the box. But I think it'll go well, I have faith in you.", "Interview Questions": "What is your first and last name?"}, {"date": "5 Sept 2022", "title": "Web Dev Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID)", "Interview Descriptions": "They come to BYU & BYU-I every semester to take interviews. Students will need to sign up in advance with their resumes and they will approve and invite for an interview. ", "Interview Questions": "Create an input field (I think the interviewer wanted me to have a text input) and a button. The Input field will need to take in a number and when the button is clicked it needs to say if the number is divisible by 3 or not."}, {"date": "12 Jul 2022", "title": "Accounting Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Case study plus 2 round interviews.\r\nZoom interview with HR and then case study with presentation. \r\n\r\nMeeting with hiring manager at last round discussing about the expectation and other benefits.\r\n\r\nIt was a good interview and friendly work environment.", "Interview Questions": "What is your strengths ？"}, {"date": "23 May 2022", "title": "Document Preservationist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "I had to sort boxes based on number, then was given a tour of the facility. After the tour, they had me work on some of the pictures files of documents. Then I had an interview with the bosses of the facility.", "Interview Questions": "What can you do to increase your speed if\r\n you aren't meeting your quota?"}, {"date": "9 May 2022", "title": "Quality Assurance Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Behavior questions and two technical questions through Microsoft teams meeting. How would test a elevator question. The interviewer is nice and guided me through the technical question. I signed up on handshake and the church website.", "Interview Questions": "Behavior questions and two technical questions through Microsoft teams meeting. How would test a elevator question. "}, {"date": "7 May 2022", "title": "HR Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Orem, UT) in Apr 2022", "Interview Descriptions": "I was asked to do a video interview first followed by a live interview through Microsoft teams. There were 6 people that sat in for the interview and they were very kind. Basic questions. Nothing too hard.", "Interview Questions": "You mentioned you pay attention to detail. How do you manage your tasks when there are many things to do."}, {"date": "1 Apr 2022", "title": "Business Analyst Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Provo, UT) in Mar 2022", "Interview Descriptions": "It was a very fast process, two days after I applied I received an email with different dates and times I could have my interview.  I responded quickly with two different options and neither worked, they responded quickly and this led to a zoom link for the interview.", "Interview Questions": "How have you used data in your life to solve a problem?"}], [{"date": "17 Feb 2022", "title": "Project Manager Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints in Feb 2022", "Interview Descriptions": "We had a 30 minute interview on Microsoft Teams. He was friendly, helpful in answering my questions, and gave me time to think. Some of the questions he asked weren't exactly what I was expecting, but they were of course applicable to the job.", "Interview Questions": "What is an example of when you had to make a split second decision?"}, {"date": "15 Apr 2023", "title": "Datawarehouse engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The Church of Jesus Christ of Latter-day Saints in Feb 2022", "Interview Descriptions": "Very formal and more on asking the individual questions that pertain to them. Obvious questions about SQL basics but there was more focus on you as a person. Such as church experiences, how you work well with others, etc.", "Interview Questions": "How would you join two separate tables together using SQL?"}, {"date": "30 Dec 2022", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jan 2022", "Interview Descriptions": "It’s a 3 part process that didn’t take that long to go through. First was through the recruiter and then the next interview was with the team and then onto the director and team", "Interview Questions": "Project experience and examples of projects I’ve done"}, {"date": "20 Jan 2022", "title": "Assistant Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints (Sandy, UT) in Jan 2022", "Interview Descriptions": "Applied through the website, they called me, and the next day I was interviewed.\r\nThe sent text message, email and called in order to make sure of their interest of my profile.", "Interview Questions": "Talk about your background, and tell me what you are expecting"}, {"date": "21 Nov 2021", "title": "Communications Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "The interview process consisted of an initial screening followed by an interview, a small case and another interview. \n\nIf you are well qualified for the role and prepare for the interview, you should do well. Everyone is a member of the Church and that aspect is amazing. \n\nOverall,  I would have loved to work for the Church. I can't think of a more important job than building the Kingdom of God. That being said, I know that family comes before work. The Church's policy on parental leave is lagging far behind (especially for someone coming from the Tech Industry where 12 weeks or more is standard). For a growing family, unfortunately, I don't think that it would make much sense to work there. \n\nAfter prayerful consideration, I decided to decline the offer and accepted an offer somewhere else. \n\nHopefully I'll be able to work for the Church in the future! If nothing else, as a Senior Missionary. :)", "Interview Questions": "Walk me through your resume. Why are you interested in this role? Share an experience when you disagreed with your boss about something and how did you respond to that. Do you enjoy working with a team? What kind of boss do you like? Why would you like to work for the church? How do you keep current in your field? "}, {"date": "17 Nov 2021", "title": "HR Generalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Having interview with direct manager and recruiter -> Receiving take-home assessments for a week-> Having 2nd interview with whole HR team and HR manager -> Demonstrating business case assessment in role play style", "Interview Questions": "What do you think is the most important thing to being as HR? "}, {"date": "6 Nov 2021", "title": "Software Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Very simple. Applied and got an interview through a recruiter. Asked a few questions about the job. Wasn't interested in the job. But it was a good overall experience. I would interview again if I found a position I liked.", "Interview Questions": "Do you have experience with the Microsoft Power Platform?"}, {"date": "4 Nov 2021", "title": "QA III Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Phone interview followed up by an in-person interview with project and department leads. We went over my previous experience and what I was looking for in my next position. Asked about my experience in testing APIs.", "Interview Questions": "How do you handle conflict?"}, {"date": "27 Oct 2021", "title": "Software Engineer(Internship) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Provo, UT) in Oct 2021", "Interview Descriptions": "-First the interviewer walked through the resume and got to know the programming languages I have experienced. Then he asked conceptual questions about OOP (class, methods, inheritance) and specific programming language such as Java, C#, or Python.  Lastly, we had a coding exercise which was only five minutes.", "Interview Questions": "Q: What is encapsulation? Can you explain in detail?"}, {"date": "15 Aug 2021", "title": "Night Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Very professional and calm, both interviewers we welcome and introduced themselves.  The took turns in their questions and I never felt overwhelmed or nervous about the meeting, all questions and concerns I felt were relevant to the job and the expectations.", "Interview Questions": "Is customer service important to you and how?"}], [{"date": "26 Aug 2021", "title": "Data Analyst Intenship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Aug 2021", "Interview Descriptions": "Interview began with simple introductions and an explanation of what exactly the position entails. Interviewer asked about personal interest in data analytics, a problem solving question and fundamental SQL questions.", "Interview Questions": "Why do you have interest in data analytics?"}, {"date": "27 Sept 2021", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Aug 2021", "Interview Descriptions": "first, you apply at the church website\nand then you may get an email from the hiring manager! \nThey may ask you few questions few questions\nIf you pass, you may have 2+ interviews with each manager\nIt was simple but you may wait longer than  you expected", "Interview Questions": "Why this internship helps you?\nHow you are qualified for this job?\n"}, {"date": "21 Feb 2022", "title": "Corporate Travel Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jul 2021", "Interview Descriptions": "They contacted me via email to set up an interview. I was out of state and they were happy to set up a Zoom interview. Were very prompt in their response.", "Interview Questions": "The experience I had in the travel industry"}, {"date": "1 Jul 2021", "title": "Corporate Travel Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Church of Jesus Christ of Latter-day Saints (Sandy, UT) in Jun 2021", "Interview Descriptions": "I submitted an application on the church website. I got an email a couple of days later saying I had been invited to an interview with Spark Hire.  With this platform, I had to record 4 answers on a video platform. Not sure how I did but I was able to review and re-record before submitting each recorded answer to each question. I'm sure that there would be more interviews before I am offered a job if I make it past the first step.", "Interview Questions": "Tell us something about yourself; Why are you a good fit for this position..."}, {"date": "18 Mar 2021", "title": "Software Developer II Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "The interview process was really quick.  I had one on-site interview for white board coding interview and got an offer two days after the interview. Overall, it was smooth and pleasant experience.", "Interview Questions": "Some questions about java spring framework. "}, {"date": "5 Mar 2021", "title": "Product Management Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "I signed up for an interview slot and participated in the virtual interview a few days later. The interviewer loved my resume and felt I was very qualified. He immediately told me that I was the best candidate he'd seen all day and was very supportive.", "Interview Questions": "What experience do you have?"}, {"date": "2 Mar 2021", "title": "Organization and Talent Development Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Mar 2021", "Interview Descriptions": "1- One-way video interview which went very smoothly.\n2- Zoom interview with pannel.\n3- Second Zoom interview with the hiring manager.\nHave not heard yet whether I got a job offer but hopeful.", "Interview Questions": "How have I worked to improve communication in a global company?\nName a time when a decision didn't go my way and how I handled it."}, {"date": "7 Mar 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Mar 2021", "Interview Descriptions": "It was an easy, quick experience interviewing for an internship position. They responded quickly to my application. They were professional and timely with their response. I would apply for a position there again.", "Interview Questions": "Describe your knowledge about this position"}, {"date": "19 Mar 2021", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Mar 2021", "Interview Descriptions": "It was during the Covid-19 pandemic, so it was held through Zoom. The two women that interviewed me were professional and friendly. The interview lasted about 30 minutes. It was myself and two women, and we all took turns introducing ourselves and what we did. Then, we discussed the internship and all that it entailed. At the end, there was time for questions. That was it!", "Interview Questions": "What was a time when I received criticism and how do I take criticism?"}, {"date": "24 Feb 2021", "title": "Junior Cataloger Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "first, they want to get to know you and give you a task for 2 hours. They will make sure you have temple recommendations and active member of the Chursh. They only hire LDS members.", "Interview Questions": "Where are you from? \nWhat are your strengths?"}], [{"date": "20 Feb 2021", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "I first applied through handshake, and then had a Virtual interview with the manager due to a Covid-19 situation. \r\n\r\nIt seems like they like people with a technical background. They liked the fact that I’m an Information Systems major.", "Interview Questions": "Tell me about your experiences"}, {"date": "23 Nov 2021", "title": "Jefe De Área Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Ciudad de Mexico) in Feb 2021", "Interview Descriptions": "Fue algo incómodo por el hecho de que las preguntas eran algo difíciles o muy personales al parecer por lo que te pones un poco más nervioso sin temerla ni nada", "Interview Questions": "Cuánto desea ganar  mensualmente en esta empresa"}, {"date": "10 Dec 2020", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Nov 2020", "Interview Descriptions": "The initial interview was a one-way video interview. The interviewer had prepared 6 questions and allowed me to take all the time I needed to record my responses. I could also try as many times as needed to find the best way to respond.", "Interview Questions": "What is your salary expectation?"}, {"date": "12 Jan 2021", "title": "Electrical Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Oct 2020", "Interview Descriptions": "Online Video Response system. Thankfully they gave me unlimited response time and retakes, but I had a hard time really getting into the questions by just reading them and then responding to myself on the screen.", "Interview Questions": "What is the most important part of the NFPA 70 Electrical Code? "}, {"date": "29 Sept 2020", "title": "Software Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "I was interviewed via video call, asked a few questions, was allowed to ask questions, and was required to answer a coding question. I was notified soon afterward wether I was offered a job.", "Interview Questions": "How would you find out if a string is a palindrome?"}, {"date": "17 Sept 2020", "title": "Web Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Ask general interview questions and test coding skills. One question in general interview was about how you manage with the conflict in your team. They gave a scenario and let you solve the problem with HTML, JavaScript, and CSS skills.", "Interview Questions": "How would you manage the conflic with team member?"}, {"date": "18 Aug 2020", "title": "Record Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints in Aug 2020", "Interview Descriptions": "Pretty standard interview. They mainly focused on asking how my past experiences qualified me for the position. After looking at previous interview reviews, I was actually surprised and pleased that, in my experience, religion didn't come up at all during the interview; which to me is a good thing as ones spirituality should not determine their job qualifications.", "Interview Questions": "What experience have you had with genealogy/family history?"}, {"date": "2 Jan 2022", "title": "Accounts Payable Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 1+ week. I interviewed at The Church of Jesus Christ of Latter-day Saints in Aug 2020", "Interview Descriptions": "The interview was extremely awkward. There were three different managers on the call and no one was warm and friendly. They kept asking super weird questions. “What is the worst thing about you?” How do you answer that?? No one got back to me.", "Interview Questions": "N/A"}, {"date": "7 Dec 2020", "title": "Staff Assistant III Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jul 2020", "Interview Descriptions": "My interview was one of those done by a program that asks me questions and records me answering. These interviews do not give the candidate any chance to ask their own questions or to engage at all with a human being. Interviews should be two ways. Candidates need to interview you as well so they can determine if it’s a good fit. I believe those who passed this interview got invited to interview with people, but the position was canceled before I could find out.\r\n\r\nPlease don’t do these video interviews. It might save you time as the employer but it’s not fair to candidates when you are cutting corners and putting in below-minimum effort. We deserve to ask you questions too. Phone or video calls would be great, as candidates can actually engage with you.", "Interview Questions": "Describe your experience as an assistant"}, {"date": "23 Jun 2020", "title": "MTC Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Provo, UT)", "Interview Descriptions": "Generic \"interview\" where you go in and teach two employee raters a principle from PMG. If they like you and have an opening, then you'll be contacted and have several more interviews with heads of departments and so forth.", "Interview Questions": "Why do you want to be an MTC teacher?"}], [{"date": "5 Jun 2020", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "It was a good experience. It was a virtual interview with recorded questions and unlimited retakes. You can record your best answers and submit then when you are happy with them.", "Interview Questions": "N/A"}, {"date": "7 Mar 2020", "title": "PaidAt the History Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "The whole process was very professional and smooth.  Three individuals interviewed me.  It was about thirty minutes and included a brief test for editing and translation in Spanish.", "Interview Questions": "How do you handle mundane tasks? "}, {"date": "19 Feb 2020", "title": "User Experience Design Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Pretty simple, only needed to bring my portfolio. There was only one interview and it was only for a few minutes. Wanted to see if I understood what UX even was.", "Interview Questions": "How have you used UX to solve problems outside of school?"}, {"date": "11 Aug 2022", "title": "Well-Being Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Feb 2020", "Interview Descriptions": "Involved one 1-way interview and then an in-person interview with the entire team. The entire team was involved and took turns asking questions. The 1-way interview allowed you to practice answering questions.", "Interview Questions": "N/A"}, {"date": "28 Nov 2019", "title": "Metadata Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "The interview process consisted of two parts. First I interviewed with the supervisor. After passing the first part, I was scheduled to meet the team that asked me questions and then I got to try the software they use.", "Interview Questions": "If I had experience doing that job"}, {"date": "18 Nov 2019", "title": "IT Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Nov 2019", "Interview Descriptions": "I was cold called by a young woman, who was polite. The role was for some senior technical role at the church. The call lasted maybe 10 minutes and was more a discussion of potential future roles than this in particular one.", "Interview Questions": "Are you a member of the Church of Jesus Christ of Latter-day Saints?"}, {"date": "27 Mar 2020", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Aug 2019", "Interview Descriptions": "It was a really interesting process. I felt like everything was very smooth and professional. The questions asked I thought were great questions. I think overall it was a great interview and it went well seeing as they offered me a job.", "Interview Questions": "How would you describe making a peanut butter and jelly sandwhich?"}, {"date": "29 Jul 2019", "title": "Network Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT)", "Interview Descriptions": "First met with remote interview with a few technical questions and a general get to know with the interviewers. Covered different network terminology expirations  and acronyms and what they mean as well as questions on problem solving", "Interview Questions": "Tell us about yourself"}, {"date": "4 Apr 2019", "title": "Quality Assurance Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "They were really nice. He took the first few minutes to explain how the interview gonna be. He explained how he will evaluate the coding question. He is mostly looking for how I think to solve the problem and if I'm familiar with programming or coding.", "Interview Questions": "It was a coding question. The asked me to count the characters and words in a string."}, {"date": "24 Sept 2019", "title": "Software Quality Assurance Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (New York, NY) in Apr 2019", "Interview Descriptions": "Campus selection; they came over to career fair. I had the interview the next day. Met the with hr for a while filling an application before going to the interview. The application is then taken by the interviewer.", "Interview Questions": "tell about yourself?"}], [{"date": "8 May 2019", "title": "Technical Product Manager I Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Apr 2019", "Interview Descriptions": "One-way (recorded) video, which was a little awkward. Only 3 questions asked. Unable to ask questions that I had regarding the job, culture, benefits, etc. I think that part of the interview process is deciding and finding out for yourself if the job/organization is the right fit for you, not just if the organization wants you.", "Interview Questions": "What would your day look like as a Product Manager?"}, {"date": "10 May 2019", "title": "Technical Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT) in Apr 2019", "Interview Descriptions": "It was a one-way video interview for three questions. You don't have an option to ask any questions and you don't get a reply for emails you send not even decline offer mail.", "Interview Questions": "Explain how you face an angry customer and what would you do differently now."}, {"date": "27 Mar 2019", "title": "Missionary Travel Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Mar 2019", "Interview Descriptions": "Received a phone call fairly quickly after applying (which cannot be said for other jobs I've applied for at The Church). The interview included five people, which seemed excessive for essentially an entry level position. Everyone was kind and the interview went well. I left feeling confident as an applicant and with expectations that I would hear from them soon whether or not I received the job offer. However, even after following up, I never received an email or a return phone call notifying me of the status of my job application. I expected at least a rejection notification, which would be the professional way to handle job applications.", "Interview Questions": "What my experience was with travel in a corporate environment"}, {"date": "16 Feb 2021", "title": "Network Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Mar 2019", "Interview Descriptions": "Applied in person at job fair at University. Handed over my resume and about a week later an interview was conducted over the phone. A few basic IT questions and inquiries about my specialties and strengths.", "Interview Questions": "How do you get the ip address from both a Windows and Linux machine"}, {"date": "28 Mar 2019", "title": "Database Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT) in Mar 2019", "Interview Descriptions": "I was contacted by a recruiter about this position then contacted by the employer for an interview. I met with the hiring manager and a team of 3 department heads in a small conference room at the Riverton office building.", "Interview Questions": "How would you setup a database to manage library Patrons? Write a SQL query to showing a demographic of patrons and how many active patrons there are in each category."}, {"date": "2 Apr 2019", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Feb 2019", "Interview Descriptions": "Thorough and fair. The hiring panel asked a broad array of questions, taking time to dive deeper into a few key areas (total cost of ownership, product life cycle, customer feedback principles).", "Interview Questions": "Describe the difference between a product manager and a project manager."}, {"date": "11 Oct 2021", "title": "Software Engineer Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Provo, UT) in Feb 2019", "Interview Descriptions": "Applied online  through my school platform and they came to my school to interview. The interviewers were really nice. Easy interview, just some basic stuff about data structures. As long as you study you should be fine.", "Interview Questions": "Reverse palindrome question, some stuff about data structure"}, {"date": "27 Feb 2019", "title": "Relationship Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Feb 2019", "Interview Descriptions": "First interview is conducted via one-way video.  Allows you to do multiple re-takes and get it right.  Takes away additional first interview pressure. Not best for first impressions.", "Interview Questions": "Why are you best suited for this job?"}, {"date": "20 Feb 2019", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID) in Feb 2019", "Interview Descriptions": "It was good. I was asked questions about real life scenarios and how i could answer them.  I was also asked behavioural interview questions. I also asked question relating to the position to better help understand the responsiblities.", "Interview Questions": "Tell me about yourself"}], [{"date": "29 Mar 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jan 2019", "Interview Descriptions": "I first had to do a one-way video interview where I would answer specific questions and then the video would be sent to the Church to review. I enjoyed that method as I had as much time as needed to answer each question and it was very low pressure.\r\n\r\nNext, I was brought in to an in-person interview with a panel. They each went around and asked predetermined questions. It was comfortable and the people were all friendly.", "Interview Questions": "What is one of your professional strengths?"}, {"date": "23 Apr 2019", "title": "Usher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints (London, England) in Jan 2019", "Interview Descriptions": "very informal and relaxing it was a one to one and found myself enjoying the interview. you must be honest and thoughtful in your answers and constantly refer back to your faith", "Interview Questions": "why have you chosen our chrch"}, {"date": "31 Jan 2019", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints (Logan, UT) in Jan 2019", "Interview Descriptions": "It was fairly straightforward. It was part of the mock interview day on USU campus. They were very helpful and made the process very easy.  Since it was a mock interview, there wasn't anything to be done after the interview itself.", "Interview Questions": "Tell me one software or skill that you learned on your own that wasn't part of a class or project."}, {"date": "14 Nov 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Oct 2018", "Interview Descriptions": "I applied online,  after a week or so I was sent a video interview to record myself answering 5 questions in 1 minute. The next day I got a rejection email saying I won't be asked to do an in-person interview. Then two or three days later I got a call asking me to come in and interview. I met with 5 people, they were very nice and handed me a water bottle. They all took turns asking me 2 questions each.", "Interview Questions": "When was a time that you were given constructive criticism and how did you take it? "}, {"date": "23 Jul 2019", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Oct 2018", "Interview Descriptions": "Submitted an application. Was contacted for a video interview, where I answered questions on my own time, then the employer watched my responses. Was then invited for an in person interview, which was conducted 2 people, the immediate manager, and their superior.", "Interview Questions": "If you had / have an issue with a co-worker, how did (would) you resolve it?"}, {"date": "31 Oct 2019", "title": "QA Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID) in Oct 2018", "Interview Descriptions": "Interviewed in campus Career fair, and it was about 20 mins. It was comfortable and easy going. Asked me some Testing questions and a problem to solve.  He gave me a login page and said how would you test this page and how many ways to test it. Interviewer was helpful and explained what would the position require and all my questions were answered.", "Interview Questions": "How would you test a login page?"}, {"date": "2 Oct 2018", "title": "Software Developer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Provo, UT) in Oct 2018", "Interview Descriptions": "Very nice and stress-free. The interviewer is very nice and made me feel comfortable.  Talking about me in general and jump into the real tech interview. He asked about programming basic to the real algorithm", "Interview Questions": "Basic questions about programming, tell me about Object Oriented, the difference between override and overrode and make a sorting algorithm"}, {"date": "12 Oct 2018", "title": "Front End Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID) in Oct 2018", "Interview Descriptions": "It was good. There were two people in the room that talked with me and they asked me some questions. Both work with the church in the front end development. one for the church and the other one for FamilySearch", "Interview Questions": "They asked to create a small webpage with a text and a button in HTML and JavaScript where you had to create a function that will take the user input and display the numbers before the user's number:\r\n\r\nEXAMPLE: \r\n\r\nUser's input: 7\r\nDisplay: 1, 2, 3, 4, 5, 6, 7"}, {"date": "7 Dec 2018", "title": "Security Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID) in Oct 2018", "Interview Descriptions": "They asked a lot of questions during the interview, felt more like a test. I knew some of them but was not sure on many. The man was very friendly though and told me it was fine if I didn't know some of the questions being asked.", "Interview Questions": "What happens internally on the server when you hit enter to view a website?"}, {"date": "25 Sept 2018", "title": "Coordenador Do SEI Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at The Church of Jesus Christ of Latter-day Saints (Curitiba)", "Interview Descriptions": "Muito ágil, com a entrevista feita por App via internet. Foi gravado a entrevista e enviado para o avaliador. A entrevista foi realizada em português.", "Interview Questions": "Por quê vc se acha preparado para ocupar a vaga?"}], [{"date": "18 Nov 2018", "title": "Software Engineer(Internship) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Sept 2018", "Interview Descriptions": "Got an interview from career fair. One on campus interview, which is talking about the project  on my resume and some algorithm questions. And a phone interview was set up one month later.", "Interview Questions": "Find the first 100 prime numbers."}, {"date": "5 Apr 2022", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Sept 2018", "Interview Descriptions": "Standard Interview with basic and direct straight forward questions. Had a automated video response interview as well as in person interview. Last interview was with 2 supervisors, one to check my spanish fluency and the other asked the questions.", "Interview Questions": "Tell us about yourself? Describe a time you failed and what you learned from it? "}, {"date": "28 Sept 2020", "title": "Customer Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Sept 2018", "Interview Descriptions": "Two people interviewed me asking a variety of questions as well as a computer skills test in which you had to listen to a pre-recorded customer call and recall specific information and fill out that information.", "Interview Questions": "Tell us a time when you were able to assist a customer during a dificult situation"}, {"date": "24 Jul 2022", "title": "Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Aug 2018", "Interview Descriptions": "Initial phone interview for about an hour.  For the second interview I was flown up . Whole-day in-person interview that lasted about 6 hours. Several group interviews and included a group lunch. Met with the managing director, my direct supervisor and the staff I would be working with.", "Interview Questions": "Professional questions, questions about my background"}, {"date": "11 Dec 2018", "title": "Network Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT) in Jul 2018", "Interview Descriptions": "Applied and didn't hear anything for 6 weeks. First contact was an email inviting me to do a one-way video interview. It was a bit odd, as I have never experienced this before. I recorded myself on webcam answering a few questions.\r\n\r\nA week later, I was invited to come to the Riverton Office Building to interview with employees. First I met with two network engineers, then with two project managers. One of the network engineers was not friendly. He asked difficult questions about managing a data center network, despite the position being about field networks. The project management guys were friendly and asked questions about process and customer service.\r\n\r\nI left the interview with no desire to fill the position.", "Interview Questions": "Why do you want to work for the church?"}, {"date": "27 Sept 2018", "title": "Functional Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT) in Jun 2018", "Interview Descriptions": "They called me to set up the in person interview.  It was me interviewed with 4 people.  The process last about an hour.  It was very friendly and well respect.  Within a week, I got the call for the offer.", "Interview Questions": "How can you add value to the team on the first day you work?"}, {"date": "6 Apr 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The Church of Jesus Christ of Latter-day Saints (London, England)", "Interview Descriptions": "The person was a friend and asked if I was interested to be a cleaner and facilities representative with the key and code to lock up and open up the Chapel.", "Interview Questions": "Is there any reason that I could not do  the work."}, {"date": "10 Oct 2018", "title": "Customer Service Employee Aupport Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Apr 2018", "Interview Descriptions": "I was referred to the position. I met at the global service center. I review took less than a week. The next day after my interview they extended an offer.", "Interview Questions": "If an internet browser is down, what would you troubleshoot to resolve the issue?"}, {"date": "14 Mar 2018", "title": "Software Engineer Summer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (New York, NY)", "Interview Descriptions": "I git the interview from campus fair and had the interview on campus several days later . HR is so nice. He tried to explain the question as soon as possible. Great experience even though I did not actually do well.", "Interview Questions": "shuffle a deck of card"}], [{"date": "11 Sept 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Mar 2018", "Interview Descriptions": "They start out with a video interview which is really awkward. Then a group interview with multiple managers. For the most part the people are super nice. The question they ask her a little odd.", "Interview Questions": "They ask you how you handle difficult situations with other people. They want to know how you handle disagreements. The questions are pretty benign... But don't seem to have  Have relevance to the job."}, {"date": "19 Nov 2021", "title": "Business Intelligence Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Feb 2018", "Interview Descriptions": "Interviewed with BI team and 1 HR rep. It was a good experience 20% technical questions and 80% experience on working with other people. Mostly soft skills. Knowledge on BI tools and SQL", "Interview Questions": "What is a BI tool you have worked with and would you share a project you have worked on with that tool_"}, {"date": "16 Mar 2018", "title": "Software Engineer III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Herriman, UT) in Feb 2018", "Interview Descriptions": "I applied online, and followed up with an internal contact who put me in touch with the hiring manager. I was given a take home project which had me build an application based on provided mockups meeting certain specifications. I was then invited in for an in person interview where I met with the tram. They were quick to respond and extend an offer shortly thereafter.", "Interview Questions": "How would you optimize a web app?"}, {"date": "5 Feb 2020", "title": "Software Development Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT) in Jan 2018", "Interview Descriptions": "Phone interview.  Two technical interviews with white-boarding of database and Java questions.  Interviewed with hiring manager with mostly database questions with one Java puzzle, then with senior developers of the team.", "Interview Questions": "Java and JavaScript questions.  SQL and database design questions.  Questions about how to design the database.  What would the SQL query be.  Java and JavaScript technical questions.  No algorithmic puzzles with the team interview."}, {"date": "4 Dec 2017", "title": "Information Security Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Nov 2017", "Interview Descriptions": "Applied online, got called in shortly after. The first interview went without a hitch, I interviewed with two different branches and got a call back for the final interview a week later. This one, I never got a confirmation email, and had to register on site as a visitor. This was after contacting the HR Rep about whether I was actually going or not. When I got there, neither the hiring manager or the actual manager bothered to show up or even reach out to me about their absence. A high level C executive came and interviewed me solo for a position he knew little about, and a department he wasn't even in charge of. He asked me three questions, I asked him three, and left after it was clear that neither of the managers were going to show up. Got a rejection letter two days later.", "Interview Questions": "Tell me about yourself"}, {"date": "28 May 2018", "title": "Seminary and Institute Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Lahore) in Nov 2017", "Interview Descriptions": "bishop interview to who are apply for church job then branch bishop ask worthiness question and if bishop recommend this person then he/she doing job  etc. he will approve to this person", "Interview Questions": "are you worthy "}, {"date": "18 Apr 2018", "title": "Admin Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Nov 2017", "Interview Descriptions": "They were accommodating. I was out of town and they agreed to a skype interview. The interviewers were kind and asked easy questions.  They asked me what I do to relax. They pay attention to the details on your resume.", "Interview Questions": "tell me about yourself"}, {"date": "3 Oct 2017", "title": "Referral Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Was called in for an interview. It was pretty relaxed - nothing to get too worried about. Just asked me about myself, my skills, interests, and my own mission experience.", "Interview Questions": "What skills do you have that would help the Referral Center?"}, {"date": "20 Oct 2017", "title": "GSC Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Oct 2017", "Interview Descriptions": "The interview was quick and easy. I sent an application and they said they would get in touch with me when they had an open position. They sent me an email a month later to inform me to call the supervisor to set up an interview date. I called and had an interview the next day. The interview was casual and the interviewers were nice and friendly.  There's also an online test on your customer service skills afterwards, which was fairly easy even for me with no call center experience.", "Interview Questions": "When was a time you had to learn a new process, what steps did you take to learn it?"}], [{"date": "2 Jun 2020", "title": "Fundraising Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Provo, UT) in Oct 2017", "Interview Descriptions": "I applied through BYU and completed an in-person interview and a test for my phone skills. Two supervisors interviewed me and I completed to back-to-back phone calls for a mock fundraising conversation.", "Interview Questions": "What do you know about LDS Philanthropies?"}, {"date": "15 Jan 2018", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Sept 2017", "Interview Descriptions": "Submitted resume, asked to complete online video interview.  The online video recording was difficult to prepare. The interviewee was given multiple chances at the recording, but it was a miserable experience to create.", "Interview Questions": "Tell us how you handled a difficult situation"}, {"date": "6 Jun 2017", "title": "Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "I was interviewed by two managers in a single interview meeting. The interviews were scheduled back to back, so I met other candidates for the position. The interview questions were pretty basic. There was not a question about how many ping pong balls would fit into an airplane.", "Interview Questions": "Why would you want to work here?"}, {"date": "15 Jun 2017", "title": "Software Engineer(Internship) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID) in Jun 2017", "Interview Descriptions": "The interviews came to my school at BYUI in Rexburg and conducted interviews .  It was a pretty easy interview since they iNterview everyone that's interested. We spoke about my experience and strengths.  No other questions about personality or challenges were asked.", "Interview Questions": "Fibonacci sequence in Java Script "}, {"date": "27 Apr 2017", "title": "Creative Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT)", "Interview Descriptions": "It was very low-key at first, friendly. I was obviously overqualified for the original position I applied for, so my interviewers quickly promoted my potential and I was soon interviewing for a larger role.\r\n\r\nI interviewed multiple times with different people, 6 actually.", "Interview Questions": "Are you flexible in the position you are seeking and do you have experience working with cross-functional teams?"}, {"date": "15 Apr 2021", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Mar 2017", "Interview Descriptions": "Great interview process.  Moved quickly through the different stages and provided all the needed information.   Since I was out of state they were able to provide multiple stages of the interviews during each visit.  It was nice to see they respected my time even though I was the one applying.", "Interview Questions": "How would you respond to an angry visitor?"}, {"date": "7 Feb 2018", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Mar 2017", "Interview Descriptions": "I was asked about my availability window through email and then contacted by a secretary to come in for an interview. It only lasted for 15 minutes and I interviewed them more than they interviewed me.", "Interview Questions": "Why did you apply for this job? What was the hardest part of your most recent job and how did you deal with it? "}, {"date": "17 Feb 2017", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID) in Feb 2017", "Interview Descriptions": "Signed up for interview, and they reviewed my resume. The interview involved soft skill questions as well as some programing questions and problem solving. I had to do some coding some on paper and some on a computer. They notify you several weeks after the interview.", "Interview Questions": "Tell me about a time when you had a conflict with an coworker, and how did you handle that situation."}, {"date": "22 Aug 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jan 2017", "Interview Descriptions": "I filled out the online application and was invited to participate in a video conference.  After the video conference about two months went by before I was invited to the Church headquarters for a face to face interview.", "Interview Questions": "We have many applicants for this position, why should we choose you? "}], [{"date": "16 Mar 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jan 2017", "Interview Descriptions": "It took a couple weeks to get an interview. I interviewed with the manager and his boss then had a tour of the building. I was told that they would contact me a few days later either way. I called in and it turned out that both HR and Manager were out of town. I wish that I had better communication.", "Interview Questions": "Give an example of conflict that you were able to work through and what you did. "}, {"date": "11 Nov 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID) in Jan 2017", "Interview Descriptions": "A team was sent to my college. They interviewed several dozen students for various positions.  The questions started with basic personality questions, then went on to conceptual and finally technical questions. It was a pretty in depth interview as to my knowledge of  the related subject matter.", "Interview Questions": "Can you share with us an example of a time you did not get along with a coworker and what you did to resolve it?"}, {"date": "10 Dec 2016", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT)", "Interview Descriptions": "I had a two phone interviews, and then was invited to visit the headquarters.  In preparation for the face to face interview, I was asked to prepare a presentation about my subject area for a group of people to review.  After the group review, I went to lunch with the team.  After that, I was offered the job.", "Interview Questions": "Why I wanted to work there."}, {"date": "11 Jul 2017", "title": "Web Dev Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at The Church of Jesus Christ of Latter-day Saints (Provo, UT) in Nov 2016", "Interview Descriptions": "I met with them on career fair, and applied through school's job posting site. I got the on campus interview a week after I applied. During the interview, I was asked a few technical questions about loops, and there were also some code writing questions.", "Interview Questions": "write a program that prints the first 10 Fibonacci numbers"}, {"date": "19 Oct 2017", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID) in Nov 2016", "Interview Descriptions": "You can interview with any department and if you don't get the job they will put you into the system and you can be considered for other jobs. I interviewed with them and about three weeks later got a call from another department that wanted to meet with me over a video call.", "Interview Questions": "What is your favorite project you worked on?"}, {"date": "15 Mar 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Nov 2016", "Interview Descriptions": "Submitted resume online and emailed with the hiring manager to clarify my skills for the position. First interview was onsite with two members of the team I would have been working with, and the second interview was onsite with one of the team members an a very high-up supervisor who created the program I would have been managing. They called to let me know by phone whether or not I had been accepted.", "Interview Questions": "They asked me about my ability to handle ambiguity in the English language, especially in a music translation position."}, {"date": "6 Oct 2017", "title": "Security Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at The Church of Jesus Christ of Latter-day Saints in Oct 2016", "Interview Descriptions": "Asked basic technical questions. Was extremely friendly and patient. I applied through my university and through the Church's website. They told me they would get back to me in about a month regarding if I got the position or not.", "Interview Questions": "Q: What is the difference between a firewall, router, and switch?"}, {"date": "29 Sept 2016", "title": "Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Sept 2016", "Interview Descriptions": "This was absolutely the best interviewing experience I have ever had!  I interviewed first with the whole team, then the hiring manager and his director for the second interview.  Everything about the experience was positive.  The people who work there are exceptionally nice and thoughtful and encouraging.  They were also very informative and very open to answering questions.  While some of the questions they asked were quite challenging, they treated it like a conversation to help make the experience personable and engaging.  One unique twist that I have only experienced at one other place was preparing a 10 minute presentation to address a strategic situation.  That was a difficult task, but helped in many ways to prepare for the interview itself.  They were also very kind and encouraging when I was informed I did not get the position.  If given the opportunity to interview here again, there would be no hesitation - I would!", "Interview Questions": "Based on what you know about the organization, how would you allocate percentages of time spent on certain variables?"}, {"date": "24 Jan 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT) in Aug 2016", "Interview Descriptions": "I met with three managers for a web developer internship. They were very nice and easy to talk to. We discussed my background and projects that I had worked on. I did some white boarding with a toy problem. Within a few days, I was offered an internship.", "Interview Questions": "The toy problem involved the Fibonacci sequence and how to solve it with a function."}, {"date": "16 Feb 2017", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints in Jul 2016", "Interview Descriptions": "Church employment is highly competitive. Even though this is a religious entity, do not think less of the interview process. Prepare accordingly as if you are interviewing for a fortune 500 company\r\n\r\nAt the end of the day, its all about whether you can be a good fit to the culture and if you are qualified or not. Just what any other company looks for in an interview.", "Interview Questions": "Future plans\r\nFamily\r\nGoals in life\r\n"}], [{"date": "27 Jul 2017", "title": "GSC Customer Service Representative Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jul 2016", "Interview Descriptions": "It can be long and they also changed the expected weekly hours before the interview without notice. They also changed my interview time, so I had to go back to be told they changed the hours expected for that position.", "Interview Questions": "We didnt have a full interview since they changed requirements and I couldn't work the amount of hours they requested "}, {"date": "5 Oct 2019", "title": "Accounting Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (New York, NY) in Apr 2016", "Interview Descriptions": "I submitted my application online, and a month later I received a phone call where I was invited for a live interview. The interview had three managers and a hr representative. They were nice, respectful and professional by asking normal questions.", "Interview Questions": "How would you deal with a rude coworker?"}, {"date": "11 Mar 2016", "title": "Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT)", "Interview Descriptions": "Flew out to Salt lake and had a great Interview at a respectable restaurant. I was then given a tour of the building and offices and of Temple Square. I was introduced to the team and was made to feel comfortable, respected and even needed. The questions were not too difficult but very pertinent. The process did take a long time from initial phone call to the actual offer.", "Interview Questions": "Why would you consider working for the Church rather than a for profit company?"}, {"date": "4 Feb 2018", "title": "MTC Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 9 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Chorley, England) in Mar 2016", "Interview Descriptions": "Full assessment day. Interview with senior management team. Role play involving one to one teaching off principles. Given the to prepare and then deliver 20+ minute training upon PMG principles.", "Interview Questions": "Explain a time in which you had to follow directions from leadership that you didn't necessarily agree with?"}, {"date": "14 Sept 2016", "title": "Business Intelligence Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID) in Mar 2016", "Interview Descriptions": "Awesome!  My manager interviewed me, and I felt like I was able to accurately represent myself.  I didn't have all the necessary skills for the job, but my interviewer told me he had a good feeling about me and gave me the job!", "Interview Questions": "Along with the usuals, he asked \"If it's 11:20 on an Analog clock, what is the angle between the two hands?\"  (note: that includes the slight rotation of the hour hand between the hours).  I got it wrong three times, but he didn't care.  He said he just had to ask because it was required."}, {"date": "7 Oct 2016", "title": "Senior HR Business Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Mar 2016", "Interview Descriptions": "It was well organized and a strong process. I did have to come back several times, which made it a little challenging. You have to be a member of the church and hold a current temple recommend.", "Interview Questions": "Tell me about a time when you dealt with conflict? And what was your role in resolving it? "}, {"date": "27 Feb 2016", "title": "Information Security Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "The process was thorough, yet surprisingly haphazard. It took months to get through the hiring process. There wasn't the standard opportunity to negotiate salary, etc.  The offer was contingent upon working through a third-party staffing agency who didn't play a role within the interview process.  There were several red flags of how the manager handled the interview, which I should have paid more attention to.  They turned out to be quite indicative of his poor management skills.", "Interview Questions": "I was presented with a number of technical and regulatory acronyms and asked what they stood for and describe the related concepts and policies. "}, {"date": "19 Feb 2016", "title": "In the Marketing Department Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT)", "Interview Descriptions": "I interviewed twice for two different positions.\r\n\r\n1. They brought me in, even though I was clearly overqualified for the position, because they liked my resume. It was a waste of time. \r\n\r\n\r\n2. They brought me in and even though I was clearly qualified for the position, it was a waste of time. They interviewed me because their policies required that them interview X number of candidates. They already had two internal candidates. The hiring manager told me that I did nothing wrong and I couldn't have done anything better. They just knew they were going to hire from within before it got started.", "Interview Questions": "If you were an animal, what would you be?"}, {"date": "25 May 2017", "title": "Editorial Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Provo, UT) in Jan 2016", "Interview Descriptions": "After you submit your application and your editing test, you might get an offer to interview with whatever magazines/positions you applied for. It's a group interview, depending on how many magazines you applied to (and how many have accepted you back). The interviewers are very friendly, although one or two of them might not smile. Trust me, they're super nice.", "Interview Questions": "Tell us about an editing project that has brought you a lot of satisfaction. "}, {"date": "3 May 2017", "title": "Language Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jan 2016", "Interview Descriptions": "Applied for the job in October. Got an email in January asking for me to schedule a time for an interview. Showed up and sat down with 4 interviewers. Questions were very relevant and fair. I heard back a week later that I had got the job, but that they needed to do all of the paper work before they could send me a formal letter.", "Interview Questions": "Tell me about your internship."}], [{"date": "29 Mar 2017", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jan 2016", "Interview Descriptions": "You are asked general customer service questions regarding how to treat customers and how to behave in certain occasions. You also get to practice a live call on first interview.", "Interview Questions": "Tell us a time when you faced a frustrated customer"}, {"date": "19 Oct 2016", "title": "Cafeteria Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (San Diego, CA) in Dec 2015", "Interview Descriptions": "Have a conversation with the regional manager concerning the partnership program. He will evaluate your work ethic and sent in the paper work for a background check. It will go to Salt Lake, Utah. then it is out of his hands.", "Interview Questions": "Would you like to work in the Temple of God?"}, {"date": "3 May 2017", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID) in Nov 2015", "Interview Descriptions": "Supervisors asked me a series of questions in regards to how I would handle difficult situations in tutoring and in the work place. They also asked me about my writing experience and gave me scenarios that I would be in for the job to see how I would do in those situations.", "Interview Questions": "If a student is not understanding what you mean and becomes rude about it, how do you handle the situation?"}, {"date": "11 Oct 2015", "title": "Media Services Professional Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at The Church of Jesus Christ of Latter-day Saints (Provo, UT)", "Interview Descriptions": "I sat in a room with the people who I would be working with. They each introduced themselves and told me a little bit about themselves. They told me about the position they wanted to fill. They asked me about my personal interests and experience as well as my education. They seemed to want to find out if I could get along well with the rest of the team.", "Interview Questions": "What is the basic structure of an HTML file"}, {"date": "13 Mar 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at The Church of Jesus Christ of Latter-day Saints in Oct 2015", "Interview Descriptions": "They performed a behavioral interview and asked me hypothetical or past questions of what I would do or have done under various circumstances. They expected me to answer questions with STAR responses.", "Interview Questions": "Tell me about a time you had conflict in a group"}, {"date": "26 Oct 2018", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Oct 2015", "Interview Descriptions": "I came into an interview with multiple team leads. They were kind and asked all the questions they are legally able to. Tried to understand how well I work with people.", "Interview Questions": "How have you dealt with a difficult customer in the past?"}, {"date": "2 Jan 2018", "title": "Solutions Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT) in Sept 2015", "Interview Descriptions": "I was interviewed twice.  Once to ensure I had the technical qualifications, then again to ensure I was fully aware of the work details.  Each interview was a group interview consisting of fellow managers and the portfolio director.", "Interview Questions": "Why do you want to change jobs"}, {"date": "5 Jan 2019", "title": "Media Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jun 2015", "Interview Descriptions": "You go through 2 rounds of interviews with different managers. They want you to discuss you skills in depth. Everyone was kind. Just make sure you explain in detail your skill set.", "Interview Questions": "What makes you a team player?"}, {"date": "11 May 2016", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jun 2015", "Interview Descriptions": "The whole interview and hiring process was very friendly and quick. They contacted me and desired to meet with me on a formal interview. After a week or so of the interview, they wanted a second interview with me so that the Director Manager could also meet with me and get to know me. A week later they offered me the job and I started then.", "Interview Questions": "What was my favorite thing from previous jobs?"}, {"date": "17 Sept 2019", "title": "Religious Educator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 10 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Feb 2015", "Interview Descriptions": "Met with a general authority. He was extremely demeaning and cold and unwelcoming. It was honestly a really terrible experience and it was very difficult for both me and my wife to experience.", "Interview Questions": "Do you love your wife? Do you show her you love her?"}], [{"date": "27 Jan 2015", "title": "Quality Assurance Engineer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Met with a manager, and had some personality based, and thought process based questions. I was asked some questions that measured how creatively I could approach an issue. The questions were not stressful, the interviewer just wanted to get a feel for how I think. After interview I had a call back within a week.", "Interview Questions": "How did you handle a situation where a team member did not contribute."}, {"date": "23 Jun 2017", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jan 2015", "Interview Descriptions": "Two interviewers going back and forth, one a senior supervisor and the other a senior co-worker. I was given time to talk freely at times, but there were some basic interview questions prepared.", "Interview Questions": "Tell me about yourself."}, {"date": "14 May 2017", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Nov 2014", "Interview Descriptions": "Online application, call from secretary to set interview date and time, interview with two or more managers. Callback from secretary two days after interview, go back to talk with main manager,he asked couple more questions and offered the job.", "Interview Questions": "Previous experience "}, {"date": "2 Oct 2014", "title": "Associate/Warehouse Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (North Las Vegas, NV)", "Interview Descriptions": "Every supervisor individually had a group session with all of the new employees explaining their area's operations. We were shown every part of the building and everything that need be explained was. We were issued employee handbooks and assigned our work areas. The supervisors were courteous, pleasant and some were even humorous. Everyone left feeling advanced, happy to have met and looked forward to the first day of work.", "Interview Questions": "There were no difficult or unexpected questions."}, {"date": "30 Sept 2014", "title": "Software Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Came to career fair at my university, I was allowed to sign up for an interview time without even dropping off a resume. Interviewed, the process was pleasant. After some get-to-know-you questions (school, interests, etc), a few technical questions were asked. I was given paper to write out some pseudo code for a sort.", "Interview Questions": "Given a list of ten numbers, sort them from least to greatest."}, {"date": "21 Oct 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID) in Oct 2014", "Interview Descriptions": "I interviewed on a college campus.  Being a religious organization the interview was incredibly easy to get into.  Anyone is welcome to interview.  I think this is partially because of the difficulty in keeping employees (lower pay due to consecration - religious reasons), but mostly because interviews are a good experience for applicants and since all the applicants belong to the faith the Church wants to help in any way they can.\r\n\r\nI actually interview several times and had different experiences each time.  Because the entry level for an interview is so low, the interviewers are understandably busy and sometimes you'll be interviewed by someone who does not normally interview for your position.  This happens often enough that they are fully capable of filling in, but it can increase the difficulty of the interview as they are less sure of what to look for, making it harder to impress them.\r\n\r\nEach time I was simply asked to sign up for a time, and then asked show up a bit early for paperwork.  Usually the wait is 10 to 30 minutes before they are ready to interview you.  The interview itself is fairly basic with a bit of paper coding, questions about what you've done in the past, and occasionally some actual coding.  After the interview you receive an email either accepting or rejecting your application.  For the internship there was no other interviews, just the one.", "Interview Questions": "What's the most challenging project you've worked on and what did you learn from it?"}, {"date": "11 Aug 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints (Glendale, AZ) in Oct 2014", "Interview Descriptions": "I asked for the position, was asked which category.  Volunteered as tour guide.  Attended orientation and enjoyed the position very much. Shift sign up was easily done on-line.", "Interview Questions": "Are u willing to volunteer"}, {"date": "10 Nov 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Orem, UT) in Oct 2014", "Interview Descriptions": "The LDS Church was at my school's career fair. I signed up on a list on a whim for an interview and got one. I showed up at the appointed time and had a 1:1 interview. The recruiter asked me a few personality questions and some very basic programming questions. I thought that I the interviewer had zero interest in me but I landed an internship.", "Interview Questions": "Write a simple function for me."}, {"date": "10 Dec 2014", "title": "Language Development Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Provo, UT) in Jul 2014", "Interview Descriptions": "They didn't have current (my language) development, so I emailed the employer and he hired me essentially on the spot. I told him who I was and that I had formally worked as a teacher at the MTC and he gave me the job.", "Interview Questions": "What's your name"}, {"date": "22 Dec 2016", "title": "Spanish Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Church of Jesus Christ of Latter-day Saints in Jun 2014", "Interview Descriptions": "Job was offered and conditions were explained over the phone. They showed concern in helping me find a place to stay. Job hours were clear as well as salary, training, meals, sick leave, and other benefits. They were kind, enthusiastic, and created a confortable environment. I would have liked a bit more of a challenge though.", "Interview Questions": "Would you be able to move to Madrid next month?"}], [{"date": "2 May 2014", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Initial contact was made ~2 months after application submission. Went through 2 interviews; Manager and their superior were in the first, manager, superior and trainer were in the second. ~4 weeks between interviews, and ~3-4 weeks after 2nd interview was an offer", "Interview Questions": "Organize these tasks according to priority, but the tasks will only be read out loud once."}, {"date": "3 Jul 2017", "title": "Official Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The Church of Jesus Christ of Latter-day Saints (Arrecife, Canary Islands) in Apr 2014", "Interview Descriptions": "You have an interview with your local bishop, he would do all posible to help you and if you are worth and able to go on a mission, you would be ready.", "Interview Questions": "Why do you want to go on a mission?"}, {"date": "28 Mar 2014", "title": "Media Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "I did not have to interview. I was simply hired because of my skill set and the people I know. That's the best way to get a job there.", "Interview Questions": "I did not have to interview. I was simply hired because of my skill set and the people I know. That's the best way to get a job there."}, {"date": "6 Oct 2014", "title": "Security Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Provo, UT) in Feb 2014", "Interview Descriptions": "One non technical phone interview to see if you are passionate about the cause and morally fit toe the job. Then there is a pretty basic technical interview. Be humble there are guys who are very advanced and love to nail you against a wall if you are overconfident.", "Interview Questions": "Common ports\nDifference between NIPS and NIDS\nHow does one preform SQL injection? What can you do with a successful one How is it prevented?\nJust basic networking and security stuff."}, {"date": "17 Sept 2015", "title": "Procurement Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Feb 2014", "Interview Descriptions": "Typical application process of submitting resume and information.  I was contacted for the interview, which turned out to be a group interview, with both the hiring manager and a few peers.  As intimidating as that sounds, it was actually very cordial.  There were no barbed questions, although questions were very job-focused.  I knew going in that it was highly competitive, but I was treated with dignity.  Overall, gave a professional impression.", "Interview Questions": "We need to stay up on technical trends.  How can you demonstrate your tech savvy to us?"}, {"date": "1 Sept 2016", "title": "Full Time Missionary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Feb 2014", "Interview Descriptions": "Well, I had to complete an application stating that I wanted to be a missionary. Then I had to get my medical problems fixed, be cleared by a local bishop, and wait for the answer of where I was going. After about two weeks, I received a letter from the church, stating I was called to serve as a mission in Madrid Spain.", "Interview Questions": "Do you have desires to learn a language?"}, {"date": "12 Feb 2014", "title": "Instructional Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jan 2014", "Interview Descriptions": "The whole process moved really quickly, I was impressed. I submitted my application over the weekend, received a phone call by Monday and interviewed by Thursday. The interview was with a panel of employees from the team. The environment was incredibly relaxed. They were very nice and friendly, cracked a few jokes every now and then but stayed on topic. I was able to ask a few questions and address some concerns, to which they all responded candidly and honestly. Office environment was organized, work culture seemed very friendly.", "Interview Questions": "Most questions were very typical. I didn't find many of them difficult to answer, but they did ask some very detailed questions about past projects, so they weren't just your basic interview questions. Asked a lot of follow up questions, so be prepared to prove you know your stuff. "}, {"date": "27 Jul 2015", "title": "Custodian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jan 2014", "Interview Descriptions": "It is a group interview that gauges whether or not you are competent enough for the job.  This means can you follow directions, interpret and adjust to different situations, and are you physically able to perform the job.  From what I could gather, everyone that I interviewed with was hired except for one man due to a health issue that recently came up.", "Interview Questions": "In your own words, define the head phone policy."}, {"date": "19 Jul 2016", "title": "Tech Support Specialist III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Dec 2013", "Interview Descriptions": "The interview consisted of a couple of questions designed to test my knowledge of computer troubleshooting and the Tagalog language. There was even a series of phone conversations where I had to choose the best response. The atmosphere was incredibly laid back with the exception of the dress code which consists of a suit and tie.", "Interview Questions": "What is an ISP."}, {"date": "23 May 2017", "title": "Staff Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Oct 2013", "Interview Descriptions": "I had two over-the-phone interviews, 1 Skype interview, and one in-person interview. I also underwent several tests. Over the course of the interview process, I met with the HR representative, several managers, and the managing director. The entire interview process lasted about three months. They were willing to work with me and my schedule.", "Interview Questions": "Where do you see yourself in 5 years? What is your ultimate dream job?"}], [{"date": "24 Sept 2013", "title": "Quality Assurance Engineer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Applied on-campus, had one interview with a manager.  The interview was very fair, I felt it was a good evaluation of my skills and knowledge.", "Interview Questions": "Regular QA-related questions related to software testing, how I would design test cases, etc."}, {"date": "14 Sept 2013", "title": "Czech Language Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Provo, UT)", "Interview Descriptions": "The first step is to do a teaching evaluation.  You teach an employee from the MTC a lesson on a principle(s) from Preach My Gospel using teaching principles from Preach My Gospel in English.  Next, if you teach in a language other than your mother tongue, you must participates in a language evaluation.  This is generally over the phone and involves translation tasks.  If both of those go well, you get an interview in person.", "Interview Questions": "The most difficult questions related to how I would handle situations with students unwilling to study."}, {"date": "10 May 2016", "title": "History Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jul 2013", "Interview Descriptions": "2 interviews. First with direct supervisors, then with their managers. Group interviews with anywhere from 3 to 6 people. The interviews were more conversational panels with various people asking questions. It could have been intimidating to some, but for the most part they were interested in getting to know you beyond the facts of your resume.", "Interview Questions": "How would you handle a disagreement with a coworker or supervisor?"}, {"date": "31 May 2013", "title": "Temple Recorder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "Pleasant, simple, straightforward. Very professional.", "Interview Questions": "N/A"}, {"date": "8 Feb 2016", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jun 2013", "Interview Descriptions": "I applied online and was called in for an interview a couple days later. I was interviewed by a panel of employees. Everyone was very friendly. I was called back in for a second and third interview (same day) with a director and managing director. Everyone treated me with respect; questions were relevant to the job.", "Interview Questions": "Tell us about your ability to include or exclude the correct people to ensure tasks are communicated properly."}, {"date": "21 Feb 2017", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT) in Jun 2013", "Interview Descriptions": "The first interview was basically a get-to-know you type of interview with 3 people. It was very informal. They did ask some questions specific to the job description, which I answered similarly to my answers on the application. But most of the interview was just shooting the breeze. \r\n\r\nThe second interview (same 3 people), after which I was made an offer, involved me essentially auditioning for the job by doing a presentation on the Product Management process. After that, one of the interviewers (whom I would soon discover, after being in the position for a short time, to be Satan incarnate) drew up an Excel spreadsheet scenario on the board. The answer to the quandary, which I correctly stated, was the use of a 'V-LOOKUP' table. Apparently my correct response to this one question was adequate for his approval.", "Interview Questions": "For the second interview, they had me do a presentation on the Product Management process."}, {"date": "21 Dec 2015", "title": "Art & Media Production Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jun 2013", "Interview Descriptions": "I applied for a job (June 2013) using their online process, and was contacted the next day from someone inside the department for which I was applying. They asked a few questions about availability and capabilities, and asked me to come in the next day for an interview.\r\n\r\nThey mostly asked questions about culture fit and how you would feel about consecrating your time and talents to work with the church. The environment was definitely something I would have loved to work in, especially just being in the surrounding office area. They were all professional, kind, and very eagar to make me feel at ease.\r\n\r\nI was a bit overqualified for the position at the time. I ended up starting a new business and did not pursue future applications, although they did reach out to me a few times after the initial interview.", "Interview Questions": "If you had a problem with a coworker, how would you approach the situation?"}, {"date": "29 May 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at The Church of Jesus Christ of Latter-day Saints (Mesa, AZ)", "Interview Descriptions": "Spoke on phone with Manager, came in and spoke in person with manager, performed a computer skills test", "Interview Questions": "I don't recall a difficult question"}, {"date": "21 Aug 2015", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Provo, UT) in May 2013", "Interview Descriptions": "short and to the point but very professional, very friendly and open to my suggestions of how to improv the position and what I could do in the position", "Interview Questions": "background"}, {"date": "14 Oct 2017", "title": "Technical Product Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in May 2013", "Interview Descriptions": "One interview and offered. simple panel interview.  they were really looking for an engineer but listed the job as a technical product manager.  this was due to politics with HR and inter-departmental issues.", "Interview Questions": "if you knew how to run the systems"}], [{"date": "15 Mar 2016", "title": "SharePoint Lead Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT) in Apr 2013", "Interview Descriptions": "First time interview was scheduled a few days after being contacted by their HR team. Met with Solutions Manager, Team Lead, and two of their top developers.\r\n\r\nThere were some technical questions, some about how SharePoint works in the back, but mostly they were about previous experience. There were also a \"how would you do this\", and please write on the board how you would solve this. For the last part of the interview, they brought a few papers with a design of a site and asked me how would I approach it. \r\n\r\nInterview lasted about 3 hours.\r\nThey came back to me after a week or so.\r\n\r\nWasn't able to negotiate salary.\r\nGreat place to work at though!", "Interview Questions": "How would you approach and what would you do to create this solution."}, {"date": "3 May 2017", "title": "Portfolio Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Mar 2013", "Interview Descriptions": "Uncoordinated.  No list of questions.  Just a bunch of random questions while visiting.  They weren't able to assess the skills of the people they were interviewing.  It should be clear that they don't have the skills themselves, nor are they empowered to take correct action", "Interview Questions": "Why do you want to come work here?"}, {"date": "30 Aug 2013", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT) in Feb 2013", "Interview Descriptions": "I applied through a school job placement program.Just about everyone who is LDS and temple worthy gets an interview. The process was very nice. I was interviewed by the person who later became my boss. I was able to get to know them a little in the interview and I felt very much at home. This was the biggest selling point in helping me determine whether of not I wanted to take the position.", "Interview Questions": "Non that I noticed but then again, this was exactly what I was looking for in an intership opportunity. "}, {"date": "19 Mar 2016", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Feb 2013", "Interview Descriptions": "The interview process is pretty simple. Wear a suit to the interview. Make sure you do your research about the job. You'll most likely interview with 2 team leaders. They'll have your resume with them. Remember the things you wrote on your resume. They'll ask questions about it. Also, they notice your interpersonal skills and the way you respond to their questions. \r\nAlso, they make you take a test in which you have to listen to a call and write down what the customer is saying in a clear way. The test will ask you questions about the call and will grade you. They'll also have you take a typing test.", "Interview Questions": "Tell us about a time when you did not agree with management, and tell us what you did."}, {"date": "25 Oct 2014", "title": "Database Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Church of Jesus Christ of Latter-day Saints (Rexburg, ID) in Feb 2013", "Interview Descriptions": "The hiring process was pretty straight forward. It was a half hour and I applied online beforehand. I met with a portfolio manager and he was very nice. They had some math problems to figure out. The hiring manager was great, she is very friendly. It took about 3 weeks to hear back on it via email.", "Interview Questions": "None. I was asked about a lot of things as my interviewer tried to get to know me"}, {"date": "23 Dec 2015", "title": "Sewer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jan 2013", "Interview Descriptions": "It was me and one awkward person who didn't talk much and didn't have a sense of humor, in a room asking me a few questions. I remember it being a pretty easy interview. I had to take a manual dexterity test and show I could thread a needle and sew some fabric, even though I have never sewn before.", "Interview Questions": "How often have I been absent at my current job?"}, {"date": "7 Feb 2016", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Dec 2012", "Interview Descriptions": "The interview was about half an hour long. They asked mostly customer-service related questions. There were some odd questions though like \"Where did you get married\" and \"Do you have children.\"", "Interview Questions": "Q: Tell us something about yourself.\r\nQ: How do you handle conflict?\r\nQ: Describe a time when you provided great customer service. \r\nQ: Where did you get married?\r\nQ: Do you have children?\r\nQ: Are you an international student?"}, {"date": "13 Jan 2014", "title": "Reporting Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Nov 2012", "Interview Descriptions": "I was contacted via the phone after filling out the online application. I interviewed with 3 different groups of people (hiring manager, manager, and team leads). I was contacted less than a week later with an offer.", "Interview Questions": "Normal questions are to be expected... \"Tell me about a time when...\""}, {"date": "13 Aug 2012", "title": "Accountant I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "1 formal sit down interview. 2 interviews over the phone.", "Interview Questions": "What are your future career plans?"}, {"date": "31 Jul 2012", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at The Church of Jesus Christ of Latter-day Saints", "Interview Descriptions": "I was hired after a couple of interviews.", "Interview Questions": "Where do you expect to be in five years?"}], [{"date": "25 Jul 2012", "title": "Data Center Network Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4+ months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT)", "Interview Descriptions": "Applied for this position online.  3.5 weeks later, had a phone interview with a technical person asking technical questions. 1 month later, had a videoconference interview with two managers and the technical person.", "Interview Questions": "Describe a situation in which you have used analytics to make a decision.  What would your manager say are your two biggest weaknesses?  What is the biggest outage you have ever caused? Describe a situation where you used information that others thought was unimportant to make a decision. How would you rate yourself on the following technologies: vmWare, routing and switching, EMC, Windows, AIX, Linux, Cisco UCS, NetApp?  How would you explain how a router works to your grandmother?  Describe a situation in which you have explained something technical to someone else by using a simpler analogy.  What are you doing right now outside of work to improve your technical abilities?"}, {"date": "26 Apr 2014", "title": "Facilities Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Birmingham, England) in Jun 2012", "Interview Descriptions": "Apply to the job by sending application form. Fist interview with the hiring manager and HR rep, possible second interview with upper manager.  Basically, your chances increase with the calling you hold or have held in the Church. Also, there is a lot of politics and friends of friends.", "Interview Questions": "No difficult questions at all, and no unexpected questions as well."}, {"date": "7 Dec 2016", "title": "Principal Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Mar 2012", "Interview Descriptions": "Met with the manager and their senior software engineer. I was asked technical questions about different technologies that were in use for web development at the time. The interview was pretty stress free.", "Interview Questions": "What technologies would you use to build your Java web application?"}, {"date": "29 Mar 2013", "title": "Accounting I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Dec 2011", "Interview Descriptions": "I had 2 interviews with them, both with 2 interviewers. They asked general questions like tell me about yourself, tell me about your successful story, what is your weakness, etc. They were sincere and very kind. The interview went for about 30 minutes.", "Interview Questions": "They tested me some accounting knowledge. Get prepared reviewing basic accounting principles."}, {"date": "23 Jul 2015", "title": "Senior Network Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT) in Sept 2011", "Interview Descriptions": "The interview was very technical and gave me a good opportunity to explain and demonstrate my skills and abilities. It was a bit drawn out, but I was not in a hurry, so that didn't matter to me. The people conducting the interview were very intelligent, but not cocky. The interview was very casual.", "Interview Questions": "Diagram a recent network that you have designed"}, {"date": "6 Aug 2015", "title": "Project Manager III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT) in May 2011", "Interview Descriptions": "The process is very far. Candidates are considered for based on their strengths, experience, recommendations, corporate fit and team fit. I have been very pleased that management includes the teams and business partners in the interview to insure that the candidate get's a far chance to be evaluated by multiple people.", "Interview Questions": "How do you feel like your contribution will help Hasten the Work."}, {"date": "6 Oct 2015", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Apr 2011", "Interview Descriptions": "I interviewed with the hiring manager and the department director. I worked as a contractor first and they liked my work so they offered me a full-time job. This was a great situation because they could see what I did. I recommend this to anyone trying to get in. See if you can get a job as an intern or contractor. This gives the company manager a chance to see what you can do and to really use your skill set. I felt I was treated fairly. The interview with the director was short and informal. I explained what I had been doing and what I was planning on doing as a full-time employee.", "Interview Questions": "They gave me some real life scenarios and asked how I would respond in those situations."}, {"date": "19 Feb 2014", "title": "Processing Clerk III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Feb 2011", "Interview Descriptions": "Given a test to do online and then had an in person interview.", "Interview Questions": "NA"}, {"date": "10 Dec 2013", "title": "Incident/Tech Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jan 2011", "Interview Descriptions": "Only one interview, this was a behavioral and pretty basic interview. Asked a lot of problem solving questions and what my tech experience has been.", "Interview Questions": "Figure out the object in the room that I am thinking of."}, {"date": "9 Oct 2010", "title": "Security Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in May 2010", "Interview Descriptions": "To work security for the Church, you need to be a \"card-carrying\" member to even be considered.  A friend worked there and gave me the number of someone in HR.  I called him, and although they weren't hiring at the time, I put my resume on file.  I called two weeks later, to check the status of the soft hiring freeze.  One month after that, I got a call and had a phone interview that lasted 30 minutes or so.   We set up a time to have a preliminary interview.  \r\n\r\nIn that 1:1 interview,  I was asked why I'd want to work for the Church, why I wanted to work security, etc.  A good portion of the interview was then set aside to run me through a scenario where I'd be working security and had to make decisions - call for back up? - and the specifics they asked me to not share. This interview was fairly heavy.\r\n\r\nAfter passing this, there was physical test (running, carrying a body, etc).  I was given a soft offer with details of my salary, benefits, etc.  \r\n\r\nActually hiring me would depend on the last few steps in the process: another more extensive background check, a psych eval, and a panel interview.", "Interview Questions": "What would motivate you to work security for the church?"}], [{"date": "14 Nov 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 5 months. I interviewed at The Church of Jesus Christ of Latter-day Saints in Jan 2010", "Interview Descriptions": "Was referred to the position by my ecclesiastical leader. I met with the current manager and submitted my resume. I interviewed with the current manager then with the manager of field operations by phone. Interviewed with several more individuals over a 5 month period before the offer", "Interview Questions": "Many situational questions such as \"Tell me about a time when you had a conflict with a supervisor. and \"Tell me about a time when you had a difficult task to complete. "}, {"date": "13 Mar 2013", "title": "Material Handler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Oct 2009", "Interview Descriptions": "The hiring process was super easy, they don't really look for much other than are you a hard worker and do you keep the standards of the church. I think they might ask to see your temple recommend.  So as long as you look sharp have a good reference and they think you will be dependable you probably have the job.", "Interview Questions": "They just try and get to know you is all."}, {"date": "13 Mar 2013", "title": "General Interview Process Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Riverton, UT) in Jan 2009", "Interview Descriptions": "I had an interview on the college campus, which was really more of a interview filter process then it was a real interview.  \r\nThen about a month later I was called on the phone and interviewed by a team of 4 hiring managers.  Each took a turn asking me technical and personal questions.  This interview lasted about 30 minutes.  I was then told I would be contacted in the near future about the possibility of another interview.  \r\nI was contacted about 3 days later and was scheduled for an in house interview with the same team of 4 hiring managers I spoke with on the phone.  When I arrived, I was taken to a team room where each of the hiring managers took turns asking me questions and having me draw diagrams on the whiteboards.  Honestly, the interview was quite fun.  I was asked questions such as 'Draw a virtual cloud environment running in two remote data center sites.\"  I was then given 5 minutes to draw the two data centers, the servers/networking/storage/etc that would be required to run a redundant cloud environment.  \r\nI was also asked questions such as \"what was the most difficult time of your life.  How did you get through it?\"", "Interview Questions": "I was listed of a dozen or so acronyms and asked to state what each stood for and how it was applied in the IT industry.  For instance, 'RAID', - Redundant Array of Independent Disks - technology utilized at the SAN/NAS/Storage and server layers to offer greater disk IO performance, redundancy for failures, and high availability.\r\nI was given a dozen or so acronyms, many were easy and several were purposefully either unique or non-existent.  They were testing to see if I would make something up."}, {"date": "26 Jun 2013", "title": "Welfare Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jan 2009", "Interview Descriptions": "The hiring process is long and drawn out with gaps in between notifications. You have to be patient.", "Interview Questions": "If you were a animal, what would it be?"}, {"date": "28 May 2013", "title": "Custodian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at The Church of Jesus Christ of Latter-day Saints (Salt Lake City, UT) in Jan 2009", "Interview Descriptions": "The hiring process is really simple. The main interview is with the one of the HR main guys which doesn't take more that 25-35 min. The questions are related with attitude and how well you take orders and team work.", "Interview Questions": "Not really, Are you a team player?"}]]