[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great company - committed to its mission and the health and wellness of its employees", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Apr 2014", "job_title": "Anonymous Employee in Portland, OR", "duration": "N/A", "pros": "Family friendly; incredibly accommodating to the many challenges we all face outside of work when it might impact schedules, etc; committed to its students - always making decisions with the best interests of students and staff in mind first - not a focus on the bottom line like most companies!", "cons": "Always so much to do - but that's really a pro! We're doing great work to support students and help change lives! ACHS is an opportunity for a rewarding, meaningful career :)"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "The good and the bad", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Dec 2022", "job_title": "Art Director in Portland, OR", "duration": "N/A", "pros": "Good ethos, lots of good people, a great legacy and opportunity", "cons": "Shady management will squeeze you out"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Disturbing experience...", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Oct 2017", "job_title": "Anonymous Employee in Portland, OR", "duration": "N/A", "pros": "Highly devoted and smart employees", "cons": "This dysfunctional family business includes the humorless owner, her  two daughters who have chosen not to actually work onsite (or off?) due to the owner’s ultra-controlling and equally humorless mini-me.  Because the owner and her mini-me, have not had business experience outside of ACHS, they continually have to reinvent the wheel.  And, since no one could possibly be as intelligent as they are, they refuse to entertain the idea that someone might have useful knowledge to contribute.  Instead, time-consuming systems and processes are implemented that do not contribute to anything other busy work.\r\n\r\nIf you want to have every aspect of your work reviewed like you’re a poor performing 5th grader, report the tasks you complete on daily AND a weekly basis, don’t mind buying your own office supplies, relish being unappreciated and patronized, enjoy having every one of your telephone conversations recorded, enjoy being on camera in the workplace, think nepotism makes good business sense, aspire to have your already below average salary cut by 20% because of bad business decisions and take pleasure is gouging students, this is the place for you!"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Amazing school with not the best management", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Apr 2019", "job_title": "Administrative Assistant in Portland, OR", "duration": "N/A", "pros": "The school is amazing and people are passionate about what they’re doing which makes it even better. The office is always full of snacks and there’s never a lack of work to do.  It really feels like a family working there.", "cons": "While you’ll be working with extremely talented people they’re under paid and over worked. The operations manager is a micro manager who makes it difficult to communicate issues."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "College is dedicated to student and employee success. Poised for growth as Complimentary Alternative Health is embraced.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Apr 2014", "job_title": "Anonymous Employee in Portland, OR", "duration": "N/A", "pros": "Truly dedicated team- the school's mission is to support students and graduates worldwide in his/her journey  into CAM & holistic health. Everyone on staff embraced as family.  Generous benefits offered~ especially for a small company.  President and Senior Management flexible, as needed, for employees to manage life/work/family- well life! Beautiful teaching herb garden. Green initiatives in workplace.", "cons": "Juggling the varied tasks in a busy schedule. Open office environment can be loud on occasion."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Terrible place to work.  Unless you are related to the owner you are treated badly.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "3 Nov 2013", "job_title": "Anonymous Employee in Portland, OR", "duration": "N/A", "pros": "The hours were okay, generally Monday through Friday 8:30-5:30, and occasionally a Saturday for Mandatory Volunteering at Farmers Market's...which actually isn't volunteer if you are required to do it. The job responsibilities are fine, and the job can actually be quite enjoyable.", "cons": "The pay and the benefits were terrible.  There is no way with the pay that is offered that someone could reasonably afford the benefits if they were married or had dependents.  There is a double standard for relatives verses regular employees.  Relatives of the owner don't have to work regular hours and honestly don't seem to work at all, especially because they bring their children to work with them."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Adjunct faculty", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Oct 2017", "job_title": "Anonymous Employee in Portland, OR", "duration": "N/A", "pros": "The pay is decent, but now depends on the number of students you have", "cons": "High expectations of faculty and low expectations of students. Students are anti-everything: anti-medicine, anti-government, anti-vaccine, anti-milk, anti-meat, and on and on."}], [], []]