[[{"date": "14 Mar 2023", "title": "Behavior Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Children's Specialized Hospital", "Interview Descriptions": "The interview process was fast. I had an interview with the clinical director. She was very nice and easy to talk to. I received an offer the next day and accepted immediately", "Interview Questions": "Why are you interested in working with children with pediatric feeding disorders?"}, {"date": "20 Oct 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Children's Specialized Hospital (Mountainside, NJ) in Oct 2021", "Interview Descriptions": "I applied online in June then received an email for open interviews in October. I signed up for a time slot for my interview through a link provided. Interview was short and sweet, and she only asked me to “tell me about yourself.” She also spent a lot of time talking about the facility and answering my questions. HR contacted me a day later with an offer.", "Interview Questions": "Only “Tell me about yourself.”"}, {"date": "1 Nov 2021", "title": "Rec Therapy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Children's Specialized Hospital (Toms River, NJ) in Oct 2021", "Interview Descriptions": "It started out as a phone interview, to go over what exactly the job is. Then an on-site interview was offered. \r\nAt the on-site interview, we took a tour of the facility and discussed expectations and all of the things available to employees.", "Interview Questions": "What ideas do you have for activities?\r\nHow flexible is your schedule?"}, {"date": "9 Sept 2021", "title": "Diff Positions-coord, Registrar, Etc Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Specialized Hospital in Aug 2021", "Interview Descriptions": "Group interview went well and was open to many diff people and their experience. There were many people in the room with experience and I got called. Salary offer wasn't what I expected especially me working in ny with a bunch of experience but I hope for growth within.", "Interview Questions": "Why should we Hire you ? "}, {"date": "12 Jun 2021", "title": "RN Floor Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Specialized Hospital", "Interview Descriptions": "it went really well, answered all my questions and discussed the position at length. Even took me on a tour of the floor. Introduced me to some of the other nurses on the floor and left me with the RN to further discuss the unit.", "Interview Questions": "what was the patient to nurse ratio."}, {"date": "6 Jul 2022", "title": "Speech Language Pathologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Children's Specialized Hospital in Jun 2021", "Interview Descriptions": "Easy, virtual. I spoke with the department head and they described the duties and day-to-day experience. They seemed desperate to hire. TIme was allotted to ask additional questions. Seemed less formal. Very kind.", "Interview Questions": "What is your experience in the field"}, {"date": "12 Apr 2021", "title": "Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Children's Specialized Hospital", "Interview Descriptions": "Two people interviewed me at once. very conversational and professional. They asked for specific case conceptualization and showed interest in experience with children. They also appreciated that I was open to multiple opportunities within the hospital, not just assessment.", "Interview Questions": "Can you explain this experience on your CV? "}, {"date": "16 Sept 2022", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Specialized Hospital in Jan 2020", "Interview Descriptions": "Two rounds of interviews. First virtual with 2 people. Progressed to second in person interview with an additional 3 people. Then went on tour of facility with another staff member", "Interview Questions": "Standard questions, scenario based, situational"}, {"date": "16 Jun 2019", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Children's Specialized Hospital in Apr 2019", "Interview Descriptions": "I applied online, heard back within 3 days, and confirmed for a group interview the following week.\r\nThere were at least 10 other people at the group interview, and they went around asking everyone the same questions. The interviewers were really friendly and tried to keep the mood a little more lighthearted. The whole process took almost 3 hours as we had to wait for a manager to interview everyone individually after the group interview. \r\nThey said that we would hear back within a week but didn't hear anything from them for a while.", "Interview Questions": "Why do you want to work at Children's Specialized Hospital?"}, {"date": "8 Jun 2019", "title": "Patient Liaison Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Children's Specialized Hospital (Somerset, NJ) in Apr 2019", "Interview Descriptions": "Interview process ways pretty quick but it seems like the women that interviewed me at the Somerset office were intimidated by my presence. I didn’t think that being presentable was going to be a downside for me. One woman kept staring at my watch and my pedicure...smh. There’s is NO COMMUNICATION even when you are no longer being considered for the position. HR and the interviewing process is lax.", "Interview Questions": "Tell about yourself"}], [{"date": "16 Jun 2017", "title": "Environmental Service Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Specialized Hospital (Mountainside, NJ) in May 2017", "Interview Descriptions": "It was great! We had got invited to complete interviews on a website. There were around 8 questions that were relatively easy questions. More so on the behavioral side.", "Interview Questions": "Question: What does excellence mean to you?"}, {"date": "26 Feb 2017", "title": "Respiratory Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Specialized Hospital (New Brunswick, NJ) in Nov 2016", "Interview Descriptions": "The interview process went fairly well. You first have to do a video interview. The video interview has questions on the screen. It is asked one by one. You have about a minute to gather your thoughts then you can record your answer. After you record your answer then you can move onto the next question. The video interview goes by quickly. You can finish it in less than ten minutes. If they are still interested in you then you will get called into the department you're applying to for a face to face interview.", "Interview Questions": "How would you describe a good manager?"}, {"date": "11 Mar 2017", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Children's Specialized Hospital (New Brunswick, NJ) in Oct 2016", "Interview Descriptions": "Video interview was given in stead of phone/in person interview. It was not in person. You log in to the link and get practice questions first, and you can keep practicing until comfortable. when ready, you start the process. You are limited to 2-3 minutes to answer each question.", "Interview Questions": "How did you help someone/friend in need"}, {"date": "18 Sept 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Children's Specialized Hospital (New Brunswick, NJ) in Apr 2016", "Interview Descriptions": "I went to Rutgers University and a professor of mine suggested I reach out to CSH to see if they had any internship opportunities. I contacted the person suggested and she reached out to me within 2 days. We spoke on the phone and she asked me questions. She then asked me to come meet in person to discuss moving forward and some of my goals for this internship. I was also given a tour of the hospital in New Brunswick.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "30 Dec 2019", "title": "Psychotherapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Children's Specialized Hospital (New Brunswick, NJ) in Dec 2015", "Interview Descriptions": "Call interview & then in person interview with two supervisors who asked questions about past experiences. Must have vaccinations and attend medical appointment prior to starting to be sure all shots are up to date. Requires some evenings.", "Interview Questions": "Describe a difficult client "}, {"date": "19 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Specialized Hospital", "Interview Descriptions": "First part was a video interview that asked 7 basic questions. You had a specific amount of time to answer each question. \r\n\r\nAfter the video interview (if you are selected), there is a 2 part exam they have you take. Pretty easy basic questions. They will email a study guide prior to interview day. Once the exam is over you sit down with the nurse manager and discuss more about the position and asks you some more questions.", "Interview Questions": "How would I react in a case with a difficult parent?"}, {"date": "1 Oct 2015", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Specialized Hospital (Mountainside, NJ)", "Interview Descriptions": "Came in to speak with HR, the woman told me more details about the job, such as pay and hours. I then took a CNA test online, when passed I was brought up to talk with the Nurse Manager and that was where the interview took place and was given a tour of the unit. A couple days later I was called and offered the job.", "Interview Questions": "Describe your past experiences"}, {"date": "26 Sept 2013", "title": "Housekeeping Supervisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Children's Specialized Hospital (Mountainside, NJ) in Aug 2009", "Interview Descriptions": "the hiring process is fair but once your hired all hell break lose the housekeeping manager is a poor manger and nobody in upper management oversees him,no housekeeping manager works there from more them 2 years because of him.", "Interview Questions": "salary question because they are none profit"}, {"date": "22 Sept 2011", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Children's Specialized Hospital (Mountainside, NJ) in Jul 2009", "Interview Descriptions": "After applying online I got a call to come in for an interview 2 weeks later. I interviewed with HR & then the supervisor of scheduling. I was offered the position 2 days later.", "Interview Questions": "What is your greatest strengths?"}]]