[[{"date": "3 Nov 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Brightpoint Health", "Interview Descriptions": "IT was so much to learn everyone was amazing. The process is really smooth. Tell me about yourself and why should we hire you.Did you get an offer. lala lallllala", "Interview Questions": "Tell me about yourself and why should we hire you?"}, {"date": "19 Aug 2019", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Brightpoint Health (New York, NY)", "Interview Descriptions": "It was with the director and did not last very long. She asked me questions based on my resume and experience, showed me around the location where I would be working and scheduled me to sit with a current employee to learn work flow.", "Interview Questions": "Why are you making a lateral move?"}, {"date": "13 Jul 2018", "title": "Unit Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Brightpoint Health (New York, NY) in Jul 2018", "Interview Descriptions": "A little intense being interviewed by three people one after the other asking so many questions. Feeling weird looking from one person to the next after answering each question.  Interviews like this help sharpen your skills", "Interview Questions": "You should know their core values. They ask you questions and your answers should include the core values "}, {"date": "3 Mar 2018", "title": "Mental Health Clinician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Brightpoint Health (New York, NY)", "Interview Descriptions": "Initial call from Brightpoint Search in a state other than NY (where the position was). Assured me that I would be doing Group and family therapy. Arranged for an interview at a Site in a borough of NYC other than the one in which I would be working. Interview was unfocused. Next day I get a call from the Out if state recruiter saying I was being offered the job. Really? I didn’t see the site I would be working at, didn’t meet the person who would be my Supervisor and they were offering me the position. I told the recruiter I needed a day to think about it. He told me that was not acceptable, that there were numerous candidates selected for that position and I had to decide by the end of the day. I called later that day declining the offer and the recruiter asked me if I wanted to see the site before I made a decision. Well, Duhh, that is something that any other recruiter would have offered much earlier. I accepted the site visit which was ac10 minute “run through” of a site that looked like a “Medicaid Mill”. Later that day I got a call saying I needed to make a decision. Since I was out of work for a few months and eager to get back to work, I accepted the job due to its location and hours. But I was right... it IS a Medicaid Mill and I should have steered clear of this Agency based on the lack of professionalism shown during the interview process.", "Interview Questions": "How did you learn about Brightpoint?"}, {"date": "19 Apr 2016", "title": "Account Liaison Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Brightpoint Health (New York, NY) in Mar 2016", "Interview Descriptions": "I was called to interview for Bright point health. I initially met with a Ms. Hayes and two account manager all  of them were very friendly. That same day I was called back to meet with Ms. Hayes for a second Interview at their Bronx site. We toured the site and she asked me a few questions and stated that someone would be in touch with me. It took a week and a half before they let me know whether or not they wanted to Hire me. I was told that they wanted to hire me and that I had to wait for internal approval and that someone from HR would be contacting me. I waited an additional three week to hear from someone and was told that they are not going to hire for that position any longer and that there were layoffs through out the company. He was going to consider me for another position but because I was not a pro a Excel he told me that he would keep my resume on file. Not very professional in my opinion.", "Interview Questions": "What do you know about the company ?"}, {"date": "6 May 2016", "title": "Nurse Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Brightpoint Health (New York, NY) in Mar 2016", "Interview Descriptions": "A 30 minute phone interview was conducted with a very pleasant woman. I was then set up for a face to face interview two weeks after this. The interview itsel went well, they were very interested in what of their core values most spoke to me. The interview went very well for the most part. After, I received an email to set up a time to shadow an established nurse manager. It was WEEKS of back and forth before I was finally told the position had been out on hold due to budget cuts. I think In this instance, someone should have notified me not me digging for answers.", "Interview Questions": "Which of our core values do you most indentify with?"}, {"date": "23 Feb 2016", "title": "Credentialing Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Brightpoint Health (New York, NY) in Nov 2015", "Interview Descriptions": "The interview was very disorganized while one person was interviewing me she was on the phone constantly trying to find the other party that was supposed to interview me.  Overall very mediocre interview.", "Interview Questions": "How long have you worked in your Feild? I am impressed, Do you really need want this job?"}, {"date": "24 Apr 2018", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Brightpoint Health (New York, NY) in Feb 2015", "Interview Descriptions": "Phone Interview followed by in person interview. Tested me on the core values; went thru my resume felt more of a conversation that a formal interview. Provided with a tour and son", "Interview Questions": "Average questions pertaining to my background"}, {"date": "24 Oct 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Brightpoint Health (New York, NY) in Mar 2013", "Interview Descriptions": "A group a senior management, apparently hastily arranged. CEO appeared to drive the process. It was less an interview, more a prolonged speech. The sense I got was that the interview was a formality. They had an opening and wanted to staff it as quickly as possible.", "Interview Questions": "How much salary would you need?"}], [{"date": "5 Jun 2015", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Brightpoint Health (New York, NY) in Jun 2011", "Interview Descriptions": "Brief, screened by internal hr people. Interviewer was pleasant and friendly, but was more interested in representing the company than my background. The process took a long time for internal approval.", "Interview Questions": "What have you heard about us?\r\nCareer goals 5+ years"}]]