[[{"date": "5 Apr 2023", "title": "Estate Services Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Octavia (London, England)", "Interview Descriptions": "Talent acquisition called 1st for an initial phone interview. Phone call was nice and simple and informative. They called me back for a face to face interview in the London Head Office. The interview was with 2 managers from the department who asked 10 questions follwed by a written exercise.", "Interview Questions": "All questions are based on experiences and examples of them from previous positions."}, {"date": "12 Dec 2022", "title": "Income Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Octavia (London, England) in Nov 2022", "Interview Descriptions": "The interview process was very good. The people on the panel were nice and it didn’t feel daunting or intimidating in anyway. The process of the interview was explained before it started and they allowed time for questions afterwards. Overall it was a very nice interview that didn’t leave me feeling stressed or nervous.", "Interview Questions": "Tell us about your history of income collection"}, {"date": "14 Dec 2022", "title": "Rent & Service Charge Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Octavia (London, England) in Nov 2022", "Interview Descriptions": "I had a pleasant overall experience, from speaking with the recruitment team to discussing the vision for the role with the hiring manager. I felt wanted, especially when I was given the opportunity to come back for an interview after a brief illness kept me from the initial interview. The recruitment manager was very caring and understanding after I was offered the role and was struggling to decide between accepting the offer from Octavia or the counteroffer from my previous employer. Overall, the entirety of the interview process was pleasant and engaging.", "Interview Questions": "Present your vision of a high-performing service that delivers clear and accurate information to customers on rents and service charges"}, {"date": "23 Nov 2022", "title": "Service Development Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Octavia (London, England) in Oct 2022", "Interview Descriptions": "A 1 hour interview on competency based questions asking how I would go about doing aspects of the role and other soft skills such as communication and time management. Time for questions at the end about working at Octavia.", "Interview Questions": "- What’s the external operating context and how will that impact the teams work? - How would you approach carrying out a policy review? - how do you managed your time and prioritise your work?"}, {"date": "6 Nov 2022", "title": "LMS Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Octavia (London, England) in Sept 2022", "Interview Descriptions": "There had been two stages interview: the screening interview and an in person interview which included an assessment too. During the process everyone was very nice and friendly, with a very good communication from the recruiter and I had also received tips on how to prepare for the interview.", "Interview Questions": "Describe a situation when you had to adapt your delivery style to accommodate a diverse audience."}, {"date": "16 Aug 2022", "title": "Administration Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Octavia (London, England) in Aug 2022", "Interview Descriptions": "Two stage interview process; first stage assessing basic skills and second stage deeper questioning from day to day tasks to work outlook. Friendly interviews throughout and generally an enjoyable experience.", "Interview Questions": "How would you gather information to create a information booklet for a client?"}, {"date": "18 Feb 2022", "title": "Scheme Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Octavia (London, England) in Jan 2022", "Interview Descriptions": "I had a Competency  based interview  over teams, with two team members. they both made me feel very comfortable and answered any questions i had.  felt like a converasation rather than a scary interview.", "Interview Questions": "Tell me about a time when you had to deal with a difficuilt situation "}, {"date": "20 Jan 2022", "title": "Bank Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Octavia (London, England) in Dec 2021", "Interview Descriptions": "The interview process was friendly and straightforward .   I had an informal chat on the phone,  I submitted my CV and was given an online interview.   During  Interview I was given information about training , development and career progression within the charity.   Once the interview was complete my references were checked and I was given an offer of employment.", "Interview Questions": "Questions about charity shops and my experience working within the voluntary sector."}, {"date": "28 Jan 2022", "title": "Care Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Octavia (London, England) in Dec 2021", "Interview Descriptions": "It went extreamly well and the manager was so welcoming , i went in and took a seat to do my interview and got asked a few questions. They weren’t difficult at all. Overall, i’d say it was great.", "Interview Questions": "what would you do in the situation of a client falling down the stairs?"}, {"date": "17 Dec 2021", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Octavia (London, England) in Dec 2021", "Interview Descriptions": "Competency-based interviews in two parts. A majority of the first interview was used to test my knowledge, experience and approach to company security. The second was based around what I plan on bringing to role and what support I need to achieve it.", "Interview Questions": "How have I reacted to a security breach in the past? "}], [{"date": "30 Nov 2021", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Octavia (London, England) in Nov 2021", "Interview Descriptions": "The interview process was smooth, straightforward, and professional. I first had a telephone interview, after a video interview,  and feedback was given within 2 days. So, the whole process took about a week.", "Interview Questions": "Tell me about yourself,\nWhat do you know about Octavia?\nThe differences between a charity shop and a normal shop.\n"}, {"date": "22 Nov 2021", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Octavia (London, England) in Oct 2021", "Interview Descriptions": "Multi-stage interview process with management team reps, the CEO and finally the Chair showed great investment from Octavia in getting the recruitment right.   I was really impressed that they offered me a second go at the initial interview when my wifi went down, acknowledging the issues of doing recruitment via the internet.", "Interview Questions": "A solid range of competency-based questions with no ‘bear traps’."}, {"date": "3 Nov 2021", "title": "Compliance Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Octavia (London, England) in Sept 2021", "Interview Descriptions": "First I spoke on the phone to the recruiter. After a week she notified me that I was accepted for the interview. I chose the day and time for the interview from the offers. I had the very long interview with 3 pannelists. They called me the day after the interview and offered me the job.", "Interview Questions": "To explain why I am appropriate for the job."}, {"date": "13 Nov 2021", "title": "Assistant Director of Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Octavia (London, England) in Sept 2021", "Interview Descriptions": "The interview process was extremely professional. I got all pre interview information on time and the actual interview was conducted with decorum.\n\nThe members of the panel gave me sufficient time to provide answers which i supported with examples and they asked numerous followup questions. This made it engaging and purposeful.\n\nAt the end of the interview i was given an opportunity to ask questions and was also given information on next steps.\n\nI also thought the interview process itself was very fair. The panel reflected the society in which we live and i valued this very much. It made it the right choice for me.", "Interview Questions": "How i felt working in an organisation which valued diversity and helping the needy."}, {"date": "26 Oct 2021", "title": "Outreach and Befriending Link Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Octavia (London, England) in Jun 2021", "Interview Descriptions": "The interview was online, the questions were very relevant and job specific. There was plenty of time to ask questions.  The interviewers were very friendly and put you at ease.", "Interview Questions": "What your understanding of the job was."}, {"date": "25 Dec 2020", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Octavia (London, England) in Dec 2020", "Interview Descriptions": "Position advertised for six days. \r\nStage one of a two stage interview process scheduled with just over half a day’s notice.\r\nIn addition interviews scheduled before expiry of job advert. \r\nEntire process was not  in keeping with public sector best practice recruitment. Felt like a process designed to give the appearance of equal opportunity.", "Interview Questions": "Style and technical based questions."}, {"date": "7 Feb 2021", "title": "Shop Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Octavia (London, England) in Sept 2018", "Interview Descriptions": "Unprofessional, untrained staff, didn’t really act confident \r\nNot very good at interviewing, forgot to get back to me with an interview date, I had to contact head of department to get my interview.", "Interview Questions": "What is your favourite shop."}, {"date": "26 Nov 2017", "title": "Communications Trainee Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Octavia (London, England) in Nov 2017", "Interview Descriptions": "Was a very long online application process. I was shortly contacted. The interview itself had a written email test and a panel interview which seemed quite unprepared. Contacted a while later saying they are yet to make a decision and I will be contacted. I was not contacted. Overall quite unprofessional considering the time and efforts I put into this", "Interview Questions": "Tell us about an event you were in control of?"}, {"date": "26 Apr 2015", "title": "Service Improvement Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Octavia (London, England) in Jul 2013", "Interview Descriptions": "Submission of CV and Covering Letter. After shorlisting traditional panel based interview and written test. The experience was very poor. Was left waiting for more than 50 minutes in the reception area. No-one explained why the delay? Eventually collected by someone who never apologised for the wait. Taken up to the fourth floor - in silence, person never attempted to make conversation. Taken into room for test and found the previous candidates work clearly visible and accessible on the laptop. Had a negative effect on me for the rest of the process.", "Interview Questions": "What is your project management style?"}]]