[[{"date": "30 Mar 2023", "title": "Campaigns Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Scope in Mar 2023", "Interview Descriptions": "Interview over Teams. 20 minute slots available for the interviews. Told at interview it was actually a two stage interview with second interviews the next week on a set date.", "Interview Questions": "Please can you talk us through why you have chosen to apply for this role, and how your experience will help?"}, {"date": "5 Dec 2022", "title": "Assistant Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Scope (Oxford, England)", "Interview Descriptions": "Quite simple just a few competency questions and easy going style. The general process was pretty standard but it felt like they wanted a reason to say yes rather than no, which was nice.", "Interview Questions": "How I would go about reorganising to increase the sales."}, {"date": "22 Jul 2022", "title": "Marketing Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scope", "Interview Descriptions": "Very well put together. Straightforward and great communication. Clear expectations and simple instructions. \r\n\r\nOnly complaint would be that during the interview, someone who had the room booked insisted we left which felt quite disruptive.", "Interview Questions": "What is your greatest strength? "}, {"date": "24 Feb 2022", "title": "Volunteering Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scope in Feb 2022", "Interview Descriptions": "Firstly the interviewer gave a summary about the team, then I had to do a 5 minute pre-prepared presentation (a short brief was supplied in advance, in the invite to interview). There was then 8 competency questions", "Interview Questions": "Something along the lines of: What attracted you to work for Scope?"}, {"date": "29 Nov 2021", "title": "Senior Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scope", "Interview Descriptions": "The interview consisted of a 20 minute task which required no advanced preparation. Then 40 minutes to present back the task and then complete around 7 competency based interview questions.", "Interview Questions": "Standard competency based questions and why I was attracted to the role/company."}, {"date": "20 Sept 2021", "title": "Evaluation Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Scope", "Interview Descriptions": "The interview process was very accessible to me as a disabled person. I was given multiple opportunities to request reasonable adjustments, all were given in full. The interview panel (three senior team members) was very welcoming and friendly, and they engaged with my answers and questions fully. The interview took place over Microsoft Teams and lasted one hour. The lead interviewer offered to write the questions in the chat and reinstated my access requirements at the beginning of the interview so they were acknowledged. They have an interview guarantee for all disabled candidates who meet the essential criteria for the role.", "Interview Questions": "Why are you interested in working in the area of disability equality?"}, {"date": "6 Jun 2021", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Scope", "Interview Descriptions": "Interview was simple question were asked mostly about management, experience and how to deal certain types of customers \r\n\r\nAfter interview they will ask you to come do a trial the week after or couple of days depending on your availability, during trial you will be probably to be asked to merchandise any of the shop donated clothing and style it in fashionable way given a time limit, Then later you will be asked to fill up a form to calculate the shops budget and then after they will give you how long they will contact you.", "Interview Questions": "Are you able to manage shop floor on your own?"}, {"date": "9 May 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Scope", "Interview Descriptions": "Good it was nice to hear that the staff really cared about the organisation and that they wanted people that cared on board. \r\nThe manager at my branch was kind and supportive.", "Interview Questions": "Interested in this role or no?"}, {"date": "5 Apr 2021", "title": "Senior Marketing Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Scope", "Interview Descriptions": "Interview was professional and interviewees asked open questions, listened and wanted to understand my competency and skills. They asked in depth questions and probed for answers. They put me at ease so I was able to demonstrate my ability.", "Interview Questions": "To break down a recent campaign and which channels performed best"}, {"date": "26 Mar 2021", "title": "Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Scope", "Interview Descriptions": "An informal chat with the manager - Told me when I could start immediately & had to fill out a form about where I lived, age, etc... for them to have in their system", "Interview Questions": "Can I work on the tills?"}], [{"date": "6 Sept 2020", "title": "Charity Shop Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Scope", "Interview Descriptions": "I applied for the \"Volunteer Shop Assistant\" role via Scope's website. I was contacted a couple of days later, and was asked to go into the shop the following week for an interview. I was met by the shop manager and told about what volunteering would entail.", "Interview Questions": "Why would you like to volunteer for Scope?"}, {"date": "8 Jan 2020", "title": "Online Product Lister Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Scope (Manchester, England) in Dec 2019", "Interview Descriptions": "Applied online through job platform, after few days got a call and invited to the interview.\r\nThey sent me email bout what to bring to the interview (documents and forms).\r\nI arrived early and the hiring manager was so nice and friendly. Not that formal interview, basic questions, really friendly just want to know bout you and your experiences.\r\n\r\nAfter a week, I got the offer, the hiring manager called me, but unfortunately have to declined the offer due to the work place too far for me to commute (it advertised to be in Manchester, but it is at Sale). Overall it was nice and no pressure experienced.", "Interview Questions": "Tell me about yourself?\r\nWhat’s your hobbies?\r\nTell me bout your work experiences that contributed to the role?\r\n "}, {"date": "21 Nov 2022", "title": "Employment Adviser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Scope (London, England) in Nov 2019", "Interview Descriptions": "It was a two stage interview. First stage was face to face group interview where we sat next to another candidate and had a few minutes to find out about them and then introduce them to the rest of the group, explaining what they had to offer. The next task was, working in groups of 4 we were given a scenario of being ship wrecked. We were given a list of items to choose from and prioritise which items we would need first. The last task was an independent writing task. We were give some background information of a customer and had about 15 mins to write up an action plan.. Following this first stage, any successful candidates were then contacted by email and short listed for a panel interview the following week. I was interviewed by 3 people and it lasted approx 45mins.", "Interview Questions": "They asked me lost of competency based questions around my experience in supporting people in employment, group delivery, setting action plans etc. They also asked me about my understanding of Scope's vision and the 'social model of disability' and what my greatest personal achievements have been."}, {"date": "19 Nov 2020", "title": "Programme's Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Scope (London, England) in May 2019", "Interview Descriptions": "Interview with 3 members of staff in the London offices- beautiful office and very friendly atmosphere. \r\nNeeded to do a 10 minute presentation on the Social Model of Disability, which took some preparation. \r\nUnfortunately, I received no e-mail after the interview about not getting the role. I sent an e-mail asking for feedback and did not receive a reply. It's a real shame that they didn't put more time into a simple  reply.", "Interview Questions": "Presentation on teaching the social model of disability "}, {"date": "13 Nov 2018", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scope", "Interview Descriptions": "It was a face to face interview, 2 to the panel and was invited by e-mail after submitting CV and covering letter. Lasted approximately 1 hour, set of questions relevant to people management and performance", "Interview Questions": "Various questions on people management "}, {"date": "9 May 2018", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Scope (Hove, England) in Mar 2018", "Interview Descriptions": "The interview process was a relatively simple one. I was asked to meet in the local store and talk to one of the managers, the tone was very casual as she asked a series of basic standardised questions. The atmosphere was very calm and casual.", "Interview Questions": "What skills do you wish to improve volunteering here?"}, {"date": "7 Aug 2019", "title": "Senior Azure Platform Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Scope (London, England) in Nov 2017", "Interview Descriptions": "The process was very informal and pivoted around the company’s mid to long term digital transformation goals.  The interviewer then went on to talk around the role specifics and the type of challenges faced.", "Interview Questions": "A summary of past experience."}, {"date": "5 Dec 2017", "title": "Store Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Scope (Exeter, England) in Sept 2016", "Interview Descriptions": "Ist interview with area manager and second with area and regional manager.  Had to do a swop report and review own shop good and bad points and perceived competitors and justify", "Interview Questions": "How would you deal with a lack of donations and who would you approach to fullfill this?"}, {"date": "17 Feb 2017", "title": "Communications/Press/Marketing Role Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Scope (London, England) in Jan 2015", "Interview Descriptions": "Interviewed by two managers (one who turned out to be good and another who turned out to be poor). It was quite laid-back but I was asked questions about my experience and suitability - quite standard. I also had to complete a writing and editing task.", "Interview Questions": "General interview questions about experience, strengths etc."}]]