[[{"date": "27 May 2022", "title": "Nursing Student RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UM St. Joseph Medical Center", "Interview Descriptions": "Phone interview was set up quickly and I was pleased with the experience. I was only in touch with the person(s) I would be working with, which seems appropriate.  Great process.", "Interview Questions": "Why do you want to be in this department?"}, {"date": "18 Jan 2021", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UM St. Joseph Medical Center (Towson, MD) in Dec 2020", "Interview Descriptions": "I applied online, then received an email a week later to speak with the nurse recruiter. After that I set up a time to interview with manager and went in for share-time 2 weeks later. Everything went very well, which is why I was shocked to not have been offered the job especially since the position is still posted. I guess they didn't really need to fill the position.", "Interview Questions": "Is the type of unit you want to work on?"}, {"date": "27 Oct 2020", "title": "Med Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UM St. Joseph Medical Center in Oct 2020", "Interview Descriptions": "It was easy. I was expecting more difficult questions. \r\nBut if you have experienced working as a technologist, you should be able to answer their questions. They asked me situational questions.", "Interview Questions": "Tell Me About a Time You Made a Mistake"}, {"date": "20 Sept 2020", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UM St. Joseph Medical Center (Towson, MD) in Jul 2020", "Interview Descriptions": "The process was straight forwards. I applied online and got a call from the hiring manager 2 weeks  later. I  was asked basic performance based questions. Overall the interview experience was a good one. The got an offer the next day.", "Interview Questions": "Tell me about yourself and why should I hire you?"}, {"date": "5 Jul 2023", "title": "Clinical Pharmacist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at UM St. Joseph Medical Center in Apr 2019", "Interview Descriptions": "2 part interview- 1 with managers and another with current staff. Managers (usually 2 out of the 3) will have reviewed your CV and ask questions about past experiences and current interests. Staff interview is more informal- opportunity to ask questions and get a sense of the atmosphere", "Interview Questions": "Where do you see yourself in 5 years? What are your immediate interests? Tell us about a difficult time on rotation and how did you handle it?"}, {"date": "8 Dec 2016", "title": "Billing Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UM St. Joseph Medical Center (Towson, MD)", "Interview Descriptions": "The person who set me up for my interview in HR was great. My manager, not so much. It only took about 2 months to get in-overall not too long.", "Interview Questions": "My manager literally asked me no questions. She talked about herself and what she had done for the company (almost like a reverse interview)."}, {"date": "20 Jan 2016", "title": "RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UM St. Joseph Medical Center in Nov 2015", "Interview Descriptions": "I applied for a UMMC position online and was contacted by HR to set up a phone interview for the following week.  The phone interviewer called 30 minutes later than we scheduled, but was helpful in setting up an in-person interview- not at UMMC, but St. Joseph's- a week later.  I interviewed with the nurse manager, then a group of nurses and a tech on the unit with what appeared to be a generic printed list of interview questions.  I then shadowed with a long-time nurse for several hours.  I felt the day went well, but I was never contacted about the position again despite being told that I would hear back either way.", "Interview Questions": "Tell us about a conflict you had [with a coworker or patient] and how you resolved it"}, {"date": "4 Oct 2016", "title": "Health Home Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at UM St. Joseph Medical Center (Staten Island, NY) in Oct 2015", "Interview Descriptions": "Interview process went well - was given a gist of what the company is and does.\r\nBenefits like health/dental coverage, vacation/sick time were covered as well as salary expectation.\r\nFelt comfortable with the Administrator who interviewed me", "Interview Questions": "Ability and willingness to drive since commute from home to work is quite far"}, {"date": "31 Mar 2015", "title": "Nurse Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 3 days. I interviewed at UM St. Joseph Medical Center in Mar 2015", "Interview Descriptions": "I received a call from a recruiter,  I was suppose to schedule a Skype interview and was told I'd receive a call back.  I never got the call, instead I received a rejection email 2 days letter.", "Interview Questions": "What are you interested in"}, {"date": "15 Oct 2014", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UM St. Joseph Medical Center", "Interview Descriptions": "Waited 4 weeks for responce from original application for an interview. Was interviewed by department manager and HR director that lasted 45 mins. They had checked my refferences before hand and where ready with many questions. Final interview 7 days later after backgroung and drug clearance.", "Interview Questions": "Nothing out of the ordinary."}], [{"date": "1 Apr 2013", "title": "Nuclear Medicine Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UM St. Joseph Medical Center (Towson, MD) in Mar 2013", "Interview Descriptions": "I applied for the job online and was contacted 8 days later to set up a face-to-face interview at the hospital. I went to the interview and first met with the Imaging Supervisor. He asked me the usual questions, like \"why St. Joes?\" and \"what is your biggest weakness and strength?\" The interview took about 30 minutes. He mostly discussed the culture of the Hospital with me and gave me the opportunity to ask questions. I then met with two of the technologists in the departmemt. They asked me questions more related to the field, gave me a tour, etc.. That part lasted about 45 minutes. I was then free to leave.\r\n\r\nI got a call 45 minutes after my interview and was offered the job. I took the weekend to think about it and accepted on the following Monday.\r\n\r\nTotal time from applying to accepting was about 2 and a half weeks.", "Interview Questions": "What is your biggest weakness?"}, {"date": "9 Nov 2010", "title": "Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at UM St. Joseph Medical Center (Towson, MD) in Jul 2010", "Interview Descriptions": "First interview---with hiring director and corporate associate, separately but same day with human resources representative.\r\n\r\nSecond interview-- with co-worker of vacant position and Vice President (boss of hiring director)\r\n\r\nEMail exchanges --- probably 1/2 dozen that no decision had been made\r\n\r\nVice president had been in his position for 3 weeks when I interviewed. Kept asking me questions not related (I thought) to the job that was posted. \r\n\r\nMore email exchanges with hiring director.\r\n\r\nNotice that the job now is requiring an MBA. ( I have a MA, and am working on an MS in health care with a 4.0) \r\n\r\nNo mention of new requirement during email exchanges.\r\n\r\nAfter 3 months, finally get an email from HR telling me they have hired someone else. I think the vice president was looking to bring someone he knew on board.", "Interview Questions": "Tell me about your experience with business development."}]]