[[{"date": "25 Mar 2023", "title": "Senior Graphic Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Creighton University in Jan 2023", "Interview Descriptions": "First round was a zoom call, just a chat to get to know each other and a few basic questions about experience. Made it to 2nd round where we had a sit down with a couple other members of the team to go over my portfolio and previous experience.", "Interview Questions": "Tell me about your work history."}, {"date": "14 Oct 2022", "title": "Housing Assignments Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Creighton University (Omaha, NE)", "Interview Descriptions": "The first interview was with the manager that you would report to. This was a quick 30ish minute zoom call. Salary was discussed up front. The salary was low but I was interested so I continued to the next interview in hopes of the salary being negotiable. The next interview was a panel interview that would either be on campus or via zoom. Mine was on zoom and I met with several department heads that would work with the position directly. This was over an hour.  They all had questions and welcomed questions.", "Interview Questions": "They asked about experience working with young adults (college students)"}, {"date": "14 Jun 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Creighton University", "Interview Descriptions": "Well-organized, efficient, informative. We had the chance to meet with current students, other applicants, and professors. We were fed food and given small gifts. I enjoyed the process. There was a personal interview, and a group interview. We also were able to speak to a student panel privately so to get all our pressing questions answered.", "Interview Questions": "Why do you want to go to Creighton?"}, {"date": "8 Jun 2022", "title": "Assistant Director of Academic Success and Retention Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Creighton University", "Interview Descriptions": "There were three interviews. The first interview was one on one, while the second one was a group interview with 7 Creighton Community partners. The third interview was with one of the Deans of Arts & Sciences.", "Interview Questions": "What are traits that you look for in a supervisor?"}, {"date": "2 Feb 2022", "title": "Marketing Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Creighton University", "Interview Descriptions": "Was interviewed by 2 women who were kind and engaging. Asked follow-up questions and made me feel like they were actually listening. They responded back to me within a week or so, and the process was all very smooth.", "Interview Questions": "What is your writing process from start to finish?"}, {"date": "17 Feb 2022", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Creighton University (Omaha, NE) in Feb 2022", "Interview Descriptions": "My interview was rescheduled 3 times and I was not given a choice of times. I was 'told' each time when my  interview would be set. The interview was the worst I have ever had and I left in tears. The interviewers belittled and interrogated me instead of getting to know me or describe the position. I withdrew from the job online, so I do not know if I was going to advance or not in the interview process. I would not ever accept a position with Creighton University if this is who they employ in leadership positions.", "Interview Questions": "What year did you graduate high school? *illegal\r\nWhat is the biggest difficulty/discrimination you have faced?\r\nWhy do you laugh so much?"}, {"date": "28 Dec 2021", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Creighton University (Omaha, NE)", "Interview Descriptions": "Easy-going with a lack of stress, with an emphasis on the candidate's customer service skills. Ability to tackle customer service issues is key for employment, as well as basic functions such as folding clothes and simple arithmetic", "Interview Questions": "What is a challenge you have recently faced and how did you approach it"}, {"date": "5 Jan 2023", "title": "Facilities and Maintenance Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Creighton University (Omaha, NE) in Oct 2021", "Interview Descriptions": "I applied for this position in early September and got a call to interview in mid-November. During the interview, I asked about company culture and one of the managers told me they were having issues hiring, because in his words, \"no one wants to work\". This was after pulling my application out of a two month limbo and asking me downtown for an interview. He then went on a long rant about people from the other building coming over when they do cookouts and how he doesn't like it. He didn't answer my question, but regardless, it seemed like a good fit and they told me I'd hear from them soon. I didn't and my application was listed as \"under evaluation\" in their job portal. A month later, the job was reposted. I reapplied because you never know, sometimes things fall through and it's nothing personal. They brought me in again and the interview was great. They told me they planned to have a decision by the end of the week. Bad weather hit and I didn't hear back. I reached out to HR multiple times and was continously transferred, leaving voicemails, and getting no response from hiring managers. After finally speaking with a recruiter, I find out the hiring manager is opening the position again to find the right fit. The recruiter informed me that multiple candidates were in my same position and wanted answers. I was given the option to keep my application open, but wasn't given a date to expect an offer or rejection. After spending 5 months waiting for them to make a choice, I withdrew my application.", "Interview Questions": "Tell us about how you go about prioritizing your work."}, {"date": "9 Jun 2021", "title": "Resident Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Creighton University (Omaha, NE) in Jun 2021", "Interview Descriptions": "I had three interviewers who asked questions over about 30 minutes. They were entirely friendly and unusually conscientious about the difficult job market for new PhDs.  They were happy to answer all of my questions about their students and the program, and I left thinking they would make excellent colleagues, should I get hired.", "Interview Questions": "What drew you to our program?"}, {"date": "15 Sept 2020", "title": "Ms In Pharmaceutical Sciences Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Creighton University", "Interview Descriptions": "Very smooth, easy type questions no major technical questions and good vibe overall. Interviewers were understanding and had good questions to ask so no need to worry about it", "Interview Questions": "Behavioral type mainly and some technical "}], [{"date": "21 Feb 2020", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Creighton University (Omaha, NE) in Jan 2020", "Interview Descriptions": "I was called after I applied and a phone interview was scheduled. The conversation was with the direct supervisor for the position. After that interview I was called in for an in-person interview on campus.", "Interview Questions": "Why do you want to work at Creighton? "}, {"date": "22 Aug 2019", "title": "Patient Care Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Creighton University (Omaha, NE) in Aug 2019", "Interview Descriptions": "Informal, relaxed and varied questions about past experience.  The person I met with was honest in stating her department is changing a lot and she's not sure when she will bring on another person at this point.  This gave me the ability to decide if I wanted to access the volume of work that would be coming.", "Interview Questions": "Standard strength and weakness question.  What do you think your personality type is."}, {"date": "19 Sept 2019", "title": "Resident Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Creighton University (Omaha, NE) in Oct 2017", "Interview Descriptions": "selected from a group of applicants and interviewed by the program director and core faculty, after which went through the \"match\" process to be selected for internal medicine training. At the end of match, bothe candidates and program directors submit a list in order of preference and on match day candidates and employers find out who was hired where.", "Interview Questions": "why Creighton?\r\nfuture goals?\r\ninteresting medical experiences"}, {"date": "23 Apr 2019", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Creighton University in Apr 2017", "Interview Descriptions": "First round was a phone interview with entire time, second round was an in-person interview with entire team (7 people), plus presentation. Interviews lasted an hour or so. No 1:1s throughout the entire process.", "Interview Questions": "What, in your opinion, is the benefits of a liberal arts education?"}, {"date": "21 Jul 2017", "title": "Strategist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Creighton University (Omaha, NE) in Feb 2017", "Interview Descriptions": "I was phone screened, had to present work samples, then did two panel interviews via Skype. It was pretty standard and nothing really threw me for a loop. Good mix of people involved, which was helpful.", "Interview Questions": "I was asked who my professors were when I was a student."}, {"date": "5 Nov 2016", "title": "Technical Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Creighton University (Omaha, NE) in Oct 2016", "Interview Descriptions": "Interviewed with 11 people total over a 4-hour period.  Had another interview with previous Tech Specialist and another with Assistant Vice  Provost.  Received a nice tour of the campus.", "Interview Questions": "Why do you want this job?"}, {"date": "9 Oct 2016", "title": "Housing Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Creighton University (Omaha, NE) in May 2016", "Interview Descriptions": "Phone Interview. And then the second step was an itinerary of multiple interviews that would be conducted on the same day. The initial phone screen was a panel interview with 3-4 people.", "Interview Questions": "How would you motivate student staff?"}, {"date": "14 Apr 2016", "title": "Facilities Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Creighton University (Omaha, NE)", "Interview Descriptions": "The process included sit downs with the hiring manager and a few key individuals in the department. I felt the conversations went very well, and got the feeling I was closely in the running. To my surprise, I never heard back, not even a courtesy call or email. If you interview with this area, don't expect to hear back unless you're offered the job. After following up several times, I gave up and assumed I wasn't selected. I felt it was disrespectful to me as a potential employee and candidate to ignore my communication attempts. It really turned me off to Creighton in general.", "Interview Questions": "What motivates you?"}, {"date": "22 Jan 2020", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Creighton University (Omaha, NE) in Apr 2016", "Interview Descriptions": "Was brought in for a day-long interview with department faculty and current graduate students. During the morning, I met various faculty in one-on-one meetings. I ate lunch with the current graduate students of the department, at which time I got a tour of the departmental facilities and campus. Then I met with more faculty in one-on-one meetings during the afternoon, rounding out the day.", "Interview Questions": "Not really a question, but the asked to to describe my undergraduate research. Most likely used as a metric to gauge my ability to discuss science and present data."}, {"date": "5 Jun 2015", "title": "Administration Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Creighton University", "Interview Descriptions": "1) Phone screening by HR\r\n2) Interview with Director (PhD)\r\n3) Second interview with staff panel and PhD\r\n\r\nSounds like director runs the office with an iron fist and the four people working for her are scared to mess anything up.  \r\n\r\nWas glad I got denied an offer; would not have lasted long at that job.", "Interview Questions": "Strange questions about organizing work and how to use folders was discussed.  Sounds like they had an issue with organization with a previous employee. "}], [{"date": "30 May 2015", "title": "Several Different Positions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Creighton University", "Interview Descriptions": "At least 2 interviews.   One with HR and then the hiring dept. Very friendly interview with ease. All interviews I've had there have been very typical. Once offered positron,  background check and salary negotiations.", "Interview Questions": "go through resume"}, {"date": "10 Sept 2014", "title": "Facilities Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Creighton University", "Interview Descriptions": "I called HR to see if there were any opportunities with their grounds crew. I was directed to their website where I filled out a formal application to be left on file, which does not often get re-reviewed so it is a plus to apply for every position you find interesting. Waited two days, heard back and then started work.", "Interview Questions": "I am I ok with wearing jeans all summer?"}, {"date": "24 Feb 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Creighton University", "Interview Descriptions": "You will usually be interviewed by the Department Chairman, his Administrator and maybe faculty depending on who you are working with.", "Interview Questions": "Why should we hire you. "}, {"date": "23 Jul 2013", "title": "Research Associate I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Creighton University (Omaha, NE)", "Interview Descriptions": "At the time, I contacted the professor directly. Now they prefer that you go to Human Resources first. I interviewed with the professor, and was hired in one day.", "Interview Questions": "The professor wanted to know what techniques I knew, especially in molecular biology. "}, {"date": "15 Sept 2012", "title": "Resident Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Creighton University (Omaha, NE)", "Interview Descriptions": "After submitting an online application with a resume a cover letter, two phone interviews and an on-campus interview were completed.", "Interview Questions": "N/A"}, {"date": "26 Nov 2013", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Creighton University (Omaha, NE) in Aug 2010", "Interview Descriptions": "Meet with the dean after department chair  meeting.", "Interview Questions": "What will you bring / contribute tot the department"}, {"date": "8 Oct 2012", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Creighton University (Omaha, NE) in Mar 2010", "Interview Descriptions": "They don't really have much of an interview for GRAs. It's based on your resume, GMAT score, GPA, and references. If you're a quality student with above average scores, you've got a good possibility of getting a position.\r\nYou come in and talk to the Associate Dean of the College of business, as well as other staff members. They just ask why you want the position and your future goals. Nothing hard at all. I think it's more to just get a feel for if you measure up to yourself on paper.", "Interview Questions": "N/A"}, {"date": "17 Jun 2012", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Creighton University (Omaha, NE) in Sept 2009", "Interview Descriptions": "I applied online. Then got a response in form of email. Then representative called me ask about my experience and skills and then I got accepted. One more thing, for graduate school at Creighton, you need to pass the GRE and TOEFL.", "Interview Questions": "What is your Qualification?"}, {"date": "9 Jun 2009", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Creighton University (Omaha, NE) in Nov 2007", "Interview Descriptions": "Upon seeing the position advertised I called to inquire about the nature of the work and was encouraged to apply.  I submitted an online interview form and was contacted by the Director of the area I would be working in. After a phone conversation it was arranged that I meet with him and others in the office I would be working with.  This was a fairly informal interview as I had worked with most all of the people involved and so some of my skills and abilities were already known.  They were very forthcoming about the expectations of the job and the Director made sure that I would receive a raise in order to move to this position.  I also interviewed separately with the Director and with the Assistant Vice-President of the Division I would be working in.  Again, a lot of this was to find out a little more detail on what experience I did have, but equally it was about my input into the position and my expectations as well.", "Interview Questions": "What were my expectations for the job? "}]]