[[{"date": "1 Mar 2023", "title": "New Grad RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Providence Health Care", "Interview Descriptions": "It was overall very straightforward and the questions were all behavioral-based. They make you feel comfortable throughout the interview and the interviewer was very kind. Asked about 8-10 questions and took around 30 minutes overall.", "Interview Questions": "What is a short term and long term goal that you have?"}, {"date": "6 Mar 2023", "title": "Front Desk Receptionist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Providence Health Care in Jan 2023", "Interview Descriptions": "It was a pretty simple interviewing process to say the least. Interviewer was friendly and personable. I enjoyed the process but decided to go another way. Although it was good", "Interview Questions": "What is your 5 year plan"}, {"date": "19 Dec 2022", "title": "Insurance Follow Up Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Providence Health Care (Seattle, WA) in Dec 2022", "Interview Descriptions": "I filled out the online form and then received a text message asking me more questions about my experience. Shortly after, I was sent a follow-up email and was able to schedule an interview. The interview was 30 minutes long and I was first asked to tell them about myself and my experience. As I was doing that, it seems I didn't have the insurance appeal follow-up experience they were looking for and they wrote me off. They also made the assumption that I didn't have enough work and kept saying over and over how there's a lot of work there and that there's never any downtime. I mentioned that I get what my supervisor calls \"busy work\" and they assumed it meant I wasn't busy enough, which I am, but I NEVER got the chance to elaborate nor did they ask. The thing is that I work quickly and efficiently and still end up needing more work. There were about 9 minutes left of the interview and one of the interviewers wanted to put that out there. They didn't ask me any behavioral questions or anything. I honestly wish these people would just be upfront and honest during the interview and tell me, sorry you don't have the experience we're looking for. I fit all the qualifications within the job description, so it's possible they need to re-vamp the description. I happened to go online on the profile portal to try to cancel another interview I had scheduled because I was scheduled for two beings I applied for 2 positions and that's when I saw that the positions said they are no longer considering me. This wasn't even an hour after my interview. I didn't receive a rejection email or anything.", "Interview Questions": "Tell me about yourself and your experience."}, {"date": "10 Nov 2022", "title": "Patient Driver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Providence Health Care", "Interview Descriptions": "2. one in person, one telephone. They were well prepared and were able to convey the nature of the position with ease. Very kind people. Made me feel welcome. Masks are required for this position.", "Interview Questions": "Driving experience was an essential skill they wanted to hear about."}, {"date": "25 Aug 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Providence Health Care", "Interview Descriptions": "Terrible. Unorganized, don’t seem to know what is going on no matter who you speak with or the question being asked. Make you wait past your interview time with no regard to your own time being spent.", "Interview Questions": "What did you do in a escalated situation"}, {"date": "16 Dec 2021", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Providence Health Care", "Interview Descriptions": "The interview  consisted of responding to questions within a time limit while video recording one's self. It was impersonal, allowed for no dynamic discussion, and instructions about how many attempts an interviewee would be allowed per question were incomplete. An overall distasteful experience that left a negative impression of the organization.", "Interview Questions": "N/A"}, {"date": "16 Dec 2022", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Providence Health Care in Nov 2021", "Interview Descriptions": "The interview was surprisingly pleasant. Felt very comfortable. It was a panel style with 4 interviewers from different specialties. My interview was on zoom. I heard back 2 weeks later", "Interview Questions": "Scenario question was scary but actually straight forward and doable. Nothing a new grad wouldn’t know"}, {"date": "7 Dec 2021", "title": "New Grad Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Providence Health Care (Los Angeles, CA) in Oct 2021", "Interview Descriptions": "20-30 minutes, 1 case study, it is a really quick interview and they want to know why the company, and other personality factors. There were three people interviewing and asking questions. The interview was online.", "Interview Questions": "Why did I apply to that hospital"}, {"date": "20 Feb 2021", "title": "Marketing Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Providence Health Care", "Interview Descriptions": "They discussed the crucifixes on the walls and asked how I felt about it. It made me feel uncomfortable. There was a phone screen and then a large, panel interview where I was at the head of the table.", "Interview Questions": "We have crucifixes on our walls and we hold moments of silence or prayer every day. How do you feel about this? (This was the first question)"}, {"date": "6 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Providence Health Care (Portland, OR) in Aug 2020", "Interview Descriptions": "Zoom internet interview in COVID precautions, very friendly interviewed by Nursing Unit Manager. Casual, no clinical questions. A lot of questions about handling conflict with co-workers including specific examples of past situations.", "Interview Questions": "Give an example of how you handled working with a difficult coworker in the past?\nGive and example of how you handled working with a difficult situation with a coworker in a leadership role in the past?"}], [{"date": "11 Aug 2022", "title": "Warehouse Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Providence Health Care (Los Angeles, CA) in Feb 2020", "Interview Descriptions": "The interview process is initially automated and impersonal. Make sure your resume includes all key words an algorithm will need to see in order to pick your application out of the digital stack. The first interview is a video-recorded response to canned questions - no interaction with a human. It's difficult to ascertain wether an algorithm scans these videos for key words or if a real human watches through them. Prepare by reading through the job posting, some Glassdoor reports on the actual content of the job, and the division's page on the site - if you're professional, prepared, and succinct, you should pass on to the next phase where you'll get some real human interaction. As with all interviews, YMMV at this point as the subjectivity of people enters the picture.", "Interview Questions": "Are you willing to relocate?"}, {"date": "6 Jun 2023", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Providence Health Care (Rock Hill, SC) in Oct 2019", "Interview Descriptions": "Very relaxed and professional. Interviewers were friendly and approachable. They gave opportunities to ask questions. They were very interested and engaged with what I had to say. The princess was approximately 30-45 min. They offered me something to drink and I felt the energy of the environment.", "Interview Questions": "Why do you want to work for hospice"}, {"date": "9 Apr 2014", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Providence Health Care", "Interview Descriptions": "one interview, relaxed environment", "Interview Questions": "What is Your weakness"}]]