[[{"date": "24 Nov 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Sue Ryder (Gloucester, England)", "Interview Descriptions": "Everyone was very friendly and welcoming. It felt more like a chat rather than an interview. They like to get to know you as a person and ask why you would like to volunteer.", "Interview Questions": "N/A"}, {"date": "28 Mar 2023", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sue Ryder (Dewsbury, England) in Nov 2022", "Interview Descriptions": "They called me to ask few questions. And then ask me to visit the store and have spent 2 hours to work there. They asked me if I was familiar to use computer. Then the store manager had demo and I started to work on it", "Interview Questions": "Why you want to apply this job"}, {"date": "11 Oct 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Sue Ryder (London, England)", "Interview Descriptions": "Fantastic recruitment team. Speedy and friendly. Passionate from the back office to my visit. Leadership team very transparent of job role and charity, which I appreciated. Interview was booked quickly with relevant leaders from nursing and HR, so felt fair and equitable. Interview was very values based, I felt the team wanted to genuinely understand my values, skills and experience, rather than text book answers.", "Interview Questions": "Describe Clinical Leadership?"}, {"date": "15 May 2022", "title": "Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sue Ryder", "Interview Descriptions": "No preparation. Super chill. Was asked about hobbies and any previous experience (even though it’s not required). Training was given for few weeks then brought onto the main shop floor.", "Interview Questions": "Have you done any charity work before "}, {"date": "6 Apr 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Sue Ryder", "Interview Descriptions": "I was asked questions about why I want to volunteer and questions about the different skills I can bring to the team. The interviewer was  very nice and explained the roles and how the whole shop  works.", "Interview Questions": "Why do   you want to volunteer at Sue Ryder"}, {"date": "23 Mar 2022", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Sue Ryder", "Interview Descriptions": "Rushed through answers - didn't get to answer properly or fully, not inclusive, reasonable adjustments not implement, interviewers seem poorly prepared, not given time to ask the questions I wanted.", "Interview Questions": "Why want to work there"}, {"date": "14 Sept 2021", "title": "Volunteering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Sue Ryder", "Interview Descriptions": "Quick and easy process. Questions about work schedule.\nVery friendly and open to help. The whole interview lasted around 20 minutes. Very pleasant and rewarding experience. I accepted the position with this company.", "Interview Questions": "Questions about my previous volunteering experience."}, {"date": "27 Mar 2022", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Sue Ryder (Bournemouth, England) in May 2021", "Interview Descriptions": "I was asked about my retail experience and what I did at asda how long I had been in the job and what I did I explained what I had done and told them about myself", "Interview Questions": "Experience in job and about myself"}, {"date": "18 Jan 2021", "title": "Volunteer Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sue Ryder", "Interview Descriptions": "I found the volunteering opportunity online and was told to phone the store that I wanted to volunterer at. After I was told to go into the store for a discussion to see what past training i have done and what times i am available.", "Interview Questions": "whether I had any previous experience so that they can see what training i have done in the past"}, {"date": "8 Feb 2020", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Sue Ryder (Rickmansworth, England)", "Interview Descriptions": "I sat with the area manager in a stock room, answering questions about my experiences of being a volunteer and bank staff and what made me good for the job", "Interview Questions": "Why did i think i was good for the job"}], [{"date": "29 Oct 2019", "title": "Domestic Support Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sue Ryder (Reading, England) in Oct 2019", "Interview Descriptions": "I was interviewed by three people; the head of services, the manager of services and the domestic supervisor.  The head of services was a nice and friendly individual who made me feel at ease during the interview however the other two members of staff interviewing me were not so nice.  I was asked a set of 8 competency based questions and it was points scored.", "Interview Questions": "What do you know about Sue Ryder?"}, {"date": "5 Feb 2020", "title": "Community Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sue Ryder (Peterborough, England) in Aug 2019", "Interview Descriptions": "applied online, waited two weeks then had phone call interview with hiring manager then received an email to say i was successful and been invited to second stage interview with director and senior manager.", "Interview Questions": "competency based questions "}, {"date": "15 Feb 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sue Ryder", "Interview Descriptions": "very brief but staff were very friendly and made me feel at ease there was one lady asking me questions and  this was done in an informal friendly manner didn't feel like an interview", "Interview Questions": "was asked about my availability and also any past experience that I may have but I didn't have any and this wasn't a problem also was asked "}, {"date": "7 Jun 2023", "title": "PR Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sue Ryder (London, England) in Jan 2019", "Interview Descriptions": "Very straight-forward, spoke to one contact in HR, good interview, clear and friendly. So far everything has gone smoothly. I had to do a presentation and then usual interview questions.", "Interview Questions": "Talk about campaign experience, line management and reputation managment."}, {"date": "2 Sept 2020", "title": "Retail Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Sue Ryder in Sept 2018", "Interview Descriptions": "It was really easy and quick. They only asked me a couple of questions  about my availability and why I wanted to work for the company. They were friendly and the interview was very relaxed/chill.", "Interview Questions": "What is your avaliability?\r\nWhy do you want to work for us?"}, {"date": "22 Jul 2018", "title": "Shop Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Sue Ryder (London, England) in Jul 2018", "Interview Descriptions": "The interview was on different steps of process, where in each moment I feel comfortable and the people of Sue Ryder in each moment was very nice on the process. I feel some times I could no understand what they were asking but they have a lot o patience with me and help me to understand and feel  security of myself in each moment. I have my interview with the recruitment manager, area manager and other manager, all of then very polite and professional.", "Interview Questions": "They ask you like in all job interviews about yourself,  and they want you explain experience refereed to the position of the job with exact examples on the last job.  They ask about hypothetical situation and how you solved it."}, {"date": "6 Jul 2018", "title": "Assistant Shop Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sue Ryder (Waterlooville, England) in Jun 2018", "Interview Descriptions": "Formal interview asking questions about situations and how I would respond to them, and examples were requested.\r\nScenarios were also give and was expected to respond in a reasonable and fashionable way.\r\nWas expected to show them that I was a suitable candidate for the role with the experience and knowledge that I had.", "Interview Questions": "If you had an angry customer come into the shop what would you do or say?"}, {"date": "1 Jun 2018", "title": "Office Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sue Ryder (Portsmouth, Isle of Wight, South East England, England) in May 2018", "Interview Descriptions": "The interview went very well and the people were lovely. It was like chatting to new friends. I was made to feel very welcome and left there feeling good about myself.", "Interview Questions": "Tell me about yourself."}, {"date": "25 May 2018", "title": "Database Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Sue Ryder (London, England) in May 2018", "Interview Descriptions": "Very smooth process. I've been invited to the 1st interview within a few days from the closing date for the post, was interviewed the following week. My 2nd interview was a week later. The offer arrived 2 days after the last interview.", "Interview Questions": "Tell me how your previous roles meet the criteria of this role;\r\nData Protection\r\nData quality checks"}, {"date": "21 Mar 2018", "title": "Fundraising Operations Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Sue Ryder (London, England) in Mar 2018", "Interview Descriptions": "I was interviewed by two members of the Fundraising Opps team, from the beginning they made sure that I was comfortable and that the process was as informal as possible. They were very supportive and positive and it made the whole experience very enjoyable!", "Interview Questions": "What are some of your weaknesses?"}], [{"date": "1 Apr 2018", "title": "Counsellor At Thorpe Hall, Peterborough Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Sue Ryder (Peterborough, England) in Mar 2018", "Interview Descriptions": "I was made very welcome and felt at ease.  I was interviewed by two very professional female colleagues (to be) who spent time asking me questions and were very interested in my answers.  The whole process was very pleasant, energising and with an excellent outcome.", "Interview Questions": "What do I have in place to ensure that I maintain a good work /life balance?"}, {"date": "26 Feb 2019", "title": "Shop Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sue Ryder in Feb 2018", "Interview Descriptions": "Not so hard, based on situational questions. And what would you in certain situation, what would you do to improve your customer service skills? What is your experience related to sales, retail, customer service and shop management?", "Interview Questions": "What do you do to go extra miles in customer service?"}, {"date": "2 Sept 2019", "title": "RRIC Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 8 weeks. I interviewed at Sue Ryder (London, England) in Feb 2018", "Interview Descriptions": "Competency based, so as long as you tick the boxes that’s all that counts. Don’t give them more, they are not interested. Presentation about the job, role play an interview situation and a formal question interview.", "Interview Questions": "Do a presentation about the RRIC role. "}, {"date": "6 Dec 2017", "title": "Retail Sales Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sue Ryder (Northallerton, England) in Apr 2017", "Interview Descriptions": "The Interview process made me feel alot more relaxed than i was feeling as i was quite nervous. I felt i knew alot of the information needed as i had already volunteered for the charity for 14 months prior to applying for the job.", "Interview Questions": "Do you know about Sue Ryder As a charity "}, {"date": "23 Feb 2018", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sue Ryder (Ruislip, England) in Feb 2017", "Interview Descriptions": "Really thorough, detailed questions and friendly interviewers. Felt very happy with the experience as I was given clear details of what the job would entail and what would be expected of myself.", "Interview Questions": "What experience can you bring to this job role? "}, {"date": "26 May 2016", "title": "Volunteer Support Administrator At Royal Brit Leg Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Sue Ryder (London, England)", "Interview Descriptions": "Interview NOT at SR, but AT Royal Brit Leg. Send in a CV and supporting statement. Questions were all competency based. NO questions on why I wanted to the join the RBL, nor interests and hobbies. There was a test beforehand which seemed were reasonable. Very little opportunity for an interviewee to show that they have read the Financial Statement beforehand.", "Interview Questions": "How would you handle a difficult situation with a member of staff?"}, {"date": "10 Nov 2016", "title": "Area Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Sue Ryder (London, England) in Jan 2016", "Interview Descriptions": "very unorganized, kept waiting on 1st interview, questions were scripted and set in stone and interviewers wouldn't deviate from their script. Vague answers to job responsibilities and felt even they didn't want to be in their role - slightly unprofessional -2nd interview was rushed with lots of activities to get through, some times were cut short and tasks seemed unrelated to role advertised.", "Interview Questions": "why do you want this job"}, {"date": "21 Aug 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Sue Ryder (Morecambe, England) in Jul 2015", "Interview Descriptions": "Went for a wee hour interview and taster session. Stayed for 7hrs. I committed to 3 or 4 half days depending on the week. I was asked which of these I could do but said all. But I had the option to change this and to sort of drop-off and help when I liked.", "Interview Questions": "Had I done any job similar previously. "}, {"date": "6 Dec 2015", "title": "Retail Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Sue Ryder (Preston, North West England, England) in Jun 2014", "Interview Descriptions": "Sat in the store on one of the couches that were for sale, for a really informal 'interview' it was more of a discussion into why i wanted to volunteer and what i was doing at the moment. The manager was lovely and every friendly, she went through things that would be involved in the job such as duties, i was asked when i was available, and asked about any convictions etc, i filled out a form there and then and agreed to a date and time when i would start.", "Interview Questions": "What do you know about Sue Ryder and why do you want to volunteer?"}, {"date": "5 Mar 2014", "title": "Area Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Sue Ryder (Torquay, England) in Jan 2014", "Interview Descriptions": "Applied through an agency.\r\nHad formal interview above a store with regional manager and an area manager.\r\nGeneral questions but not given time to give answers very rushed.\r\nNot made to feel comfortable straight into questioning.\r\nExtremely in personal very frosty regional manager.\r\nGot through to second stage assessment centre.\r\nDown to 3 canidates made to feel they had already made their minds up.\r\nUnfair negative attitude from regional manager.\r\nHappy I didn't get the job!!!", "Interview Questions": "None, Assessment centre tasks were team based (although who shouted loudest seemed to have got the job) written task about analysing figures and reports, role play task with area manager about a manager who wasn't rotating her stock and merchandising regularly.\r\n"}]]