[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Supportive Management", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Jul 2021", "job_title": "Administrative in Marlborough, MA", "duration": "N/A", "pros": "Supportive Administration Team! Energetic CEO, CNO and Risk Management!", "cons": "Low Pay RNS, need improvement in training."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Can be good, needs a lot a lot of work", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Dec 2022", "job_title": "Intake Department in Westborough, MA", "duration": "N/A", "pros": "Co-workers in both nursing and intake who support each other and make the place work. Some excellent Department Directors. Good teamwork between units and other departments.", "cons": "Lacking Communication on all levels and can be somewhat disorganized when wanting a direct answer for department policies, needs better structure in all departments, policies change everyday, nursing culture on the units (not all nurses). Accountability to nurses instead of unlicensed floor staff when issues arise, Honestly really could use a complete structural change and strong concrete policies and procedures to get this hospital where it should be. No acknowledgment for those who go above and beyond, loyalty and have experience with the quality of care for mental health patients. Constantly keeping employees, by either moving them to other unfit departments, other job roles, or multiple re-orientations, when really they should not be working in this field, but great employees get trashed. Also unqualified new employees trumping the more experienced for higher job roles…disgusting."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Constant Management Changes", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 May 2023", "job_title": "MHT in Westborough, MA", "duration": "N/A", "pros": "The Nursing staff are great", "cons": "Too many changes happening in very short intervals"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great coworkers", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 May 2022", "job_title": "Occupational Therapist in Westborough, MA", "duration": "N/A", "pros": "Excellent co workers, great energy, beautiful building, good pay, opportunities for growth, tuition reimbursement", "cons": "Very frequent employee turn over, disconnect between administration and floor staff"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Quality Outpatient Department with Supportive Team Environment", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Apr 2021", "job_title": "Outpatient Clinician in Westborough, MA", "duration": "N/A", "pros": "As a clinician on the OUTPATIENT team, I worked with some of the most talented, compassionate, and knowledgeable people I've ever known, many of whom have become close friends and trusted peers in the field. The now-director of the program works tirelessly to make sure that quality care and safety is provided to patients and that her staff feel supported. It was often an incredibly fast-paced work environment, which meant I learned a lot during the time I was there. If you're considering applying to Westborough Behavioral, I would strongly recommend the outpatient department over the rest of the hospital. Being its own program, it's more insulated from the rest of the dynamics in the hospital. Compensation and benefits were a bit higher than many other organizations I've looked into.", "cons": "I truthfully don't have constructive or favorable things to say about the company and experience overall, but instead of focusing on the negatives I encountered, I'm choosing to focus on highlighting the positives of the outpatient program specifically."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Place is declining, bad administration", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Dec 2021", "job_title": "MHT in Westborough, MA", "duration": "N/A", "pros": "Flexible schedule but keep looking elsewhere", "cons": "CEO is not helping, directors in each department lack experience/knowledge to help hospital grow. A lot of backstabbing from administrators. Not team work. Administration is condescending"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A horror show and completely unsafe for patients and staff", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Dec 2020", "job_title": "Registered Nurse in Westborough, MA", "duration": "N/A", "pros": "Co workers care about each other", "cons": "Exec management makes promises they don’t keep and lie constantly. On their 6th ceo who talks the talk but doesn’t walk the walk. Employee engagement is non existent as is employed morale. Drove the last HR lady out then bad mouthed her. She was trying to build trust with the employees but they drove her into the ground and out the door.  I think the only thing that can help us now is a union coming in so that someone stands up for the employees. Don’t waste your time applying even if you are desperate. They use you up and throw you away."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Improvement", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Mar 2021", "job_title": "Director in Westborough, MA", "duration": "N/A", "pros": "-Past concerns are now being addressed. \r\n-Staff are completely trained and the units milieu has become positive. \r\n-A positive culture has began to formulate and change is taking place. \r\n-The new CEO has an open door policy and is listening to Staff.", "cons": "-Communication is getting better but still needs to be developed"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Challenging but wondeful", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Mar 2021", "job_title": "Administrative in Westborough, MA", "duration": "N/A", "pros": "Nice place, brand new, clean, good atmosphere, good pay", "cons": "Challenging to work for but a good learning experience"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great team in outpatients", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Feb 2021", "job_title": "Intensive Outpatient Facilitator and Therapist in Westborough, MA", "duration": "N/A", "pros": "Supportive, understanding, pay, helpful manger (door is actual open and very encouraged.", "cons": "Occasion not able to take 30 minute break"}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Terrible management", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "31 Jan 2021", "job_title": "Mental Health Technician in Westborough, MA", "duration": "N/A", "pros": "Pay is good, even for a beginner", "cons": "They offered bonuses for you to complete a double shift and rarely put the bonus on your paycheck. Always low staffed. Very dangerous."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Mental Health Technician", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Nov 2018", "job_title": "Mental Health Technician in Westborough, MA", "duration": "N/A", "pros": "Flexible scheduling; can work doubles and lots of hours and get overtime. Nice facility. Decent pay. Easy interview. A lot of the staff are really good, loving, nice people but it's really difficult to work there and they don't have many rights.", "cons": "I really don't feel safe here as an MHT. And communication suffers a lot. Also, the doctors and nurses make mistakes on patient medications very frequently. The patients are sometimes denied basic rights such as water because everyone is too busy to fill up water pitchers. Also snacks are locked away and patients have to ask for snacks. A lot of the staff is undertrained, overworked, and I've been placed in many unsafe scenarios. A lot of the security guards are pretty creepy as well and say not so nice things about the patients. I would be appalled if anyone I knew was sent here as a patient. The entire place is a huge mess of chaos. Nothing gets done according to schedule."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Toxic work environment, exhausting work load, excessive stress", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Apr 2020", "job_title": "Social Worker in Westborough, MA", "duration": "N/A", "pros": "Working at WBHH and receiving a paycheck from them is preferable to not having  money for rent and food.\n I suggest you accept a job here as a last resort.", "cons": "No opportunity for career advancement.\n\nSupervision IS NOT PROVIDED. Those that need supervisory hours for licensure advancement WILL NOT receive them at this facility. \n\nStrict deadlines, overtime required by strongly advised against. You will get pushback when requesting to work overtime, and hostile responses such as \"what have you been doing all day\" when requesting extra time to catch up on work after a particularly busy day, or after needing to take time off sick.\n\nUnclear expectations of weekend work hours.\n\n\nSeemingly incompetent and otherwise unavailable department heads, ie difficult to get help when needed during crises.\n\nSubject to unprofessional dialogue, intimidating postures and tones from supervisors, and disrepscrful treatment of staff by department heads.\n\nAll around hostile work environment."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Do NOT Apply", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Jun 2020", "job_title": "Therapist in Westborough, MA", "duration": "N/A", "pros": "Only apply if it is your last resort! Avoid working here!", "cons": "Please do not apply to this hospital. You can anticipate working many more hours than intended and the expectations are very demanding...almost physically impossible. Units are way understaffed making it an unsafe environment for staff and patients. Staff turn over is huge and extremely poor organized. Staff members are consistently being assaulted physically and verbally due to lack of infrastructure."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "BEWARE! LISTEN TO THE REVIEWS! DON’T WASTE YOUR TIME APPLYING", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Dec 2018", "job_title": "Registered Nurse in Westborough, MA", "duration": "N/A", "pros": "I would say nothing is worth all the aggravation and unsafe practices.", "cons": "I was so happy when I got the call to be hired but I knew once I went to orentation only have 2 weeks of orentation for nurses and 1 week for MHTs was going to be a disaster. I understood this was a startup company, but they have been opened for over a year and they STILL have the same issues. \r\n\r\nFor instance, SAFETY. They understaff so badly that people have gotten hurt and they don’t care. They follow a “grid” and that “grid” is terribly dangerous to you the worker and the other patients. There were times when MHTs would be by themselves with a violent patient and got hit and since it was in an area where there happened to be no cameras the patient was always correct and the staff would be told to “get a lawyer”... Seriously! Its terrible. \r\n\r\nMANAGEMENT: You NEVER saw them on the floor and if you did they would either be yelling at you or going against policy and letting the patients do whatever. It was terrible, no one is on the same page there.\r\n\r\nCOMMUNICATION: TERRBILE! There isn’t one!!! They say they care in orentation but I was there for a couple of months and it was the same issues, and they would focus on the tinyest things instead of the bigger issues.\r\n\r\nSTAFFING: So many people call out ALL THE TIME! Leaving you with NO STAFF! So now its severely understaffed and dangerous! WHen you needed a manager NO ONE WOULD COME! They used supervisors BUT sometimes even they weren’t there! \r\n\r\nSTRUCTURE: There wasnt any. On the weekends it was a free for all for the patients. No therapists, doctors, social workers come in on weekends so nurses and MHT’s were left to do groups and the rest of the day free. It was terrible, then since they were ALWAYS short staffed patients couldn’t go down to the gym or whatnot because it wasn’t safe! \r\n\r\nSECURITY: There is NO security durning the day. Only 3-11 & 11-7a. BUT, they make them as MHT’s and sit on 1:1 so if something is happening they cant do anything. So unsafe! They figure durning the day they have enough “upper managerment” who are USELESS and just STARE and watch! None of them would restrain a patient in high heels and suits!\r\n\r\nBUILDING: Its falling apart! Housekeeping is a joke! There only there during the week, 7-3 and its 1 or 2 people! The place is gross and filthy! They hardly clean the adolescent unit because there so scared to be over there and when asked they say there too busy because they have the whole place to clean. So what does that come down to MONEY!\r\n\r\nMONEY: This place is ALL ABOUT MAKING MONEY! They do NOT care about the patients. These patients are so acute and you need proper staff to help them and its not far for 1 person to set the whole milieu off because you cant have any “extra” person to help de-escalate. \r\n\r\nCODES: Tons of restraint codes. Espically on Adolescent Unit. They understaff this unit a lot, so you can’t properly keep them entertained. That’s also where structure comes in, not enough structure to keep them busy.\r\n\r\nENVIRONMENT: HOSTILE! As soon as I stepped onto the floor, nurses, MHT’s, therapists, were so upset and angry! Angry because of all these issues that have been brought to management and done nothing about it. I have seen MHT’s and nurses walk out because they are in fear or their license and TRUST ME this place could careless about your license or safety! \r\n\r\nPAY: Yes they do pay good BUT is it really worth all the hassle, unsafe practices, and losing your licenses for a company would could care less about you and the patients in the end. People call out ALL the time and now your stuck doing checks all night even though you shouldn’t be but what are they going to do?!\r\n\r\nINTAKE: They DO NOT screen patients! Meaning that these can be ex felons, sex offenders, rap sheets a mile long and the staff is not properly trained to handle that nor the staffing ratio is so bad it’s very unsafe.\r\n\r\nOverall: people are tired there, the staff that are good and come in are overworked and tired and end up leaving because of the practices. There is a HIGH turnover rate. You will find very few nurses and MHT’s that were there when the place opened after that the place is running on new people. They are hiring and doing orentation every 2 weeks and some people leave right away because they see and hear what is going on. Its sad. The idea of helping patients is there BUT it all boils down to TERRIBLE management and making money! \r\n\r\nMy advice, dont waste your time."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Awesome staff, terrible management", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Nov 2018", "job_title": "Mental Health Technician in Westborough, MA", "duration": "N/A", "pros": "The MHTs, RNs, clinicians, and medical staff are all amazing and hardworking. They truly care about the patients and are very dedicated.", "cons": "The management is terrible (minus Sheila). Communication is poor. They focus on making completely useless and unnecessary changes while ignoring the major issues. After being with WBHH for some time now, I was hoping it would get better because I think this place has a lot of potential, however this has not been the case. They are understaffed yet send people home to fit an arbitrary grid system that leaves MHTs alone on units at times dealing with 12+ patients. I have been scared for my life and the lives of patients and my coworkers too many times to count due to management’s inability to schedule and staff units. All they care about is opening new units to fill beds and make more money, even though they don’t have enough staff to function with the already present units. Employee turnover is as high as I’ve ever seen it at a company due to these issues. About half of the orientation groups quit their first day on the units, and the ones who stay quit one or two weeks later. Since I started working here, I would say 50% of the staff I originally started with have left."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Innovative hospital where patient and employee safety come first!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Apr 2020", "job_title": "Intake Counselor in Westborough, MA", "duration": "N/A", "pros": "Competitive salary and friendly work environment.", "cons": "More units need to open"}]]