[[{"date": "16 Nov 2021", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at USC Arcadia Hospital", "Interview Descriptions": "Very smooth. Interviewed during Open House. Met with the unit nurse manager. The interview lasted about 25 minutes and was offered a job. Had to pass a personality test which took about 40 minutes. Background check. Physical/drug test.", "Interview Questions": "Tell me about your clinical experience."}, {"date": "20 May 2021", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at USC Arcadia Hospital", "Interview Descriptions": "Interview went great. Although it was via zoom, it definitely felt like I was there in person.  The process was quick and the questions I was being asked were very resourceful", "Interview Questions": "How would you handle a situation where a co worker was being smirky towards other staff?"}, {"date": "30 Apr 2021", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at USC Arcadia Hospital (Los Angeles, CA) in Apr 2021", "Interview Descriptions": "Completed a online assessment was emailed days later to schedule an interview. The interview was via zoom where they asked about job history etc. To get the job you must do a background check, drug screening, orientation, etc", "Interview Questions": "Tell us about your previous job history? "}, {"date": "28 Aug 2020", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at USC Arcadia Hospital (Arcadia, CA) in Aug 2020", "Interview Descriptions": "After I submitted my application for their new grad position, two days later a recruiter reached out to me to submit an assessment that was roughly 40 minutes long. This assessment had 5 sections and each section was timed. Good luck to anyone who has to do this cause it is difficult and does not relate to any aspects of nursing lol (except section 1).\n\nSection 1: was a rating of how relevant a characteristic/adjective was to you.  \nSection 2: The next section was of sentence completion.  They gave you a sentence and you had to match it with words that were provided. (it's harder than it sounds since the sentences were so long and complex). There were roughly 12 questions and around 8 minutes to complete.\nSection 3:  identifying which words were closely related to each other. \nSection 4: Two 3-dimensional images (similar to an awkward Tetris figure, but three dimensional) were shown and you had to answer if it was the same image or different. [hardest section]\nSection 5: They presented a word in which you had to a word that closely relates to it in meaning. \n\nThe main issue I had was that I had run out of time to complete some sections. Many questions if not all were very difficult.", "Interview Questions": "N/A"}, {"date": "15 Feb 2019", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at USC Arcadia Hospital (Arcadia, CA) in Feb 2019", "Interview Descriptions": "I applied at the end of January as a new grad for the Staff RN position on their cardiac telemetry floor. Received an email 4 days later from HR to send my availability for the next two weeks for an interview. The HR recruiter will give you a brief interview in the HR office and kind of look over your resume and ask generic questions (Why Methodist? Certifications? etc.). She then takes you up to the unit to meet with the Unit Manager for a second interview. The unit manager was super nice as well! The entire interview was very relaxed and the only question I can recall her asking me was why I wanted to be a nurse. They ended up calling me the next day to offer a position.", "Interview Questions": "What made you become a nurse? "}, {"date": "4 Apr 2018", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at USC Arcadia Hospital (Arcadia, CA)", "Interview Descriptions": "Submitted application, it was easy to schedule an appointment with Nurse Manager, and HR is eager to help place you in a position. The process is stream lined and pretty quick.", "Interview Questions": "They asked me about HCAHPS"}, {"date": "26 Oct 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at USC Arcadia Hospital (Arcadia, CA) in Aug 2017", "Interview Descriptions": "Applied online, recruiter called, interview the next week. It was a panel interview with nurse educators and nurse managers. They took turns asking questions and were very friendly and not intimidating.", "Interview Questions": "A time you had a difficult situation with a co-worker or patient or doctor? "}, {"date": "5 Oct 2015", "title": "RN New Grad Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at USC Arcadia Hospital (Arcadia, CA) in Sept 2015", "Interview Descriptions": "The interview was very straight froward. Each manager present asked a question specific to their unit. Such as how would you handle a stroke patient? Or how would you continue the care of a patient who had a stroke?", "Interview Questions": "When I asked what they were looking for in an ideal candidate they turned the question back around and ask me what I thought they were looking for."}, {"date": "29 Aug 2017", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at USC Arcadia Hospital (Arcadia, CA) in Feb 2015", "Interview Descriptions": "I applied for the job and was called in for an interview. I then was called in for a second interview and soon after that was called with the job offer. I would say it approximately took 2-3 weeks for the entire interview process.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "18 Apr 2016", "title": "Patient Relations Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at USC Arcadia Hospital (Los Angeles, CA) in Jun 2012", "Interview Descriptions": "Interview process took about a week. Interviewer was very personable and easy to talk to. The process took about a week with the TB test and I was ready to start working.", "Interview Questions": "When a patient is being difficult, what do you do?"}]]