[[{"date": "8 Jun 2023", "title": "Revenue Cycle Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Apr 2023", "Interview Descriptions": "The interview was for 40 minutes and it started with a light conversation about what they do in the company, followed by asking me to start with my background and explaining the projects in detail. In between, they asked technical questions related to my project.", "Interview Questions": "Asked how I used to get data to clean it. How missing values are handled? My ambition"}, {"date": "9 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stony Brook Medicine", "Interview Descriptions": "It was a ~30 min zoom call with the nurse manager of the unit. I got an email asking for references the next day and got an offer soon after they were all filled.", "Interview Questions": "What are your strengths and weaknesses? What is a challenging experience that you had to deal with? Why do you want to work at Stony Brook Medicine?"}, {"date": "8 Dec 2022", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Stony Brook Medicine", "Interview Descriptions": "Everyone was kind, respectful, and positive during the whole process. It took 3 interviews for them to hire me including two hands on assessments that I feel were decently relevant to the position.", "Interview Questions": "What makes you stand out from other applicants?"}, {"date": "14 Sept 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stony Brook Medicine (New York, NY) in Sept 2022", "Interview Descriptions": "Nurse recruiter called for a screening and that went super well. Moved forward with an interview with the nurse manager and two staff members and questions were clear and direct. ", "Interview Questions": "How do you handle criticism?"}, {"date": "24 Jul 2022", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stony Brook Medicine", "Interview Descriptions": "Short conversation-style interview about research with the WTC Health Program. A simple and friendly process that lasted around 30 minutes. Was not very involved with technical details and was more so personal.", "Interview Questions": "How much do you know about the type of research we do here?"}, {"date": "18 Feb 2022", "title": "ICU Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stony Brook Medicine", "Interview Descriptions": "Involved 2 sets of interviews both virtual. 1st interview involved a series of about 10 screening questions related to your nursing experience such as how would you handle a difficult patient", "Interview Questions": "What was one time you had to take initiative and make a decision as a nurse?"}, {"date": "10 Dec 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Stony Brook Medicine (East Setauket, NY)", "Interview Descriptions": "I was contacted via email to schedule an interview. Once I arrived for the interview I was sat down with 2 members of the team and asked 2 questions. Overall interview was less than 5 minutes. It seemed they made up their mind before I even met with them.", "Interview Questions": "Why I was leaving my current company"}, {"date": "21 Dec 2021", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stony Brook Medicine in Dec 2021", "Interview Descriptions": "Interview was with the supervisor and the director of department. It was a virtual interview where they asked me questions first and then left the forum for me to ask questions.", "Interview Questions": "What type of cases is your weakness?"}, {"date": "21 Oct 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stony Brook Medicine", "Interview Descriptions": "Interviewer was very friendly and made me feel comfortable speaking with her. She also kept checking in on me after I got the position. One of my most enjoyable interviews.", "Interview Questions": "She asked about previous employment"}, {"date": "30 Sept 2021", "title": "RN Neurology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stony Brook Medicine", "Interview Descriptions": "Positive overall. Friendly panel of staff. Didn’t seem intimidating at all. They were very understanding and supportive of graduating school in a pandemic. Had the interview now waiting to hear back on a response.", "Interview Questions": "Tell us about yourself and why stony Brook medicine "}], [{"date": "2 Sept 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stony Brook Medicine (Setauket, NY) in Aug 2021", "Interview Descriptions": "Met with clinical practice manager and admin practice manager.  Both were open about expectations and demands of the position.  Both were positive and imparted a feeling of team effort and dedication.\r\nSecond interview with Dept. Administrator who was unfriendly and not particularly responsive or engaging.  Very dismissive.", "Interview Questions": "Tell me a little  about yourself"}, {"date": "21 Jul 2021", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Jul 2021", "Interview Descriptions": "Interviewed by the nurse manager and an assistant. The interview was about 20 minutes long, but I also asked 4 questions at the end. HR followed up about a week later.", "Interview Questions": "They asked me to tell them a little bit about myself and my experience. Then they asked \"If I was to speak to your previous manager, what would they say about you?\" They also asked what are my strengths and weaknesses. "}, {"date": "14 Aug 2021", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Apr 2021", "Interview Descriptions": "Very friendly and straightforward. Take internal applicants first before looking outside. HR gives you an interview and then the floor manager, educator, and staff. Usually, two people would interview you. The interview can start a little later than what was scheduled.", "Interview Questions": "What would your manager say about you if I asked about you?\n"}, {"date": "19 Dec 2020", "title": "Physician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Stony Brook Medicine", "Interview Descriptions": "Very laid back, standard questions, be prepared and know the company know the job description, be prepared to answer clinical questions in the speciality you applying. Will get a tour", "Interview Questions": "Why you chose us, past experiences "}, {"date": "19 Dec 2020", "title": "Billing Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stony Brook Medicine (Commack, NY) in Nov 2020", "Interview Descriptions": "The interview process is very pleasant and everyone is  down to earth. It seems like a great place to work with good benefits and close to home. I look forward to working there.", "Interview Questions": "What kind of Experience do you have "}, {"date": "13 Aug 2020", "title": "Associate II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stony Brook Medicine (Southampton, NY) in Aug 2020", "Interview Descriptions": "I interviewed with 2 members. They were both very pleasant. They asked the general questions and scenarios of what I would do in certain situations. They were very informative of what the job entailed and let me know of a few job opportunities and described each one.", "Interview Questions": "How do you handle co-workers who are not very friendly?"}, {"date": "1 Sept 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stony Brook Medicine in Aug 2020", "Interview Descriptions": "A couple of weeks after I applied, then a recruiter called and set up an interview with the nurse manager.  The nurse manager and another nurse interviewed me over the phone.  I thought the interview went well, they were telling me about orientation and hours at the end.  The nurse said I should be hearing back in about a week.  I waited a week and two days and sent a follow up email to the recruiter and I'm waiting.", "Interview Questions": "Why Med Surg? \r\nWhy Stony Brook?\r\nWhy you?"}, {"date": "20 Jul 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stony Brook Medicine (New York, NY) in Jun 2020", "Interview Descriptions": "I received a call a few weeks after applying online from a nurse manager and interviewed on the spot. She asked me a few questions and said that I would be contacted within a week or two.", "Interview Questions": "Why Stony Brook?"}, {"date": "28 May 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Stony Brook Medicine (New York, NY) in Apr 2020", "Interview Descriptions": "very challenging for a new nurse. the asked difficult questions that did not relate to me as nurse. did not get a call back ever. very challenging and seemed very disorganized phone interview.", "Interview Questions": "Describe a time you made a mistake"}, {"date": "10 Aug 2020", "title": "Senior Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stony Brook Medicine (Hampton Bays, NY) in Mar 2020", "Interview Descriptions": "The process was overall good experience with friendly people. Went on two separate interviews and was asked basic questions and overall feel for the business. Had a great feeling with both interviews and felt good vibe with Comptroller. Never heard back after two interviews and taking tests for comprehension. Called back to only hear from HR that the position was filled.", "Interview Questions": "Why are you leaving your current position?"}], [{"date": "19 Feb 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Feb 2020", "Interview Descriptions": "Met with HR department and nurse manager in the same day. Was hired the next day. They asked a lot of personality questions. Must do background check and drug test before being hired.", "Interview Questions": "What made you become a nurse?"}, {"date": "6 Mar 2020", "title": "Neurosciences Navigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Jan 2020", "Interview Descriptions": "Interview had been arranged with assistant. Interview was with director, one RN, and another higher up. Uncomfortable setting with 3 interviewers taking turns asking questions, assembly line style. They said they had to follow interview protocols, which meant they all had a paper with questions they took turns asking. Felt too formal and not personable", "Interview Questions": "What would you consider your strengths and weaknesses?"}, {"date": "21 Oct 2019", "title": "Staff RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Oct 2019", "Interview Descriptions": "Applied Online. Received a call with an interview date a week or two later with a date to meet with the Nurse Recruiter and Unit Manager.  Interviews were pleasant, but I received an e-mail stating that the candidate pool was competitive and I didn't get chosen about 7 days after the interview.", "Interview Questions": "Q: Something about how you handle diversity?"}, {"date": "12 Mar 2023", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stony Brook Medicine in Oct 2019", "Interview Descriptions": "Received a call to come in for interview. Came in and met with the Practice Administrator. I discussed my previous experience and she explained what opportunities she had available. I was offered the position at the interview.", "Interview Questions": "Asked to explain my previous work experience."}, {"date": "28 Jul 2022", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Jul 2019", "Interview Descriptions": "Stony Brook has a good interview process for new nurses.  Internal positions get a bit sketchy when hiring managers aren't good with people. I would recommend that managers should interview and learn about the person they are hiring.", "Interview Questions": "Where do you see yourself in 5 years. I would have seen myself at Stony Brook Hospital, but the management made it a very difficult place to stay. "}, {"date": "30 Jan 2020", "title": "Medical Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stony Brook Medicine in Feb 2019", "Interview Descriptions": "Short and sweet. Asked a few questions and then waited 2 weeks for offer, then an orientation date and starting training. The whole process took about 3 weeks from interview to start date.", "Interview Questions": "What experience do you have?"}, {"date": "29 Aug 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Oct 2018", "Interview Descriptions": "Simple and straight forward. Interviews with HR with basically personality questions and then went to the unit to interview with the manager of the floor and a few nurses who work there.", "Interview Questions": "How did you handle a difficult patient and what was the outcome. "}, {"date": "27 Aug 2018", "title": "Clerical Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Stony Brook Medicine (Stony Brook, NY)", "Interview Descriptions": "Interview was 15 minutes, said I was to be called back for a second interview with the doctor a week ago and have not heard anything. She didn't ask many questions just explained the job and went over y resume", "Interview Questions": "Didn't really ask too many questions just went over my resume"}, {"date": "1 Aug 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Stony Brook Medicine", "Interview Descriptions": "Recruiter called me to set up an interview. a few days after applying. I interviewed with the recruiter and then the floor nurse manager who showed me around the unit. Two weeks later I got a call that I didn't get the job, but they set me up with another interview on another floor. This interview lasted 45 minutes, a lot of scenario questions. I got the job the next day. Everyone was very friendly and helpful, best interview experience I've ever had.", "Interview Questions": "What would you do if while during bedside report you found an inconsistency with a current IV medication?"}, {"date": "23 Mar 2019", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Aug 2018", "Interview Descriptions": "Had two interviews. First round was with executive assistants and second was with the executive.  Interview lasted about 45 minutes.  I was told that there were three final candidates and a decision would be made within the week.  I never heard back; not even a system-generated courtesy letter.  Very unprofessional.  It wasn’t like they had to notify 20 candidates, which would still be inappropriate.", "Interview Questions": "Give me an example of a time where you has to handle a conflict in the office.   "}], [{"date": "26 Aug 2018", "title": "Associate Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Jul 2018", "Interview Descriptions": "Perfect scheduled interviews with all stakeholders in the field. Interviews with the connecting Department Heads took place during two days. Everybody attended a scientific presentation. There was plenty of space for personal discussions and questions from both sides.", "Interview Questions": "Why would you like to come to Stony Brook"}, {"date": "27 May 2018", "title": "Talent Acquisition Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stony Brook Medicine", "Interview Descriptions": "The interviewer conducted a thorough review of my professionally history. This was followed by questions specific to my skill set and tools that are used for the job. It was very comfortable and took place in the interviewers office.", "Interview Questions": "I was asked very specific question about my experience."}, {"date": "31 Oct 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Stony Brook Medicine in Mar 2018", "Interview Descriptions": "I interviewed for a student assistant position. It was a quick process and assesses your interest and why you chose this hospital. Wait was not too long, and interview lasted around 15 minutes.", "Interview Questions": "Why did you pick this hospital?"}, {"date": "7 Oct 2017", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Sept 2017", "Interview Descriptions": "Bring 2 Copies of your resume if you’re going to the interview, also dress properly, speak properly. Your interview is your first outlook of who you are. Don’t be afraid to ask questions. You’re not only getting interviews by the Human Resources recruiter but also the floor manager of the unit where you will be placed and a supervisor from that unit.", "Interview Questions": "If 3 different nurses came to you at once and nurse A tells you she needs an ekg done, Nurse B comes to you and says she needs blood work and a urine sample from a resident and nurse C approaches you to do vitals for a different resident. What would you proceed to do first?"}, {"date": "13 Dec 2017", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Feb 2017", "Interview Descriptions": "I applied for the job online directly from their homepage,first I did a phone screen about my previous experience and knowledge , then I received an interview from them. They were really professional,  the office looks boring just like any other hospital office.", "Interview Questions": "Coding questions that test you on icd 10 cm/pcs, and cpt codes, also about revenue cycle."}, {"date": "11 Nov 2016", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Stony Brook Medicine in Sept 2016", "Interview Descriptions": "I was called for an interview about a week after I applied online. I first met with the nurse recruiter for about a 15 minute interview. She asked maybe a total of 3 behavioral questions and then went into detail about the hospital. On the same day, I met with the nurse manager of the floor, who mostly described details about the floor I applied to. She asked me 2 behavioral questions. One week later, they set up an interview with the clinicians on the floor who described the orientation process and asked me specifics about my resume. Everyone I interviewed with was very friendly and I didn't feel pressured. Overall, it was a good interview experience.", "Interview Questions": "Describe a time that you had to handle a difficult patient or doctor."}, {"date": "5 Oct 2016", "title": "Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Jun 2016", "Interview Descriptions": "About 1/2 hour. Thought they were interested, as they requested references, etc and said theyd make decision in two weeks or so. However, they never let me know outcome of the interview, although I had followed up via phone over a month later. Was told theyd call me back and let me know but never did. Obviously, i didnt get it but not good way to treat prospective employees", "Interview Questions": "Describe my background."}, {"date": "13 Jul 2015", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Stony Brook Medicine", "Interview Descriptions": "Interview process is simple and fast. No drug test. The only thing is the bosses. The manager that interview me was cursing the whole time over the phone while he was interviewing me. Very awkward.", "Interview Questions": "If you would ever steal money? "}, {"date": "12 Jan 2019", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Jul 2015", "Interview Descriptions": "Person was very nice and Straightforward.  Told me what was required to meet the standards of the jobs and asked when I was available. She also took the time to ask about what made me think and how I like to work and past work experiences.", "Interview Questions": "Q: Why do you think your right for this job?"}, {"date": "2 Jun 2019", "title": "CT Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Jan 2015", "Interview Descriptions": "Several Assistant Directors in the room. Very intimidating at first. Board room type. Each director with specific skills. After several questions it became it less tense. However, I had to rejected four times until they gave  me a chance.", "Interview Questions": "arguing with your boss and proving your point"}], [{"date": "25 Jun 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Stony Brook Medicine (New York, NY) in Nov 2014", "Interview Descriptions": "first round, one-to-one interview, marketing manager let me introduce myself and background;\r\nsecond round, group interview, meet and greet with each team member from different office. \r\nsenior director introduce the detail task of the job and ask me question about previous working experience.", "Interview Questions": "why you apply for it"}, {"date": "13 Sept 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Stony Brook Medicine", "Interview Descriptions": "Two runs of interview with detector, the first one is an oral interview and then some reading and wring assignments. After that, you wait for 1 week and will get the result.", "Interview Questions": "experience about a real project you work on"}, {"date": "6 Aug 2014", "title": "Clinical Lab Technologist (Chemistry) Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Stony Brook Medicine", "Interview Descriptions": "Look for the job opening at the stony brook hospital website. print out the documents needed for the application. Fill it up and go to HR in Technology Park in East Setauket to hand in. They will email you when they get your application and interested in. They will contact you for the interview date.", "Interview Questions": "Technical questions. Like critical ranges of electrolytes. Trouble shooting. "}, {"date": "18 May 2015", "title": "Surgical Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Jul 2014", "Interview Descriptions": "Face to face interview with nurse manager lasting approximately 10 minutes, simple questions asked, interviewer very distracted as interview was conducted in the middle of the department with staff and patients bustling about.", "Interview Questions": "where do you see yourself in 5 years."}, {"date": "9 Apr 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Stony Brook Medicine", "Interview Descriptions": "Good background match, just short talk", "Interview Questions": "N/A"}, {"date": "6 Feb 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Stony Brook Medicine", "Interview Descriptions": "Firstly, you need to be a graduate student in Biomedical Department of Medical department in Stony Brook University, then you can directly contact with the professor in Medical, ask them whether you can be a research assistant in his\\her lab, and send your Resume to the prof. If the prof agrees, then you will be a research assistant in this lab", "Interview Questions": "Why you choose my lab"}, {"date": "10 Oct 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Stony Brook Medicine in Jun 2012", "Interview Descriptions": "Basically, meet with the professor who is my actual employer. We have a great talk about the future project, and my basic skills. The research lab has like 11 people, each of them come from different background. They cooperate with each other to work on open problem in the biology area. It's fun and challenging. Then he decided to give me a position that is charge of analyzing the RNA-seq data.", "Interview Questions": "How do you complish your PhD degree? "}, {"date": "16 Dec 2015", "title": "PICU Attending Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Mar 2012", "Interview Descriptions": "Met with head of department.  I did not met with the division head.  I had lunch with other members of the department, had a tour and met with the hospitalist team as well.  It was a very easy going day.  Not extremely stressful.  The put me up at a hotel the night before and helped with coordination of the interview day.", "Interview Questions": "What did I want out of this job"}, {"date": "7 Mar 2013", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Stony Brook Medicine (Stony Brook, NY) in Sept 2011", "Interview Descriptions": "You just have to like working there, and make sure that you have the hours to put in... around 10 hours a week.", "Interview Questions": "Can you help us with computer issues?"}, {"date": "14 Feb 2012", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Stony Brook Medicine (Stony Point, NY) in Jun 2010", "Interview Descriptions": "Slow, everything is super slow, especially the human resource there in school of medicine.\r\nFor foreign student/visiting scholar, their hiring process for J-1 or H-1 is longer than 6 months. For green card holder or native american, it's still longer than 2 months.", "Interview Questions": "What's your salary?"}]]