[[{"date": "24 Mar 2023", "title": "Young Ambassador Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie-Tsinghua Center for Global Policy", "Interview Descriptions": "Quick call with communications manager. Applied for Young Ambassador position. Received interview invite within 1 week. Mostly behavioral questions. Was asked about my interests and why I applied for this job.", "Interview Questions": "What global events am I interested in"}, {"date": "24 Apr 2022", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Carnegie-Tsinghua Center for Global Policy (Beijing, Beijing) in May 2021", "Interview Descriptions": "One round of content/position specific interviews with potential supervisors, about 30 minutes, some questions asking your opinion on US-China relations, a few short answer questions related to US-China relations, took a couple of weeks.", "Interview Questions": "questions regarding your experience and knowledge of US-China matters"}, {"date": "28 Mar 2021", "title": "Young Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Carnegie-Tsinghua Center for Global Policy", "Interview Descriptions": "Very laid back interview with the potential supervisor. Was during covid so the interview was conducted over the phone. Experience-based, some questions asking your perspectives on US-China relations, why the CTC YAP program, etc.", "Interview Questions": "Why do you want to become a Carnegie-Tsinghua Young Ambassador? "}, {"date": "19 Mar 2022", "title": "Media Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Carnegie-Tsinghua Center for Global Policy (Chongqing, Chongqing) in Mar 2020", "Interview Descriptions": "First round with HR: general questions: tell me about a time you led a project, how do you manage time etc.\r\n\r\nsecond round with team leader. More specific questions on social media copywriting. There was also a written test that asks you to write social media copies for an article published by any of the Carnegie think tank offices.", "Interview Questions": "What was a project that you have led before?"}, {"date": "2 Nov 2020", "title": "Programs and Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Carnegie-Tsinghua Center for Global Policy in Mar 2019", "Interview Descriptions": "One round HR/behavioral interview; one round content/position specific interview. First one was quite short, around 15-20 minutes, second one was longer probably around 30 minutes and more substantive and content-heavy.", "Interview Questions": "What are your strengths and weaknesses? "}, {"date": "1 Jul 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 5 weeks. I interviewed at Carnegie-Tsinghua Center for Global Policy", "Interview Descriptions": "First round phone interview with the Operations Coordinator. Second round will be with a center staff who will probably be your advisor. Keep in mind that process takes a very long time - got my final result in mid May, and the first interview happened a month after the application was due.", "Interview Questions": "Why CTC? What scholar are you most interested in working with and why? What's the most pressing issue facing China right now?"}, {"date": "23 Jul 2014", "title": "Global Summer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Carnegie-Tsinghua Center for Global Policy in Apr 2013", "Interview Descriptions": "I was made aware of the internship opportunity by a professor of mine who had worked with the CTC's director in the past. After I submitted my initial application (several short answer questions related to Sino-U.S. communication/relationship growth in addition to the typical work experience queries) and followed up with the contact person, I had a Skype interview with the head of Operations, and the director's full-time Research Assistant. I was then asked to submit a writing sample and references.", "Interview Questions": "What do you think is the most pressing issue facing Sino-U.S. diplomatic relations right now?"}], [], []]