[[{"date": "15 Mar 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colorado School of Mines", "Interview Descriptions": "Just a terrible interview process. Took them 3 months to make a decision between 2 finalists. Nobody will wait for that. I know several people there are applying to different jobs. This is school is not about education anymore. Leadership is terrible.", "Interview Questions": "Boilerplate questions. Nothing very original. Very long process with several meetings and interviews with different groups."}, {"date": "21 Feb 2023", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Colorado School of Mines", "Interview Descriptions": "Interviews were informal, conducted as part of familiarizing yourself with research areas, projects and grants, and various faculty labs. Reaching out to potential advisors directly is the best way to find out more", "Interview Questions": "What are your research interests?"}, {"date": "23 Jul 2022", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Colorado School of Mines", "Interview Descriptions": "Pretty straight forward.  Standard questions about my past work with Excel, Word, and accounting software/ systems. Also, covered effective communication methods and techniques with a diverse student population, and time management techniques for handling multiple projects with conflicting deadlines.  The questions were not too difficult or technical.", "Interview Questions": "What is your proficiency with pivot tables? "}, {"date": "5 May 2022", "title": "Institutional Advancement Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Colorado School of Mines", "Interview Descriptions": "Challenging interview. I was asked to describe some team based work experiences in a large group setting. The interview included a tour and meeting several different people. The campus was very impressive but the questions felt tough. Expect a lot of follow up.", "Interview Questions": "Tell me about a time when you had to use data to evaluate an event."}, {"date": "15 Jan 2022", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Colorado School of Mines", "Interview Descriptions": "The entire process is very smooth and informative. You will have a chance to highlight your skills and the questions are mostly based on your previous experience and current project.", "Interview Questions": "Questions are related to the advertised project."}, {"date": "24 Sept 2022", "title": "Teacher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Colorado School of Mines (New Haven, CT) in Jan 2022", "Interview Descriptions": "it was fine, nothing really happened this is just so i  can look at a ____ thing why does it also have to be so long i really do not care", "Interview Questions": "what experience do you have"}, {"date": "27 Sept 2021", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Colorado School of Mines", "Interview Descriptions": "Went to the respective professor's office and talked. It was pretty casual. Simple question and answer format. The questions pertained to my interest in the field and why I believe the work is important.", "Interview Questions": "Why are you interested in this position."}, {"date": "27 May 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Colorado School of Mines", "Interview Descriptions": "In miner and energy economics departments. do research assist to the department or teach assist for students. they will ask some general question and introduce youself . This is very common process.", "Interview Questions": "What was the experience do you have. "}, {"date": "6 Apr 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Colorado School of Mines", "Interview Descriptions": "It is a friendly interview process. I talked to my potential advisor for about 1 hour.  We discussed my background and what skillset I am having. I present him my previous projects.", "Interview Questions": "I was not asked any questions. "}, {"date": "6 Jan 2021", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Colorado School of Mines", "Interview Descriptions": "Received an email about when a good time to interview was, and was pretty informal, just stopping on campus to talk with the bosses. Went to a table and discussed the job, then they asked some questions about why I was interested and such.", "Interview Questions": "Name a time you had to work with a difficult person, and how you dealt with the situation(paraphrase)"}], [{"date": "12 Nov 2020", "title": "Graduate Research Assistance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Colorado School of Mines", "Interview Descriptions": "You will take to your advisor one one one for about an hour. He will not ask hard questions. The interview goes very smooth. There is one round physics interview with no followup questions.", "Interview Questions": "Some bq questions no coding questions"}, {"date": "28 Dec 2020", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Colorado School of Mines (Golden, CO) in Aug 2020", "Interview Descriptions": "7 step Process: resume review, reduce to 1st round, 1st phone interview, 2nd phone  interview, submit video to 3 questions, 4th round interview, and final interview.  it was drawn out and you interview with the some people 2 or 3 times depending on how far you made it.", "Interview Questions": "how you will work with campus and community stakeholders to align priorities"}, {"date": "6 Sept 2019", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Colorado School of Mines", "Interview Descriptions": "It was very long and drawn out. It took 3 months just to get the first phone interview. Then there was second phone interview. On campus interview (very nice introduction to staff) group interview, and then final interview with executive staff. Long day. I had second thoughts because of all the hoops to jump through.", "Interview Questions": "We have a very strong candidate pool with equal or greater higher education than you. Why would you be the best candidate for this position?"}, {"date": "18 Jun 2019", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Colorado School of Mines (Golden, CO) in Jun 2018", "Interview Descriptions": "Online application, phone interview with some members of the search committee, day-long in- person interview with multiple campus constituents, including the search committee, campus partners, the person who would be my direct supervisor, the unit supervisor, and a presentation.", "Interview Questions": "Questions relating to philosophy of diversity, perspective on collaboration, how to manage multiple priorities. "}, {"date": "14 Nov 2017", "title": "Graduate Student Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Colorado School of Mines", "Interview Descriptions": "Very Casual. Talked with professors about 3 months prior to the semester you'd like to be a TA for. As long as you're qualified and willing to put in the work it is not difficult to get a position. Different for each department and class.", "Interview Questions": "Just a test of competency."}, {"date": "23 Mar 2017", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Colorado School of Mines (Golden, CO) in Jan 2016", "Interview Descriptions": "Applied through alumina. Get talk to different professors/administrators in the department. Show my research and publications. Get a tour about their research facilities and other related things. Did a presentation for researchers in the research team.", "Interview Questions": "Where your passion come from for doing research "}, {"date": "22 Dec 2015", "title": "Teaching Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Colorado School of Mines", "Interview Descriptions": "There was a phone screening by a panel of teaching professors.  At the Colorado School of Mines campus, there was an intense schedule of interviews and a teaching presentation was required.  It was hard to eat breakfast or lunch due to the many questions.  It took about a month to hear the result.", "Interview Questions": "What classes can you teach?"}, {"date": "23 Aug 2017", "title": "Communications Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colorado School of Mines (Golden, CO) in Jun 2015", "Interview Descriptions": "Following a brief phone interview, I was brought in for an in-person interview with the hiring manager. I then completed a test assignment that involved creating a tweet, infographic, and press release for a prospective story.", "Interview Questions": "How would you describe our target audience?"}, {"date": "5 Oct 2015", "title": "Peer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Colorado School of Mines in Mar 2015", "Interview Descriptions": "Submitted short paragraph answers to online questions, and was asked to come in for an interview. Dress was business casual (collared shirt, tucked in to nice pants, tie optional). Interview was conducted by 2 lead peer mentors. I was told over email that I had gotten the job about a month later.", "Interview Questions": "We were told to come prepared with a subject to teach about."}, {"date": "11 Mar 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Colorado School of Mines (Golden, CO) in Dec 2014", "Interview Descriptions": "I had emailed a professor at CSM to show interest in his research and in becoming a prospective graduate student.  I gave him my educational background and credentials, and he responded enthusiastically.  After several back-and-forth emails discussing our interests, he arranged to fly me out to visit CSM and to interview me.", "Interview Questions": "How do you like programming and computational work?"}], [{"date": "10 Sept 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Colorado School of Mines", "Interview Descriptions": "I sat down with the professor and discussed my research interests. We matched a current project to what I enjoy and went in detail to what would be my deliverables for the research and how long it should take. I thought the process was very easy.", "Interview Questions": "N/A"}, {"date": "6 Jun 2015", "title": "Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Colorado School of Mines (Golden, CO) in Sept 2014", "Interview Descriptions": "Very easy interview. Kristen just wanted to make sure you are a responsible employee that will not bail last minute on your scheduled proctoring times as this can be detrimental for students taking the exams. Really just an informational interview (i.e. Kristen showing you the ropes, what to expect, how the proctoring system works). She had no technical or behavioral questions to ask. You are only sitting behind a desk, occasionally checking on students to make sure no one is cheating, so not a lot of skills are needed.", "Interview Questions": "How flexible is your schedule?"}, {"date": "16 Oct 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at Colorado School of Mines (Golden, CO) in Apr 2014", "Interview Descriptions": "The interview process was simple and straightforward. If you know someone already at Mines (a professor you would work with, for example), the entire procedure becomes much simpler. While technical expertise is obviously important, my interview was primarily focused on making sure our personalities were compatible in terms of research. It was a casual and friendly atmosphere.", "Interview Questions": "What helps to motivate you as a researcher?"}, {"date": "10 Apr 2015", "title": "Executive Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Colorado School of Mines (Golden, CO) in Apr 2014", "Interview Descriptions": "20 minute phone interview, followed by an in person interview.  Met with 4 people during the in person interview, which lasted about an hour.  Everyone was very comfortable, asked job related questions, and provided detailed explanation of the position.  Overall, the people were laidback and relaxed, which makes the interview less stressful.", "Interview Questions": "Describe an instance when you were unable to make a deadline, how did you handle the situation?"}, {"date": "20 Mar 2016", "title": "Design Lab & Machine Shop Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Colorado School of Mines (Golden, CO) in Jan 2014", "Interview Descriptions": "The interview process was relatively informal compared to interview for regular jobs. I think this is because if it's a work-study position they know the work isn't too demanding and that most students on campus are more than capable of doing the job.", "Interview Questions": "Why do you want to work here, and what makes you qualified?"}, {"date": "24 May 2014", "title": "Custodian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Colorado School of Mines (Golden, CO) in Aug 2013", "Interview Descriptions": "Very long process. The state has a constitutional set of rules that makes each opening at least a 2 or 3 interview process. Each candidate is pooled with up to 20 others then a written test. All before they are even interviewed. Then the top candidates are interviewed and the top 3-5 interviewed again.", "Interview Questions": "The Question that threw me was \"What qualities do you like most in a Supervisor?\"."}, {"date": "4 Sept 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Colorado School of Mines (Denver, CO) in Jun 2013", "Interview Descriptions": "I submittef my resume through the website automated process.  After the position closed it was a few weeks before I was notified that my name had been passed on to the hiring authority.  I was called and an interview time was set up.  I arrived at the office a few minutes early, and was escorted to the director's office.  The interview second started on time and was scheduled for 1 hour.  The Director had a list of questions. We went through the list and notes were taken. At the end of the interview; my questions were answered.  It was formal but at times there was laughter.  I left with an understanding a decision would be made within a few weeks. (No second round of interviews would be taking place)", "Interview Questions": "Question asked...\r\nWhy do you want to work for Mines?  What can you contribute?  How has your past experience given you the skills for this position?"}, {"date": "26 Feb 2013", "title": "Grader Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Colorado School of Mines", "Interview Descriptions": "Just submit application to office.", "Interview Questions": "No questions asked. Based on how well you succeeded in course and your GPA."}, {"date": "5 Jul 2015", "title": "Administrative Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Colorado School of Mines (Golden, CO) in Aug 2012", "Interview Descriptions": "Super simple, just a face to face. Before I just applied on diggernet and I got a call after which I scheduled my interview. It was business casual and not hard at all. I felt super comfortable the whole time and never felt unprepared. Overall, definitely don't be stressed. It was a super easy process.", "Interview Questions": "Have you done work like this before?"}, {"date": "28 Oct 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Colorado School of Mines (Golden, CO) in Apr 2012", "Interview Descriptions": "It is a pretty typical graduate school visit process. It takes the whole day and you get to meet with 4 -5 professors from the department working in the field you are interested in.  Then they show you the facilities at school and you also get to talk to current graduate students during lunch/dinner.", "Interview Questions": "There wasn't any questions that are hard. They are just trying to see if you will fit in in the research group and the school. "}], [{"date": "29 May 2012", "title": "Postdoctoral Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Colorado School of Mines (Golden, CO) in Dec 2011", "Interview Descriptions": "First I receive the phone call and then I got invitation for 1:1 interview and group presentation.", "Interview Questions": "why you want to join here"}, {"date": "9 Jul 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 6 weeks. I interviewed at Colorado School of Mines (Golden, CO) in Nov 2011", "Interview Descriptions": "A note on the personal history connecting with the job experience and the expertise gained during the jobs. Based on these as well as the importance of the work being done, the candidates are selected for the interview. The interviewer just takes a few minutes to know how good you are at your skills.", "Interview Questions": "How would you describe yourself to accomplish a specific project in science?"}, {"date": "6 Oct 2015", "title": "Computer Tech Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Colorado School of Mines (Golden, CO) in Oct 2011", "Interview Descriptions": "I had a friend doing the job, he asked his boss to look at me for the job. I got a meeting and talked to the manager about my experience in my private life fixing computers. He said I sounded like I woukd be a good fit for the job and he got me a schedule.", "Interview Questions": "What experience do you have with computers."}, {"date": "8 Jul 2015", "title": "Front Desk Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Colorado School of Mines (Golden, CO) in Jun 2011", "Interview Descriptions": "Had a brief one on one interview with the Director of the SRC at the time. After a quick conversation I was hired me on the spot. Demands where very basic and involved shadowing the current employees.", "Interview Questions": "What hobbies do you have"}, {"date": "17 Mar 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Colorado School of Mines (Golden, CO) in Feb 2011", "Interview Descriptions": "Very informal. I found a professor in need of a student worker, and met with him to discuss the job. It as more of an explanation of the position, and to see if it would work with my class schedule rather than an interview.", "Interview Questions": "N/A"}, {"date": "1 Apr 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Colorado School of Mines (Golden, CO) in Mar 2010", "Interview Descriptions": "Gave technical seminar to research group I was interviewing with. Met with the professor I would be working with after the seminar.", "Interview Questions": "What new ideas do you have for this project."}]]