[[{"date": "11 Apr 2022", "title": "Janitor/Cleaner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Medical Center (OH)", "Interview Descriptions": "Not bad Interviewed on phone then in person. Pretty straight forward. The interview questions were the common questions you would get in most interviews, I believe. It lasted about half hour", "Interview Questions": "What is your greatest weakness"}, {"date": "9 Apr 2022", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at Mercy Medical Center (OH) (Merced, CA) in Mar 2022", "Interview Descriptions": "its online interview. interview begin with general introduction, then they start asking behavioral questions. there are four people  from different units include med sure, labor and delivery, icu, watching and writing down my responses.", "Interview Questions": "how do you deal with patient who understand opposite what you said to him?"}, {"date": "12 May 2021", "title": "Lab Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Medical Center (OH)", "Interview Descriptions": "It was a quick 10-15 mins phone interview. They emailed me with a link for scheduling.  Everything went well, the recruiter is straight to the points, what they expect from you, and what benefits they offer.", "Interview Questions": "What is one of your weakness? "}, {"date": "20 Jun 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy Medical Center (OH)", "Interview Descriptions": "The hiring process was a typical rn hiring process. A criminal background check, drug testing, nicotine testing, verification of ACLS and BLS, interview with manager, and then a day of job shadowing.", "Interview Questions": "N/A"}, {"date": "31 Oct 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Mercy Medical Center (OH) (Canton, OH) in Sept 2017", "Interview Descriptions": "I was asked a few questions about my previous employment and skills after having to take a medical terminology and typing test. The entire process took about 2 hours. Which I thought was rather long.", "Interview Questions": "Have you ever messed up something important that affected patient heath in your previous job "}, {"date": "14 Sept 2016", "title": "Cst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Mercy Medical Center (OH) (Canton, OH)", "Interview Descriptions": "The initial interview itself went very well. Management seemed very friendly and knowledgeable. I thought it was going to be a great place to work, then my training started which was lacking at best. They concentrated on general surgery more than anything else. They are a full-service hospital and their training did not cover everything that an employee needs to work there. There were employees there that have worked there for 4 years that still have not done certain procedures.", "Interview Questions": "Would you be willing to work any hours and any shifts."}, {"date": "31 Aug 2017", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Medical Center (OH) in Aug 2016", "Interview Descriptions": "I met with a HR rep first then went to my interview with the floor manager. She sat me down and tried to push me towards a postition I didn't apply for, but ultimately I got hired in to the position I did orignally apply for. I was also given a hard time about my school schedule during my interview.", "Interview Questions": "What's the hardest situation you've ever experienced professionally?"}, {"date": "28 Jul 2016", "title": "Critical Care RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Mercy Medical Center (OH) (Canton, OH)", "Interview Descriptions": "Immediately called for an interview. The nurse manager that interviewed me is not in that position anymore. Basically I showed them my resume and they hired me on the spot! Showed me the Unit and explained to me what was expected of me.", "Interview Questions": "Asked a general question of my experienced and I just spent time the rest of the interview talking about myself.  When I hired in I had about 15 years of nursing experience."}, {"date": "12 Jul 2016", "title": "Supply Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy Medical Center (OH) (Canton, OH) in Apr 2015", "Interview Descriptions": "Very comfortable informal interview. It was a one on one setting and the questions asked were very standard. After completing the interview I was immediately offered a position and accepted.", "Interview Questions": "They asked me how I worked under pressure"}], [{"date": "5 Dec 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy Medical Center (OH) (Canton, OH) in Feb 2015", "Interview Descriptions": "After I applied online, HR never called. A unit manager from another department than I had applied to called and asked me to come in. I only met with the Unit Manager. HR never interviewed me.  I wasn't really even interviewed.  Only asked when I could work and when I could start. HR was very difficult to get in touch with when I had questions.", "Interview Questions": "I think they may have just been desperate to fill positions on this particular floor.  Basically the only questons she asked me were what was my availability and how soon could I start."}, {"date": "7 Jun 2016", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Mercy Medical Center (OH) (Canton, OH) in Aug 2014", "Interview Descriptions": "Typical interview process.  Took a tour of the department only, was interviewed by the manager and all of the physicians.  Took a skills test.\r\n\r\nThe whole process too MONTHS.  HR IS SLOW!!!  Even after I was offered the job it was months before I knew a start date or anything I needed to do to prepare.\r\n\r\nYou have to pass the physical, drug, and tobacco test.  Which is pretty ridiculous.", "Interview Questions": "Typical interview type questions.  No surprises.\r\n\r\nThere were some personal questions asked like my marital status, kids, etc.  This did make me a little uncomfortable.\r\n\r\nThe City and hospital in general were downgraded even during my interview process.  I had a feeling I wouldn't be happy."}, {"date": "29 Mar 2014", "title": "Medical Transcriptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Mercy Medical Center (OH) in Jan 2010", "Interview Descriptions": "Of all the interviews I have had, Mercy's is one of the most stressful. The woman who work there are not very friendly. Thet let you sit there while other people come in and they joke and talk with them, sometimes leaving the office with you sitting there without so much as excusing themselves.", "Interview Questions": "They ask what I would do to assure the success of the hospital. "}]]