[[{"date": "3 Jul 2023", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Michael's Hospital", "Interview Descriptions": "Work with the start up companies to help them with the day to day tasks. The tasks vary from conducting market or financial analysis to understanding the regulatory systems of the healthcare industry.", "Interview Questions": "Have you had any previous experience working with start up companies?"}, {"date": "19 Jun 2023", "title": "Database Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in May 2023", "Interview Descriptions": "Role seemed promising but was left ghosted by their team (specifically this was for GEMINI medicine) after completing their technical SQL test. Overall would like to see better communication from either their dev team for hr team in the future.", "Interview Questions": "Technical interview involved SQL questions, answering questions from a database diagram"}, {"date": "19 Feb 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Michael's Hospital in Feb 2023", "Interview Descriptions": "6-7 questions, panel interview, rude and boring interviewers. Feels like they were rushing the interview. The Manager even came to the interview looking like she just woke up. They were speaking so fast that I had to ask them to repeat the very long scenarios of the question/s.", "Interview Questions": "Nursing interventions to specific scenarios such as a patient in Sceptic Shock and MI."}, {"date": "11 Jul 2023", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital (Toronto, ON) in Jan 2023", "Interview Descriptions": "The interview process typically refers to the series of steps and evaluations that a candidate goes through when applying for a job or a position. While the specific details of the interview process can vary depending on the company, industry, and position, there are some common elements that are typically involved. Here's a general overview of the interview process.", "Interview Questions": "what is your strength?what is your weakness?"}, {"date": "13 Nov 2022", "title": "Clinical Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Michael's Hospital (Toronto, ON)", "Interview Descriptions": "Applied on their site, got call from HR after a month approximately to schedule an interview. Questions were related to the job as well as some routine questions like time management. Panel of 5, unprofessional interview as the hiring manager was sarcastic which made feel uncomfortable. If you’re not serious about candidates please don’t waste their time.", "Interview Questions": "How do you keep high quality performance in a very busy working environment."}, {"date": "16 Nov 2022", "title": "RPN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in Nov 2022", "Interview Descriptions": "Conducted via ZOOM with nursing manager and nursing educator. They sent the zoom link the day before the interview. It lasted about 15-20 minutes and they asked me about 2-3 questions each.", "Interview Questions": "How would you manage conflict with a patient's family member who is very upset and complaining that the patient has a soiled brief and hasn't been set up for lunch?"}, {"date": "28 Jun 2023", "title": "Social Work Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at St. Michael's Hospital (Toronto, ON) in Aug 2022", "Interview Descriptions": "Interview process was fairly straightforward and painless, I sent over my CV/Resume and was contacted for an interview. The interview was ~30mins and the questions were standard. Interviewers were kind and understood that I come from a student background so I was not expected to have all the answers.", "Interview Questions": "Tell me about yourself What do you know about the hospital/what we specialize in? What do you know about the program/unit(s) you would be a part of? What interested you in a placement here? What skills do you bring? Name a time where there was conflict and how did you go about resolving it? Name a time where you received negative feedback and how did you go about it? What do you need from management/supervisors? What makes a placement good for you? What do you wish to learn from this placement? Any questions for us?"}, {"date": "20 Jul 2022", "title": "Jr. Data Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at St. Michael's Hospital", "Interview Descriptions": "Preliminary phone interview, lengthy technical interview as a take-home assignment. Was given a week to complete it on short notice. No formatting guidelines. Was promised a follow-up after submitting my responses,  none given.", "Interview Questions": "Experience, interest, qualifications, pay range, work-life balance desired"}, {"date": "6 Jul 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Michael's Hospital", "Interview Descriptions": "Was fair\r\nI was very excited but then heard they already knew who they were hiring.\r\nIt definitely helps connecting with supervisor and research coordinators prior the I interview process and selection", "Interview Questions": "Tell us about yourself and how you fit to this role"}, {"date": "29 Apr 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in Apr 2022", "Interview Descriptions": "Received an interview offer 2 weeks after the application deadline and had 2 rounds of interviews (1 week apart). There were two managers from different departments during the interview (30 min) and the interview mostly consists of behavioral questions.", "Interview Questions": "- Tell me about yourself \r\n- Challenges you've faced in a team and how did you resolve it \r\n- Why do you want to work here\r\n- Your strengths/weaknesses\r\n-  If your schedule gets disturbed due to multiple deadlines how will you react\r\n"}], [{"date": "24 Feb 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Michael's Hospital", "Interview Descriptions": "the interview process is quite long.\r\nI started my application first week of january and they only sent me an email last week. The interview is easy to average in terms of difficulty. the staff were nice and friendly", "Interview Questions": "they asked me about my personal background"}, {"date": "8 Dec 2021", "title": "Philantropy Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital", "Interview Descriptions": "This is for St. Michael's Hospital Foundation: \n\nI had several interviews with the different \"teams\" (areas of philanthropy). Many of them ghosted after the initial screening and a few staff seemed extremely disorganized, i.e. team members screening instead of HR who couldn't answer simple questions or didn't explain clearly which specific team they were recruiting for. However, everyone was professional and courteous. \n\nFor the interviews where I was to go into round 2, I was told the interview process was long. After the initial screening and the interview with the team, there are 2 more interviews with directors or c-suite (?).\n\nThey wasted my time by cold calling to ask if I was still interested in the position, then ghosted after I asked for more information/clarification via email.\n\nAdditionally, the salary provided during the interview was lower than what was on the job posting salary ($5k difference).", "Interview Questions": "Behavioural questions e.g. how you handle stress and competing priorities."}, {"date": "18 Oct 2021", "title": "Reseach Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Michael's Hospital", "Interview Descriptions": "Formal yet relaxed. Asked basic questions about strengths and weaknesses, past experiences and soft and hard skills you can bring to the job. Type of interview you can't really prepare for but nonetheless it should go smoothly if you are logical and can think on the spot. Overall, good experience.", "Interview Questions": "What skills can you bring to this job?"}, {"date": "27 Dec 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital in Sept 2021", "Interview Descriptions": "Panel interview with 5 interviewees. Each took turns asking questions on skills related to the role. 30 minute interview. There was only one interview and then references were checked followed by the offer.", "Interview Questions": "Why do you want to work here?"}, {"date": "22 Jun 2021", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at St. Michael's Hospital", "Interview Descriptions": "Was interviewed by co-op students because the department was restructuring. The interview process was long and they asked a number of questions for a couple of hours, primarily behavioural questions", "Interview Questions": "Tell me about yourself ."}, {"date": "5 Mar 2021", "title": "Talent Acquisition Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at St. Michael's Hospital", "Interview Descriptions": "It was short and easy to the point. Initial interview with agency and phone call with TA manager to determine fit. It was very easy, short and simple. Went through the agency for the most part.", "Interview Questions": "How do you organize your time?"}, {"date": "4 Feb 2021", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Michael's Hospital (Toronto, ON) in Jan 2021", "Interview Descriptions": "There were a total of three rounds of screening--1). written test; 2). phone screening interview; 3). video interview, then reference check. The process was quite lengthy (2+ months), but the interactions were very positive throughout.", "Interview Questions": "Tell me about your self."}, {"date": "14 Nov 2020", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital", "Interview Descriptions": "Applied online, was contacted within a few days to set up an interview. I was told that I would hear within 1 week whether or not I got the job. Received a response within a few days. Interviewers were very nice, overall a good experience.", "Interview Questions": "Tell us about a time when you made a difference in a patient and/or their family’s life. "}, {"date": "15 Nov 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Michael's Hospital (Toronto, ON) in Nov 2020", "Interview Descriptions": "Great company! the interview process was a little harder than other companies but it is only because they want someone whos the right fit for the position. Good interview experience gained.", "Interview Questions": "- Tell me about yourself\n- What are your strengths/weaknesses?\n\n"}, {"date": "21 Oct 2020", "title": "Community Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital", "Interview Descriptions": "Got call from the program's manager and set up interview date and time. I was interviewed by a panel of four. I was phoned by HR and let known that they decided to go with another candidate who matched the qualifications more.", "Interview Questions": "Describe your experience as it relates to clinical social work"}], [{"date": "17 Sept 2020", "title": "Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Michael's Hospital", "Interview Descriptions": "The questions were basic interview questions- more behavioural. Interview started on time and was done virtually with 2 people. The interview lasted about 30 minutes. I heard back from them for the 2nd level in less than a week.", "Interview Questions": "How have you handled conflicts in the past?"}, {"date": "12 Sept 2020", "title": "Junior Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital", "Interview Descriptions": "The Junior Data Analyst was done online, someone emails you a set of 10  to 20 questions and you're suppose to code it using R or Python. You're given 2 hours.", "Interview Questions": "How to sort through data + organize data"}, {"date": "30 Jun 2020", "title": "Data Quality Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital", "Interview Descriptions": "I did a R programming test first. 2 hours of 10 questions. And I got an interview after 5 days. I interviewed on the zoom, the interviewers were pleasant. I also need to draw a plot for a question.", "Interview Questions": "Behavior question. Some data analyze questions."}, {"date": "7 Aug 2020", "title": "Quality Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital (Toronto, ON) in Jun 2020", "Interview Descriptions": "I was shortlisted for an R/Python programming test. I was given two hours working on it and I couldn't finish all the questions on time because there were too many questions for a short time. I submitted it after I tried my best. Then I was waiting to hear my result for a couple of weeks but I didn't hear anything back. I followed up with them asking about it and they didn't even respond back to me. I think it's very rude and inappropriate to not get back to your candidate after requesting for a two-hour test.", "Interview Questions": "two hours R/Python programming test"}, {"date": "3 Jul 2020", "title": "Data Quality Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Michael's Hospital in Jun 2020", "Interview Descriptions": "10 questions in 2 hours. The questions themselves were not hard, the tricky part was to complete everything on-time. I self-taught myself python and I was only able to complete 6.5 questions within the 2hr time frame. They gave preference to people who answered the question in R over python. I was not invited to the second round interview.", "Interview Questions": "Pivot table"}, {"date": "13 Jul 2020", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in Jun 2020", "Interview Descriptions": "Programming test followed by a video interview. Test questions are reasonable for junior-level but need to watch the time. Interviewers are very nice but there are several at once so it can be intimidating.", "Interview Questions": "Case study"}, {"date": "18 Aug 2020", "title": "IT Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in Jun 2020", "Interview Descriptions": "I was contacted almost two months after applying for the position and had an initial phone screen with the hiring manager. After a week I followed up and was immediately contacted by the Director for a second interview over Zoom. My interview experience was great. I had asked when I would expect to hear back and the Director told me I would hear back in 2-3 weeks. After the third week I first followed up with the hiring manager. After a few days without a response I reached out to the director. I have yet to receive a response from either contacts and it has been almost 4 weeks. As much as I enjoyed meeting both interviewers, I am extremely disappointed in not getting even a reply back. This was not something I had expected coming from such a professional environment.", "Interview Questions": "Tell us more about your previous role and your everyday tasks and responsibilities"}, {"date": "16 May 2020", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital in May 2020", "Interview Descriptions": "Received an email with instructions to take a Programming Test (conducted remotely) in R or Python for shortlisted candidates. \r\nOnly those who have completed the test may be invited for an in-person interview.", "Interview Questions": "10 questions to do in 2 hours."}, {"date": "23 Dec 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at St. Michael's Hospital (Toronto, ON) in Feb 2020", "Interview Descriptions": "Very straightforward, standard practice. They asked me to talk about myself, greatest strengths, weaknesses, etc. Nothing very out of the ordinary for this group. I didn't get the job, but they were quite straightforward with it.", "Interview Questions": "What is your greatest strength?"}, {"date": "28 Dec 2019", "title": "Research Coordinator III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Michael's Hospital in Dec 2019", "Interview Descriptions": "Applied online, was contacted for an interview a few days later. After the interview, they asked me to provide references. Received an offer a few days after that. Accepted the offer.", "Interview Questions": "Tell me about yourself."}], [{"date": "11 Nov 2019", "title": "Medical Device Reprocessing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital", "Interview Descriptions": "Applied online. Took about 3 weeks to get a short phone interview. Moved on to an in person interview, which was a panel interview.\r\nAll interview questions were MDR related, standards of practice, instruments (name and classifications). Before the interview began, I had to take a timed two minute skills questionnaire.", "Interview Questions": "You arrive for the morning shift and there is a back log of instruments. First surgery is scheduled for 8:30am. How would you proceed."}, {"date": "17 Dec 2019", "title": "End User Support Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in Nov 2019", "Interview Descriptions": "30 minutes technical interview with 2 people. You talk about your work history and background. They ask you about your jobs and what you can provide to the table.  They will ask you about technical questions first. IF you are not good with a technical question, you wont pass", "Interview Questions": "explain process arp?\r\n\r\n"}, {"date": "14 Aug 2019", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at St. Michael's Hospital", "Interview Descriptions": "They only required a phone interview for a position that they were very desperate to fill. One of the co-workers with whom I was supposed to alternate the role quit, only 2 days after I started.", "Interview Questions": "What was an example you showed leadership?"}, {"date": "2 Aug 2019", "title": "Clinical Research Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Michael's Hospital (Toronto, ON) in Jun 2019", "Interview Descriptions": "I got invited for interview about 3 weeks after submitting my application.  I was interviewed by two people.  Both were extremely pleasant and made me feel comfortable and at ease.  I enjoyed the interview which lasted well over an hour.    Although I didn't get offered the job, I asked for feedback from the hiring manager and she was keen to provide me with great feedback and tips over the phone.  Based on my positive experience with this department, I was impressed by the professionalism and courtesy taken by the hiring manager to reply to my follow up emails and for taking the time to provide me with feedback.", "Interview Questions": "Tell us about your background."}, {"date": "6 May 2019", "title": "Clinical Research Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at St. Michael's Hospital (Toronto, ON) in Feb 2019", "Interview Descriptions": "The format was a single panel interview. Panel had 4 people. Was called at a preselected time, waiting for a few mins, then went to a conference room with everyone sitting around a table. The outline was explained and then we got into the questions.", "Interview Questions": "Behavior question about how you would handle a patient that was upset"}, {"date": "11 Feb 2019", "title": "Patients Safety Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in Jan 2019", "Interview Descriptions": "Interview was with Director and Project Manager in Patient Safety Department. The interview was predominately personality based questions, with a few questions about specific patient safety questions, and a few general personal development questions.", "Interview Questions": "What is your interest in Patient Safety at Unity Health Toronto?"}, {"date": "17 Oct 2018", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital", "Interview Descriptions": "-standard interview questions \r\n-I got an email from the manager and then we set up a time to do the interview\r\n-after part one,  there was another interview with the scientist\r\n-took about 2-3 weeks to confirm", "Interview Questions": "What do you believe will be the most challenging part of this job?"}, {"date": "1 Oct 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital", "Interview Descriptions": "Was invited to a 30 minutes interview with a panel of 3 people. The interview was over 45 minutes late in starting which was very annoying. It was also disorganized. They had no thought through the orientation process and did not know hourly rate despite offering the position.", "Interview Questions": "Describe a  challenging situation with a fellow employee and how did I resolve it?"}, {"date": "14 Aug 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital", "Interview Descriptions": "Interviewed by nurse manager and nurse educator. Interview took  approximately 30 minutes.  Asked various question that ranged from medical situational to personal experiences.  Given plenty of time to answer questions.  Overall, good experience.", "Interview Questions": "Why do you want to work at St. Michael's and what can you bring to the unit. "}, {"date": "20 Jun 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Michael's Hospital", "Interview Descriptions": "I had an in person interview with two people for 20 minutes. They asked basic interview questions. Then there were a five additional questions to answer on a piece of paper.", "Interview Questions": "Tell me about yourself"}], [{"date": "14 Jun 2018", "title": "RN W/Degree Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at St. Michael's Hospital (Toronto, ON)", "Interview Descriptions": "The interview team  include a unit manager and a HR Manager.  I was call for interview within a week after online application. Interview lasted for\r\n 1 & 1/2hour.", "Interview Questions": "Why did you chose St Micheal hospital??"}, {"date": "30 Dec 2018", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at St. Michael's Hospital (Toronto, ON) in Apr 2018", "Interview Descriptions": "-It was a 4:1 interview (team leader, manager, someone from school, @)\r\n-It was very comfortable interview\r\n-I was asked some general questions on personality, difficulty situations, strength/weaknesses\r\n-Later, they told me that there were more than 30+ people applied and were interviewed for that position", "Interview Questions": "General personality questions"}, {"date": "10 May 2019", "title": "Project Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at St. Michael's Hospital (Toronto, ON) in Apr 2018", "Interview Descriptions": "Panel interview. I received an email inviting me to come for the interview. I had applied for the position with the help of my college placement coordinator. It took a total of 2 days for me to complete the process.", "Interview Questions": "What drives you the most"}, {"date": "26 Jun 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Michael's Hospital in Feb 2018", "Interview Descriptions": "Very quick interview process. I was contacted for an interview two weeks after the position closed, attended an interview one week later and was offered a position within one week of the interview. Standard interview questions with general hospital questions and unit specific questions. The interview was conducted by the unit manager and nurse educator.", "Interview Questions": "St. Michael's is a nursing best practice spotlight organization. Can you describe the nursing best practices we are recognized for?"}, {"date": "15 Dec 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital", "Interview Descriptions": "It was 45 minutes interview with two interviewers. It was formal yet relaxed environment interview. They had preset questions and they were taking notes. Questions were both technical and behavioural questions. Asked for references before hand.", "Interview Questions": "Tell me about your professional experience and education which ended you applying for this job"}, {"date": "6 Oct 2017", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital (Toronto, ON)", "Interview Descriptions": "The interview process was straight forward. Simple Behavioral Questions, strengths, weaknesses. Info about recent work and education experience. What I would bring to the research program. Questions about data management and analysis. What I know about the research program etc.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "17 Oct 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in Aug 2017", "Interview Descriptions": "Quick- 30min. All questions where based on past experiences and how they would apply to the job. interview had 2 research coordinators. really basic and can't really prep for this type of interview.", "Interview Questions": "can you tell me about your experience working with"}, {"date": "30 Aug 2017", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at St. Michael's Hospital (Toronto, ON) in Apr 2017", "Interview Descriptions": "Every thing was good. I had an interview in morning and got acceptance at evening. They just asked me about my work experiences and my qualities.I chose me,  although I was overqualified.", "Interview Questions": "Routine questions"}, {"date": "14 Mar 2017", "title": "Medical Radiation Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Michael's Hospital (Toronto, ON)", "Interview Descriptions": "I was interviewed by both the department manager and a charge technologist. Many of the questions sounded like they were taken from a simple Google search (I.e. \"how would you define customer service?\"), I was not asked about St Michael's Hospital or its mission, vision, and values, I was not asked about why I wanted to work at St Michael's, I was not asked any knowledge-based or skills-based questions. Due to this, I believe I was invited for an interview as a formality, and not because I was a candidate, which is incredibly disrespectful. The manager would audibly and loudly sigh when I would begin to answer an interview question. The manager exhibited, I felt, borderline hostile body language and facial expressions. If this is how an interviewee is treated, I already know how the employees are treated and I will steer clear of that department for future job prospects. After the interview, I checked the Glass Door reviews and my suspicions were confirmed by a review on here from a technologist who had worked in that department, take a moment and read it if you can.", "Interview Questions": "How would you define \"customer service\"?"}, {"date": "15 Jun 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at St. Michael's Hospital (Toronto, ON) in Feb 2017", "Interview Descriptions": "I came in for an interview with the Research Manager, the Study coordinator and the other RA. It was formal but tone was friendly. Was certainly more of a \"fit\" interview. They asked very standard fit/personality type questions. It was the type of interview such that if you were prepared and knew all your buzzwords to hit then it was an easier interview.", "Interview Questions": "What are you least favorite types of people to work with?"}], [{"date": "20 Nov 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Michael's Hospital", "Interview Descriptions": "You first complete a reflection tool kit and then afterwards would be invited for an interview. The interview was a panel based interview with the manager, HR and the clinical educator. There were a lot of behavioural/ problem solving type of questions. They really want to know how you would approach a problem and manage conflicts using examples.", "Interview Questions": "Give an example of a time when you had a conflict with a colleague(or patient or family member,) and how did you resolve it?"}, {"date": "2 Nov 2016", "title": "Procurement Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Michael's Hospital in Sept 2016", "Interview Descriptions": "Very friendly, informative and relaxed. Good question to answer ratio. Other office members were friendly when waiting for the interviewing manager. Professional throughout the interview process with feedback when required.", "Interview Questions": "What can you bring to the position"}, {"date": "25 Aug 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in Aug 2016", "Interview Descriptions": "I submitted my application online as soon as I found the posting, received a call for an interview about a month later. Completed the first interview with HR and the program director, then received a call back within one hour to invite me to a second interview that would take place 2 weeks later with all of the physicians I would work with if I got the job. I AM STILL NOT DONE WITH THE PROCESS!", "Interview Questions": "How much experience do you have with Powerpoint? Can you provide examples?"}, {"date": "13 Oct 2016", "title": "GIS Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Michael's Hospital (Newmarket, ON) in Aug 2016", "Interview Descriptions": "There was a three person panel in a room where I was asked to answer the same 8 questions that were weighted equally. I was given paper, a pen and the 8 questions printed on a piece of paper. I was one of five candidates chosen for the interview.", "Interview Questions": "What open data website do you know of?"}, {"date": "11 Jul 2016", "title": "Research Assistant - Knowledge Translation Program Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in Jul 2016", "Interview Descriptions": "The 1st step is a phone screening interview. They won't call back so that you can prepare. I didnt find that accessible. The phone screening is suppose to be 5 mins. If you get through this screening then they will email you in a week's time. If you are not selected they won't let you know.", "Interview Questions": "Why do you want to work at St. Michael's hospital? Why knowledge translation?"}, {"date": "3 Jan 2017", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Michael's Hospital (Toronto, ON) in Jul 2016", "Interview Descriptions": "I had a phone interview to get some general info about interest, availability and just making sure I was interested in the role. Was told I would receive a call back if I was to make it to the next round. Got an in person interview which went well with 3-4 people that worked there. Overall one of the best interviews I've been through. Organized, on time and very respectful and friendly!", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "28 Jul 2016", "title": "Research Assistant - Knowledge Translation Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in Jul 2016", "Interview Descriptions": "Phase 1: Phone Screening - 15 minute conversation (they say it is around 5 minutes);\r\nIf you pass phone screening...\r\nPhase 2: Completion of Editing Activity, Communication Activity & Adjective Hiring Form - must be completed and returned within a few days time;\r\nIf you pass skills tests...\r\nPhase 3: In-person interview - relevant questions with a panel of interviewers", "Interview Questions": "Which do you prefer: the big picture or short term goals"}, {"date": "15 Jun 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Michael's Hospital", "Interview Descriptions": "The interview was very standard and expected. Couple of behavioural questions and questions about past experiences and what you will bring to the team. No technical questions really. Interview went well overall", "Interview Questions": "Are you familiar with research methodology"}, {"date": "6 Oct 2016", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in Jan 2016", "Interview Descriptions": "PI with HR manager and one other individual, asked general interview questions, Interview lasted around 30 minutes and interviews rotated when it came to interview questions. Everyone was very nice and made experience enjoyable", "Interview Questions": "Tell me about yourself"}, {"date": "10 Feb 2017", "title": "Applications Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in Dec 2015", "Interview Descriptions": "Called me for an interview which went well, called me in for the second one a few days later which went very well and I thought the job was in hand. Called me for a final interview Christmas Eve with the director and manager and could feel right away from the director that nothing was coming of this. I found out a month later that they had hired back someone who had recently left the same sort of position, I was told the previous manager. Waste of my time taking days off work, waste of gas and parking fees to get down there, and absolutely disrespectful of my time, they could easily have told me the truth and I would have understood but to go through all of that and be told nothing? They seem to be hiring for these positions quite often, BEWARE!", "Interview Questions": "Very easy going, with expected questions, nothing out of the norm."}], [{"date": "13 Aug 2015", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at St. Michael's Hospital", "Interview Descriptions": "Called for an interview 2 days after applying. Received a 30 minute phone interview that did a background check on skills and reasons for application. Did not received an in person interview.", "Interview Questions": "Why do you want to work here?"}, {"date": "18 Jul 2016", "title": "Research Coordinator - Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in May 2015", "Interview Descriptions": "This was a position for a particular research project. The first stage of the interview process included  a phone interview with an HR person. It was  followed by an in-person interview with the project lead and an HR representative. They asked fairly standard HR questions were asked (conflict resolution, etc).", "Interview Questions": "Can you describe a difficult situation you encountered and how did you handle it?"}, {"date": "23 Dec 2018", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at St. Michael's Hospital (Toronto, ON) in Jan 2015", "Interview Descriptions": "there was a phone interview with the manager. then face interview with the manager and then I waited 2 weeks and got the job and I accepted the offer and got straight to orientation.", "Interview Questions": "Tell about yourself"}, {"date": "1 Jul 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Michael's Hospital (Toronto, ON) in Jul 2014", "Interview Descriptions": "The role was in the Implementation, Evaluation, and Sustainability team.  I met with 3 staff members (the team manager, the business manager and a research coordinator).  Overall they were very friendly.  I was asked several behavioural questions, and some general questions about the role and why i was the best candidate.", "Interview Questions": "Standard behavioural questions - how do you handle multitasking? etc...  However, one question that still stands to me is \"are you an individual that needs to see the big picture to work well or just the short term goals?\".  They wanted me to pick just one."}, {"date": "2 Apr 2018", "title": "Registered Dietitian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Michael's Hospital (Toronto, ON) in Mar 2014", "Interview Descriptions": "The interview process was quick and the panelists were friendly.  They asked a range of clinical questions and some calculation questions which I imagine would be simple for interns who have had clinical placements.   Overall, process was not too bad.", "Interview Questions": "What would you do in a situation where you're advocating for a patient tube feed but he/she does not want one even when they are losing a dramatic amount of weight?"}, {"date": "2 Aug 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Michael's Hospital (Toronto, ON) in Feb 2014", "Interview Descriptions": "-it was fairly easy, just talked about what my experience was and why i wanted to work there\r\n-it was fairly easy, just talked about what my experience was and why i wanted to work there", "Interview Questions": "Why do you want to work here?\r\nHow would your experience translate to this role?"}, {"date": "26 Feb 2013", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Michael's Hospital (Toronto, ON)", "Interview Descriptions": "The application is pretty extensive. It follows the typical CV, research statement, publication list, and 3 references format that you would have to CIHR anyways. The PI that I worked for during my PhD was on the search committee for the post-doc, so I may have had an \"insider's\" edge. I believe there were about 100 applicants for a total of 5 positions, and they selected about 25 people to interview. \r\n\r\nThe questions asked during interview were pretty standard. I'll try and recall some of them here: 1) what can you bring and offer to our research group? 2) Why do you think our research group is the right place for you to be? 3) Discuss your experience as a researcher and outline your research program if you were given a research budget. 4) How do you plan on making your research relevant to policy circles and decision-makers? 5) How does your doctoral research connect to what you want to do in our research group?", "Interview Questions": "Discuss your experience as a researcher and outline your research program if you were given a research budget."}, {"date": "22 Jun 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at St. Michael's Hospital (Toronto, ON) in Feb 2012", "Interview Descriptions": "Fairly easy as it was for an entry-level position, wants to know if you can be detail-oriented and keep confidentiality. I was asked a number of scenario questions regarding whether you can handle difficult participants and follow written instructions. If you have additional language skills extremely valuable.", "Interview Questions": "How would you handle someone who doesn't understand the survey questions"}, {"date": "3 Aug 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at St. Michael's Hospital (Toronto, ON) in Jul 2011", "Interview Descriptions": "Interview was very relaxed with research supervisor. We just went for coffee and chatted about opportunities. My supervisor spoke about the direction that he wanted to take the project and was interested in new explorations in research and development. We spoke casually for some time and then I provided some information on my previous research projects that I had completed. I then received a follow up phone call asking for more information a few days later, and within a week or two, I had received a job offer to start working full time.", "Interview Questions": "How can I improve the current research project with my skillset?"}, {"date": "4 Jun 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at St. Michael's Hospital (Toronto, ON) in Apr 2010", "Interview Descriptions": "Submitted my CV and cover letter via the St Mike's career's website. Got a phone call from the project coordinator and did a brief phone interview. I then came in for an in person interview with the project coordinator and another coordinator. The interview was about 40 minutes, they went over my resume, asked me specific questions regarding the position such as have I had any experience with the population I would be working with. They then proceeded to ask me to engage in a type of role play where I was to administer a clinical test on a participant (the participant being one of the coordinators). I was asked why I was interested in the position, what I thought I could bring to the team etc.", "Interview Questions": "The most unexpected question was probably asking me to do the clinical role playing. I had not expected that and had never worked with that measure, so it took me by surprise, but I just went with it."}]]