[[{"date": "1 Mar 2023", "title": "Talent Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bassett Healthcare Network", "Interview Descriptions": "The interview with the recruiter and other team members was pleasant, but I did not receive a follow-up call letting me know their decision. There also was not much transparency around salary even after multiple interviews.", "Interview Questions": "They asked a good mix of questions about skills and culture fit."}, {"date": "27 Feb 2023", "title": "Biomedical Equipment Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Bassett Healthcare Network in Feb 2023", "Interview Descriptions": "It was good. Every thing was well structured. Onboarding process was not that great. Technical round was to deep. I felt it was too much in details for entry level position", "Interview Questions": "Previous work exp and any out of way you went"}, {"date": "19 Aug 2022", "title": "Temp Screener Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bassett Healthcare Network", "Interview Descriptions": "I received a phone interview and when they called, they asked if I was free at that moment to do it. They were very considerate; making sure it was a good time for an interview. They proceeded to ask some straight-up questions about myself and some ethical ones. None seemed pointless and it was a pleasant experience.", "Interview Questions": "How did you find out about this position?\nWhy do you want to work for us?"}, {"date": "19 Dec 2022", "title": "Systems Engineer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Bassett Healthcare Network in Sept 2021", "Interview Descriptions": "I participated in a multi-step interview process at the company. Upon completion of the interviews, no further communication or updates were provided by the company. The lack of follow-up or information on the status of the application was unusual and unexpected. I was unable to determine the outcome of their application or the next steps in the process until much later", "Interview Questions": "general questions regarding process improvement and general skills"}, {"date": "25 Jul 2021", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bassett Healthcare Network", "Interview Descriptions": "It was a very easy interview with basic questions . Just make sure to Be prepared and nice. Interviewers were very busy but focused on interview. Very straight forward interview process.", "Interview Questions": "What do you think are your strengths?"}, {"date": "28 Jan 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at Bassett Healthcare Network (Cooperstown, NY) in Nov 2020", "Interview Descriptions": "They are very much welcoming. The set-up and the facility were thoroughly discussed and told. The area of tentative assignment were also discussed including the type and load of work available. They also discussed on the career advancement if the employees through their support. Very promising company", "Interview Questions": "What area did my last experience was? "}, {"date": "18 Sept 2019", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Bassett Healthcare Network", "Interview Descriptions": "Interview was over the phone. Interviewer was nice and provided some information about the job but not much. The interview was quick maybe about 20 minutes. Overall I believe the interview went well. Interviewer did state if the company likes you they will call you, or you will get an email saying otherwise.", "Interview Questions": "How would you handle an angry/upset patient?"}, {"date": "26 Jan 2021", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bassett Healthcare Network (Cooperstown, NY) in May 2019", "Interview Descriptions": "The entire interview process was thorough, professional, and lengthy. This was also pre-covid though. They asked mostly common interview questions. I was told the rate of pay while in the interview.", "Interview Questions": "Common interview questions were asked"}, {"date": "26 Aug 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Bassett Healthcare Network (New York, NY) in Mar 2019", "Interview Descriptions": "Interview was fairly easy and brief and scheduled in the morning about 20 minutes. Interviewer asked about 2 questions and confirmed some information on application.  They would call back if interested.", "Interview Questions": "What unit are you interested in?\r\nWhy Bassett? "}, {"date": "15 Mar 2019", "title": "Medical Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bassett Healthcare Network (Oneida, NY) in Feb 2019", "Interview Descriptions": "The HR called me to set up a phone interview. I set it up for early in morning. They went over my qualifications, asked me to fill in some information. They also gave me pay scale. When we concluded interview she said you did great and someone will call you within a week to set up face to face. Within 36 hours received call to set that up. Went to it with high expectations. My mistake.  The managers were 10 minutes late to come out and get me. I understand stuff happens but no one said anything to me. Finally came out and got me. They did apologies for being late. Went over resume quickly asked few ones such as why I applied there in first place.  Then asked what would I do if patient came in short of breath. My answer was immediately have them sit down. Go to them check them in; go back too see how doing than go see their provider and let them know. Because it could be short of breath from just walking in. They like answer. Said everything went great. Out door I went. Sent a follow up thank you letter to the HR person I'd been dealing with. Than nothing for 2 weeks. Finally got response email from a new HR person saying we picked another candidate but look on our website to see other positions.  Felt impersonal.  I did reach out to the HR person I had been dealing with. She did return my call and set me email saying she found out they picked another but if had any questions please reach out to her.", "Interview Questions": "They asked if I made a mistake and how'd I go about fixing it."}], [{"date": "6 Jul 2018", "title": "Security Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Bassett Healthcare Network (Cooperstown, NY) in Jul 2018", "Interview Descriptions": "Phone interview with recruiter. I don't do well with phone interviews so I wish they would of done a face to face. Third time being turned down for this job when I have 10+ years of experience.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "9 Nov 2017", "title": "Emergency Services Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bassett Healthcare Network", "Interview Descriptions": "There was a quick phone interview with a lady from human resources. She was friendly and asked around 5 questions about past experiences and times when there may have been conflicts or disagreements at work.", "Interview Questions": "Describe a time when you were pulled in multiple directions at work?"}, {"date": "7 Dec 2016", "title": "Human Resources Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bassett Healthcare Network (New York, NY) in Dec 2016", "Interview Descriptions": "I received a phone call to briefly clarify a few details pertaining to the job and my resume.  Subsequently we scheduled a formal telephone interview where we discussed my experience and I answered questions relevant to the job. We then discussed salary and answered a few questions  regarding childcare.", "Interview Questions": "What did my role as an operator in charge entail?"}, {"date": "15 Sept 2016", "title": "Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bassett Healthcare Network (Cooperstown, NY) in Aug 2016", "Interview Descriptions": "Phone interview with human resources with basic \"how do you handle ABC situations\". This was followed by a face to face with the hiring manager. This time there was More technical and background questions.I was given a tour of the facility. Second interview with department head and some staff. Second interview was about two hours. Fairly standard interview questions. Everyone involved was quite pleasant.", "Interview Questions": "Example of how you handled a difficult co worker?"}, {"date": "2 Nov 2015", "title": "Administrative Assistant II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bassett Healthcare Network", "Interview Descriptions": "I applied on-line for an administrative assistant II position. The position description lacked detail. I got a call back from human resources to schedule a phone interview. During the scheduled phone interview she went over the entire application to verify I had put down what the application stated. I explained my work experience. I had worked my way through college working three part-time jobs. Before going back to school I worked full-time for years. The human resources worker devalued some of my experience in a very condescending tone along with the fact that I worked three jobs part-time instead of a full-time job. She ignored some of my work experience because it was part-time instead of taking into account the hours/duration to equate to full-time experience. The position required five years’ experience with one year deduction for having a degree. She told me I was not qualified and I should apply for a different job within the company or for the administrative I position. My work experience has been much more advanced and detailed than that of an administrative assistant, even taking into account just my full-time experience. I only applied for the position because jobs are hard to get around here and I recently moved back to the area. However, if she felt I was not qualified than my time should not have wasted, nor I do not think it was necessary to go over every question on the application either. I put it down. I signed it saying it was accurate. Manging an outlook calander and taking requests for scripts for doctors is well within the scope of my experience and not rocket science. I thanked her for her time and hung-up. I later called human resources and withdrew from all open positions I had applied. This is not the kind of company for which I want to work. Employees, or potential employees, should be valued from the start. Interviews are also a two-way process.", "Interview Questions": "Please tell me about your experience."}, {"date": "27 Oct 2015", "title": "Mid-level Provider Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Bassett Healthcare Network", "Interview Descriptions": "I worked with an outside recruiter, so my process was very simple. After my recruiter presented my resume to Bassett I spoke with their HR department and was granted an interview. Interview was the entire, met lots of staff. I also got a tour of the area. Overall extremely well organized interview, I was sent tons of info by Bassett before the interview to look over.", "Interview Questions": "Tell me about yourself"}, {"date": "3 Oct 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Bassett Healthcare Network", "Interview Descriptions": "The interview process was very quick. It can sometimes be difficult to navigate as an internal candidate. A strong healthcare background is needed regardless of your role. Being able to identify a link to improving the patient experience is key.  Also, it is good to have a strong personality and be able to make key decisions that impact an organization as a whole.", "Interview Questions": "What is your healthcare background?"}, {"date": "12 Aug 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bassett Healthcare Network", "Interview Descriptions": "I received a call within a couple of days of applying for this position.  The first phone call I received was from HR  The person left a message stating that they wanted to schedule a phone interview.  I had to work pretty hard to get a hold of the person that called for a little more than a week.  She set me up with an interview with someone else in the HR department.  The phone interview was very pleasant, I was told what to expect, and was told that I could call her back with any questions I might have.  A few weeks later I received requests for two other interviews in the department where I applied to work.  Those were also very pleasant interviews.  Other than the first contact, a very good experience.", "Interview Questions": "Tell me about a time when you had a conflict with a co-worker.  How did you resolve the conflict?"}, {"date": "3 Dec 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bassett Healthcare Network (Cooperstown, NY) in May 2015", "Interview Descriptions": "Phone interview first then an in person interview.  Interviewed by two assistant nurse managers, one from the medical unit and one from the surgical in patient unit.  Toured both floors.", "Interview Questions": "Why I choose to interview at bassett."}, {"date": "4 Oct 2016", "title": "Referral Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Bassett Healthcare Network (Oneonta, NY) in Apr 2015", "Interview Descriptions": "Tough interview, two women in the room kind of making it hard to answer the questions they were asking me. By the end of the interview everyone was smiling and it turned out to be fine. I did not accept their offer.", "Interview Questions": "Why do you want to be the referral coordinator and what makes you capable of fulfilling this position,"}], [{"date": "24 Oct 2015", "title": "Psychiatric Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Bassett Healthcare Network (Cooperstown, NY) in Feb 2015", "Interview Descriptions": "I sent my resume. A recruiter called told me about the area. I had a phone interview with the Chief of Psychiatry. The hospital paid for me to come there for two nights. Full day of interviewing with various doctors, administrators, and NPs.", "Interview Questions": "My experience. "}, {"date": "4 Dec 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Bassett Healthcare Network (Cooperstown, NY)", "Interview Descriptions": "I interviewed with the HR department 6 times. Their human resources is extremely rude and hiring process is unbelievably drawn out.  From my first interview to my final paperwork was nearly 6 MONTHS!", "Interview Questions": "Basic interview questions "}, {"date": "3 Oct 2014", "title": "Administrative Assistant I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bassett Healthcare Network (Cooperstown, NY) in Nov 2012", "Interview Descriptions": "Applied on-line, got called for an interview.  Jobs was for Herkimer, but interviewed in Cooperstown.  Interviewed with two different women.  They asked many questions and were very professional.  If I had gotten the position would have had to train for one month in Cooperstown.", "Interview Questions": "What was the most difficult situation you have had to handle and how did you overcome it"}, {"date": "30 Dec 2013", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bassett Healthcare Network (Cooperstown, NY) in Nov 2011", "Interview Descriptions": "They call you for an interview and arrange things over the phone to meet up for a face to face interview-usually with a couple of different floors. You come up, meet the managers and if you are hired they notify you by phone.", "Interview Questions": "N/A"}]]