[[{"date": "9 May 2023", "title": "Production Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in May 2022", "Interview Descriptions": "After a short phone conversation I was brought in to interview with two staff members. They asked some of the standard questions and we ended up having a robust conversation around the department, their expectations, and challenges for the coming year. It was relaxed and a good experience.", "Interview Questions": "Describe a time that you improved the operations of a company or production."}, {"date": "28 Apr 2022", "title": "Fashion Visual Arts Team Member  Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Columbia College Chicago", "Interview Descriptions": "Describing examples of past visual merchandising experience. Asked what you could bring to the role or contribute as a teammate. The interview was done on zoom, and the process was fairly easy. ", "Interview Questions": "What is your experience with visual merchandising "}, {"date": "22 Feb 2022", "title": "Architerural Designer Student Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Columbia College Chicago", "Interview Descriptions": "The interview was very relaxed and not tense at all. The interviewer was nice and made me feel very comfortable. It was my first interview ever and I was nervous but the interview went more like a conversation", "Interview Questions": "what are your straights?\r\nwhat are your weaknesses?\r\nHow do you prioritize your tasks?\r\nHave you made any mistakes that compromised someone else? \r\n"}, {"date": "24 Feb 2021", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Columbia College Chicago in Feb 2021", "Interview Descriptions": "Initial phone call\nAn hour-long interview with team members\nThen, an hour-long third interview with the department and several professors.\nI received no response from the university for two weeks. I finally emailed them to ask for a status update, and received a generic cut-paste rejection email.", "Interview Questions": "How do you see the future of higher education?"}, {"date": "7 Aug 2020", "title": "Recorder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Columbia College Chicago", "Interview Descriptions": "The interview process overall went very quickly.  Once I submitted my resume,  I received a phone call shortly after, and an interview was set up with the actual interviewer.  During the phone call, a lot of the detail surrounding the position was discussed ahead of time which allowed me the ability to think about the job and a number of questions I could ask during the interview.  It was very organized and had an easy flow.", "Interview Questions": "Very good questions relating to the position as to what I had mentioned in my resume, and also what I could bring to the job.  They had a project they were working on and thought some of the experience would benefit their team."}, {"date": "9 Oct 2019", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Columbia College Chicago", "Interview Descriptions": "The interview process was pretty average. The response time was nice and quick. The people there were all very nice, and made the interview process enjoyable. They were very informative, leaving me with almost little to know questions about company culture/the work done there.", "Interview Questions": "Do you have experience being a mentor to someone? "}, {"date": "27 Jun 2019", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Columbia College Chicago", "Interview Descriptions": "Quick interview process. There was a phone interview. There was a in person interview with team members. Then a final interview with manager. The process was easy and a seamless process. It helps to know people who already work there.", "Interview Questions": "Talk about your experience"}, {"date": "13 Jul 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Columbia College Chicago (Chicago, IL) in Apr 2019", "Interview Descriptions": "The interview was very informal and approachable. It really ended up flowing more like a conversation about my interests and history in the department and at Columbia. I would have stayed longer to chat with the man who was hiring but someone else was in line behind me for their interview.", "Interview Questions": "What is my experience and comfort level with the medium?"}, {"date": "3 Jan 2019", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Dec 2018", "Interview Descriptions": "First was phone interview, then met in person two members of the department, & felt positive after leaving.  Got a call a week later that they wanted me to come in again to meet head of the department and other important faculty members.  I met one new member of the department who cut me off after answering her questions and put me down after reading my experience & background.  When that woman walked me back to my main interviewer she ignored me as I said thank you so much, nice meeting you.  \nThey said they would let me know if it would move forward or not by the next week & no call at all. \nSo unprofessional & rude I should not have wasted my time & effort.", "Interview Questions": "Why do you want to work at Columbia"}, {"date": "29 Jun 2021", "title": "Resident Assistant (RA) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Columbia College Chicago in Nov 2018", "Interview Descriptions": "Prior to applying you must attend and informational session discussing the job.\r\nApply online.\r\nHave a group interview where you interact with the other candidates in a series of tasks like building a tower out of marshmallows and spaghetti but each person has a specific role.\r\nAfter the group interview you will have a personal interview with a current RA and one of the professional staff.\r\nYou will hear back from them in a couple of months since they hire a year prior to the job", "Interview Questions": "What was a time that you overcame a difficult situation regarding a co-worker / teammate."}], [{"date": "18 Oct 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Oct 2018", "Interview Descriptions": "Primarily focused on my learning more about my background, the goals I would like to achieve within the office if hired, and the importance of diversity of inclusion in my life.", "Interview Questions": "What is the significance of diversity and inclusion within your own life?"}, {"date": "30 Jun 2021", "title": "Site Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Oct 2018", "Interview Descriptions": "I initially received a phone interview. This was followed by a in person interview.  I called back a couple of days after the phone interview and was offered the job.", "Interview Questions": "What is your greatest weekness?"}, {"date": "21 Aug 2017", "title": "Creative Writing Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Columbia College Chicago", "Interview Descriptions": "No interview process, you just have to get A's in all your core Creative Writing classes and apply. It's pretty easy to get into and the professors are always looking to hire new tutors. (At least, they were when I was there.) As long as you work hard and show your professors that you're a good student and writer, you'll probably get in.", "Interview Questions": "There were no interview questions. "}, {"date": "16 Jun 2019", "title": "Maintenance Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Mar 2017", "Interview Descriptions": "Had 2 interviews with a 3 person panel of Dept. managers. Very relaxed, well-informed questions. Good concise information about the college and what was expected from the job. No HR people involved in the initial interviews.", "Interview Questions": "Give an example of a time in your previous employment when you resolved a conflict."}, {"date": "20 Apr 2017", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Columbia College Chicago (Chicago, IL) in Feb 2017", "Interview Descriptions": "Phone interview phase - Generally ask you a lot of questions about your skillset and what you're looking for in a company. I was asked a lot of scenario questions related to students, in an in-person interview easy to talk about, over the phone hard to get a sense of if the person on the other end's relating to your explanation of the question.", "Interview Questions": "What are you looking for in the Columbia culture?"}, {"date": "6 Apr 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Columbia College Chicago (Chicago, IL) in Oct 2014", "Interview Descriptions": "I got a phone call asking if I would like the job. I talked with the supervisor for a little while as she explained the job and the job hiring process.", "Interview Questions": "Do you want this job"}, {"date": "19 Apr 2018", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Aug 2014", "Interview Descriptions": "Apply online; meet within few weeks; start as soon as the very next week; lenient requirements, so many apply and are hired; one on one interview with your immediate supervisor, thoroughly discusses and lays out requirements, very accommodating in gauging your availability and helping meet with you on making the position achievable", "Interview Questions": "How much experience do you have with customer service?"}, {"date": "23 Sept 2013", "title": "Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Columbia College Chicago (Chicago, IL)", "Interview Descriptions": "Practices have changed and my hiring and interview process is now out of date. It was fair and inclusive. The hiring manager carefully sought a good-fit with the position's clients.", "Interview Questions": "There were no difficult or unexpected questions. "}, {"date": "5 Sept 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Columbia College Chicago in Nov 2012", "Interview Descriptions": "One phone interview. One in-person interview with the hiring manager and team. And a second interview with the department head. Very casual. Most of the team was out and that didn't seem to affect the decision.", "Interview Questions": "What's your favorite musician (not a music-related job)"}, {"date": "11 Sept 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Columbia College Chicago (Chicago, IL) in Sept 2012", "Interview Descriptions": "Sat one on one with the Coordinator of Operations, who made me feel very comfortable and a memorable personality filled with kindness and professionalism. She introduced me to other directors and was very organized with her questions she wanted to ask me.", "Interview Questions": "What kind of hours are you looking for?\r\nWhy do I want to work for the LS?\r\nHow do you handle difficult people?\r\n"}], [{"date": "15 Jul 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Columbia College Chicago in Jun 2012", "Interview Descriptions": "The interview process was very informal.  I sat down with the person who would be my direct supervisor and his counterpart.  It was really just a discussion of what I've done in my career.  Later I was called in to meet with the direct supervisor and his supervisor.  Again, the same thing.  I was offered the job a few weeks later.", "Interview Questions": "They didn't seem very well versed in interviewing techniques and didn't ask any really thought provoking questions in the interview.  There were no unexpected questions.  "}, {"date": "2 Dec 2014", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Columbia College Chicago in Apr 2012", "Interview Descriptions": "Basic Interview\r\nAll student workers get a set hourly wage at the same rate. \r\nDepending on area of department, it may be a software test which is super easy.\r\nYou dont get hired, you may be asked back to work during finals so don't feel as if all is lost.", "Interview Questions": "There really wasn't any difficult questions and all software tests are based on the basics."}, {"date": "11 Oct 2015", "title": "Computer Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Dec 2011", "Interview Descriptions": "I was sat down in an office and my experience was questioned by multiple people who were managers. They were fairly nice and it seemed like they'd already decided they were going to hire me before the interview even started. The application had all the relevant questions, the interview was mostly to guage my personality and character to make sure I was a fit as they already knew my skills.", "Interview Questions": "Why do you want this job?"}, {"date": "23 Jul 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Aug 2011", "Interview Descriptions": "One on one with the person in the department who did the hiring and also the person who did the class scheduling.Then they told me what I would be teaching and I said, \"ok, thanks!\"", "Interview Questions": "Experience in teaching? \r\nApproach to teaching?"}, {"date": "17 Jul 2012", "title": "Adjunct Faculty - FIlm & Video Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Columbia College Chicago (Chicago, IL) in Jan 2011", "Interview Descriptions": "The school has made the shift to hiring only individuals with a Master's Degree or better. Their preference is for experience, whether through local industry opportunities or from the national level. Typically, you must meet with a department leader, then a committee, then another individual higher up, and possibly make a presentation to a class and yet another committee.", "Interview Questions": "This can depend upon who is on your committee, but the most difficult typically has to do with dealing with students who can be extremely difficult for any number and variety of personal reasons. "}, {"date": "6 Mar 2014", "title": "Junior Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at Columbia College Chicago (Chicago, IL) in Jun 2010", "Interview Descriptions": "The people there were easy to communicate with making the work there easier to do the work that was required.", "Interview Questions": "What is your asking price range for salary?"}, {"date": "21 Sept 2014", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Apr 2010", "Interview Descriptions": "I was initially scouted by a full time faculty member. I was hired on his recommendation only. After one semester all adjunct faculty go through an evaluation process. This involves a review of syllabus and all course materials.  It also includes an in class observation by a full time faculty member. Finally there is a meeting with the chair of the department.", "Interview Questions": "Nothing really."}, {"date": "25 Jul 2013", "title": "Chair, Theatre Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Columbia College Chicago (Chicago, IL) in Dec 2009", "Interview Descriptions": "Phone then on line video (preSkype)", "Interview Questions": "WHat majors would you cut in the program?"}, {"date": "24 Jul 2011", "title": "Library Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Columbia College Chicago (Chicago, IL) in Sept 2009", "Interview Descriptions": "-Called a week after applying online\r\n-Said she had space but schedule must agree with position\r\n-Met in office for 1:1 \r\n-Was hired on the spot\r\n-Classes had to agree with time needed\r\n-Showed me around the library \r\n-Met with staff and learned all the ins and outs of both buildings \r\n-Also went through the system that was used to do daily work \r\n-Have to show some knowledge of windows and mac version computers in order to help students", "Interview Questions": "What are some of the things that have helped you when you have encountered a difficult situation at work?"}, {"date": "3 Feb 2011", "title": "Modelshop Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Columbia College Chicago (New York, NY) in Jan 2009", "Interview Descriptions": "\"How would you handle confrontations?\"\r\n\"Please describe one occasion when you took leadership.\"", "Interview Questions": "Please explain how \"        \" [engineering term] works."}]][[{"date": "9 May 2023", "title": "Production Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in May 2022", "Interview Descriptions": "After a short phone conversation I was brought in to interview with two staff members. They asked some of the standard questions and we ended up having a robust conversation around the department, their expectations, and challenges for the coming year. It was relaxed and a good experience.", "Interview Questions": "Describe a time that you improved the operations of a company or production."}, {"date": "28 Apr 2022", "title": "Fashion Visual Arts Team Member  Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Columbia College Chicago", "Interview Descriptions": "Describing examples of past visual merchandising experience. Asked what you could bring to the role or contribute as a teammate. The interview was done on zoom, and the process was fairly easy. ", "Interview Questions": "What is your experience with visual merchandising "}, {"date": "22 Feb 2022", "title": "Architerural Designer Student Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Columbia College Chicago", "Interview Descriptions": "The interview was very relaxed and not tense at all. The interviewer was nice and made me feel very comfortable. It was my first interview ever and I was nervous but the interview went more like a conversation", "Interview Questions": "what are your straights?\r\nwhat are your weaknesses?\r\nHow do you prioritize your tasks?\r\nHave you made any mistakes that compromised someone else? \r\n"}, {"date": "24 Feb 2021", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Columbia College Chicago in Feb 2021", "Interview Descriptions": "Initial phone call\nAn hour-long interview with team members\nThen, an hour-long third interview with the department and several professors.\nI received no response from the university for two weeks. I finally emailed them to ask for a status update, and received a generic cut-paste rejection email.", "Interview Questions": "How do you see the future of higher education?"}, {"date": "7 Aug 2020", "title": "Recorder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Columbia College Chicago", "Interview Descriptions": "The interview process overall went very quickly.  Once I submitted my resume,  I received a phone call shortly after, and an interview was set up with the actual interviewer.  During the phone call, a lot of the detail surrounding the position was discussed ahead of time which allowed me the ability to think about the job and a number of questions I could ask during the interview.  It was very organized and had an easy flow.", "Interview Questions": "Very good questions relating to the position as to what I had mentioned in my resume, and also what I could bring to the job.  They had a project they were working on and thought some of the experience would benefit their team."}, {"date": "9 Oct 2019", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Columbia College Chicago", "Interview Descriptions": "The interview process was pretty average. The response time was nice and quick. The people there were all very nice, and made the interview process enjoyable. They were very informative, leaving me with almost little to know questions about company culture/the work done there.", "Interview Questions": "Do you have experience being a mentor to someone? "}, {"date": "27 Jun 2019", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Columbia College Chicago", "Interview Descriptions": "Quick interview process. There was a phone interview. There was a in person interview with team members. Then a final interview with manager. The process was easy and a seamless process. It helps to know people who already work there.", "Interview Questions": "Talk about your experience"}, {"date": "13 Jul 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Columbia College Chicago (Chicago, IL) in Apr 2019", "Interview Descriptions": "The interview was very informal and approachable. It really ended up flowing more like a conversation about my interests and history in the department and at Columbia. I would have stayed longer to chat with the man who was hiring but someone else was in line behind me for their interview.", "Interview Questions": "What is my experience and comfort level with the medium?"}, {"date": "3 Jan 2019", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Dec 2018", "Interview Descriptions": "First was phone interview, then met in person two members of the department, & felt positive after leaving.  Got a call a week later that they wanted me to come in again to meet head of the department and other important faculty members.  I met one new member of the department who cut me off after answering her questions and put me down after reading my experience & background.  When that woman walked me back to my main interviewer she ignored me as I said thank you so much, nice meeting you.  \nThey said they would let me know if it would move forward or not by the next week & no call at all. \nSo unprofessional & rude I should not have wasted my time & effort.", "Interview Questions": "Why do you want to work at Columbia"}, {"date": "29 Jun 2021", "title": "Resident Assistant (RA) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Columbia College Chicago in Nov 2018", "Interview Descriptions": "Prior to applying you must attend and informational session discussing the job.\r\nApply online.\r\nHave a group interview where you interact with the other candidates in a series of tasks like building a tower out of marshmallows and spaghetti but each person has a specific role.\r\nAfter the group interview you will have a personal interview with a current RA and one of the professional staff.\r\nYou will hear back from them in a couple of months since they hire a year prior to the job", "Interview Questions": "What was a time that you overcame a difficult situation regarding a co-worker / teammate."}], [{"date": "18 Oct 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Oct 2018", "Interview Descriptions": "Primarily focused on my learning more about my background, the goals I would like to achieve within the office if hired, and the importance of diversity of inclusion in my life.", "Interview Questions": "What is the significance of diversity and inclusion within your own life?"}, {"date": "30 Jun 2021", "title": "Site Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Oct 2018", "Interview Descriptions": "I initially received a phone interview. This was followed by a in person interview.  I called back a couple of days after the phone interview and was offered the job.", "Interview Questions": "What is your greatest weekness?"}, {"date": "21 Aug 2017", "title": "Creative Writing Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Columbia College Chicago", "Interview Descriptions": "No interview process, you just have to get A's in all your core Creative Writing classes and apply. It's pretty easy to get into and the professors are always looking to hire new tutors. (At least, they were when I was there.) As long as you work hard and show your professors that you're a good student and writer, you'll probably get in.", "Interview Questions": "There were no interview questions. "}, {"date": "16 Jun 2019", "title": "Maintenance Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Mar 2017", "Interview Descriptions": "Had 2 interviews with a 3 person panel of Dept. managers. Very relaxed, well-informed questions. Good concise information about the college and what was expected from the job. No HR people involved in the initial interviews.", "Interview Questions": "Give an example of a time in your previous employment when you resolved a conflict."}, {"date": "20 Apr 2017", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Columbia College Chicago (Chicago, IL) in Feb 2017", "Interview Descriptions": "Phone interview phase - Generally ask you a lot of questions about your skillset and what you're looking for in a company. I was asked a lot of scenario questions related to students, in an in-person interview easy to talk about, over the phone hard to get a sense of if the person on the other end's relating to your explanation of the question.", "Interview Questions": "What are you looking for in the Columbia culture?"}, {"date": "6 Apr 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Columbia College Chicago (Chicago, IL) in Oct 2014", "Interview Descriptions": "I got a phone call asking if I would like the job. I talked with the supervisor for a little while as she explained the job and the job hiring process.", "Interview Questions": "Do you want this job"}, {"date": "19 Apr 2018", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Aug 2014", "Interview Descriptions": "Apply online; meet within few weeks; start as soon as the very next week; lenient requirements, so many apply and are hired; one on one interview with your immediate supervisor, thoroughly discusses and lays out requirements, very accommodating in gauging your availability and helping meet with you on making the position achievable", "Interview Questions": "How much experience do you have with customer service?"}, {"date": "23 Sept 2013", "title": "Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Columbia College Chicago (Chicago, IL)", "Interview Descriptions": "Practices have changed and my hiring and interview process is now out of date. It was fair and inclusive. The hiring manager carefully sought a good-fit with the position's clients.", "Interview Questions": "There were no difficult or unexpected questions. "}, {"date": "5 Sept 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Columbia College Chicago in Nov 2012", "Interview Descriptions": "One phone interview. One in-person interview with the hiring manager and team. And a second interview with the department head. Very casual. Most of the team was out and that didn't seem to affect the decision.", "Interview Questions": "What's your favorite musician (not a music-related job)"}, {"date": "11 Sept 2015", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Columbia College Chicago (Chicago, IL) in Sept 2012", "Interview Descriptions": "Sat one on one with the Coordinator of Operations, who made me feel very comfortable and a memorable personality filled with kindness and professionalism. She introduced me to other directors and was very organized with her questions she wanted to ask me.", "Interview Questions": "What kind of hours are you looking for?\r\nWhy do I want to work for the LS?\r\nHow do you handle difficult people?\r\n"}], [{"date": "15 Jul 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Columbia College Chicago in Jun 2012", "Interview Descriptions": "The interview process was very informal.  I sat down with the person who would be my direct supervisor and his counterpart.  It was really just a discussion of what I've done in my career.  Later I was called in to meet with the direct supervisor and his supervisor.  Again, the same thing.  I was offered the job a few weeks later.", "Interview Questions": "They didn't seem very well versed in interviewing techniques and didn't ask any really thought provoking questions in the interview.  There were no unexpected questions.  "}, {"date": "2 Dec 2014", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Columbia College Chicago in Apr 2012", "Interview Descriptions": "Basic Interview\r\nAll student workers get a set hourly wage at the same rate. \r\nDepending on area of department, it may be a software test which is super easy.\r\nYou dont get hired, you may be asked back to work during finals so don't feel as if all is lost.", "Interview Questions": "There really wasn't any difficult questions and all software tests are based on the basics."}, {"date": "11 Oct 2015", "title": "Computer Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Dec 2011", "Interview Descriptions": "I was sat down in an office and my experience was questioned by multiple people who were managers. They were fairly nice and it seemed like they'd already decided they were going to hire me before the interview even started. The application had all the relevant questions, the interview was mostly to guage my personality and character to make sure I was a fit as they already knew my skills.", "Interview Questions": "Why do you want this job?"}, {"date": "23 Jul 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Aug 2011", "Interview Descriptions": "One on one with the person in the department who did the hiring and also the person who did the class scheduling.Then they told me what I would be teaching and I said, \"ok, thanks!\"", "Interview Questions": "Experience in teaching? \r\nApproach to teaching?"}, {"date": "17 Jul 2012", "title": "Adjunct Faculty - FIlm & Video Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Columbia College Chicago (Chicago, IL) in Jan 2011", "Interview Descriptions": "The school has made the shift to hiring only individuals with a Master's Degree or better. Their preference is for experience, whether through local industry opportunities or from the national level. Typically, you must meet with a department leader, then a committee, then another individual higher up, and possibly make a presentation to a class and yet another committee.", "Interview Questions": "This can depend upon who is on your committee, but the most difficult typically has to do with dealing with students who can be extremely difficult for any number and variety of personal reasons. "}, {"date": "6 Mar 2014", "title": "Junior Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1+ week. I interviewed at Columbia College Chicago (Chicago, IL) in Jun 2010", "Interview Descriptions": "The people there were easy to communicate with making the work there easier to do the work that was required.", "Interview Questions": "What is your asking price range for salary?"}, {"date": "21 Sept 2014", "title": "Adjunct Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Columbia College Chicago (Chicago, IL) in Apr 2010", "Interview Descriptions": "I was initially scouted by a full time faculty member. I was hired on his recommendation only. After one semester all adjunct faculty go through an evaluation process. This involves a review of syllabus and all course materials.  It also includes an in class observation by a full time faculty member. Finally there is a meeting with the chair of the department.", "Interview Questions": "Nothing really."}, {"date": "25 Jul 2013", "title": "Chair, Theatre Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Columbia College Chicago (Chicago, IL) in Dec 2009", "Interview Descriptions": "Phone then on line video (preSkype)", "Interview Questions": "WHat majors would you cut in the program?"}, {"date": "24 Jul 2011", "title": "Library Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Columbia College Chicago (Chicago, IL) in Sept 2009", "Interview Descriptions": "-Called a week after applying online\r\n-Said she had space but schedule must agree with position\r\n-Met in office for 1:1 \r\n-Was hired on the spot\r\n-Classes had to agree with time needed\r\n-Showed me around the library \r\n-Met with staff and learned all the ins and outs of both buildings \r\n-Also went through the system that was used to do daily work \r\n-Have to show some knowledge of windows and mac version computers in order to help students", "Interview Questions": "What are some of the things that have helped you when you have encountered a difficult situation at work?"}, {"date": "3 Feb 2011", "title": "Modelshop Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Columbia College Chicago (New York, NY) in Jan 2009", "Interview Descriptions": "\"How would you handle confrontations?\"\r\n\"Please describe one occasion when you took leadership.\"", "Interview Questions": "Please explain how \"        \" [engineering term] works."}]]