[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Flexible employer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jun 2021", "job_title": "Admissions Counselor in Hartsville, SC", "duration": "N/A", "pros": "Flexible employer. Great company to work for", "cons": "Great company, but low pay and little room for growth"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Wonderful people, worrying direction", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Jul 2022", "job_title": "Head Coach in Hartsville, SC", "duration": "N/A", "pros": "- people are awesome to work with\n- University for the most part cares about students\n- Beautiful Campus", "cons": "- Removal and Constant change of majors\n- Expensive tuition cost\n- Poor communication\n- A lot of Double standards \n- Some Leadership yell at employees when they bring up criticisms"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "27 Feb 2022", "job_title": "Professor of Computer Science in Hartsville, SC", "duration": "N/A", "pros": "It's traditional liberal art college, setting beneath the blue of southern sky.", "cons": "It is slowly transitioning to a professional training school, if that's not the direction you would want, of course."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Elitist", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "23 Jan 2022", "job_title": "Assistant Professor in Hartsville, SC", "duration": "N/A", "pros": "For white smart students that are looking for a prep school, Coker will fit the bill.", "cons": "Coker blind to the needs of the community surrounding the school."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "Changes are on the horizon", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Sept 2021", "job_title": "Assistant Professor in Hartsville, SC", "duration": "N/A", "pros": "Great colleagues - tight-knit community. Beautiful, small campus.", "cons": "Facilities need repair, many first-generation students, budget cuts."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Poor management and lack of support", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Jul 2021", "job_title": "Professor in North Hartsville, SC", "duration": "N/A", "pros": "Independence and no micromanaging. Beautiful campus", "cons": "Lack of communication, pay cuts, lack of care of employees"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Working at Coker is a very laid-back and comfortable work experience.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Feb 2012", "job_title": " in Hartsville, SC", "duration": "N/A", "pros": "Your fellow coworkers are all very friendly people.  It is clear that people are willing to work together here at Coker.  The leadership of the College is fantastic.  They may not be loved by all, but they are making the difficult decisions necessary to improve the institution (not that it needs a lot of improvement, but everyplace has room to grow).  Most supervisors here at Coker are very understanding of time-off needs, and are very flexible with employees.  Part of the College atmosphere is that it is laid-back and accommodating, that is true for students and most employees at Coker.  The time-off you get working here as staff is fantastic (2 weeks around Christmas of paid time off, not vacation days).", "cons": "Overall, the compensation is slightly low, even compared to the industry.  It is livable and fair, but low.  Like any small institution, there is a lot of workplace gossip.  Additionally, there are a few folks who are very verbal about not liking other people, which builds some tension between departments.  If you can stay out of that stuff, it just becomes entertainment.  There aren't many opportunities to advance, or increase your pay.  It is not like the private business industry - you don't have the option to get rich.  Those are trade-offs that college employees make, however."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Toxic Environment", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Sept 2019", "job_title": "Anonymous Employee in Hartsville, SC", "duration": "N/A", "pros": "There are some good people on campus, if you look in the right places. Working with students is a joy, and you have the opportunity to make a real difference in their lives.", "cons": "Leadership and senior administration is, with few exceptions, filled with corruption and toxic management based in fear. Things are not done for the good of the campus, the students, or the employees. They are done for the budget, the satisfaction of a few top donors to the college, and higher-ups' egos. Decisions regarding hiring, firing, and promotions often make no business sense and damage morale. I have seen people receive staff appreciation awards from administration in the fall and then be fired in the spring without notice. Multiple skilled and well liked staff members have been fired without cause. Announcements that affect individual departments and employees have been announced publicly at staff meetings or via email before the staffers involved were even notified. Coker is not a safe place to build your career, or a healthy workplace culture to spend your time in. If you live in Hartsville to start with, it may be worth taking a job at Coker University if you  really need it, but definitely don't make any major moves or commitments to work there. Even if you are a loyal employee, the favor will not be returned. Most members of Coker's admin team only care about their own image, not about their employees and not about doing the right thing."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Coker College is a great place to work. The college staff is ready and available to assist in areas of need.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Nov 2014", "job_title": "Housekeeper in Hartsville, SC", "duration": "N/A", "pros": "Time off has to be done in a fie day notice if possible. The holidays vary and comply with the college. The benefits are getting better.", "cons": "The college has plans for furthering sports such as football. The class room space can be better."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Exploitative", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Jan 2020", "job_title": "Athletics in Hartsville, SC", "duration": "N/A", "pros": "Students and a select few co-workers", "cons": "Career Opportunities - Almost non-existent. There are very few levels of hierarchy to allow for advancement. Even if you wanted to move up, you probably won't be there long enough to actually move up. Coker is used as a stepping stone to 'real' jobs which means turnover is never-ending. They'll tell you that turnover is as bad as it is at other DII schools, but that's just a lie they tell themselves.\r\n\r\nCompensation & Benefits - An absolute, total joke. Nearly everyone in athletics is woefully underpaid. Coaches have to wear 10 different hats, and are only recognized when they make a mistake. And trust me, your mistakes will be recognized. The entire department will hear about them. Everyone in the department is also expected to volunteer their free time to help with facilities work  such as setting up the gym for various Coker and non-Coker events. This happens 20-40 times a year and is work that should be completed by actual facilities professionals, trained with doing this work efficiently and safely, but instead is left to the coaches and admin staff. \r\n\r\nAlso, coaches are expected to be unpaid volunteers to staff all Coker athletics home games. You may have to run a shot clock for a sport you have no familiarity with, or keep a score book, or help on the broadcast or even keep live stats. This involves you giving up your entire weekend, oftentimes without proper prior notice. If you were to somehow refuse or have plans you can't get out of, you'll be considered someone that isn't a team player and will be subject to the ire of the athletic director.\r\n\r\nThere's also a spoken culture of giving at the institution where higher ups believe that if you don't actively donate large sums of money to the institution then you aren't properly invested in it. People actively look at a spreadsheet to see how much money the employees are donating.\r\n\r\nWork/Life balance - This is completely non-existent at Coker. Not just in athletics, but throughout the institution. 60-80 work weeks are the norm even for admin staff, not just coaches. Nobody has made the connection that maybe the ridiculous turnover rate is related to overworked and under-appreciated staff.\r\n\r\nIf you're unlucky enough to be a graduate assistant in the athletics department you should know that the department will make literally zero allowances for the fact that you're also taking classes towards a degree. You're expected to do that during the 4-6 hours they've allotted for you to sleep. However, sleeping won't be easy, because you probably have four roommates in a 2 bedroom apartment because $600-$900 a month can only go so far.\r\n\r\nSenior management - Ugh. I just don't know where to begin. Just like everyone else, senior management is also extremely overworked. They have their hands in literally every sport, and they also give up their weekends and help with all of the facilities work. However, they are the ones in charge. They've created this toxic atmosphere, and every day make choices that allow their staff to be taken advantage of. They control the budgets, the operations, the strategies, and directly impact the morale. What they're doing isn't working, and if they know that already, they haven't showed any signs of changing it."}], [{"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Good Place to Work, but Needs Leadership", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Apr 2020", "job_title": "Anonymous Employee in Hartsville, SC", "duration": "N/A", "pros": "Great working environment\r\nLots of opportunity to have your voice heard\r\nIntellectually stimulating environment", "cons": "Lack of leadership and follow-through\r\nDepartments in silos causes lack of communication resulting in occasional problems."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good school in good community", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Oct 2020", "job_title": "Adjunct Professor in Greenville, SC", "duration": "N/A", "pros": "Great family feel at school.", "cons": "Down is very small and has a “fishbowl” effect."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "good", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Apr 2012", "job_title": " in Tampa, FL", "duration": "N/A", "pros": "Good place to work fun", "cons": "lame place to work dude"}]]