[[{"date": "20 Mar 2023", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Aiken Regional Medical Centers (Aiken, SC)", "Interview Descriptions": "Very professional I personally had 2 interview before I was hired. The hr department employees was nice,professional which makes the experience nice. They had 25 or more candidates show up for different jobs.", "Interview Questions": "The asked me questions based off my resume"}, {"date": "12 Mar 2023", "title": "MHT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Aiken Regional Medical Centers in Mar 2023", "Interview Descriptions": "The interview process was nice. It was more of a conversation and a few questions about your experiences in handling angry patients/clients. The nurses doing the Interview were both very sweet and explained anything I had a question about.", "Interview Questions": "Q: Name a time where you had to deal with a difficult patient/client and what did you do to make things better? Q: What is your overall goal for your career?"}, {"date": "14 Jul 2022", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Aiken Regional Medical Centers", "Interview Descriptions": "In person interview with Human Resources  and department head included tour of campus and nursing units. Plenty of time for questions. Salary and incentives available for the right candidate. Stars for the healthcare industry currently.", "Interview Questions": "Employment history and salary guidelines "}, {"date": "15 Feb 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Aiken Regional Medical Centers (Aiken, SC) in Oct 2021", "Interview Descriptions": "Interview Manager, was late connecting to the video interview, did not connect on webcam, seemed they were pre-occupied with email or texting as they delayed talking with me, and the questions, I sensed were bland, they lacked real character", "Interview Questions": "Why I wanted to work there. "}, {"date": "3 Nov 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Aiken Regional Medical Centers (Aiken, SC) in Sept 2021", "Interview Descriptions": "The process was laid back and more like a conversation then a professional interview. I was only asked two questions and answered appropriatly . It lasted about 10 minutes in length.", "Interview Questions": "Why did I want to work at that specific hospital?\nWhat were my future goals as a nurse."}, {"date": "4 Feb 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Aiken Regional Medical Centers in Jan 2021", "Interview Descriptions": "Very smooth, asked great questions. Interviewer was able to answer all of my questions effectively. Went great! Looking forward to my second interview that will be in a few days.", "Interview Questions": "What was a time that you used critical thinking?"}, {"date": "15 Oct 2020", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Aiken Regional Medical Centers", "Interview Descriptions": "ask me good questions that really made me think that they cared about the employee I will be.  Very nice interviewers.  Would recommend applying here.  Idk what else to put im just typing this so I can view this website", "Interview Questions": "Where do you see yourself in five years"}, {"date": "14 Feb 2020", "title": "Certified Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Aiken Regional Medical Centers (Aiken, SC) in Nov 2019", "Interview Descriptions": "While trying to get you in the door,  everyone is super nice. There is a phone interview first with HR. Next interview is face to face with HR and the lab director separately,  but the same day. Then an appointment for your drug screen and physical.  After that is your offer email and three days of orientation.", "Interview Questions": "What do you know about what we do?"}, {"date": "12 May 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Aiken Regional Medical Centers (Aiken, SC) in Jun 2018", "Interview Descriptions": "I submitted an application, then i had to take a personality test, interviewed with HR, then DON. Takes about a month. Be persistent as there have been quite a few changes in HR", "Interview Questions": "There are a lot of scenario type questions."}, {"date": "30 Oct 2013", "title": "Medical Transcriptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Aiken Regional Medical Centers", "Interview Descriptions": "The hiring process went as well as any other.  I interviewed with the director and also spoke with several employees of the department. He took me to the conference room and brought in a few employees at a time.  I sat and talked with several of them and they asked me about myself and we just talked.  I felt good about the interview afterward.  I felt like I would fit in well in this department.", "Interview Questions": "It has been a while and I really do not remember many of the questions asked of me during the interview itself.  It was uncomfortable being asked what salary I was looking for.  I guess I was hoping they would offer me a number first and then I would be able to negotiate from there.  I assume they checked out my background and previous employers first because I was not really required to take a typing test or any other type of tests. "}], [{"date": "3 Jul 2011", "title": "Teaching Position Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Aiken Regional Medical Centers (Aiken, SC) in Jun 2011", "Interview Descriptions": "It was a 2 hour interview.  talked more about the changes in healthcare and what the students need to know in the future to succeed.", "Interview Questions": "N/A"}]]