[[{"date": "23 Jan 2023", "title": "Business Process Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Penn Foster, Inc", "Interview Descriptions": "The interview process was pretty typical. First, there was an interview with HR with basic questions. Then, there was an interview with the hiring manager and I was asked standard scenario questions and about previous projects I have worked on. Everyone was polite throughout the process.", "Interview Questions": "Tell me about a project that you helped lead."}, {"date": "28 Aug 2022", "title": "SEO Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Penn Foster, Inc", "Interview Descriptions": "Phone interview with recruiting then virtual interview with manager.  They seemed to be looking for something very specific.  In my case, it seemed like we were mutually uninterested. Seems to be a very sterile, academic environment.", "Interview Questions": "What is your experience with SEO?"}, {"date": "19 May 2022", "title": "Client Success Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Foster, Inc", "Interview Descriptions": "Series of 30-minute interviews with various team members. The interview style varied a lot but all were very general. Many of the same questions are asked by different people. I felt unclear about the position throughout the process. I never really gained clarity about what the job entailed and who I would be working with because I talked to so many different people from different parts of the company. When I was declined an offer, I asked for feedback and did not receive any.", "Interview Questions": "What's your familiarity with Excel? What's a tool you can't live without? What does client success mean to you?"}, {"date": "17 Apr 2022", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Penn Foster, Inc in Feb 2022", "Interview Descriptions": "The process was incredibly drawn out, due to an organizational change (?) I had to request feedback and follow up after every interview. After my final interview, the job was being moved to a different manager, so this further delayed the process by two additional weeks. The manager reached out to alert me that the original salary that I was told was incorrect and that I would be offered $12k less than my salary requirement.  A complete and utter waste of my time and energy.", "Interview Questions": "Describe your background and why you are interested in Penn Foster? "}, {"date": "4 Dec 2021", "title": "Student Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Foster, Inc (Greenville, SC) in Nov 2021", "Interview Descriptions": "This is a continuation of past interview already posted on here for the Student Advocate position. Continuing on... After scheduling a video chat interview with HR for the next business day, the video chat occurred at the time scheduled. There were two of them on the video chat. They were friendly and took turns asking questions. The interview did not last too long either. It was fewer than 30 minutes in length, maybe about 15 minutes or so. It is helpful to search interview questions in advance and write your answers out to have them already handy. It also helps to have a copy of your resume to reference. Following the interview, I received a job offer via email in under 24 hours as well as the paperwork for the completion of a background check. The background check took less than one day, and subsequently I was emailed by HR within a few hours with the new hire paperwork to fill out and sign along with appropriate handbooks and other relevant, informative paperwork. Upon completing the requirements on my end, I was informed of a future shipment to be arriving for me via mail (I believe possibly a \"work\" laptop or any other relevant things required to have). Upon receiving said shipment, then one would refer back to the email from HR with all the paperwork, which includes a document that specifies the setup process for the laptop. After this, you will be contacted by a couple more people to ensure you are set up prior to the first day of work. At some point during the first, second, or maybe third day, you will be required to display via video chat the documentation used for identity verification during the hiring process. And finally, the first three weeks will be training for the position. Your start date will be day 1 of said training. And your start date basically just depends on what date the next training class is started for new hires. (My start date was set for approximately 1.5-2 weeks after the background check and hiring process was completed - this time amount is needed for receiving the aforementioned shipment and getting set up properly!)", "Interview Questions": "The position includes frequent talking on the phone, so is that something you're comfortable doing?"}, {"date": "10 Jan 2022", "title": "Admission Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn Foster, Inc (Scranton, PA) in Jul 2021", "Interview Descriptions": "During my interview, I had a great conversation and interview process with the two ladies. The interview was very laid back and the conversation was able to easily flow. Both seemed to enjoy their job which is important.", "Interview Questions": "Why are you interested in the position?\nWhat are your strengths? "}, {"date": "28 Mar 2021", "title": "Director of Marketing Analytics Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1+ week. I interviewed at Penn Foster, Inc in Feb 2021", "Interview Descriptions": "Overall the experience was positive. Although I realized during the interview with the CMO that I wasn’t going to be selected. The HR person was absent for more than a week and suddenly sent an email saying he will have updates next week as they are going through the interview process. He did come back 2 days later and said they were selecting other candidates with more B2C experience. That’s fine, I felt that the email was sent just to be keep me warm as a backup candidate. Seeing that this role is still unfilled, at this time, I would suggest this company scale down the requirements. No one is going to be an expert in data science and google analytics/google tag manager and also knowledgeable about bridging multiple data sources to do reporting across multiple marketing channels. Even if someone like that exist I am pretty sure they are well compensated in much better situation and not considering employment in a smaller company. Be realistic in your expectations. Anyone claiming to know all of these is sure selling you snake oil.", "Interview Questions": "Experience in B2C channel reporting"}, {"date": "22 Mar 2021", "title": "Talent Strategist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn Foster, Inc (Providence, RI) in Feb 2021", "Interview Descriptions": "Very thorough, transparent, and comfortable with all three interviewers. They actually informed me about what each interviewer would want to understand about me. They were also very transparent about what I was demonstrated against the needs of the role and what the gaps were.", "Interview Questions": "Explained needs of the roles and asked about my thoughts and ideas or how I would handle those challenges."}, {"date": "9 Dec 2020", "title": "Admissions Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn Foster, Inc in Nov 2020", "Interview Descriptions": "The interview felt more like a sales pitch of the position and the school than an interview. Although most, if not all, interviews are now by video, this one felt the most informal.", "Interview Questions": "Do you think you would enjoy working from home?"}], [{"date": "25 Sept 2022", "title": "Admissions Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Penn Foster, Inc in Oct 2020", "Interview Descriptions": "First, I had a phone pre-interview with HR and then a virtual interview with hiring manager. I received the job offer within 10 minutes of ending the interview, which made me feel uneasy", "Interview Questions": "Do you have any sales experience?"}, {"date": "10 Jan 2023", "title": "Student Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Penn Foster, Inc (New York, NY) in Aug 2020", "Interview Descriptions": "standard interview process with the manager and team lead- extremely friendly and warm. asked the typically interview questions but felt more like a conversation about previous work experience! the next day i got a call that the job was mine.", "Interview Questions": "Can you share an example of a difficult situation that you overcame and what the outcome was?"}, {"date": "27 Nov 2019", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Penn Foster, Inc in Nov 2019", "Interview Descriptions": "I interviewed with the head of the human resources department. During the interview, he apologized several times for looking at the wrong copy of my resume (I had previously applied for different positions and he had two copies of my resume). He asked me to go through each of my past jobs and tell him how I knew it was time to leave each, and concluded the interview by saying that he had not realized how long I have been at my current position and that he felt my experience was not a match. The overall implication was that he has realized relatively quickly that he felt I was not a match, but he allowed the interview to continue. At no point was there a break that would have allowed me to ask questions of my own. Overall, the interview ended feeling like it had been mostly a waste of both our time—he had not read my resume beforehand, was not sure which copy of it he should be looking, and referenced the incorrect position for my current role several times. He knew early on he would not be offering a second interview and still continued to ask questions, allowing the interview to continue for no reason.", "Interview Questions": "How do you know its time to leave your current position? "}, {"date": "9 Sept 2019", "title": "Admissions Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Penn Foster, Inc", "Interview Descriptions": "I was interviewed by a manager and director. Both were very friendly and professional. The interview lasted about a half hour, and concluded with a tour of the facilities.", "Interview Questions": "Are you good at multitasking? "}, {"date": "21 Aug 2019", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn Foster, Inc (Scranton, PA) in May 2019", "Interview Descriptions": "Interviewed with the manager and senior graphic designer. Casual and laid back. Very friendly and comfortable. Fairly generic interview questions and review of design portfolio. Felt more like a conversation than just simply question and answer. Only took about 30-45 minutes.", "Interview Questions": "Describe a time you experienced someone who was challenging to work with and how you handled the situation."}, {"date": "4 Feb 2017", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Penn Foster, Inc (Scranton, PA) in Feb 2016", "Interview Descriptions": "Was not grueling, more of a conversation than a question/answer interview. The conversation was mostly based around prior experience, why I was interested in the job, discussing salary, and then followed by a tour of the building and facilities. I was called back within 3-4 days to be told I got the job and that I would be starting with the new training class in a few weeks", "Interview Questions": "What prior experience will make you an asset to Penn Foster?"}, {"date": "21 Sept 2015", "title": "Customer Service Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Penn Foster, Inc (Scranton, PA) in Sept 2015", "Interview Descriptions": "The interviewed began on time.I was escorted to the office by a friendly staffer. It was a casual, but professional atmosphere. I met with two managers of the department in a quiet, comfortable office.The interview questions were business specific.  The interviewers were direct with their expectations and were helpful in describing exactly what their organization does.  They showed a genuine interest in my work experience. It was a pleasant experience all around and well worth my time.", "Interview Questions": "the questions were very position specific.  One question was how would I prioritize the handling of customer issues."}, {"date": "16 Jun 2014", "title": "Student Care Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Penn Foster, Inc", "Interview Descriptions": "Had a phone interview. Was very pleasant and relaxed. Asked me questions about work history and what they are looking for. Scheduled a face to face interview which was very casual. It was nice to see what the work environment would be like. Had a typing test and then the team leader explained what the position entailed. Had a third interview with the manager. She turned out to be very nice and had a great sense of humor. Everyone made me feel at home and like there was room for growth.", "Interview Questions": "Sell me something that you believe in."}, {"date": "19 Oct 2015", "title": "Higher Level Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Penn Foster, Inc in Sept 2013", "Interview Descriptions": "Interviewed with 3 different people over 2 days.  It was more of a \"get to know you\" and learn about Penn Foster than a rigid difficult interview.  I felt at ease with the person who interviewed me and I was appreciative for it.", "Interview Questions": "What is the most important quality that you abide by?"}], [{"date": "20 Mar 2011", "title": "Enrollment Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Penn Foster, Inc (Scranton, PA) in Dec 2010", "Interview Descriptions": "I had a prompted telephone interview and then a one on one interview once I passed that step. Initial perception of the company was that it was professional, but very old school. The building needs updates, as do the programs that are offered to the students, but that's a whole other story. It's like they are stuck in 1985. \r\nThe interview was standard, the same questions that everyone loves to ask from upper management. For example, What are your strengths? Weaknesses? Tell me about a time that you had to face conflict at work, how did you hand it?", "Interview Questions": "What are your strengths?"}, {"date": "24 Jun 2010", "title": "Payroll Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Penn Foster, Inc (Scranton, PA) in May 2010", "Interview Descriptions": "I saw the position advertised on Twitter and e-mailed my resume to the given address.  Two months passed then I was called for an interview.  The interview was short and sweet and I thought I had made a good impression.  I hadn't heard anything for two weeks so I called to inquire about the position.  According to the receptionist, it had not been filled yet.  Another two weeks has gone by and I still haven't heard anything.", "Interview Questions": "Why are you leaving your current employer?"}, {"date": "25 Mar 2011", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Penn Foster, Inc (Scranton, PA) in Jan 2010", "Interview Descriptions": "Phone interview was scheduled well in advance but hastily carried out.\r\n1:1 interview was very quick and the information given was not accurate\r\nGroup interview was really more of a meet and greet for fit", "Interview Questions": "Why do you want this job?"}]]