[[{"date": "10 Mar 2023", "title": "Master Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "Digital interview, ask question and answer the question. Writing test. Give you the description of the question and you have sometimes to write the answer. The interview is not very difficult, but still need to prepare it.", "Interview Questions": "Tell us about yourself. What is your favorite book?"}, {"date": "8 Mar 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "The interview was with 2 people over a Zoom call. They asked me about 10 different questions. They were very nice and straight forward. I received a job offer a few days later. I had only 1 interview.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "2 Feb 2023", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Syracuse University", "Interview Descriptions": "Enjoyable and casual –– it was more of a conversation rather than an interview. Questions were relevant to the job to which I applied, and the interview was with several others.", "Interview Questions": "Tell us about yourself and why you are fit for this position."}, {"date": "5 Jun 2023", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Syracuse University (Syracuse, NY) in Jan 2023", "Interview Descriptions": "Generic but informative. Took forever to hear back months after I had the interview. Communication hasnt been the best throughout the whole process only negative is the lack of communication and updates to the posting.", "Interview Questions": "Why are you good for this role"}, {"date": "14 Dec 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "Spoke with employees in the department. There were a few phone calls. They made the process seamless. As an intern, your asked and are tasked with things that help the department that you are working in.", "Interview Questions": "Why do you want to work here?"}, {"date": "29 Sept 2022", "title": "Web Content Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Syracuse University", "Interview Descriptions": "Whole process maybe took four weeks. I was invited for an initial phone screening, which I passed and then was selected for a video interview. I passed that and then was brought into the office for an in-person interview, which was actually very informal and laid back. ", "Interview Questions": "Tell us about yourself and your previous roles"}, {"date": "25 May 2022", "title": "Main Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "they were able to get to know me on a personal level while explaining what the job would intake. I was able to freely ask them any concerning questions I had.", "Interview Questions": "Why do I want this job?"}, {"date": "29 Apr 2022", "title": "ESL Lecturer Adjunct Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "As expected for a summer position when they needed more instructors.  I am not sure what else to add here. I was in the area temporarily, and it was a temporary job.", "Interview Questions": "What levels do you enjoy teaching most?"}, {"date": "9 Mar 2022", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "It was great, I have one phone screening with the hiring manager and a half day campus interview with the rest of the team to gauge my fit. The entire process felt relaxed.", "Interview Questions": "What can you bring to the position?"}, {"date": "14 May 2022", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Syracuse University in Mar 2022", "Interview Descriptions": "I applied online, received request to schedule interview with hiring manager.  I was immediately scheduled for a second round, to include other staff members.  Prior to the second interview, I received a random email from a liaison asking to speak with me about the position.  I spoke with the individual, who suggested their role was to provide assistance with the hiring process, etc.  I then had the second round interview, which included the hiring manager and 3 other staff members.  I followed up as usual a few days later, but did not receive a response from the hiring manager and never received any follow up regarding the status of the position.", "Interview Questions": "How do you manage cross functional relationships within an organization?  "}], [{"date": "1 Mar 2022", "title": "Dame Changeover Crew Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "It was very good. They asked relevant questions and explained the job description. I felt like I was already part of their organization. The interview process went smoothly and accordingly.", "Interview Questions": "What was my biggest weakness?"}, {"date": "28 Feb 2022", "title": "Copy Editor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "First a Human Resources representative set up an interview (over the phone); that was followed by a manager interview (over the phone); then I was schedule for an executive interview (in person) and team interview (in person)", "Interview Questions": "Why do you want to work here, what content management systems are you familiar with, strengths/weaknesses, what is your editing process, what are we doing well, what can we do better, how would your background be beneficial, how do you collaborate with writers"}, {"date": "4 Feb 2022", "title": "Social Media Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Syracuse University", "Interview Descriptions": "Asked about past social media experience, asked for ideas to improve social media platforms. Focused on the expansion of the Instagram platform into other sites and trends. Panel of 3-5 people, all you will work with directly on projects", "Interview Questions": "Should we create a TikTok account? How would you reach various audiences? "}, {"date": "2 Feb 2022", "title": "Associate Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Syracuse University", "Interview Descriptions": "The process was fine and as expected. They emailed me to set up a zoom interview. We did the interview and they were polite and some of them were friendly. I had the feeling I was not their top candidate and the nonverbal communication during the interview ratified my impression. Some of the interviewers were clearly unhappy about being there. \r\n\r\nI emailed a few of the search committee members with a polite follow-up to thank them for their time and they never responded. \r\n\r\nAfter the interview, I never heard back from them again. Not even a polite note to let me know they had selected someone else. I thought the process needed closure, and they seemed unprofessional. Sadly for the higher institution industry, this behavior is more the norm than the exception. Unprofessional.", "Interview Questions": "How do you see the future of the industry?\r\nHow do you envision the future of the department? \r\nHow do you engage with diversity?"}, {"date": "17 Jan 2022", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "Ask about the major and GPA\r\nNice interview\r\nAsk about the daily schedule and courses \r\n\r\nAsk about the major and GPA\r\nNice interview\r\nAsk about the daily schedule and courses", "Interview Questions": "What is your GPA and the Grade of the course "}, {"date": "9 Jan 2022", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Syracuse University", "Interview Descriptions": "I got an onsite interview. The professor is very nice. He asked me about my research experience and paper publications. The whole process was comfortable and smooth.  Like the campus and their culture.", "Interview Questions": "Tell me about yourself and your research background."}, {"date": "28 Sept 2021", "title": "Peer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "It was good. I sent in an application and they let me in. I like being a peer mentor. I like the students I am working with. It is also part of my community engagement requirement.", "Interview Questions": "Why do you want to be a peer mentor?"}, {"date": "19 Sept 2021", "title": "Multimedia Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Syracuse University (Syracuse, NY) in Aug 2021", "Interview Descriptions": "There were parts of the interview. One with me on zoom and the multimedia team. Once you pass that round you needed a minimum of 5 illustrations/designs/animations by the next week.", "Interview Questions": "How do you deal with conflict at work?"}, {"date": "26 Jan 2022", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Syracuse University (Syracuse, NY) in Jul 2021", "Interview Descriptions": "The interview was an easy 1 on 1 with the coordinator. General questions asked and not stressful whatsoever. Friendly environment for an interview and brief. Had a genuine conversation rather than an interrogation.", "Interview Questions": "What are techniques you have or would use to help a student that is struggling?"}, {"date": "28 Jul 2022", "title": "Undergraduate Student Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY) in Apr 2021", "Interview Descriptions": "It is mostly behavior interview questions. Most questions are relate to how you are responded to different situations in a classroom setting. They will ask you, your opinion on being a student leader. Lastly, there are two easy math questions.", "Interview Questions": "1.)What will you do if you don't know the answer to students' questions?\n\n2.)How would you react if two students had conflicts in the class?"}], [{"date": "26 Mar 2021", "title": "AEW Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Syracuse University", "Interview Descriptions": "Group interview for teamwork skills  followed by an individual interview for very basic mathematic skills.   All very fun and light hearted.  There was a follow up individual interview asking more specific questions for why I wanted to be a facilitator.", "Interview Questions": "For example for the mathematics questions: what is the integral of 3x? Don't sweat it!"}, {"date": "7 Feb 2021", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "Casual process. Visitation day on campus offered to meet faculty, learn about research opportunities, and see if university is the right fit. One-on-one interviews set up with professors of your choices in Life Sciences department.  Opportunity to ask questions about layout of laboratories and expectations from PI.", "Interview Questions": "Explain past research experiences and what drew you to program."}, {"date": "6 Feb 2021", "title": "Main Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "It was calm, they ask you about your schedule and how you’d react to different situations. I was in and out, got my schedule a few days after the interview.", "Interview Questions": "H hun is would you react to a student who wants to check out equipment but doesn’t have an id? "}, {"date": "16 Sept 2021", "title": "Adjunct Applied Music Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Syracuse University (New York, NY) in Feb 2021", "Interview Descriptions": "Communication with the panel was clear, which allowed for confident preparation. The Zoom interview was very similar to an in person interview, different members of the panel asked questions about various aspects of teaching, philosophy, and my experiences. I felt very comfortable in the interview process.", "Interview Questions": "How has your vast playing experience contributed to your teaching experience?"}, {"date": "26 Oct 2021", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Syracuse University (Syracuse, NY) in Feb 2021", "Interview Descriptions": "Interviewed just a couple weeks after applying. 2 rounds of interviews followed by HR follow up. Interview was conversational and didn't feel like they were trying to trick me.  Good professional experience.", "Interview Questions": "What would be the first thing you would do if given the role."}, {"date": "3 Nov 2020", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "Mostly getting to know the employee, describing job structure and responsibility, steps to take to get the role, and what to expect during the job day to day. Fairly straightforward and simple.", "Interview Questions": "How do you hear about this?"}, {"date": "26 Oct 2020", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "It was very easy, you need work-study though\nI just talked to the pool director\nI did an in-service training to show my skills\nI was hired in 2019 it may have changed as the director has changed since and it has moved to the Barnes Center", "Interview Questions": "They asked for my prior experience"}, {"date": "7 Oct 2020", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "A short chat with the hiring manager. Definitely felt like more of a conversation than an interview.  I submitted an application and was able to come in and talk the following week. No worries - just be yourself and it will go well!", "Interview Questions": "It was more of a fluid conversation there were no direct questions."}, {"date": "1 Sept 2020", "title": "Global Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Syracuse University", "Interview Descriptions": "The interview was conducted in a group via Skype phone, without a screen, Pre-Covid. I had the impression they had already chosen their final candidate but had to conduct a certain number of interviews for legal purposes. They showed disinterest in the process.", "Interview Questions": "What is your level of fluency in another language?"}, {"date": "12 Aug 2021", "title": "ITS Student Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY) in Aug 2020", "Interview Descriptions": "The interview process consisted of talking to one of the full-time lead consultants. The interview process went smoothly as the consultants were very nice and welcoming. You were asked about your technical experiences and familiarity with different Operating Systems. I was also given test situation and how I would respond to those situation. The test situation ranged from the steps I would take if a client said her computer is not working properly  to frustrated clients on IT Help Line.", "Interview Questions": "What would you handle a frustrated client on the Help desk line if she is unable to log into her Syracuse account?"}], [{"date": "2 Sept 2020", "title": "Director of Advancement Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Syracuse University (New York, NY) in Jul 2020", "Interview Descriptions": "Zoom call to discuss the job requirements.  Spoke at length about my past jobs both paid and volunteer and how they would translate into this new opportunity. Throughly enjoyed speaking with the Executive Director of Advancement. He gave me an overview of the job and talked about plans for the university moving forward.", "Interview Questions": "What can you contribute. How do you take rejection."}, {"date": "12 Mar 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "the process was really great. I came in in 2016 . During my time there I worked as a student. The interview was good. It was onthe phone. After the interview I got the job. I would consider it overall a success. I really liked it there", "Interview Questions": "they asked me when i would like to leave?"}, {"date": "6 Mar 2021", "title": "Front Desk Receptionist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Syracuse University (Syracuse, NY) in Feb 2020", "Interview Descriptions": "Very simple, asked an array of questions upon my work experience. They also asked some situational questions. There is only one interview after you send them your cover letter and you should get a response in the following few weeks.", "Interview Questions": "What has been a time where you displayed leadership?"}, {"date": "18 Jan 2023", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Syracuse University in Jan 2020", "Interview Descriptions": "My potential advisor set a 1:1 meeting for about half of the hours. After we talked, he gives me a Ph.D. offer immediately. I accepted that offer. It is easy.", "Interview Questions": "What is the most challenge you met in your previous project?"}, {"date": "15 Nov 2019", "title": "SAT Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "It was Smoot. 1 face to face interview. I submitted my resume. I was selected for the final round. it was a conversional round, more about my experience and skills", "Interview Questions": "Why Sat? which field?"}, {"date": "27 Feb 2023", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Syracuse University in Nov 2019", "Interview Descriptions": "The interview process for regular employees, guided by HR, seemed to go smoothly, but it took a long time, maybe 3 months to go through the whole process. I forgot I was in the interview process at one point and just assumed I didn't get the job. Hiring cannot be competitive truly if the process takes 3-4 months.", "Interview Questions": "Standardized questions, not specific to job title."}, {"date": "5 Jun 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Syracuse University", "Interview Descriptions": "One day interview meeting with 9 different professors in biology department. Also attended an event for a fellowship I was applying for. Interviewers were mostly interested in seeing if I was a good fit and it did not feel like a high pressure scenario.", "Interview Questions": "What was your motivation for choosing to pursue a PhD?"}, {"date": "1 Sept 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Syracuse University (Syracuse, NY) in May 2019", "Interview Descriptions": "Came to the director's office ask her some question about major and the lab's situation. And then submit a resume to director. She asked me some question in resume and asked some Qs about relative software.", "Interview Questions": "Have you  ever used any Intel's or Xilinx's FPGA board?"}, {"date": "22 Jul 2019", "title": "Assistant Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Syracuse University (Gainesville, FL) in May 2019", "Interview Descriptions": "30 minute phone interview with straight forward questions and time for me to ask questions at the end. Timeline was given and feedback was provided afterwards. The head coach was the only other person on the call and he was very receptive to sharing his philosophy while also asking pointed questions about how I would contribute.", "Interview Questions": "Why Syracuse?"}, {"date": "27 Jan 2020", "title": "REU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Syracuse University in Mar 2019", "Interview Descriptions": "No interview process. All of the application was done online and reviewed by the people working at SBI. Process was easy and manageable. The director made contact and made sure all information was given to the candidates such as myself.", "Interview Questions": "N/A"}], [{"date": "14 Oct 2021", "title": "EIR (Entrepreneur In Residence) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Syracuse University in Jan 2019", "Interview Descriptions": "Very engaging, great discussions. Smart people making Smart moves. Loved how engaged they were and cant wait to see the team grow. The student will definitely benefit from the programs happening here", "Interview Questions": "How can you help entrepreneurship grow "}, {"date": "13 Feb 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Syracuse University (Syracuse, NY) in Nov 2018", "Interview Descriptions": "walked in answered a few questions and was then offered the job. now i'm trying to fill in the 30 word minimum. So I will continue to but words until i reach 30. over all the job was very laid back and i would recommend it.", "Interview Questions": "have you worked with students before "}, {"date": "3 Nov 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Syracuse University (New York, NY) in Oct 2018", "Interview Descriptions": "Overall good interview. In-depth details were asked about my background and my aspirations. Also, know your resume well. Don't fake any content on the resume and also do the position or the role analysis.", "Interview Questions": "Where do you see yourself in 2 years?"}, {"date": "12 Jul 2018", "title": "Adjunct Lecturer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Syracuse University", "Interview Descriptions": "Phone Interview and then an on-site interview . the pone interview was very friendly 5 people and they recorder it.  the on site interview was also very friendly mat the staff the student and the university was really great", "Interview Questions": "What made you apply for this position at our college?"}, {"date": "23 Jun 2018", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Syracuse University", "Interview Descriptions": "First we would apply through emailing the resume to the Manager and depending upon which role we fit into we would receive a call back. Then we attend the orientation and meet the team working on the same project as ours.", "Interview Questions": "what is your area of interest? "}, {"date": "22 Jun 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Syracuse University", "Interview Descriptions": "Basic, Asked questions to see if i was fit to organization policies,  general questions about adherence to rules and health codes issued by university. Offered job after interview which was really surprsing", "Interview Questions": "How many hours can you work?"}, {"date": "14 Feb 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Syracuse University", "Interview Descriptions": "Phone interview by department chair. Then the offer was given within three weeks time. I didn't get any chance to negotiate stipend but that's by default I guess. The offer letter was sent quickly. Very efficient", "Interview Questions": "Mostly about what my passions are and what I want to do with my life"}, {"date": "22 Jan 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Syracuse University", "Interview Descriptions": "nice talk with the supervisor of this part-time job. nice professor. discussion about my previous work and language ability. Research experience. a very easy atmosphere via skype. good good good", "Interview Questions": "please describe your most satisfied research work."}, {"date": "16 Dec 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Syracuse University (Syracuse, NY) in Jan 2018", "Interview Descriptions": "They ask you about your background, why you are a great fit. The interview is in person or on Skype, they do this after reviewing your application including GRE scores, and ask you more questions based on your resume", "Interview Questions": "What makes you the best candidate?"}, {"date": "30 Jan 2018", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Syracuse University (Syracuse, NY) in Jan 2018", "Interview Descriptions": "Not all IA's are interviewed, only some positions require it depending on the department's preferences. Sometimes online submission is all the hiring professor requires. Out of about 14 IA positions I applied to per semester, I interviewed for three total.", "Interview Questions": "Typical experience questions if relevent"}], [{"date": "30 Jul 2018", "title": "Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at Syracuse University in Jan 2018", "Interview Descriptions": "the interview is quite regular and no sample lecturing is required. they first introduce the position and then ask me prior teaching experience and how it would contribute to this position", "Interview Questions": "tell me about your teaching experience"}, {"date": "29 Oct 2017", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Syracuse University (Syracuse, NY)", "Interview Descriptions": "Had to fill out an online application. There were 2 interviews. The first one with 2  interviewers and the 2nd one as a group, which went for around 5 hours with 5 different sessions.", "Interview Questions": "Why do you want to become a resident advisor? How have your experiences in college and prior influence you to this decision? What backgrounds and experiences do you have relating to diversity? "}, {"date": "12 Oct 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Syracuse University", "Interview Descriptions": "Professor approached about a position at a department on campus. I emailed them my resume, about a week later I had a one-on-one interview in person. Offered position at the conclusion of the interview.", "Interview Questions": "What gaps exist in your resume and how do you hope that this position will help fill them?"}, {"date": "12 Oct 2017", "title": "Propulsion Analyst Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "Long, good mix of technical and personal questions.  Fair overall.  Had to give short technical presentation.  Managers were all very friendly and encouraged me to ask questions as well.  The interview felt tailored to my resume and didn't feel like an oral exam like some other companies.", "Interview Questions": "Thermodynamic analysis of ramjet."}, {"date": "4 Apr 2018", "title": "Law School Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY) in Sept 2017", "Interview Descriptions": "They asked me a series of questions. It was mostly about my experiences. They were not very great communicating after the interview was over. Did not receive the job.", "Interview Questions": "Asked about my previous work experiences "}, {"date": "19 Jun 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Syracuse University", "Interview Descriptions": "It's strictly based on your portfolio. When you apply for the university, make sure you apply for the position as well. It gets a lot harder and competitive if you wait to apply after the semester begins,", "Interview Questions": "How do you hope to use this opportunity?"}, {"date": "14 Jun 2017", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Syracuse University (Syracuse, NY) in May 2017", "Interview Descriptions": "I applied online and heard back in about two weeks. I had two interviews, one via skype and the second in person. The interview Process overall was very laid back. I interviewed with three people and the whole process lasted about one hour.", "Interview Questions": "Why did you apply for this position"}, {"date": "27 Nov 2019", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Syracuse University (Syracuse, NY) in May 2017", "Interview Descriptions": "Emailed resume and brief cover letter, got an email back from the lab director, scheduled an in person interview. Met with lab director one on one in the same week.  Interview lasted 15 minutes. Really not much else to say.", "Interview Questions": "If I could sit down and do the same thing for hours, that it can get a little monotone. Asked about what I know about the lab director, why I was interested in research, then the specific type of research"}, {"date": "7 Apr 2017", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Syracuse University", "Interview Descriptions": "30 minute telephone interview, 1 hour in person interview with a panel. Did a sample advising call. Within 2 weeks I was offered the position, but i ultimately declined the position due to salary.", "Interview Questions": "Where do you see yourself in 5 years."}, {"date": "13 Apr 2018", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Syracuse University (Syracuse, NY) in Apr 2017", "Interview Descriptions": "Its a straightforward application process with a  personal and formal in-person interview.  It is a group/ panel interview where you talk about yourself and your credentials. There was one interview before recieving an offer.", "Interview Questions": "What skills do you have that would help you perform the duties of this position?"}], [{"date": "11 Nov 2021", "title": "Budget Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Syracuse University (Syracuse, NY) in Jan 2017", "Interview Descriptions": "The interview process what pretty seamless.  I was advised to accept a low salary at first, because it will be raised quickly.  This never happened,  I never received such raise.  Besides this, the interview process was positive. I would advise not to accept any lowball offer.", "Interview Questions": "Where did you hear about this job opportunity?\r\nWhat makes you think you are a good fir for this position?"}, {"date": "16 Jan 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Syracuse University (Syracuse, NY) in Jan 2017", "Interview Descriptions": "Phone screen then day long face to face 30 minute interviews on campus with several leaders from different colleges and divisions.  Each interviewer had a different perspective and view of the University. Offer then came fast after that.", "Interview Questions": "How would you approach the first 90 days?"}, {"date": "3 Jun 2017", "title": "Donor Relations Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Syracuse University (Syracuse, NY) in Jan 2017", "Interview Descriptions": "I was asked to do a Skype interview. It took about twenty minutes. The rep from HR pretty much just went over my resume. She asked me to tell her about each job I held. She had a hard time explaining what the job was that I was applying for. I thought the interview went well, but after two weeks I never heard back. I reached out to my interviewer and was told that they hired someone with more experience, which isn't much of a stretch since I had zero donor relations experience.", "Interview Questions": "I was asked about every job that was on my resume."}, {"date": "18 Jul 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Syracuse University (Syracuse, NY) in Oct 2016", "Interview Descriptions": "My friend introduced me to her boss and they told me that they needed help as she was going abroad. I sat down with my boss, discussed the role and responsibilities and he offered me the position.", "Interview Questions": "Are you willing to work weekends?"}, {"date": "14 Sept 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "there's no formal interview exactly, they just look at your resume and cover letter, and see if you are a good fit. It would help a lot if you know someone and they know that you have a great passion for teaching. They'll ask if you know what to do for being a teaching assistant and some of them will ask to see your portfolio. But other than that, it's nothing too serious", "Interview Questions": "what is your previous experience in video production"}, {"date": "2 Aug 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Syracuse University (Syracuse, NY) in Sept 2016", "Interview Descriptions": "Apply once the university notifies for the position and if the professor likes your resume he/she will reply asking you to attend. Be prepared to do that at the start of the program as the time frame of the position is very limited.", "Interview Questions": "What was your previous Experience in this project area? "}, {"date": "25 Jun 2016", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY)", "Interview Descriptions": "The process was very relaxed. The prinipal investigator was really nice. She gave my one of her papers to read, which was on the topic I started working on. It was a lot less scary than I thought it would've been. I encourage all undergrads to do research. The overral experience was good.", "Interview Questions": "Why do you want to work in a lab"}, {"date": "18 May 2016", "title": "Business Office Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY) in May 2016", "Interview Descriptions": "The first interview involved being interviewed in a small room, seated at a small conference table (seats 6). I was at the table with 5 people who each were interviewing me.  It was very nerve racking and intimidating, especially for an initial interview.  I've never experienced being interviewed by so many people nor on the initial interview.", "Interview Questions": "Have you ever been responsible for preparing a budget?"}, {"date": "17 Nov 2016", "title": "Assistant to the Chair Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY) in Apr 2016", "Interview Descriptions": "Asked to come in for a face to face interview with a committee comprised of the Chair, a PhD student and the former employee in the position. Lasted one hour. Very average questions were asked. Conversation was easy. They called my reference that day, offered me the position the very next day.", "Interview Questions": "Why do you want the job. What can you contribute to the position. How well do you get along with others. What was one thing you did that you didn't get credit for. Tell me about a time that you had an issue with faculty, how did you solve it."}, {"date": "15 Aug 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY) in Mar 2016", "Interview Descriptions": "The interview process went by quite smoothly, the staff there was very friendly and welcoming when I visited. I was initially intimidated because I thought I was alot younger than the members of staff, but they treated me as if we had been friends for a long time and were engaged in our conversations.", "Interview Questions": "What was a difficult decision you had to make?"}], [{"date": "18 Oct 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Syracuse University (Syracuse, NY) in Mar 2016", "Interview Descriptions": "I approached the Prof. during class, I was called for a meeting to sit down and interview was very conversational. They asked about my qualifications, experiences and general interests.\r\nAfter 2 weeks I was notified that I have received the offer.", "Interview Questions": "Leadership skills? Quantitative Skills? Communication Skills?"}, {"date": "14 Feb 2018", "title": "Conference Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Syracuse University (Syracuse, NY) in Feb 2016", "Interview Descriptions": "One of my profs recommended this job to me. She thought I would fit it and learn so much from it. Heather asked me several basic questions about my resume and she started to talk about my role in the job.", "Interview Questions": "Did u have any teamwork experience?"}, {"date": "6 Jan 2016", "title": "Student Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY)", "Interview Descriptions": "Interviewed by assistant managers, who were also students. Very friendly and enjoyable process. Interview probably took about 5-10 minutes. Longer you have worked there = more chances of getting the job. Keep close relationships with the assistant managers (you'd want to anyways)", "Interview Questions": "What would you do in this situation __________________?\r\nDo you have a problem giving orders to people who may be older than you?"}, {"date": "21 Nov 2017", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Syracuse University (Syracuse, NY) in Jan 2016", "Interview Descriptions": "Application process on the Syracuse University website, standard graduate school information required (including the general GRE and three professional recommendations).  Waited for acceptance, then came for an all-expenses-paid visit of the department and school during my undergraduate Spring Break.", "Interview Questions": "Why do you want to earn your degree here?"}, {"date": "19 Jan 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Syracuse University in Dec 2015", "Interview Descriptions": "I applied through an online process. I sent my curriculum vitae and research statement. After that they asked me to submit my feature search plan.  After that they took my interview through skype. Two persons took my interview. They asked me about my research work.", "Interview Questions": "About My research work."}, {"date": "2 Nov 2015", "title": "Grad Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Syracuse University", "Interview Descriptions": "Applied through my college. Met with the director of the office for first round of interviews.  Second round of interviews was conducted by office employees that I would work most closely with.  The whole process was in-person and took about 2 weeks.", "Interview Questions": "Why do you want to work for Syracuse University?"}, {"date": "29 Oct 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Syracuse University", "Interview Descriptions": "very smooth, brought out for interview, spent weekend in syracuse. good time interacting with faculty. although interview process was lengthy, perks were nice... food  lodging etc. Had to discuss undergraduate accomplishments and prior research experience!", "Interview Questions": "How can your talent advance the department as a whole?"}, {"date": "3 Nov 2015", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY) in Sept 2015", "Interview Descriptions": "I applicated this position through school website. About one month later, they asked me to have a face-to-face interview. This process is very quick. After 10 minutes of my interview, I was noticed that I got hired.", "Interview Questions": "How will teach the students?"}, {"date": "19 May 2015", "title": "Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Syracuse University", "Interview Descriptions": "Now it's an online process supported by HR dept.  Search chair reviews applications with search committee.  Interviews with them, sometimes with off staff too and dept head.  Behavioral questions.  Describe process of parking a car to someone who knows nothing about driving to test ability to describe a process and project requirements", "Interview Questions": "N/A"}, {"date": "6 Apr 2015", "title": "Sports Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Syracuse University", "Interview Descriptions": "I applied for the position via an online posting. I was contacted by my future boss for my availability for a Skype interview. I had a Skype interview with 4 members of the athletics staff and about a week later I was offered the job. The sports industry moves very fast and one needs to apply immediately when positions open up.", "Interview Questions": "Tell us a little bit about yourself?"}], [{"date": "11 Jul 2015", "title": "Student Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Syracuse University (Syracuse, NY) in Apr 2015", "Interview Descriptions": "For the Dome, it wasn't too bad. They ask you a few questions, i.e. what would you do in this situation, etc. General employees don't need to go through an interview process, just the ones applying for supervisor.", "Interview Questions": "What would you do in _____ situation?"}, {"date": "15 Feb 2016", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Syracuse University (Syracuse, NY) in Oct 2014", "Interview Descriptions": "I was quite interesting. Questions asked were very basic... They were easy and straightforward. I was comfortable. The interviewer was very friendly and that very had me relax overall.", "Interview Questions": "Describe yourself.\r\n\r\nWhat are your qualifications?"}, {"date": "26 Jan 2018", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Syracuse University (Syracuse, NY) in Aug 2014", "Interview Descriptions": "Interviewing about English. if not good enough, English course is required in the following 2 or 4 semesters.  During the interview, a series of English skill testing is conducted.", "Interview Questions": "Listen to the dialogue to restore the story"}, {"date": "20 Mar 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Syracuse University (Syracuse, NY) in Jul 2014", "Interview Descriptions": "Talked to the professor about your learning experience. Then the professor asked few questions relating his class. I waited few days until he finished interviewing all the candidates and reported to the department about his decision", "Interview Questions": "have you had an experience as Teaching Assistant"}, {"date": "26 Sept 2017", "title": "Senior Associate Vice President Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Syracuse University (Syracuse, NY) in Jul 2014", "Interview Descriptions": "the interview was with the direct hiring manager who was intelligent, thoughtful and answered my questions as well as asking his own. It occurred over a bit more than one month and was actually enjoyable.", "Interview Questions": "What do you want to be doing five years from now?"}, {"date": "28 Jun 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Syracuse University", "Interview Descriptions": "The interview was schedule by emails. The hiring professor and his students were in the interview meeting. We discussed the job tasks and responsibilities in research direction, shared the ideas and management style, and visited the working and lab environment.", "Interview Questions": "How do you balance the heavy research load and family life?"}, {"date": "21 Mar 2014", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY)", "Interview Descriptions": "it was a very easy process as the proff recommended me based on my resume.", "Interview Questions": "N/A"}, {"date": "14 Mar 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Syracuse University", "Interview Descriptions": "Typical graduate application process, followed by a one-day interview with faculty members of my department. Visits with potential advisor, similar faculty members, dean, and current graduate students.", "Interview Questions": "None, really. Typical for graduate process."}, {"date": "14 Jan 2014", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY)", "Interview Descriptions": "To become a Resident Advisor at Syracuse University, there is one interview session, and several long training sessions over the course of several months that are usually 1 or 2 hours long. It is important not to babble on and on, but to keep answers concise and limited- the interviewer has many applicants he/she needs to interview.", "Interview Questions": "Stereotypical interview questions, what is your strength, what are your weaknesses, etc."}, {"date": "28 Jan 2014", "title": "Lab Associate Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Syracuse University (Syracuse, NY) in Jan 2014", "Interview Descriptions": "regular, smooth and good communication", "Interview Questions": "nothing difficult"}], [{"date": "20 Feb 2014", "title": "Ernie Davis Dining Hall/Employer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY) in Aug 2013", "Interview Descriptions": "Apply on line and go to the office to finish a form, after 4+ weeks, you will get a interview. They will ask you information on your resume and former working experience and available working schedule.", "Interview Questions": "No difficult questions, pretty normal and daily ones."}, {"date": "28 Jun 2013", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Syracuse University (Syracuse, NY) in May 2013", "Interview Descriptions": "The office that was hiring contacted me for an interview about 3 weeks about I submitted the application. I was interviewed by a small committee (4 people plus one via skype). I was informed two weeks later, by telephone, that I was not selected for a second interview. I thought that was very professional of them.", "Interview Questions": "I was given several case situations that I was asked to respond to. Why are you  interested in this particular job and S.U.? How does this fit into your professional goals? "}, {"date": "3 Mar 2013", "title": "RSA Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "After 2 hours reading the material and I got a exam. The questions are easy if you read the material carefully.", "Interview Questions": "N/A"}, {"date": "1 Feb 2013", "title": "Student Consultant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Syracuse University", "Interview Descriptions": "Requires you to apply through the university website .Then you will be called for an interview which checks you on your ability to communicate with people and minimum skills to troubleshoot computer software issues", "Interview Questions": "How would you deal with a tricky ,unhappy customer"}, {"date": "13 Sept 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Syracuse University (Syracuse, NY) in Jan 2013", "Interview Descriptions": "Depends on how big the department is. No pressure interview process.  Prompt reply as to the outcome of interview.  Persistence pays off if you are not selected. SU is a great place to work,  especially for people with children because of the tuition package.  With the high cost of college tuition,  this perk is a wonderful bonus.", "Interview Questions": "What made you apply for this position?"}, {"date": "21 Sept 2015", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Syracuse University (Syracuse, NY) in May 2012", "Interview Descriptions": "Several rounds of group interviews, several rounds on one on one interviews.  There was a long period of time between group interviews and one on one interviews and then another long period of time until the offer was processed and presented to me.", "Interview Questions": "Why are you leaving your current position."}, {"date": "23 Aug 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY) in May 2012", "Interview Descriptions": "There really isn't a hiring process. You should contact a professor you have taken class with before or who is in your field. If you are willing to work for free, have a good gpa, and preformed well in their class you should have no problem finding opportunities. These might depend on major, but for science majors many professor love undergraduate help.\r\nTry emailing your professor or your department head to see who to get in contact with", "Interview Questions": "There are not usually many/if any questions."}, {"date": "26 Mar 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY) in Mar 2012", "Interview Descriptions": "I just did it as a telephone interview. The professor asked me a few academic questions, including the questions in probabilities and statistics, signal processing, digital communications, wireless communications, etc.", "Interview Questions": "what is the difference between independence and uncorrelation?"}, {"date": "12 Jun 2015", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Syracuse University (Syracuse, NY) in Sept 2011", "Interview Descriptions": "Easy as pie. I applied online got called in to talk about the responsibilities and started the following week. They wanted to know which hours I would like to work and of course required all the working papers to be signed and authorized.", "Interview Questions": "What are your strengths"}, {"date": "8 Jun 2012", "title": "Office Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at Syracuse University (Syracuse, NY) in Jun 2011", "Interview Descriptions": "got a response right away. Everything was straightforward", "Interview Questions": "Why are you qualified fire this position"}], [{"date": "28 Nov 2015", "title": "Student Lab Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Syracuse University (Syracuse, NY) in May 2011", "Interview Descriptions": "There was no interview process for me. There was an email that was sent out to all the students that were juniors and seniors about the position. Those interested were told to apply online and to send their resume to the summer instructor. From there, those who were chosen were told via email, without an interview, that they got the position. At least that was the case for myself.", "Interview Questions": "What is your availability for the summer and can you work both summer sessions?"}, {"date": "3 Sept 2013", "title": "Graduate Assistant Athletic Trainer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Syracuse University (Syracuse, NY) in Feb 2011", "Interview Descriptions": "1 interview; full day, 5 staff members, floating interview. Met will all, all asked variety of questions, they then talk throughout the day. Meet with Assit. AD/Sports Med for final interview.", "Interview Questions": "How do you handle criticism?"}, {"date": "25 May 2015", "title": "Adjunct Instructor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Syracuse University (Syracuse, NY) in Jan 2011", "Interview Descriptions": "Review and discussion of qualifications.  Job responsibilities. Experience, review of resume, references and teaching philosophy. Personal attitude on education and classroom management.\r\nUse of technology in teaching. Grading System. Portfolio review.", "Interview Questions": "What best qualifies you for this job?"}, {"date": "14 Nov 2009", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Syracuse University (Syracuse, NY) in Oct 2009", "Interview Descriptions": "since i was already working as a student consultant it was easy for me to interview for the graduate assistant position and because of that I already knew the working of the information technology department and i could answer all the questions satisfactorily. \r\nthe result came out within a week and  started working as a process analyst", "Interview Questions": "why do you want to work as a GA?"}, {"date": "11 Nov 2013", "title": "Senior Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Syracuse University (Syracuse, NY) in Jun 2009", "Interview Descriptions": "Very difficult to get an interview with Syracuse University, it's either the right place at the right time or you know someone.", "Interview Questions": "Honestly can't think of any difficult or unexpected question."}, {"date": "30 Dec 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Syracuse University (Syracuse, NY) in Feb 2009", "Interview Descriptions": "I submitted my application to the Chemistry Ph.D. program online (see dept. website), and was accepted by email also. No interview was necessary, but I was invited to a tour of the facilities before accepting the offer. It was informative and nice, and I accepted.", "Interview Questions": "I wasn't given any questions exactly, but I listed my undergraduate research experience in my application. They want to know that you have a solid academic background in chemistry with a good GPA. Research experience is very important, and if you have any publications at the undergraduate level, you are almost certain to be accepted."}]]