[[{"date": "10 Mar 2023", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of South Carolina", "Interview Descriptions": "The interview consisted of video questions and responses. The questions were standard and mainly centered around previous experiences. It helps if you have previously held a teaching position or a different people facing role", "Interview Questions": "How do you connect with students?"}, {"date": "23 Feb 2023", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "The process was informative and allowed me to meet my future supervisor and colleagues. I enjoyed the process for round one and round two. At the end of the process I was offered the job!", "Interview Questions": "Tell us a little about yourself and how you view your fit for this position?"}, {"date": "7 Apr 2023", "title": "Director of Donor Experience Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 1+ week. I interviewed at University of South Carolina (Quincy, MA) in Feb 2023", "Interview Descriptions": "I was contacted via LinkedIn by the Executive Director of USC. The position is fully remote and I’m in another state but was encouraged to apply. After throughly reading over the application I decided to apply. Within a week I was called for a Zoom interview with the Executive Director and the Assistant Director of Annual giving. A lot of behavior questions asked and the interview lasted an hour long. I followed up with some questions. I was told that they are in the midst of their annual giving day and if chosen to go to the next round someone will follow up shortly. A month later I was ghosted.", "Interview Questions": "Explain a goal that you could not reach and how it impacted you?"}, {"date": "24 Jan 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "Phone Call that lasted at most thirty to forty five minutes and was during the lunch hour of my then current job. It was relaxed and casual. Only a couple of questions were asked.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "6 Dec 2022", "title": "Student Work Study Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "Interviewing with them was a very relaxed interview process with fun, engaging questions. The interviewers asked typical interview style questions with a good blend of more creative ones as well.", "Interview Questions": "Talk about a stressful time in a work environment."}, {"date": "15 Dec 2022", "title": "Sr. Systems Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of South Carolina in Nov 2022", "Interview Descriptions": "In the panel interview, everyone was generally professional, nice, and approachable. Some of the questions asked by the panel were relevant, allowing one to speak to their skills and thought process as it relates to the role. Most questions asked of the panel about the job description were met with outright contradictory and/or vague answers. The job description was bloated, word and acronym soup, to the point of being virtually meaningless for candidates to make an accurate assessment at any level. This is a somewhat recent and common problem of technology job descriptions being a 'kitchen sink' presentation. After the panel interview, my walkaway was they need to hire an Architect to drive the overall technology direction and vision, with the skills and salary that this position and title comes with. If I knew what I know now, I wouldn't have applied. Declined to move forward based on above, and would likely avoid applying to future roles until candidate experience is improved dramatically.", "Interview Questions": "1) Tell me each layer of the OSI model. 2) What is the difference between a layer 7 and layer 4 firewall. 3) What does inclusion and diversity mean to you? 4) How would you maintain work life balance in an on-site, hybrid, or remote role? 5) What does leadership mean to you? 6) Explain the difference between an incident, a change, and a request? 7) What is the difference between incident management and change management. 8) What is ITIL?"}, {"date": "21 Oct 2022", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of South Carolina", "Interview Descriptions": "It was quick and easy. Great person as an advisor and very helpful. Clear with instructions and friendly work environment. Safety training included and certification is needed for the same.", "Interview Questions": "Transcript to know your background"}, {"date": "13 Jun 2022", "title": "Academic Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of South Carolina", "Interview Descriptions": "In person interview by department head that lasted about 45 minutes. Standard questions.\r\nMust have 3.0 grade point average bachelor’s degree.  Choice of single subject or all required undergraduate courses. I chose tutoring rhe standard undergraduate courses.", "Interview Questions": "Do you have flexible schedule ? "}, {"date": "8 Apr 2022", "title": "Information Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "Online interview process. Just a friendly chat and basic interview questions to get to know the candidate better. This job is for students on campus and helps to get familiar with similar jobs in real life.", "Interview Questions": "Tell me about yourself and why are you interested in this role."}, {"date": "14 Mar 2022", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "first is a phone interview. Then is the second round interview, with many many people, and they ask questions one by one, and you need to answer each of them.", "Interview Questions": "what is your weakness and strengthness?"}], [{"date": "17 Feb 2022", "title": "Facility Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "Thorough, fun interview process. Started with introduction over phone with in-person follow up discussions.  Lots of “why” and “how” focused questions. Spoke with those you’ll ultimately report to and work under. They clearly have great customer service as a priority and expectation.", "Interview Questions": "How will you impact other students?"}, {"date": "12 Feb 2022", "title": "Production Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "My interview was held on zoom. They asked basic interview questions about work ethic. They also asked to see some of my previous work. They got back to me in about a week's time.", "Interview Questions": "What is your creative process?\r\n"}, {"date": "10 Feb 2022", "title": "New Student Orientation Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of South Carolina", "Interview Descriptions": "The process involved a group interview,  as well as a follow-up individual interview. The group interview included roundtable discussion on topics and collaborative games and challenges to find out our ability to work as a team and think outside of the box. The individual interview was more traditional but still casual.", "Interview Questions": "What is your favorite university tradition?"}, {"date": "7 May 2022", "title": "Access Services Librarian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of South Carolina in Feb 2022", "Interview Descriptions": "Applied and received an invitation to interview virtually about a couple of weeks later. The interview was conducted by a 3-person panel. The head of the search committee claimed that they would get back to me within a couple of weeks either way. I was ghosted altogether. It took two months for them to send a generic notice from HR that the position was filled.", "Interview Questions": "What is your management style?"}, {"date": "27 Jan 2022", "title": "Student Hire Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "I got contacted about scheduling a phone interview very soon after applying. The phone interview lasted about 20 minutes & was with two different people. They explained the role and then took turns asking me questions.", "Interview Questions": "What mistakes have you made in the past and how did you fix them? "}, {"date": "27 Jan 2023", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of South Carolina in Jan 2022", "Interview Descriptions": "Met with the supervisor and one other member of the team. Casual and relaxed interview. Follow-up interview with the supervisor only. Received and accepted the offer after the second interview.", "Interview Questions": "Tell us about a time you had to handle a difficult client."}, {"date": "29 Oct 2021", "title": "Student Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of South Carolina", "Interview Descriptions": "Easy and stress free. Especially considering the interviewing took place during covid.  Meetings were via Teams and there was little to no internet/connection issues. Staff were friendly and approachable. It made the interviewing process less scary and nerve racking.", "Interview Questions": "What do you bring to the table?"}, {"date": "23 Sept 2021", "title": "Medical Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "Panel interview with standard questions. Initial interview  with peers, then 2nd interview with upper management. Relaxed environment. Round Robin questions. Be prepared to provide an overview of your experience and why you're suitable for the position.  You will also be asked case scenario questions.", "Interview Questions": "Please tell me about yourself. "}, {"date": "18 Sept 2021", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "Interview process was very easy. Sat down and had a 30 minute virtual interview that felt more like an informal chat. One tip is to be genuine and show your passion for the position.", "Interview Questions": "Why do you want to work in this role?"}, {"date": "12 Sept 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "It was extremely good. The professor who interviewed me was fantastic. He asked me to write a scientific report using latex and overall it was good. I submitted it and the deadline was within one week. So, you have to be prepared for that somehow.", "Interview Questions": "Research-related questions and some generic questions"}], [{"date": "18 Aug 2021", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of South Carolina", "Interview Descriptions": "Received an invitation for an interview very quickly but did not hear back from them for several months that I had not gotten the job. Questions were very general and I didn't feel like I got to speak to my experience in the field that would support the duties of the role.", "Interview Questions": "Q: Why are you trying to leave your current position?"}, {"date": "21 Jul 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "The interview process was thorough but brief. There was one round of interviews conducted over Zoom that lasted approximately 30 minutes. A panel of 4-6 people attended the interview including supervisors, HR professionals, and current advisors.", "Interview Questions": "How would you keep track of all students you'd be advising?"}, {"date": "10 Jun 2021", "title": "Operations Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "group interview, pretty easy basic life questions. Asked questions about life scenarios and about how you act under pressure. Easy on campus job but not good pay for a college student.", "Interview Questions": "Describe your background as a person?"}, {"date": "2 Feb 2021", "title": "Communications Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "Was very laid back. Met with the 4 senior members of the communications staff. Asked about general background stuff. Very important to have experience with stat programs and interacting with the media. Overall it wasn't very challenging, a really standard college athletic interview.", "Interview Questions": "Do you have experience with multiple sports?"}, {"date": "9 Feb 2022", "title": "Resident Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of South Carolina (Columbia, SC) in Feb 2021", "Interview Descriptions": "You submitted an application then had a virtual interview and were either selected or not.  It was very easy and the staff were very easy to talk to. There is some additional training that comes after you are hired.", "Interview Questions": "Why you would be a good fit?"}, {"date": "12 Jul 2022", "title": "Admissions Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of South Carolina (Columbia, SC) in Jan 2021", "Interview Descriptions": "Panel interviews x 2. First panel is small and then you go back for round 2 and it’s with a lot more people. Be prepared for the typical interview questions (where do you see yourself in 5 years, etc)", "Interview Questions": "What are your weaknesses?\r\nWhere do you see yourself in 5 years?"}, {"date": "23 Oct 2020", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "easy quick straightforward and peer evaluation will be done later. A recommendation is needed and it is best to find a referral first. Phone interviews and in-person interviews both happening.", "Interview Questions": "You will be asked about your teaching experience? it is important. "}, {"date": "24 Aug 2020", "title": "Division of IT Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of South Carolina", "Interview Descriptions": "I was asked a bunch of questions straight out of some exam.  None of the questions were really relevant to the job afterwards. I think the questions were just asked to see how you would react to something that you didn't know.", "Interview Questions": "What's the last step in configuring a firewall. What's the difference in BYOD COPE etc."}, {"date": "31 May 2020", "title": "IT Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of South Carolina", "Interview Descriptions": "There was your basic phone interview and then brought in for an in person interview.  Spent an hour with the hiring manager and then the team that I would manage.", "Interview Questions": "Why are you interested in this job?"}, {"date": "14 Apr 2021", "title": "Research Asssistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of South Carolina (Columbia, SC) in May 2020", "Interview Descriptions": "It was very calm and the interviewers made it so that there was no pressure about the process. Chris and Dr. Southall asked a series of questions about my interest in working with analytics and the background that I had in analytics and sports. Additionally, they asked which kind of projects interested me and why.", "Interview Questions": "What are your top 3 projects for this job and why?"}], [{"date": "19 Dec 2022", "title": "Resident Mentor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at University of South Carolina (Columbia, SC) in Mar 2020", "Interview Descriptions": "Very easy, only a 2 step interview process. No resume needed although I brough one. Group interview is the first round where you are brought into a room and seated in front of one current RM and one supervisor.", "Interview Questions": "What part of the carolinian creed will you uphold as an RM?"}, {"date": "3 Feb 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "Very easy, nice interviewers. 2 Rounds. Classic questions like what do you think you can bring to this role, how has your background prepared you for this position. The manager and some colleagues were part of the interview. It felt relaxing and very little pressure", "Interview Questions": "Classic, tell us about your background etc."}, {"date": "28 Dec 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at University of South Carolina (Aiken, SC) in Dec 2019", "Interview Descriptions": "Very detailed. Interesting questions and friendly staff.  Welcoming atmosphere and timely communication.  The position was explained thoroughly and everyone was friendly and helpful.  There was a telephone panel and then an in-person interview with the same panel.  It was not uncomfortable.", "Interview Questions": "How I handle difficult situations. "}, {"date": "8 Nov 2019", "title": "Systems Programmer/Developer II Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of South Carolina (Columbia, SC) in Sept 2019", "Interview Descriptions": "Telephone call after 1 week of application date letting me know about the online video interview\r\nonline video interview: Behavioral, why this place - position, my experience, some tech related and team related\r\nAfter that I was asked to attend an in person interview later they requested my requirement about visa sponsorship and politely cancelled the in person interview\r\n\r\nSeemed like a good pace to work but both of us are unfortunate", "Interview Questions": " team vs independent working style   "}, {"date": "19 Apr 2019", "title": "Career Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of South Carolina", "Interview Descriptions": "Phone Interview with 8 questions and then time for me to ask questions. I knew two days later I would be brought on campus for an interview.  It was an easy interview if you prepared for the position.", "Interview Questions": "Why this position? Time I was a liaison with another department? Event planning? Assessments I know? Experience in counseling and career advising? Career theory I use? Difficult client I have worked with? Program I created? Outreach I have done?"}, {"date": "20 Feb 2019", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of South Carolina", "Interview Descriptions": "I applied by on-line. And I got an invitation for phone interview after 1 week. After 1 more week I got a verbal offer, then I got an official offer letter from university. The total process time until getting offer took 3 weeks.", "Interview Questions": "What is my goal after 5years?\r\n"}, {"date": "6 Mar 2019", "title": "First Year Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at University of South Carolina (Columbia, SC) in Feb 2019", "Interview Descriptions": "I applied for the job online, and then completed a phone interview. After that I was invited for an on-campus interview. I heard back about a week later to clear my references, and was offered the job the next week.", "Interview Questions": "How do you handle having to give a student bad news? Ex. they won't graduate on time."}, {"date": "25 Apr 2019", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of South Carolina (Columbia, SC) in Feb 2019", "Interview Descriptions": "I applied online after seeing the ad on LinkedIn and was contacted a few days later for an interview. The admin who coordinated my interview was very helpful, and my interview was great. I had a one-on-one, hour-long conversation with who would've been my manager. She was super laid back and friendly. \r\n\r\nMy only complaint is that I didn't hear back until almost two months after my interview. This wouldn't have been a problem, but I was told I'd hear something within a week.\r\n\r\nAfter waiting two weeks, I emailed the admin who coordinated my interview to follow up and didn't receive a reply. I just received a general HR email a few days ago which said the department had selected another candidate. \r\n\r\nI now work in communications at a university closer to my home, so things worked out as they were supposed to. Other than that delay in following up, the process with U of SC was good.", "Interview Questions": "General stuff. You're asked to describe your background, why you want the position, why you feel you'd be a good fit, etc. I was also asked about my strengths and weaknesses and whether I work better alone or with a group. My interviewer cared way more about having a conversation than drilling me, though, which was great: she was really only asking the \"typical\" interview questions to prompt conversation. "}, {"date": "1 Nov 2019", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of South Carolina (Columbia, SC) in Jan 2019", "Interview Descriptions": "Applied and 3 months later finally get an email back. They took weeks to get back to me to tell me what they decided and then did not get paperwork processed until weeks after the official offer because it was \"lost\"", "Interview Questions": "What type of worker are you"}, {"date": "12 Jun 2019", "title": "Study Abroad Transfer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of South Carolina (Columbia, SC) in Jan 2019", "Interview Descriptions": "I applied on the USC website. I received an email to set up an interview about 3 weeks later. There were 3 interviewers, the head of the department, the International student transfer coordinator and the study abroad transfer coordinator that I would be working under. The interview consisted of them asking questions off a printed hiring questionnaire, questions like \"Can you tell us about yourself? Can you give us an example of a conflict you have had with a fellow worker and how you resolved it? They were kind , friendly and  it seemed like a positive work environment. Though the study abroad transfer coordinator seemed overwhelmed. 3 weeks later I received an email that the position for hire had been canceled.", "Interview Questions": "Can you tell us about yourself?"}], [{"date": "10 Jan 2019", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of South Carolina in Jan 2019", "Interview Descriptions": "Quick I went in for na interview and the process had no questions and I got the job on the spot. They are just looking for a good worker who wants to work hard", "Interview Questions": "N/A"}, {"date": "26 Jul 2019", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at University of South Carolina (Columbia, SC) in Aug 2018", "Interview Descriptions": "The two supervisors interviewed me in person. It was informal and very short. I thought I was interviewing for an accounting position, but the person in charge of Accounts Payable had left 2 weeks prior so they essentially asked me if I was capable of stepping in for her.", "Interview Questions": "What are your strengths? "}, {"date": "20 Apr 2019", "title": "Athletic Department Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of South Carolina (Columbia, SC) in Jul 2018", "Interview Descriptions": "One 20-minute phone interview or in-person interview, depending on your location and availability for the summer, with multiple people from the Athletic Department- the Assistant Director of Marketing, a full-time staff member and a returning intern.  Afterwards, about a week later, you receive a response with an offer or a non-offer.", "Interview Questions": "What was one time where you had to step up unplanned and lead in a time where you weren't planning to?"}, {"date": "22 Jul 2019", "title": "Veteran Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of South Carolina (Columbia, SC) in Apr 2018", "Interview Descriptions": "After application, associate registrar for veteran services inquires about customer service history, conflict resolution,  and looks for creative problem solving.  The important aspects they looked for were self motivation, accountability, and a drive to take care of veterans and their dependents.", "Interview Questions": "What does accountability mean to you?"}, {"date": "9 Apr 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of South Carolina in Mar 2018", "Interview Descriptions": "Questions about your experience, skills, and what’s your career goals. Didn’t take a long time. Only one teacher participated, very kind and easy-going. He also introduced the school and department.", "Interview Questions": "What courses have you taken？"}, {"date": "13 Nov 2017", "title": "Carolina Callers Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of South Carolina", "Interview Descriptions": "I applied online through the University of South Carolina. I got an email very soon after to do an interview in person. The interview was pretty quick and casual.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "20 Jan 2018", "title": "Orientation Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of South Carolina (Columbia, SC) in Nov 2017", "Interview Descriptions": "There are two parts to this process; a group interview and then individual interviews. The group interview includes team building exercises and an open discussion. Those who do exceedingly well to make themselves known without overstepping any of the other 4-5 candidates move forward to the individual interview.", "Interview Questions": "If you could be one kitchen appliance, what would you be and why? "}, {"date": "15 Apr 2018", "title": "Administrative Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at University of South Carolina (Columbia, SC) in Aug 2017", "Interview Descriptions": "I interview with the director of the program face to face in an office environment. I was asked questions about my background and if I thought I was suuitable for the job.", "Interview Questions": "If I thought I could handle administrative duties as well as maintain relationships with parents. "}, {"date": "2 Oct 2017", "title": "Community Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of South Carolina (Columbia, SC) in Aug 2017", "Interview Descriptions": "one in person interview, was quick and easy and overall went great. Could not of asked for a better experience and I am very happy with the position and the process.", "Interview Questions": "Tell me about a time when you worked in a group, what role did you play?"}, {"date": "9 Jun 2017", "title": "Grants Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of South Carolina (Columbia, SC)", "Interview Descriptions": "First round was over the phone by two team members. The second round was an in-person interview with the entire team and then an individual interview with the director.", "Interview Questions": "How well do you handle constant interruptions? "}], [{"date": "15 Jun 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of South Carolina (Columbia, SC) in May 2017", "Interview Descriptions": "Basically, this position is for current students who are enrolled in a degree program. Whenever a position opens up, students are referred to for this position. Its very easy though. The Professor supervising GA explains the job descriptions to the students. The flexibility of work may vary. Also, it is quite easy to negotiate your schedule, since you are student first.", "Interview Questions": "N/A"}, {"date": "20 Dec 2017", "title": "Career Center Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of South Carolina (Columbia, SC) in May 2017", "Interview Descriptions": "The interview was located in the Thomas Cooper Library at the Career Center. It was held in one of the many interview rooms, and was a little awkward because there was a lot of empty rooms around us. It was not intimidating or anything, I just thought it would be a little more chill since it was the school hiring students rather than an employer.", "Interview Questions": "She asked if I had noticed the screens around Darla Moore School of Business and what did I notice most about them (events, time, date, etc.) "}, {"date": "11 Mar 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of South Carolina (Columbia, SC)", "Interview Descriptions": "The Center for Disability Resources has offered more opportunities for me as a student and employee than I ever imagined. I will be forever thankful for my time at CDR and the many learning opportunities.", "Interview Questions": "What are your short and long-term professional goals?"}, {"date": "13 Feb 2017", "title": "Resident Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of South Carolina", "Interview Descriptions": "A low-stress group interview on the first day and then a two-on-one interview. There will be a professional staff member and a current Resident Mentor asking questions. Length of wait time between the actual interview and hearing back varies: usually 2-3 weeks.", "Interview Questions": "Tell me about a time where you had a conflict with a team member and how it was resolved."}, {"date": "12 Jun 2017", "title": "McNAIR Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of South Carolina (Columbia, SC) in Aug 2016", "Interview Descriptions": "I got a tour of the facilities and talked to many employees. There was not much of an interview which was nice. After touring the facility I got to begin my research the following week. There was a quick turnaround.", "Interview Questions": "In what area would you like to work?"}, {"date": "17 Dec 2016", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of South Carolina (Columbia, SC) in Aug 2016", "Interview Descriptions": "The interview process was simply about whether I had the educational background and experience. Not much more than that. An assistant in the program contacted me by email, following up online with offer and schedule if I wanted to take.", "Interview Questions": "Do you have a M.A. or higher?"}, {"date": "5 Jul 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of South Carolina", "Interview Descriptions": "I applied online for the PhD admission. At the same time, i contacted few professors via email expressing interest in the research projects they were working on. I got a reply from one professor, and after exchanging few e-mails he asked me if I am available for Skype interview. We set a date for the interview and the interview was for about 30 minutes. He asked me about my academic background and previous projects etc.", "Interview Questions": "Questions related to my previous research projects?"}, {"date": "18 Apr 2018", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of South Carolina (Columbia, SC) in Jun 2016", "Interview Descriptions": "The hiring process for this position took about three months from the time it was posted until the time I was officially hired. My first interview was a phone interview with a round table of sorts where each member of the team asked me two questions each. After this step, I had an in person interview with the director and the Dean and again the members of the team I had previously met with over the phone. The questions carried a similar format.", "Interview Questions": "What are your strengths? What are your weaknesses?"}, {"date": "3 Mar 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of South Carolina", "Interview Descriptions": "It went pretty smooth. Nothing very technical. They asked why some of my grades were not very good and they were convinced by my answers. They asked me if I could start in 4 months and I could not. So they accepted to defer the offer to the much later time.", "Interview Questions": "Why are some of your grades not good?"}, {"date": "19 Nov 2018", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of South Carolina (Columbia, SC) in Feb 2016", "Interview Descriptions": "I met with our office manager who wet through my qualifications and the job responsibilities  before telling me I got the job. It was not too intimidating, and was definitely geared towards the type of worker I was, not what I had studied.", "Interview Questions": "What sort of office experience do you have?"}], [{"date": "20 Mar 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of South Carolina (Columbia, SC) in Nov 2015", "Interview Descriptions": "Have to take related courses and demonstrate sufficient understanding of the relevant material. Then there is check of knowledge on the basis of 1:1 interview. Keen interest in the subject is also considered.", "Interview Questions": "How comfortable are you with programming languages and which?"}, {"date": "8 Oct 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of South Carolina", "Interview Descriptions": "Upon applying online, my application was selected for an in person interview. I met with several people, but my interview was specifically with who would be, my director. I was asked about my experience in public health, in general. I was asked about my ability to coordinate and execute public health programs, collect and analyze data, presentation and writing skills, and what my expectations were for a postdoc.", "Interview Questions": "Tell me about your experience with publications in peer reviewed journals."}, {"date": "23 May 2018", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of South Carolina in Sept 2015", "Interview Descriptions": "Phone interview, days later a group interview (where the incumbent endorsed me), multiple emails with hiring manager over a month. Dragged out for two months attempting to meet my salary requirement. Pay too low for expertise.", "Interview Questions": "What do you know about our specialized accreditation?"}, {"date": "6 Mar 2019", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of South Carolina (Columbia, SC) in Sept 2015", "Interview Descriptions": "group training, first come first serve for the job. it is pretty easy and they accept any one with any sort of experience. you will do group training for the job and they let you wear most anything to the job", "Interview Questions": "how would you react in this challenging situation?"}, {"date": "9 Dec 2016", "title": "Student Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of South Carolina (Columbia, SC) in Jun 2015", "Interview Descriptions": "Round table meeting style with the standard office interview questions. Expect to give examples of how you dealt with situations such as rude students, overwhelming work situations, and how you would handle ethical issues.", "Interview Questions": "If an irrate student came into the office what would you do?"}, {"date": "14 Feb 2017", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at University of South Carolina (Columbia, SC) in May 2015", "Interview Descriptions": "was fairly straight forward, it included me talking to someone that runs a lab, and saying, \"sure I'll TA that class.\" then I filled out some paperwork. People already know who they want to TA classes for the most part, so it's more about experience.", "Interview Questions": "Do you want to TA this class?"}, {"date": "10 Jun 2016", "title": "Computer Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of South Carolina (Columbia, SC) in May 2015", "Interview Descriptions": "Quick interview. One manager made it clear he didn't want to hire me \"because of my class schedule\" then my other supervisor and him got into a bit of an argument because she wanted to hire me and then offered me the position.", "Interview Questions": "What are your plans after college?"}, {"date": "22 Mar 2016", "title": "Graphic Design Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of South Carolina (Columbia, SC) in May 2015", "Interview Descriptions": "I interviewed for a different position than I am currently at but my resume was passed along so I was asked to come in for an interview. Very easy offered me the position on the spot.", "Interview Questions": "Describe your design process"}, {"date": "1 Sept 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at University of South Carolina (Columbia, SC) in Apr 2015", "Interview Descriptions": "I went through the Higher Education and Student Affairs recruiting weekend, GARP. Unfortunately, I did not get a GA offer from GARP but later in the summer another office reached out to me for an interview.I had one Skype interview with them and was then offered the position. I felt that the questions were not overly challenging and I felt prepared to answer them. A group of staff members in the office interviewed me together.", "Interview Questions": "What would you tell a student that is studying abroad as advice?"}, {"date": "16 Mar 2016", "title": "Information Resource Consultant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of South Carolina (Columbia, SC) in Feb 2015", "Interview Descriptions": "The interview process was somewhat challenging, but fair.  I had to interview with a panel of eight assistant directors and two managers all at once.  I was asked anywhere between 2-5 questions per person on the panel.", "Interview Questions": "How does your experience align with the organizations objectives."}], [{"date": "12 Jun 2015", "title": "Telecounselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at University of South Carolina (Columbia, SC) in Feb 2015", "Interview Descriptions": "I initially found out about the position online and then completed the application. I turned in the application and three days later I received a call for a phone interview. The interview lasted about 10 minutes and was easy. She offered me the job the next day after completing the job interviews.", "Interview Questions": "She asked me if I liked to talk. I did because this job was tele counseling, where I would be talking all of the time and interacting with my coworkers to answer questions. She asked other questions like, \"how personable are you, do you have an issue with sharing detailed information?\" Things of that nature."}, {"date": "29 Sept 2015", "title": "Student Ambassador Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of South Carolina (Columbia, SC) in Jan 2015", "Interview Descriptions": "The application asked several questions about why you might want to be an ambassador, and after that a certain number of applicants were selected for an interview. The interview was with two people, the assistant director and a team member. Once you made it through the interview process, there was a \"cocktail\" type event in which you networked with both applicants and current ambassadors. From there they chose the new ambassadors.", "Interview Questions": "What other time commitments do you have?"}, {"date": "13 Jun 2015", "title": "Resident Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of South Carolina (Columbia, SC) in Jan 2015", "Interview Descriptions": "Three sections broken up: Depending on your color, you will be broken up and complete the group interview (mostly scenario discussion), individual interview, and an information session at random. You will then be notified if you got the job as an RM or an alternative, or none at all. About 40% of the people will be emailed the first day and others will take a couple of days.", "Interview Questions": "Give an example of when you were an organized person - and other scenario questions as an RM."}, {"date": "20 Jul 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at University of South Carolina (Columbia, SC) in Jan 2015", "Interview Descriptions": "There was no interview process. You apply to the school and say you want a graduate teaching assistantship. If they review your application and your papers are good enough, you get an offer. Otherwise maybe not.", "Interview Questions": "There were no questions asked. "}, {"date": "29 Dec 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of South Carolina in Dec 2014", "Interview Descriptions": "The student reaches out to the prospective professor with resume and research interest. If the professor thinks a close match, he/she might schedule a skype interview. If everything goes well professor might hire the student as Research Assistant.", "Interview Questions": "Just go over resume and previous experience. Discuss your expectation and career goals."}, {"date": "18 Nov 2014", "title": "Webmaster Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of South Carolina", "Interview Descriptions": "Applied through USC's job site and was called in by employer within 2 weeks for interview. Interview took about 30 minutes but left feeling like I was a solid candidate for the position. I could tell it was a laid back environment but you were expected to get the job done.", "Interview Questions": "Tell me about your most difficult challenge related to web design and how you resolved it."}, {"date": "22 Oct 2014", "title": "Fitness Staff Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "Very easy. You go speak with the fitness supervisor in his closet office in the weight room. He won't talk about anything specifically. If he likes you, or if you are a good looking girl, you will be hired.", "Interview Questions": "There are absolutely no difficult questions during the interview."}, {"date": "24 Aug 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of South Carolina", "Interview Descriptions": "Applied online and got a call within 12 hours, scheduling me for an interview within the next 6 hours. Then they called me back within 24 hours to tell me I was hired. Really quick at contacting me and getting the process done. The interview itself was very laid back.", "Interview Questions": "In your previous job, what did you do if you had an irate customer?"}, {"date": "29 Jan 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at University of South Carolina (Columbia, SC) in Aug 2014", "Interview Descriptions": "Write a very good statement of purpose, explain your achievements in the SOP, highlight the research experience, show your courage and ability to work, capability of maintaining study and research,  Initial screening from the human research coordinator, then meet with professor, meeting with graduate director,", "Interview Questions": "Just read your resume and explain your projects"}, {"date": "4 Oct 2015", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at University of South Carolina (Columbia, SC) in Aug 2014", "Interview Descriptions": "Very laid back and comfortable environment. Conversational. Eager to hire me in particular so my interview process could be different than others. Informational with presentation on expectations in particular job environment.", "Interview Questions": "Typical interview questions: strengths/weaknesses, what can you offer etc."}], [{"date": "27 Apr 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of South Carolina in Jul 2014", "Interview Descriptions": "The process was very brief. The staff is lovely, and they seem able to size up hardworking, dedicated workers through a few questions. The ability to work without a lot of oversight--but the willingness to ask for help if necessary--seem to be a few of the qualifying skills.", "Interview Questions": "When would you be able to start?"}, {"date": "4 May 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at University of South Carolina (Columbia, SC) in Jul 2014", "Interview Descriptions": "I met the professor at a conference and struck up a conversation. I then did a summer program in the lab and came back to graduate school. There was technically no formal interview, just a protracted informal interview.", "Interview Questions": "N/A"}, {"date": "6 Oct 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at University of South Carolina (Columbia, SC) in May 2014", "Interview Descriptions": "There was not really an interview. It was over email. I already worked there as a graduate student, and so they were excited to work with me as an adjunct. Quite a few graduate students carry over to adjuncts in this way. It is a nice extension for when a completed degree does not give you the experience to secure a higher paying job.", "Interview Questions": "How many classes do you want to teach between 1 and 4. There is no guarantee for any specific amount."}, {"date": "27 Mar 2014", "title": "Residential Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at University of South Carolina (Aiken, SC)", "Interview Descriptions": "The hiring and interview process takes course over a couple of months and is very detail oriented. There are three stages that each candidate that is successful in matriculation must go through. Overall, it is a nice experience and if given the opportunity one should take it.", "Interview Questions": "The interviews are not hard, it may be stressful answering scenario based questions. The majority of all questions asked are not meant to mislead only to gauge the thought process of the candidate."}, {"date": "15 Mar 2014", "title": "Graduate Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "some very specific questions, research oriented", "Interview Questions": "they are are related with the research area"}, {"date": "16 Aug 2016", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of South Carolina (Columbia, SC) in Mar 2014", "Interview Descriptions": "In-person interview with the PI. Showed the lab. talked with the graduate and undergraduate students. Also talked with the collaborators. gave a research presentation. Had meeting with head of the department.", "Interview Questions": "What is my future goal?"}, {"date": "16 Jan 2014", "title": "Accountant/Fiscal Manager III/Controller Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of South Carolina (Aiken, SC)", "Interview Descriptions": "Received call from HR who was rude and put the position down that I was interested in.  I interviewed and did very well.  Discovered later they already had a person in place. Very unprofessional.", "Interview Questions": "I was asked some questions regarding my experience which clearly showed they had not even read my resume'.   "}, {"date": "2 Dec 2013", "title": "Visiting Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at University of South Carolina (Charleston, SC)", "Interview Descriptions": "Very professional, kind and gracious, thorough, personable, made candidate feel valued.", "Interview Questions": "Asked questions about vision of service to the school- expected. Unexpected: questions debating particular points of research, for which one could not really prepare. "}, {"date": "22 Sept 2015", "title": "Graduate Program Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of South Carolina (Columbia, SC) in Dec 2013", "Interview Descriptions": "Very Easy interview process . They looked all about the resume and the paper I wrote before. He asked some basic questions about the statics and asked about the future plan.  They are friendly in communication but so hard in email sometimes. Though its a research center from outside but they are trying to make business all time.", "Interview Questions": "About paper writing time."}, {"date": "11 Jun 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of South Carolina (Columbia, SC) in Dec 2013", "Interview Descriptions": "This was a position that I negotiated prior to it being posted by the University. Thus, the posted position was essentially already filled, and I believe this happens A LOT with postdoctoral fellow positions. I would recommend trying to do the same, because many of the positions that you are seeing advertised, may be advertised only because it is required.", "Interview Questions": "They were research-specific, and otherwise, basic long-term goal related questions, very casual."}], [{"date": "17 Nov 2013", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "The hiring process included an interview and a campus visit.", "Interview Questions": "The interview questions were fair."}, {"date": "29 Dec 2015", "title": "Administrative Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of South Carolina (Columbia, SC) in Oct 2013", "Interview Descriptions": "It was a panel interview followed by a one-on-one with my direct supervisor. They were all very professional but very friendly and put me at ease. My supervisor asked a series of expected questions as well as \"what if\" scenarios.", "Interview Questions": "Why should we hire a new graduate as opposed to someone with more experience?"}, {"date": "25 Sept 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of South Carolina", "Interview Descriptions": "The best way to get this position is to find a professor in  your area of interest and contact him directly. If he wants you for his research group you have a great chance to get accepted in the program.", "Interview Questions": "N/A"}, {"date": "20 Jun 2013", "title": "Statistical Analyst Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "A mutual connection put my employer in touch with me.  They were already in the hiring process and hurried to schedule a phone call.  A day or two later we had another call with the director when they returned to the country.  I was presented with a written offer the next day.  I still had to submit my application online and wait for it to be cleared by HR.  This was certainly an unusual hiring experience but the HR formalities were standard.", "Interview Questions": "N/A"}, {"date": "5 Jun 2013", "title": "Career Coach Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of South Carolina", "Interview Descriptions": "Since this is a career oriented department, the interview is very formal and involves a lot of \"tell me about a time when\" questions.  Interview process began with a phone interview and then people were brought onto campus for two roundtable interviews and one presentation.", "Interview Questions": "Tell me about your supervision skills... especially when your supervisees are different than you. "}, {"date": "15 Sept 2013", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of South Carolina (Columbia, SC) in May 2013", "Interview Descriptions": "posted to jobmate. very straight forward", "Interview Questions": "N/A"}, {"date": "25 Apr 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "No interview. Just submitted my application online and mailed all the documents including test scores, resumes, personal statement, transcripts etc. and got the email offer. Then the official offer arrived as mail.", "Interview Questions": "No question"}, {"date": "22 Apr 2013", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at University of South Carolina", "Interview Descriptions": "Ask current RM to recommend me. Submit application through job mate. Sign upf or an interview time slot. One in person interview.", "Interview Questions": "Name a time when you offended someone."}, {"date": "21 Mar 2014", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of South Carolina (Columbia, SC) in Apr 2013", "Interview Descriptions": "Contacted a University employee about potential opportunities on campus for part-time students. They set me up with an on-campus interview that lasted about 30 minutes. Had to wait a couple weeks to hear back but eventually got the job.", "Interview Questions": "What makes a brand successful?"}, {"date": "2 Mar 2013", "title": "Systems Programmer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of South Carolina", "Interview Descriptions": "The hardest part is getting your resume past HR.  Once it goes to the department it is your standard call to setup an interview.", "Interview Questions": "No really hard questions especially for IT people."}], [{"date": "19 Aug 2017", "title": "Resident Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of South Carolina in Jan 2013", "Interview Descriptions": "The interview process was pretty  standard.  There were two interviewers and on of them was a current resident mentor.  I applied online and from there I got an interview.  The interview lasted about 30 minutes and  I heard back within a few weeks", "Interview Questions": "How have you mediated a conflict in the past?"}, {"date": "5 May 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of South Carolina (Columbia, SC) in Dec 2012", "Interview Descriptions": "The interview process was very short and subjective. It came down almost exclusively to my resume and past experience. I had a fairly long, but not particularly job-related, conversation with the graduate coordinator before going to speak with the dean of the school. He asked me a question or two about my educational history and then assigned me to a professor on the spot.", "Interview Questions": "What is your background, education-wise?"}, {"date": "2 Jan 2017", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at University of South Carolina (Columbia, SC) in May 2012", "Interview Descriptions": "The interview process consisted of a formal research presentation & question/discussion period and over a period of days, small informal group meetings with select faculty who shared the same areas of research interest. Some time was also spent discussing pedagogical ideas and preferences. In general, the process was open, relaxed and very professional.", "Interview Questions": "Questions were primarily directed toward stated areas of personal research interest and future plans for the development and delivery of research projects. All questions were within expected bounds of areas of interest."}, {"date": "4 Jul 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of South Carolina (Columbia, SC) in May 2012", "Interview Descriptions": "I knew a professor who was in need of a research assistant to complete a project funded through a private funding agency. The interview was informal, as the professor was already familiar with my work. This is typical, as the school seems to operate on strict nepotism. Most professors at the school of medicine employ their spouses, children, and friends, so a close connection is the only way to get a position.", "Interview Questions": "Will you work nights and weekends? "}, {"date": "22 Jan 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of South Carolina in May 2012", "Interview Descriptions": "First I emailed the Director of CBM Research Center letting him know about my interest along with my resume and a cover letter. After 2/3 weeks, I had a phone interview on the project I was interested to work.", "Interview Questions": "Why I am interested in that particular project? "}, {"date": "2 Oct 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of South Carolina (Columbia, SC) in Feb 2012", "Interview Descriptions": "Apply online for rolling admission.  If accepted, you are offered the ability to attend visitation weekend where you meet various faculty and current graduate students.  It is a great way to see if the university is the place for you.", "Interview Questions": "What research I was interested in."}, {"date": "23 Aug 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of South Carolina in Sept 2011", "Interview Descriptions": "One stage Phone Interview for an hour and Skype presentation in front of 2 person for one and half hour, in addition to online application process: GRE, TOEFL, transcript, Letter of Recommendation, etc.", "Interview Questions": "N/A"}, {"date": "9 Jun 2015", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of South Carolina (Columbia, SC) in Aug 2011", "Interview Descriptions": "It was a very easy straight forward interview.  In order to qualify you just need to pass Calculus 1, 2, 3, and 4 with an A (4.0).  They then called you to come and talk to the coordinator where they discussed what you would be doing, and then attended one session for an overview.  They are usually always in need for student tutors.", "Interview Questions": "Why do you want to tutor students in mathematics?"}, {"date": "25 Mar 2014", "title": "Graduate Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at University of South Carolina (Columbia, SC) in Aug 2011", "Interview Descriptions": "GRE, TOEFL and finally you have to clear an in house eligibility exam. Then you are appointed as a teaching assistant at different departments in the university.", "Interview Questions": "The extempore session where you have to teach a topic."}, {"date": "1 Aug 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of South Carolina (Columbia, SC) in Jul 2011", "Interview Descriptions": "Brief phone interview. Sent my resume in after seeing an online job posting, got a phone interview a couple days later. Short conversation about my experience and then got the offer.", "Interview Questions": "Would you be willing to work here?"}], [{"date": "17 May 2013", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of South Carolina in Jun 2011", "Interview Descriptions": "The Hiring Process wasn't very hard. They just asked what department I wanted to be placed in. I had several choices but I chose the presidents office. That first day I was given time to meet everyone in the office. They showed me where everything was and I settled in. I also was asked if I knew how to make documents, labels, and use a printer.", "Interview Questions": "There was no difficult question."}, {"date": "6 Apr 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of South Carolina (Columbia, SC) in Jun 2011", "Interview Descriptions": "Interviewed via phone before accepting visit offer. Very relaxed - professors are personable and they want you to feel comfortable. Once arriving, interviewed in person and was not asked many questions. Professors generally do all the talking.", "Interview Questions": "What have you been researching? What do you like best about research?"}, {"date": "21 Aug 2015", "title": "Resident Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at University of South Carolina (Columbia, SC) in Mar 2011", "Interview Descriptions": "First, one submitted an application. If excepted you were given a date, location and time to go through a serious of interviews. These interviews had two people with a set of question to ask between the two of them. Certain questions would lead to follow up questions, some being closed ended others open.", "Interview Questions": "They inquired about my ability to adapt to a crisis."}, {"date": "25 Feb 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of South Carolina (Columbia, SC) in Jul 2010", "Interview Descriptions": "Process was a bit lengthy for an administrative position.  However, the department had just gone through a difficult experience with an employee that previously held this position. They required interviews with management and upper management.  Environment was friendly and interview questions were suitable for the position. Once the interviews were completed they made the offer quickly.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "21 Aug 2014", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of South Carolina in Jul 2010", "Interview Descriptions": "The hiring process consist of me applying to the graduate school for a PhD in biological sciences. When I was in search for a research lab. I went and spoke with several principal investigators about their research and to see if there was an opening in their lab. I only spoke to principal investigator in which I was interested in their research.", "Interview Questions": "I really didn't get any difficult or unexpected questions. Most of the time the principal investigators were talking about their research, and trying to figure out if I was going to be a good fit in their lab. I think what was important to them is if I had research experience. "}, {"date": "29 May 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of South Carolina (Columbia, SC) in May 2010", "Interview Descriptions": "Showing your previous jobs and achievements to the adviser professor is very important to get accepted.", "Interview Questions": "How many publications do you think you can publish?"}, {"date": "9 Oct 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of South Carolina in Feb 2010", "Interview Descriptions": "Corresponded with graduate director initially and was happy with feedback so applied for graduate school through the system. Got the application fee waived for being a US citizen. Got a call letting me know I was accepted and a visit scheduled to see campus and meet faculty. It was relaxing to go \"interview\" with all faculty knowing I was already accepted.", "Interview Questions": "None, all professors explained their research"}, {"date": "2 Jul 2012", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of South Carolina (Columbia, SC) in Feb 2009", "Interview Descriptions": "they should have more interview, so I refuse to continue", "Interview Questions": "why do you apply for my company?"}, {"date": "23 Jul 2012", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at University of South Carolina (Brookhaven, NY) in Jul 2008", "Interview Descriptions": "I was introduced to my current boss by a friend and had an interview by phone, and I got the job.", "Interview Questions": "No technical or difficult questions"}]]