[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Managing clinical quality, safety and risk management", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Sept 2021", "job_title": "QA Manager in Melaka", "duration": "N/A", "pros": "Good pay, GLC, specialist hospital", "cons": "limited governance and leadership, no quality accreditation"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Very good working environment but poor management", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Jul 2014", "job_title": "Resident Medical Officer in Melaka", "duration": "N/A", "pros": "Specialist doctors are very nice, helpful and easy to refer too. Very calm working environment.\r\nwork of minimum 192 hours- extra pay if work more hours. (rm45/h in weekdays, 50/hours weekend)", "cons": "Seniority and politics.\r\nSupporting staff especially in A+E is undertrained- unable to recognized stable vs not stable patient.\r\nOver the weekend, at times critical patients are left under the care of medical officer- specialist incharge sometimes did not attend patient.\r\nMedical officer has to cover polyclinic and emergency department at the time per shift.if  Shifts after working hours need also cover inpatient wards incl procedure, emergencies, adhoc patients condition eg patient fall in ward.\r\nsome unethical practice eg: need to sign blood cross match form for inpatient we dont even attend.\r\nA+E has no triage system.\r\nvery small basic salary for such a huge responsibility.\r\nJob scopes was not mentioned in the agreement.\r\nalot of political members of the state attending the clinic need to give priority despite other patients already que.\r\nSenior manager who is arrogant, liar and lodge complains against hospital staffs.\r\nno CME for doctors- need to find own CME and submit to HR before able to attend."}]]