[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Among the best in the business", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "27 Aug 2018", "job_title": "Teacher in Yinchuan", "duration": "N/A", "pros": "ELIC deeply cares about its employees. It invests significantly in training and works hard to help whenever people have a problem.  Making an impact in the lives of people all over the globe.  Member care is excellent.", "cons": "It's a non-profit, so anyone working in the field needs to do significant fund-raising. Insurance costs have skyrocketed."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Very Average", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "26 Sept 2014", "job_title": "Teacher in Beijing, Beijing", "duration": "N/A", "pros": "Working overseas with ELIC was great at first. There was support and training that was good, especially for those without teaching experience. The TESOL certificate is nice. The idea of a team at your school or city is comforting as well.  \r\n\r\nMost people in the organization are nice and friendly.", "cons": "There is a big disconnect between on the field personnel and what it takes to be a successful ex-pat and what the people in Fort Collins actually hire. When they send someone to a country, the Fort Collins office is not dealing with the ramifications of those decisions. As such, they often make mistakes, which can make the average employees life difficult. \r\n\r\nThere were countless mistakes to support profiles that each teacher has. In my there were around 5,000 dollars of mistakes - misappropriations, money added when it shouldn't have been or taken out, assigned to the wrong teacher. One time 13 of us were in a meeting talking about profile expenses and every single person had had a mistake. One teacher, who had been with ELIC for almost 20 years, said he couldn't remember a year when there wasn't a mistake to his profile. \r\n\r\nA few years ago, they stopped recruiting teachers. Since this is an educational institution, I found this odd. Also, they continued to recruit families, when the salary paid by most universities is not enough to support western families. Most families then had to raise extra support."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best Year of my Life =)  China Teaching Fellowship", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Sept 2013", "job_title": "English Teacher in Taiyuan, Shanxi", "duration": "N/A", "pros": "Great work experience, incredible cross-cultural opportunities, great opportunity to live and work in community --and learn how to make that work with people who are different from you-- Invaluable lessons in learning from others.  This program creates the best environment for you to be successful in another culture, whether or not you've had experience living overseas.  You are placed in a team, with a team leader/mentor who helps you both with teaching and living in another culture and with a team.\r\nI would do this year over in a heartbeat.", "cons": "You live overseas for a year, which for some means you miss your family a whole lot.\r\nThere are lots of employees, so although there are lots of people in place to make sure you and your needs don't fall through the cracks, it's still possible for that to happen if you don't ask for help.\r\nThere's a big emphasis on employee retention (and many do stay after their first year commitment) which can feel like pressure.  In the end, I wanted to stay anyway because I'd had such an amazing experience. =)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": 5, "review_title": "Satisfying, Professional, Unforgettable", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Aug 2015", "job_title": "English Language Instructor in Hohhot", "duration": "N/A", "pros": "ELIC is very professional in all they do. Their mission is clear. Their training is top-notch. Their fundraising support is strong and their heart is full. I taught with ELIC for 4 years. They have a great support backbone, which is quite important working in a foreign country. Some teachers were independent and encountered all sorts of troubles. My team leader was professional and became a wonderful friend. My teammates were the same way. I will miss working with my team and some of the best in the TEFL field.", "cons": "Fundraising is still difficult in these days. Some of our teammates had no troubles, but we were constantly working against a deficit in our support. ELIC does not have outrageous support requirements unlike other organizations I know of, but it was still difficult. There has also been a lot of changes in leadership; not all bad but still made for a little instability."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "English Teacher", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Aug 2016", "job_title": "English Teacher in Yantai, Shandong", "duration": "N/A", "pros": "This is a great org! They take really good care of you and are great for someone who is going overseas for the first time. They teach you a lot about the culture and help you handle transition and ensure that you are equipped for your job.", "cons": "Working overseas always has it's problems: language, culture, comfort. Also, if you are an experienced veteran overseas ELIC may feel like there is a lot of oversight (although I tend to think that is a positive as it can be easy to become unhealthy when living in isolation overseas)"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Difficult on Families", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Oct 2015", "job_title": "English Instructor in Changsha, Hunan", "duration": "N/A", "pros": "Very loving people to work with. Great travel opportunities. Lots of great time with students and colleagues.", "cons": "Our team leaders were not very involved. Often times our legitimate concerns and needs were dismissed because we were so new to the country."}], []]