[[{"date": "24 Mar 2023", "title": "Floater Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health New Hanover Regional Medical Center in Mar 2023", "Interview Descriptions": "The interview process was very smooth. As long as you can treat people with the respect they deserve and handle certain customer service situations effectively you will have no issue getting hired. I believe the benefits are amazing so far of being hired at Novant and the people are very warm and responsive of any questions I have with the Onboarding process.", "Interview Questions": "What did you do to effectively handle a situation where someone was upset checking in at the front desk with you?"}, {"date": "23 Feb 2023", "title": "Clinical Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Novant Health New Hanover Regional Medical Center", "Interview Descriptions": "It was 2 interviews with a tour in between. The first was with two managers. The second interview was with a panel of potential coworkers. The panel interview was very much behavioral based.", "Interview Questions": "Tell me about a time where you had to prioritize one problem over another."}, {"date": "22 Feb 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Novant Health New Hanover Regional Medical Center", "Interview Descriptions": "They told me that my pay is way above their pay scale. They told me that they don’t hire people that ask for more money than their pay scale. I have a feeling this location is full of travel nurses. You can’t expect to pay 20 an hour for a RN and have them work 5 shifts a week to account for cost of living at the beach of all places. Five minutes on the phone with your recruitment office made me feel like I was undervalued and unappreciated. Have fun paying that traveller 70 an hour for a six week contract.", "Interview Questions": "What is your base pay rate?"}, {"date": "29 May 2023", "title": "Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health New Hanover Regional Medical Center (Berlin, WI) in Jan 2022", "Interview Descriptions": "The interview process typically consists of several stages that allow employers to assess candidates' qualifications, skills, and suitability for a particular role. While the specific process may vary between companies and positions, here is a general overview of the typical interview stages: Application and Resume Screening: Employers review submitted applications and resumes to identify candidates who meet the basic requirements for the position. This stage involves assessing candidates' education, work experience, skills, and relevant qualifications. Initial Phone or Video Interview: Selected candidates are often invited for an initial screening interview conducted over the phone or via video call. This interview serves as an opportunity for the employer to gain a preliminary understanding of the candidate's background, qualifications, and interest in the role. It may involve discussing the candidate's experience, skills, and availability. In-Person or Virtual Interviews: Candidates who pass the initial screening are usually invited for one or more in-person or virtual interviews. These interviews provide a more comprehensive evaluation of the candidate's qualifications, personality, and fit within the company culture. They can include the following types:", "Interview Questions": "The interview process typically consists of several stages that allow employers to assess candidates' qualifications, skills, and suitability for a particular role. While the specific process may vary between companies and positions, here is a general overview of the typical interview stages: Application and Resume Screening: Employers review submitted applications and resumes to identify candidates who meet the basic requirements for the position. This stage involves assessing candidates' education, work experience, skills, and relevant qualifications. Initial Phone or Video Interview: Selected candidates are often invited for an initial screening interview conducted over the phone or via video call. This interview serves as an opportunity for the employer to gain a preliminary understanding of the candidate's background, qualifications, and interest in the role. It may involve discussing the candidate's experience, skills, and availability. In-Person or Virtual Interviews: Candidates who pass the initial screening are usually invited for one or more in-person or virtual interviews. These interviews provide a more comprehensive evaluation of the candidate's qualifications, personality, and fit within the company culture. They can include the following types:"}, {"date": "19 Mar 2023", "title": "Business Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health New Hanover Regional Medical Center in Mar 2021", "Interview Descriptions": "Phone interview with Dept manager and Dept associates. My data driven mind set as to future tends did not appear to be in alignment with their stated \"reading of future trends.\" However, I later read some of my responses, almost verbatim, on one of the interviewers Linked in profile.", "Interview Questions": "How would you discern future trends in the health care field?"}, {"date": "9 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Novant Health New Hanover Regional Medical Center", "Interview Descriptions": "Panel interview,  2 interview process. Met with 3 interviewers the first meeting, then met with the unit manager and coordinator. Process was quick, 8 week orientation for med surg positions.", "Interview Questions": "Situational questions, how you would handle situations. Reflecting on previous situations. "}, {"date": "12 Apr 2021", "title": "Rad Special Imaging Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Sept 2020", "Interview Descriptions": "Interview process went well, within a few hours I was offered the job. Involved a one on one interview as well as   peer interviews. Felt very friendly, not interview type.", "Interview Questions": "Tell me about a time where your coworkers weren't doing their share and how did you handle the situation?"}, {"date": "7 Aug 2019", "title": "RN Staff Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC)", "Interview Descriptions": "I interviewed for 2 positions, one clinic one and one as a floor nurse int he hospital.  Both were BBI done by your peers.  It was difficult in one of my interviews because they asked two questions that were basically the same.  Both of mine were one on one interviews, so there were not other candidates there with me.", "Interview Questions": "Tell us about a situation where your assignment suddenly changed and what was the outcome?  Tell  us about a time you disagreed with a patient or coworker, how did you handle it and what was the outcome?  Tell us about you most difficult assignment and how did you handle it and what was the outcome?  "}, {"date": "6 Aug 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Novant Health New Hanover Regional Medical Center", "Interview Descriptions": "It is an interview at first with management and then it would include a group of your peers that would ask you certain questions That would be almost situational review", "Interview Questions": "Give a brief background of management"}, {"date": "17 Jul 2019", "title": "RN Clinical Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Novant Health New Hanover Regional Medical Center", "Interview Descriptions": "I was asked a number of Behavioral based interview questions first by 3 different managers both, clinical and non-clinical. After I met with the managers, I was then greeted by other medical staff throughout the facility. After that I sat for a peer interview with a panel of ladies. The questions were pretty simple, for example...”Describe a time when a patient or a family member was upset, what happened, what did you do to rectify the situation and what was the outcome...” Once my interview was complete, I was then given a tour of the facility and kindly escorted out. I received a call from Randy, the Clinical Recruiter in Human Resources two days later offering me the job.", "Interview Questions": "BBI questions"}], [{"date": "13 Sept 2019", "title": "Psychiatric Technician II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Jun 2019", "Interview Descriptions": "Applied online. Took about month after I applied, to set up an interview. They don't start interviews until after the application closing date. It was a panel interview with 2 education coordinators, 1 HR personal, your direct boss, and the boss of bosses. I thought the interview was pretty easy, I flowed and talked well with everyone. I actually felt confident about all my answers and how I was getting along with the room. Waited about 3 weeks with no word from anyone, so I sent a follow up email (with no response). Recieved a rejection email 3 months later.", "Interview Questions": "They were all assessment based questions. Which means they were \"what if...\" or your experiences. "}, {"date": "24 Jan 2019", "title": "Patient Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Jan 2019", "Interview Descriptions": "All behavioral based questions with  other team members I would be working with. They all had a grade sheet to grade me with. They asked me about 6 questions and just wanted to get to know me and what I did at the moment and how it was different from the new position I was interviewing for. The manager was out sick the day of my interview so she called me once she was back and interviewed with me one on one... 6 days later HR called me and I was offered the job.", "Interview Questions": "Name a time where you dealt with a difficult situation and how did you over come it?"}, {"date": "4 Mar 2019", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Dec 2018", "Interview Descriptions": "I had a phone interview through a different company that contacts the hospital. Then I got contacted the next day by NHRMC. There was multiple people that interviewed me from different floors. I had the chance to meet with my current Coworkers and A quick tour everyone was nice.", "Interview Questions": " Why should we hire you? "}, {"date": "10 Apr 2018", "title": "Information Systems Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Mar 2018", "Interview Descriptions": "The interview process was very drawn out. I first had a phone interview and then had an in-person interview two weeks later. There were three parts to the interview: About-me questions, behavioral questions, and I was given a task to write a SQL statement. I did not hear back until 3 weeks after.", "Interview Questions": "Why do you want this position?"}, {"date": "17 Oct 2020", "title": "Medical Lab Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Mar 2018", "Interview Descriptions": "Behavioral based interviews. A panel of potential coworkers will ask questions that require an actual scenario you encountered and how you handled it. Not hypothetical like “what would you do if you had a disagreement with a coworker?” More like “tell me about a time when you had a disagreement with a coworker. How did you handle it? What was the result?”  Very effective in seeing how you handle conflict and your work ethic. Another popular one is “tell me about a time where you went above and beyond to fill a customer’s need.”", "Interview Questions": "Tell me about a time where you went above and beyond to fill a customer’s need."}, {"date": "13 Jan 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC)", "Interview Descriptions": "Interviewed with 4 departments, mainly the Med/Surg new grad internship. I really want to work ED or ICU so I might hold out. I’m pretty sure I got the job, they said turn around time was typically less than a week.", "Interview Questions": "Why would you like to work here"}, {"date": "7 Oct 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health New Hanover Regional Medical Center in Jun 2017", "Interview Descriptions": "Had overall a good experience during the hiring process. Manager is very open and friendly. Make you want to be apart of the team. She introduced me to other members of the team, everyone was equally friendly and seemed excited to have me come aboard and be apart of the team.", "Interview Questions": "I do not recall since it has been over 5 years"}, {"date": "25 Jan 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Apr 2017", "Interview Descriptions": "It began with a formal application, then an in person interview with multiple people who asked about experience and behavioral/situational questions. I gave real world examples of things i had experienced, repeated the questions and followed up with \"is there anything i could have done to prepare or catch your eye for this interview?\"", "Interview Questions": "Tell me about a time when something did not go as planned and you made it work"}, {"date": "22 Mar 2017", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Mar 2017", "Interview Descriptions": "You meet with an HR rep briefly to go over starting dates, starting rate, etc. You then have an interview with that HR person and managers from the floor you applied to. After that you have a second interview with current employees for a peer interview. Questions are almost exclusively behavioral based interview questions, with the exception of one or two 'ice breaker' type questions in the very beginning.", "Interview Questions": "Tell us about a time when you were able to persuade others to see things your way. What was the result?"}, {"date": "20 Feb 2018", "title": "Buyer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Mar 2017", "Interview Descriptions": "It was a phone screening. It lasted about 15 minutes. I was asked about my computer experience. I was asked about my backgroud experience as it related to the job for which I was applying. Pretty basic-straing forward.", "Interview Questions": "Software experience"}], [{"date": "30 Jul 2018", "title": "ED Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health New Hanover Regional Medical Center in Jan 2016", "Interview Descriptions": "A video interview with HR that asked many general questions. It could be in person if you’re located closer to Wilmington. It was followed by an interview with the nurse manager. The interview was behavior based. It also asked about experience.", "Interview Questions": "When have you had a miscommunication with a patient?"}, {"date": "22 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Nov 2015", "Interview Descriptions": "I met with HR/Hiring managers and then after that I met with the peer review team. I was given info on benefits and pay during the interview process.They asked pretty standard behavioral interview questions. Then allowed time at the end to ask your own questions, so always come prepared. The whole process lasted about an hour.Everyone was very friendly.", "Interview Questions": "Name a time that you had to adjust to a situation and what did you do?"}, {"date": "28 Jul 2017", "title": "Patient Experience Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Nov 2015", "Interview Descriptions": "I met with the staff manager and two current employees at the time. We sat together in a room and discussed the job, my resume, and I was asked questions by the staff members. It was a very relaxed interview and I enjoyed it.", "Interview Questions": "How would you handle a patient death emotionally and learn to not bring it home with you? "}, {"date": "11 May 2015", "title": "Patient Liaison/Surgical Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in May 2015", "Interview Descriptions": "Got an email requesting that I provide 5 references and their email address. Once my references had completed a survey on my work ethics I was invited in for a face to face interview with a member of HR. The interview seemed to go okay until I was told the rate of pay. It was well below what I had expected especially with my background. I believe expressing my disappointed in the pay rate sent the interview south. The interviewer proceed to ask questions related to the job experience however if it wasn't an answer he want he would rudely interrupt and ask for a better example. Never before had this happen.", "Interview Questions": "Name a time you incurred a difficult situation and how did you handle it."}, {"date": "20 Apr 2015", "title": "Business Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Novant Health New Hanover Regional Medical Center", "Interview Descriptions": "Went through three types of interviews. One with HR, one with a manager and another with peers. They use behavioral based interview questions. Google behavioral based interview questions and youll get a feel of what your going to be asked, I researched it quite a bit before I went and it helped me at my interview with being more at ease because I felt more prepared. The HR interviewer was extremely nice and down to earth. Everyone was very very friendly which helped with my nervousness.", "Interview Questions": "Name a time you had miscommunication with another coworker and what did you do about it"}, {"date": "9 Nov 2018", "title": "Computer Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Sept 2014", "Interview Descriptions": "The interview process had 3 phases for the in-person meeting. The second phase was the most difficult due to it being the first time experiencing a panel interview. This is where my nerves took over and I clearly tripped on my words. However, the panelists were nice and it was a great learning process.", "Interview Questions": "Why have you applied for this position/what makes you want to relocate to the area?"}, {"date": "4 Jul 2014", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC)", "Interview Descriptions": "Called by HR rep and asked to come for an interview, then called again for interview with pharmacy management and other pharmacy technicians.  Received call 2 hours later offering me the job.", "Interview Questions": "What was my biggest challenge in my previous job?"}, {"date": "27 Jun 2014", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Novant Health New Hanover Regional Medical Center", "Interview Descriptions": "they ask questions that they really want to hear you praise other people not say anything about your self. they wanted to hear bad things about your last employer it seemed , which i as not going to do", "Interview Questions": "they implied , ithought a question where by it seemed i was to break hippa , which i wasn't about to do ,"}, {"date": "26 Jun 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Jun 2014", "Interview Descriptions": "Behavioral based interview.  The purpose is to get a glimse of your personality to see if your right for working at NHRMC.  They asked a series of questions that describe a very specific scenario that you are supposed to fit a past experience of your own into, even if you haven't had an experience like the hypothetical one described they make you give an answer. It is ridiculous that they base their decisions for hire on an interview like this, there is no way someone's ability to do the job can be accurately assessed with this type of interview. Good luck!", "Interview Questions": "Where do you see yourself 5 years from now?"}, {"date": "11 Jun 2015", "title": "Support Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Apr 2012", "Interview Descriptions": "They called my original supervisor first, then I had a peer interview and people that already worked there interviewed me. It was 4 people that worked in different parts of the operating room and they each asked me questions.", "Interview Questions": "What makes you qualified for this job."}], [{"date": "17 Aug 2016", "title": "Cleaning Person Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Mar 2012", "Interview Descriptions": "It was awful the lady went too far with her questions and when she didn't like my answers she flinched. Made me feel small and insignificant. All I wanted was a job and I'm a good, diligent worker, so I didn't appreciate being treated as a nobody during the interview. If she knew she wasn't going to hire me she should have just ended the questions.", "Interview Questions": "Would you want to be a nurse someday?"}, {"date": "9 Jul 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Jul 2011", "Interview Descriptions": "Group interview since many of the floors were hiring.  Multiple managers asking questions (around 4 -5 people).  A little overwhelming being my first real interview.  A couple of the managers made me feel super comfortable and smiled the entire time which eased my stress.  Typical behavioral nursing questions.  Second interview was a peer interview.  Much more comfortable and basically the same questions.", "Interview Questions": "What are your weaknesses?  Name a time you were in a stressful situation and how did you deal with it.  What type of person are you?"}, {"date": "26 Aug 2013", "title": "Chaplain Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Novant Health New Hanover Regional Medical Center (Wilmington, NC) in Apr 2011", "Interview Descriptions": "Was asked some discriminatory questions, like at my age why did I want to be a chaplain resident and with my disability, would I be able to complete the year.", "Interview Questions": "Unexpected and felt discriminatory"}]]