[[{"date": "22 Apr 2021", "title": "Youth Development Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Adult and Child Center", "Interview Descriptions": "Not stressful and very relaxed. They were really sweet and I related well to the interviewers. It was more of a conversation than an interview. I went through two interviews. One informal phone interview, and one formal video interview.", "Interview Questions": "What is your past experience and how does it relate?"}, {"date": "12 Sept 2020", "title": "Skills Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Adult and Child Center (Bloomington, IN) in Sept 2020", "Interview Descriptions": "Quick process, great questions, really care about quality of applicants.  Asked for real life examples to demonstrate experience and approach. Friendly and very conversational.  After the interview, I waited about a week before being offered a position. Once hired, HR contacted me immediately to start paperwork. Great formal process. They pay for all screenings and background checks.", "Interview Questions": "Describe your ideal supervisory style "}, {"date": "15 Jan 2021", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Adult and Child Center (Indianapolis, IN) in May 2019", "Interview Descriptions": "Panel of interviewers took turns asking questions. Then they give you your turn to ask questions. Be prepared with some performance based questions. It took about 40 minutes. They contact you back fairly quickly to move forward if things go well.", "Interview Questions": "One example is what is the population that you find challenging to work with?"}, {"date": "16 Oct 2018", "title": "Marketing Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Adult and Child Center (Indianapolis, IN) in Sept 2018", "Interview Descriptions": "The interview process lasted about 3 weeks. I first received an email, and then we set up a phone interview, followed by an in person interview. Only to find out I didn't get the job, but was offered the part time position at a much lower pay rate.", "Interview Questions": "Did I have experience in writing Press Releases, Design in Adobe?"}, {"date": "25 Aug 2017", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Adult and Child Center", "Interview Descriptions": "It starts with a phone screen and then goes to in person interview. \r\n\r\nIt depends on the person who is doing the interview. Some spend most of the time talking about the agency instead of asking questions.", "Interview Questions": "How do you handle difficult people. "}, {"date": "6 Feb 2016", "title": "School Based Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Adult and Child Center", "Interview Descriptions": "There was no process. I'm pretty sure they would have hired anyone who met education requirements. There was no hard questions, it was all very basic/general knowledge. The interview focused around what the job entails and not my experience.", "Interview Questions": "How can you help calm an upset child?"}, {"date": "3 Oct 2017", "title": "Staff Therapist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Adult and Child Center (Greenwood, IN) in Feb 2016", "Interview Descriptions": "The team I was there to apply for had a rude supervisor. She was not personable and she did not seem to like the color of my skin. Only by random luck there was another team in the same building that was hiring.", "Interview Questions": "They asked about my work history "}, {"date": "3 Nov 2017", "title": "School Based Therapist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Adult and Child Center (Indianapolis, IN) in May 2015", "Interview Descriptions": "Very casual, not what I expected. Pleasant conversation but was based more on what the company was about rather than whether or not I was qualified for the position. Job duties seemed vaguely described.", "Interview Questions": "I was asked to tell a little about myself."}, {"date": "22 May 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Adult and Child Center (Indianapolis, IN) in Mar 2015", "Interview Descriptions": "Yes and no decisions within a week, and paid internships at $10/HR. They are flexible around student schedules, but there's a lengthy on boarding process, where someone is basically full-time for a month.", "Interview Questions": "Tell me about why you're interested in social work and why our nonprofit especially."}, {"date": "6 Jan 2018", "title": "Skills Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Adult and Child Center (Indianapolis, IN) in Jul 2013", "Interview Descriptions": "A phone interview happened, and then a few days later I received a call about a face to face interview. The interview process was average and comfortable. The interviewing manager was nice. A tour of the facility was given and a breakdown of the different locations happened.", "Interview Questions": "What qualities and skills would I bring to this position. "}]]