[[{"date": "4 Apr 2023", "title": "Assistant Lecturer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at South Dakota Tech (Rapid City, SD) in Mar 2023", "Interview Descriptions": "The interview was informal and I was done in 30 minutes. The questions were more directed to classes. We emailed and I answered what classes I was interested in teaching.", "Interview Questions": "N/A"}, {"date": "5 Feb 2021", "title": "Secretary Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at South Dakota Tech (Rapid City, SD) in Jun 2020", "Interview Descriptions": "This was a very streamlined interview process. \nIt seemed very fair and objective. There were several scenario questions which I appreciate. I enjoy the opportunity to be able to show how I work in different situations.", "Interview Questions": "A situational question about multi tasking. "}, {"date": "19 Sept 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at South Dakota Tech", "Interview Descriptions": "I had three skype interviews. first one was more personal information about why I want to do a phd and why I was interested in that school. it was short. They send me a couple of papers and asked me to read them and present them after 2 days. papers were  related to the research projects  that i was going to work on if I got the offer", "Interview Questions": "they asked me to read a couple of papers and present them "}, {"date": "17 Jul 2019", "title": "Student Life Activity Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at South Dakota Tech in May 2019", "Interview Descriptions": "Video conferences by two individuals and a silent third.  There was no feed on my end but they didn’t reschedule. I asked to shadow the job and was declined.  Interview went fine but “ran out of time” for my questions.  Was half heartedly told to email them with no response. Not really convinced the ones doing the interview where confident or comfortable.  Heard rumors that jobs are rarely posted without candidates lined up by middle management", "Interview Questions": "One time you solved a conflict"}, {"date": "27 Sept 2017", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at South Dakota Tech (Rapid City, SD) in Apr 2017", "Interview Descriptions": "Several phone call interviews with different professors were used as interviews, along with several email questions. The interviewer (usually different professors in charge of different research projects) asked several questions regarding interest in their specific project, and how your skills might bring a new element to the table. Once the interviews were concluded, the professors talked among themselves and assigned you to a specific project that they felt fit you best, and you competed against the other people who were best suited for that research position.", "Interview Questions": "What type of research are you most interested in and why?"}, {"date": "10 Mar 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at South Dakota Tech (Rapid City, SD) in Jan 2017", "Interview Descriptions": "The initial approach to the professor via email, since my previous educational background, has relative research applications, he set up for a phone interview, questions were asked on TEM, XRD, material synthesis, data analyzing tools. Next, it was an online virtual interview presenting my previous work. And he got back to me in two weeks", "Interview Questions": "Questions on the technical part of the research,\r\nquestions on knowledge on TEM, SEM, XRD (it was not difficult, he was checking how much I know how to operate them)\r\nQuestions on long term commitment\r\n"}, {"date": "19 Jul 2016", "title": "Summer Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at South Dakota Tech", "Interview Descriptions": "The interview process was standard for the position. I met with the manager and other employees. Many of the questions involved past experiences and skills. It also involved a tour of the campus by an ambassador.", "Interview Questions": "What past positions did I have?"}, {"date": "29 Dec 2016", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at South Dakota Tech (New York, NY) in Aug 2014", "Interview Descriptions": "Its straight forward hiring process: Applied online, telephone interview, background check and offer letter. Overall interview is easy. Mostly questions are about research background and technical skills. Got the confirmation during the interview and received offer letter after 3 weeks.", "Interview Questions": "Tell about yourself"}, {"date": "28 May 2017", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at South Dakota Tech (Rapid City, SD) in May 2014", "Interview Descriptions": "The interview process was standard for the position. I met with the manager and other employees. Many of the questions involved past experiences and skills. It also involved a tour of the campus by an ambassador.", "Interview Questions": "Q"}, {"date": "30 Nov 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at South Dakota Tech (Rapid City, SD) in Apr 2014", "Interview Descriptions": "After submission of application I first received a confirmation email then following got another email from the graduate school for a phone interview schedule. I had a phone interview with the Dean. It was straight forward.", "Interview Questions": "Why do you want to get a PhD? He asked me why I wanted to obtain a PhD? why School of Mines? what are my long term goals? I talked about my long term goals of becoming a researcher/professor in academia. "}], [{"date": "3 Aug 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at South Dakota Tech (Rapid City, SD) in Nov 2011", "Interview Descriptions": "It was simple interview with my supervisor. He asked about my research interest, why I want to pursue grad. education. My supervisor asked me about any laboratory experience, field sampling, data analysis experience and etc. Especially they wanted someone with knowledge on GC. Overall it was a great interview. I finally got the offer and accept it.", "Interview Questions": "How can you contribute in our laboratory?"}, {"date": "10 May 2012", "title": "Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 1 day. I interviewed at South Dakota Tech (South Bend, IN) in Feb 2011", "Interview Descriptions": "Applied online. 6 interviewers,  including faculty, staff and administrator.  Each one asked one question.", "Interview Questions": "What is the strength and weekness?"}, {"date": "27 Jan 2012", "title": "Assistant Laboritory Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at South Dakota Tech (Rapid City, SD) in Feb 2010", "Interview Descriptions": "I knew a person that worked at SDSMT and he let me give the laboratory director a resume. The director of the lab gave me an on the spot interview and from there on it was just a matter of paperwork and waiting as the South Dakota School system hiring processes move very slow.", "Interview Questions": "What types of skills do you have that would be related to this job?"}]]