[[{"date": "5 May 2022", "title": "Post Doctoral Fellow Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colby College", "Interview Descriptions": "I was contacted by email and then had an hour long interview with 4 people from across the college. Every one was very nice and they had good energy. Building to a more immersive, day long round of interviews. I couldn't continue on because of other opportunities, but they seemed like a great group to work with.", "Interview Questions": "How do you see yourself fitting at Colby specifically?"}, {"date": "21 Oct 2022", "title": "Assistant Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colby College (Waterville, ME) in May 2022", "Interview Descriptions": "Very dissatisfactory as the person interviewing me was distracted and looking at his phone the entire time, never once bothering to apologize or even explain that it was urgent or work related. The questions were rote and basic as though they didn't even care who they offered this role to, or if the person was even qualified. I have heard that a lot of people are leaving Colby College and this interview explains why", "Interview Questions": "What can I contribute to \"the team\""}, {"date": "11 Feb 2021", "title": "Museum Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Colby College", "Interview Descriptions": "The interview process was smooth and informative. I got the opportunity to meet the whole team I would be working with, which gave us all the chance to get to know each other before I was hired.", "Interview Questions": "Why are you qualified for this job? "}, {"date": "24 Feb 2021", "title": "Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Colby College in Jul 2020", "Interview Descriptions": "Process took between 5-6 months with multiple single interviews with staff/faculty/students throughout the last 4 months. I had to contact the manager of the department about 4-5 times over the process to ask for updates regarding my application. The manager would send an email with a misspelling of my name and forget to set up interviews and give me <24 hours notice of some interviews.  During an interview, a colleague made a political statement. Manager asked for references, never contacted any. After months of interviewing, manager scheduled a call to let me know I was not selected for the role. Stated I did not have enough relevant experience.  Thanked me for my time. 3 months later, the industry position has not been filled and has been updated with a completely different role than the one that was advertised.", "Interview Questions": "Why Colby?\r\nWhat relevant experience do you have?\r\nHave you traveled abroad?\r\n"}, {"date": "27 Mar 2020", "title": "Admissions Visit Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Colby College", "Interview Descriptions": "I was interviewed by 4 people at once. They got to know me and my interest in being an intern, and the skillsets I could bring to the company. Situational questions were common.", "Interview Questions": "You're giving a tour and a parent asks about party culture at Colby. What do you say?"}, {"date": "1 Jun 2018", "title": "Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Colby College", "Interview Descriptions": "easy interview- about 20/30 minutes with two people from the office. nice people- communicated things with my quickly which i appreciated. interview was over skype and they were clear about their hiring process and timeline. overall good expereince", "Interview Questions": "how did you deal with a  supervisor"}, {"date": "25 Jun 2021", "title": "Community Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Colby College (Waterville, ME) in Feb 2018", "Interview Descriptions": "Usually an interview with two senior CA students or the director of the hall staff program. Rather quick, and easy going. They go over your application and present some scenarios for you to consider", "Interview Questions": "They asked about how I would deal with conflicts among residents in the dorm "}, {"date": "17 Jan 2018", "title": "IT Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Colby College (Waterville, ME) in Sept 2017", "Interview Descriptions": "There was a small interview to check that you were literate in technology. They asked very basic questions regarding computer, phones, and also questions regarding customer service. None of the questions were difficult.", "Interview Questions": "How how would you fix a computer whose wifi is not connecting?"}, {"date": "28 May 2020", "title": "Information Technology Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Colby College (Waterville, ME) in May 2017", "Interview Descriptions": "I had a job interview a few years ago and it was one of the worst I have ever experienced.\r\n\r\nI have a degree in IT as well as experience but they did not want to interview me initially. I ended up also applying through a contract position and after applying they decided to interview me through the direct application instead.\r\n\r\nI answered all the interview questions thoroughly yet was not offered a position. It is the only interview where I got the impression they have a cookie cutter image of an IT person based on their current employees - all young white males. I am a female.\r\n\r\nA few months later when I was working at a different company, a coworker mentioned he had interviewed at Colby as well. He was moving to the area and was promised the position before moving. Once they met him in person, they did not hire him. He was a black male.\r\n\r\nI would never apply here again because they will discriminate.", "Interview Questions": "N/A"}, {"date": "24 Oct 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Colby College in Feb 2017", "Interview Descriptions": "Sent in a cover letter and resume through the college's online portal. Then I was asked to come in for an interview. I was hired shortly after with three other students and started in June.", "Interview Questions": "Why should I hire you?"}], [{"date": "28 Feb 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Colby College (Waterville, ME) in Jan 2017", "Interview Descriptions": "I found the professor and asked him about his research and when I found that I was interested, I put in my application and he accepted me almost immediately. It was more of a formality once I had reached out to him and expressed my interest in the job.", "Interview Questions": "Why am I interested in this job?"}, {"date": "12 Oct 2017", "title": "Media Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Colby College (Waterville, ME) in Jan 2016", "Interview Descriptions": "easy, no real questions just a walk through about what they do and how it works to help students and professors on campus fix media stuff. only basic background info asked", "Interview Questions": "What technical stuff have u done before"}, {"date": "3 Oct 2015", "title": "Colby College Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Colby College", "Interview Descriptions": "A few questions about what other things I was involved in and what prior work experience I had. I was not an art or music student but the interview seemed to be geared more towards just seeing if I was someone who could hold a conversation and was easy to work with.", "Interview Questions": "What experience do you have with customer service?"}, {"date": "4 Mar 2014", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Colby College", "Interview Descriptions": "I applied to an opportunity at the college through their Human Resources site and was extended a phone interview within two weeks. The phone interview assessed my interest in the position, the department and the college. Assessed my knowledge on liberal arts institutions and trends in higher education. It further inquired on my advising and programmatic style. I was then extended an on-campus interview that last all day meeting with the entire staff of the department, members of the Campus Life team, Development and Alumni Relations team, and members of the faculty. Questions expanded upon my phone interview assessing my advising and programming style, how I work with college students, how I establish relationships across campus constituency groups, etc.", "Interview Questions": "While it wasn't difficult, I was asked what student development theory I most commonly align with and how it affects my work."}, {"date": "1 Aug 2013", "title": "PCSS Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Colby College (Waterville, ME) in Apr 2013", "Interview Descriptions": "Only one interview and a few days to wait for respond. Response given in person. Excellent work conditions, and vacations throughout the year. People are extremely nice", "Interview Questions": "Not being given enough instructions to complete a job"}, {"date": "10 Apr 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at Colby College (Waterville, ME) in Jan 2012", "Interview Descriptions": "A simple set of interviews with supervising professors landed me this interview.", "Interview Questions": "Where do you see yourself in 5 years?"}]]