[[{"date": "28 May 2023", "title": "Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Chicago State University (Chicago, IL)", "Interview Descriptions": "The interview questions were fine. Although the staff seemed like they would be great to work with, the person who would have been the supervisor did not seem cordial. My recommender commented about this.", "Interview Questions": "May you tell me about yourself?"}, {"date": "23 Nov 2021", "title": "Sports ID Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Chicago State University", "Interview Descriptions": "Already employed 3 plus years. Interviewed for a new position in the same department. Total waste of time. They didn’t want me in the position so they wasted both our time.", "Interview Questions": "How do I think my current role translates to this open position. "}, {"date": "25 Jan 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Chicago State University (Chicago, IL) in Oct 2021", "Interview Descriptions": "It was interesting. It took a long time to get a decision, I had to constantly email to check in on my space within the process which I didn't care for. However, everyone seemed to be pretty nice. The amount of work you do for the pay isn't that good, however, great people to do around.", "Interview Questions": "Previous Experience while working in the field"}, {"date": "21 May 2017", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Chicago State University", "Interview Descriptions": "I do not believe I had the typical interview. I knew the hiring person from years ago, what started off as a casual conversation turned into an opportunity to interview within 10 minutews. But the questions ranged from academic philosophy, culture, and subject matter to name a few.", "Interview Questions": "N/A"}, {"date": "5 Jan 2016", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Chicago State University", "Interview Descriptions": "Difficult. I had to come to campus multiple times and pay for parking each of those times. Which would have been fine if someone had given me the heads up about it. Then it took forever to get my offer letter. Once I got it it was wrong and then it took several weeks to get it corrected.", "Interview Questions": "Why Chicago State?"}, {"date": "21 Jan 2016", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Chicago State University (Chicago, IL) in Oct 2015", "Interview Descriptions": "I applied for the position online than talk with the person i the department about the position. The employer said that I needed additional experience in 3D modeling. I told the employer that I would  learn the program. So I took the a class on autodesk inventor and got the position.", "Interview Questions": "do you have any experience in aerodynamic"}, {"date": "9 Jan 2015", "title": "Math Tutor- Learning Assistance Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Chicago State University", "Interview Descriptions": "Take a mathematics test to see your level of math knowledge, get to speak with the director and coordinator, why would you like to work here etc.\r\nYou basically got to know your potential work environment and coworkers", "Interview Questions": "Why here, how well do you work with people, math aptitude test etc"}, {"date": "8 May 2015", "title": "Clinical Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Chicago State University (Chicago, IL) in Nov 2014", "Interview Descriptions": "I want to compliment an interviewer.  I applied after being recommended by a friend and I thought the interview was very professional and straight forward.  There was initially and application process and I needed to provide references that were consulted.  I was fortunate to have other educators on my side.  There was a drug test and a personality test.  I did have to present in front of a panel.  It was important to connect with many people who were currently working.  It was important not only appear competent but a good fit.", "Interview Questions": "I was interviewed by Marion Phillips.  She was amazing.  She asked me very simply Why did I first want to become an Educator.  The question relaxed me immediately and I was able to share my passion and dreams.  It was the best interview I had"}, {"date": "8 Aug 2014", "title": "Dean Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Chicago State University (Chicago, IL) in Jul 2014", "Interview Descriptions": "I arrived on campus for the interview. Even though no one else was being interviewed on that day, the search committee was more than 30 minutes late and there were only two members who showed up. The final part of the interview with faculty only had one member show up.", "Interview Questions": "N/A"}, {"date": "24 Feb 2015", "title": "Director of Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Chicago State University (Chicago, IL) in Feb 2014", "Interview Descriptions": "The interview process lasted several months. There were four different sets of interviews with various panels ranging from the Deans of Colleges to the President of the University. The overall process was fine and the people that i interviewed with were very polite. Just like with any interview you have to be prepared and know how your skills coincide with the position. y.", "Interview Questions": "What are your strengths and weaknesses?\r\nHow does your background relate to this position?\r\nHow much money have you raised?"}], [{"date": "26 Aug 2016", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Chicago State University (Chicago, IL) in Sept 2012", "Interview Descriptions": "I met with a Department Director and then I met with the Dean of the college for an interview\r\nIt was a two step process.  I made it through the first part and it was pleasant then I needed to explain my gap of work experience for a year.  I was asked to include my continuing education", "Interview Questions": "What advising experience did I have\r\nHow much did I make on my previous job"}, {"date": "3 Nov 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Chicago State University (Chicago, IL) in Jan 2012", "Interview Descriptions": "It starts off as a one on one interview with the professor where your given information on the research his or her graduate student is involved with.  After which, you meet the graduate student and see the work space.", "Interview Questions": "What are your plans for the future?"}, {"date": "24 Jul 2015", "title": "Help Desk Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Chicago State University (Chicago, IL) in May 2011", "Interview Descriptions": "very un professional. Manager was on the phone the whole time. People came in and out of the office several times. Employees walked around like a chicken with their head cut-off.", "Interview Questions": "What hours do you want?"}, {"date": "28 Mar 2012", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 days. I interviewed at Chicago State University (Chicago, IL) in Sept 2010", "Interview Descriptions": "My employee called me and we made an appoinment for a skill test. I had only 1 interview.", "Interview Questions": "Why do you want to work here?"}]]