[[{"date": "24 Feb 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Armed Conflict Location & Event Data Project", "Interview Descriptions": "There was a skill test, similar to what I will be doing in my rol. There was a guide and news to analyse and put into an excel table. You had a couple of hours to do it.", "Interview Questions": "As I mentioned, it was a test"}, {"date": "28 Mar 2022", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Armed Conflict Location & Event Data Project in Feb 2022", "Interview Descriptions": "The process consisted of 3 phases: 1 written test to be completed remotely within a short deadline and 2 interviews (with HR and technical team).\r\nOverall, the questions were quite accessible and the process felt feasible. However, the interview feedback was not given in due time. In fact, I was able to receive a final answer only after many email remainders, three weeks after my last interview, despite being told that I was going to get an answer in a matter of days. After going through so many steps of the selection process, it was quite humiliating having to beg for a final answer. Not very professional of them.", "Interview Questions": "What are some challenges you can imagine the company will face within the next months?"}, {"date": "31 Jan 2022", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Armed Conflict Location & Event Data Project in Dec 2021", "Interview Descriptions": "Through zoom, was joined by interviewer and HR personnel.  asked about knowledge of the region and language proficiency,  didnt get any experience questions. Interviewer was nice and wanted to see if i was a fit for the position. Overall great experience.", "Interview Questions": "Are you proficient in the required language?"}, {"date": "30 Aug 2021", "title": "Caribbean Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Armed Conflict Location & Event Data Project", "Interview Descriptions": "The process was relatively fast and straightforward. In the end I was not selected but the coding exercise and interview were well structured. Only note is that the Coding exercise is very long and might be shortened for future applicants.", "Interview Questions": "Asked about knowledge of conflict dynamics and actors in the position’s region."}, {"date": "26 Jul 2021", "title": "Multiple Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Armed Conflict Location & Event Data Project in Dec 2020", "Interview Descriptions": "I applied to several positions with ACLED in the last year. In one case, I had completed an interview as well as a work test that took an entire day to complete, after which I was told that the position was no longer available, without any explanation. In another case, I was told that recruitment for the position had been postponed to \"the first half of 2021\", again without explanation. I was told I would be contacted about any updates, but never heard back from them. Overall, applying with ACLED has been a very disappointing and time-wasting experience.", "Interview Questions": "Data analysis and management skills"}, {"date": "24 Jan 2023", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Armed Conflict Location & Event Data Project (Rio de Janeiro) in Aug 2019", "Interview Descriptions": "First they call you for an interview with Research Manager and Human Resources Officer. It will be an ordinary job interview, where they ask you about your past jobs and your experience, and the area of expertise. Secondly, you have to make a test on your research abilities.", "Interview Questions": "Do you know what ACLED does? Are you familiar with the region? Did you live there? What's your degree? Do you have experience in research? Are you familiar with data analysis?"}], []]