[[{"date": "18 Apr 2023", "title": "Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Biola University (La Mirada, CA)", "Interview Descriptions": "First, a phone call interview was scheduled. The next step was an in-person/zoom interview with the hiring committee. Lastly, there was an interview with Human Resources. It took a few weeks for the entire process including background checks.", "Interview Questions": "1. Can you share something about yourself? 2. What is your greatest professional/personal accomplishment?"}, {"date": "14 Nov 2022", "title": "Director of Events Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Biola University", "Interview Descriptions": "The interview process included an initial interview with the Director overseeing this department, then included a peer team interview with other Assistant Director Roles, then there was also a team interview with the team members that were to be supervised.", "Interview Questions": "Questions were standard interview questions."}, {"date": "13 Nov 2021", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Biola University", "Interview Descriptions": "The interview process for this role did not exist. Offers for this position were distributed by the department coordinator after recommendation by a department professor. The hiring process involved a short discussion between coordinator and employee before final approval by the finance department.", "Interview Questions": "N/A"}, {"date": "28 Oct 2021", "title": "Graduate Admissions Counselor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Biola University", "Interview Descriptions": "Started with a phone interview, then a team interview, then finished off with an HR interview. Relatively simple questions; 2nd round of interview, questions were provided ahead of time to help you prep!", "Interview Questions": "Describe a situation in the past where you were challenged to grow in the area of diversity and inclusion. What was the situaton? What action did you take, and what was the result?"}, {"date": "24 Aug 2021", "title": "Student Teaching Placement Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Biola University", "Interview Descriptions": "Contacted by the Dean of the School of Ed, in-person interview with a panel of staff/faculty, follow-up interview with an HR representative - all very kind people and a pleasant, informative experience", "Interview Questions": "What area is God helping you to grow in professionally?"}, {"date": "27 Jun 2021", "title": "Circulation Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Biola University", "Interview Descriptions": "I was asked detailed questions about my ability to relate with patrons, how to give directions, and about my interpersonal interactions with team players. It took some time to receive a response due to the high volume of candidates, but overall the process was rewarding and the people were kind.", "Interview Questions": "A question they asked which really stuck out to me was, \"how do you make a peanut butter jelly sandwich,\" "}, {"date": "15 May 2021", "title": "CRM & Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Biola University (La Mirada, CA)", "Interview Descriptions": "I was asked to duplicate an example of a web page they gave me to demonstrate my knowledge of HTML. A few days later the I was asked to do a panel interview with about 6 people.", "Interview Questions": "What are you most passionate about?"}, {"date": "15 Dec 2020", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Biola University (La Mirada, CA) in Oct 2020", "Interview Descriptions": "My first interview was with the hiring manager. I thought it went really well and was told that they would be doing a second round of interviews with the Sr. Director in the coming weeks and if they should decide to move on with me, I would receive a separate invitation. I didn't hear anything for over a month that they decided to go with someone else.\n\nPrior to the interview, they give you a marketing assignment, which had 3 projects to complete.  I spent some time thoughtfully completing them and moved on to secure an interview. Also, the application on their website was very long. To save everyone's valuable time, I wish had been up front about the salary, or hourly pay rate, in the job posting. If they had, I would have never applied.  They are offering  far too little for this role and nowhere near the industry average. This would be a good job for someone starting right out of college. Perhaps if they just had one marketing manager for all of admissions, then they could pay a competitive wage.", "Interview Questions": "Tell me about yourself, your experience, and what draws you to this position."}, {"date": "19 Sept 2020", "title": "Vice President of Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Biola University", "Interview Descriptions": "The interview process was very well organized. I had to submit a Google Form to SMU answering questions. I was interviewed by the VP of Finance and a Senator. Make sure you arrive early to the interview.", "Interview Questions": "Why do you think you are a good fit for this position?"}, {"date": "18 Sept 2020", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Biola University", "Interview Descriptions": "The first round was with a group and interviewed with many leaders in admissions. Second round was with the immediate team. The third round was with HR (background check, workplace aptitude test, testimony).", "Interview Questions": "Describe my intercultural and professional experiences."}], [{"date": "29 Sept 2020", "title": "Fieldwork Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Biola University (La Mirada, CA) in Jul 2020", "Interview Descriptions": "There were three interviews. The first was with one person, the second was with a panel and the last was with the dean of the school. Each interview had a different set of questions.", "Interview Questions": "What are you not good at?"}, {"date": "18 Jan 2019", "title": "IT Help Desk Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Biola University", "Interview Descriptions": "Met with the director of Tech Support and he just went through my resume and asked about each item on it, and how each job qualified me to work for his department.", "Interview Questions": "How is *specific job from resume* helpful for the job you would perform here?"}, {"date": "2 Apr 2022", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Biola University (La Mirada, CA) in Mar 2018", "Interview Descriptions": "The overall tone was friendly and professional. The atmosphere was casual and not intimidating. It was an enjoyable experience. Questions and feedback were relevant. Love the experience and learnt a lot.", "Interview Questions": "Why do you want for Biola? "}, {"date": "27 Mar 2017", "title": "Gate Attendant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Biola University (La Mirada, CA) in Feb 2017", "Interview Descriptions": "It was nice. I was interviewed by an officer and an investigator but they did their best to be friendly and make me feel comfortable. They alternated in asking questions and were personable.", "Interview Questions": "What would you do if you saw a fellow employee slacking on their duties?"}, {"date": "30 Jan 2017", "title": "Assistant to the Executive Assistant - Office of Advancement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Biola University (La Mirada, CA) in Sept 2016", "Interview Descriptions": "It was very friendly, open, and clear. I felt extremely welcome and the person interviewing me was very eager about the possibility of me joining the team. I was made aware of the duties of the job and the everyday functions that I would be asked to perform. During the process, I was able to sense whether this would be a good environment for me to work and I believed that it would be. Every first impression that I had was good and I was excited for the opportunity. I not only was told about the job and details of it, but also about how the position would benefit me in the present and the future and how my employer would come alongside me to advance my position not only at Biola but in other areas. It was a very positive experience and an excellent interview.", "Interview Questions": "Do you have experience with Raiser's Edge?"}, {"date": "25 Jul 2016", "title": "Admission' S Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Biola University (La Mirada, CA) in Jul 2016", "Interview Descriptions": "First interview is a group interview where they ask each person (can be over 10 people) a questions and once that person has answered the question is opened up to 3-4 others. Its a way to see who stands out from the crowd and has the energy for that position.", "Interview Questions": "How important is diversity to the university or an educational institution? How would you handle a non-believer who wanted to enroll? What type of role do you take in a team environment? "}, {"date": "22 Nov 2018", "title": "Library Reference Services Assistant (Student Job) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Biola University (La Mirada, CA) in Apr 2016", "Interview Descriptions": "+Was contacted to take a test assessing attention to detail.\r\n+After successful completion of that test, I went in for an interview.\r\n+I was not picked on the first run, but was called and offered the job after an opening came.", "Interview Questions": "What would you do if you don't know the answer to a question or problem?"}, {"date": "9 Mar 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Biola University (La Mirada, CA) in Mar 2016", "Interview Descriptions": "Easy just asked the professor if I could be their TA. Just had to have good grades for that class and make sure you know how to help others. 1 on 1 interview nothing difficult", "Interview Questions": "No interview questions"}, {"date": "6 Sept 2017", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Biola University (La Mirada, CA) in Oct 2015", "Interview Descriptions": "Easy to do. Easy questions. Basic test on details. 2 people interview you and ask about your major, strength, weakness, Biola contract, etc. They give you potential situations with patrons and see how you would handle it. They take a while to respond back via email, because they have a lot of applicants", "Interview Questions": "How would you make a peanut butter jelly sandwich?"}, {"date": "22 Jan 2016", "title": "Student IT Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Biola University (La Mirada, CA) in Aug 2015", "Interview Descriptions": "The hardest part is getting an interview. You likely need a connection of some sort to get a foot in the door, since there are many applicants and not much time to look at resumes. After getting an interview, you sit down with the IT Admin, IT Coordinator, and the head of IT. They ask you questions about your character, what you would do in a difficult situation, integrity, your IT experience, and anything on your resume they find interesting. As long as you know your resume and hold Christian values, you should be accepted if there is an opening for you.", "Interview Questions": "What is the reason for your work gap?"}], [{"date": "22 Jun 2015", "title": "Transfer Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Biola University", "Interview Descriptions": "I was invited to a group interview that consisted of about 12 people. We sat before a panel of about 8 people and were asked a number of questions pertaining to the job and certain scenarios. The whole thing lasted about 3 1/2 hours. At the end we completed a survey describing how we thought we did and were told they'd be calling people for second individual interviews after they deliberated.", "Interview Questions": "How would you handle a prospective student that was interested in Biola but was not a believer?"}, {"date": "21 Aug 2017", "title": "Assistant Director of Alumni Relations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Biola University (Los Angeles, CA) in Mar 2015", "Interview Descriptions": "Thoughtful and Genuine. The people that interviewed me seemed to want to know me as a person in addition to my experience. Their questions showed that they knew what they were looking for. They took a lot to time to get to know me.", "Interview Questions": "What experience do you have working with alumni?"}, {"date": "23 Feb 2015", "title": "Web Design Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Biola University (La Mirada, CA)", "Interview Descriptions": "I spoke with two people: the Director of University Communications and Marketing, and the Associate Director of Interactive Media. It's a small shop, so I worked closely with the latter person after I was hired. The questions from the Director of University Communications and Marketing were higher-level questions aimed in part at making sure I understood and was on-track with the mission of the team. They focus primarily on the outward-directed aspects of design (the public face of the University, working to attract prospective students, etc.) rather than the inward-focused aspects (e.g., assisting faculty with Blackboard issues). The second interviewer asked more technical questions about my background, my skill set, and my willingness to continue learning and developing as a web designer.", "Interview Questions": "I was asked to define \"design.\""}, {"date": "8 Oct 2016", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Biola University (New York, NY) in Oct 2014", "Interview Descriptions": "The interview process was a group interview process with about twenty or so applicants.  We were all interviewed by a panel of about ten interviewers.  I felt very nervous at the time!  Looking back, I feel I could have done better and been less nervous, had I been told beforehand how the interview would be conducted.", "Interview Questions": "How would you promote Biola to a new incoming student?"}, {"date": "10 Apr 2015", "title": "Adjunct Professor, French Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Biola University (La Mirada, CA) in Jun 2014", "Interview Descriptions": "The interview process was pleasant throughout, but it turned into a very long and drawn out process that involved three separate interviews. My first interview was with the head French professor and the division chairperson. My second interview was with the head of the Department of Modern Languages. My third interview was with the Executive Secretary to the Provost. Each stage was handled in a warm and welcoming way. When I completed the third interview, I asked the Executive Secretary if my having completed the interview with her and having filled out an employment packet meant that I was hired. She told me that I was not yet hired, but that she had asked me to complete the packet so that I would not have to return to do it if I were to be hired. This surprised me, and I asked who was going to make the final decision about hiring me. She said that it was the division chairperson who would decide. I was surprised, because I had anticipated that the interview process would be linear, but it was not. It took a bit longer than I had anticipated to find out that I was hired. Apparently this is how the interview process is handled on a regular basis. This was my first time to be hired by the first person to interview me but to have two more interviews without the presence of the first interviewer. I'm sure it works well enough, but it is not what I would design for an interview process.", "Interview Questions": "The head French professor spoke to me in French and asked me to respond to his questions in French. This portion of my first interview lasted about 15 minutes. He asked me about my French studies and how I had used French since then."}, {"date": "13 May 2015", "title": "IT Infrastructure Technician Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Biola University (La Mirada, CA) in Jan 2014", "Interview Descriptions": "Submit paper application to front desk\r\nSet up an interview time via email\r\nTalk to the boss, get a tour of the school and what the job entails, and watch a youtube video\r\nAccept if you are offered the position", "Interview Questions": "Are you scared of small, dark spaces?"}, {"date": "9 Sept 2014", "title": "Social Media Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Biola University in Aug 2013", "Interview Descriptions": "I found the position through Biola Classifieds. I sent in my resume by email and received a reply shortly after. It was during summer, and the person interviewing me was very flexible with the fact that I couldn't do an in-person interview (as I did not live locally). He conducted a phone interview, which was somewhat generic and then gave me a \"homework\" assignment to provide him with sample work for the position.", "Interview Questions": "Posed a question regarding an upcoming event and asked how I would make it more popular"}, {"date": "18 Apr 2013", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Biola University", "Interview Descriptions": "Comfortable interview and hiring process; supportive interviewer and HR staff; easy to get access to Blackboard, email, faculty links and student information.", "Interview Questions": "N/A"}, {"date": "13 Nov 2017", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Biola University (Los Angeles, CA) in Mar 2013", "Interview Descriptions": "Individual, group, and panel interview. It was very competitive.  Once selected you went through a personal interview, then moved into a group interview where they asked a panel of questions and you competed with others to be chosen to answer. You also had to work with someone else in an exercise to complete questions.", "Interview Questions": "Why you’d be a good fit and representative for the school."}, {"date": "17 Nov 2012", "title": "Admissions Staff Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Biola University (La Mirada, CA) in May 2012", "Interview Descriptions": "Was invited via snail mail to a group interview, given some materials to read, and provided with a parking pass. Entire interview was with a group of about 8 other applicants and 7 people on the panel, ranging from other Admissions Staff, Marketing personnel, and HR. Was asked hypothetical questions about what we would do if a certain admissions scenario were to happen. Also worked in groups to prepare individual presentations on even more scenarios. Presented individually, then went into a Q&A session for the hiring panel. Lastly, we were asked to rate ourselves and answer short questions as well as reply to a prospective students' \"controversial\" letter.", "Interview Questions": "On the spot question regarding hypothetical scenario on applicant who does not agree with certain portions of the school's standards."}], [{"date": "29 Mar 2016", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Biola University (La Mirada, CA) in Apr 2012", "Interview Descriptions": "Layers of interviews.  With HR, Students, Staff, Management and group interviews.  I also interview at time with other candidates.  The process was also interesting because there were other colleagues in our department who interviewed and the communication from those interviewing was not totally professional and clear to each of us.", "Interview Questions": "What is your management style?"}, {"date": "24 Sept 2013", "title": "Campus Safety Cadet Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Biola University (La Mirada, CA) in Dec 2010", "Interview Descriptions": "Sent in a resume, went through an interview with two officers and then had a meeting with the Cheif", "Interview Questions": "Tell us about yourself"}, {"date": "16 Jan 2010", "title": "Dispatch Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Biola University (La Mirada, CA) in Nov 2009", "Interview Descriptions": "After following up with Campus Safety via email several times, the lady in charge of dispatch finally got back to me and invited me in for a skills test. I had to memorize as many details as I could in 3 minutes of a dispatch report of three different disturbances on campus, and then take a test that quizzed specific details from the reports. I was also presented with different scenarios and asked how I would dispatch different units in response. Not much you can do to prepare for it. Several days later I was asked to come in for an interview with two staff members - it was relatively low-key and standard. I was told which day I should hear back from them about whether or not I got the job; they did not contact me, so several days later I went in in person to ask about it. The lady would not even respond to me in person, but sent the secretary back out to tell me to check my email. That night I got a form email saying I didn't get the job with a little note that basically said \"oops, forgot to email you.\"\r\n\r\nAfter that, I requested via email constructive feedback or reasoning on why I did not get the job, but the lady heading up that department refused to respond.", "Interview Questions": "Why do you want to work for Campus Safety?"}, {"date": "1 Sept 2013", "title": "Student IT Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Biola University (La Mirada, CA) in Jan 2009", "Interview Descriptions": "Submitted application through Student Union. Interviewed with manager and one full time worker. Was hired for interim.", "Interview Questions": "How would I handle a difficult customer"}, {"date": "6 Nov 2012", "title": "Programmer/Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Biola University (La Mirada, CA) in Feb 2008", "Interview Descriptions": "Multiple phone interviews with HR and subsequently the IT department, followed by an in-person interview. It's a private Christian school, so all employees must make a statement of faith (part of the HR interview).\r\n\r\nThe department interview was fairly standard - I was the sole interviewee and it was performed by 2 managers. The process was professional, and I was made to feel comfortable.", "Interview Questions": "I was only asked about past experience. There were no technical \"What would you do if...\" questions."}]]