[[{"date": "17 Jun 2023", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Maryland Medical Center (Baltimore, MD)", "Interview Descriptions": "Dealing with the HR side is a nightmare. I was handled by four different recruiters throughout the process. The background verification company they outsource is incompetent and lazy to the point of being directly insulting and accusing you of lying about your work history and education because they are too lazy to check the sources you gave them. I am being forced to track down information that should have been easy for them to verify and which they are paid to verify and I am not being paid to do. This is for a 15$ an hour entry level position. The hiring and onboarding process is taking close to two months at this point. I interviewed well with the hiring managers and my job history and education are correct and I did not lie about anything on my resume but this company uses HireRight and all they do is threaten you and accuse you of lying and make you think your offer is going to be rescinded for absolutely no good reason other than they are lazy, hostile and incompetent and believe that you are as much of a dishonest scoundrel as the owners of that fly-by-night garbage background checking company HireRight are. What an insulting waste of time and I am about ready to decline the offer because this experience has been so awful", "Interview Questions": "Why do you want to work for us?"}, {"date": "16 May 2023", "title": "Echocardiographer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Maryland Medical Center (Columbia, MD)", "Interview Descriptions": "Interview processed for me in 30 minutes it was very nice and smooth and it was very clear and the interviewer was very friendly and helpful I like it and I’m appreciating her cooperation and how much she was explaining to me about the job options they offered", "Interview Questions": "Why did I choose to apply for UMMC"}, {"date": "10 May 2023", "title": "Clerk Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Bowie, MD) in Apr 2023", "Interview Descriptions": "I was so excited when I had received a call for an interview with UMMC in Bowie, Md. Up until the interview i was excited but then I quickly became cold when the interviewer showed no interest into getting to know who I was. It was almost like she racially profiled me, but where the same color if that makes sense. She asked me a total of 3 questions, and he interview was over. She told me that someone would be in contact with me, but I knew that was not true due to how the interview went. I wish black woman wouldn't look down on other black women. This happens daily at workplaces across the world and I'm pretty sure it happens here.", "Interview Questions": "About my last position I held."}, {"date": "10 Mar 2023", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "HR recruiter phone screen, Unit manager interview and share time right after. Share time is important and the unit should let you do it after your interview. Then offer is made.", "Interview Questions": "What do you think is the role of the student nurse"}, {"date": "3 Mar 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "The interview went very well and quickly. However, the hiring process and the paperwork for onboarding took some time. Would recommend a whole day for onboarding and badge collecting, and would be great if it could be done beforehand.", "Interview Questions": "Why do you think you are fit for this role?"}, {"date": "21 Jan 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Columbia, MD)", "Interview Descriptions": "Getting to know you More of how to deal with difficult situations What you can offer Teamwork What your former colleagues and supervisor will say about you Very easy questions", "Interview Questions": "Tell me something about yourself"}, {"date": "28 Apr 2023", "title": "Senior Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Jan 2023", "Interview Descriptions": "The only available time for interview was weeks out. It was extremely informal personality/fit type of interview. I followed up with recruiter but did not receive any feedback or response.", "Interview Questions": "No questions, more of a conversation"}, {"date": "29 Dec 2022", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "Very long and confusing. If the job is filled they do not get back to you at all. And they have multiple jobs applications for one job. The process is not my favorite. Could be improved.", "Interview Questions": "Access my Strengths and weaknesses"}, {"date": "30 Dec 2022", "title": "MLT/MLS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland Medical Center", "Interview Descriptions": "Pretty much informational with directions at every stage, Professional and relaxed at the same time and online/phone call interviews are also very much common. For the most part, a panel interview was done", "Interview Questions": "Why should we hire you"}, {"date": "15 Dec 2022", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Baltimore, MD)", "Interview Descriptions": "The Online interview was first with manager then second interview with the social worker and doctor. In my personal option this was an Easy interview process very friendly and informative individuals.", "Interview Questions": "Fast workplace environment how do you feel working here?"}], [{"date": "11 Nov 2022", "title": "Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Oct 2022", "Interview Descriptions": "Very organized, good questions, and I felt comfortable and listened to by everyone who interviewed me. I did have to interview with a lot of people, but it was done via zoom and they were very accommodating with my current work schedule.", "Interview Questions": "How do you treat insomnia? (Sleep medicine speciality)"}, {"date": "20 Jul 2022", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland Medical Center", "Interview Descriptions": "The interview was straight to the point. The questions were fair and aligned with an average interview. I went through about two rounds of interviewing before being selected for the position.", "Interview Questions": "What does confidentiality mean to you?"}, {"date": "14 Jun 2022", "title": "Registered Nurse, BSN Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in May 2022", "Interview Descriptions": "I attended a virtual hiring event where I communicated with a recruiter via messaging.  Later that day the same recruiter called me for a short interview. We set up an in-person interview for the following week, where I was introduced to the actual unit.", "Interview Questions": "Describe a time you went out of your way to help someone."}, {"date": "5 Dec 2022", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center in May 2022", "Interview Descriptions": "They do an initial phone interview then in person interview after that you shadow the unit. It took about a week to hear if I got the job or not.", "Interview Questions": "Why do you believe you’d be a good asset to our unit."}, {"date": "9 Jun 2022", "title": "New Graduate RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at University of Maryland Medical Center (Baltimore, MD) in May 2022", "Interview Descriptions": "Attended hiring event after signing up a few weeks in advance. Upon arrival they asked what department I was interested in although I had added that information at the time of sign up. After having me take a seat they asked me to follow a manager to be interviewed. Upon arrival to the unit, I had to ask what unit this was for, and it was nowhere close to what I had requested. After my interview on a department I wasn't interested in, I approached the recruiter who stated that the managers hadn't been notified of the event.", "Interview Questions": "What are your strengths?\r\nWhat are your weaknesses?\r\nWhy are you interested in this unit?"}, {"date": "13 Apr 2022", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland Medical Center", "Interview Descriptions": "Interview was Panel based. It included some direct leadership and a couple others that were also leaders over other pharmacies. They asked a series of different questions- some situational and some clinical.", "Interview Questions": "Why do you want to work at UMMC?"}, {"date": "25 Mar 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland Medical Center", "Interview Descriptions": "Interview was with nurse manager. She asked mostly situation based questions, and asked about experience. Allowed time for me to ask questions as well. Toured the unit and was paired with a nurse for shadow time.", "Interview Questions": "Tell me about a time you made a mistake and how you fixed it.\r\nTell me about a time you dealt with a challenging patient"}, {"date": "11 Jul 2022", "title": "Medical Technologist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Mar 2022", "Interview Descriptions": "Person took me to a conference room with another manager. They both asked me questions for about 30 minutes, then asked me some diversity questions, then toured the lab with me.", "Interview Questions": "They combed my resume and picked out every detail about every test and instrument I had ever done or used, then proceeded to ask me in detail about them, trying to catch me up. They asked questions that were contrary to what they just asked to see if they could catch me in a lie, and asked about coagulation cascades and other chemistry tests."}, {"date": "24 Jan 2022", "title": "Internal Medicine Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Maryland Medical Center", "Interview Descriptions": "30 minute interview with one faculty member; interview was laid back and mostly asked about career interests. Nice residents, great faculty and adding 4+2 schedule. Patient population is diverse and residents seem to learn a lot.", "Interview Questions": "Career goals, hobbies, general interest in research"}, {"date": "22 Feb 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Jan 2022", "Interview Descriptions": "The first step included a Recuiter reaching out me and setting up a phone interview.  The second step is where a  clinical manager interview was set up and completed via zoom.", "Interview Questions": "Why do you want to work for UMMC?"}], [{"date": "25 Nov 2021", "title": "Surgical Support Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "The interview was swift. They asked me about my leadership skills and how do I do in a fast paced environment. They also asked how well I did seeing deceased and very Ill people regularly.", "Interview Questions": "Which one would you do first if you’re working and suddenly hit with multiple tasks ? A blood run, a patient pick up, or restocking ?"}, {"date": "25 Oct 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Maryland Medical Center", "Interview Descriptions": "Very structured, direct and to the point. Process was not very long, HR was very helpful when it came to setting up interview. Was scheduled for an interview fairly quick.", "Interview Questions": "Name a time you faced adversity, how did you handle it?"}, {"date": "2 Oct 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Maryland Medical Center (Baltimore, MD)", "Interview Descriptions": "Well. The manager explained the roles clearly. Asked between 4-6 questions. Started with tell me about yourself and provided with several behavioral questions.  The manger allowed me to ask several questions to which she provided concise answers to.", "Interview Questions": "Tell me about yourself?\r\n How do you handle difficult situations ?"}, {"date": "14 Dec 2021", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Oct 2021", "Interview Descriptions": "The interview entailed a quality onboarding process coordinated by the nurse recruiter. Then Human Resources department facilitates all the pre-employment screening and orientation requirements. The interview with unit manager and floor time to get briefly oriented on the unit. Overall the interview is about a 3-4 hour process.", "Interview Questions": "Why UMMC? \nWhy MICU?\nStress management methods? \nHobbies?"}, {"date": "12 Apr 2022", "title": "HR Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center in Oct 2021", "Interview Descriptions": "Simple. More like a dialogue. Due to Covid they were short staffed so the interview process was more of them telling me what they needed in the role and if I could assist based on my background. I did not get an offer based on my salary requirement (too high)", "Interview Questions": "Experiencing growing pains, what's your experience with assisting an organization with that."}, {"date": "23 Aug 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland Medical Center", "Interview Descriptions": "different each time, because there are several interviews.  But each one they would have a different person.  Wasn't sure the purpose, but it worked out in the end.  Mostly nice people.", "Interview Questions": "Q: Where did I see myself in 5 years?"}, {"date": "7 Jul 2021", "title": "Food Server Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "The whole process was pretty simple, you apply online and wait for a call or email from the hiring manager for whatever department you applied for. The response process was relatively quick", "Interview Questions": "Why do you want to work here ?"}, {"date": "25 Jun 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Jun 2021", "Interview Descriptions": "Several interviews until the search was handled by an outside firm.  Had to re-do the interview process.  Made it to final round of interviews until the last round was cancelled without any reason why.", "Interview Questions": "Situational questions recalling leadership experience."}, {"date": "15 Jun 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Baltimore, MD) in May 2021", "Interview Descriptions": "The interview process was well organized by recruiters. They sent very thorough emails of what to expect and who I was interviewing with. Directions of where to go for in person interviews were included. The recruiter was timely in responding to any calls or emails.", "Interview Questions": "Describe a time you had to deal with a difficult patient "}, {"date": "11 Mar 2021", "title": "Data Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland Medical Center", "Interview Descriptions": "Good process. Fairly easy. Management was thorough & nice. Answered all my questions & asked me questions relevant to the job. It was a two part process. One with all coordinators the. Another with coordinator i would work directly with", "Interview Questions": "N/A"}], [{"date": "5 Mar 2021", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland Medical Center", "Interview Descriptions": "Submitted my application online and waited for less than 2 months before my getting a reply via email from a recruiter reply to schedule an interview with the unit manager. Gave my available free time to the recruiter and was given interview dates and times to select.  The interview was done virtually due to COVID-19. Did the interview one week after the recruiter contacted me.", "Interview Questions": "Why do you like to work in the unit? "}, {"date": "17 Mar 2023", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Medical Center in Mar 2021", "Interview Descriptions": "The interview process at University of Maryland Medical Center was great. I got a call quickly after applying and had a timely interview. The entire process was very professional and the HR Associate that interviewed me was very transparent about the process and what I could expect.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Sept 2022", "title": "Billing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Feb 2021", "Interview Descriptions": "Two months- very smooth and consistent. Spoke with boss and boss' boss. Nothing too concerning. I could tell that they mostly wanted to see how I was socially, and if I was a potential fit.", "Interview Questions": "Name a time you faced an confrontation in the office? What was the situation? How did you handle it? "}, {"date": "4 Jan 2021", "title": "Occupational Therapist PRN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland Medical Center", "Interview Descriptions": "I was contacted for a phone interview. I was interviewed by the director of Rehabilitation. The interview lasted 20 minutes. I was asked scenario based questions and about my experience.", "Interview Questions": "Tell me about your experience ?"}, {"date": "11 Oct 2021", "title": "POC Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Maryland Medical Center (Office Hall, VA) in Jan 2021", "Interview Descriptions": "Traditional process. 3 stage interview. First was agent, then initial and last was a 3 panel. \r\n\r\nI declined initial offer and after 3 days got a revised offer which I declined again.", "Interview Questions": "Why them and where do I see myself. "}, {"date": "16 Feb 2021", "title": "Psychiatric Nurse Practitioner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Havre de Grace, MD) in Jan 2021", "Interview Descriptions": "Online, typing only (no verbal commuication) with long pauses - obviously a group interview.  Quick follow up with the directo​r of my area- within twenty-four​ hours. She was extremely nice and asked about my skill level.  she was looking for an entry-level​ applicant and when she realized I had almost 15 years of experience​ she kindly referred my application up to her superior.", "Interview Questions": "Tell me about yourself, ​please\r\n"}, {"date": "8 Dec 2020", "title": "Research Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "The interview was held using Zoom program. This was one time interview, and it took about 30 minutes. There were about 5 staff joined the interview. The main interviewer was the Principle Investigator.", "Interview Questions": "Experience with clinical research; how long are you planning to stay for this job; why do you think you fit for this job"}, {"date": "6 Dec 2020", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "phone interview\r\nHR local to fill out paperwork for share time\r\nclinical interview ,and 4 hour clinical interview \r\nreach out to recruiter about interview , wait to hear back from nurse manager and offer made", "Interview Questions": "tell me about yourself?\r\ntell me about a time when ?\r\n"}, {"date": "18 Aug 2020", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland Medical Center", "Interview Descriptions": "Series of interviews with upper leadership. Standard questions and not too intense. Know your CV, be yourself and know why you want to work there specifically.\r\n\r\nHiring process consists of HR related items/paperwork. Email communication is sent from an on boarding manager and very straightforward.", "Interview Questions": "Why UMMC"}, {"date": "12 Apr 2022", "title": "RN Level I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Aug 2020", "Interview Descriptions": "During the pandemic, my interview was over the phone completely blind and there was no shadow day but turned out great and I ended up really liking the unit! The interview was short and relaxed too", "Interview Questions": "Describe an example of your strengths and weaknesses."}], [{"date": "9 Nov 2021", "title": "Pediatric Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Maryland Medical Center (Baltimore, MD) in May 2020", "Interview Descriptions": "I was hired during COVID time so the interview was over the phone… which helped to ease a lot of the tension. The managers were very nice. I told them about my previous work experience and future goals.", "Interview Questions": "They asked me simple questions like “what was one of the most difficult decisions you’ve had to make” and “what was an interesting case you’ve seen”"}, {"date": "28 Apr 2020", "title": "Patient and Family Care Liaison Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "Was contacted by A recruiter a week later had first interview . two weeks later second interview after that no contact on wether I didn’t make the cut or what , very disappointing", "Interview Questions": "Name a time you Deescalated a situation "}, {"date": "22 Jan 2020", "title": "Ambulatory Informatics Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Maryland Medical Center (Baltimore, MD)", "Interview Descriptions": "The interview process is slow and you have to interview with multiple people. The current position I'm in required 3 interviews over the course of 3 months. This time the process seems to be moving faster. I was told they would make a decision in 2 weeks.", "Interview Questions": "Why do you think you are a good fit for this position?"}, {"date": "9 Nov 2020", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Sept 2019", "Interview Descriptions": "it was a panel of managers. I applied to Inpatient pharmacy and outpatient pharmacy. They gave a quiz in which it was not timed.  it took about fours hours because after the interview there was a tour of the pharmacies.", "Interview Questions": "What are your negative attributes? "}, {"date": "30 Jul 2019", "title": "Pharmacy Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Jul 2019", "Interview Descriptions": "Fair and brief. Included a 45 minute, 2 interviews with pharmacy managers (4 total) and a tour with a lead technician. The questions were pretty standard and reasonable and took an hour total. They explained about the position and their expectations of working quickly and accurately.", "Interview Questions": "How did you deal with a conflict?"}, {"date": "18 Apr 2019", "title": "Health Information Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "Received an email from the department admin wanting to schedule an interview - no further details were provided at this time.  My phone interview turned out to be a two-stage process: first a one-on-one with the manager, then a panel with three members of the team.  Each interviewer was incredibly friendly and willing to answer my questions.  The entire interview lasted about an hour.", "Interview Questions": "Describe yourself in one word."}, {"date": "6 Nov 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Apr 2019", "Interview Descriptions": "You first apply then get contacted by the recruiter and do the phone interview. Then, recruiter sets up the interview with the manager. After the interview with the manager, you do a share day with the nurse on the unit for several hours.", "Interview Questions": "Why PACU?\r\nWhy did you leave the last workplace?"}, {"date": "2 Mar 2020", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Jan 2019", "Interview Descriptions": "quick, easy, right to the point, got to interview on the unit i applied for with the manager i would be working for instead of a general interviewer. that was a really nice change of pace", "Interview Questions": "Why do you want to work on this specific unit?"}, {"date": "18 Aug 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center in Dec 2018", "Interview Descriptions": "The interview was a 30 minute in-person meeting with the nurse manager of specific department you applied for.  Overall, the interview was very conversational and 1:1. It started with more general questions that included  tell me about yourself, why nursing, why that department etc. to more scenarios such as a time you worked on a team, a time you demonstrated leadership, etc.", "Interview Questions": "Why are you interested in becoming at PCT? "}, {"date": "16 Nov 2018", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Nov 2018", "Interview Descriptions": "The interview process seemed fairly quickly and easy to me. I applied online through umms careers in mid-October. About 2 weeks later, I received a call from an HR recruiter, which sort of felt like a mini phone interview, she asked a few questions about my career goals & skills, nothing too hard. She then sent a questionnaire survey to my email (to be completed prior to interview; mines was already completed) & scheduled a face to face interview for 2 days later with the manager of the ED department. Upon arrival I was asked to complete a typing test before interviewing with the manager. The face to face interview was just as pleasant. Asked about 10 interview Qs & then it became a little more informal with regular small conversation. Following the interview with the ED manager, she scheduled a peer interview with 2 future co-workers for a week later. The peer interview probably was the most laid back, every interview was seamless, but they both asked about 3 Qs each, explained to me about uniforms and training, asked if I had Qs, then we kinda joked, and and interviewer told me “You’ll recurve a call from the department manager or your HR recruiter.”, shook my hand, and then smiled & said “See you soon!” So I kinda thought I had it already. The next morning I received a call with a job offer from hr & a state date 2 weeks from that date. In short, it was very easy. The interviewer were very respectable and as long you meet the requirements & are genuine, you should be fine! I would said the interview process was probably 3 weeks from the date of application submission, 5 week process in entirety to get onboard I believe.", "Interview Questions": "In the ED, you’ll come across many irritable or unruly patients. How would you deal with an unruly patient?"}], [{"date": "6 Dec 2018", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Medical Center in Nov 2018", "Interview Descriptions": "Interview consisted of a short meeting with senior management, a shadowing a therapy session, and a staff interview at lunch. Staff was friendly and supportive. Management was steady and had the overall well-being of the unit in mind.", "Interview Questions": "Why would you decide to work here?"}, {"date": "3 May 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Mar 2018", "Interview Descriptions": "Applied in February... HR contacted me at the end of march to set up a time to start the interview process. Called HR and she asked me about my resume and then explained to me the interview process. We set up a phone interview and then an in person interview with the unit manager and share time. The Phone interview was extensive but HR was so kind and made the whole thing comfortable and less intimidating. The interview with the nurse manager was short, and was focused more on questions I had for her. Got my offer 2 days later", "Interview Questions": "What are 3 qualities you want most in this unit?"}, {"date": "8 Feb 2018", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Jan 2018", "Interview Descriptions": "Extremely slow and drawn out. Highly unprofessional. \r\nTook over 1 month to get a phone interview. Phone interview was scheduled but manager did not call when they said they would. I had to follow up with them to reschedule. Then they told me I would hear from HR in a few days in regards to my status. Didnt hear back for 2 weeks so I contacted the person that interviewed me and they got back to me almost 2 weeks later and said they found another candidate. I had to chase the status of my application and ended up not getting hired but found out from a single email. Highly unprofessional.", "Interview Questions": "Why UMMC?\r\nCurrent Job Experience?\r\nOpportunities for improvement?"}, {"date": "4 May 2021", "title": "Ambulatory Nurse Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Jan 2018", "Interview Descriptions": "The interview process went well.  I was very pleased with the professionalism of the recruiter. Working in the role after hire was not as pleasant an experience.  There is a lack of leadership and accountability. The lack of policy and procedure puts your nursing license in jeopardy and when question the lack of safe practice you are then targeted as a trouble maker.", "Interview Questions": "How do you handle difficult patient care scenarios."}, {"date": "22 Apr 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Nov 2017", "Interview Descriptions": "Formal with lots of questions on how you would manage patient care, conflict with Co workers or patients. Manager was very friendly. Share day was a plus and was a chance for team members meet you and see if you will fit into the culture.", "Interview Questions": "How would you handle conflict with a conworker"}, {"date": "27 Dec 2017", "title": "Emergency Department-non Clinical Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Oct 2017", "Interview Descriptions": "i had to walk over to the hospital to the admissions office from the employment center like walking thru race course due to all the construction going on.  I interviewed with 2 people that were nice enough did not ask a lot of questions i felt like i should ask more questions to let them know i was really interested in the job", "Interview Questions": "my available and last job worked and current job duties"}, {"date": "15 Sept 2017", "title": "Registered Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Baltimore, MD)", "Interview Descriptions": "I was reached out by the nurse recruiter who scheduled an interview for shock trauma. The phone interview was extensive but gave a great overview of what kind of candidates they're looking for. They also go into detail about the history of the hospital and benefits which is great to know. I then had a day to interview for the nurse manager and shadow. I ended up loving the unit but the final say is in the nurse recruiters hands. The recruiter called back two days later and offered me a position. It was very quick and happened all in the same week. Took about a week and a half to first get a phone interview after the initial application .", "Interview Questions": "How do you feel you can contribute to the culture of this unit?"}, {"date": "31 Aug 2017", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "There were various steps, starting with an interview with the HR department then there will be a interview with the pharmacy director and coordinator. And if other employees are available then you will be asked a few question and you will be able to ask them questions. Then you will be showed around the department.", "Interview Questions": "What are your strengths? "}], [{"date": "22 Jun 2017", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Maryland Medical Center (Baltimore, MD)", "Interview Descriptions": "Completed a 45 min phone interview.    Behavioral based questions.  They asked my salary requirements at the end and it seemed to be an issue.  Maybe it was higher than they expected.  Then they had a recruiter call and question me about my qualifications and tell me how I'm not qualified.   These things should have been reviewed before considering me as a candidate.   There is no reason to call someone if the salary and education requirements don't align with the position requirements.  Disappointing experience.", "Interview Questions": "How do you deal with stress at the workplace?"}, {"date": "13 Aug 2018", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in May 2017", "Interview Descriptions": "HR called, scheduled an interview, normal questions asked, HR called back to offer position, filled out paper work and was onboarded.  Went to orientation and then began on the job training.", "Interview Questions": "Why do you want to work here?"}, {"date": "9 Apr 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Maryland Medical Center", "Interview Descriptions": "phone and in person interview went great. People where great. Interview questions was basic nothing hard or tricky. I am waiting for the share time interview now. I did my get a offer yet but hopefully after this last part I will get a offer. Look like my toe of work I love hands on", "Interview Questions": "Best quality "}, {"date": "2 Apr 2017", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD)", "Interview Descriptions": "The interview very proffessional, questions were direct and related to the position.  The interview was time appropriate.  They were very friendly and allowed me to take the time to ask any question that I might have.", "Interview Questions": "What I would expect as one of there employees?"}, {"date": "17 Jul 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Apr 2017", "Interview Descriptions": "Phone interview with nurse recruiter. Then a share day with one of the nurses on the unit and  then an interview with the nurse manager of the unit.", "Interview Questions": "About my travel time from home"}, {"date": "14 Apr 2017", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Mar 2017", "Interview Descriptions": "I put 84-days for the interview process, but technically it's still going on...\r\n\r\nI applied and 1-month later I did a phone screening with a recruiter. The in-person interview was scheduled 2-weeks later, for another 2-weeks out. Yes, that means 1-month from the phone screening until the actual interview. During my in-person interview the manager said I had all of the qualifications they were looking for, including the ones you can’t teach. She asked if I’d be willing to come back in for a 2nd interview with a team member that wasn’t able to be there. 2-days later the recruiter asked for my salary requirements. 2-weeks later I asked the recruiter for an update since I hadn’t heard anything. 6-days later I had my 2nd interview, which was basically the 1st interview all over again, just with someone different.  (BTW, if the 2nd person is unavailable for the interview, just reschedule instead of making a person come back for a repeat interview.) 2-weeks later I’ve heard nothing. The recruiter is on vacation and I received another job offer, so I e-mailed the managers letting them know and I’ve heard nothing. They’ve never responded to any of my follow up e-mails. The process has been dragging on for 3-months now and they still haven’t made a decision. Don’t waste your time.", "Interview Questions": "Most of the questions were the normal run-of-the-mill kind about how you would react in certain situations.\r\nWhy do you want to work for UMMC?\r\nAre you comfortable in the city environment and being around people that are coming for the methadone clinic? "}, {"date": "21 Mar 2017", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Mar 2017", "Interview Descriptions": "I applied online and was called about 2 weeks later for an interview for the Neuro unit. The interview with the nurse manager was pretty relaxed. It lasted about an hour and then I spent a few hours on the unit following a nurse around to get a feel for the flow of the unit.", "Interview Questions": "Describe a time you chose not to follow the rules?"}, {"date": "27 Jun 2017", "title": "Vocational Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Nov 2016", "Interview Descriptions": "Very fast, got hired on the spot. Team members and clients sat in on the interview. The Program Manager asked very strong questions. They followed an interview question form. They fail to inform you on how overwhelming the position is and their expectations.", "Interview Questions": "Why should I be hired?\r\n"}, {"date": "2 Oct 2016", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland Medical Center (New York, NY)", "Interview Descriptions": "Quote typical at first, they have you come in and interview you but then you go on to do a \"shadow interview\" walk around the department and meet people you'll be working with and the environment you'll work in. The hiring process takes forever between HR and the managers.", "Interview Questions": "Experience and things about myself"}, {"date": "19 Aug 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Oct 2016", "Interview Descriptions": "Interview with the unit specific HR representation,  followed by an interview with the manager. A share day occurred on the same day. All 3 interviews were done in the same day.", "Interview Questions": "What are your strengths\r\nWhat is your greatest weakness\r\nHow would your coworkers describe you"}], [{"date": "27 Jun 2016", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Maryland Medical Center (Baltimore, MD)", "Interview Descriptions": "It was quick. Telephone call from recruiter telling you what the pay is in advance and asks a few questions related to your experience. Set up interview for the following week. Interviewed very briefly with the nursing manager of unit who barely asked any hard questions. The main 'interview' I believe is with the person I shadowed for 2 hours on the unit who showed me around to get a feel of the job and workplace. This is where you should make the best impression because it is from this person that the recommendation to the nursing manager whether or not to hire you would come from. This is just my opinion.", "Interview Questions": "Why did you choose this unit? What do you expect from working with us?"}, {"date": "16 May 2016", "title": "Student Nurse Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "A recruiter contacted me telling me he found a position that he thought would suit me. He scheduled the interview and then I never heard from him again. I went to the interview and the manager was not prepared to meet me. The interview itself was fine. Felt the experience was very unprofessional.", "Interview Questions": "What would you do if a patient was acting aggressively?"}, {"date": "18 May 2016", "title": "Unit Secretary Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center (Baltimore, MD) in May 2016", "Interview Descriptions": "Once I applied online and got an email quickly. They requested that I take the assessment test. After this I got a call that asked me to come in for an interview. It seemed as I had two interviews but real the first was just coming into the HR building to sign papers. After this I was sent to the department of the hospital to meet the sup I would be working under. She went over my resume and spoke with me for about this for 5 mins asking questions. After she told me about her department for 10 mins. Next she asked if I had questions. After this was over she sent me to shadow the person on duty and said I could stay for as long as possible. I stayed an hour shadowing. 10 days went by and I was given an offer that I was asked to agree to in 2 days to meet the start date in 3 weeks. The offer of salary was given but not the benefits. I asked for this information and was told I could not discuss this till after I gave her ssn and dob. I am starting to negotiate now.", "Interview Questions": "How does your experience translate? Have you ever worked in a hospital? Tell me about your last job?"}, {"date": "29 Jul 2016", "title": "Utilization Review Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Apr 2016", "Interview Descriptions": "Interviewed with a few different people. They were very flexible with scheduling. Human resources can be very slow with pushing your application through to the hiring manager. You interview with human resources first and then the hiring manager and those in the department. Depending on the job you are applying for, you many have to interview with 10 or more people.", "Interview Questions": "How do you see your experience as a nurse helping you with this position?"}, {"date": "21 Oct 2016", "title": "Project Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Apr 2016", "Interview Descriptions": "Group interview, followed by an interview with two members of leadership. Had to analyze data and create a PowerPoint about yourself. Overall, the hiring process took a very long time but it was a fairly pleasant experience.", "Interview Questions": "How well do you work in a team"}, {"date": "2 Oct 2016", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Apr 2016", "Interview Descriptions": "It submit my resume online through my college career center. After that I was being call for an on campus interview. I pass my first interview, so I get invited for a second round of interview at the office located in Baltimore. Everyone was extremely friendly, but I take them forever to give me my interview result. I wait for a very long time because the hiring manager seem to be indecisive about what they are looking for.", "Interview Questions": "What do I know about the company?"}, {"date": "26 May 2016", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Maryland Medical Center in Mar 2016", "Interview Descriptions": "I had a brief phone interview with the nurse recruiter and then a casual in-person interview with the nurse manager of the unit followed by an hour of share time on the floor.", "Interview Questions": "Why do you want to work on this unit?"}, {"date": "21 Mar 2016", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Mar 2016", "Interview Descriptions": "After checking in with HR, I met with the Nurse Manager of the unit I had applied to. She was very nice and down to earth. The interview was more conversational then stressful, and it lasted about an hour. I then had share time on the unit, and basically just shadowed one nurse for an hour and a half. It was pretty informal. I was offered the job the next day.", "Interview Questions": "What would you like me to remember about you?"}, {"date": "2 Dec 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Feb 2016", "Interview Descriptions": "Had a phone interview, first, then invited for an in-person interview. The questions were pretty standard.. a couple scenario based questions, but no critical thinking. After the manager was done asking me questions, I was able to ask some of my own, then was given the opportunity to shadow a nurse on the unit for some share time.", "Interview Questions": "If you were very busy, have four patients to take care of, chemo to hang, etc. and your patient starts crying, what do you do?"}, {"date": "19 Jan 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD)", "Interview Descriptions": "It was fairly simple. I met the manager followed by the medical director. They were both nice enough. The medical director was extremely friendly and made me feel very comfortable.", "Interview Questions": "What are some of your strengths?"}], [{"date": "26 Feb 2016", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Dec 2015", "Interview Descriptions": "Be prepared to meet many department heads and team leaders throughout the day. You will not have a break so bring a snack to maintain energy levels and don't overthink your math test.", "Interview Questions": "Tell me about a time you had not met company or individual expectations.\r\n\r\nWhy Ambulatory Pharmacy?\r\n\r\nHow would your current or previous employer describe your personality?"}, {"date": "4 Apr 2016", "title": "Admitting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Dec 2015", "Interview Descriptions": "The hiring and interview process was fairly quick and easy. I enjoyed being able to have such a qick and easy process transferring from one unit to the next. They where very understanding during the interview process. Also during hiring with flexible days and time scheduling.", "Interview Questions": "Why do i want to work for shock trauma"}, {"date": "17 Nov 2015", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD)", "Interview Descriptions": "I was contacted, initially, by three different recruiters; each was for different positions. We had a phone interview. Then you fill out an endless psychological, multiple choice profiler. Interviews were set up.\r\n\r\nOne HR recruiter was ON THE BALL!! Organized, timely, etc.  The second was okay. The third, well he was a not mess!! Sent me several emails forgetting he had already emailed me. When I initially called him back, he never called me back. Not until 2 months later. Oh boy.........and he had just start recruiting for UMMC.  I wonder if he is still there.", "Interview Questions": "Describe what brought you into nursing school?"}, {"date": "3 Feb 2016", "title": "Meal Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland Medical Center in Nov 2015", "Interview Descriptions": "The Interview went very well ! The assistant manager was warm and friendly. However , they let you know off the break they will not work with school schedules at all.", "Interview Questions": "when is the earliest you can start ?"}, {"date": "11 Nov 2016", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Oct 2015", "Interview Descriptions": "Phone interview first and then face to face interview with the nurse manager on the floor. Share day to follow the interview with the nurse manager. You go on the floor with a student nurse on the floor and they show you all around the unit.", "Interview Questions": "What is a time you experienced something unethical and how did you respond."}, {"date": "27 Sept 2015", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Sept 2015", "Interview Descriptions": "Applied online. Phone interview with HR, pre-screening questionnaire and personality inventory survey, in-person interview with director and two current employees, tour of work site and potential office space, and opportunity to ask questions of current employees.", "Interview Questions": "Why are you interested in this position?"}, {"date": "9 Aug 2016", "title": "Student Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Jul 2015", "Interview Descriptions": "It took me two months to get into the interview process because the HR is just so slow. Other than that, everything went on well. The HR asked some basic information questions such as your name, your education experience, your working experience, how do you know the job. The nurse manager asked some simple scenario questions such as why would you apply to this job.", "Interview Questions": "Why do you apply to this job?"}, {"date": "6 Aug 2015", "title": "Clinical Nurse I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Jun 2015", "Interview Descriptions": "In order: Phone interview with recruiter ( impersonal), personality test ( called customer survey ), nurse manager interview, share time on unit ( scrubs ). Manager was very professional and easy to talk to. Asked experience and knowledge based questions, as well as personal questions. Some questions were very difficult.  Share time was great. The unit manager did an excellent job explaining the ordination process and tier system.  Overall a hard interview but good experience.", "Interview Questions": "How did your upbringing impact the person you are now? "}, {"date": "29 Mar 2016", "title": "Nurse Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Feb 2015", "Interview Descriptions": "I was first scheduled a telephone interview with a representative from HR. Next, I had an interview with the nurse manager. Finally, about three weeks later, I interviewed with two doctors, one nurse practitioner, and one nurse that I would work closely with; each other these interviews was separate, though consecutive on the same day.", "Interview Questions": "N/A"}, {"date": "12 Jan 2015", "title": "Clinical Nurse I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "typical interview, with share time. Interview with HR and Unit Manager. Some of the nurse recruiters are slow and lose things, but most were great. HR asks the typical questions. Management wants to figure out why you're really there and how long you might stay. I like to think they were trying to see if you're a good fit, but in retrospect they may just be seeking competent people that wont call out, so they can fill spots.", "Interview Questions": "Name a time you did something wrong and how you realized it/what you did about it"}], [{"date": "21 Nov 2014", "title": "Research Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "Applied online,1 week later received call from HR to schedule phone interview , face to face interview 2 weeks later.  Interview was one on one. No challenging or trick questions.", "Interview Questions": "how does your background qualify you for this position"}, {"date": "14 Nov 2014", "title": "Corporate Compliance Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at University of Maryland Medical Center", "Interview Descriptions": "Completed  app online,  received  an email  2 days later for an interview.  The recruiter had me  complete a behavioral  online test and phone interview. I emailed  her the phone interview  questions.  Then i was scheduled  for an in person  interview.  In person  interview  for a completely  different  job title, which  was a waste of my time. The hiring  manager  interview  was informal, rushing through  questions & talking about herself & qualifications.  Seems  like it was just a process to meet a quota, but they already  had someone  picked out for the position.", "Interview Questions": "Where do you  see  yourself  in five years? "}, {"date": "5 Jun 2016", "title": "Addictions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Nov 2014", "Interview Descriptions": "Interview was a breeze. If you know your craft-you got it! Had interview with only 2people and it was very informal. They asked basic questions about your treatment style and the case load that you usually handled.", "Interview Questions": "Questions were basically about your past duties."}, {"date": "6 Aug 2014", "title": "Research Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "Applied online.  Took about a month or so to hear back.  Rec'd an email for scheduling a phone interview with someone in HR.  Phone interview was straightforward.  Then rec'd an email to schedule an interview with the hiring department.  Scheduled quickly.  Day of - waited in lobby while associate was paged and came down to get me.  Was suppose to interview with head of project, but he was running late.  Other people in the office tried to keep me occupied until he returned.  Very friendly.  Head came in finally.  Not the friendliest guy, but interview went smoothly.  Then interviewed with associates.  Interview was straightforward.  Was mainly asked about my personal background, education, and past experience.", "Interview Questions": "Was grilled about my past research experience.  Were looking for a few specific things, which I unfortunately did not have."}, {"date": "23 May 2017", "title": "Clinical Nurse II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Maryland Medical Center in Jun 2014", "Interview Descriptions": "It won't matter since management has changed 3 times since I've been on unit for 3.5 years. 23 RN and techs have left during this time and all upper management ignores the issues. Great hours though", "Interview Questions": "Can you handle challenging personalities?"}, {"date": "26 May 2014", "title": "Clinical Documentaton Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at University of Maryland Medical Center (Glen Burnie, MD) in May 2014", "Interview Descriptions": "I interviewed at the BWMC site. The main interviewer was a contractor. I felt there was a conflict of interest in that contractors income depends on continued need for their services. She appeared to have the need to be the most knowledgeable on all topics as opposed to building a team of people with differing strengths and weaknesses to synergistically learn from one another. I enjoy participating in synergistic teams. At one point there was an emphasis on clinical checklist which might be advantageous to new nurses less applicable once one develops the critical thinking skills to look at the big picture. This was not a good fit.", "Interview Questions": "Change of work environment questions. There seemed to be the assumption that one needed to come from a like facility to be able to adapt to the workflow at this facility."}, {"date": "15 Jul 2015", "title": "Artificial Heart Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in May 2014", "Interview Descriptions": "Emailed the current Ventricular Assist Device (VAD) Engineer with resume. Followed up with a one-on-one 2 hour on-site walking interview during a tour of the cardiac intensive care unit and briefly met the other VAD Engineers too.", "Interview Questions": "Have you ever worked in a clinical setting before?"}, {"date": "1 Mar 2017", "title": "Communications Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Maryland Medical Center (Columbia, MD) in Apr 2014", "Interview Descriptions": "Met with director of department briefly, then sat down with my direct report. Half hour conversation, review of resume, discussion about hourly rate. talked about work life balance and schedule. learned that the environment was hands off, but you were expected to get the job done.", "Interview Questions": "Are you comfortable with technology."}, {"date": "3 Aug 2016", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Apr 2014", "Interview Descriptions": "It is simply easy. I just talked with my boss, and did a presentation to the people in the lab. All of the questions were about my project, no behavioral questions.", "Interview Questions": "About my project"}], [{"date": "29 Jun 2017", "title": "AR Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center in Jan 2014", "Interview Descriptions": "interview was quick, they weren't intimidating, they were very friendly, and made me feel comfortable. I was notified that I was hired within a week, but the hiring process was over a month long.", "Interview Questions": "goals, what do you know about us, where do you see yourself in 5 years?"}, {"date": "7 Mar 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Jan 2014", "Interview Descriptions": "A recruiter from HR contacts you to establish a time to meet with your hiring manager. Usually interview consists of an actual sit-down interview from the hiring manager and share time on the unit. Recruiter occasionally conducts phone interviews.", "Interview Questions": "How can you contribute to boosting positivity on the unit if hired? "}, {"date": "2 Apr 2014", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Sept 2013", "Interview Descriptions": "Just agree that nurse are important. That you understand you are their to support them. WHen they ask you about delegation go with the most important task first such as Ekg over Blood draws.", "Interview Questions": "Why did you become a PCT? \r\nHow do you handle patient family members? \r\nHow do you handle difficult patient? "}, {"date": "1 Jun 2013", "title": "Clinical Lab Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Maryland Medical Center", "Interview Descriptions": "After resume submission and HR review; the lab supervisor emailed me to schedule initial interview.  Interview was held in supervisor's office, afterwhich we walked through laboratory and hospital.  Informal offer made over telephone.  Formal offer presented in person.", "Interview Questions": "Hobbies."}, {"date": "17 Jun 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Oct 2012", "Interview Descriptions": "Applied online and after fighting through the call center to get to the unit meant for my job I spoke with the manager and set up an appointment for an interview. Took about three days. During the interview I sat in with three senior nurses that asked a total of four question each. Discovered that I would be secretary for three different units instead of one unit. Ended up getting the job that same day with and started work that Monday.", "Interview Questions": "Name one of your weaknesses and how you go about managing it?"}, {"date": "4 Dec 2012", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Sept 2012", "Interview Descriptions": "Contacted about the position many months after applying.  The interview process took many weeks and was exhasutive with over 12 high level in-person interviews, as well as phone screenings.    Everyone was pleasant and but they could not decide.  My opinion is that there is a reluctance to hire from outside the industry with a very strong preference for internal candidates (great for current employees)!  Seems like a very interesting place to work with advancement opportunity from within.", "Interview Questions": "Have you ever fired anyone?"}, {"date": "30 Jun 2012", "title": "Internal Audit Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Apr 2012", "Interview Descriptions": "I applied to job online.  Then worked with HR to schedule a group phone interview.  After the phone interview, I was scheduled for in person interviews.  Prior to the in person interviews I completed an online personality test that was sent to me via email and administered online.\r\n\r\nThe in person interviews consisted of first interviewing and meeting with HR. Then I met with a few employees at various times through group interviews.", "Interview Questions": "Why I was looking to leave my current job?"}, {"date": "7 Sept 2012", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Oct 2011", "Interview Descriptions": "Applied for position in September of 2011, received a call requesting an interview in October 2011. Pre-interview instructions (i.e. parking, directions to HR, etc) were detailed and easy to follow. Interview process was two-fold. First phase: interview with HR nursing recruiter. Second phase: interview with nurse manager on the unit.", "Interview Questions": "What would you say is your main weakness?"}, {"date": "17 Jan 2013", "title": "Applications Systems Analyst III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Sept 2011", "Interview Descriptions": "Interviewed with the Director of the department. She had me interview with three of her project leaders. It was a very relaxed interview although there were few \"gotcha\" questions used in the interview by one of the project leaders. My resume was used more to make the decision than the interview. For the University of Maryland Medical System you must have two references from your previous employer. Not ifs, ands or buts about it, get those or you don't get the job - may not apply to higher level positions.", "Interview Questions": "The typical question was asked, where to you see yourself in five years. I'm an individual contributor and I like it. I've been a manager and don't like it. I'd like to be where I am now in five  years, but it's hard to make people understand that."}, {"date": "10 Sept 2011", "title": "Applications Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Jan 2011", "Interview Descriptions": "The phone interview was relatively short. I found the interviewers to be positive, cheerful, and energetic. At the end of the ten minute call, they asked me to fly up (non-reimbursable) and interview me face-to-face. The interview process took about 6 hours total, beginning around 10 am, including a lunch with the hiring manager and ending around 5. \r\nInterviews were arranged in one-hour blocks, with the hiring manager, the VP, a panel of 3 peers and an HR recruiter each taking an hour or so.  \r\n\r\nPerceptions of the people: Since the position is IT position, I find the environment and people to be about average, compared with previous employers. However, the company utilizes consultants perhaps more than most. I've worked for. \r\n\r\nOffice perceptions: Internal politics at the VP level is pervasive and obvious to subordinates. One opportunity to improve is to facilitate communication between teams,  especially amongst teams that support overlapping applications.\r\n\r\nRecommendations: For those interviewing, I would say, know your stuff (technically) and don't give canned answers to questions. Be inventive in your responses but realistic and definitely be honest. Be down-to-earth and technology-savvy.", "Interview Questions": "Tell me about the biggest workplace mistake you've made."}], [{"date": "14 May 2014", "title": "Lab Tech II/Blood Bank Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Maryland Medical Center in Jan 2011", "Interview Descriptions": "The most stressful part about the interview process was getting through Baltimore city. The interview was very professional, your typical questions nothing really unexpected. I left with a good feeling and they were very respectful. The online application had some problems but that was more on my end with my internet.", "Interview Questions": "Very typical questions. nothing unexpected"}, {"date": "7 Mar 2014", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Maryland Medical Center (Baltimore, MD) in Apr 2010", "Interview Descriptions": "I was contacted late in the evening to discuss my interest in the job.  A week later, I was interviewed by maybe 6-7 people, which takes roughly 5 hours including a tour.  Two weeks later I was offered a position in writing and scheduled for orientation.", "Interview Questions": "Be prepared to take a math quiz.  "}]]