[[{"date": "18 Apr 2023", "title": "Research Assistant Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at INSEAD (Singapore)", "Interview Descriptions": "Asked a few questions about bakground, motivation and future plan. The porfessors really cared about the fit of the candidates. Overall a very friendly inerview. There is no technical questions.", "Interview Questions": "What is your plan for the future"}, {"date": "17 Apr 2023", "title": "Data Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at INSEAD", "Interview Descriptions": "It was bit formal, mostly about past experiences and how it is relevant to role proposed. Also process is bit genuine, interviewer were very nice and didn't make the interview very stressful", "Interview Questions": "What was your previous experience"}, {"date": "25 May 2023", "title": "MBA Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at INSEAD in Apr 2023", "Interview Descriptions": "Interview was relatively easy and straightforward. However waiting process was very long about one month. Made me go for 2 interviews and in the end they offered the role to someone else. Wasted plenty of my time. Future job seeker please do not render your resignation before getting an offer here", "Interview Questions": "Are you alright with a desk bound job?"}, {"date": "25 Mar 2023", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at INSEAD (Singapore) in Jan 2023", "Interview Descriptions": "Hiring process was ok, Hr, f2f and had a test but didnt get to pass to the team meeting round? \n\nJob requirements seems too heavy compared to salary offered for the role. Other than that, interview process was generally normal except that test seemed to be last minute/ not with proper setting eg. Time limit n etc, which they did give were an unreasonable time for the clean up they were expecting. \n\nNo follow up after feedback and test sent. Feel that standards for the masters school, interview process can be better.", "Interview Questions": "Tell me.about yourself"}, {"date": "21 Nov 2022", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at INSEAD", "Interview Descriptions": "Very easy and efficient. 2 rounds only and very accessible HR personnel. Managers are super nice and the HR responds quickly to all questions we have. Manager interviews are straightforward. No assignments or projects pre-interview. Results given to you within a week.", "Interview Questions": "Past experiences in the field? Worked for any schools before? Project management apps used?"}, {"date": "7 Nov 2022", "title": "Assistant Director, Career Development Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at INSEAD (Singapore)", "Interview Descriptions": "2 - 3 rounds of interview, mostly behaviour. In some team, you may be required to work on a presentation and present it to the group. There will be group evaluation afterward.", "Interview Questions": "Why are you interested in the Education sector? What do you think the challenges would be in this role?"}, {"date": "26 Jun 2022", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at INSEAD (Singapore) in Jun 2022", "Interview Descriptions": "Applied online and receive a reply from HR within a week. \r\nWas scheduled for a virtual interview with the hiring manager the following week. Interview was pretty easy if you have the relevant experience that they are looking for in coordination. Receive an offer on the same day of interview.", "Interview Questions": "Share with us some of your experience in your current job"}, {"date": "19 Jun 2022", "title": "MBA Class Officer (Asia Campus) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at INSEAD (Singapore) in May 2022", "Interview Descriptions": "1st Interview with Singapore Academic Manager (reporting officer for MBA Class officer).  (About an hour long as I asked several questions and the interviewer also asked couple of questions, shared alot about the job responsibilites and asked situational questions).\r\n\r\n1 week+ later I was contacted for a 2nd Interview with France Academic Director and Academic Manager. Entire interview about 30 mins, friendly and pleasant interview. Mostly share about the INSEAD and the programmes.\r\n\r\n3rd: Singapore Academic Manager requested for a informal face-to-face chat at INSEAD Asia one-north campus over coffee. Asked me some questions from the 1st Interview and showed me around the campus.", "Interview Questions": "Introduce yourself and share with me/us of your experiences in your current job and what you have been doing?"}, {"date": "26 Apr 2021", "title": "Sales Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at INSEAD", "Interview Descriptions": "Very exhausting. I felt drained after the interview. Now I understand what energy vampire means. The hiring manager and their hr didn't even offered me water for 2hr interview.", "Interview Questions": "Asked me why I wasn't agree to wear a red lipstick to make more sales at my previous job "}, {"date": "22 Jul 2019", "title": "Ra Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at INSEAD", "Interview Descriptions": "Walked through the CV and past projects. Interviewers were very nice and patient. It took around 30 minutes. There is only one round but waited for a long time to get the final results.", "Interview Questions": "Project-specific"}], [{"date": "5 Oct 2019", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at INSEAD (Singapore) in Feb 2016", "Interview Descriptions": "I was asked to review a recent research paper. Then there were two rounds of interviews conducted by two faculty members in my department. The interview was done in distance via skype. Each lasts around 30-60 minutes.", "Interview Questions": "I was asked to review a research paper published in a top journal and give comments. The paper was assigned to me a couple of days before the interview."}, {"date": "21 Apr 2014", "title": "Assistant Director of Marketing Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at INSEAD", "Interview Descriptions": "applied for the job online, heard back from their HR department very quickly.  4 rounds of interviews - all behaviourial interviews.  Final round with HR, turnaround time from start to finish was about 6 - 8 weeks.\r\nthey were very prompt with all my questions, didn't have really long to wait in between interviews and they were always transparent during the entire process", "Interview Questions": "N/A"}]]