[[{"date": "21 Oct 2022", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Diversus Health (Colorado Springs, CO) in Feb 2022", "Interview Descriptions": "Interview process is fairly easy and informative. Conducted in person, or over Microsoft Teams. You’re interviewed by a supervisor and other employees who know the role inside and out. The company has a big emphasis in culture as well as knowing patient’s aren’t numbers but mostly importantly individually people.", "Interview Questions": "Where do you see yourself long term?"}, {"date": "21 Mar 2022", "title": "Peer Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Diversus Health (Colorado Springs, CO) in Dec 2021", "Interview Descriptions": "The interview was mostly behavioral interview questions. The interview opened up with talking about my background.  Also, I talked about my lived experience. I talked about why I wanted to work at Diversus Health.", "Interview Questions": "How would you handle an angry client?"}, {"date": "29 Dec 2020", "title": "Customer Service Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Diversus Health (Colorado Springs, CO) in Sept 2020", "Interview Descriptions": "Easy phone interview. 4 people in total. Very pleasant. More at ease then an in person interview. They followed up a couple of times. I also sent follow up emails", "Interview Questions": "Difficult situations and how to handle the "}, {"date": "20 Feb 2021", "title": "Service Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Diversus Health (Colorado Springs, CO) in Jan 2020", "Interview Descriptions": "The interview process was mostly general questions that you probably already expect, questions about how you'd handle difficult situations with clients and coworkers, and questions about what your future goals are.", "Interview Questions": "What's a situation you've been in where you had to make a difficult decision?"}, {"date": "20 Dec 2019", "title": "Engagement Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Diversus Health in Dec 2019", "Interview Descriptions": "Very disappointing experience, which is ironic considering I interviewed with the \"experience\" department. I initially received a form rejection when I applied. Then I received a request for a phone interview. I confirmed with the hiring manager that they wanted to interview me. The hiring manager was very apologetic about the error, even calling me to apologize and express that they were very interested in interviewing me. The phone interview went well, they seemed enthusiastic about my skills, and the hiring manager outlined clearly what the next steps may be and when I could expect to hear from them next. I was then invited for a second and final interview on the day the hiring manager said they'd get back to me. Up until this point, I was quite impressed with how they were handling the candidate experience and I was hopeful and excited about the opportunity. \r\n\r\nUnfortunately, I felt my experience went downhill during the final in-person interview - which was with two folks from the team. One of the interviewers was late and while we were waiting for this person, I was told they had 14 questions to get through and I'd be doing myself a disservice if I spent too long answering them and they couldn't get to them all. This didn't sit right with me. After all, I'd shown up to the interview on time. \r\n\r\nBoth interviewers were polite and professional in demeanor. I was able to ask a couple questions of my own before I was abruptly told we were out of time. I was told I could call or send them an email with any further questions I had. They said they'd get back to me with their decision the next week, which seemed like a very fast timeline. I sent the hiring manager a thank you letter with the rest of my questions and I have yet to receive any kind of response. \r\n\r\nGiven the hiring manager had been super responsive and concerned about my experience up until the in-person interview, this was surprising.  I showed up on time, came in professionally dressed, and answered their questions thoughtfully - respecting that they needed to get through them all, even though it was not my fault we were short on time. I would have appreciated a simple \"thank you, but we're going in a different direction\" response. It would have taken 60 seconds to write. Ultimately, I decided the role wasn't for me - I had been on the fence about a particular aspect of the role, but how I was treated when we met in person left a negative impression. Even when you are no longer interested in a candidate, it’s important to treat them with the same respect you did at the start of the process.", "Interview Questions": "Tell us about a time you made a mistake and how you handled it "}, {"date": "28 Sept 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Diversus Health (Colorado Springs, CO) in May 2016", "Interview Descriptions": "Thorough interview that allowed me to ask questions as well. I was asked about why I was interested in AspenPointe as a site for internship, what drew me to counseling as a profession, and was able to inquire about the work environment I would be in if I got accepted.", "Interview Questions": "What is your theoretical approach to counseling?"}, {"date": "13 Apr 2016", "title": "Clinician III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Diversus Health (Colorado Springs, CO) in Apr 2016", "Interview Descriptions": "Seemed to be a pretty typical professional interview with several situational questions specific to mental health therapy. The interview lasted about 45 minutes alternating questions between two therapists at the site and one member of HR. There were about a dozen questions. The staff was friendly and willing to answer a variety of questions.", "Interview Questions": "What was your favorite past position?"}, {"date": "20 Jun 2018", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Diversus Health (Colorado Springs, CO) in Apr 2016", "Interview Descriptions": "Initial interview was positive, interviewer and staff that attended exhibited interest and were engaged.  Second interview with the team was flat,  lack of engagement and interest from team.  The same standard questions that were asked in the initial interview were repeated verbatim in the second interview.  \r\n\r\nOnce I joined the team it was evident the interview was indicative of the low moral and dysfunctional team dynamics.", "Interview Questions": "Tell me about yourself?"}, {"date": "8 Aug 2015", "title": "Clinical Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Diversus Health", "Interview Descriptions": "Standard interview with one hiring manager. Questions were behavioral related questions. Hr took forever to respond with an offer. Offer is take it or leave it with  no room for negotiation.", "Interview Questions": "Why did you decide to be a therapist? What made you decide on Aspenpointe?"}, {"date": "25 Jan 2015", "title": "Barista/Cashier Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at Diversus Health (Colorado Springs, CO)", "Interview Descriptions": "Met with the manager early in the morning.  It was a very simple interview, no trick questions. I was asked about my previous work experience and that was about it.  I was offered the job on the spot so if he's interested in you for the position he'll probably let you know.\r\n\r\nYou must comply with their TB testing before they let you work.  Also, after being offered the job it was almost seven weeks before HR was able to get me in for paperwork (despite my persistent calls that weren't returned) so if you need to get to work immediately (as is often the case for hourly employees) be prepared to wait a long time without communication from them.", "Interview Questions": "Can you work 6am shifts?"}], [{"date": "3 May 2016", "title": "Clinician IV Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Diversus Health (Colorado Springs, CO) in Sept 2014", "Interview Descriptions": "I had one in person interview with two hiring managers as I had applied to two separate positions. The questions were fairly standard interview questions. Both managers described the position in detail and what a typical day might look like as well. There were questions specifically related to my resume and areas of expertise. the background\\referencing process is what takes the longest. I was asked to find W-2s from 2004 to prove employment at a company on my resume. There seemed to be a constant stream of requests for additional documentation. The background\\referencing process is contracted out to another company. There was also a couple of short assessment testing knowledge of Microsoft products and typing speed. I had to go in to the HR office to complete the Microsoft testing because it doesn't work on a Mac. All in all the actual experience with the direct managers was really positive and the experience with the HR staff was as well. The company contracted to do the referencing not so much--they were friendly but it was a little ridiculous some of the things they requested.", "Interview Questions": "Standard questions"}, {"date": "17 Nov 2014", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Diversus Health (Colorado Springs, CO) in Nov 2013", "Interview Descriptions": "Multi-person interview, many of whom are completely unprepared.  Assume interview is 1 hour and will start late.  Manager in interview may not be the manager when hired, so you may never meet or communicate with him/her before first day.  Benefits are poor, and business practices within company is poor.  It would be a good idea to stay away from this company.", "Interview Questions": "How many fire hydrants are there in Long Island, NY?"}, {"date": "5 Jul 2013", "title": "Enterprises Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Diversus Health", "Interview Descriptions": "Submitted my resume and was contacted within 2 weeks.  Interviewed by phone because I was currently out of state.  It was a standard interview, lasting approximately 45 minutes.  They asked questions about previous work experience and how I have handled specific situations in the past.  I then did a skype interview about a week later with an HR representative.  Similar interview, with many of the same questions as in my first interview. Also to to complete a background check, drug test, get an official copy of my transcripts, and take an online computer (testing on Word, Excel, Outlook, and typing speed) test. Took about 2-3 weeks after that to receive an offer.", "Interview Questions": "Describe a specific example of a time you have had to resolve crisis situation involving someone with a mental illness.  How did you handle the sitution and how would you change what you did?"}, {"date": "16 Aug 2016", "title": "Career Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Diversus Health (Colorado Springs, CO) in Jun 2012", "Interview Descriptions": "Brief phone interview, followed by a face to face interview. I didn't have a second interview, but some other positions do. The background check process is extensive and takes a long time (2+ weeks in most cases)", "Interview Questions": "What do you consider your biggest strength when dealing with an upset client?"}, {"date": "14 Jan 2012", "title": "Case Manager II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Diversus Health (Colorado Springs, CO) in Oct 2010", "Interview Descriptions": "Basic experience will be from any job in community based mental health services or residential treatment centers. Think \"liberal mindset\" regarding this job. Job is to refer clients(mental health patients) to various community services or ideally within the companies other programs. (keep the client inside the company system to keep billing medicaid/medicare of course.) Need to be a \"follower\" and march along to the company trends, any \"rogue\" ideas such as the \"conservative\" idealogy of strongly teaching independence and self-reliance is neglected as it would certainly lead to a reduced number of clients or less contact with clients, consequently, less billable hours to medicaid/medicare. Great for socialist minded people who will support the status quo. Company is driven by a billable hours matrix, not a client centered success based matrix. Job performance boiled down = billable hours. Hardly any relevance is given to progress/success of clients.", "Interview Questions": "How do you handle a difficult client?"}]]