[[{"date": "24 Apr 2023", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis College", "Interview Descriptions": "this was a Very Straight forward interview process. met all expectations and answered questions thoroughly.this was a Very Straight forward interview process. met all expectations and answered questions thoroughly. would recommend interviewing", "Interview Questions": "DO you have any experience in admissions?"}, {"date": "7 Sept 2022", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Francis College", "Interview Descriptions": "I gave them all of my hiring docs and they rejected me after looking at my transcripts. I think they call this age discrimination for candidates over 50. They are so unprofessional.", "Interview Questions": "Standard questions for student advising interview."}, {"date": "26 Aug 2022", "title": "Student Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Francis College", "Interview Descriptions": "I received a phone call and a follow-up video interview. I went through a laborious interview panel (i.e gathering recommendation letters, and college transcripts which were not free btw) only to be ghosted by them. Regardless of their final decision, their lack of respect or follow-up with candidates is a total red flag of their unprofessionalism.  Overall, I would NOT recommend this company.", "Interview Questions": "Lots of behavioral and situational interview questions."}, {"date": "14 Jul 2022", "title": "Student Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at St. Francis College (New York, NY)", "Interview Descriptions": "I interviewed for this role and went through the painstaking experience of a panel interview, plus video interview  plus behavioral interview. Very stressful experience. What I found distressing was the clear lack of concern/respect for the candidate experience. After making me jump through hoops during multiple interviews, I only learnt I didn’t get the role when I found out by chance that they’d already started training the new person. I had to reach out to them to get a response, and when they finally did email me back it was a generic email with no personalization.\nClearly they’d had someone in mind for the role, yet I was put through extensive interviewing to their internal recruitment metrics. It’s left a bad taste in my mouth and I have lost interest in pursuing a career with them, nor would I recommend them.", "Interview Questions": "Why did you choose this college?"}, {"date": "3 Apr 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Francis College", "Interview Descriptions": "The interview itself was quite a positive experience; however, the communication leading up to and afterwards was lacking and confirmed my sense of the work culture: well-intentioned, but disorganized. I thus withdrew my candidacy.", "Interview Questions": "Q. Why St. Francis College?"}, {"date": "3 Jul 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at St. Francis College (New York, NY) in Nov 2018", "Interview Descriptions": "It was pretty straightforward and was asked basic interview questions. The atmosphere was friendly and it was more like a meet and greet than an interview. Overall it was a positive experience.", "Interview Questions": "What are your strengths"}, {"date": "8 Oct 2018", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Francis College", "Interview Descriptions": "I applied online a few weeks ago and they contacted me via e-mail to inform me I had been selected for the first round of interviews, which is a pre-screening video interview where you record your answers and submit them to HR", "Interview Questions": "What do you think is the role of an academic advisor"}, {"date": "13 Apr 2019", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at St. Francis College (Brooklyn, NY) in Feb 2018", "Interview Descriptions": "In Person, I was emailed a date to meet and was interviewed by two people. Overall it was pretty average, not too many difficult questions when I got the job I had to do a workshop.", "Interview Questions": "What would you do if a student comes to you with a question you can't explain?"}, {"date": "11 Apr 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at St. Francis College in Sept 2016", "Interview Descriptions": "I am current student at  Saint Francis and I worked as an Administrative Assistant for three years. I worked for multiple departments including special events, Psychology, and Finance department.", "Interview Questions": "Tell me about your pass working experience?"}, {"date": "13 Nov 2015", "title": "Admissions Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis College", "Interview Descriptions": "Video interview where you answered a number of questions and sent in the video for review. Get a call from Supervisor and come in for an in person interview with director and assistant director. Check references and then interview with head of HR then offer. It was a very comfortable process where the interviewers made you feel welcome.", "Interview Questions": "What was a challenge you had to overcome and how did you overcome it?"}], [{"date": "6 Apr 2015", "title": "Admissions/Advisement Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Francis College (Brooklyn, NY)", "Interview Descriptions": "They ask you to first do an online interview. It is not live. You watch a screen of questions and have three tries to video record your answer.They send you a link, you follow the instructions. Downside- decent computer camera can seriously change the feel and quality of your interview.", "Interview Questions": "Greatest strength and weakness... basic questions"}, {"date": "22 Feb 2018", "title": "Professional Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at St. Francis College (New York, NY) in Jan 2015", "Interview Descriptions": "Firs there was a phone call with the director of the tutoring center. Afterwards there was a panel interview with a senior tutor and the director of the center. A very easy process and just be prepared, a week later I got the job", "Interview Questions": "How long have you've been tutoring and how well do you know the subjects?\r\n\r\n"}]]