[[{"date": "26 Jun 2023", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Old Dominion University (Norfolk, VA)", "Interview Descriptions": "Zoom interview that lasted about forty minutes. Questions were asked one by one by committee members. Seven questions were asked in total. The chair of the search committee asked that I keep my camera off for the interview. I found this a little surprising, as this has never been asked before, but it didn't make the interview any more difficult.", "Interview Questions": "The first question was an expected one: tell us what interests you about working at Old Dominion?"}, {"date": "2 Apr 2023", "title": "Web Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Old Dominion University (Norfolk, VA) in Mar 2023", "Interview Descriptions": "1 hour interview A total of 3 interviewers, but one did not attend The interviewer introduces the job Self introduction technical interview 30 words minimum, 30 words minimum, 30 words minimum", "Interview Questions": "Ask lots of php, security, and database questions. I have stated that I am not familiar with php, but the interviewer is still aggressive. terrible experience"}, {"date": "14 Jun 2023", "title": "Scholarship Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Old Dominion University in Mar 2023", "Interview Descriptions": "2 interviews in person- 1 with an Assistant Director and 2 other members and the 2nd part of the interview with the Director. The interviews were completed on the same day. The call to interview took 60 days for the application to be reviewed.", "Interview Questions": "Why do you believe you would be a good fit for this position?"}, {"date": "18 Dec 2022", "title": "Technical Support Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Old Dominion University", "Interview Descriptions": "In-person. About an hour of questions. Half technical and half scenario based. Committee was diverse and was receptive to questions for them as well. Bringing additional materials such as resume, cover letter, or portfolio not necessary.", "Interview Questions": "Have you used sccm before?"}, {"date": "22 Apr 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Old Dominion University", "Interview Descriptions": "The interview was on Zoom with the two full time employees, and it lasted about one hour.  They gave a lot of information about the program, so it left few questions for me to ask about those details.", "Interview Questions": "Tell us a little about yourself."}, {"date": "22 Apr 2022", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Old Dominion University", "Interview Descriptions": "The interview was on Zoom with the two full time employees, and it lasted about one hour.  They gave a lot of information about the program, so it left few questions for me to ask about those details.", "Interview Questions": "Tell us a little about yourself."}, {"date": "7 Mar 2022", "title": "Help Desk Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Old Dominion University", "Interview Descriptions": "very quick and easy nothing major I was only asked a few questions regarding my past jobs but they seemed more inclined to. know about my customer service experience and what I liked to do in my spare time.", "Interview Questions": "Why do you want to work here "}, {"date": "9 Feb 2022", "title": "Director of Engineering Student Success Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Old Dominion University (Norfolk, VA) in Jan 2022", "Interview Descriptions": "One day interview process - five different meetings with senior leadership including the Dean and assistant and associate deans, program directors, department chairs, other advising constituents within and outside of engineering.", "Interview Questions": "How to leverage faculty to be more inclined to help with advising."}, {"date": "30 Oct 2021", "title": "Project Scientist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Old Dominion University", "Interview Descriptions": "A very structured and systematic interview process. The interview is also crowded with too many people. The benefits are good but the salary is just ok. The culture is also ok.", "Interview Questions": "Tell me about yourself and projects you have worked on."}, {"date": "5 Aug 2021", "title": "Help Desk Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Old Dominion University", "Interview Descriptions": "Face to face interview (precovid), very professional and informative. Knew what they were talking about and were direct. Didn't beat around the bush on things. No pressure or tension throughout the whole process.", "Interview Questions": "What IT experience do you have?"}], [{"date": "25 Jun 2021", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Old Dominion University", "Interview Descriptions": "It was hard, but environment was vey welcoming. They try to make sure they feel you out before dropping the tough guy act, but it’s doable. I enjoyed my interview.", "Interview Questions": "What is a program you will implement?"}, {"date": "24 May 2021", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Old Dominion University", "Interview Descriptions": "After completing the application you will have one interview to attend.  During that interview, two people will ask you question about your experience, why you choose that particular position, and why you would be a perfect for the job. Pretty easy going interview with polite hiring team.", "Interview Questions": "What skills can you bring to this position? "}, {"date": "31 Mar 2020", "title": "Social Media Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Old Dominion University", "Interview Descriptions": "Online application followed by a phone interview with a committee. After the phone interview, there was an in-person interview with the same committee. Offer was made over the phone.", "Interview Questions": "What is your greatest strength?"}, {"date": "18 Nov 2019", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Old Dominion University (Norfolk, VA)", "Interview Descriptions": "Sat down with director who asked me a few basic questions about my qualifications. Very informal interview. Was not tested on any material or given any other typical barriers you may expect.", "Interview Questions": "Did I have any tutoring experience before?"}, {"date": "6 Apr 2021", "title": "Technology Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Old Dominion University (Norfolk, VA) in Aug 2019", "Interview Descriptions": "It was a great interview overall really positive with the job process. Learned a lot from this job opportunity from new technology to helping set up the technology. Throughout the process, I learned many new skills that I can now use in my career path.", "Interview Questions": "What connection do you have with technology? "}, {"date": "29 Aug 2019", "title": "Fiscal Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Old Dominion University (Norfolk, VA) in Jan 2019", "Interview Descriptions": "A 3 person panel asked typical questions. Tell me about a time when..., tell us your weaknesses. It took awhile to hear back. They let me know they wanted me and I would be going to the background check.", "Interview Questions": "What are your weaknesses?"}, {"date": "22 Aug 2018", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Old Dominion University", "Interview Descriptions": "After making an online application and a wait period. i was contacted by the potential PI and asked a few things about ,y background and previous research. They had looked at my thesis at my previous university and decided to hire me. It was a phone interview which lasted over an hour. I was then sent a formal letter of acceptance.", "Interview Questions": "General questions nothing technical"}, {"date": "1 Mar 2022", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Old Dominion University (Norfolk, VA) in Aug 2018", "Interview Descriptions": "Phone call and then in person interview. It was informal and pretty easy.  I had no complaints. They worked it into my schedule as well. I stumbled on some questions.", "Interview Questions": "How would you respond if someone asks you a question you don't know the answer to. "}, {"date": "26 Feb 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Old Dominion University (Norfolk, VA) in Aug 2018", "Interview Descriptions": "The interview process was on-on one initially, then a general meet up with the staff followed by few questions. Was later called in for an acceptance meet up followed by signing the contract.", "Interview Questions": "How can you contribute to the position?"}, {"date": "16 Jan 2019", "title": "Professional Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at Old Dominion University (Norfolk, VA) in Jun 2018", "Interview Descriptions": "I’ve been interviewing for jobs for over 20 years and this was by far the worst process from start to finish. I applied for the job in December 2017. I didn’t hear anything back. They reposted the position in February 2018 and I applied again. I received a telephone call inviting me to a telephone interview in April 2018. The telephone interview was with a panel of Counselors who work in the office. Very straight forward, basic questions. I received a call back about 1 week later inviting me in for an ALL DAY interview. Now I know this is academia but an all day interview for a Counseling position seems a little obnoxious. I was advised that the interview involved a presentation & was given 3 weeks to prepare, which I thought was fair. The interview was indeed all day, starting at 9:00am and ending at 3:00pm. It involved a panel interview,  a case conceptualization, a 1:1 lunch/interview with the assistant director, a presentation and interviews with members of the front office staff. Now, all of this was a bit much but the team was inviting and pleasant throughout the day. The worst part of the interview process was the lack of communication after the interview. I was advised I would hear something back within several weeks as they would be interviewing candidates over that time. After about 8 weeks without hearing anything, I called and spoke with the Director who advised me that they were still interviewing. At that point, I knew I would not be offered the position. I looked online and saw that 1 person had already been hired. I emailed the Assistant Director a few weeks later and received no reply. Finally after 6+ months I received a “sorry you weren’t selected” email! This is totally unprofessional for a University of this magnitude. It is absurd to have candidates prepare several weeks for an all day interview, and then not have the professional decency to let them know they weren’t selected within a respectable timeframe. \r\n\r\nI must say though, I’m sure I dodged a bullet because an employer who behaves like this pre-hire most likely behaves even worst post-hire. Probably part of the reason for their high turnover.", "Interview Questions": "What are some groups you would like to lead?"}], [{"date": "22 Feb 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Old Dominion University in May 2018", "Interview Descriptions": "It was a skype interview.  It was very brief, no hard questions.  Interviewer was very nice and easy to talk to.  The interview process lasted maybe about twenty or so minutes", "Interview Questions": "What skills do you have that make you qualified for this job?  \r\nWill you be able to balance with school?  \r\n"}, {"date": "24 Mar 2019", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Old Dominion University (Norfolk, VA) in Feb 2018", "Interview Descriptions": "After you applied online to the university, passing the gate for GPA and GRE, you would be invited to campus for meet-and -greet days, interviewing with all the faculties in the field you applied for. My interview was over skype with the supervisor I applied to specifically", "Interview Questions": "Are you familiar with Big5 personalities? Which ones are you?"}, {"date": "11 Apr 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Old Dominion University (Norfolk, VA) in Jan 2018", "Interview Descriptions": "It was fine, Referred by another employee.  The process took less than 3 days because the employer already knew my work. She described day to day activities and introduced me to the co-workers", "Interview Questions": "Do you use Microsoft Products?\r\nHow long are you willing to work?\r\nTell me a time when you had to deal with Angry coworker?\r\n"}, {"date": "27 Sept 2019", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Old Dominion University (Norfolk, VA) in Jan 2018", "Interview Descriptions": "The interview process was standard for most entry-level jobs. There were no curveball questions most of them were pretty standard for the most part. Nothing that you wouldnt see in a normal interview", "Interview Questions": "Why do you want to be in this position. What makes you cut out for a postion like this. Do you see yourelf doing this for more then one year  "}, {"date": "11 Oct 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Old Dominion University", "Interview Descriptions": "I applied using a form and took the speak test and attended the GTA institute for graduate students. It was great and very easy. I enjoyed every bit of the interview", "Interview Questions": "How do you fit for this role?, What teaching experience do you have?, what classes did you take in your undergraduate study? It was a pretty easy interview and the experience was good"}, {"date": "3 Nov 2017", "title": "IT Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Old Dominion University (Norfolk, VA) in Oct 2017", "Interview Descriptions": "If your application was selected, the first interview is by phone.  If selected to go on to the next step of the process, you will be interviewed in-person by a panel.  There 3 people in the panel.  The questions were very typical for the position which is based on managing people, project management, technical questions and customer service.", "Interview Questions": "Describe from your past or current experience how you handle a very dissatisfied customer."}, {"date": "31 Aug 2017", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Old Dominion University", "Interview Descriptions": "Walk into upstairs office and be interviewed by academic tutor. Basically graduate assistant tells you about themselves, then you tell them about you. Questions about resume are asked. Behavioral questions regarding tutoring are asked. Ask some questions yourself.", "Interview Questions": "How would you help a student that is having trouble understanding the concept you are talking about?\r\nHow would you handle a student attempting to get your phone number?\r\nWhy do you want to be a tutor?\r\nWhy should we hire you?"}, {"date": "26 Apr 2021", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Old Dominion University (Norfolk, VA) in Sept 2017", "Interview Descriptions": "You apply from a list of provided on campus jobs. You then conduct a single, traditional interview with the department you applied for. Communication is done via email. Dress professionally.", "Interview Questions": "What is your class schedule?"}, {"date": "18 Sept 2018", "title": "Assistant Director of Communications, Alumni Relations Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Old Dominion University (Norfolk, VA) in Sept 2017", "Interview Descriptions": "Applied via ODU online system. Listing was removed shortly after and reposted a few weeks later. HR contacted me, informing me that the job listing was up once again. I reapplied and was called by the Director to schedule phone interview with herself and two other employees from other university departments, who are familiar with marketing communications. \r\n\r\nAfter a month, I received an email to not only schedule an appointment with the Board, but to inform me of the budgeted salary for the position. While I was extremely interested in the role, I informed the Director that, unfortunately, such a salary was not what I had in mind, given my experience.", "Interview Questions": "How would I handle working for a demanding work environment?"}, {"date": "4 Jun 2020", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Old Dominion University (Norfolk, VA) in Sept 2017", "Interview Descriptions": "One by one interview with the director of the program, requires your GA from previous educational institutions, Toefl and GRE required for international students, an assessment text is asked before entering the interview,", "Interview Questions": "Why do you choose this program?"}], [{"date": "1 Jun 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Old Dominion University", "Interview Descriptions": "This job isnt worth it. Parttime employees are not of any importance.  Easy process.  Don't actually remember the process.  Supervisors do not care about you in the least bit.  They expect you to bend over backwards and assume that your part time position at Student Health is your life.  Supervisors are petty and vindictive and will limit your hours if you make them mad.  No respect for employees. \r\n\r\n Interviewed by 2 current employees--supervisors.  People were nice and friendly.   The interview was quick and painless.  They put a façade on when interviewing to make you feel like this is the best place to work but once you start working here you quickly learn that is not the case.", "Interview Questions": "Tell me about yourself."}, {"date": "6 Apr 2017", "title": "Business Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Old Dominion University", "Interview Descriptions": "I had a coding challenge that I had to complete (no time frame) correctly upon which I was informed that I will be having 30 minutes skype interview. The interviewer was very kind and asked me about my solution to the coding problem and asked me a couple of data structures questions like speak about their implementation.", "Interview Questions": "How would you implement a clock? "}, {"date": "24 May 2017", "title": "Web and Mobile Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Old Dominion University (Norfolk, VA) in Apr 2017", "Interview Descriptions": "I applied through online. The process took more than 4 weeks. They scheduled a video interview(Webex). It was a panel interview with three people and each of them had a list of questions in front of them. Nothing technical related to our current employment/projects has been asked except those questions.", "Interview Questions": "Tell me about yourself?"}, {"date": "27 Jan 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Old Dominion University (Norfolk, VA) in Feb 2017", "Interview Descriptions": "It was done after GRE, SOP and Toefl screening. The interview was brief and more ralted to what kind of research I was interested in and about my quantitative preparations.", "Interview Questions": "How is preparation in Calculus and linear algebra ?"}, {"date": "11 Apr 2019", "title": "Mechanical Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Old Dominion University (Norfolk, VA) in Jan 2017", "Interview Descriptions": "it was not a difficult process but it was very technical. I would recommend that someone seeking an interview gets in contact with an advising professor or dean and make the connection first.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "16 Dec 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Old Dominion University (Norfolk, VA) in Dec 2016", "Interview Descriptions": "Phone interview followed by a face to face interview with all the departments that would be working with the position. Interview committe was pleasant and made me feel at ease. A tour of the facility was also provicec.", "Interview Questions": "Why ODU?"}, {"date": "20 Jul 2016", "title": "Web Content and Media Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Old Dominion University (Norfolk, VA) in Jul 2016", "Interview Descriptions": "I was called after applying to the position in order to set up a phone interview. The interview was going swimmingly. I was introduced to my phone interviewer, who was the supervising director for the position. After briefing me on that individual's role within the company we commenced with going over the position details. This is when things went south. Once salary was discussed I promptly declined moving forward wth the interview process. If you are looking for a position in the technology field that requires very specific skill sets, please look elsewhere. ODU's salary is dreadfully low and they should truthfully be ashamed at trying to decrease the value of good developers and designers.", "Interview Questions": "N/A"}, {"date": "20 Jun 2016", "title": "IT Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Old Dominion University (Norfolk, VA)", "Interview Descriptions": "For this particular position, I thought that the interview process was very brief. It almost made me feel uneasy that I was asked so little and so little time to ask my own questions. I was offered the job on the spot, which was nice, but also made me doubt the caliber of my co-workers.", "Interview Questions": "Basic questions, such as how I would handle certain disputes."}, {"date": "26 Sept 2016", "title": "Business Intelligence Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Old Dominion University (Norfolk, VA) in Jun 2016", "Interview Descriptions": "I had the interview with three people for this interview. The interview was conducted in WebEx. The interview went for 30 minutes. They told me that they would follow up after 2 weeks. I did not get any followup. I had to email them about the status. One of them replied \" This is a continuous recruitment\" . I would be notified when it will be filled. After few weeks I followed them up again. But I did not get any response back. In the meanwhile, I came to know that the position had been filled up. First of all,  you can not trust them in terms of follow up thing. Secondly, you can not rely on some jobs with \" Continuous Recruitment \" which may take upto to 3 or 4 months. They do not take their  candidates seriously and you can expect the same in their work culture.", "Interview Questions": "1> What is the difference between report and analytics?"}, {"date": "22 May 2016", "title": "Web Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Old Dominion University (Norfolk, VA) in Apr 2016", "Interview Descriptions": "Phone interview conducted by a staff member with a heavy Indian accent. Was unable to understand several questions due to this, most of which were technical in nature and could be looked up online as I pointed out.", "Interview Questions": "What is a web worker?"}], [{"date": "18 May 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Old Dominion University (Norfolk, VA) in Jan 2016", "Interview Descriptions": "very brief over the phone, resume did most of the work. I had worked in the other school departments so I had expreinces. I am also familiar with the school software and databases making the job easier. I have great administration experience so that helped me get the job.", "Interview Questions": "How do you handle stressful situations?"}, {"date": "3 Oct 2015", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Old Dominion University", "Interview Descriptions": "All the documents are submitted online. After your resume and transcripts have been reviewed and accepted. You'll be called for an interview, and a math test . The whole process took about 2 weeks.", "Interview Questions": "what do you do when the student you're tutoring wont understand your explanations no matter how hard you try."}, {"date": "10 Sept 2015", "title": "Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Old Dominion University (Norfolk, VA)", "Interview Descriptions": "I filled out a paper application and turned it in\r\nI heard back after 2 weeks and was called for an in person interview\r\nThe in person interview was with the director of admission and senior admissions counselors\r\n\r\nI got an offer a month after the interview", "Interview Questions": "a family is late and you have only 15 min to give a tour.\r\nif you could choose one building on campus to give a tour of to represent the campus which one would it be?"}, {"date": "9 Apr 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Old Dominion University", "Interview Descriptions": "After an online submission of my transcripts, GPA, GRE, and personal statement, I was invited to attend interview day. During interview day, I met with several professors for around 30 minutes each. I was contacted later that week and offered a position.", "Interview Questions": "Questions about my research interests, research experience, and career goals."}, {"date": "12 May 2015", "title": "Info Tech Specialist III Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Old Dominion University (Norfolk, VA) in Mar 2015", "Interview Descriptions": "Submitted online application 3-3-2015.  Received a call and follow-up email for on-campus interview two weeks later.  Interviewed in person 3-30-2015, sent thank you email.  Followed up 1 May 2015 after no word.  No response to email.  Called HR on 11 MAY to find out that the position had been filled and the new hire started that day.", "Interview Questions": "They asked me how I would solve an ethical problem."}, {"date": "31 Oct 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Old Dominion University (Norfolk, VA) in Mar 2015", "Interview Descriptions": "The hiring process was through the Career Development services of ODU during my time as a student. The Career Services recruiter was clear and engaging, it was an overall smooth process.", "Interview Questions": "How are you able to help students Succeed? "}, {"date": "11 Aug 2015", "title": "Student Veteran Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Old Dominion University (Norfolk, VA) in Jan 2015", "Interview Descriptions": "Applied via career link and set up interview date at Old Dominion University. He asked several questions regarding my resume and experience. He reviewed my resume and gave me input in regards to how to work with veterans in this environment.", "Interview Questions": "Describe to me how you would help a veteran with their resume?"}, {"date": "16 Dec 2014", "title": "Model UN Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Old Dominion University (Norfolk, VA) in Nov 2014", "Interview Descriptions": "I was contacted by email, phone screen, and then a brief 1:1 interview with the director of the Model UN program. I was asked illegal questions about my ethnicity and marriage status in my interview. The director was too lazy to interview me himself so he had students (not student workers- students) interview me who were unprofessional and had no experience conducting interviews/knowledge of EEO/DOL hiring practices.", "Interview Questions": "Most unexpected questions: What are your family's ethnic roots?"}, {"date": "18 Sept 2014", "title": "Graphic Student Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Old Dominion University (Norfolk, VA) in Sept 2014", "Interview Descriptions": "Panel interview detailing your experience along with presenting some of your work. Experience and variety of skills is a must. Interviewers were a little late. There were 3 and all seemed laid back and easy to talk to. No questions to out of the ordinary, just have a good amount of experience and a variety of skills.", "Interview Questions": "Do you have any experience in animation?"}, {"date": "1 Dec 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Old Dominion University in Sept 2014", "Interview Descriptions": "Email the faculty advisor and he was very prompt about letting me work in the office, there was no interview. What I thought was an interview turned out to be my hiring process!", "Interview Questions": "They just wanted to make sure I was a current graduate student"}], [{"date": "1 Oct 2015", "title": "Patrol Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Old Dominion University (Norfolk, VA) in Sept 2014", "Interview Descriptions": "The interview was very relaxing and personable. I was somewhat nervous at first, but the interviewer started to ask me questions about my life and school that had me visibly relax. Then they started asking me questions for the Interview. At first I gave generic answers, one's that they wanted to hear and they seemed alright with it at first, but then they stopped me and told me to answer truthfully. The told me this because they need a sense of my character as a whole and did not have the need to hire someone because they couldn't trust me because of my character.", "Interview Questions": "What do you think of the Law?"}, {"date": "27 Aug 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Old Dominion University", "Interview Descriptions": "The basic selection of shortlisting happens with Gre scores. Transcripts from previous colleges is also important. if you are applying for PhD then it is also good to have your MS in engineering. prospective candidates ahsould also have good  research experience. Number of new professors in bioelectrics and electrical engineering have newly joined the organization.", "Interview Questions": "Detailed explanation about my reserach experience during masters"}, {"date": "24 Oct 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Old Dominion University (Norfolk, VA) in Aug 2014", "Interview Descriptions": "Phone call for initial interview. If they like you, you will be called for a face to face interview. From there you will be notified a few days if you have the job or not.", "Interview Questions": "Questions related to the job \r\nmulti-tasking questions \r\nleadership\r\nStrengths and weakness"}, {"date": "28 Jun 2014", "title": "Marketing & Communications Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Old Dominion University (Norfolk, VA)", "Interview Descriptions": "Applied online. Received an email and phone call from human resources to set up an on campus interview. Interviewed by committee of four people, had to do a project ahead of time to demonstrate skills, whole process took a long time.", "Interview Questions": "What do you know about ODU and this department?"}, {"date": "15 Jun 2014", "title": "Housekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Old Dominion University (Norfolk, VA)", "Interview Descriptions": "The hiring process was quick and easy. For classified (full time) position applicants, I heard it is a little more lengthy and challenging. I worked as a Temp, and then worked for a short time as an hourly (part time) employee. The hourly position hiring process was short and easy as well.", "Interview Questions": "There were no difficult or unexpected questions for this position. I was not even interviewed for the position. I know there is a classified position interview though. "}, {"date": "16 May 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Old Dominion University (Norfolk, VA) in Apr 2014", "Interview Descriptions": "It was through Skype. Three professors joined in a meeting to interview me. There were general questions to see how good I am in research and fit their program. Overall They were nice.", "Interview Questions": "Asked about my CV and papers and projects."}, {"date": "6 Mar 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Old Dominion University", "Interview Descriptions": "All researchers are hired through the research foundation. Make sure to look at job description , and make your resume reflect what they need. These jobs are only posted on ODU research foundation website . Not to formal of a place for interview, but still look the part and understand the focus of research your aiming for. Helps to talk to other graduate students/faculty regarding the PI you'll work for.", "Interview Questions": "Future plans. Make sure your plans are what is needed in that lab/ research group. Best way is to see the PI's website and look at their research."}, {"date": "28 Feb 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Old Dominion University", "Interview Descriptions": "Went in for class advising and was asked if I wanted a job on campus. I was introduced to the manager of the lab and I was told to go to the lab to be tested. I meet the team leader of the lab and was asked about my experience, and then I was assigned a task. I reported back with my completion of the task and then they manager and other lab workers talked about bringing me on board.", "Interview Questions": "What was my experience."}, {"date": "19 Nov 2015", "title": "Webb Media Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Old Dominion University (Norfolk, VA) in Jan 2014", "Interview Descriptions": "Hiring process was speedy and straight forward. Applied, received in person interview within a week and was hired a few days after. Interview was with two supervisors and was asked questions regarding experience with technology and customer service.", "Interview Questions": "How would you troubleshoot an issue with the screen not displaying on a projector?"}, {"date": "18 Dec 2013", "title": "Administrative Office Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Old Dominion University (Norfolk, VA)", "Interview Descriptions": "At Old Dominion University the process for hiring can take months to a year. There will not be a notification if you are not accepted for the position. That can be frustrating. Most of the positions are filled by a board of people that would be deciding on who would fill the posting.", "Interview Questions": "Be ready to have multiple emails and maybe a phone interverview "}], [{"date": "3 Dec 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Old Dominion University", "Interview Descriptions": "Face to Face Interview and on reference", "Interview Questions": "Why should I hire you? "}, {"date": "12 Oct 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Old Dominion University in Aug 2013", "Interview Descriptions": "Not a interview per say, just had to fill out some paperwork and meet with the professors I was assigned to.  They gave me a overview of my duties and I sat in on a lecture to meet the students in the course.", "Interview Questions": "How many other courses are you working with?"}, {"date": "20 May 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Old Dominion University (Norfolk, VA) in Jan 2013", "Interview Descriptions": "Based on your profile for Master's advisor can offer you a job. When you apply for a Master's you should look for the professor who has same interest as yours and approach them for an interview.", "Interview Questions": "There wasn't any difficult or unexpected question."}, {"date": "25 Aug 2016", "title": "Ph D Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Old Dominion University (Norfolk, VA) in Jan 2012", "Interview Descriptions": "The selection process for admission in the PhD program was easy. There were no technical questions. They asked me for my resume as well as transcripts from previous degrees.", "Interview Questions": "Why would you like to pursue a PhD?"}, {"date": "10 Mar 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Old Dominion University (Norfolk, VA) in Aug 2011", "Interview Descriptions": "the interview needs preparation but overall it was good and easy. You do need to give a presentation  to show your ability of teaching. Also having a teaching methodology is something that foster you.", "Interview Questions": "what is your methodology of teaching"}, {"date": "7 Jul 2012", "title": "Marketing Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Old Dominion University (Norfolk, VA) in Feb 2011", "Interview Descriptions": "Old Dominion University forms a search committee for each hire / new position. They perform a quick phone interview and give you an assignment or project to present at your personal interview. They then perform a group interview with you answering questions and then going over the required project, solutions & presentation. I had four interviewers alternating the questioning between them. You should research the company and the department you are applying for. They will expect you to be very knowledgeable about them and the position you are applying for.", "Interview Questions": "Tell me the most recent project you ran that was successful. Describe it in detail, how you did it and why or how you succeeded."}, {"date": "15 Mar 2014", "title": "Assistant Director of Special Events Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 months. I interviewed at Old Dominion University (Norfolk, VA) in Feb 2010", "Interview Descriptions": "Long process - HR controls.  Committee run search reviews all resumes and chooses those that they want to have phone interview.  After phone interview they bring in candidates for in person interview.", "Interview Questions": "Not really any difficult questions."}, {"date": "20 Oct 2013", "title": "Social Media Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Old Dominion University in Jun 2009", "Interview Descriptions": "Three initial interviews, drug and back ground check", "Interview Questions": "How would you make their brand a winner"}, {"date": "19 Dec 2013", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Old Dominion University (Norfolk, VA) in May 2009", "Interview Descriptions": "The process is clear and clean. Have been on a number of these and no one is out to get you. It's a solid place.", "Interview Questions": "Why do you want this job? This is a tough one since ODU is a mid-level research institution and you need to think about it in this context. This means do your research about the institution as a whole. Unlike Tier 1 institutions where the aims are clearer, this is a murkier one and you will be judged on your answer. "}, {"date": "3 Jun 2010", "title": "Instructional Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Old Dominion University (Norfolk, VA) in May 2008", "Interview Descriptions": "Meeting room with about 6 people asking questions of my background. Asked questions about how comfortable I was with Illustrator, Flash, AJAX, etc. I was honest and I think they appreciated that. I think the room was full of everyone I'd be working with which I liked. It was a great diverse group of people.", "Interview Questions": "What experience do you have with online training?"}]]