[[{"date": "1 Feb 2023", "title": "Engagement Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HIMSS", "Interview Descriptions": "Applied online and received an interview request from a recruiter for a 30 min call. Recruiter was ~10 min late for the call. I think I spoke maybe for two minutes total on the call. The call was mostly the recruiter describing and pushing/selling HIMSS. She prepared me for the next round and how 'great' the hiring manager was and that I had the perfect experience. Call went over by 15 min because she was talking. Never received a follow up about the next step she promised. I followed up a week later to ask for an update and I was ghosted.", "Interview Questions": "I was barely asked any questions about my experience, but we did talk about logistics and salary."}, {"date": "15 Mar 2023", "title": "Attorney Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at HIMSS in Jan 2023", "Interview Descriptions": "I went through two rounds in 2022, then they went radio silent. Apparently, they froze the position. I got a call in 2023 and the process was restarted. I went through 3 interviews and was told they would meet on a certain day to choose between 2 finalists. I literally never heard from them again, and it has been 6 weeks. I have sent several emails and called twice. No response to any message. Super unprofessional.", "Interview Questions": "Lots of job-specific stuff, basically read me the job description line and asked about my related experience."}, {"date": "10 Aug 2022", "title": "Program Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HIMSS", "Interview Descriptions": "I applied online and received an email for an initial phone interview. The phone interview went well and was more of a description of the position than an interview. I was scheduled for a Zoom interview 2 days later which, again, was not really an interview so much as a \"this is the job and these are the duties\" description.  It has now been two and a half weeks with no word. I have sent an email and left a voicemail and have basically been ghosted. Absolutely no follow-up after second interview, which is just a terrible feeling.", "Interview Questions": "Very few questions, just more of a discussion of job duties."}, {"date": "9 Oct 2021", "title": "Program Specialist, Marketing Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HIMSS (Chicago, IL) in Sept 2021", "Interview Descriptions": "I received a call from an HR representative and scheduled a phone interview to discuss the position. The HR representative sent a calendar invite and I accepted and sent a follow-up email confirming the details. The day of the interview comes and I never received a phone call. I sent an email after 15 minutes and never received a response.", "Interview Questions": "I never received a phone call regarding the position. "}, {"date": "26 Oct 2021", "title": "Full Stack Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at HIMSS (Chicago, IL) in Sept 2021", "Interview Descriptions": "2 rounds overall: first round HR screening,  than  I was asked to complete technical coding assessment.  Second round - technical interview with the dev team and managers about completed assessment. I was also asked some questions about prev. experience and couple of tech questions.", "Interview Questions": "Tell me about yourself\nTell us about your last position and responsibilities"}, {"date": "4 Jun 2021", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at HIMSS", "Interview Descriptions": "The process was very thorough. The interviewer asked a lot of thoughtful questions about my background and specific questions on how I would handle various situations. The interviewer also shared the goals for the role and department.", "Interview Questions": "What interested you in the organization?"}, {"date": "11 Dec 2022", "title": "Sales Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at HIMSS (New York, NY) in Mar 2021", "Interview Descriptions": "Superficial and toxic environment. No attention to past victories or defeats. Bag attitude among execs. Poor hr department, difficult to maneuver No opportunity for advancement Vacation policy very backward. Wasn’t interested in hearing about victories and defeats.", "Interview Questions": "Where do you see yourself in 10 years"}, {"date": "17 Mar 2021", "title": "Senior Product Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. I interviewed at HIMSS in Feb 2021", "Interview Descriptions": "As other reviews mentioned the process was wastefully long. It started with a third party recruiter contacting me and doing an extensive phone screen and several questions to type out for the company afterwards.  \r\n\r\nRound 2 was with the company's hiring team but the person missed the first half of the call. When they finally dialed in, we'd lost 15 minutes and they said they had a hard stop at the end of the scheduled time. Instead of trying to reschedule they tried to fit everything into 15 minutes. Most of our time was spent with them explaining the company, and maybe 5 minutes of me answering questions.\r\n\r\nSomehow that got me to the third round despite the odd previous call. Round 3 was with someone from Marketing who seemed unimpressed from the start. He explained more about the job and I finally learned what product they want a candidate for, and I could tell from the talk that they needed someone *immediately* - their entire onboarding was scheduled for 3 days before launching into major work. The call was tough mostly because I didn't know what kind of product work to prep for.  \r\n\r\nFollowing round 3 was a lot of silence, then a recruiter letting me know they wanted to \"pause\" my application. It turned out to be a ton of work poured into an application process that could have been avoided with more info up front.", "Interview Questions": "Tell us about a time you had to align with a stakeholder who disagreed with you."}, {"date": "16 Dec 2020", "title": "Senior Data Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HIMSS", "Interview Descriptions": "The interview process consists of 5 rounds, some of them were redundant and the interviewer had no idea about the job descriptions and duties. The entire process took around 2 months but should have been restricted to 1 month. The only good thing about the process was the case study which was new and challenging. After completing all the rounds, I was kept on hold for 4+ weeks and then was finally informed that they have decided to move forward with other candidate.", "Interview Questions": "Basic and redundant behavioural questions. Case study to parse the web data and perform analytics. "}, {"date": "18 Aug 2020", "title": "Systems Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at HIMSS", "Interview Descriptions": "It was though the external recruiting company and first-round 30 min phone call and after that, it was onsite 2 hours-long interviews. The 3 round was a call with their another senior manager.", "Interview Questions": "What is the recent project that I have work on?"}], [{"date": "25 Aug 2020", "title": "Sr Data Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 months. I interviewed at HIMSS in Jul 2020", "Interview Descriptions": "Very long process working with an external recruiter from HIMSS. Process included 4 separate interviews with 5 people and a case study analyzing polling data for every single House, Senate, and Governor race plus the 2020 general election which they gave ~1 day to complete. Was given an offer below my current salary even though I told them what I was making at the begining of the process. I would avoid this company.", "Interview Questions": "Using fivethirtyeight polling datasets, analyze the US House, Senate, Presidential, Gubernatorial, and Generic ballot races. "}, {"date": "23 Apr 2019", "title": "Information Security Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at HIMSS", "Interview Descriptions": "Fairly straight-forward interview. I’ll add that please be more transparent when it comes to the roles and responsibilities of a position. Finding out last minute that “this role will be wearing many hats” is a game changer - and not a good one. Be thorough and clarify the level of technical and non-technical experience is needed for the role.", "Interview Questions": "Would you use Kerberos or SAML and why?"}, {"date": "27 Aug 2018", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HIMSS", "Interview Descriptions": "Standard recruiter screen followed by a conversation with the hiring manager which included scripted questions and a description of the role.  I was obviously not selected for further consideration, but have not received any follow-up communication (not even an automated system rejection letter) informing me I was not selected. After spending a few hours interviewing, it is very unprofessional not to follow-up with some sort of message.", "Interview Questions": "What is the biggest mistake you have made at work?"}, {"date": "24 Aug 2018", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at HIMSS (Burlington, VT) in Jul 2018", "Interview Descriptions": "The process had the typical flow of an initial screening phone call, then phone interview with hiring manager, then an in person interview with the hiring manager and a couple representatives from management.", "Interview Questions": "Tell us about a project you worked on that you were really proud of."}, {"date": "7 Jun 2021", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HIMSS (Chicago, IL) in Oct 2017", "Interview Descriptions": "There is an initial screening through Human Resources, then interview with the hiring manager and then onto upper management interviews. Each interview lasted about 45 minutes.  Interviews took place over several weeks and I was brought back three different times.", "Interview Questions": "How would you handle a situation where there was interdepartmental conflict?"}, {"date": "21 Nov 2016", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at HIMSS (Chicago, IL) in Sept 2016", "Interview Descriptions": "I met with someone from HR who asked me really general interview questions like what are your goals and what motivates you. Got the sense she was reading from a manual and didnt feel comfortable. Then i met with someone from marketing who was nice and asked very similar questions (which gave me the impression there isnt much collaboration between HR and the teams they are hiring for) but was friendlier and admitted she doesnt usually interview people. She told me a lot about the team and what i would be doing if i were to get the position. She really liked my resume and background and then said they would be in touch with next steps.", "Interview Questions": "They asked me where i saw myself in 10 years"}, {"date": "18 Jul 2016", "title": "Senior Accounts Receivables Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HIMSS in Jun 2016", "Interview Descriptions": "Partial completed online application, but was contacted immediately the next day by HR for a 30 min telephone interview. I was contacted by email immediately for an onsite interview the following week with the manger of the department and department head. Interview went rather well. I followed up with Thank you emails. 3 weeks went by so I decided to reach out to the HR Representative inquirying on status. I never received a response.", "Interview Questions": "What do you think the hardest part of this job would be?"}, {"date": "6 Jun 2016", "title": "Director, Client Services Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at HIMSS (Portland, ME) in Feb 2016", "Interview Descriptions": "I received an email from an HR representative in Chicago one week after submitting my resume and we scheduled an introductory phone interview for the next day. The rep called me at the scheduled time, and the interview went well; typical corporate HR interview to vet my qualifications for the opening. I then received an email two days later to inquire about my availability for an in-house interview in the Portland office the following week, which was scheduled for early Wednesday morning with two senior staff members. Ended up speaking with both of those people as well as two junior staff members who would report to the open position. They were very busy with preparations for their upcoming annual conference and dealing with a big client issue (precisely the kind of issue that they were looking for this position to solve), so the interviews were somewhat rushed and distracted, but I felt they went well overall and I was very excited about the potential of the opening, as the duties were an excellent match for my experience and abilities. I was told that they intended to move quickly on the hire, though the person vacating the position had a soft end date, and that there were three other candidates, one internal. I emailed a thank you note that day and received a polite response. Two weeks later I emailed a follow-up query to check on the status of the hire, and was told that they had not made an offer yet but hoped to by end-week. And then I never heard another word from them! I did get the impression from the wording of their last message that they I would not be the one receiving an offer, but I was disappointed that they didn't have the professional courtesy or consideration to ever notify me that the position was filled. I was also disappointed that they did not contact the references I provided, who would have confirmed my fit and talents for the responsibilities of the position and my ability to solve their problems.", "Interview Questions": "What is your personnel management style?"}, {"date": "17 Dec 2016", "title": "Senior Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HIMSS (Chicago, IL) in Feb 2016", "Interview Descriptions": "Phone call interview with panel of four to five department staff. Typical interview questions you can find and practice online and also specific inquiries about job description match with skills and company. First had telephone screening with HR personnel.", "Interview Questions": "Why do you want to work at HIMSS?"}, {"date": "7 Jun 2018", "title": "Relationship Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at HIMSS (Chicago, IL) in Apr 2015", "Interview Descriptions": "Easygoing and relaxed atmosphere that made it easy to ask questions about the company and position. It  was a panel interview, but not intimidating at all. The manager of the department clearly stated the needs of the company and what would be expected of a new-hire.", "Interview Questions": "How do you handle workload and deadlines? Are you team oriented? Will you be able to communicate to management if need help/are struggling?"}], [{"date": "11 Feb 2015", "title": "Audience Department Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HIMSS (Portland, ME)", "Interview Descriptions": "Received phone call just asking a few basic questions I feel to more see if we click than if I had the skills for the job.  Then in-person interview was 30 min. Questions basic, interviewer bad mouthed last boss & swore in the interview. I almost liked the honesty but almost ran. They also said they were \"so busy\" so many times I felt antsy.", "Interview Questions": "Basic"}, {"date": "15 Feb 2015", "title": "Marketing Copywriter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at HIMSS (Portland, ME) in Nov 2014", "Interview Descriptions": "I was called for a 30 minute phone screen followed by one in-person interview. When informed of the in-person interview, I wasn't told I would be meeting with two additional people, and thus was not prepared with enough copies of my resume or cover letter when I showed up. Overall, the hiring manager seemed nice, but had forgotten what we had already spoken about over the phone, and in general seemed a bit unorganized. Related (I assume), the two others who I met with had not been filled in on my background, and so it really would have been helpful to have left a resume with each. \r\n\r\nI prefer structured interviews, and in talking with all three individuals (separately, none together) there was not much preparation and no structure to what they asked, but overall, it was pretty easy. The basic questions about my previous roles were asked and not really anything in much depth. I spent about 20 minutes with each person. I provided writing samples after the phone screen and before being offered the second interview and was one of three finalists for the position.", "Interview Questions": "Basic background questions."}, {"date": "9 Oct 2014", "title": "New Media Producer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HIMSS", "Interview Descriptions": "Received an initial phone call that only asked my previous salary. I gave it, and the hiring manager said that was above their range already, but maybe we could meet to see if we could work something out. They had me fill out a lengthy application and come in for an in-person interview within a week. The interview was fairly basic; what sort of management do you prefer, went into technical details on resume, etc. Sent out customary thank you notes and didn't hear back. Sent a follow up email to my contact after two weeks, and received a rejection almost immediately from a no-reply email from a recruiter I never interacted with. \r\n\r\nVery poor candidate experience. A phone interview should have been conducted, felt like my time was wasted, and a company needs to always follow up after an interview.", "Interview Questions": "Nothing really unexpected or particularly probing."}, {"date": "22 Sept 2015", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at HIMSS (Portland, ME) in Jul 2013", "Interview Descriptions": "Basic interview process - meet with manager of department, then if it goes well, meet with the rest of the team. This was a very basic run of the mill interview for me. I met with the manager of the department, then I had a phone interview with her manager. I came in for a few days and worked as a freelancer so that they could see how I would fit in with the rest of the team. Overall experience - I came out of the interview knowing that I would be a good fit for the team, and that my previous experience was perfect for the role.", "Interview Questions": "How does your experience relate to our field?"}]]