[[{"date": "27 Dec 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Urban Land Institute", "Interview Descriptions": "Very thorough and helpful and heard back in a timely manner. Had an opportunity to meet the broader team. They asked thoughtful questions and gave a lot of background about what the job would entail.", "Interview Questions": "talk about how your solved software issues that may have impeded project deadline"}, {"date": "7 Dec 2022", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Urban Land Institute (Washington, DC)", "Interview Descriptions": "Applied online and submitted resume and cover letter. Was then later contacted by a generalist in the HR department for a phone screen. Finally, I did a phone interview with the hiring manager and received an offer thereafter.", "Interview Questions": "This internship was for college students so questions focused around my experience with other internships to date and relevant academic coursework."}, {"date": "19 Nov 2022", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Urban Land Institute", "Interview Descriptions": "I had 3 rounds of interview : 1. By phone with the direct manager 2. In person with the direct manager and another colleague that the role will be working with 3. In person with the executive director", "Interview Questions": "Very typical interview questions - What are your strengths and weaknesses? - Where do you see yourself in 5-10 years?"}, {"date": "23 Jan 2022", "title": "Town Planner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Urban Land Institute", "Interview Descriptions": "1-1 interview with the company founder, which was fairly informal and friendly. Lasted for 30 minutes only and was undertaken virtually. Discussed the industry in general and got to understand more about the company ethos.", "Interview Questions": "Q: What are the best parts of the industry"}, {"date": "9 Nov 2021", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Urban Land Institute", "Interview Descriptions": "Relatively easy and informal interview conducted online with two employees.  Only straightforward and basic questions were asked. A large portion of the time was allowed for questions I held as well.", "Interview Questions": "Why are you interested in this role?"}, {"date": "2 Nov 2021", "title": "Associate Level Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Urban Land Institute (Washington, DC) in Oct 2021", "Interview Descriptions": "The HR firm they hired contacted me to set an interview. It was a great experience and it was helpful to understand the job description. We had good chemistry and I then had a second interview with the hiring director.", "Interview Questions": "General about experience and projects"}, {"date": "16 Jun 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Urban Land Institute", "Interview Descriptions": "This was for the Washington Bureau. Everyone I met throughout the process was very friendly. Three interviews -- two with the Director and one with a panel of the staff.", "Interview Questions": "What is your experience with a membership-based organization?"}, {"date": "12 May 2021", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Urban Land Institute in Mar 2021", "Interview Descriptions": "It was a quick 15 min Zoom \"phone screen\" with many questions.  Interviewer was nice but did not give much information about the role or company since it was a phone screen.", "Interview Questions": "What public speaking experience do you have?"}, {"date": "12 Dec 2020", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Urban Land Institute", "Interview Descriptions": "Interview was straight forward and fairly quick (under 30 mins). I met with the head of the team directly (as opposed to HR) and felt very comfortable during the entire interview.", "Interview Questions": "What makes you a good candidate for this position? "}, {"date": "29 Jan 2020", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Urban Land Institute", "Interview Descriptions": "They worked through an external recruiting agency who gave me a false sense that I had already been accepted for the position. She basically told me that I already had it. I went through two in-person interviews, one which included a writing test.", "Interview Questions": "Where do you see yourself in 5 years?"}], [{"date": "10 Aug 2019", "title": "Event Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Urban Land Institute (Atlanta, GA) in Jul 2019", "Interview Descriptions": "30 min phone call with main director. Discussed education, background, interest, projects, future goals. She was kind, candid, open, and thoughtful. It was the most comfortable I’ve ever felt in an interview.", "Interview Questions": "My experience and interest in the role "}, {"date": "3 Jan 2019", "title": "Senior Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Urban Land Institute in Dec 2018", "Interview Descriptions": "The quality of the interview process was extremely poor and lacked professionalism at every step. It was particularly surprising and disappointing, since ULI is a respected institution with a positive track record and reviews for employment outside of the DC HQ. After I applied, the first response came from someone contracted from ULI to lead the initial screening. She called without notice at 7pm on a weeknight, and asked if I was available for an interview right then. I replied that I was making dinner -- and she responded that she would be happy to call back later that night, at 9:30pm. I was so surprised at the timing of this initial contact, that I agreed to the late evening interview to show some flexibility. She never called back that night. Two days later, she sends me a text, apologizing for not getting in touch, and asking if I was available for an interview right then (again, with no previous notice), or later that afternoon. We agreed to have the first interview the next day (over video chat). But 15 minutes into the interview, she cuts me off in the middle of one of my answers, saying that she had another call she had to make, and asked if we could continue the interview later that afternoon. Needless to say, all of this showed a tremendous lack of respect for my time, and reflected a stunning level of disorganization for someone managing an interview process for an important position to lead ULI's presence in a large city. After finishing this first interview, all further communication came via text either late at night or early in the morning -- with email follow-ups when I didn't immediately respond to a text at 11pm about a follow-up interview.\r\n\r\nThe rest of the process was not as disorganized. However, after ULI's regional leadership scheduled a third round interview in person, the original recruiter alerted me only 45 minutes before the interview that the ULI staff had flight trouble and would be late or possibly unable to make the interview at all. But she suggested I continue with one of ULI's local board members. When I arrived, the process was behind schedule, and I waited for about an hour before communication or updates from anyone. This wasn't necessarily the ULI board member's fault, since he was put into the lead interviewer role with short notice and perhaps wasn't as up-to-speed on the process as the ULI staff that were delayed by the flight issue. But it was just the last problem in a long line of problems throughout the entire process.\r\n\r\nI still respect ULI as an organization -- but this was a horrible process, and should be corrected in the future.", "Interview Questions": "Strengths / weaknesses"}, {"date": "14 Sept 2018", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Urban Land Institute", "Interview Descriptions": "I had 3 interviews, one of which was an HR recruiter. It was pleasant and quick  and to the point, I had to complete a written assignment and my hiring manager was helpful and encouraging", "Interview Questions": "What made you interested in the job?"}, {"date": "8 Dec 2018", "title": "Corporate Relations Manager-ULI China Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Urban Land Institute (Shanghai, Shanghai) in Sept 2018", "Interview Descriptions": "Very insincere and hypocritical line manager. Wasted my life! Crap indeed!!!\r\n\r\nNever gave me any final result. The interviews seemed like only for collecting candidates’ ideas of how to grow their business. \r\n\r\nFew months ago, I applied for a job and the line manager contacted me from Singapore for arranging an online interview. \r\n\r\nA few days later, during the interview, she asked me about my background, how to attract customers for ULI, etc. and said they hope someone can start the job as soon as possible. She talked very nice with enthusiasm, saying if I had any questions, very welcomed to ask. If I passed the first interview, the second one would be in ULI’s Shanghai office. In short, her words would make you feel she was such a nice supervisor as well as a very easy-going person to work with. I did believe and raised relevant questions but in her email, instead of answering me directly, she said would do, however never. \r\n\r\nAfter one week, she contacted me again for the second interview – a quiz instead of a face-to-face interview. I was asked to read brochures and analyze their membership DATA. Quite amazing!!! \r\n\r\nThen, after another more than three weeks, I finally met two people in a mini, crowded and messy office (ULI seems doesn’t have an official office in China). The working environment looked very unpleasant. They asked me many questions. Most of them were about how to grow their business, attract customers, what do I think of their this and that. They talked nothing about what benefits, welfare, anything that they can bring to the future employee. \r\n\r\nAfter that,  none of the interviewers contacted me.", "Interview Questions": "Provide observations and an analysis on the trends in addition to two or more ideas on how to grow the Corporate Membership program"}, {"date": "8 Jun 2016", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Urban Land Institute in May 2016", "Interview Descriptions": "Sent an email in response to their numerous listings for interns back in February 2016 (I only sent in my resume for one specific position). Got a response email in mid-May offering to set up a phone interview. Recruiter totally forgot to call me for the phone interview, but chalked it up to connectivity issues - did not think to email me to warn me or anything like that. Rescheduled the interview for the next day, where I waited twenty minutes after our scheduled meeting time to call her. Cited connectivity issues again.\r\n\r\nI get that this is an internship, but the interview questions weren't even half-baked; other internships at the Master's level that I've interviewed for (and received offers from) at least asked about prior experience and classroom experiences.\r\n\r\nShe let me know that the position I applied for had been filled a while ago, but she would put me in contact with someone else in a different department for a second interview. It's been about two weeks and no word.\r\n\r\nI don't expect full contact with every firm I apply to; most of us are lucky to get a courtesy email for applying and not getting chosen. But why set up an interview if you're just going to blow right through it? Easily the most unprofessional HR employee I've ever encountered. Glad I wasn't hinging on ULI for a position!", "Interview Questions": "Would you prefer to work with member relations, or with actual research?"}, {"date": "7 Oct 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Urban Land Institute (Washington, DC) in Apr 2016", "Interview Descriptions": "I had a brief phone interview, about 15 to 30 minutes long. It was very open ended. My advice - Do your research on what projects the team has done and will do, name drop any ULI members you have interacted with and say how all of that matches your experience and education to date. I ended up getting the job. All work here is project-based, so ask your local District Council what projects are underway now and see how you can help. Technical skills, concise writing and strong communication skills are a plus at this job.", "Interview Questions": "Why do you want to work here?"}, {"date": "9 Sept 2015", "title": "Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Urban Land Institute (Dallas, TX) in Sept 2015", "Interview Descriptions": "Very friendly, professional and warm. Gave a lot of background information on the company and what the job entails. Was honest about the difficulties within the position and what challenges a person in this position would face.", "Interview Questions": "How long was I willing to commit to the company? They were looking for someone long term."}, {"date": "9 Jun 2015", "title": "Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 6 weeks. I interviewed at Urban Land Institute", "Interview Descriptions": "After submitting my resume and cover letter online, I heard back within 48 hours scheduling a phone interview with human resources staff. Phone interview was very basic, describing the duties of the position and outlining benefits. My first in person interview was scheduled to take place later in the week. I was invited to a second in person interview, which took place about a week and a half after the first in person. From the last interview, it took three weeks to hear a response. I felt like the process moved at a quick speed up until when they were making the final decision.", "Interview Questions": "Describe a time when you had to overcome adversity. "}, {"date": "11 Aug 2016", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Urban Land Institute (Washington, DC) in Jun 2015", "Interview Descriptions": "I applied online and got an email asking to set up a call. I received the call at the time specified in the email and noted that while the position I originally applied for was filled, there was another position I was qualified for in another department. I readily agreed to a video interview (I was away from the area for a few days and couldn't make the face-to-face interview in the 3 day window specified). The video interview comprised of a panel: my future manager and two coworkers. They asked targeted questions and dispelled my nervousness quickly.", "Interview Questions": "What are three words that describe you?"}, {"date": "15 Jul 2010", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Urban Land Institute (Washington, DC) in Jun 2010", "Interview Descriptions": "I was contacted for a phone interview. The phone interview was supposed to be 20 minutes and ended up being 40 minutes. I received an email inviting me to an interview for a similar position and I declined because I wanted the other one.", "Interview Questions": "What was it that interested you in this position?"}], [{"date": "21 Jun 2010", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Urban Land Institute (Washington, DC) in Jun 2010", "Interview Descriptions": "I applied for this job online. Had an initial telephone interview with their recruiter which led to a face to face with the head of Human Resources and an executive-level manager.  Thirty minutes were allotted for each interview and they were held on the same day. Both gentlemen were professional and pleasant. Both interviews stressed the importance of finding someone to fit in with the office culture, a bit more relaxed than a corporate atmosphere. They can wear jeans on casual Friday.", "Interview Questions": "There were no questions that were difficult or unexpected."}]]