[[{"date": "15 Mar 2021", "title": "Fitness Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Walker Methodist (Minneapolis, MN) in Mar 2021", "Interview Descriptions": "A phone interview and then followed by a 30 to 45 minute zoom interview. The first one was with a Human Resource Recruiter and the second one was with a manager.", "Interview Questions": "Why is Walker Methodist a company you want to work for?"}, {"date": "18 Jan 2021", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Walker Methodist", "Interview Descriptions": "Phone interview for first round, zoom meeting for second round, and in-person for final round.  Both phone and zoom interviews were conducted by hiring manager. In-person interview consisted of a panel with three staffs from the department.", "Interview Questions": "Tell me about a time when you were able to demonstrate respect and compassion during a conversation in which you disagreed on?"}, {"date": "27 Jun 2019", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Walker Methodist", "Interview Descriptions": "The interview process was pretty straight forward with basic questions. They give you scenarios and are looking for well thought out answers. I was interviewed by 3 people and then met with the nurse director. They gave me a tour of the building/unit and at the end they offered me a position.", "Interview Questions": "If you had a shower to give and there was a call light going off which one would you tend to first?"}, {"date": "25 Mar 2020", "title": "Server/Waiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Walker Methodist (Lakeville, MN) in Oct 2018", "Interview Descriptions": "Apply online before you go in. But then just walk in a couple days after and say you applied. They’ll then ask you some really basic questions. They just ask if you’ve interacted with the elderly and what days you could work.", "Interview Questions": "What hours can you work?"}, {"date": "1 Jul 2018", "title": "Fitness Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Walker Methodist", "Interview Descriptions": "Started with an initial phone interview with basic job history questions. Scheduled an in-person interview with two directors and had 45 minutes of a question/answer interview. Mostly situational, not topically based questions.", "Interview Questions": "Why are you a good fit for the position you are applying for?"}, {"date": "18 Sept 2017", "title": "Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Walker Methodist (Minneapolis, MN)", "Interview Descriptions": "I was very impressed with the interview and the process.  It was well planned, I was asked thoughtful questions and appreciated the insight and candor I received in answering my questions.  The communication was terrific and I am thrilled to be part of this organization.", "Interview Questions": "Your background is limited in this field. How would you apply you experience to this role?"}, {"date": "26 Apr 2017", "title": "Server/Waiter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Walker Methodist", "Interview Descriptions": "They called me for an interview about three days after I applied on an online website. It was a group interview. They askes me questions mostly scenario questions. Like, what would you do if..\r\nThen they asked me to do a job shadowing.", "Interview Questions": "How do you think this job will help you later on?"}, {"date": "30 Aug 2020", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Walker Methodist (Saint Paul, MN) in Aug 2016", "Interview Descriptions": "The interview process was very simple and easy. The company itself is a great company. I would recommend you do some research before applying. I would also recommend you know what a mandated reporter is.", "Interview Questions": "The interview questions was basically behavioral questions "}, {"date": "6 Oct 2015", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Walker Methodist (West Saint Paul, MN) in Jun 2015", "Interview Descriptions": "Hiring and interview was pretty average and quick. I was interviewed by two women who were very nice and knowledgeable about the company and my role. They seemed optimistic and offered me a job/shift opening right away.", "Interview Questions": "What makes you a good person for this role?"}, {"date": "9 Mar 2016", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Walker Methodist (Lakeville, MN) in Jan 2015", "Interview Descriptions": "I applied in person and got an interview the same day. It was quick and casual and there was a basic quiz on reading blood pressures and such. They sent me for substance testing immediately after and I was offered the job as soon as it and my background check cleared the next day.", "Interview Questions": "Why do you want to work with seniors? "}], [{"date": "26 Jul 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Walker Methodist (Saint Paul, MN) in Jul 2014", "Interview Descriptions": "Got called 3 days after submitting my application online. Set up an interview that next Monday. Took a quick test and if you pass the test you move on to the interview. The interview was standard, took about 30 min. Said they would get back to me by Friday, on the phone, if they wanted me and a letter in the mail if they didn't.", "Interview Questions": "Tell me about yourself?"}, {"date": "12 Dec 2015", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Walker Methodist (Minneapolis, MN) in Apr 2013", "Interview Descriptions": "Was called during the morning, two days later went to the interview 3 days later hired. They asked me what my availability was when I could start, I told them two weeks and began April 11.", "Interview Questions": "Why do enjoy doing being a nursing assistant?"}]]