[[{"date": "23 Jun 2022", "title": "Entry Level Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Green Corps", "Interview Descriptions": "Very good, talked to one person and was asked about my prior experience. I told the interviewer about myself and my experience, why I wanted to join the company, what my skill set was, etc. The interview was conversational.", "Interview Questions": "Tell me about yourself and walk me through your resume"}, {"date": "12 Sept 2021", "title": "Campaign Organizer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Green Corps", "Interview Descriptions": "Unnecessarily long process for a job that barely pays (and sometimes doesn't). Recruiters discussed how they had trouble with their hirers, but discounted those with the most experience. The group interview (second) started with show and tell... and then individual interviews, group interview, and a writing portion.", "Interview Questions": "Bring an object that shows why you want to work here."}, {"date": "26 Apr 2021", "title": "Green Corps Organizer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Green Corps", "Interview Descriptions": "Gives a good understanding of what the position involves. The in person process has you start with a presentation, followed by presenting a speech you wrote for the day. After that is a one on one interview, followed by lunch, more presentations, and a canvassing “trial” where you go out into the area nearby and ask people to sign a petition", "Interview Questions": "The red flag for me was when I was asked about whether I would support their environmental  efforts or the efforts of BIPOC environmental groups. "}, {"date": "1 Apr 2021", "title": "Environmental Organizer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Green Corps", "Interview Descriptions": "Digital interview via Zoom, met with recruitment coordinator and discussed my experiences and goals. I was asked about some example scenarios and what I would do, my work history, etc.", "Interview Questions": "Why are you interested in working with Green Corps, and what motivates you to work on environmental issues?"}, {"date": "17 Mar 2021", "title": "Campaign Organizer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Green Corps", "Interview Descriptions": "I thought the interviewer was positive and quickly offered me a writing portion moving forward. The writing portion asked questions about which issues you agreed with on someone on the other side of the aisle as well as which issue is the biggest one facing the world right now.", "Interview Questions": "Why do you want to organize?"}, {"date": "9 Feb 2021", "title": "Field Organizer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Green Corps", "Interview Descriptions": "It was pretty easy and straightfoward. My interviewer was very nice and open and we talked a lot about why I wanted to have this job and what I would bring to the table.", "Interview Questions": "Why do I want to work with Green Corps "}, {"date": "13 Apr 2021", "title": "Green Corps Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Green Corps in Feb 2021", "Interview Descriptions": "This interview process is so unnecessarily tedious. You will have a phone interview, a \"Questionnaire\" take-home assignment, and a FOUR HOUR LONG group interview with a Green Corps panel. Thankfully, this year the group interview was on Zoom. The Questionnaire takes about an hour to complete. \r\n\r\nThroughout this process, Green Corps does not want to get to know you. They ask you specific (repeated) questions and want specific answers that directly align with the organization. Which is understandable, however they are not looking for diverse views or strategies. It is also emphasized how much the fellows work and how little they get paid. You will be expected to work 50 - 60 hour weeks with no guaranteed housing and wages just over the poverty line. Interviewing was tedious for no reason and Green Corps does not seem to want real innovative fellows, only more of the same.", "Interview Questions": "Green Corps poses a scenario about a carbon tax in Oregon. They say this carbon tax, as it is written, will disproportionately negatively impact minorities and low-income families. They ask: would you support this bill in its entirety, oppose this bill in its entirety, or advocate to rewrite the bill?"}, {"date": "9 Dec 2020", "title": "Environmental Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Green Corps", "Interview Descriptions": "It was a very straightforward process. The interviewer was very clear in communication, and I knew what to expect from the interview. The interview took place over the phone, and lasted about 30 minutes. The interviewer asked questions about myself, my experience, and how I would handle certain aspects of the job.", "Interview Questions": "How to get people to take an active interest  in climate change"}, {"date": "27 Jul 2020", "title": "Field Organizer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Green Corps", "Interview Descriptions": "An initial interview with a campus recruiter followed by an online questionnaire and another group interview. The group interview had some facilitated group conversation followed by a one-on-one conversation and an individual timed writing section.", "Interview Questions": "Describe your leadership style or approach to leading a group? "}, {"date": "21 Mar 2020", "title": "Green Corps Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Green Corps", "Interview Descriptions": "I applied online and got a rejection response in about a week. Without my permission Green Corps shared my information and application materials with organization called the Fund (which is known to prey on idealistic young people and screw them out of their pay, there has even been a lawsuit against them). Since the rejection email I have been contacted by the Fund every other day. Perhaps this kind of behavior just shows what kind of place Green Corps truly is. I am happy I was not presented a chance to waste my time with them.", "Interview Questions": "N/A"}], [{"date": "18 Nov 2019", "title": "GreenCorps Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Green Corps", "Interview Descriptions": "Although GreenCorps fellows engage in incredible work, I am glad I was not offered a position. The organization seems to demand a lot of its employees--consistently asking for 60+ hour work weeks for a salary of only $27.5K a year that requires participants to move several times throughout the year. I believe the low salary and inability to put down roots in one place would have posed both a financial and social strain on me, not to mention the stress of having to work constantly. \r\n\r\nThe interview process involves an initial application with a cover letter, resume, and a few short questions. There is a screening interview, then a questionnaire that requires answers to three questions and a one page essay to be answered within 48 hours. Finally, those accepted to the final-round interview must pay out of pocket to go to Boston, Chicago, or Denver (or do a Skype interview). This interview lasts a whole day and  involves petitioning and an interview as well as a three-minute speech practice (which must be written and memorized in advance) and a timed writing sample. It is very demanding in terms of time both day-of (it lasts the whole day) and in terms of preparation. To echo a previous reviewer's sentiments, it did not feel like a respectful use of prospective fellows time...or money. \r\n\r\nI would also like to add that GreenCorps asks for SAT/ACT scores. Why are they asking people about to graduate college for these, especially when testing preparation and high scores are accessible to the wealthy/privileged? Based on the population of people at my interview, racial and socioeconomic diversity was not being prioritized. GreenCorps also recruits at \"top-tier\" universities which means they're targeting an already privileged population. (Maybe because people who aren't already wealthy can't afford to live on their wage and pay loans?).", "Interview Questions": "Why do you want to organize?"}, {"date": "12 Nov 2019", "title": "Coalition Building Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Green Corps", "Interview Descriptions": "The process was very simple  but not much of a vetting process. Other interns were not reliable. There were not consequences for not delivering results.  I did enjoy how casual and low pressure the interview was.", "Interview Questions": "Why do you want to join our project?"}, {"date": "9 Nov 2019", "title": "Organizer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Green Corps", "Interview Descriptions": "The first round was really easy, basically, if you show up then you get moved to the second round. The second round was a group interview and it is a full day. Definitely be prepared for a commitment if you want the job!", "Interview Questions": "Name a time you had a challenge and how did you overcome it?"}, {"date": "5 Jun 2019", "title": "Environmental Organizer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Green Corps (Washington, DC) in Mar 2019", "Interview Descriptions": "Written Application qualifies you for a phone interview, which qualifies you for a day-long in person group interview. This requires you to travel to a regional center, for me it was Washington DC, at your own cost. The day consists of a one on one interview, writing/speaking section, and petitioning out on the street.  Overall I found the interview process to be incredibly time-consuming for a low salary position that I have since heard very negative things about and found it disheartening how many times Green Corps folks emphasized that they did and expected us to as well focus exclusively on environmental issues even to the detriment of other social issues.", "Interview Questions": "Regarding a recent failed carbon tax in Washington state that failed because it faced opposition not only from conservatives but also from progressives who wanted more of the money to go to low-income communities, what would you say at a press conference/would you support this legislation?"}, {"date": "16 Feb 2018", "title": "Field Organizer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Green Corps (Washington, DC) in Feb 2018", "Interview Descriptions": "There is a multi-step interview process: the initial application, a phone interview, a questionnaire, and an in-person group interview. You are tested on your people skills (petitioning), public speaking, and writing. You also have a one on one conversation with one of the staff members. I made it to the final round but was turned down because I emphasized intersectionality in my approach to activism, whereas, as the Executive Director Annie told me over the phone, \"Green Corps is not an environmental justice organization.\" I was referred to another organization that they thought would be a better fit.", "Interview Questions": "Imagine you are organizing an event to pressure a company to stop its poor environmental practices. What types of speakers would you invite?"}, {"date": "22 Feb 2018", "title": "Green Corps Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Green Corps (Chicago, IL) in Feb 2018", "Interview Descriptions": "There's phone call interview. Then if you pass, there's a group interview in person that you attend with around 10-15 people. There process of public speaking, individual interviews and petitioning on the streets.", "Interview Questions": "Why Green Corps? "}, {"date": "17 Feb 2017", "title": "Organizer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Green Corps (Boston, MA)", "Interview Descriptions": "One Skype interview and an in interactive person group interview with guest speakers, a writing sample, multiple small interviews, a mock presentation, etc. The group interview is with about 15 other kids then you're broken down into small groups to give a speech, do one on one interviews and produce a writing sample. It seems to be a bit of a hyper competitive atmosphere, but the questions all just tested your general passion for the cause.", "Interview Questions": "All basic questions about why you want to work there, mostly gauging passion and previous experience with the environmental movement."}, {"date": "9 Jun 2016", "title": "Field Organizer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at Green Corps (Campus)", "Interview Descriptions": "Interviewed on campus with university alum. Great, casual interview. Went on to several secondary interviews through Skype (couldn't make it to one of the full-day interviews in the large cities). About 4 or 5 Skype interviews later, never got another email back. Guess I didn't get it! Shame, I really enjoyed the interview process (as drawn out as it was), and was very appreciative of them making alternative interview opportunities, since they do prefer to see candidates in-person to get a true picture. The interviewers (went through 4 total), were all great and very friendly. After the initial interview with the alum, had one Skype interview with some more typical interview questions, one group Skype interview where I prepared a speech and some other actions, plus a couple more follow up interviews with more typical interview questions.", "Interview Questions": "How do you manage heavy workloads and having several different priorities? Alternatively, describe a time you were very busy with projects and managed your time to complete them successfully."}, {"date": "4 Mar 2016", "title": "Activist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Green Corps", "Interview Descriptions": "Campus recruiter approached me and invited me for an interview. Process was very informal. I got invited for the second round but I declined it after I learned that they dont cover any expenses for the interviewing process or the constant relocation after getting the position", "Interview Questions": "How did you plan an environmental movement?"}, {"date": "1 Aug 2016", "title": "Organizer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Green Corps (Chicago, IL) in Feb 2016", "Interview Descriptions": "There was a multi-part interview process, starting with an online application, a screening interview on campus at the college I attended, and then a regional interview (final interview) in Chicago, IL. This varies depending on the location you apply from. The final interview had about 60 people attending from across the region, of which only 5 were offered positions or referred to other employers. The final interview process was a day long, exhaustive and exhausting process that had multiple different parts: public speaking, writing, canvassing, and multiple rounds of interviews (both one on one and to a panel of three people). The interview questions were largely behavioral. \r\n\r\nFor public speaking, we had to prepare a speech the week before, present it, receive feedback, and incorporate that feedback into doing it again. We had to respond to 2 writing prompts about the environmental movement and organizing. For the canvassing part, we were instructed on how to canvas (go out and get signatures for campaigns) and canvas in a few blocks of space for 1 hour or so at a campus nearby for one of their campaigns. We were competing for signatures essentially. We also had 2 rounds of interviews (1 on 1 & 3 people interviewing us).\r\n\r\nThe whole day-long process was exhausting and very intensive as you are constantly having to do different interview modules and interact with current organizers and other Green Corps applicants. Afterwards there was a social hour at a bar for those who are 21+, this felt like a continuation of the day long process.", "Interview Questions": "What was a time you faced a problem in working towards a goal and how did you address it? What process did you go through in approaching the problem and what were the results?"}], [{"date": "8 Aug 2016", "title": "Organizer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Green Corps (Boston, MA) in Feb 2016", "Interview Descriptions": "Had three interviews total: one in person on my college campus, one on-site, and one Skype. Most were behavioral interviews asking about past experiences handling stress, organizing, etc. The on-site one involved giving a speech, petitioning, and a written assessment. The third interview was mostly reserved for people who were not their first picks.", "Interview Questions": "Describe a time in your life when you had too much on your plate. How did you handle the situation?"}, {"date": "22 Apr 2016", "title": "Green Crops Organizer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Green Corps in Feb 2016", "Interview Descriptions": "I was asked to have a brief phone interview. I had the interview with someone who used to be a part of Green Corps and now works with an affiliated organization. It was just an initial phone screen, asking about stuff I had done on my campus that related to the work I would be doing with Green Corps. I was asked a lot of specifics about the work I decided to talk about.", "Interview Questions": "Describe a campaign you led on campus"}, {"date": "19 Mar 2017", "title": "Field Organizer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Green Corps (Chicago, IL) in Feb 2016", "Interview Descriptions": "If you are recruited at your university, you may receive a first-round interview on campus or over skype. You can also apply online and then you may receive a first round skype interview. If successful, you will be invited to a second round interview. These are held in Chicago, San Francisco, and Boston. The second round interview is quite amusing as it is very hands-on. There will be anywhere between10-30 others at your second interview and they will have you do a speech, writing prompt, mock petitioning outside, and 1:1 interviews. \r\nOnly a few will be accepted in each city.", "Interview Questions": "Talk about a time when you had a challenge and how you overcame it."}, {"date": "5 Apr 2015", "title": "Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Green Corps (Chicago, IL)", "Interview Descriptions": "After making it past the initial application, you will either have an in person or Skype interview. I do not live in a major city so it was over Skype. If you make it past the Skype interview, you will most likely be invited to an in-person group interview in a major city.", "Interview Questions": "Explain an environmental community campaign you organized?"}, {"date": "13 Nov 2014", "title": "Environmental Organizer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Green Corps", "Interview Descriptions": "First, you are asked to submit an application and essay. I received my notice for a first round interview within a few hours after my submission. I had a first round, in person interview, the following week. The interview was fairly informal and asked behavioral questions. I was then asked to come back for a second round interview in Washington, DC. The interview process was quite long (8 hours) and consisted of a three portions: petitioning, public speaking, and two, 25 minute interview rounds. All of the questions were behavioral.", "Interview Questions": "You have just been elected President of the United States and are about to give a speech on your top three policy priorities. What are they and why?"}, {"date": "24 Sept 2014", "title": "Field Organizer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Green Corps", "Interview Descriptions": "First round phone interview, second round interview in either Boston, DC, Chicago or SF. Green Corps does a lot of recruitment work, and folks come from all over: career fairs, info sessions, the website, you name it.", "Interview Questions": "Described a time you failed"}, {"date": "19 Jul 2014", "title": "Field Organizer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Green Corps", "Interview Descriptions": "Two interviews, one on my college campus and one large group interview in Boston. The second interview included a huge group, maybe 45 people, and Green Corps told us at the end of the process that they would only accept one or maybe two of those people. I don't think that's a respectful use of prospective employees' time.", "Interview Questions": "Talk about a time when you've failed (I hate this question in general because, as I see it, people who have genuinely failed aren't in a position to be seriously considered for these sorts of jobs. We've had setbacks, sure, but not failures."}, {"date": "12 Jul 2014", "title": "Green Corps Organizer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Green Corps (Chicago, IL)", "Interview Descriptions": "First they give you a phone or Skype interview that asks pretty basic questions about your experience. There are also questions that deal with why you are going into environmental organizing. The second round interview was held at a university and there was a morning and afternoon part. Groups are split up and half of the people do petitioning in either the morning or afternoon and the other half do in person interviews and public speaking. When I did it, public speaking consisted of three people in a group with two current Green Corp members and they gave you a dilemma, you had one minute to figure out how you'd respond and then I think three minutes to give a response.", "Interview Questions": "Most difficult was during the public speaking section where the scenario involved you organizing a festival and some oil company wanting to sponsor the brochures for it. You had to decide whether to let them or not."}, {"date": "9 Jul 2014", "title": "Green Corps Organizer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Green Corps", "Interview Descriptions": "The process involved a written application, one first-round interview, and one second-round interview. The second-round interview lasted one entire day and involved discussions, demonstration of speech skills, petitioning in the field, and another interview.", "Interview Questions": "Imagine you've arranged for a press conference for an anti-coal campaign. The local coal company has given all of its employees the day off so that they can show up at the conference in support of the company. What do you do?"}, {"date": "1 May 2015", "title": "Recruitment Outreach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Green Corps (Denver, CO) in Apr 2014", "Interview Descriptions": "I had a Skype interview with the Recruitment Director, and was hired soon after that. I was referred by someone from another organization so it probably took a shorter amount of time than usual. I had some questions prepared to ask Charlotte as well, but for the most part I talked a lot about what I had been doing in college up until that point, and about my interest in the field of environmental issues.", "Interview Questions": "Why do you want this position? Tell us about your background, interests, etc.."}], [{"date": "8 Feb 2014", "title": "Field Organizer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Green Corps", "Interview Descriptions": "I applied online and got a first-round interview with an alum from my college. He was friendly and the interview was basically a breeze and he gave me an offer for a second-round interview on the spot. I accepted and flew into Chicago (without any financial assistance from them) for the second-round interview. It's an intense, day-long interview.", "Interview Questions": "Why should we hire you?"}, {"date": "2 Dec 2012", "title": "Organizer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Green Corps (Chicago, IL) in Nov 2012", "Interview Descriptions": "I got a phone interview with Green Corps at the beginning of November.  Then they postponed it until after the election. The interview went well with no curve-balls and I was asked on the spot to go to a second round interview in Chicago *only two days later*. I had to pay my way there, although they did find someone to host me overnight so I didn't have to stay at a hotel.  The day involved a public speaking session, time spent out petitioning, a campaign strategy session, as well as a one-on-on interview.", "Interview Questions": "You in a small town running a campaign for better air standards and the representative is holding a town hall meeting.  What's your plan? (I don't remember if this was exactly the question. This is the gist)"}, {"date": "13 Mar 2013", "title": "Field Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Green Corps (Washington, DC) in Nov 2010", "Interview Descriptions": "1st Round Interview was just 1 on 1. 2nd Round interview was a full day with 90 other candidates where they evaluated you on public speaking, petitioning, campaign strategy, and teamwork. Definitely an intimidating situation but came away learning a lot. The bring in notable alumni to share their experiences with the program", "Interview Questions": "Are you a radical?"}, {"date": "18 Mar 2013", "title": "Field Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Green Corps (Boston, MA) in Nov 2010", "Interview Descriptions": "I met a representative at a career fair on my college campus, and was able to sign up for an in-person interview while he was in town. I was invited to a second-round interview that was happening a couple of weeks later. There were probably about 70 other candidates there. It was really cool because there were a ton of alumni of the program who are now doing impressive things, and it was also fun to network with the other candidates. It was a mix of skills sessions on things like petitioning on public speaking, and speaker sessions (like a panel of alumni). Definitely an exhausting day, and it was really challenging to feel like I was \"on\" all the time, but I felt like I got a lot out of it. I think I got the job offer within a week, and I took a week to accept.", "Interview Questions": "A question that I remember struggling to answer was, \"What's the biggest problem our society faces?\" Obviously, it's a big question, and it was hard to pick one, but they definitely try to get you to think of a major root problem."}]]