[[{"date": "13 Sept 2020", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Florida Southern College (Lakeland, FL) in Nov 2019", "Interview Descriptions": "I had a phone interview, a zoom interview and an in person interview. They were looking for someone to fill the position as soon as possible so I was able to get in quickly. They made an offer a few days after my in-person interview. They were really nice. There were also students involved in the interview process.", "Interview Questions": "What are my greatest strengths and weaknesses?"}, {"date": "2 Jul 2019", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Florida Southern College (Lakeland, FL)", "Interview Descriptions": "The interview process was quite painless. I interviewed with the director of the program and Accreditation Specialist. I had the normal interview questions but also felt to be on a much more personal level as they asked general questions about me as well.", "Interview Questions": "What is your experience with Microsoft Office?"}, {"date": "10 Jun 2019", "title": "Laboratory Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Florida Southern College", "Interview Descriptions": "Phone and in person. Panel asked different questions. Was bosses and other faculty. Staff treated poorly. Different from faculty who are also treated poorly, High turn over. Was misleading of expectations. Empty promises of pay and opportunity. Negotiate on front end and still run away.", "Interview Questions": "What skills do you have?"}, {"date": "12 Dec 2019", "title": "Lab Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Florida Southern College (Lakeland, FL) in Sept 2017", "Interview Descriptions": "In department head's office with two other faculty members. Each person took turns asking questions about my experience, availability, and future goals. It was a very quick interview... 30 mins tops. Very few details about the intricacies of the position and the only opportunity for growth that they mentioned was being full time. They hired for part time with hopes of one day being full time. I was there for two years and that never happened.", "Interview Questions": "what was your role at your previous job and how do you think it applies to this position? "}, {"date": "25 May 2017", "title": "Instructor/Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Florida Southern College (Lakeland, FL)", "Interview Descriptions": "Initial Skype with former dean than flew in to meet with dean, provost, president than the entire nurse faculty and conducted a class lecture on a topic provided to me prior to the interview on campus (in my related field) which was critique by faculty and dean used to make final decision on hiring.", "Interview Questions": "Not applicable as what i wrote above explains a lot."}, {"date": "19 Jan 2017", "title": "Sales Associate/Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Florida Southern College (Lakeland, FL) in Aug 2016", "Interview Descriptions": "The application was done online. Personally I went to the store and introduced myself, asked for an interview, etc. However, the people who didn't were called back based on their availability they put in the application. It was a group interview. We all sat around in a circular and took turns answering the same questions, as well as introducing ourselves. After the interview was over the assistant manager told us we all got the job and we started filling out paperwork. I started work the next day.", "Interview Questions": "In a situation in which a customer says he/she is unhappy, how would you handle the situation? "}, {"date": "26 Jul 2017", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Florida Southern College (Lakeland, FL) in Sept 2015", "Interview Descriptions": "I sent in my application and left a voicemail (per request) reading a short script they had provided. A month or so later I was called in for an in-person interview. There was the Director of the program and her assistant. Both of whom were my direct supervisors once the shifts began.", "Interview Questions": "To describe a time when I had to deal with a difficult customer and how I handled the situation."}, {"date": "26 Feb 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Florida Southern College", "Interview Descriptions": "They listed the job posting on my graduate school's department facebook page. The ad was posted by an alumnus who was in charge of hiring the position.  I sent her an email and was set up with a phone interview with the department chair. He called at the appointed time asked me two questions and I was hired. They basically wanted to hire the first qualified person they came across.", "Interview Questions": "Do you have your Masters degree/ can you have your transcripts sent to my office? what are your pay expectations."}, {"date": "23 May 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Florida Southern College (Lakeland, FL) in Feb 2015", "Interview Descriptions": "There was a preliminary phone interview followed by a campus fly out.  I presented to a group of people who did not bother to dress tidily although I was expected to be in my best dress.", "Interview Questions": "How important is Marx's authentic voice in teaching English?"}, {"date": "14 Oct 2013", "title": "Visiting Faculty- Human Anatomy and Physiology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Florida Southern College (Lakeland, FL)", "Interview Descriptions": "One interview, I presented a lecture to my peers and students.", "Interview Questions": "N/A"}], [{"date": "21 Mar 2009", "title": "Division Chair Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 days. I interviewed at Florida Southern College (Lakeland, FL) in Jan 2009", "Interview Descriptions": "Very thorough process including reference checks and panel interview. Social experience on three separate occasions with several stakeholder groups.", "Interview Questions": "what is your experience and/or commitment to engaged learning?"}]]