[
    [
        {
            "date": "20 Jan 2023",
            "title": "Werkstudent Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I interviewed at Charité",
            "Interview Descriptions": "Es war ein super professionelles und aufschlussreiches Bewerbungsgespräch gewesen. Alle Fragen wurden beantwortet und man hat sich gut aufgehoben gefühlt. Gleichzeitig wurde einem sehr gut verdeutlicht, wie die zukünftige Tätigkeit aussehen würde.",
            "Interview Questions": "Was können Sie sich unter der Stellenbeschreibung vorstellen?"
        },
        {
            "date": "21 Dec 2022",
            "title": "Cleaning Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Easy Interview",
            "Application Type": "I applied in-person. I interviewed at Charité",
            "Interview Descriptions": "Very smooth, boss was very polite and respectful. It took about 30 minutes and he answer all my wuestion. I had apponintment and they were in time. Very professional and kind.",
            "Interview Questions": "Asked About working weekends, shifts and"
        },
        {
            "date": "16 Sept 2022",
            "title": "PhD Student Interview",
            "results": "Accepted Offer",
            "experience": "Neutral\nExperience",
            "difficulties": "Average Interview",
            "Application Type": "I interviewed at Charité",
            "Interview Descriptions": "The interview was Fair . They look for motivation and drive. Prepare by reading some scientific papers for the position in which you’re applying for.   Be sure to prepare some presentation slides of the work you’ve done previously. ",
            "Interview Questions": "Research goals.\nQuestions specific for the position in which you’re applying for "
        },
        {
            "date": "9 Nov 2022",
            "title": "PhD Student Interview",
            "results": "No Offer",
            "experience": "Neutral\nExperience",
            "difficulties": "Average Interview",
            "Application Type": "I applied online. The process took 2 weeks. I interviewed at Charité (Berlin) in Jun 2022",
            "Interview Descriptions": "I had one interview for charite it was 30 minutes, the supervisor was nice so were my colleagues and I did 15 minutes presentation about my master's degree work however, they didn't give me the job, now I'm expecting an interview can you help me to prepare so I get the job offer",
            "Interview Questions": "Master's work presentation. My lab experience. My questions for them. They didn't give me the waiting time so i can expect when to get the answer. They send me the answer after 2 months"
        },
        {
            "date": "26 Apr 2023",
            "title": "Assistenzarzt Psychiatrie Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Charité (Berlin) in Feb 2022",
            "Interview Descriptions": "Zunächst gab es ein halbstündiges online-Gespräch mit der gesamten Leitungsrunde. Jeder stellte sich vor und es wurden einige Fragen zum Werdegang gestellt. Dann erfolgte erneut ein persönliches Gespräch vor Ort mit dem Klinikdirektor. Es wurden Fragen zur aktuellen Forschungsarbeit gestellt.",
            "Interview Questions": "Fragen zum Lebenslauf, zur Forschung, zur Auslandserfahrung, zu den Beweggründen"
        },
        {
            "date": "15 Dec 2021",
            "title": "Wissenschaftlicher Mitarbeiter Interview",
            "results": "Declined Offer",
            "experience": "Negative\nExperience",
            "difficulties": "Easy Interview",
            "Application Type": "I interviewed at Charité",
            "Interview Descriptions": "Inkompetenz auf hohem Niveau. Gesucht wurde ein Knecht für diverse Dienste. Bezahlung Fehlanzeige. Potentieller Arbeitgeber konnte keine Auskunft geben was die Aufgabengebiete wären. Seriosität sieht anders aus. Besser ist man woanders aufgehoben.",
            "Interview Questions": "Es war nicht einmal allen Anwesenden klar was zu machen wäre. "
        },
        {
            "date": "16 Nov 2021",
            "title": "Studentische Hilfskraft Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I interviewed at Charité",
            "Interview Descriptions": "Sehr professionell organisiert gewesen vor allem wegen der Pandemie. Es herrschte eine angenehme Atmosphäre. Die Tätigkeit wurde sehr detailliert beschrieben und weitere Informationen folgten per Email.  Man konnte sich somit ein sehr gutes Bild von der Tätigkeit machen.",
            "Interview Questions": "Wie belastbar und teamfähig man sei "
        },
        {
            "date": "7 Mar 2023",
            "title": "Projektmanager Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I applied online. The process took 4 weeks. I interviewed at Charité in May 2021",
            "Interview Descriptions": "- 1. Gespräch fand statt mit Führungskraft und einer Kollegin aus dem Bereich - 2. Gespräch ein paar Tage später mit einem Kollegen aus dem direktem Team sehr lockere Atmosphäre, über Teams",
            "Interview Questions": "Wie gehst du damit um, wenn an deiner Führungskraft vorbei Arbeitsaufträge an dich herangetragen werden?"
        },
        {
            "date": "18 Mar 2021",
            "title": "PhD Student Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Difficult Interview",
            "Application Type": "The process took 1 week. I interviewed at Charité (Berlin)",
            "Interview Descriptions": "One presentation interview, 1 panel interview and interviews with each of the 5 PIs I choose in my application. This was for BSIO graduate school interviews in 2015. It was a pleasant experience as our transportation fares as well as hotel stays were paid for during the one week of interviews in Berlin.",
            "Interview Questions": "Where do you see yourself in 5 years time. what kind of project would you like to work on?"
        },
        {
            "date": "7 May 2021",
            "title": "Studentische Hilfskraft Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Charité (Berlin) in Mar 2019",
            "Interview Descriptions": "Ein sehr freundliches und kollegiales Gespräch, in dem ich mich wohl gefühlt habe und meine Stärken hervor bringen konnte. Das Gespräch fand in den Räumlichkeiten der Charite statt. Mir wurde ausführlich erklärt, welche Aufgaben auf mich zukommen werden und was von mir erwartet wird.",
            "Interview Questions": "Welche Vorerfahrung haben Sie in diesem Bereich?"
        }
    ],
    [
        {
            "date": "15 Sept 2021",
            "title": "Wissenschaftlicher Mitarbeiter/Doktorand Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Easy Interview",
            "Application Type": "I applied in-person. The process took 3 months. I interviewed at Charité (Berlin) in Dec 2017",
            "Interview Descriptions": "Es war sehr unkompliziert. Die Atmosphäre war sehr locker und entspannt. Dresscode war kein besonderer. Kollegen hat man auch kennengelernt. Eine Lab Führung hat man bekommen. Das Gespräch ging ca. 45 min lang.",
            "Interview Questions": "Was sind Ihre Stärken? Welche Programmiersprachen können Sie? "
        },
        {
            "date": "18 Aug 2016",
            "title": "Study Coordinator Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Easy Interview",
            "Application Type": "I applied through other source. The process took 1 week. I interviewed at Charité (Berlin)",
            "Interview Descriptions": "Sent my application by postal. Received a call after 2 days and got invited for an interview. Got the job on the same day. Received the contract a week after and started my job right away.",
            "Interview Questions": "Why do you want to become a Study Coordinator"
        },
        {
            "date": "21 Feb 2017",
            "title": "Facility Manager Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Difficult Interview",
            "Application Type": "I applied online. The process took 2 weeks. I interviewed at Charité (Berlin) in Jul 2016",
            "Interview Descriptions": "Herr Philip Schipmann hat mich interviewed. Es war die beste Mischung zwischen freundlich aber auch harte Fragen, die ich beantworten musste. Diese Art und Weise hat mich definitiv überzeugt bei der Charite zu arbeiten.",
            "Interview Questions": "Internes Prozess der Charite."
        },
        {
            "date": "2 Jan 2016",
            "title": "Gesundheit- und Krankenpflege Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Easy Interview",
            "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Charité (Berlin) in Mar 2014",
            "Interview Descriptions": "- Begrüßung der Bewerber und Vorstellung des Tagesablaufs\r\n1. Schriftlicher Test in Einzelarbeit\r\n2. Teamworktest; Aufteilung in 2 Gruppen á 4-5 Leute\r\n3. Einzelgespräch aufbauend auf den ersten Test\r\n\r\n- Verabschiedung der Teilnehmer",
            "Interview Questions": "- Fähigkeiten\r\n- Warum Krankenpflege\r\n- Studium angestrebt?\r\n- Stärken und Schwächen?\r\n-Vorkenntnisse und Vorerfahrungen"
        },
        {
            "date": "13 Jun 2015",
            "title": "Kinderkrankenpflege Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Average Interview",
            "Application Type": "I applied through other source. The process took 5 days. I interviewed at Charité (Berlin) in Mar 2014",
            "Interview Descriptions": "Zuerst habe ich mich schriftlich beworben, mein Abiturzeugniss sowie ein polizeiliches Führungszeugniss usw eingeschickt.\r\nAls ich eingeladen wurde, absolvierte ich zusammen mit noch 10 Anwärtern erst einen schriftlichen Test, in dem wir einer guten Freundin oä. einen Brief schrieben sollten, in dem stehen sollte wieso wir uns an der Charité beworben haben.\r\nDanach wurde in Kleingruppen eine Aufgabe gestellt, bei der wir beobachtet wurden.\r\nWir sollten zwischen 2 Tischen eine Brücke aus Papier bauen.\r\nAls Letztes folgte das dirkete Gespräch, bei dem mir 2 Mitarbeiter der Charité (ein Praxisanleiter und eine Lehrerin..was ich bis dato nicht wusste) gegenüber und stellten mir verschiedenste Fragen (wieso gerade diese Ausbildung, wieso an der Charité, was sind deine Stärken u. Schwächen usw... ).",
            "Interview Questions": "Wieso haben Sie sich für die Charité als Ausbildungsstandort gewählt?"
        },
        {
            "date": "27 Jun 2012",
            "title": "Postdoc-Wissenschaftler Interview",
            "results": "Accepted Offer",
            "experience": "Neutral\nExperience",
            "difficulties": "Average Interview",
            "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Charité (Berlin) in Dec 2011",
            "Interview Descriptions": "Ursprünglich wurde ich per E-Mail für das Telefoninterview kontaktiert.\nNach dem Telefoninterview wurde ich aufgefordert, nach Berlin zu kommen und eine Präsentation meiner bisherigen Doktoratsarbeit zu halten. Unterkunft und Frühstück wurden mir zur Verfügung gestellt, aber keine Reisekosten gewährt oder rückerstattet. \nIch absolvierte ein 1:1-Interview sowie auch ein Meeting mit den meisten Labormitarbeitern und wir sprachen über die Vorzüge und Nachteile des Labors. \nSpäter folgte eine ausführliche Diskussion mit dem Verantwortlichen für das Labor und dann das Warten auf die Interview-Ergebnisse.",
            "Interview Questions": "Wie sehen Ihre Zukunftspläne aus."
        },
        {
            "date": "23 Aug 2015",
            "title": "Wissenschaftlicher Mitarbeiter Interview",
            "results": "Accepted Offer",
            "experience": "Neutral\nExperience",
            "difficulties": "Difficult Interview",
            "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Charité (Berlin) in Mar 2011",
            "Interview Descriptions": "Kontaktaufnahme per E-Mail / Telefon, Vortrag über Diplomarbeitsthema. Kritische Fagen zum Thema. Spezielle Fachfragen (wie eine Diplomarbeitsprüfung). Diskussion über wissenschaftliche Interessen und zukünftige Vorstellungen. Mögliche Kooperationspartner und mögliche Fortbildungsveranstaltungen.",
            "Interview Questions": "Was war fasziniert an ihren Diplomarbeitsthema?\r\nWas reizt sich an unsere Forschung?"
        },
        {
            "date": "6 Oct 2015",
            "title": "Arzt Interview",
            "results": "Accepted Offer",
            "experience": "Positive Experience",
            "difficulties": "Easy Interview",
            "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Charité (Berlin) in Feb 2011",
            "Interview Descriptions": "I had several interviews. One of the interview was on the phone, very friendly. Then a second interview happened in the hospital where i was interviewed by several future colleagues. The chef-Arzt tested general questions on my speciality. I was presented by a fomer colleague of him which eased the process.",
            "Interview Questions": "General questions on my speciality"
        },
        {
            "date": "10 Dec 2009",
            "title": "Softwareentwickler Interview",
            "results": "No Offer",
            "experience": "Neutral\nExperience",
            "difficulties": "Average Interview",
            "Application Type": "I applied online. The process took 1 day. I interviewed at Charité (Berlin) in Aug 2007",
            "Interview Descriptions": "Online beworben, wurde zum persönlichen Vorstellungsgespräch eingeladen.\n\nNach ein paar Standardfragen über meine Erfahrung musste ich einen praktischen Test absolvieren, in dem ich mir (an einem Computer) ihren Quellcode ansehen und ein paar Fragen dazu beantworten musste.\n\nKomischerweise bestand die Quellcodedokumentation aus Worddokumenten und der Quellcode wurde nicht kompiliert.\n\nDie Frage lautete etwa: Was sagen Sie zu diesem Code?\n\nIch sagte: Er kompiliert nicht, die Antwort nach der sie suchten war, dass es nur ein 'Entwurf' sei und nach Möglichkeit 'richtig' gemacht werden solle.\n\nDanach fragten sie, ob ich an einem zweiten Gespräch interessiert sei und ich lehnte ab.",
            "Interview Questions": "Was würden Sie zu diesem Quellcode sagen?"
        }
    ]
]