[[{"date": "4 May 2022", "title": "Applied Behavior Analysis Assistant Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yakima Valley Farm Workers Clinic", "Interview Descriptions": "The interview at this company was long and informative. Overall, it was a great time for me to learn about what this job offers and what the work environment is like!", "Interview Questions": "Where do you see yourself in 3 to 5 years? "}, {"date": "3 Oct 2022", "title": "Registered Dietitian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Yakima Valley Farm Workers Clinic in May 2022", "Interview Descriptions": "At first the process happened quickly, I received an initial phone call confirming interest. A second phone call with two managers which went great. A virtual interview was then scheduled about a week later with several panels of people and lasting 6 hours (with breaks). It seemed to go well, however, despite two follow ups... I never received an offer or a decline. It was frustrating because I had given them so many hours of my time. I feel like they could at least replied to my emails.", "Interview Questions": "Tell me about a time you had a patient that was non compliant"}, {"date": "28 Apr 2021", "title": "Physician Assistant, PA-C Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yakima Valley Farm Workers Clinic", "Interview Descriptions": "Three separate interviews, two of the three being virtual/telephone.  The first to screen potential applicants, the second to be interviewed by the clinic supervisor, and the third in person with other providers to assess for compatibility.", "Interview Questions": "Why do you want to work with our organization? "}, {"date": "27 Apr 2021", "title": "Referral Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Yakima Valley Farm Workers Clinic", "Interview Descriptions": "I initially had phone interview followed by in-person with hiring manager. Standard interview questions. Then Hr contact me to offered position. The process took about  2weeks. Everyone is nice and faculty clean. Enjoy my work", "Interview Questions": "what are your strengths and weaknesses?"}, {"date": "26 Jul 2020", "title": "RN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Yakima Valley Farm Workers Clinic (Hermiston, OR)", "Interview Descriptions": "I was shown around the facilities and given information on job duties if hired. The interviewers were friendly and asked questions that would relate to duties, experience, and how I would handle situations. They also gave me a rundown on a typical day they experience so I would understand how broad and diverse the situations can be. They were very pleasant.", "Interview Questions": "How would I handle a phone call that sounded like an emergency but didn't speak the same language."}, {"date": "7 Apr 2020", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Yakima Valley Farm Workers Clinic (Yakima, WA) in Apr 2020", "Interview Descriptions": "Was really great really thorough and a lot of questions interview lasted one hour long the managers are really nice they explained thoroughly my job as a medical assistant at the clinic they really explain the fact that they work their medical assistance to the high-capacity of scope of practice", "Interview Questions": "\r\nIf I was ever exposed to any infections or contagious diseases and how I handled it?"}, {"date": "13 Sept 2019", "title": "Registered Dietitian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at Yakima Valley Farm Workers Clinic", "Interview Descriptions": "I completed a panel interview with the RDs at Yakima Valley Farm Workers Clinic. I was asked about my experiences and to walk through my resume. They had completed a very thorough review.", "Interview Questions": "Describe your motivational interviewing style."}, {"date": "14 May 2016", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Yakima Valley Farm Workers Clinic (Yakima, WA) in Apr 2016", "Interview Descriptions": "Phone  interview with five people. Scripted questions. Not much spontaneity. The interview was scheduled via an admin assistant. Felt like a cattle call. The interview itself lasted about 45 minutes. The panel members were courteous but it was clear that I was being interviewed with no chance of getting the position.", "Interview Questions": "What are your strengths for this position?"}, {"date": "28 Jun 2016", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Yakima Valley Farm Workers Clinic in Apr 2016", "Interview Descriptions": "Lengthy process involving multiple phone screens, one in-person interview, and a second interview via phone. Phone screens/interviews ranged from 1 hour to almost 2 hours. In person interview was ~1/2 a day. Questions (~20+) were asked were behavioral/situational and required answer via STAR method with a very specific example. YVFWC really means it when they say they work hard to find the right fit for the job.", "Interview Questions": "Some employees can be a gossip at work. Tell me about a time when you experienced a coworker who was gossiping about another, what was the situation, how did you handle it; please be specific?"}, {"date": "29 Feb 2016", "title": "Public Relations Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Yakima Valley Farm Workers Clinic (Salem, OR) in Feb 2016", "Interview Descriptions": "This was a panel interview with three managers, one via teleconferencing.\r\n\r\nThis was not a traditional job interview.  All the interview questions were based on the STAR format (Situation Task Action Result), where they expected to you provide specific examples of how you reacted in a job situation.  \r\n\r\nI think all of the questions were pulled from an HR manual or off the Internet. The interview process was stilted. One of the managers seemed annoyed when I asked a followup question about the job ’s responsibilities. \r\n\r\nI didn’t make it to the second round of interviews, which didn’t bother me a bit.", "Interview Questions": "Please tell me about a time that you supported a co-worker?\r\n\r\nPlease give us an example of a project that you led?\r\n\r\nPlease tell us about a time you had to adapt to a different culture?"}], [{"date": "20 Jan 2016", "title": "Clinical Systems Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Yakima Valley Farm Workers Clinic (Yakima, WA) in Dec 2015", "Interview Descriptions": "Brief phone interview then in person \"behavioral interview\" then follow up after reference checks. Behavior question was a lot of the give examples of a time when you had a communication issue and how did you deal with it? And how do you handle expectations and deadlines? How do you prioritize?", "Interview Questions": "What is one challenge you faced in your last position?"}, {"date": "4 Jan 2018", "title": "RN Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Yakima Valley Farm Workers Clinic (Pasco, WA) in Oct 2015", "Interview Descriptions": "I was interviewed by a panel of my peers that knew me, appreciated the quality of my work, and respected my opinions and work ethic. I went into the interview process  with extremely high employment reviews.  All jobs were more politically biased rather than respect, work ethic or even work experience.", "Interview Questions": "How would I handle a belligerent employee? "}]]