[[{"date": "11 May 2023", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Canadian Red Cross (Ottawa, ON)", "Interview Descriptions": "It was easy going process but was bit lengthy as there was video recorded interview round after that there was a screening and 2 more rounds of interview. Video recorded interview was basic just few questions about interest and why you want to work as business analyst and why Canada red cross.", "Interview Questions": "Talk about complex situation you faced in past."}, {"date": "10 May 2023", "title": "People Services Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Canadian Red Cross (Toronto, ON)", "Interview Descriptions": "Interview happened in April 2021. I found interviewer ( both ladies ) judged my skills based on career gap I had . Thankfully I got picked by another small organization who gave me a chance . I worked hard and As per my performance reviews have got promoted and got raise twice in 1 year.", "Interview Questions": "How can I prove I can help the team What challenging situations I handled well in past job"}, {"date": "7 Mar 2023", "title": "Site Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Canadian Red Cross", "Interview Descriptions": "HR screening was the first one followed by HR interview and then another interview was conducted by the Operations team. Later it took about a month to complete all the interviews and get the offer.", "Interview Questions": "Tell me about yourself and work experience that best suits this role"}, {"date": "18 Apr 2023", "title": "Technical Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Canadian Red Cross (Toronto, ON) in Mar 2023", "Interview Descriptions": "After the phone screening round, I was asked to work on an assignment. This was more of a web-content writing task and not at all related to Technical Writing. I wonder what the technical writing team actually does in this company!", "Interview Questions": "What do you know about red cross?"}, {"date": "7 Mar 2023", "title": "Volunteer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Canadian Red Cross (Vancouver, BC) in Mar 2023", "Interview Descriptions": "An HR representative scheduled a phone interview with me for a volunteer position. They did not call me during the agreed upon time. I sent a follow up email asking if the interview would take place but I never received a reply (it's been weeks). I feel like it is very unprofessional and disrespectful of their potential volunteer's time for them to not show up to an interview and not provide any explanation. Especially since volunteers are doing this on their free time and that Red Cross often posts calls for volunteers (which I will ignore from now on).", "Interview Questions": "There was no interview because they did not call me"}, {"date": "20 Dec 2022", "title": "ERT Responder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Canadian Red Cross", "Interview Descriptions": "It was a good interview. I did not expect that much easy questions and I thought I will not pass the interview, but I did it! Overall, it was so good, and I am so happy now to be a part of Canadian Red Cross", "Interview Questions": "What is your degree? Tell me about your background and your university degree"}, {"date": "25 Oct 2022", "title": "Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Canadian Red Cross", "Interview Descriptions": "Their interview gave me so many red flags. They were just cold and thought the purpose of an interview is to drill and belittle someone. I did not want to work with them and declined the offer. HR was strange.", "Interview Questions": "How do you deal with challenging people? How have you worked on your own."}, {"date": "5 Nov 2022", "title": "Customer Service Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Canadian Red Cross in Sept 2022", "Interview Descriptions": "A standard interview but turns out it was a pre-screen that took almost an hour. She called me back immediately to spew questions in French. She'd both forgotten to tell me it was a bilingual position (I'd applied for the other) and to ask me questions in French. Bizarre process spanning four months.", "Interview Questions": "Working in matrix environment, how to manage"}, {"date": "16 Sept 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Canadian Red Cross (Ottawa, ON) in Aug 2022", "Interview Descriptions": "First screening interview was on a phone call with an internal recruiter to verify basic qualifications. Second interview was with a hiring team online. Follow-up was very professional - Quick, in-line with the timeline described by the recruiter, and via phone which was appreciated.", "Interview Questions": "They asked to describe specific times dealing with change. "}], [{"date": "21 Jun 2022", "title": "Frontend Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Canadian Red Cross", "Interview Descriptions": "It was a technical interview. There are 4 people who interviewed me. The process is smooth and the interviewers are mostly technical staff related to JS and Powerapps. I was questioned mostly about Javascript and best practices.", "Interview Questions": "Describe Promises in JS?\r\nScope of a variable?\r\nSelector specificity"}, {"date": "13 Jun 2022", "title": "Emergency Management Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Canadian Red Cross in May 2022", "Interview Descriptions": "A 15-minute call from the hiring manager. They took a job describing how the job's gonna be and what they expect from volunteers. Mostly questions to see how available you are for the volunteer work.", "Interview Questions": "1. Tell me about yourself\r\n2. Why do you choose Red Cross?\r\n4. The rest is on your availability to volunteer. (time, schedule, transportations...)"}, {"date": "23 Apr 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Canadian Red Cross", "Interview Descriptions": "Their interview process is a complete waste of time.\r\n\r\nFirst you will do a screener interview with an HR person who is not smart enough to actually understand what you are saying about the role.  This drone is just looking at a keywords sheet.\r\n\r\nSecond: They will give you the dumbest assessment test where you have 1 hr to just complete some meaningless tasks in Excel. Look for Red Cross Data Analyst Game on Youtube and you will find the video I made showing how to beat it.\r\n\r\nThird: You will do a teams call with the useless HR person and the manager. This manager desperately tries to test you by asking incredibly dumb text book level questions. \r\n\r\nThe most annoying thing about this is I went through all these hoops and the role only  paid $63k a year. I already have a position that pays me over $10k more per year but I took the interview process just to see what it was going to be like. I never intended to accept the role.\r\n\r\nBut I didn't get the chance bc when they say \"we will be in touch next week\" that means you won't hear from the moron HR person bc she is too incompetent to know how to schedule a call in a calander.", "Interview Questions": "Why did you apply to Red Cross?\r\nWhat kinds of tools do you use?\r\nWhat is SQL?"}, {"date": "15 Aug 2022", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Canadian Red Cross (Ottawa, ON) in Mar 2022", "Interview Descriptions": "it was 1 call by phone, 1 by video, question it was different, like tell me about yourself, What are your strengths and weaknesses?\r\nafter when i reply to all question, they never contact me again, at least tell, i am not good for position.", "Interview Questions": "a lot of strange question"}, {"date": "29 Nov 2022", "title": "Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Canadian Red Cross (Montreal, QC) in Mar 2022", "Interview Descriptions": "During the first part of our interview process, we conduct an initial phone pre-interview as part of our standard interview process. A second interview is conducted by the manager following the first interview. A third type of offer, called a formal offer and a verification of the offer, is considered a formal offer.", "Interview Questions": "Relevant past experience resolving conflict withing team members."}, {"date": "15 Feb 2022", "title": "Animator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Canadian Red Cross (Ottawa, ON)", "Interview Descriptions": "Phone screening and interview, a 3-6 hour animation task requiring submission of the source files and project, and a 1-hour video interview. The whole process took about a month.\r\n\r\nAfter completing all of the above, I was ghosted and my follow-ups ignored. The mental affect this had while job hunting during the pandemic was beyond words: I was angry, hurt and I felt taken advantage of.\r\n\r\nThankfully, though, this is the only time I've experienced this in my career and I sure hope it is the last. For anyone else looking to work for the Canadian Red Cross - proceed with extreme caution.", "Interview Questions": "What are the pros and cons of editing with RAW footage?"}, {"date": "9 Feb 2022", "title": "Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Canadian Red Cross (Montreal, QC) in Feb 2022", "Interview Descriptions": "- 1st round of interview with HR (15mn phone call)\r\n- 2nd round of interview with hiring manager (1h zoom video call) \r\n- 2-3 references request. They were each asked to fill out a document with 15 long development questions.", "Interview Questions": "- Why do you want to work at the Canadian Red Cross? \r\n- Do you have experience working remotely, and what are the challenges you faced? \r\n- Do you know how this program started? \r\n- What do you know about the work of the Red Cross in Canada and abroad? \r\n- How is your experience related to this position? \r\n- Do you have any experience writing reports? \r\n- Tell me about a conflict you encountered in the workplace and how you solved it. \r\n- How would you react if you receive instructions that you disagree with? \r\n- Full COVID-19 vaccinations required "}, {"date": "5 Aug 2022", "title": "Practicum Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Canadian Red Cross (Toronto, ON) in Feb 2022", "Interview Descriptions": "It was very engaging and interactive. You get the sense of the employer being interested in knowing more about you and they embrace students willing to learn. As a student, it is a great organization to learn work skills necessary for the job market and to build your interpersonal skills as well", "Interview Questions": "Are you able to work with another student on a project?\r\nHave you ever experienced conflict working as a team and how did you resolve it?"}, {"date": "24 Jan 2022", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Canadian Red Cross", "Interview Descriptions": "Pre screening - phone call \r\nThe person who spoke from Red cross was very polite. \r\nThis was followed by a written test. The test was to do a funding proposal to secure funding for a project.\r\nI received a response saying they are not moving forward with my application", "Interview Questions": "Have you received First Aid Training ?"}, {"date": "20 Dec 2021", "title": "Public Health IMG Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Canadian Red Cross", "Interview Descriptions": "Contacted and scheduled for a phone interview, subsequently had a zoom interview...Both were very warm and highly professional. I was later informed to send some documents. I hope for the best having scaled the first two stages", "Interview Questions": "How would you handle stressful situation\n\nHow would you handle difficult situation"}], [{"date": "24 Dec 2021", "title": "Public Health Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Canadian Red Cross", "Interview Descriptions": "An hr interview very innovative . More focused on interpersonal skill which is the key to being successful at work. Some experiences related questions that might be useful in this position", "Interview Questions": "How do you manage conflicting opinion at work?"}, {"date": "1 Dec 2021", "title": "Communications Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Canadian Red Cross", "Interview Descriptions": "There was an initial call to sort out whether or not I would be a fit for the role. After this a scheduled Skype interview took place with a lot of situational questions and then they asked for references and the next day an offer was made.", "Interview Questions": "What do you know about CRC? \r\nWhat is your past experience working with NFP organizations? \r\n"}, {"date": "3 Nov 2021", "title": "Emergency Care Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Canadian Red Cross", "Interview Descriptions": "I was asked questions about why I was interested in the organization, what populations I had worked with in the past and about my interpersonal skills. They mainly wanted to know if I had experience working with vulnerable, elderly populations.", "Interview Questions": "Why are you interested in this organization"}, {"date": "28 Oct 2021", "title": "Gestionnaire de l'information Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Canadian Red Cross", "Interview Descriptions": "Entretien effectué par Zoom pendant le temps de covid et ça c'est très bien passé. Bel échange et les recruteurs portaient de l'attention à ce que le candidat leur disait.", "Interview Questions": "Je ne m'en souviens plus réellement. "}, {"date": "2 May 2022", "title": "Biomedical Equipment Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Canadian Red Cross (Calgary, AB) in Sept 2021", "Interview Descriptions": "Zoom video conference for about 15-30 minutes. Friendly and relaxed interview process. Asked about company, relevant experience, background and work experiences. Accommodations were made when required. Interviewer was understanding and made the experience stress-free.", "Interview Questions": "Why do want to work at red Cross?"}, {"date": "11 Jul 2022", "title": "Emergency Care Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Canadian Red Cross in Sept 2021", "Interview Descriptions": "Basic and easy questions. The person set a comfortable environment, she was very friendly. I got the position on the spot. They asked if I had experience with the elderly.", "Interview Questions": "what makes you a good candidate for this position?"}, {"date": "25 Aug 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Canadian Red Cross (Ottawa, ON)", "Interview Descriptions": "First an initial call with HR asking what experience you have for this role. \n\nSecondly, a panel interview with the directors of the department.\n\nFinally a written exercise to be completed in an hour.", "Interview Questions": "What do you understand about how this particular program/project works"}, {"date": "9 Aug 2021", "title": "Generalist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Canadian Red Cross", "Interview Descriptions": "very simple, they call you asking interview questions, you answer them, and that's that. you're now in the process to join them and chances are you passed the interview. you then complete the training given and now you get deployed.", "Interview Questions": "very simple stuff, literally google and it'll be there"}, {"date": "30 Aug 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Canadian Red Cross (Toronto, ON) in Aug 2021", "Interview Descriptions": "Streamlined overall process and well coordinated. It was an contractual opportunity for two years. benefits also provided for contractual position which is usually not the case at many organizations. Scenario based questions and ERP implementation experience", "Interview Questions": "Scenario based questions and ERP implementation experience."}, {"date": "8 Dec 2021", "title": "Case Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Canadian Red Cross (Ottawa, ON) in Aug 2021", "Interview Descriptions": "Was a very good interview made by the phone, it helped a lot to explain the position and the responsibilities of the position. It gave me more clarity of what to expect of the work done by the organization.", "Interview Questions": "Desirable salary, my past experiences etc"}], [{"date": "28 Oct 2021", "title": "Roster Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Canadian Red Cross in Jul 2021", "Interview Descriptions": "The interview process only took about 15 minutes. Questions included similar interview questions and information. For example, they described what the position is and then continued with the questioning. Such as, tell me more about yourself and tell me about a time you had done X / achieved X.", "Interview Questions": "What is your expectation of salary?"}, {"date": "31 May 2021", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Canadian Red Cross", "Interview Descriptions": "Fair, mostly behavioral and situational questions. Very focused on the your fit within the Red Cross work culture and how well you'll adapt to their matrix structure. The job itself involved interacting with multiple stakeholders and volunteer management, so it edged on the side of relevant experience doing the aforementioned.", "Interview Questions": "Ex. What is your ideal supervision/management style? "}, {"date": "4 Jun 2021", "title": "Communications Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Canadian Red Cross (Victoria, BC) in May 2021", "Interview Descriptions": "The job posting didn't say it required a cover letter, but the HR person emailed after I applied to inform me I didn't attach one to my application and asked me to email it to her. Then she sent an email asking me what my availability was like for the rest of the week for follow up activities. She only called me during times where I had indicated that I was not available. In one instance, the left me four messages to call her on a day that I had clearly told her I wouldn't be available. It felt like harassment. She wanted to schedule an interview the following day (also at a time when I had told her I wasn't available). She lectured me about how difficult it was to mange the panel participants schedules and said it would be difficult to find another time. I told her I was sorry, but I was getting my COVID vaccine the next day and couldn't do the interview at that time. She asked what the exact time of my appointment was and asked why I couldn't just do the interview as soon as it was done. Needless to say, they made a terrible first impression for her organization; I didn't even want to go through with the process after that.", "Interview Questions": " Why can't you just do the interview right after your vaccine appointment is done?"}, {"date": "24 Sept 2021", "title": "Human Resource Assistant Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 weeks. I interviewed at Canadian Red Cross in May 2021", "Interview Descriptions": "It was a good interview. I had answered all questions. I took about 30 minutes and i had enough time to answer the questions asked. Most questions are standardized questions.", "Interview Questions": "What makes you fit for the job"}, {"date": "2 Apr 2021", "title": "Emergency Support Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Canadian Red Cross", "Interview Descriptions": "It was a good interview. It was over the phone about 30 mins interview. They asked lot of questions regarding my previous jobs and my skills. overall the interview was very good experience.", "Interview Questions": "Why do you want to work here?\r\nWhat value do you bring?"}, {"date": "16 Jan 2021", "title": "Emergency Response Team Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Canadian Red Cross (Winnipeg, MB) in Jan 2021", "Interview Descriptions": "It was a phone call interview. It was more like a discussion session than interview. It was extremely easy. The interviewer was super friendly and supportive. In overall, I think it's easy to pass the interview.", "Interview Questions": "What would you do in a stressful situation?"}, {"date": "9 Jan 2022", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Canadian Red Cross (Halifax, NS) in Jan 2021", "Interview Descriptions": "Straight forward, \nAsked about knowledge of programs, clinical experience, what I would be able to bring to the team, communication style, ability to work within a team, willingness to travel, ability to work remote, experience with virtual platforms, status of vaccination.", "Interview Questions": "N/A"}, {"date": "16 Jan 2021", "title": "Occupational Health and Safety Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Canadian Red Cross (Toronto, ON) in Jan 2021", "Interview Descriptions": "Received my First interview , it was a phone call from what seemed to be and HR rep. She was very kind and friendly, told me I would recieve a call in 2-3 business days to schedule the bext aet of interviews or not. Its been 3 days I have no received any form of contact.", "Interview Questions": "Have you ever made policies? "}, {"date": "10 Jan 2021", "title": "Public Health Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Canadian Red Cross (Vancouver, BC) in Dec 2020", "Interview Descriptions": "2 interviews\r\nOne by HR, \r\nnext, hiring manager\r\nThe interview was on Sunday, very easy, questions from resume and red Cross website\r\nExperience of previous red Cross. \r\nTold about a workshop I attended on disaster management in Saudia", "Interview Questions": "Your experience\r\nWhat you know about red Cross \r\nAny red Cross previous experience \r\nVirtual training or teaching experience "}, {"date": "12 Jan 2021", "title": "Assistant, People Services Field Operation Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Canadian Red Cross (Calgary, AB) in Nov 2020", "Interview Descriptions": "I applied via Red Cross Canada website and received an email to schedule a phone interview. When I replied to the email I received an out of office email back, I received an email confirmation the following week for the call. When the day came for the call, the contact called me to explain they needed to reschedule- which I was find with- all things considered with a global pandemic- the call was rescheduled to a few days later. The phone interview conducted exactly the same questions as the online application, with nothing in addition- begs the question why phone screen someone you won't gain any additional info on? Finally, the call was closed and I did not receive any other communication until about 3 weeks later where I received a generic email indicating they were still interested in my profile. I have received this email twice now as it has been nearly 2 months since the screening call.", "Interview Questions": "Are you able to work flexible hours and be involved in field work? How much notice would you require prior to deploying for field work? How would you create a collaborative environment? What would you actually do to facilitate collaboration? "}], [{"date": "29 Sept 2022", "title": "Emergency Management Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Canadian Red Cross (Ottawa, ON) in Sept 2020", "Interview Descriptions": "It was an online application with a follow-up interview done by phone. The interview was relatively easy and there were around 5-7 questions. I also had to do online courses that further taught and explained the position.", "Interview Questions": "Talk about a difficult time in your life and how you handled it. "}, {"date": "30 Jun 2020", "title": "Senior Manager, Planning Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Canadian Red Cross", "Interview Descriptions": "Two rounds of interviews. Initial behavioural interview, and second round assignment/ presentation. The process took approximately 4 weeks plus wait time. Interviewed with directors and VPs. The people were really nice!", "Interview Questions": "Tell me about yourself and your qualifications"}, {"date": "24 Jun 2021", "title": "Emergency Responder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Canadian Red Cross in Mar 2020", "Interview Descriptions": "One interview with straight forward questions regarding working with others, previous work experience and working under pressure.  Long on boarding process with multiple online courses required before beginning.", "Interview Questions": "How do you handle stressful situations?"}, {"date": "5 Apr 2022", "title": "PDA Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Canadian Red Cross (Ottawa, ON) in Feb 2020", "Interview Descriptions": "straight forward, basic questions  and more explanation as to what the role entails. \r\nprior to the pandemic, there was a tour of the office and there is a lot of support", "Interview Questions": "tell me about your self "}, {"date": "21 Jan 2021", "title": "Private Sector Engagement Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Canadian Red Cross (Toronto, ON) in Oct 2019", "Interview Descriptions": "The process was conducted in a very professional manner. The hiring team met all promised deadlines and I received a call informing that I did not get selected (which is very rare among non-profits).", "Interview Questions": "Name 3 businesses that you would reach out to and why?"}, {"date": "27 Oct 2019", "title": "Commis aux comptes payables Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Canadian Red Cross (Montreal, QC) in Jul 2019", "Interview Descriptions": "faite avec une agence de placement,\r\nj'ai postulé pour l'offr, l'agence m'a contacté on a fais une premiere entrevue telephonique, le lendemain une entrevue via skype puis on m'a proposé l'offre.\r\nla firme a longtemps pas repondu aux recruteurs a cause de quelques difficultés dont je n'ai  aucune infos. puis 3 semaines plus tard on m'a rappelé pour connaitre ma disponibilité pour debuter le lendemain.", "Interview Questions": "parlez moi de vous"}, {"date": "27 May 2019", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Canadian Red Cross (Calgary, AB)", "Interview Descriptions": "I received an email asking to complete a pre-screening questionnaire. After sending my questionnaire I received an email 2 days later to set up a time for a phone call interview.", "Interview Questions": "Tell me a time you had a conflict with a coworker"}, {"date": "7 May 2020", "title": "Client Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Canadian Red Cross (Vancouver, BC) in Apr 2019", "Interview Descriptions": "Applied online through school website, received emails for interview within a few days, was hired a few days after interview. Interview was 2 people, my direct supervisor and their supervisor. They asked mostly general questions about my skills but you need to know a lot about the Red Cross and it's principles.", "Interview Questions": "What is the most important thing you value at the workplace."}, {"date": "13 Apr 2019", "title": "Laboratory Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Canadian Red Cross (Brampton, ON) in Apr 2019", "Interview Descriptions": "It took 4 week to complete process with 2 interviews .one was telephonic interview n second was with two people in person .\r\nOverall experience was positive . Telephonic interview was mostly pre screening questions and previous work duties.Second interview around 30-45 min with 2 people . Mostly work related questions.", "Interview Questions": "Why you want to work with Canadian Red Cross?"}, {"date": "24 Aug 2018", "title": "Business Systems Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Canadian Red Cross", "Interview Descriptions": "I was asked to complete a sort of questions related to my work experience and reasons why I want to apply for the position. Then after a week, I was asked for an interview in person.", "Interview Questions": "How to do data cleaning?"}], [{"date": "7 Mar 2020", "title": "CPR Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Canadian Red Cross (Hamilton, ON) in Apr 2018", "Interview Descriptions": "Went well, great!  Thorough and updated with knowledge of latest changes within the Red Cross First Aid Program.   I was appreciative of the update knowledge and how this will occur within the Red Cross.", "Interview Questions": "How long have you work in teaching cpr?  What does the Red Cross stand for?"}, {"date": "18 Feb 2018", "title": "Intake Assistant Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Canadian Red Cross (Burnaby, BC) in Oct 2017", "Interview Descriptions": "First I had a Prescreen interview. After, I had a personal one. It was a Panel with 2 people that ask me questions about my self and behavior questions at work.", "Interview Questions": "How do you make a judgment in work environment? Give us an example."}, {"date": "16 Sept 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Canadian Red Cross (Vancouver, BC)", "Interview Descriptions": "The interview questions were simple and basic. I applied online, and I received an email for an in-person interview. The interview process took about half an hour. The interviewer was friendly. I got a positive experience.", "Interview Questions": "What is your biggest strength."}, {"date": "4 May 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Canadian Red Cross", "Interview Descriptions": "Applied online, received phone call for interview within a few weeks, was hired a few days after interview. Interview was 2 people, my direct supervisor and their supervisor. They asked mostly general questions about my skills but you need to know a lot about the Red Cross and it's principles (i.e. humanitarianism, neutrality, impartiality, etc.) so make sure you have these memorized and can explain them and how you will uphold them etc", "Interview Questions": "Basic questions about how my skills and experience related to the job posting, how I identified with Red Cross 7 principles"}, {"date": "10 Apr 2017", "title": "Outreach Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Canadian Red Cross", "Interview Descriptions": "I applied online. I received an email a few days later to set up a phone interview the next week (the position I applied for was located in a different province). The email also contained some pre-interview questions. My interview took place over the phone - I was on a conference call with two managers. It lasted approximately half-an-hour. I received an email about 10 days later with the outcome.", "Interview Questions": "Have you ever had to resolve a conflict in the workplace and how did you do so?"}, {"date": "15 Aug 2018", "title": "Community Services Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Canadian Red Cross (Durham, ON) in Jul 2016", "Interview Descriptions": "After applying for the position I was contacted to completed a two sided page of prescreen questions, mostly on eligibility to work in the country, availability etc. I was then contacted for an in person interview that took around 45 minutes (verbal questions only no computer testing) conducted by two staff members who I would be reporting to in the role.", "Interview Questions": "What style management do you prefer? "}, {"date": "12 May 2016", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Canadian Red Cross (Ottawa, ON) in Feb 2016", "Interview Descriptions": "There was a telephone interview first, followed by face-face interview with a panel of 4. Emails were exchanged agreeing to the date and time.  After the interview, I received a call from the HR asking for a convenient time to speak with the sectional head requesting staff.  We spoke within the week and I got explanation on why I was not chosen and an advise to keep in touch. I was satisfied with the process.", "Interview Questions": "Why do you want to work for CRC?"}, {"date": "11 Jun 2015", "title": "Outreach Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Canadian Red Cross (Saskatoon, SK) in Feb 2015", "Interview Descriptions": "Met with senior staff of CRC-was a smooth and professional interview.  I called one of the senior staff about the job-had an interview in just 4 days.  Was told they would need 4-5 weeks to narrow search down, was called the very day after my interview and offered the job.", "Interview Questions": "How would you deal with trauma situations?"}, {"date": "9 Jun 2014", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Canadian Red Cross", "Interview Descriptions": "Very unorganized. Date of interview kept being pushed back, and my papers confirming employment were also delayed. Interview was very fair, it was a very holistic kind of hiring process, and they asked a lot of questions that would give the employers an impression of my character, my integrity, my personality, and my overall suitability for work with the Red Cross.", "Interview Questions": "Tell us what you know about Red Cross community projects in your community."}, {"date": "18 Sept 2015", "title": "CSW Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Canadian Red Cross (Cornwall, ON) in Jul 2013", "Interview Descriptions": "I was nervous for the interview, but the supervisor who gave me my interview Kim, made me feel comfortable and at ease with everything. I was able to tell her how much i don't like interviews how sometimes you can feel stupid with answering certain questions", "Interview Questions": "What would i do if a client was being difficult to work with"}], [{"date": "3 Aug 2015", "title": "Technician/Client Services Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Canadian Red Cross (Edmonton, AB) in Nov 2012", "Interview Descriptions": "Well, first I got a interview by phone, then I waited at least 3 months before they called me back, (after I had called a few times within the 3 months I did not get called,)\r\nWith excuses on how they are looking up some things, before giving me a yes.\r\nMeantime, I needed a job, and sent out my resumes, I got a few calls and a better paying prospect.\r\nWhen red cross called me was seconds before the other job called.\r\nSo I took it not knowing that the hiring process, and how long it took should have been my reason for NOT taking the job (hind site). I went in for a full interview AFTER, waiting months.And this interview, the ladies were changing and adding things onto my job description.\r\nNot that some of it was bad, but now they making me do more, for my less wage, and not to mention that not full 40 hour week. Is only 35. hour week paying job, with other things that I had to NOW pay for after 2 yrs, 10 months working there and having Free downtown parking.. They now approached us an said we now have pay for our work parking. 119.00 taken off my pay.  \r\nStress of the job began even on the first interview on my hire date.", "Interview Questions": "Why did I choose the C.R.C"}, {"date": "31 Dec 2015", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Canadian Red Cross (Ottawa, ON) in Jun 2011", "Interview Descriptions": "Multiple interviews, phone interview, initial HR interview and then follow up with new manger for final screening. International Operations has high staff turnover in certain areas as well as due to overseas postings and deployments so common to have multiple interviews to meet with various staff throughout the hiring process.", "Interview Questions": "Why do you want to work for us?"}, {"date": "30 Aug 2015", "title": "Human Resources Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Canadian Red Cross (Mississauga, ON) in Feb 2011", "Interview Descriptions": "I had a telephone interview first, then was scheduled for a face-to-face interview. I was interviewed by a panel of 3 people. After the interview I provided my references, who were contacted quite quickly. I had to complete a criminal background check before the conditions were removed from my offer.", "Interview Questions": "N/A"}, {"date": "17 Nov 2015", "title": "Help Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Canadian Red Cross (Port Hope, ON) in Jan 2011", "Interview Descriptions": "I learned much about needs not only in my province but in a World wide capacity. Giving BACK is so important and encourages others to do the same...very rewarding\r\n\r\nMy co-workers were mostly volunteers, but I did appreciate my supervisor and manager;as they helped with guidance and mentoring at times, but were not pro-active in my day-to-day job, with the exception of making critism.\r\n\r\nThe most difficult part of the job was actually finding the 'balance' between work and personal time. Although we were paid a decent salary and had really excellent benefit package, the additional time put into the job on extra activities such as meetings, fund raisers and in times of crisis... make it difficult to find balance at t imes. Also I found the political climate of the Organization fraught with negativity. Personalities should NOT come into play, particularly with this type of non-for-profit organization.\r\n\r\nThe most enjoyable part of my job with the Red Cross was helping others and relating to families in crisis, plus working with wonderful volunteers!", "Interview Questions": "Can I solve problems"}]]