[[{"date": "15 Mar 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Arkansas at Little Rock (Little Rock, AR) in Jan 2023", "Interview Descriptions": "Ask several question after self-introduction and introduce some research questions, it’s a good experience to talk with them, don’t be nervous, not hard, easy pass, nothing else to tell, let me pass", "Interview Questions": "What is your research about?"}, {"date": "3 Aug 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Arkansas at Little Rock", "Interview Descriptions": "Multiple levels; faculty; staff; upper admin. zoom, then in person, 60 minutes per level, All in all a streamlined typical interview process. Nice to know about the programs and the structure prior to the interview.", "Interview Questions": "Strengths, weaknesses, desire for mobility, education outlook"}, {"date": "27 Oct 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Arkansas at Little Rock in Apr 2022", "Interview Descriptions": "The interview process was straightforward. However, some faculty members failed to show up for their scheduled meetings, and one faculty member fell asleep during the job talk. I should probably accept some responsibility for that though.", "Interview Questions": "I gave a job talk and taught a class."}, {"date": "24 Jan 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Arkansas at Little Rock in Nov 2021", "Interview Descriptions": "Received an email asking for my references. About almost an month later I did phone call interview with the department supervisor. Then a zoom interview with the supervisor and director. Got offered the job about a week later.", "Interview Questions": "What are some of your strengths and weaknesses? What customer service experience do you have? What clerical experience do you have? "}, {"date": "12 May 2021", "title": "Donaghey Scholar, Class of 2024 Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Arkansas at Little Rock (Little Rock, AR) in Feb 2021", "Interview Descriptions": "It was a very smooth, conversational process. I really enjoyed how it was something casual, which made me feel very comfortable, forgetting that it was an interview for a full-tuition scholarship.", "Interview Questions": "Questions like personal interests, future endeavors, and research opportunities were asked. "}, {"date": "6 Jan 2021", "title": "Teaching Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Arkansas at Little Rock", "Interview Descriptions": "A great job title typically includes a general term, level of experience and any special requirements. The general term will optimize your job title to show up in a general search for jobs of the same nature. The level of experience will help you attract the most qualified applicants by outlining the amount of responsibility and prior knowledge required. And if your position is specialized, consider including the specialization in the job title as well. But avoid using internal titles, abbreviations or acronyms to make sure people understand what your job posting is before clicking.", "Interview Questions": "what is your plan for 4 years?"}, {"date": "29 Jul 2019", "title": "Contract Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Arkansas at Little Rock (Little Rock, AR) in Jul 2019", "Interview Descriptions": "Very laid back and relaxed, and although 2 of the interviewees were remote, they made me feel welcome and spoke to me as if they were in the same room.", "Interview Questions": "Name a time when you broke a rule, why you broke the rule, and how you fixed the situation."}, {"date": "3 Mar 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at University of Arkansas at Little Rock in Mar 2019", "Interview Descriptions": "Pretty easy and helpful. really supportive and always ready to help students\r\nHad some technical questions and behavioral questions\r\nIt was a 2-month internship and we learned a lot. The university i s pretty clean and have arelly awesome environment for students to learn", "Interview Questions": "Technical such as python , databses"}, {"date": "21 May 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Arkansas at Little Rock", "Interview Descriptions": "It was short and simple. The only con was how long it took for them to respond to applications. After being interview I heard back within one week on if I was selected to be hired. I spoke with 3 rounds of people. Overall the interview lasted about 1 hour.", "Interview Questions": "What is you biggest success and failure?"}, {"date": "25 Jun 2018", "title": "Parent Educator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Arkansas at Little Rock in May 2018", "Interview Descriptions": "Phone call after applying on website and uploading 5 documents including a writing sample. After the phone call I was in progress status for 5 weeks. The position was filled but they forgot to update my status.", "Interview Questions": "Are you willing to travel in-state with some overnight stays?"}], [{"date": "18 Apr 2017", "title": "Director of Student Services Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Arkansas at Little Rock (Little Rock, AR)", "Interview Descriptions": "The application process is completed through PeopleSoft Admin. You receive an email notification requesting interview to be scheduled soon. You don't see or speak to an actual person until the interview.", "Interview Questions": "Why am I interested in the position and what experience did I have related to the position."}, {"date": "28 Jun 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Arkansas at Little Rock (Little Rock, AR) in Jul 2016", "Interview Descriptions": "Questions dealt with what I would do in various customer service situations, mostly.  They were very friendly and understanding of my level of experience. You should prepare for the interview with resources on their website.", "Interview Questions": "What would you do if a customer was upset?"}, {"date": "20 May 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Arkansas at Little Rock", "Interview Descriptions": "There was no interview. They took my all information and screened all with their committee. Then they confirmed me after 1 month. Although I was hired but the process is tedious. Specially not all gets the opportunity as a teaching assistant in masters degree.", "Interview Questions": "They did not ask me any question. However the GRE score and the Statement of Purpose was important"}, {"date": "11 Oct 2017", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Arkansas at Little Rock (Little Rock, AR) in Apr 2016", "Interview Descriptions": "It was fairly easy. Started with a phone interview with a few of the faculty. Then they invited me to an on campus interview. They offered me the position that day.", "Interview Questions": "What my qualifications were for the current role? "}, {"date": "22 Aug 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Arkansas at Little Rock in Apr 2016", "Interview Descriptions": "I got the call for the interview to set up a time and date. It was a group/panel and they each took turns asking questions. I was given an opportunity to ask questions.", "Interview Questions": "Tell me about yourself, what should we hire you, tell me about a time when you had a difficult customer, what are your strengths and what are your weaknesses, etc ..."}, {"date": "17 Mar 2016", "title": "Accounts Payable Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Arkansas at Little Rock", "Interview Descriptions": "it was ok.  did a phone interview and then in person . then a made me an offer 2 weeks later.  asked me about accounting transactions.  did a back ground check, etc.", "Interview Questions": "asked me about accounting transactions"}, {"date": "21 Nov 2017", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Arkansas at Little Rock (Little Rock, AR) in Mar 2015", "Interview Descriptions": "A series of individual and group interviews. You will be questioned by a panel of current employees, and then observed during group activities.  You are graded on the spot and if you make it through those processes you will be given an offer.", "Interview Questions": "What are your strengthens and weaknesses? How will you work on your weaknesses? "}, {"date": "6 Jan 2015", "title": "Adrmission Recruiter/Educational Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Arkansas at Little Rock", "Interview Descriptions": "The first step was the completion of the UALR online application process, \r\nAfter review I was contacted by the assistant for an interview with the Program Associate Director, \r\nAfter 2/3 days, I was contacted by the Associate Director and asked to come in to meet the Program Director, \r\nAfter meeting with the Progam Director, they checked my background/references and later extended me an offer of employment.", "Interview Questions": "What will my strategy be in developing a recruitment plan for prospective students."}, {"date": "24 Oct 2016", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Arkansas at Little Rock (Little Rock, AR) in Aug 2014", "Interview Descriptions": "Follow the online application process step by step to get your application accepted and then come to the campus earlier than expected and meet with the proffessors if you can get some appointments with them and meet them on time to explain your areas of interest for the research.", "Interview Questions": "N/A"}, {"date": "13 Jun 2014", "title": "Counselor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of Arkansas at Little Rock", "Interview Descriptions": "Panel interview with everyone in the office (it was a small office) and asked all the \"normal\" interview questions. Whole process took about forty minutes. I received the offer within about a week. Quite easy and nice people.", "Interview Questions": "If you could live by the ocean, lake, or river, which would you pick and why?"}], [{"date": "21 Dec 2013", "title": "Visiting Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at University of Arkansas at Little Rock in Oct 2013", "Interview Descriptions": "They interview initially at the FMA conference and then shortlist the candidates for campus visits. They usually have a one and a half day campus vist and let you know of the decision within a  week's time", "Interview Questions": "What will your reaction be if a student abruptly disrupts you in class"}, {"date": "24 Jul 2015", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at University of Arkansas at Little Rock (Little Rock, AR) in Jun 2013", "Interview Descriptions": "It was a formal interview with the program director who asked typical questions about my education, background, and pedagogy. It was a positive experience that focused on strategies for aiding student development, technology requirements, motivation for teaching and learning, and university and department policies and procedures.", "Interview Questions": "What is your teaching philosophy?"}, {"date": "29 Nov 2016", "title": "Project/Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Arkansas at Little Rock (Little Rock, AR) in May 2012", "Interview Descriptions": "I just went in the room with Supervisor of Systems/Network group at the time, and was just asked questions about my skills.  It was only about 30 minutes.  You need to have experience setting up servers, installing operating systems (Windows and RHEL Enterprise Linux), setting up RAID, installing virus protection.  You have to spec out server/computer purchases for departments on campus, and do paperwork required for purchases on campus.  Unlock user accounts or set up user accounts.  Helpful to know PERL language.", "Interview Questions": "Have you ever done Windows Server Administration and worked with Active Directory? Have you ever set up servers?  What types of servers?  Set up RAID on servers?  Do you know any scripting languages?  Do you have experience with Exchange Server/Email Servers?"}, {"date": "6 Aug 2015", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Arkansas at Little Rock (Little Rock, AR) in Jul 2011", "Interview Descriptions": "Very simple and professional questions were asked in the ability to perform services. Meet with the coordinator whom was very friendly and to the point on how things will work and what is to be done .", "Interview Questions": "How much experience do you have?"}, {"date": "26 May 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Arkansas at Little Rock (Little Rock, AR) in Dec 2010", "Interview Descriptions": "I was invited for two interviews within the span of 1 week.  I was provided with easy to follow instructions.  Two of the interviewers were very enthusiastic and engaging.  One interviewer looked bored the entire time, but I learned later that he was just a person who gave off negative body language routinely.", "Interview Questions": "Describe an instance of failure in your work life and how you handled it."}, {"date": "20 Apr 2012", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Arkansas at Little Rock (Little Rock, AR) in Aug 2010", "Interview Descriptions": "sat and talked with senior level management, was already well known so it wasnt awkward", "Interview Questions": "do you party a lot, or go out all the time"}, {"date": "18 Jun 2013", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Arkansas at Little Rock (Little Rock, AR) in Sept 2009", "Interview Descriptions": "Hiring process is easy and can be completed online if you have the eligible requirements. If you are not, some exceptions can be made such as waiving TOEFL requirement for foreigners if you are willing to complete the IELP, intensive English language program.", "Interview Questions": "N/A"}, {"date": "18 Jun 2012", "title": "Project/Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at University of Arkansas at Little Rock (Little Rock, AR) in May 2008", "Interview Descriptions": "applied through mail, and called for interview", "Interview Questions": "N/A"}]]