[[{"date": "13 Jul 2023", "title": "Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at British Columbia Institute of Technology (Burnaby, BC)", "Interview Descriptions": "Odd interview process. The hiring team did not set up an initial screening call, they just invited me in for an in-person interview right away. In hindsight, I regret not asking to hear more about the position before going in for the interview. A bit of an awkward process as the people interviewing me took turns reading questions off a sheet. They jumped right into asking very specific questions before asking more broad questions about my background. Overall an awkward process.", "Interview Questions": "Give an example where you showed leadership and initiative."}, {"date": "3 Mar 2023", "title": "QA Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Columbia Institute of Technology in Feb 2023", "Interview Descriptions": "Interview took 1, 5 hours. 30 min for test automation task, 1 hour for an interview. 5 interviewers, they ask mostly technical questions. Many theoretical questions. Very polite and professional. Overall have a good impression.", "Interview Questions": "They ask mostly technical questions"}, {"date": "15 Mar 2023", "title": "Software QA Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Columbia Institute of Technology in Feb 2023", "Interview Descriptions": "skills test: about login page both test case and automation design, it took 1h then in person interview: one manager, one Dev, one QA leader, it took 30 minutes, many are basic testing knowledge", "Interview Questions": "testing knowledge, automation skills previous experience"}, {"date": "18 May 2023", "title": "Junior Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at British Columbia Institute of Technology (Burnaby, BC) in Jan 2023", "Interview Descriptions": "very good. they ask you to go and seat and bring water and then they start asking questions like how are you what is your name blah blah. then they will continue with their interview until you are done", "Interview Questions": "what is your availability if we hire you?"}, {"date": "28 Dec 2022", "title": "Assistant Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Columbia Institute of Technology (Vancouver, BC) in Nov 2022", "Interview Descriptions": "5 people attended the interview. Only one of them was friendly. Others were suspicious and focused to make the interviewee uncomfortable. Total of 11 questions were asked. one of them was technical, others were behavioral.", "Interview Questions": "What would be your reaction if a student does not listen to you?"}, {"date": "16 Oct 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Columbia Institute of Technology (Burnaby, BC) in Oct 2022", "Interview Descriptions": "It was in person and it didnt have any stress for me. That was friendly and good. I try to be more confident and describle how my experience can help the company", "Interview Questions": "Say some example that shows your experience help this position"}, {"date": "4 May 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at British Columbia Institute of Technology", "Interview Descriptions": "Telephonic recruiter resume review and screening call,\r\nTake home assignment related to PM activity,\r\nStrategy presentation on part of the role,\r\nPanel Interview (6 people) leading to round of executive interview and reference checks", "Interview Questions": "Interview circled around PM setting up program, roadmap, reporting, change management etc."}, {"date": "24 Apr 2022", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Columbia Institute of Technology", "Interview Descriptions": "Screening call with HR was off putting, with repeated questions about salary and relocation details during a single conversation. Disappointed that there wasn’t more transparency about salary ranges for non-union positions.", "Interview Questions": "What interests you about the role?"}, {"date": "22 Feb 2022", "title": "Faculty Member Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Columbia Institute of Technology (Burnaby, BC) in Dec 2021", "Interview Descriptions": "Questions were not reliable or measurable. Borderline unethical at times. Questions could not be asked of both internal and external candidates. Questions and flow were clearly related to past conversations and experiences", "Interview Questions": "Who is the best faculty?"}, {"date": "7 Apr 2021", "title": "Senior Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Columbia Institute of Technology (Vancouver, BC) in Feb 2021", "Interview Descriptions": "Panel of 7 members on zoom . Asked question to be answered using Star schema including examples for each.  I never heard back. So I didn’t get hired. Questions were behavioral and technical in nature.", "Interview Questions": "Technical questions about the technologies they use"}], [{"date": "11 Mar 2023", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at British Columbia Institute of Technology in Apr 2020", "Interview Descriptions": "You need to prepare a min 10 mins lesson, then the panel will ask you questions related to the presentation. Also, they will ask you questions related to your management of the classroom and flipped education.", "Interview Questions": "describe how you handle a situation with a student who is causing issues."}, {"date": "30 May 2019", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at British Columbia Institute of Technology", "Interview Descriptions": "They have a recruitment agency does their first and second screening.  The interview was pretty straightforward. Recruiters were polite in general.  So no matter you apply through BCIT directly or not, the agency will be contact you if they are interested.", "Interview Questions": "Many questions about your previous job and experiences"}, {"date": "8 Mar 2019", "title": "Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at British Columbia Institute of Technology", "Interview Descriptions": "well, I didn't get interviewed as much as I just applied for the program I was interested in and got accepted. Looking back it was the right decision to make.", "Interview Questions": "Why did you apply here"}, {"date": "17 Jul 2023", "title": "Instructor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at British Columbia Institute of Technology (Burns Lake, BC) in Mar 2019", "Interview Descriptions": "The interview process in school of business has to be the most stressful and not very transparent. You are never told before about the number of people that will interview you. There can be 6 to 8 people and you are never communicated!!!!! Further, these are all full time faculty members and they have a clear bias towards their own staff who are interviewing for the same position as part time staff If you don't know full time faculty, don't bother. You will not be hired. Very opaque way of doing things. DISGUSTING.", "Interview Questions": "Tell me about your 5 years plan ..... redundant!!"}, {"date": "1 Mar 2020", "title": "Help Desk Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at British Columbia Institute of Technology (Vancouver, BC) in Jan 2019", "Interview Descriptions": "Round table process with 6 or so current employees, as well as the helpdesk manager. Will ask a bunch of personal questions that are generally quite easy as long as you're honest, and a few simple technical questions.", "Interview Questions": "Showed an artifact and asked what it was."}, {"date": "24 Oct 2020", "title": "Graduate Student Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at British Columbia Institute of Technology (Burnaby, BC) in Jan 2018", "Interview Descriptions": "they asked  me to give an introduction about myself. then they asked questions about my experiences and and skills. some questions about my strengths and gave  me time to ask questions.", "Interview Questions": "describe one problem that you were facing with and could solve it."}], [{"date": "19 Jul 2013", "title": "Administration Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at British Columbia Institute of Technology", "Interview Descriptions": "Application process is online; there are testing requirements; multiple interviews are a possibility", "Interview Questions": "How do you resolve workplace conflicts."}, {"date": "11 Jul 2012", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at British Columbia Institute of Technology (Burnaby, BC) in Apr 2011", "Interview Descriptions": "*On line applications and resumes only are accepted by BCIT \r\n*Only those selected for a interview are contacted\r\n*A small panel of 5 meet with candidate\r\n*The interview consists of primarility information gathering and behaviour based questions\r\n* Only the potential candidate will be contacted by phone with the request for references and the possibility of a second interview.\r\n(Advice: research the School, Department and any outside agencies associated with the position)", "Interview Questions": "Specific details about the processes involved with the position."}]]