[[{"date": "27 Jan 2023", "title": "Help Desk Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Peak Vista Community Health Centers (Colorado Springs, CO) in Nov 2022", "Interview Descriptions": "Initial phone screening from HR and then a panel interview from IT. The second I walked into this interview I knew I wasn't going to be selected. One of the members of the team just stared at me and didn't say a word nor did they get up from their chair. They didn't shake my hand and they stayed distant, which I respected because of potential COVID concerns. Their questions were repetitious and didn't really indicate that they were interested in getting to know the candidate. The interview was hard for me to stay engaged in as I saw one of the members of the panel whispering to the member to their side. That same person was writing things on their paper and showing their colleague in a \"discreet\" way but when I caught them, they gave me a caught-in-the-act side-eye look. \r\n\r\nOne of the panel members' personal phone also rang during this interview. They didn't take this seriously at all. I made the effort to come in through bad weather, too. They were all clearly burned out and they brought that energy in with them, not even hiding it. I will never apply for a position with this team again. This was genuinely the worst interview I've had since I was a teenager.", "Interview Questions": "Many questions based on communication and how one would communicate in different scenarios."}, {"date": "2 Jun 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Peak Vista Community Health Centers (Colorado Springs, CO) in May 2021", "Interview Descriptions": "A quick, less than 15 minute initial phone interview followed by an in person panel interview with one Nurse Practitioner (FNP) , the recruiter who made the initial phone call and department head of the clinic.", "Interview Questions": "Where do you see yourself in three years?"}, {"date": "28 Oct 2019", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Peak Vista Community Health Centers (Colorado Springs, CO) in Oct 2019", "Interview Descriptions": "Interviewed by two individuals at the same time. They said they usually interview several applicants at once. They asked if I would be open to the idea of working at another peak vista facility in the city,  not just the one posted.", "Interview Questions": "Why do you want to work for peak vista?"}, {"date": "20 May 2018", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Peak Vista Community Health Centers (Colorado Springs, CO) in May 2018", "Interview Descriptions": "Applied online The interview process took about 2 weeks. There is a phone interview, group interview with clinic director, MA leads and front desk leads, MA testing which is pretty basic, that includes taking BP, Pulse and Respirations.", "Interview Questions": "How would you describe your current manager? \r\nWhat are you clinical strengths and weaknesses?\r\nWhat would you say your current manager thinks about you?\r\nHow would you handle a stressful situation? \r\n"}, {"date": "25 Jan 2018", "title": "Digital Media Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Peak Vista Community Health Centers in Jan 2018", "Interview Descriptions": "Initial phone interview, then a series of two interviews with management/administration as well as department staff.  Wasn't given an offer, and any follow ups have been met with form letters.", "Interview Questions": "Explain a time when you disagreed with a team member and how did you rectify it?"}, {"date": "16 Sept 2017", "title": "COO Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Peak Vista Community Health Centers (Colorado Springs, CO) in Sept 2017", "Interview Descriptions": "Phone call. Standard questions. Some discussion about all the negative employee reviews on glassdoor and other locations online. Need for change management.  Said she's get back to me by Friday with the potential for a second round of interviews.  Haven't heard from the recruiter since -- and \"Friday\" is long gone....  She seemed overworked and mildly disengaged in her questions, actually.", "Interview Questions": "Strengths and weaknesses. What would you do in first 90 days. Etc.  Pretty standardized questions."}, {"date": "4 Apr 2016", "title": "Manager of Talent Acquisition Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Peak Vista Community Health Centers (Colorado Springs, CO)", "Interview Descriptions": "The interview was a panel interview format with several members of the HR and Recruiting team - very professional and friendly group of people.  The overall interview lasted 2 hours.  A very positive experience, and I had the initial impression (which turned out to be correct) that I was interviewing with some very intelligent individuals.", "Interview Questions": "What would you do in the first 90 days, if selected?"}, {"date": "14 Sept 2017", "title": "Clinical Team Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Peak Vista Community Health Centers (Colorado Springs, CO) in Mar 2016", "Interview Descriptions": "If you are qualified, you will receive a phone call for a telephone interview. If you do well with that, you'll proceed to doing 1 to 3 face-to-face interviews. Be prepared for basic questions that don't take a lot of mental energy.", "Interview Questions": "Which of our core values do you identify with the most?"}, {"date": "22 Sept 2015", "title": "Manager of Talent Acquisition Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Peak Vista Community Health Centers (Colorado Springs, CO) in Aug 2015", "Interview Descriptions": "The interviewers were not ready or even around at the time set.  I had to wonder around the building for 15 min just to find someone that could even direct me to one of the interviewers.  Once started the interview was very robotic and sterile.  I got the impression that they had not interviewed anyone before.  After, i filled out references that are not done by the company and took a Harris test.  After all that i received no contact or updates and none of the interviewers or recruiter we available by phone or email.", "Interview Questions": "How would you handle a difficult hiring manager"}, {"date": "21 Sept 2013", "title": "Staffer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Peak Vista Community Health Centers (Colorado Springs, CO)", "Interview Descriptions": "They will lie every step of the way", "Interview Questions": "The questions were pretty normal. This is not a creative group of people."}], [{"date": "22 Dec 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Peak Vista Community Health Centers (Colorado Springs, CO) in Nov 2011", "Interview Descriptions": "Professional interview with clinic manager and vp clinical operations, Very nature and friendly.  Since this interview was done they have gone to group interview which I do not like but is quicker.", "Interview Questions": "Standard interview questions with technical nursing questions. Asked why I wanted to work there?"}]]