[[{"date": "10 Oct 2022", "title": "Program Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Learning (Washington, DC) in May 2022", "Interview Descriptions": "The initial interview was a 30 minute interview with two members of the team. Both team members were unenthusiastic when talking about the organization and their roles. They also were not showing respectful listening.", "Interview Questions": "What do you see yourself doing in 5 years?"}, {"date": "22 Nov 2021", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Learning (Washington, DC)", "Interview Descriptions": "Voice Phone Call Interview was scheduled for thirty minutes with Human Resources. The woman liked when I asked questions. \nAfter the screening interview there was a videocall over Microsoft Teams.", "Interview Questions": "Where are you located?\nCan you guide me through your resume?\nCan you tell me about your international travels?\nCan you tell me about your administrative work?\nCan you tell me about your written and oral language/communication?\nCan you tell me about your technology skills?\nHow are you detail-oriented?\nWhat experiences do you have working with external stakeholders?\nDo you have customer service experience?\nHave you ever used financial-based technology platforms? \nTell me about yourself?\nWhen can you start?"}, {"date": "21 May 2021", "title": "HR Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Learning in Mar 2021", "Interview Descriptions": "Started process back in the last week of March with a phone interview. Had a zoom interview with the team two weeks later and a final interview a week after that.\r\nIt’s been a month since the last interview and I’ve yet to hear anything. Honestly this experience left a bad taste in my mouth. Even if  I wasn’t what they were looking for, leaving a candidate hanging for a month plus after the whole process speaks volumes of the organization.", "Interview Questions": "Very standard. \r\nTell me about yourself? \r\nWhy are you interested in this role? "}, {"date": "16 Mar 2020", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Learning", "Interview Descriptions": "This company was Red Flags R Us. I also don't know where the POC were but I sure didn't see any during the interview process so I definitely saw what people here meant by the lack of diversity. For this job, the low 42k salary and nature of work seems to attract privileged upper/middle class (white from what I saw) people who don't have college loans, have help from their parents, and/or very little in college debt. A few of the red flags I noticed: they said even if a worker had experience with a country, they purposely didn't have that person work on that country. The way the management answered some of the questions regarding reviews here. The lack of diversity. The similarity of the people working there. The salary. The lack of upward mobility.  Also, other NGOs/nonprofits I interviewed with said before the interview process something along the lines of 'I'm sorry but unfortunately we don't offer relocation assistance, is that okay with you?' whereas here I had to ask the interviewers about relocation as it was automatically assumed you'd be moving on your own dime for a 42k salary; I know that moving on your own is standard with most NGOS but I like that others had the courtesy of letting people know and not making that automatic assumption. I ended up signing with another NGO with nicer employees offering 9k more before I heard back from them.", "Interview Questions": "How did you handle a crisis? How do you feel doing administrative work?"}, {"date": "13 Mar 2020", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Learning in Feb 2020", "Interview Descriptions": "Standard 30-minute interview over Skype that started off with them talking about their program, asking about why you qualify for the internship along with follow-up questions. They were really nice people and didn't throw any curveball questions. Everything was expected.", "Interview Questions": "What skills can you bring to this internship position? "}, {"date": "11 Oct 2019", "title": "Summer Group Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Learning", "Interview Descriptions": "Lots of questions, referred to my resume a lot, had two people asking me questions. Repeated questions from the online application process. They talked me about the basics of the job and the compensation. Did a language exam after the interview.", "Interview Questions": "A challenge I've faced at work before?"}, {"date": "30 Nov 2020", "title": "Program Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Learning in Oct 2019", "Interview Descriptions": "Straightforward interview process with standard questions for an administrative support position. I had an in-person interview with a manager and one mid-level employee. The interview lasted for about 30 minutes and was followed up by a short writing exam.", "Interview Questions": "\"Tell me about the last time a co-worker or customer got angry with you. What happened? How did you handle the situation?\""}, {"date": "1 Apr 2021", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Learning in Sept 2019", "Interview Descriptions": "Phone interview with members of their team that went well. I first had a phone call with HR and then a second round interview with the members of their team.", "Interview Questions": "Asked me about my organizational skills and ability to work with several teams at a time"}, {"date": "2 Mar 2021", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at World Learning (Washington, DC) in Aug 2019", "Interview Descriptions": "I applied online, and received an interview invitation several weeks later.  I went to their office for the interview and noticed many red flags - the interview itself gave me the impression that they are very disorganized and overworked.  There was no greeting or direction at the lobby.  They were running over 30 minutes late and never told me.  I sat there and listened to the entire interview for the candidate ahead of me, watching her through the clear glass of their conference room right next to the lobby.  When her interview was done, she left and no one came to get me.  I watched the interviewer leave - she walked passed me without a word.  Finally, a long time later, she came back to me very flustered.  I had to help her set up her laptop again in the conference room and connect with the program director [who was off-site].  The interviewer was inexperienced with setting up video conference calls and I had to do it for her, all the while trying to introduce myself and talk to her about my experience. When we finally connected with the program director, she only asked me a couple questions.  I know that I answered them very strongly - I was overqualified for the position.  The interviewer didn't have my CV or cover letter in front of her, so I had to give her a copy.  I expected her to ask me to reschedule the interview given all the technical difficulties, but she did not.  I was rushed out of the room after only 20 minutes, with the interviewer telling me that she hadn't had lunch yet that day.  The candidate before me had nearly an hour with the interviewer, and they didn't ask me any of the questions they had asked her.  I never heard back after the interview, which was just as well because I wouldn't want to work for an organization that treats an interviewee in this way.  I should add that I am an alumnus of SIT, and a donor to World Learning, so I was very disappointed by this experience.", "Interview Questions": "Tell me about your experience with programs focusing on global development"}, {"date": "25 Dec 2018", "title": "Experiment Group Leader (Return) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at World Learning (Brattleboro, VT) in Dec 2018", "Interview Descriptions": "Felt very impersonal compared to past years - probably budget cuts / less program staff and higher reliance on technology.  One way video interview (record your answers), then live skype interview.\r\n\r\nI was not impressed with how the interviewer handled the fact that my feedback hadn't been provided in the live video interview, but the hiring team lead did follow up and provide the feedback along with a chance to have a second conversation.", "Interview Questions": "How would you work differently based off of feedback from past trips?"}], [{"date": "27 Oct 2018", "title": "Project Finance Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Learning (Washington, DC) in Oct 2018", "Interview Descriptions": "I applied online and received an email to schedule a phone interview promptly after. Someone in h/r asked a few FIT questions and some finance questions about journal entries. Two weeks later I got a call for 2nd round in person with another person in h/r and head of finance. Mostly FIT questions and also asked if i can do a bank reconciliation and journal entry for prepaid rent. Overall, I would say it was a positive experience and would  apply again.  The office looked nice too. I can tell you this too, when I went for the in-person interview, I could see the diversity there: different ethnicities, genders, age ranges.", "Interview Questions": "Difference between cash and accrual expenses; at a new school, what expenses would you record; can you do a bank reconciliation; if you pay rent 3 months in advance, how would you record that; what expenses would you not report if going on a trip (something like that)"}, {"date": "20 Aug 2018", "title": "Youth Programs Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at World Learning", "Interview Descriptions": "There is a part one, which is online recorded interview, and a part 2, which is a one on one live video interview. Part one will be recorded and you will have a little bit of more time to prepare. The live video interview is actually fun, and a more personable experience because you get to learn more about the program.", "Interview Questions": "How would you deal with a situation of bullying amongst participants, especially if you heard it from one of your students who speaks a language other than English?"}, {"date": "8 Feb 2019", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Learning (Washington, DC) in Jul 2018", "Interview Descriptions": "I applied online and was contacted for an interview about 1.5 week later. I interviewed with two members of the hiring team. One week following the interview, I was asked to complete a case study exercise. The HR team checked my references (using a very lengthy questionnaire).  Then, a few days after that, I was informed via email from HR that the position was closed.\r\nThis was the most frustrating part, that they checked multiple references but did not make an offer or even contact me personally (the email from HR seemed to be automatically generated).", "Interview Questions": "Asked about approach to managing junior staff members."}, {"date": "14 Mar 2018", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Learning (Washington, DC) in Feb 2018", "Interview Descriptions": "submitted an application online and heard back about two weeks later. Then, I had a phone interview with HR and that was followed by an interview with  the program team", "Interview Questions": "How do you prioritize tasks?"}, {"date": "23 Apr 2019", "title": "Programmer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at World Learning in Jan 2018", "Interview Descriptions": "interesting smooth process. simple question because i felt prepared and knew about the organization. the empolyee was friendly and made me feel comfortable. know what you like about the organization and be prepared", "Interview Questions": "Asked about my intrests"}, {"date": "8 Jan 2018", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Learning (Washington, DC) in Dec 2017", "Interview Descriptions": "Applied online, called me for a face to face interview three weeks after. On the same day, called me for second round of interview two days after. The whole process was very weird. They asked me to fill out a lot of paperwork even before the second round of interview. They reached out to my references before the second round of interview. I had to find four previous supervisors who basically had to write an essay about me. They made me fill out a government form that asked for transcript and way too many information. I spend a lot of my time completing these paperwork. My references also had to spend a lot of time writing about me. However, at the end I was not offered the position. My recommendation to World Learning is don't make people do some much work even before the second round of interview. This is a very bad practice. Please do not waste candidates time like this. I have serious doubts about how you treat your employees when you can't respects applicant's time.", "Interview Questions": "Silliest things you have done at work"}, {"date": "15 Jan 2018", "title": "Trip Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at World Learning (Chicago, IL) in Dec 2017", "Interview Descriptions": "One way recorded interview, two-way skype interview, and then a final two-way skype interview. Each interview was about an hour long, and the interviewers were very nice, knowledgable, and interested in the process. I enjoyed the interview process.", "Interview Questions": "They asked how to handle specific situations while working with young adults, and why I was interested in working with high school aged people. "}, {"date": "4 Mar 2018", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Learning (Washington, DC) in Oct 2017", "Interview Descriptions": "Simple in person interview with senior finance officer at Washington DC office. Make sure you know basic accounting and finance and are able to do a simple exercise when asked. Otherwise very general and easy to answer questions", "Interview Questions": "Do you know how to perform a Bank Reconciliation?"}, {"date": "3 Aug 2017", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Learning (Washington, DC) in Apr 2017", "Interview Descriptions": "Apply through an online portal. Received email inquiring about an interview.  Following the first interview, I was scheduled for a second. HR reached out a week later with a Formal Hiring Letter.", "Interview Questions": "How do you manage tasks and organization?"}, {"date": "13 Aug 2017", "title": "Youth Programs Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Learning (Burlington, VT) in Apr 2017", "Interview Descriptions": "Very friendly informal interviews.  Both of them were online via Skype and lasted for about an hour. They ask about potential transferable skills the applicant might have and how capable they are in cross-cultural communication.", "Interview Questions": "What inspires you to do this kind of work?"}], [{"date": "13 Oct 2017", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Learning (Washington, DC) in Jan 2017", "Interview Descriptions": "There was an in-person interview with 4 people, which lasted just more than an hour. About a week after, I was asked to do a research task (simulating something similar to what the Program Associate would do on this project) and respond to them within a day.  Several days later, they then reached out to my references. Unfortunately, I didn't get the job. My overall experience was very positive, but it was unusual that they spoke with my references when they weren't planning on offering me the position.", "Interview Questions": "Share about an experience when you had to deal with an emergency and how you responded."}, {"date": "31 Oct 2016", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at World Learning", "Interview Descriptions": "I applied online and received an email for an interview. I went in and did a 40 minute in-person interview with three of the team members. The conversation was pleasant. They asked me 7-8 questions including 2 scenario questions and heard back from them within a week. The whole process took no longer than a week and a half.", "Interview Questions": "How do you keep yourself organized and make sure nothing falls through the crack when you have so many things going on?"}, {"date": "27 Jan 2017", "title": "Student Computing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at World Learning (Brattleboro, VT) in Sept 2016", "Interview Descriptions": "The interview was very warm and open. After a review of my resume, the Head of the IT department and a conversation with me about the position and the responsibilities it came with. We also discussed how my skills and expertise would satisfy these responsibilities.", "Interview Questions": "How do you envision you engagements in this position?"}, {"date": "24 Aug 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at World Learning (Washington, DC) in Apr 2016", "Interview Descriptions": "I applied online and was contacted soon after for an in-person interview. The questions were standard and I was able to get a better idea of what the position entailed.", "Interview Questions": "What past experience will help you succeed int his position?"}, {"date": "16 Feb 2016", "title": "Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Learning", "Interview Descriptions": "I applied online and interviewed a week after. The interviewer was very nice and we had a great conversation. \r\n\r\nThey called me to tell me they wanted to give me the offer.", "Interview Questions": "any creative ideas ?"}, {"date": "6 Jan 2016", "title": "Program Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at World Learning (Washington, DC)", "Interview Descriptions": "The interview was difficult, because it was unclear what exactly they were looking for. They seemed more interested in my connections and who I knew or was connected to than my actual skills or work experience.", "Interview Questions": "What has been the highest profile job you've ever worked?"}, {"date": "8 Feb 2016", "title": "Spring Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at World Learning (Washington, DC) in Dec 2015", "Interview Descriptions": "The two interviewers were very nice. They gave a very detailed description about the internship at the beginning, which answered many of my questions. Then they asked me around 5 questions. The whole process was relaxing, and I heard back within a week.", "Interview Questions": "How do you prioritize tasks when you have multiple tasks?"}, {"date": "30 Dec 2015", "title": "Admissions Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Learning (Washington, DC) in Aug 2015", "Interview Descriptions": "Found this process incredibly frustrating. I applied online and heard very quickly. They wanted to bring me in almost immediately for an interview. Gave me little time to prepare or research. Went in for an interview with 2 peers (supervisor was out of the office). Lasted about an hour and was led to believe they would make decision promptly. A week later, they brought me back in for another interview including the supervisor.", "Interview Questions": "More get to know you questions than anything rigorous. Was really turned off by the team and the supervisor. When they were telling me about the organization, they focused a lot of the negatives of the company rather than improvements they were making. "}, {"date": "6 Jul 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Learning (Washington, DC) in Jun 2015", "Interview Descriptions": "I found out about the position through an online job board and sent an email with my resume and cover letter to the listed contact. About a week later, the contact responded to my email asking if I would be available for an interview later that week. The interview was average. I was in a tiny room with two employees from the department that the internship was associated with. Following the interview I was asked to send them a list of professional references. I did so and never heard back from them again, even after sending a follow-up email over a week later. To this day I have no closure on the status of this position, so I have moved on and accepted another offer.", "Interview Questions": "What interests you about this position?"}, {"date": "15 Jun 2015", "title": "Summer Group Leader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at World Learning (Brattleboro, VT) in Apr 2015", "Interview Descriptions": "Unfortunatley, this was probably the worst interview process that I've been through. Information and correspondence was incredibly patchy, with two months between applying and getting invited for the first interview, and another month passing between the first and final interviews. The interviewers themselves were lovely people during our conversations and the questions were very pointed to the position. However, on the application website as well as in interviews, I was told that I could ask questions and check on the selections process with staff. Because there was so much time between correspondences, I reached out twice over the course of the four months and received no response either time from World Learning staff. It was a very frustrating and ambiguous process. Overall, I felt disrespected as an applicant. It seems to be a very disorganized organization.", "Interview Questions": "Questions on experience in education, personal educational philosophy, and scenario questions related to interacting with students and reacting to possible challenges while leading a group abroad. "}], [{"date": "13 Apr 2015", "title": "Program Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Learning (Washington, DC) in Apr 2015", "Interview Descriptions": "I applied online, they emailed me for an interview maybe 1.5-2 weeks later, I came in for a very quick interview with three people all at once. They asked me a lot of questions related to my ability and experience to carry out the tasks related to the job. They emphasized the very administrative nature of the job. Not 2 hours after I got home I was emailed to say they had gone with someone else.", "Interview Questions": "Why World Learning and why this program in particular."}, {"date": "20 May 2015", "title": "Monitoring and Evaluation Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at World Learning (Washington, DC) in Nov 2014", "Interview Descriptions": "Was heard back after 2 weeks after online application. Quick response to schedule an in-person interview. During the interview, 2 interviewers were present with well-structured questions. It took around 30 minutes. Afterwards, I received nice correspondence and feedback within 2 weeks.", "Interview Questions": "What kind of employers do you prefer to work with?"}, {"date": "1 May 2014", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Learning (Washington, DC)", "Interview Descriptions": "Very standard format: application (cover letter, resume), then 45-min. Interview with two people. No trick questions", "Interview Questions": "\"Case study\" type question that posed a hypothetical situation; I had to explain how I would respond."}, {"date": "16 May 2014", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at World Learning (Washington, DC) in May 2014", "Interview Descriptions": "I applied online then was contacted about a Skype interview, I applied out of state. The interview was straightforward with general questions related specifically to the program in which I will be working. The interview was a lot of fun and I really enjoyed it. There were three people who interviewed me and questions were generally based around experiences with people of different cultures and nationalities, as well as what kind of employee you are.", "Interview Questions": "Truthfully, there weren't any that I considered unexpected. They were all fair questions based around my application."}, {"date": "16 Mar 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Learning", "Interview Descriptions": "Employer responded to application, interviewed candidate, and responded with an offer very promptly.   During the Q&A, employer took the time to answer my questions and gave great insight on the non-profit.  I took the job, and the insight has proven very accurate.", "Interview Questions": "Very standard interview questions - nothing unexpected."}, {"date": "24 Sept 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Learning", "Interview Descriptions": "The interview was with two people: one in person, the other over the phone. The questions basically asked for more detail about what was on my resume and the technical skills I had listed. I was asked about my experience with developing monitoring and evaluation plans and my experience with institutional capacity development.", "Interview Questions": "I was asked how I might handle conflicting directives coming from several senior managers."}, {"date": "2 Sept 2013", "title": "Program Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at World Learning", "Interview Descriptions": "I was contacted via email from HR. The email came at 7:30 in the evening and requested an interview the next day.", "Interview Questions": "The interview questions were the usual. I was put off a bit by the interviewer's cagey answers about the organization and the direction it was moving.  It felt like they did not want to answer the question as clearly as I would have liked.  It seemed like the negative comments on here were right, so I although I was offered a second interview, I declined. "}, {"date": "15 Aug 2013", "title": "Special Assistant to the President Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at World Learning (Washington, DC) in Jun 2013", "Interview Descriptions": "The hiring process started off well.  I was contacted shortly after applying, and was called in three times to meet with the various players.  Immediately after interviewing with the President, HR said they just needed to check my references.  A week and a half later they finally started.  After 7 weeks of this nonsense I got an email that said in spite of my outstanding references and experience they were going with another candidate.", "Interview Questions": "They questions were pretty generic."}, {"date": "13 May 2013", "title": "Accountant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at World Learning (Washington, DC)", "Interview Descriptions": "Applied Online,\r\n\r\nThe Interview was arranged by the HR manager via email.\r\n\r\nOffer not made.", "Interview Questions": "The group of interviewers were not prepared for the interview at all. No arrangement for the interview room, they were not sure of who should be in the panel. The lead interviewer picked staff on the hall way to do the interview. Most of them had no idea whats going on\r\n\r\nTerrible experience"}, {"date": "5 Oct 2016", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at World Learning (Washington, DC) in Mar 2013", "Interview Descriptions": "Three-person interview with technical and program staff that lasted 30 minutes. Not very intense, but direct with the questions. It covered everything from my strengths to weaknesses, prior experiences working in the field of international development to my thoughts on work/life balance.", "Interview Questions": "How well you do work in a team? Are you able to work independently? Where do you see yourself in 5 years? What technical skills do you possess that can add value you to the team?"}], [{"date": "22 Feb 2013", "title": "Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at World Learning", "Interview Descriptions": "submitted online application and was called for an interview the next week.The interview lasted about a half an hour and I was basically hired on the spot and started working two weeks later.", "Interview Questions": "nothing difficult. just talked about past work experience."}, {"date": "7 Nov 2012", "title": "Internship Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at World Learning (Washington, DC) in Oct 2012", "Interview Descriptions": "Applied and about a week later received an email asking me to come in for an interview. They had 2 team members interview me at once. They were nice, but not exactly friendly. It was casual, but the questions were rather redundant in nature.", "Interview Questions": "How do you prioritize your work? \r\nHow would you describe your organizational skills? \r\nWhat is your leadership style?\r\nWhat type of leadership style do you prefer in a supervisor? "}, {"date": "30 Sept 2016", "title": "Program Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at World Learning (Washington, DC) in Sept 2012", "Interview Descriptions": "I applied online and received an invitation to interview about two weeks later, which consisted of a panel interview with position's supervisor (Deputy Director), Director, and HR manager. Everyone was very friendly and the conversation was fair.", "Interview Questions": "What aspects of implementation do you enjoy most?"}, {"date": "8 Mar 2014", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at World Learning (Washington, DC) in Aug 2012", "Interview Descriptions": "Responded to job posting by email, and got a response about 4 days later. In person interview scheduled right after. Small interview panel, that did not seem to have discussed any plan beforehand. Standard questions. Quick response time, one day, with a job offer, but   seemed unhappy about the necessary two weeks notice I asked to give to my former employer for a start date.", "Interview Questions": "How do you handle working on tasks with little context?"}]]