[[{"date": "10 May 2022", "title": "Food Service Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at JFK Medical Center", "Interview Descriptions": "Helpful. They asked questions and gave me time to answer. Not intimidating at all. The lady was nice. They called me in right away.  I was given paperwork to fill out but it was easy.", "Interview Questions": "Work experience and how you can bring it to jfk."}, {"date": "20 May 2022", "title": "PCT Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at JFK Medical Center (Edison, NJ) in May 2022", "Interview Descriptions": "interview process was great. I felt comfortable and it was more of a conversation as opposed to a question-answer. there were 3 people interviewing me and they gave me a tour of the unit", "Interview Questions": "tell me about yourself?\r\nwhat are your strengths and weaknesses"}, {"date": "18 Mar 2022", "title": "PGY1 Pharmacy Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at JFK Medical Center", "Interview Descriptions": "Very friendly interviews, a presentation, and four panel style interviewes. Mostly Behavioral questions and some basic clinical questions. Make sure to brush up on clinical knowledge and speak clearly. Interview with this program.", "Interview Questions": "Why did you choose JFK?"}, {"date": "4 Mar 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at JFK Medical Center (New Brunswick, NJ) in Mar 2021", "Interview Descriptions": "It was very friendly and thorough. It almost felt like a conversation and I was not nervous at all. They gave me the opportunity to ask questions in the end as well.", "Interview Questions": "What sets you apart from other candidates?"}, {"date": "16 Feb 2021", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at JFK Medical Center", "Interview Descriptions": "Interview was smooth. Due to pandemic it was via zoom but still a very thorough interview. I also got to meet a charge nurse who was very open to any questioning.", "Interview Questions": "Why I chose the ER department "}, {"date": "16 Feb 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at JFK Medical Center in Feb 2021", "Interview Descriptions": "Interview process was moderate in difficulty level. Several questions were asked, be prepared to answer standard interview behavioral questions, and speak on past experiences and how they relate to the position you are applying to.", "Interview Questions": "Why do you want to work here?"}, {"date": "29 Sept 2020", "title": "MLS II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at JFK Medical Center (Edison, NJ) in Sept 2020", "Interview Descriptions": "Peaceful, no pressure. The interview took roughly 40 minutes. Discussed the aspects of the lab, how scheduling works. The supervisor took me on a tour of the lab and introduced me to the employees during that shift.", "Interview Questions": "Which department of the lab do you enjoy most?"}, {"date": "16 Jun 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at JFK Medical Center in Jun 2020", "Interview Descriptions": "I was first contacted by a HR Recruiter who verified I was qualified for the job. She asked me some basic question that were mostly on my resume. This step was called an \"interview.\" Then next part was called a \"phone screening.\" This part felt more like an interview than the other part. I spoke on the phone with a nurse manager. She told me a little about the facility, the job. Asked me some basic questions about myself while looking at my resume. She asked me about my experiences, what I am up to now, etc. She was really nice and the conversation was comfortable and went on easily.", "Interview Questions": "What are you up to now?"}, {"date": "22 Nov 2019", "title": "Physical Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at JFK Medical Center", "Interview Descriptions": "Lengthy, but very thorough. Interviewer extensively went through each experience listed on resume and asked questions about each job/internship or affiliation. All questions asked were clinically relevant and interviewer seemed genuinely interested in you as a person.", "Interview Questions": "What did you learn the most out of your experience at this job (in reference to what is listed on your resume)?"}, {"date": "27 Jul 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at JFK Medical Center (Edison, NJ) in Jul 2019", "Interview Descriptions": "Friendly, low stress, casual conversation about experiences and qualifications.  I sat down with the manger who’d be making the decision and one I’d get assistant nurse managers. I was then given a quick tour of the unit. The workflow and processes of day to day work were summarized for me. I was given cell phone numbers if I had any additional questions later on.", "Interview Questions": "What are your strengths"}], [{"date": "29 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at JFK Medical Center (Lake Worth, FL) in Jan 2019", "Interview Descriptions": "Very good, polite, technical, consistent and complete. They ask for my education, my experience, and past employments. Why I left. Over all is was pretty easy interview. I would recommend do your due diligence and reasearch  all the job description before the interview for better chance getting the position.", "Interview Questions": "Can you work as a team member? "}, {"date": "23 Dec 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at JFK Medical Center (Edison, NJ) in Jan 2019", "Interview Descriptions": "It was easy and smooth. First the interview was with HR, took the medication exam test. After that interview was sent up with manager. Simple 1-2 questions and then they explained the job and duties", "Interview Questions": "What kind of experience do you have?"}, {"date": "26 Nov 2018", "title": "Scheduling Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at JFK Medical Center (Edison, NJ) in Nov 2018", "Interview Descriptions": "Very polite, friendly and straight to the point.  We spoke more on life and future goals for the hospital and personal life, less of what was on my resume.", "Interview Questions": "How do you see yourself fitting in JFK median?"}, {"date": "15 Jun 2018", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at JFK Medical Center", "Interview Descriptions": "Seemed fine at first, but when they kept implying I couldn't be looking at other options/job prospects while pursuing them. HR made an (unofficial) offer over the phone, and when I asked for a week to manage my other options and get back to her with a decision, the whole tone of the PIs and interviewers turned sour.", "Interview Questions": "Are you looking at any other opportunities outside of JFK Medical?"}, {"date": "25 Jul 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at JFK Medical Center (New York, NY)", "Interview Descriptions": "I first spoke with a recruiter on the phone after submitting an online application. She scheduled me for an interview the very next day. I interviewed with the director on the floor. The director was very friendly and welcomed any questions I had.", "Interview Questions": "Why this hospital?"}, {"date": "23 Jan 2017", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at JFK Medical Center", "Interview Descriptions": "Brief interview.. only got asked to talk about myself and my resume. Was referred by a current employee, they are always looking to hire. Met with HR and then supervisor, discussed my knowledge and experience and was offered the job.", "Interview Questions": "what experience do you have in Accounts Receivable"}, {"date": "30 Jan 2017", "title": "Physical Therapist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at JFK Medical Center (Edison, NJ) in Jan 2017", "Interview Descriptions": "Recruiter called day after online application was filled out. Got an interview within the next week, heard back within 2 weeks. HR was very pleasant/helpful. Hiring manager was condescending.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "1 Feb 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at JFK Medical Center in Oct 2016", "Interview Descriptions": "I applied online and with 30 min the hr contacted me to set up an interview. Next week, went to the interview, basic interview questions. Then that same week went on to interview with the manager. Again basic interview questions and then she showed me around the unit. Got a call next day that I got the job. Went to take the math test, urine drug test, and physical. 2 weeks later was the orientation.", "Interview Questions": "Why do you want to work here?"}, {"date": "1 Sept 2016", "title": "Medical Coder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at JFK Medical Center (Edison, NJ)", "Interview Descriptions": "My interview experience with the HR recruiter Norma Merced was very pleasant. I was asked straightforward questions and I felt comfortable throughout the interview. Very accommodative and helpful in each step of hiring process. Quick and efficient interview process which had a test and interview with the department head as well.", "Interview Questions": "How did you hear about the position."}, {"date": "9 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at JFK Medical Center (Edison, NJ) in Aug 2016", "Interview Descriptions": "I applied on line and received a call the following day from Brian Scheets the HR Recruiter. On the day of my interview  Brian was very personable,friendly and made me feel very comfortable. He was a breath of fresh air and his demeanor really helped calm my nerves.  He was very informative and professional and is an asset to that company.  During interview i was asked more then 14 questions!! You must prepare for the interview or you will not do well.", "Interview Questions": "What would your co-workers say your weakness is?"}], [{"date": "4 Mar 2016", "title": "MIR TECH AIDE Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at JFK Medical Center in Mar 2016", "Interview Descriptions": "I meet with three interviewers who All were really nice. They only asked one or two questions then just showed me around the buidling and told me about the job.", "Interview Questions": "tell me some qualities about you"}, {"date": "16 Mar 2016", "title": "CNA Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at JFK Medical Center (Edison, NJ) in Mar 2016", "Interview Descriptions": "They called me to let me know about the position the recruiter was extremely nice. He asked details about my expected salary and he even gave me advices. He answered all my questions it was a pleasure experience. Then he even gave me his number and extension to give him a call back if I decide to accept the job", "Interview Questions": "Why I applied to that hospital"}, {"date": "21 Jan 2016", "title": "Registrar Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at JFK Medical Center", "Interview Descriptions": "I had a pleasant interview experience. It was very simple and straightforward. The job opening was for a per diem registrar. I enjoyed the interview experience. They asked a wide range of questions but they were very easy to answer. (Why do you want to work there? What computer skills do you possess? Do you like working alone or in a group setting?", "Interview Questions": "How many words per minute can you type?"}, {"date": "23 Sept 2017", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at JFK Medical Center (Edison, NJ) in Jan 2016", "Interview Descriptions": "Easy if you were prepared for the typical general interview questions. The staff is inviting and friendly. I would be prepared for questions about your prior research experience, including at the college level.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "19 Nov 2015", "title": "Process Improvement Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at JFK Medical Center (Edison, NJ) in Oct 2015", "Interview Descriptions": "Phone interview with HR manager followed by an onsite one on one interview with a Hiring Manager. If the one on one interview goes well then again there is an on site meeting with the President.", "Interview Questions": "How you get management support? Working with team, examples for improvements, etc"}, {"date": "4 Sept 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at JFK Medical Center (Edison, NJ) in Jun 2015", "Interview Descriptions": "I interviewed for a residency program which lead to a full time position at its completion. It was a panel-style interview. I would say it was standard and straight forward.", "Interview Questions": "Do you intend to further your education?"}, {"date": "7 Jul 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at JFK Medical Center in May 2015", "Interview Descriptions": "Very efficient... Called in by recruiter, met with dept heads, standard interview questions, nothing out of the ordinary...submitted info for a background check...did health/physical testing. Once this was completed, offer was officially extended and accepted.", "Interview Questions": "How would you handle a difficult patient?"}, {"date": "29 Jan 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at JFK Medical Center (Edison, NJ) in Apr 2015", "Interview Descriptions": "the interview was short.  asked my experience and goals. with manager and assistant manager. HR was unorganized and offered me the position twice forgetting they previously offered it.  started one month after the interview", "Interview Questions": "why do you want to work in this field "}, {"date": "27 Feb 2015", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at JFK Medical Center", "Interview Descriptions": "Super quick, like 15 minutes, and quite easy. Plus the woman who interviewed me was super friendly. Standard interview questions, stengths weaknesses, why you want to volunteer here etc etc. nothing too intimidating. Just smile and act like you want to be there for the right reasons.", "Interview Questions": "Name a recent time you had to overcome a conflict?"}, {"date": "9 Sept 2016", "title": "Food Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at JFK Medical Center (Edison, NJ) in Feb 2015", "Interview Descriptions": "Met with two different managers asked basic questions about my previous jobs and availability. The people asking questions were very laid back. I felt at ease the entire time and it was a very welcoming environment. Met with two different managers asked basic questions about my previous jobs and availability. The people asking questions were very laid back. I felt at ease the entire time and it was a very welcoming environment.", "Interview Questions": "Do you have any previous experience in food service?"}], [{"date": "15 Jul 2014", "title": "Nursing Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at JFK Medical Center (Edison, NJ)", "Interview Descriptions": "I initially got called for a potential job opening in the middle of my school semester. I told them that my schedule for that semester wouldn't allow me to work on the side. They told me that they will keep my application and to call back once my summer break starts. After a few months I called and informed them that my summer break started. They lost my application form so they asked me to stop by and fill out a new application. After a few days I got a call for an interview. The rest they say is history.", "Interview Questions": "My interview went smoother than I anticipated so I do not recall any questions out of the ordinary. Since I was a nursing student I was highly desirable for the position that I applied for. "}, {"date": "3 Nov 2014", "title": "CT Technologist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at JFK Medical Center in Jul 2014", "Interview Descriptions": "Brash and telling me what a \"hell hole \" the department is and how \"not many people make in that kitchen\" and that I probably would never make it there so why even bother wasting anyone's time", "Interview Questions": "\"What gives me the right to be there\""}, {"date": "13 Jul 2012", "title": "Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at JFK Medical Center (Edison, NJ) in Jan 2011", "Interview Descriptions": "The interview process was very friendly and informative. It welcomed us with a nice introduction to the facility and program. They showed us what was great about the program here and also what to watch out for at other programs. The program director really cared about our views and it was a mutual interview where we learned about each other.", "Interview Questions": "I always find that what motivated me to pursue a career in medicine to be a difficulty question due to the variety of factors that contributed to that decision."}]]