[[{"date": "18 Feb 2023", "title": "Software Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elevation Church in Jun 2022", "Interview Descriptions": "Numerous Personality Test Batteries (I would say at least 5) as well as competency batteries (reading/writing/math) as well as several online form style and hirevue style recording interviews. Additionally for Software Engineer roles you have a take home project (1-2 days to complete). Then if you make it past this 'big tech' style interviewing process, you have a on-site or virtual on-site interview that lasts all day 8am-4pm. Overall I would not recommend applying to Elevation unless you are 100% about committing your life to Elevation Church and staying there for a very long time. They made it abundantly clear that it will be stressful and the remedy to this stressful and seemingly toxic work environment will be to \"remember your why\". The salary offer for full-stack work was pitifully low at 70k with an upwards cap of 90k, and for a mega-million church that depends heavily on it's engineers and IT personnel, it didn't quite sit right with me how they wanted to emphasize that \"people take pay cuts all across the world to join elevation\". I was also told that elevation isn't a place for people to come and go (specifically under the context of career advancement) and that they \"aren't here for that\". This to me conveys that you are there to serve Elevation church, and it is not there to serve you and your needs whatever they maybe. Additionally it conveys the message that your ministry service isn't wanted unless you're in it for the long-haul. Throughout the process they bragged about only working 4 days: Mon-Thurs. while specifically, if not strategically omitting the fact (until the last on-site interview) that you are \"expected to volunteer\" at the church on Sunday. I think it's pretty reasonable that any Christian working at a Church, and attending the Church would most likely end up volunteering, but the way they hid this fact until the last interview, and phrased it as \"you are expected to...\" rather than \"required to...\" just seemed like a very duplicitous and shady. In the end I prayed for the Lord to close the door, so that there would be no ambiguity in whether I should accept an extended offer or not. He did, and I'm grateful. I love Elevation church, I still watch every Sunday, but my advice to anyone looking to work there as an engineer would be to closely consider whether you feel called to Elevation, because they will definitely want you to feel called, be 100% about elevation, take paycuts or a low salary offer, work an unspecified length of volunteer hours, and more to be considered a cultural fit/hire. To Elevation, I would just suggest being more transparent with expectations, as well as focusing on your employees health and satisfaction as well (not just the church congregation). Telling employees they will get burnt out, but should take their \"off day\" to unwind, or \"remember their why\" is a very disrespectful way of treating them.", "Interview Questions": "Many behavioral questions, why elevation church, etc. Your typical behavioral interview questions. The on-site will have you discussing more technical skills with their team, and another project to complete within an hour."}, {"date": "11 Apr 2023", "title": "Outreach Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Elevation Church (Charlotte, NC) in Nov 2021", "Interview Descriptions": "Even though I was not offered this position, they reached back out to offer me a chance at another position. Overall, it was a great experience, and they were professional, friendly, and truly interested in me as a person.", "Interview Questions": "How do you handle confrontation?"}, {"date": "14 Jan 2021", "title": "Marketing Strategist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elevation Church", "Interview Descriptions": "The interview process was positive. I had a zoom interview with three staff members about the role. I moved on to the next phase which included a series of online assessments. There was a candidate that had prior experience with church worship and they were offered the position (I did not have prior experience).", "Interview Questions": "Assessments included: Myers Briggs, Enneagram, Strength's Finder, CDAT and Skills Profiler."}, {"date": "4 Feb 2022", "title": "Social Media Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Elevation Church (Charlotte, NC) in Jan 2021", "Interview Descriptions": "Very exciting but, could use improvement. The company will have you do a practice project and determine your skills from there. Company didn't reach out in regards to denial and left unclear communication.", "Interview Questions": "Why are you excited about this position?"}, {"date": "14 Oct 2020", "title": "Filmmaker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Elevation Church (Matthews, NC)", "Interview Descriptions": "Interview process lasted three months, and would go a couple weeks at a time without hearing back about the next step in the process. Multiple interviews and creative projects required before being invited to travel to Elevation HQ in Matthews, NC on own dime for an intense two days of orientation and further interviewing, including speaking in front of the whole pastoral staff, \"speed dating\" interviewing with conceptual and spiritual questions seemingly unrelated to the job you're interviewing for, and networking events with the church leadership/your team. If you're a good fit for the culture at Elevation, you'll likely fit right in and it will be clear. If you don't match, you'll probably feel uncomfortable the whole time. Ultimately felt strung along for an unnecessary amount of time after not being offered a job with no explanation as to why.", "Interview Questions": "Teach me something about your craft\nWhat have you been studying in the word recently?\nDo you think you're a good fit for our team?"}, {"date": "21 Sept 2021", "title": "Logistics Account Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Elevation Church (Chicago, IL) in Jun 2019", "Interview Descriptions": "Very low-key and casual. More like a conversation than an interview. Asked basic questions like my past work experience and how I could relate it to the position I was applying for.", "Interview Questions": "What was one challenge I faced in my previous job and how I overcame it. "}, {"date": "7 Aug 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Elevation Church in Feb 2019", "Interview Descriptions": "Long process that needs to thought out. This is not easy but good for you to see if you want to work in the space. Don't stress just interview them vs. feeling like you're getting interviewed.", "Interview Questions": "What's your long time go? "}, {"date": "21 Jun 2019", "title": "Videographer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Elevation Church (Charlotte, NC) in Oct 2018", "Interview Descriptions": "The process is very extensive and requires the utmost transparency.  You will be out of your comfort zone whether you like it or not but the overall experience was rewarding.", "Interview Questions": "What's one thing you struggle with on a day to day basis."}, {"date": "14 Dec 2017", "title": "Copywriter Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Elevation Church (Matthews, NC) in Mar 2017", "Interview Descriptions": "There were 2 phone interviews, one with a hiring manager and one with a supervisor. There were basic interview questions, but some information was beingbheld back and I didn’t understand why. I was not formally offered the job in the interview, but I received tax paperwork in an e-mail shortly after.", "Interview Questions": "What type of work environment do I prefer"}, {"date": "31 Oct 2017", "title": "ECademy Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Elevation Church (Matthews, NC) in Dec 2016", "Interview Descriptions": "The person who was seeking to fill open position sought me out. She asked me for my resume and asked me to fill out the application. I came in for my interview and immediately following was offered a job.", "Interview Questions": "Do you get along well with others?"}]]