[[{"date": "31 Oct 2022", "title": "Skills Trainer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Trillium Family Services (Portland, OR) in Sept 2021", "Interview Descriptions": "I was unaware of the initial interview being a group interview, and the questions being asked felt like they had come straight from corporate. The process felt as if they were just desperately looking for bodies to be on the floors of their units without regard to the capability of their staff members.", "Interview Questions": "Are you physically capable of initiating physical restraints?"}, {"date": "29 Jul 2021", "title": "Skills Trainer II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Trillium Family Services", "Interview Descriptions": "The original person I was supposed to interview with got stuck in a meeting so I interviewed with two supervising staff. The guys doing my interview were very laid back and nice. The interview took about 30 minutes and started with giving a background about myself. I then got an overview of the job and was asked situational questions. I recommend looking up trauma-informed care and mentioning it in the interview.", "Interview Questions": "Give an example of a time you struggled with a coworker and how did you overcome it?"}, {"date": "19 Jul 2021", "title": "Life Skills Trainer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Trillium Family Services", "Interview Descriptions": "Group interview, relatively large group. Didn’t have great opportunity to share about own experience. This type of interview allowed certain personalities to stand out most. Felt like people could’ve been screened out more with resume review.", "Interview Questions": "Are you comfortable performing restrains when needed?"}, {"date": "23 Mar 2021", "title": "Software Engineer(Internship) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Trillium Family Services", "Interview Descriptions": "Standard interview that detailed strengths and weaknesses, approach to therapy, why one might want to work with kids in a difficult setting, and relevant experience with the population at children's farm home.", "Interview Questions": "What is your experience working with various therapeutic modalities and models? "}, {"date": "29 Sept 2020", "title": "Skills Trainer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Trillium Family Services (Portland, OR) in May 2020", "Interview Descriptions": "Easy not much to talk about u can bs it and get in without any issues. Just talk ur way in and don’t be anxious lol. Should be 30 min long.", "Interview Questions": "How do you manage your mental health "}, {"date": "29 Mar 2020", "title": "Skills Trainer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Trillium Family Services", "Interview Descriptions": "Two interviews and a job shadow. Drug test, and reference checks. The process was easy, they are alway  hiring. The job has a large turnover rate, so they hire a lot of people and very often.", "Interview Questions": "Have you or your family experienced mental health?"}, {"date": "1 Oct 2019", "title": "HR Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Trillium Family Services (Corvallis, OR) in Sept 2019", "Interview Descriptions": "I applied to the position online and heard back in less than a week. The Recruitment Director called me to set up a time to interview. She also gave me helpful instructions on how to find the place. The interview was about a week later. After it was over they said I would hear back, either way, by the end of the week. Later that week I received an email from the Recruitment Director saying that they were running behind and the decision would be postponed a few days. I heard back by end of day on the day I was told. Overall the process was very smooth and didn't keep me waiting for too long.", "Interview Questions": "What interests you in working in this field/at Trillium?"}, {"date": "20 May 2019", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Trillium Family Services", "Interview Descriptions": "Interview process was good. Would have been a 2 week process, but my schedule was tough so they worked around it well. Had a phone screening and 2 in-person interviews, then got a call with job offer the same day I had my 2nd interview.", "Interview Questions": "How do you receive negative feedback from a supervisor?"}, {"date": "5 Mar 2019", "title": "Skills Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Trillium Family Services", "Interview Descriptions": "The interview felt fairly casual. It was a 1:1 interview in a small, quiet room. The woman who interviewed me was very nice, felt like we were having a conversation. It was a good experience, not nerve wracking at all. After the interview, she scheduled for me to do a job shadow at one of the units, after the shadow she asked how I liked it and then offered me a position there.", "Interview Questions": "What experience do you have working with kids? "}, {"date": "5 Dec 2018", "title": "Awake Overnight Skills Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Trillium Family Services", "Interview Descriptions": "They are looking for a specific type of person to be on their team. One that can stay awake Overnight easily, wants to work with kids, can connect easily to clients, is able to take a lot of unordinary stress and maintain composure throughout. The interview process is typically done with the manager you’ll be working directly under. Many interviews even allow you to meet and be asked questions by other Staff. Typically the Staff and Management speak with one another after the interview to decide if you would be a good fit or not.", "Interview Questions": "Are you use to staying awake Overnight?"}], [{"date": "26 Aug 2022", "title": "Skills Trainer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Trillium Family Services in Dec 2018", "Interview Descriptions": "One on one in person interview. Both background and situation questions. Then invited back for a walkthrough interview of the units where you can meet staff and clients. From there you will receive a job offer if they are looking to hire.", "Interview Questions": "Background employment and how that makes you a good fit. "}, {"date": "13 Sept 2019", "title": "Skills Trainer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Trillium Family Services (Corvallis, OR) in Nov 2018", "Interview Descriptions": "Applied online, received a phone call to set up first interview within a week. First interview was basic and with only one supervisor. Received an email within the next couple days to schedule a second “observational interview” which is really just shadowing some current employees. If you make it to this stage you will 99% get a job offer.", "Interview Questions": "Sometimes clients must be restrained, how do you feel about this?"}, {"date": "16 Nov 2018", "title": "Patient Access Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Trillium Family Services (Corvallis, OR) in Nov 2018", "Interview Descriptions": "It was pleasant. There were three people in my interview who all asked questions. They had a sheet of questions, but the interview was really relaxed and all the people were friendly. Over all, it was a good experience.", "Interview Questions": "What is your least favorite thing you do at your current job?"}, {"date": "23 Aug 2019", "title": "Certified Medication Aid Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Trillium Family Services (Portland, OR) in Oct 2017", "Interview Descriptions": "It was brief and overall comforting. After the interview I  was given a tour of the campus and met other members of health services. Breakfast, lunch, and dinner is provided to employees so that was a great incentive, economically, to accept the job offer. There is a lot of open communication and transparency during the interview process and I really appreciated that.", "Interview Questions": "They asked your experience in the mental health field and why you are choosing to work in it. "}, {"date": "9 Mar 2017", "title": "Skills Trainer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Trillium Family Services (Corvallis, OR) in Mar 2017", "Interview Descriptions": "15 minute one on one interview. The interview consisted of a series of questions regarding how I have handled a conflict and a crisis. There was a question about what recreational activities I would take a group of kids to do.", "Interview Questions": "What is your relevant experience and education that qualify you for this job?"}, {"date": "1 Jul 2016", "title": "Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Trillium Family Services (Portland, OR)", "Interview Descriptions": "Applied online, then there was a phone screening. Had an in person interview with supervisor. Follow up interview after that. Got the job offer by phone about a week or so later. Overall it was pretty quick for this type of job, which is good.", "Interview Questions": "What are your strengths / weaknesses?"}, {"date": "23 Oct 2016", "title": "Outpatient Child and Family Therapist/School Therapist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Trillium Family Services (Portland, OR) in Jun 2016", "Interview Descriptions": "Was contacted via phone after submitting application. I was still a month or two out from moving to Portland so they let me know while they loved my resume that they were looking to fill the position right away but if they didn't they would call me back. They were true to their word and I received a call a week before I moved to Portland. I met for a one on one interview with site director for a direct interview. One person and me in the room. 2 days later I met for an interview with the site director and the school principle. I was offered the job 2 days after that. The process was fine although a little quick. They were flexible about my start date which I appreciated.", "Interview Questions": "Tell me about a time where your ethics were tested and what did you do?"}, {"date": "27 Oct 2015", "title": "Skills Trainer (Wake Robin School) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Trillium Family Services (Salem, OR) in Sept 2015", "Interview Descriptions": "I applied by email and was interviewed in the school a few days later. I was told that the interview would include some classroom observation. I was interviewed by two people, and though they seemed nice, I didn't get the vibe that they were happy to be doing what they were doing, or happy to be interviewing me. After the interview portion, I was given a brief tour, and sent to the classrooms for observation. I was surprised that the interviewers didn't stay to observe me, but I was observing the classroom dynamics. I heard back a little over one week later.", "Interview Questions": "Why do you want to work here?"}, {"date": "25 May 2015", "title": "Skill Trainers Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Trillium Family Services (Portland, OR) in May 2015", "Interview Descriptions": "They called me for an interview within the same day. A lot of questions about personal experience and situational responses. I was also allowed to ask as many questions as I wanted. I enjoyed it.", "Interview Questions": "describe one time you were in crisis and how did you resolve it."}, {"date": "10 Jun 2015", "title": "Residential Skills Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Trillium Family Services (Corvallis, OR) in Mar 2015", "Interview Descriptions": "The interview has three people interviewing you and then if you are asked back you have to four hour shift interacting with kids. The questions were interesting, I felt the best thing was to share a personal story to help. Also, when having four hour shift, make sure to ask the other staff members questions. This will help you in the long run. It will also be to help connect with others.", "Interview Questions": "What experience can you bring?"}], [{"date": "28 Dec 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Trillium Family Services (Portland, OR) in Nov 2014", "Interview Descriptions": "Group interview with nursing director and assistant director. Interview took about one hour, I did most of the talking. talked about my background, my experience. they seemed to assess to what extent I knew what to expect working in residential care.", "Interview Questions": "Many questions about ethics"}, {"date": "14 Sept 2015", "title": "Skills Trainer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Trillium Family Services (Corvallis, OR) in Nov 2014", "Interview Descriptions": "Met with interviewer for about 15 minutes and then did two shadow shifts at a couple different units as part of the interview process. Later talked to two supervisors about which unit i would like to work at and why. Was told that the one I wanted wasn't an option and was asked to revisit the unit I had turned down. After agreeing to work at that unit was hired.", "Interview Questions": "Why do you want to work here?"}, {"date": "25 Jun 2016", "title": "Prevention Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Trillium Family Services (Corvallis, OR) in Jun 2014", "Interview Descriptions": "I submitted an application on line with my resume and I completed an assessment, treatment plan and diagnosis from a case study.  Next, I was selected to move forward with a phone interview. After this I had a one on one interview with the supervisor and she shared the company expectations and how I would be trained.  She then said I was a good fit, but she would have to present her findings to the hiring committee and check my references before she gave me an offer of employment.  Later that evening I received a call and was given an offer of a yearly salary with benefits.  I accepted and then went through a training program to become familiar with the documentation soft ware.", "Interview Questions": "They asked me if I used evidence based interventions."}, {"date": "28 Jul 2015", "title": "Entry Level Overnight Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Trillium Family Services (Corvallis, OR) in Jan 2013", "Interview Descriptions": "Fairly straightforward interview. Pretty laid-back process. The two interviewers were college aged team leaders, and it was all pretty comfortable. Allowed for time to ask questions about the job. Gave a quick tour of the facility. Also required to spend a shift shadowing a team member.", "Interview Questions": "Why do you want to work here?"}]]