[[{"date": "5 Jan 2023", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Northern Iowa", "Interview Descriptions": "you will be in the interview with other ambassadors and they want gauge how diversified your experiences are in the college and outside. Dress to impress and you'll do great", "Interview Questions": "Tell us about your self"}, {"date": "30 Apr 2023", "title": "Information Technology Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Northern Iowa (Cedar Falls, IA) in Jul 2021", "Interview Descriptions": "Only got through a screener e-mail and initial introductions as I cut the interview short after they advised me that the max they were willing to pay wasn't even sniffing the mid point of the advertised salary range.", "Interview Questions": "Is this salary range OK?"}, {"date": "10 Feb 2021", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Northern Iowa", "Interview Descriptions": "Pretty easy in interviews due to need in student work. They love it if you have work study so fill out fasfa. If you show up, you'll keep your job.", "Interview Questions": "What do you like about the University?"}, {"date": "19 Aug 2020", "title": "Womens Assistant Tennis Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Northern Iowa", "Interview Descriptions": "Phone Interview to start. Asked basic questions about experience probably to weed out those that were lying on their resume and to get a better feel for personality. Then in person interview, pretty standard, straight to the point, not any fluff questions.", "Interview Questions": "Q: What specialty could you bring to this position?"}, {"date": "17 Feb 2020", "title": "Dock Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at University of Northern Iowa (Cedar Falls, IA) in Nov 2019", "Interview Descriptions": "This was very relaxed and easy. Came in and just had conversations mixed with questions. Managers are extremely nice and helpful. Probably my favorite to work with ever. I would strongly recommend them.", "Interview Questions": "Are you introverted or extroverted "}, {"date": "1 May 2019", "title": "Interviewer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Northern Iowa (Cedar Falls, IA) in Sept 2015", "Interview Descriptions": "Basic interview that you would normally expect in any college job. (Now I’m just write to meet the minimum word requirement because that is pointless and I don’t know what else to say. It’s a college job.)", "Interview Questions": "Why do you want to work here?"}, {"date": "4 Dec 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at University of Northern Iowa (Cedar Falls, IA) in Jan 2015", "Interview Descriptions": "Very nice and courteous. Very friendly. The recruiter asked me a few question on my background, what I am expecting from the job, explained how things work at the office.", "Interview Questions": "Experience, Motivation, etc"}, {"date": "4 Oct 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Northern Iowa", "Interview Descriptions": "Great interview process, it concludes of 2 rounds, 1 behavior, 1 social. In the behavior, you got to walk around several tables for different buildings. Here you got a chance to talk to the RLC as well as answer their questions", "Interview Questions": "How you balance your life, how do you define ethnicity"}, {"date": "21 Jul 2015", "title": "Athletics Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at University of Northern Iowa (Cedar Falls, IA) in May 2014", "Interview Descriptions": "The interview process is very simply and stress free.  The interviewers are also very helpful with any question you have.  I had to fill out an application with my resume and a cover letter.  Then you got an email saying if you got an interview or not and selected a time to meet with them.  You had the interview and they called within a week to let you know if you got the position.", "Interview Questions": "They asked a lot of scenario questions.  What would you do if you were handing out free t-shirts for students only and a general admission wanted one and was upset you wouldn't given him one."}, {"date": "9 Mar 2017", "title": "Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at University of Northern Iowa (Cedar Falls, IA) in Jul 2013", "Interview Descriptions": "Interview was with a committee of 5 ! Could be very intimidating to someone who is nervous about interviewing each person had a list of questions that seemed to be very thought processing they were very courteous ! When I was on interview committee I always took in consideration the experience I had", "Interview Questions": "What makes a good cook?"}], [{"date": "4 Oct 2015", "title": "Forensic Interviewer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Northern Iowa (Hiawatha, IA) in Jun 2012", "Interview Descriptions": "I had an initial phone screening interview by the manager of the center. I was then asked to come in for an in-person interview with the manager and supervisor of forensic interviewers. I was then asked to participate in an in-person HR interview and then a group interview with the three other forensic interviewers I would be working with.", "Interview Questions": "How would you cope and/or deal with those involved in a child protection case who had a different opinion of you as to what should happen with the case under investigation?"}, {"date": "2 Jun 2010", "title": "Assistant Professor of Educational Psychology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Northern Iowa (Cedar Falls, IA) in May 2010", "Interview Descriptions": "Contact was made through email. Then I had a one on one interview at AERA. Less then two weeks later I was called for an  on site interview. I drive to Iowa and had scheduled meetings, interviews, and formal presentations. Everyone was very sincere. I felt comfortable asking hard questions about campus and community culture.", "Interview Questions": "What courses would you design for Graduate Students if you had free range to create any course?"}, {"date": "11 Apr 2013", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Northern Iowa (Cedar Falls, IA) in Apr 2009", "Interview Descriptions": "I found out about job through a coworker who knew that this person was retiring.  I contacted the hiring manager by phone and arranged a in-person interview the next day.  I interviewed with 2 people (hiring manager and their assistant).  Interview lasted 1 hr. Questions were about my current impressions of the department and what I would change if given a chance.  After a couple days I was notified that I would meet with two more people. On that day a job offer was extended.", "Interview Questions": "How much sales experience do you have?"}]]