[[{"date": "23 May 2022", "title": "Newborn Hearing Screener Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mary Greeley Medical Center", "Interview Descriptions": "Very good. They asked lots of situation questions and \"what would you do\" questions. They were very kind and interested in my education and experience. They also gave me a tour of the floor I would be working on.", "Interview Questions": "What would you do in this situation."}, {"date": "3 May 2022", "title": "Front Desk Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mary Greeley Medical Center (Ames, IA)", "Interview Descriptions": "Very thorough interview process. Phone, one on one, and then with a panel of people. That is all I have to say, but glass door requires a 30-word minimum, so I have to keep typing because otherwise, I cant research companies I'm interested in working at which is really dumb.", "Interview Questions": "They asked a lot of scenario-based questions "}, {"date": "2 May 2022", "title": "RN Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mary Greeley Medical Center (Ames, IA) in Mar 2022", "Interview Descriptions": "Interview process was fairly easy. Completed my application and was called in a few day, completed phone screen and scheduled an in-person interview. Met with RN Manager and felt very comfortable. Scheduled a job shadow session of 2-3 hours to see floor and workload. Also had a peer interview with 3 RNs on the floor at that time. Was offered position with the week.", "Interview Questions": "What is a time you felt overwhelmed and didn't complete your tasks and how did you respond"}, {"date": "29 Jan 2019", "title": "RN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mary Greeley Medical Center", "Interview Descriptions": "You have an interview with the manager, shadowing, and peer interview. I had a poor experience. It was a very slow moving processs and every time the manager told me she was going to contact me on a certain day it wasn’t until a week later that she usually contacted me", "Interview Questions": "What are some acceptable and unacceptable reasons for being late."}, {"date": "5 Feb 2018", "title": "Director Human Resources Education Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Mary Greeley Medical Center", "Interview Descriptions": "Did not complete the application process. All the disclosures and intrusive questioning for credit and criminal checks started the intense feeling they distrust everyone who applies and works for them.  I am retired military, have great credit, no criminal activity ever and highly qualified for the job, but felt like a criminal and distrusted by the time I got midway through that I abandoned the application.  They need to fix the application process so people don't feel like criminals.  I understand wanting to get everything up front so it speeds up the process for the one who is selected to give an offer, but ease up until you are ready to make an offer.", "Interview Questions": "permission to run credit and criminal background checks"}, {"date": "29 Sept 2017", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Mary Greeley Medical Center (Ames, IA) in Mar 2017", "Interview Descriptions": "There are three interviews in the process. The first is with an HE representative and is used to screen out the people who have disqualifying factors in their history. The second interview is with the department director and the manager. The third is with a panel of 3 to 4 of your prospective peers.", "Interview Questions": "Tell us about a time of conflict in your current or past workplace and how you handled the conflict."}, {"date": "17 Jun 2019", "title": "Patient Transporter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Mary Greeley Medical Center (Ames, IA) in Jan 2017", "Interview Descriptions": "After implying got called to go phone interview. Then couple days later interviews with the guest services director and also did a peer interview that same day. Got the job a few days later. Pretty smooth and simple.", "Interview Questions": "Tell me about a time you had conflict and how you handled it."}, {"date": "10 Oct 2016", "title": "Dietary Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Mary Greeley Medical Center (Ames, IA) in Mar 2015", "Interview Descriptions": "I had to interview through manpower where they basically answered all the questions for me by looking at my resume. They then gave the ok to Mary Greeley to hire me. From there I met with the managers where they just wanted to have a conversation with me. Asked me about the job description. Right after that I had a peer interview where I met with 3-4 employees I'd be working with and they asked me behavioral questions. Then they decide to hire you or not. They DO drug test.", "Interview Questions": "If you worked in a group with one person not contributing. How did you handle it."}, {"date": "14 Feb 2015", "title": "Patient Transport Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mary Greeley Medical Center", "Interview Descriptions": "After applying online, I got a call within a week to set up an interview. There were a total of 3 interviews, one with HR, the hiriing manager and a peer interview. After about a week of waiting, I got a call that I got the job. Overall, the process was very smooth and easy", "Interview Questions": "Can you describe a time where you had to step up and become a team leader?"}, {"date": "12 May 2015", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mary Greeley Medical Center (Ames, IA) in Apr 2012", "Interview Descriptions": "It was a short interview with two people.   There were not many questions asked, they seemed fairy unprepared. Make sure you look up the company website and look at the core values and such. The whole interview process took about two weeks, and the training was paid and that took a week. The training was great, it did help you prepare for the job, I felt very confident my first day.  The training process is long but worth it, because you will know what you are doing when you start.", "Interview Questions": "Why do you want to work here?"}]]