[[{"date": "24 Jul 2023", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at StepChange Debt Charity (Glasgow, Scotland) in Jul 2023", "Interview Descriptions": "Very quick, informative, friendly and supportive when applying for the job. Everyone answered all my questions with detailed information and I found the entire interview process very welcoming. Looking forward to starting in the role asap.", "Interview Questions": "Tell me about a time i worked under pressure?"}, {"date": "19 Jun 2023", "title": "Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at StepChange Debt Charity (Leeds, England)", "Interview Descriptions": "Well done and relaxing did feel at ease with who interviewed me they were kind and helpful The manager was great and I really enjoyed meeting her Would recommend going", "Interview Questions": "Work history Goals Aspirations How can I do the job to the best of my ability"}, {"date": "19 May 2023", "title": "Debt Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at StepChange Debt Charity (Newcastle upon Tyne, England) in May 2023", "Interview Descriptions": "Telephone interview which was fine and went very well, followed by face-to-face interview within a week. My impressions of the company were favourable after the telephone interview, but definitely not after the face-to-face.", "Interview Questions": "How are you with using computer systems? (!)"}, {"date": "23 Feb 2023", "title": "Case Handler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at StepChange Debt Charity in Feb 2023", "Interview Descriptions": "CV/application form. First telephone interview took 30 minutes. Questions about my previous employment history and talked about the role. Final telephone interview. Gave me scenarios and asked how I would react in them.", "Interview Questions": "Why do I want the job."}, {"date": "6 Feb 2023", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at StepChange Debt Charity (Glasgow, Scotland) in Feb 2023", "Interview Descriptions": "Had the option of choosing face-to-face or video interview, I chose to do a face-to-face interview. Process was simple, answered some generic questions and got to ask questions of my own. A really smooth process and received result of interview today. My interview was on Friday.", "Interview Questions": "Q: What do you know about StepChange?"}, {"date": "23 Sept 2022", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at StepChange Debt Charity (Ellesmere Port, England) in Sept 2022", "Interview Descriptions": "There were two stages to interview. First a phone interview with the recruiter which if successful they book you an online interview on Microsoft teams with people from the office applying for.", "Interview Questions": "If a client told you they were reducing their food bill dramatically to be able to clear their debt faster how would you influence them to reconsider and increase their food budget"}, {"date": "24 Sept 2022", "title": "Customer Service Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at StepChange Debt Charity (Leeds, South East England, England) in Sept 2022", "Interview Descriptions": "I had a telephone interview with Recruitment (Anna) which was really informative and friendly. The questions were set just right to be thought provoking and ensured I was able to provide evidence of my skills and previous experience.\r\n\r\nAnna advised I had passed phase one and set an agreed date for my video interview with two Team Leaders.\r\n\r\nOn joining the meeting, I immediately knew I was going to enjoy the experience. Both Karen and Jenny were lovely and the pace of the questions was perfect. My only regret which I was not able to correct, was the feedback on my audio which was echoey. However, we muddled through and I felt the interview went really well.  I was encouraged to ask questions, which I did.", "Interview Questions": "How do I manage my own well being after a difficult and emotional client"}, {"date": "29 Jul 2022", "title": "Correspondence Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in Jul 2022", "Interview Descriptions": "I had a telephone interview on the Tuesday then was invited to a video interview the following week. I got a phone call the same day as the video interview and was offered the position. The whole process was professional, relaxed and friendly", "Interview Questions": "Tell me how you would deal with a difficult customer?"}, {"date": "18 May 2022", "title": "Customer Service Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at StepChange Debt Charity in May 2022", "Interview Descriptions": "Recruitment team were all really nice yet professional. I was offered feedback after interviews which is helpful. Telephone interview followed by a more formal interview on teams, both really smooth and the interviewers put me at ease.", "Interview Questions": "Talk about a time you dealt with a vulnerable client/customer \r\n\r\nHow do you adapt to change \r\n\r\nWhat are your transferable skills"}, {"date": "6 Jun 2022", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at StepChange Debt Charity in May 2022", "Interview Descriptions": "The interview process involves an initial telephone interview which was excellent with the interviewer putting me as ease. Following this was a more formal interview over Microsoft teams. Again I was put at ease. This interview consisted of questions around my cv  and competency based questions.\r\nI found the process good with excellent communication throughout.", "Interview Questions": "I was asked general questions about my previous work roles and what skills I have gained that could be of advantage in this role."}], [{"date": "11 May 2022", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at StepChange Debt Charity (Newcastle upon Tyne, England) in May 2022", "Interview Descriptions": "I really enjoyed talking to the lovely people at step change. I was very pleased in how he interview was conducted, it shows what brilliant people you have working there.", "Interview Questions": "Asking about how I would deal with a potential client."}, {"date": "6 Jun 2022", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at StepChange Debt Charity (Leeds, England) in May 2022", "Interview Descriptions": "Samantha and Mark were really lovely in the interview. They asked questions which were relevant to the role and made the interview process really good and comfortable. They give a really good first impression of Step Change.", "Interview Questions": "Describe your current role and responsibilities and what you can bring to us."}, {"date": "18 Apr 2022", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at StepChange Debt Charity", "Interview Descriptions": "Very enjoyable process with clear and concise information given by the Employer. \r\nFriendly and helpful people involved in all stages of the process which made me feel valued and that I mattered.", "Interview Questions": "What transferable skills do you have?"}, {"date": "18 Apr 2022", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at StepChange Debt Charity", "Interview Descriptions": "Very enjoyable process with clear and concise information given by the Employer. \r\nFriendly and helpful people involved in all stages of the process which made me feel valued and that I mattered.", "Interview Questions": "What transferable skills do you have?"}, {"date": "22 Apr 2022", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at StepChange Debt Charity (Leeds, England) in Apr 2022", "Interview Descriptions": "I applied online, I got invited to a telephone interview the same day, then invited to video interview a couple days later and got offered the job the next day.", "Interview Questions": "Describe a time when you have dealt with a vulnerable customer."}, {"date": "11 Apr 2022", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at StepChange Debt Charity in Apr 2022", "Interview Descriptions": "Application form. \r\nTelephone interview. \r\nOnline tests. \r\nOn line interview via Teams. \r\n\r\nWhole process was effective, professional and the turn around time impressive. \r\n\r\nThe process was made enjoyable by the HR recruitment staff very impressive.", "Interview Questions": "Dealing with difficult situations and clients with potential anxiety matters. "}, {"date": "6 Sept 2022", "title": "CUSTOMER SERVICE DEBT ADVISOR Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at StepChange Debt Charity (Leeds, England) in Apr 2022", "Interview Descriptions": "The interview process was very pleasant, not too formal, I  was asked specific questions, and was made to feel at ease at all stages of the interview over Teams on my lap top.", "Interview Questions": "Why did you you choose StepChange as your preferred employer?"}, {"date": "24 Mar 2022", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at StepChange Debt Charity in Mar 2022", "Interview Descriptions": "I was interviewed by Matt & Andrea online I was a little nervous at first but both made me feel relaxed and took the time to explain the questions and listened to what I had to say . Both seemed excited to work for Step Change and spoke with fondness about their roles and what it could be like working for the company", "Interview Questions": "Tell us about a time you dealt with an upset or angry customet"}, {"date": "25 Aug 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at StepChange Debt Charity", "Interview Descriptions": "Teams interview.\nFeedback was never given, emailed to say I was not successful and requested specific feedback, was told I would receive it and it never happened. Poor company standards.", "Interview Questions": "Tell me about a time when you dealt with difficult people"}, {"date": "22 Dec 2020", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at StepChange Debt Charity", "Interview Descriptions": "The interview was carried out via Zoom, unfortunately the two of the interviewers were called away so the people I was expecting did not attend and I was left with stand-ins.", "Interview Questions": "How do you handle conflict"}], [{"date": "3 Dec 2020", "title": "Debt Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at StepChange Debt Charity", "Interview Descriptions": "Telephone interview following online tests.  Many standard questions but didn't think I was given enough chance to talk about my experience in the field and how this would relate to the role I was interviewing for - quite rushed.", "Interview Questions": "How to handle vulnerable/distressed clients"}, {"date": "26 Jan 2021", "title": "Debt Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at StepChange Debt Charity in Dec 2020", "Interview Descriptions": "Sent my application in November and got the telephone screening pretty quickly, the woman on the phone said she was referring me for the interview based on this. Had an online interview in December and they said they were conscious of my notice period at my current job so wanted to get it done ASAP (sounds promising right?), had the online interview  and I felt it was very positive and they said I would hear back within 10 working days. When I hadn’t heard back I gave it a little while longer due to Christmas etc. Had to chase it up twice via the recruitment email address only to be told all hiring was now cancelled.", "Interview Questions": "After a difficult call how would you make sure you are ready to handle the next call?"}, {"date": "5 Nov 2020", "title": "Debt Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at StepChange Debt Charity (Newcastle upon Tyne, England) in Nov 2020", "Interview Descriptions": "Lasted 43 minutes which confused me a bit because it was only the 'get to know you' part and not the 3rd , extended part. Overall, the recruiter was kind, talkative and made me feel confortable.", "Interview Questions": "Why should we hire you?"}, {"date": "21 Oct 2020", "title": "Welfare Rights Adviser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at StepChange Debt Charity", "Interview Descriptions": "Applied online with CV and written statement how you match the job description.  I then had a 30 min telephone interview.  If I were to pass the telephone interview I would be asked to do an online interview via Microsoft Teams.", "Interview Questions": "Why do you want to work for Stepchange and what do you know about us? Then competency questions (STAR method):  1.  Tell me a time when you helped a desperate client?  2.  Explain when you have used Active listening and what are your questioning skills?  3.  Describe a time where you had to analyse information?  and finally - How do you keep up with current welfare rights legislation? "}, {"date": "9 Dec 2020", "title": "Debt Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in Oct 2020", "Interview Descriptions": "Online application including some questions on why you want to work for Stepchange and what skills you can bring to the role, followed by a telephone interview with similar questions. I was told at the end of the interview that I had passed onto the final stage which was a video interview with a manager and a note taker. Video interview was straight forward, much more in depth questions about my experience and resilience for the role. I was told I would hear back within 5 days whether I had been successful or not, and was promised that even if I wasn't successful I would still hear back - I never did, found out that I didn't get the job by logging onto the careers portal and seeing that the status of my application had changed to 'unsuccessful interview'. I finished the interview feeling like I'd done really well, and I thought the process was going really well until they didn't even bother to let me know the outcome of the interview, the feedback would have been really useful to know where I'd gone wrong since I felt like I'd done a good job!", "Interview Questions": "What skills do you think you can bring to this role?"}, {"date": "21 Oct 2020", "title": "Data Verifier Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at StepChange Debt Charity (Birmingham, England) in Oct 2020", "Interview Descriptions": "Applied for the data verifier position in Birmingham and received a telephone interview confirmation email a couple of days later. The telephone interview was a casual conversation revolving around my CV, discussing the job role in depth, and answering work related questions. Interview lasted around 25 minutes.\r\n\r\nTelephone interview questions:\r\nAre you currently employed or furloughed?\r\nWhat have I been doing during my time off employment?\r\nDo you have any holidays booked soon?\r\nAny criminal convictions?\r\nWhy do you want to work for us?\r\nWhat do you know about the job role?\r\nWhat do you know about the company?\r\nTell me about a time you were able to handle a repetitive workload?\r\nTell me about a time you used your attention to detail?\r\n\r\nIf the recruiter is impressed with your overall experience she will let you know that she will move you onto the next stage of the process which will be a face to face interview with two managers/team leaders. The interview will be done from home and you have to use Microsoft Teams to do the interview. The video interview will last an hour and a half (90 minutes but could be less) and it will be with two team leaders (one asks you questions and the other makes notes). After the 30 minute interview, you will have the Maths test and attention to detail test. These will last about 30 minutes. \r\n\r\nVirtual face to face interview – Lasts 90 minutes\r\nFirst part – Interview\r\nYou need to have Microsoft Teams to do a video interview with the team leaders\r\n1 interviewer (who is also a team leader) will ask you questions and the other team leader will make notes.\r\nVideo interview lasts 30 minutes and then that interviewer will leave.\r\n\r\nSecond part – Maths test and attention to detail test\r\nOnce the interviewer leaves, the other team leader will place the question sheet on the screen for you to see and will give you half an hour to complete both activities.\r\nDue to covid, you need to print out the two documents which you will need to refer to when answering all the questions. So make sure you have them!\r\nMake sure you have a pen and paper to jot down your calculations and answers because once the 30 minutes is finished, the team leader will tell you to give her the answers and she will type them on the question paper.\r\nOnce the test is done, you finish and then she will let you know that you will receive the outcome within 5 working days).\r\n\r\nIt was a very simply process from applying to the last stage of the interview.", "Interview Questions": "What do you know about the company?\r\n"}, {"date": "22 Oct 2020", "title": "Debt Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at StepChange Debt Charity (Newcastle upon Tyne, England) in Oct 2020", "Interview Descriptions": "Telephone interview then face to face / teams call. Process was quick, phone interview heard back the same day, 2 days for teams meeting interview to hear back. Looking for very specific answers to every question asked. Even with financial assist/collections/debt advisor background.", "Interview Questions": "If someone calls and their priority is paying off their debt as quickly as possible but they aren’t spending enough on food, how do you persuade them to spend more on food and less towards their debt"}, {"date": "25 Aug 2020", "title": "Dro Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at StepChange Debt Charity (Leeds, England)", "Interview Descriptions": "Initially over the phone then two interviews in the offices one as a group which took far too long and a one on one interview although there were actually three interviewers who were quite cold. It wasn't a good experience at any point.", "Interview Questions": "The typical, unhelpful STAR competency questions "}, {"date": "13 Aug 2020", "title": "Debt Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in Aug 2020", "Interview Descriptions": "Very long interview process for a job that pays very little. Phone interview went great, and HR lady was super professional and provided feedback. Video face to face interview was a lot less professional and both managers seemed bored and disinterested from start. After going through their lengthily recruitment process I didn't  get an offer but its probably a good thing as reviews on Glassdoor are awful.", "Interview Questions": "what do you know about Stepchange"}], [{"date": "8 Jul 2020", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at StepChange Debt Charity in Jun 2020", "Interview Descriptions": "Phone interview. lasted about 30 mins. Was quite friendly and laid back but asked a lot of questions re why step change/ give an example of a time when you actively listened/ tell us what you know about the charity and the work we do/ questions about emotional resilience", "Interview Questions": "Why step change?"}, {"date": "6 May 2021", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in Apr 2020", "Interview Descriptions": "I completed form online followed by a telephone interview. Then I was put forward for a  face to face  interview which was over teams due to COVID pandemic. Make sure you use STAR when answering. The interviewers were friendly and put me at ease.", "Interview Questions": "How to maintain resilience. How to deal with difficult customers. Example of team work"}, {"date": "13 Feb 2020", "title": "Data Entry Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at StepChange Debt Charity (Leeds, England)", "Interview Descriptions": "So far I've done a telephone interview, I was asked about 2 questions about the company, 1 about what I know about the job and what it involves. And the I was asked about 3-4 competancy based questions.", "Interview Questions": "Why do I want to work for StepChange? What do I know about the company? \r\nWhen I helped someone through a difficult time?\r\nWhen I did/didn't show attention to detail?\r\nWhen I did/didn't meet a target?"}, {"date": "9 Mar 2020", "title": "Team Leader Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at StepChange Debt Charity (Halifax, England) in Feb 2020", "Interview Descriptions": "Quick and easy from CV application to their own  online Application process. Quick contact for interview.  I was offered the role and would have gone for it if I hadn’t had a better one elsewhere. Genuinely seems a  great place to work with friendly and upbeat atmosphere. An obviously very morally driven charity/business to work for with a clear goal.", "Interview Questions": "When have you lead a team through a difficult time/challenge? \r\nTell me a time you have delivered a difficult message?\r\nTell me what kind of leader you are ?"}, {"date": "13 Sept 2019", "title": "Customer Service Adviser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at StepChange Debt Charity (Halifax, England) in Sept 2019", "Interview Descriptions": "The interview went smoothly just asking general questions re previous job and reasons for leaving then competency interview followed by half an hour of maths questions it has the formulas written down", "Interview Questions": "Why do you want to join stepchange "}, {"date": "7 Sept 2019", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in Sept 2019", "Interview Descriptions": "interviewer was coughing their lungs up and had a team leader with no experience in interviewing, interview me. Then they have a personality test if you're not and activist or theo in there test they will fire you if youre not a robot and follow there every command", "Interview Questions": "Which shift pattern do you want ? oh wait theres only this one"}, {"date": "27 May 2019", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at StepChange Debt Charity", "Interview Descriptions": "Quite a straight forward interview but the 6 week academy is really hard work. You need to make sure you really want to learn these skills. Nearly everyone gets through it but it is tough.", "Interview Questions": "Why StepChange?"}, {"date": "14 May 2019", "title": "Debt Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at StepChange Debt Charity in May 2019", "Interview Descriptions": "First you apply online via their online portal and fill in some boxes asking about what makes you suitable for the role. \r\n\r\nIf successful you receive an email asking you to book the appropriate time for a telephone interview. \r\n\r\nThe telephone interview has a 30 minute slot  (mine took only half that time) asking basic interview questions. \r\n\r\nIf successful at the telephone interview you are then sent a email to book a face to face interview with them. \r\n\r\nA day before the interview I was called by recruitment and advised all the positions were now taken, despite this they encouraged me to still attend as there would be future roles opening up. \r\n\r\nThe face to face interview can take up 3hrs. (Again mine took half that) \r\nThere was also a basic maths test and a calculator was provided. \r\nIn preparation I recommend studying averages , familiarising yourself with mathematic equations involving division, and learning terms involving wages if you aren't familiar with them.", "Interview Questions": "(Telephone ) What do you know about the company?"}, {"date": "26 Apr 2019", "title": "Correspondence Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at StepChange Debt Charity", "Interview Descriptions": "45 min assessment and interview. 3 stages in the assesment. Fairly straightforward admin stuff with obvious tricks to catch. Interview was friendly enough with one person note taking and the other asking the questions.", "Interview Questions": "How can we help you in the role"}, {"date": "29 May 2023", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at StepChange Debt Charity (Leeds, England) in Feb 2019", "Interview Descriptions": "quite easy but there is a group interview I would recommend you to speak a little but not too much, don't be overbearing. There is an question answer part where they will ask you to describbe your own experiences specifically when dealing with vulnerable cases.", "Interview Questions": "what expeience have you had dealing with vulnerable customers"}], [{"date": "22 Jan 2019", "title": "Digital Advisor/Email Responder Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in Jan 2019", "Interview Descriptions": "30 minute telephone interview where they ask what you know about the company, then a face to face interview that lasts about 60-90 minutes. Also had to do a 15 minute email task where you have to pretend to reply to a client email.", "Interview Questions": "Can you think of a time you've worked under pressure "}, {"date": "27 Jan 2019", "title": "Debt Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at StepChange Debt Charity (Chester, England) in Dec 2018", "Interview Descriptions": "Initial application online followed by phone interview then invited to face to face interview with 2 managers. After the interview I had to complete a maths test which I was given a calculator for. 2 week wait to hear if got the job.", "Interview Questions": "How would you deal with a difficult person/situation"}, {"date": "17 May 2018", "title": "Debt Advisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at StepChange Debt Charity", "Interview Descriptions": "I had a face to face interview last Wednesday 9th May but I still haven’t heard anything I was wondering do they let you know either way as there is no contact number for them and they never reply to their recruitment email", "Interview Questions": "They asked questions such as what’s the biggest risk in the world at the moment and what would you do if you were in power "}, {"date": "17 May 2018", "title": "Debt Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in May 2018", "Interview Descriptions": "Poor experience. Not heard from them for over a week. Rude and not welcoming. I've tried to contact them but no one ever gets back to you. Not a good impression", "Interview Questions": "Stupid questions about the biggest problem in the World right now..."}, {"date": "17 May 2018", "title": "Data Verifier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in May 2018", "Interview Descriptions": "Telephone interview, then onsite assessment and face to face. Have to use their careers website to access application and arrange  meetings/references. Straight forward process but it looks like they are taking on a lot of people in one go.", "Interview Questions": "standard competency based questions, good customer service, when have you worked as part a team"}, {"date": "25 May 2018", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at StepChange Debt Charity (Halifax, England) in May 2018", "Interview Descriptions": "A 20 minute phone interview where the interviewer asked what you knew about stepchange and what you currently did followed by a face to face interview which were mostly scenario based questions and a maths test.", "Interview Questions": "Tell me a time you dealt with a challenging customer."}, {"date": "17 Jan 2020", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in Mar 2018", "Interview Descriptions": "Completely disorganised very unlikely one person will have the same experience as some else due to the complete lack of regard for professionalism \r\n\r\nAn interview with standard questions (if there’s even anyone available to interview you) and a 30 minutes math test.", "Interview Questions": "If you’re on the phone and a colleague is crying what do you do?"}, {"date": "11 May 2022", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at StepChange Debt Charity (Leeds, England) in Feb 2018", "Interview Descriptions": "It was a straight forward interview process involving a  group exercise. Overall, it was a pleasant experience and and a goodcompany to work for. Worked with some great colleagues and management was easy going.", "Interview Questions": "Why did you chose stepchange?"}, {"date": "1 Oct 2017", "title": "Debt Adviser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at StepChange Debt Charity in Sept 2017", "Interview Descriptions": "Very professional process, and your kept well informed of what to expect throughout. There were four stages; the initial application, a thirty minute telephone interview, a group interview and maths test, and finally an individual interview. I got to the last interview but nerves got the better of me and I didn't get through.", "Interview Questions": "The questions basically follow the person specification on the job advert, so it's a good idea to familiarise yourself with that."}], [{"date": "16 May 2017", "title": "Debt Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at StepChange Debt Charity (Cardiff, Wales) in May 2017", "Interview Descriptions": "A telephone interview with recruitment which lasts around 20 minutes, followed by a 2 hour assessment centre with recruitment (including a numeracy test), followed by a face to face competency based interview with 2 team leaders.  It was so much time and effort to even get to the interview stage, only to then be emailed a 'thanks but no thanks' with absolutely no feedback at all.  I have extensive experience as a debt collector and customer service advisor, and I felt the interview had gone well. Overall a very draining and disappointing experience. Looking at the reviews about working for step change, maybe I dodged a bullet!  All I would say is if you do not get an offer do not take it to heart, it seems they are looking for a 'face that fits' which mine clearly didn't.", "Interview Questions": "How can I get the best from you as a manager? Give me a time when you went above and beyond for a customer? How do you deal with criticism? Name a time you have been under pressure?"}, {"date": "1 Jun 2017", "title": "Correspondance Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at StepChange Debt Charity (Leeds, England) in May 2017", "Interview Descriptions": "Application and then a short telephone interview. The interviewer wanted to do some quick background questions before going on to the main question. The first question, What do you know about Stepchange? was simple to begin with, I answered the question with everything I knew, however this apparently was not enough. The interviewer asked me what else I knew, to which I responded that this was everything. He then started to explain the charity, practically saying everything I had mentioned. This situation happened a few times and it came across that the interviewer was adamant to prove that I knew nothing about the roles. I felt like I was being set up to fail.", "Interview Questions": "What do you know about Stepchange?"}, {"date": "21 Mar 2017", "title": "Debt Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at StepChange Debt Charity (Chester, England) in Mar 2017", "Interview Descriptions": "The charity has a very selective and long winded recruitment process for a customer service job. It comprises of:\r\n\r\nA telephone Interview - for background and experience based questions\r\nAn assessment day - where you have to engage in a group task and a basic calculation test in a group of around 6 people.\r\nInterview - I got to this stage where I was no longer monitored by a qualified HR person (who I dealt with in the latter two stages) but instead by two amateur team leaders who asked me a bunch of competency based questions and had me do a task where I pretended I was an estate agent on the phone recommending a holiday. \r\n\r\nVery long winded experience and I had spent a lot of time preparing for each step of this recruitment process, consistently demonstrating my skill set and competence in working for a debt charity, only to be emailed a quick \"sorry but we're not furthering your application\" with no feedback whatsoever or a number to chase them up. I spent a lot of time and energy going for this job which is frankly underneath me anyway. If they deem a masters graduate in English with plentiful customer service experience as not good enough, then I don't know who is!\r\n\r\nMy advice is: Instead of letting your inexperienced team leaders make the decisions based on trivial factors (either my face didn't fit in the girl's team or she was intimidated by my skill set), get HR to do the whole process and make the decisions based on what they've seen because they're qualified enough to do so. The charity wonder why their staff turnout is so high? They're choosing the wrong people to work for them.", "Interview Questions": "\"Give us a time where you've delivered exceptional customer service?\"\r\n\r\n\"Give us a time where you have dealt with criticism?\" MEANING: \"It doesn't matter what you say now because we've decided you're not bubbly enough to be in my team but I need to look professional and democratic so I'm just going through the motions. But hey, you're unemployed so you should feel validated that you're here anyway, right?\""}, {"date": "11 Jan 2017", "title": "Debt Advisor - Client Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at StepChange Debt Charity in Jan 2017", "Interview Descriptions": "Applied online before Christmas\nAfter Christmas had a 20 minute telephone interview which I went online and booked my preferred slot.\nAsked questions about what I know about the business and what I could bring to the role.\nPassed the telephone interview and was invited to book a slot for and assesment/interview day.\nInterview day came. Started  off with a brief into about the company and the role. Invited to ask questions.\n30 mins for a numerical test, they provided paper and  a calculator.\nAfter the 30 mins we all went into a face to face interview.\nFirstly talking about my CV and CV question what iv done to date, what skills I have.\n\nThen went on to the competency based questions looking for specific examples using the \nS\nT\nA\nR\nMethod\n\nTill waiting for an offer... only went on the interview today... fingers crossed.", "Interview Questions": "Give a time when you dealt with a challenging customer"}, {"date": "4 Jan 2017", "title": "Data Verifier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at StepChange Debt Charity (Leeds, England)", "Interview Descriptions": "I applied online through there website and was invited to interview by phone. The questions were relevant to job. Another was to explain a time where you have prioritized work and how you have done it", "Interview Questions": "Name one time where you have been under pressure and succeeded at work"}, {"date": "30 May 2018", "title": "Data Verifier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in Jan 2017", "Interview Descriptions": "phone interview to go over whats on your cv, why you want role and relevant experience. Very brief - was then invited to interview a few days later.  At interview 2 tests, one logic - one maths based then 1 on 1 interview with team leader & colleague.", "Interview Questions": "Basic STAR Model- name a time when worked to targets, as a team, overcame difficult situation, responded to feedback etc"}, {"date": "27 Jun 2020", "title": "Data Verifier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in Dec 2016", "Interview Descriptions": "Phone interview which was followed by a face to face interview with a basic maths test.\r\n\r\nThe face to face interview was meant to be a group interview but the other applicants couldn't make the date so I had the interview 1:1", "Interview Questions": "Why would you like to work for StepChange?"}, {"date": "10 May 2016", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at StepChange Debt Charity (Chester, England) in Apr 2016", "Interview Descriptions": "I applied online via the job portal using my CV and a cover letter.\r\n\r\nI was invited for a telephone interview which was average in difficulty and quite laid back/informal. It's more like a chat discussing what you know about the company and why you're applying for the role. It was with one of the team leaders and they made the whole thing feel really positive and less scary than other telephone interviews I have had in the past. The interview went really well and I was invited to the group interview on the phone.\r\n\r\nDuring the group interview you listen to a short presentation about StepChange and they paused often to see if anyone had any questions. I would suggest asking one or two to show some interest in what they are saying. We then moved on to the awkward ice breakers so we all knew each others names etc... After that we had to do a group activity where you organise major worldwide events in order of significance. The point of the challenge is they are all important and its up to you as group to discuss what you all feel should go where. The whole time you are carrying out this activity you are being monitored by the team leaders but in no way did it feel uncomfortable or scary. The group then has to present their order of events back to the team leaders. We then had a maths test which was relatively easy and relevant to the job role, for example you would have to work out the surplus amount a person had after their wages have been spent and how much they can afford to pay off existing debt etc... you have a calculator and they provide really helpful formulas you can use to help you work it out. (Just to mention my group had 7 applicants including myself)\r\n\r\nA week later I was invited back for my one to one interview which involved competency based questions. Again this was with the team leaders, one asked the questions and the other wrote down my answers. They were your usual competency based questions and nothing that caught me off guard. I then had to do a role play telephone call with one of the team leaders. You are given six holiday recommendations and have about 10 - 15 mins to prepare. They then call through to you and you have to ask relevant questions during the call to whittle it down to one holiday recommendation that suits their needs. \r\n\r\nI am waiting to hear if I have gotten the job or not, fingers crossed!!!!", "Interview Questions": "Telephone interview: Tell me about you?"}, {"date": "22 May 2016", "title": "Data Verifier Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 days. I interviewed at StepChange Debt Charity in May 2016", "Interview Descriptions": "I applied for said job and was offered a telephone interview. I chose my preferred date and time and prepared to be called by them, except they didn't call. There was no direct/office number to contact so I called the help line number who gave me a number to call. I spoke to a receptionist who said she'd find out what was going on and call me back but after an hour there was no contact. Eventually I emailed to say how unorganised and unprofessional they were, to which I got a reply saying that it was a computer error which meant they didn't know I had an interview. Suffice to say, I left it at that!", "Interview Questions": "We didn't get to this stage..."}, {"date": "20 Apr 2016", "title": "Data Verifier Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at StepChange Debt Charity (Leeds, England)", "Interview Descriptions": "Applied through their website, called a week or so afterwards for a telephone interview (general questions asked such as right to work in UK, what do you know about the Charity & the role) then invited to an assessment centre which is around 8 people. You'll be asked to complete an easy maths test, asked to look at a variety of fake letters from creditors and asked to find the reference numbers, there's also a group discussion and then you'll be taken away by a team leader and a note taker for an actual interview during the assessment centre.", "Interview Questions": "Name a time you have given great customer service - what was the outcome and what made you want to do it?"}], [{"date": "25 Feb 2016", "title": "Debt Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at StepChange Debt Charity (Newcastle upon Tyne, England) in Feb 2016", "Interview Descriptions": "First you have to send in a personal statement with the online application form. You then get a 20 minute telephone interview, then if successful you invited to a group session. You are given a group task and then are asked individually to do a maths test. If successful you are invited to a face to face interview in which you are asked to describe what work you have done, then a series of competency based questions.", "Interview Questions": "What will I need to do to motivate you if you were on my team?"}, {"date": "13 Mar 2019", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in Oct 2015", "Interview Descriptions": "Starts with a telephone interview followed by an invite to an assessment day where it is comepetency based questions during interview with team leaders, group task based around problem solving and/or customer service and numeracy test.", "Interview Questions": "What do you know about the company?"}, {"date": "11 Jun 2016", "title": "Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at StepChange Debt Charity in Aug 2015", "Interview Descriptions": "Easy web application, informed throughout the process. You could tell the hiring manager not only wanted the correct skills and attributes but were also passionate about the Charity and team fit. While waiting for the interview people who worked there would say hello making me feel really welcome. All documents confirming my contract was sent out at speed and people there to answer any questions I had about start dates etc.", "Interview Questions": "How do you manage and deliver change ?"}, {"date": "22 Mar 2016", "title": "Helpline Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in Jul 2015", "Interview Descriptions": "Online application ,  long wait before been shortlisted for telephone interview which was around 20 minutes long before going to assessment centre where I did a role play call and had a quick meeting with a member of management and was then called back for an hr long competency based interview", "Interview Questions": "Tell me a time when you've dealt with a difficult customer"}, {"date": "13 Jun 2014", "title": "Data Verifier Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in May 2014", "Interview Descriptions": "Filled in a very brief application. Was a text box asking why I wanted to work there. I originally applied for two positions, the first one I really wanted (Debt Advisor iirc) and filled lots of info in that box and didn't even get a rejection letter! Filled in next to nothing in this box and got through to final interview. So perhaps don't waste too much time on that little box!\r\n\r\nThere was an option to upload your CV and covering letter. Though it's optional, do it anyway.\r\n\r\nInvited to a telephone interview. This was brief and basic. Can't remember what questions exactly but your standard, why do you want to work here, what do you know about the role, what are your top three strengths? I answered communication, organisation and compassion.\r\n\r\nInvited to a group interview. Had to work with the entire interview group (8 of us I think around a large table) to figure out in a hypothetical situation which community project would get hypothetical funding. Remember to wear a watch to this! Be seen to actively be time keeping. Remind the group when there is only five minute s remaining, as this will be a time exercise. Also bear in mind the point of the funding - in this case, it was to give back to the community. So I suggested the one which helped the most members of the community. I also suggested we rule out the ones we didn't want. Suggest you take votes and show of hands. Include people who haven't spoken. Don't hog it all, but do sit at the top of the table (power position).\r\n\r\nAt this stage there were also an 'in tray' exercise sort of... But skills based. So basically what you'll be doing in your day to day job. \r\n\r\nThen invited to a competency based interview that was 1:1 but there were actually two interviewing, one did not ask questions, but just wrote your answers down. Make good eye contact with both of these people! Give clear STAR examples. Questions were a range. Remember there was one, a time you had to cope with change and a time that you worked well in a team and a time you improved something.", "Interview Questions": "Tell us about a time that you adapted well to change?"}, {"date": "23 May 2016", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at StepChange Debt Charity (Halifax, England) in Mar 2013", "Interview Descriptions": "A brief introduction by a team leader who clearly has never done a hard days work followed by an \"exam\" any 12 year old can do and finally an interview which is all\r\nAbout how you can work at a call centre", "Interview Questions": "Can you please take the job as people keep leaving ?"}, {"date": "11 Nov 2017", "title": "Debt Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at StepChange Debt Charity (Leeds, England) in Feb 2013", "Interview Descriptions": "Painfully slow and unprofessional. They were unprepared and I had to wait 30 minutes after my scheduled time before the interview started. The interviewer didn't seem to have ever interviewed anyone before and they were more nervous than me", "Interview Questions": "Why do you want the job"}]]