[[{"date": "8 Apr 2016", "title": "Research Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Cibus (San Diego, CA) in Jan 2016", "Interview Descriptions": "I received an email directly from the hiring manager about a month after applying to the position.  We set up a telephone call and he indicated he would like to fly me out to San Diego for an on-site interview.  That interview happened about a month after our initial phone call.  It was about 3 weeks before I heard anything back, but I did eventually get an offer.  I was a little disappointed in the fact that I had given them my current salary ahead of the on-site interview, so I assumed the offer would be competitive to what I was making.  San Diego's cost of living was almost 40% higher than my current location, so I mentioned that was something I was concerned about.  In the end, I had a great interview experience.  The people were knowledgeable, friendly and helpful.  I think the company is doing really cool work, but based on the cost of living, compensation and benefits package it wasn't an offer I was in a position to accept.  I understand as a small company they aren't willing to pay what the big corporations do, but I wish that would have been communicated more directly before the on-site interview.", "Interview Questions": "Tell me about your leadership style.\r\nWhy do you want to work for Cibus?"}, {"date": "4 Aug 2015", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Cibus (San Diego, CA) in Jan 2015", "Interview Descriptions": "First they send me an email to set up a phone interview. Then the call was made by the person that I suppose to work for, not a HR person which I think was great because he knew what he wants and technic vocabulary to go through my resume. The interviewer was very polite, give me plenty of time to talk about my experience, he was very smart to follow the whole conversation and gave a description of the company and position. Great interview!", "Interview Questions": "Asked me for my role in my current job and the dynamic of everyday work plus more details about my resume."}], []]