[[{"date": "14 Dec 2022", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Houston Healthcare in Oct 2022", "Interview Descriptions": "I would not call it an interview, more of a conversation. They just explained position and benefits. Talked with pair of HR employees for 10-15 minutes. Very easy going and stress free.", "Interview Questions": "They didn't ask any formal interview questions. It was very casual."}, {"date": "14 Aug 2019", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Houston Healthcare", "Interview Descriptions": "Three friendly  interviewers with easy basic questions. I got the impression the interview was a formality only. Waiting in the single chair in the long hall outside the interview room was the hardest part of the process.", "Interview Questions": "How would you handle working with a coworker you didn't get along with?"}, {"date": "4 Jul 2019", "title": "Scheduler Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Houston Healthcare", "Interview Descriptions": "I arrived at Houston Healthcare Pavilion,  there was a panel interview of four women. Everyone was nice and .welcoming the interview almost flowed like a conversation. This was only a week ago, so I still have my fingers crossed!", "Interview Questions": "How do I handle working with coworkers that I do now like/get along with?"}, {"date": "11 Apr 2018", "title": "Applications Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Houston Healthcare", "Interview Descriptions": "The interview was quick and easy. Asked about previous experience with different types of technologies and didn't exactly feel like an application developer interview. It lasted about 5 minutes and was conducted by a panel. They went around the table asking about 2-3 questions each.", "Interview Questions": "Why do you want to work here?"}, {"date": "6 Nov 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Houston Healthcare", "Interview Descriptions": "About a week after applying, I received a call from the nursing hiring services to schedule my interview. We scheduled for the following week. The intervew went smoothly and every staff member i came in contact wished me luck. \n\nThe interview itself was fairly straight forward.", "Interview Questions": "what is your end goal?"}, {"date": "23 Dec 2016", "title": "Systems Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Houston Healthcare", "Interview Descriptions": "The interview was very laid back and comfortable. I was interviewed by Doug, Derek, and Dave and I was able to answer all of their questions without getting the slightest bit of discomfort.", "Interview Questions": "Technology is a huge part of this job position; what is it that you do outside of the work place to stay on top of your game with tech?"}, {"date": "3 Nov 2015", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Houston Healthcare (Warner Robins, GA) in Oct 2014", "Interview Descriptions": "The interview process what resourceful.  Three panel interviewers who asked questions that were vital to the position I applied for.  They were clear as to what they would offer with desired employment.", "Interview Questions": "How do you handle conflict?"}, {"date": "21 May 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Houston Healthcare in Jan 2013", "Interview Descriptions": "Was called by HR to set up interview. It was a panel interview with several high level administrators. The questions were standard. How have you dealt with a difficult situation recently? Where do you see yourself in five years? What do you think your previous employer would say about you?", "Interview Questions": "Explain in a succinct manner, what is the purpose of the medical record?"}, {"date": "13 Jul 2016", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Houston Healthcare (Warner Robins, GA) in Feb 2012", "Interview Descriptions": "The interview process consisted of a 15-minute phone interview and a face-to-face interview. The phone interview was a very general personality, work ethic, and work experience overview. At the end of the conversation, the hiring manager invited me to an in-person interview. The in-person interview was a little more intense. It lasted about 40 minutes and featured a simple programming test.\r\n\r\nAfter the interview, the company took nearly three months to follow up with me and offer me the position.", "Interview Questions": "Write a SQL query to return all rows within a date range.\r\nWrite a SQL query that joins two tables and returns rows including mismatches.\r\nWrite some C# code that calculates the average for a set of data."}, {"date": "3 Jan 2011", "title": "Registered Nurse Position Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Houston Healthcare (Warner Robins, GA) in Jun 2009", "Interview Descriptions": "1. Picked up an application - would have used an online form but this was my preferred method at that time.\r\n2. Handed the application in a day later and the clerk set up and appointment for an interview.\r\n3. Met with the nurse who worked in Human Resources who did the hiring and who interviewed me.\r\nMy perception is that they are pleasant but somewhat less analytical than I am. I am creative and the culture here seems to be that they have accepted all facts memorized by rote. I was not impressed by the logic of the nurse in Human Resources. Ever meet one of those people that think they know what they are talking about but don't, well that was what this experience was like.", "Interview Questions": "Why did you choose us?"}]]