[[{"date": "20 Apr 2023", "title": "Internal Communications Video Producer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at IAEA (Vienna)", "Interview Descriptions": "They make you jump over so many hurdles during the long interview process, very time consuming. They never came back with an answer, only months later when I wrote them (multiple times) did they say they chose someone else months before. Very disrespectful", "Interview Questions": "What can you tell us about your previous experience at a similar position"}, {"date": "18 Apr 2023", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at IAEA (Vienna) in Apr 2023", "Interview Descriptions": "Was well planned, smooth and to the point. The questions ranged from skill and competency identification, personal background, exposure to the industry and technical experience. There were some open-ended and some leading questions. in 30 mins, the interview covered a wide spectrum of personal and professional traits", "Interview Questions": "How does your previous experience match this job?"}, {"date": "9 Jun 2022", "title": "P3 research support Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at IAEA (Vienna)", "Interview Descriptions": "the interview was handled extremely professionally, was very well organized and efficient. I was given  preparatory material and adequate notice to be able to prepare in advance. I was interviewed by a committee that was very well prepared and had carefully studied my materials.", "Interview Questions": "I was asked technical, some personal  and general questions "}, {"date": "17 Aug 2022", "title": "Communication Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at IAEA (Vienna) in Apr 2022", "Interview Descriptions": "My interview consisted of two stages. The first a test consisting of two questions to be sent within 24 hours. The second by an oral interview with questions related to the skills required for the internship position", "Interview Questions": "Give an example of how you overcame a difficult group situation "}, {"date": "3 Mar 2022", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at IAEA", "Interview Descriptions": "60 minute online written assessment using VidCruiter which consisted of 10 questions each worth 10 points. Then there was also a  competency based interview. which was a structured approach towards asking questions based on previous experiences.", "Interview Questions": "First there was a general part then a more technical section. Almost all questions were formulated to ascertain how one would go about something or certain situations based on past experiences."}, {"date": "31 Jan 2023", "title": "Safeguards Information Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IAEA (Vienna) in Dec 2021", "Interview Descriptions": "No transparency at all. The recruitment processs cancels without notification. Presumably it is a bad custom of international organizations that pre-select candidate(s) already exists always. Good for women to get hired as the director is aiming to make a 50:50 gender ration by 2024.", "Interview Questions": "Introduce yourself within 3 minutes."}, {"date": "20 Jan 2023", "title": "Section Head Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at IAEA (Vienna) in Oct 2021", "Interview Descriptions": "Initial prerecorded video interview with 5 questions related to the position, some technical, some managerial. This is followed by a panel interview with technical experts and the hiring manager. Standard questions are given to all interviewees.", "Interview Questions": "Describe how current regulations can be adapted for small modular reactors for safety and severe accidents."}, {"date": "12 Feb 2021", "title": "Unit Head Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at IAEA (Vienna)", "Interview Descriptions": "Competency-based interview, but also substantive technical questions. Significant preparation required. I'd recommend reading up on how to interview with the IAEA, specifically. Generally speaking, you will need to meet all of the requirements and then some to receive an interview.", "Interview Questions": "I do not feel comfortable disclosing actual interview questions. "}, {"date": "29 Oct 2021", "title": "Associate Finance Officer P1 Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at IAEA in Apr 2019", "Interview Descriptions": "I received an invitation for an interview within 7 days from applying for the role that was limited for 1 year. The interview was planned to be online through the software IAEA uses- SONRU- given the fact the job level was international and regardless of the fact that I was based in Vienna, and hence could attend it personally. I recorded my interview following a thorough preparation. Just after I did it, I noticed in IAEA recruitment portal that this position was cancelled/closed, and exactly the same one yet with a contract for 3 years was advertised. So, instantly I applied for the latter. Never heard back from HR department regarding feedback on my SONRU interview for a 1-year role nor was considered for an exactly the same role yet with a 3-years contract.", "Interview Questions": "Standard technical question regarding key functions of the role."}, {"date": "28 May 2019", "title": "Associate Trainer Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at IAEA (Vienna) in Feb 2019", "Interview Descriptions": "It was in person interview and I had to meet them in an office, it was calm and stressed. Also, very informal with no monitoring. Then I had to wait 3 months to hear anythign back", "Interview Questions": "Why do you want to work for this department?"}], [{"date": "11 Jan 2022", "title": "Laboratory Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 12 months. I interviewed at IAEA (Vienna) in Jan 2018", "Interview Descriptions": "Interview took place in front of 3 interviewers, asking inapropriate question about my political views and making clear my european ethnicity and my gender would be a disadvantage in the interview process.\r\nAlso the one person from HR was 30 minutes late.", "Interview Questions": "You are french, are you a colonialist?"}, {"date": "31 May 2018", "title": "SCIENTIFIC OFFICER Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IAEA (Vienna) in Apr 2017", "Interview Descriptions": "Das Gespräch war sehr klar strukturiert zwischen Personalabteilung, ausschreibender Fachabteilung und einer weiteren als neutrale Stelle. Es wurde nach spezifischen Kenntnissen im relevanten Bereich gefragt. Die Fragen bezogen sich auf meine berufliche Erfahrung und auf die Erwartungen an die Stelle.", "Interview Questions": "Was muß die Nuklearindustrie tun um eine Zukunft zu haben?"}, {"date": "17 Dec 2016", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at IAEA (Vienna) in Dec 2016", "Interview Descriptions": "Applied via the iaea platform. Got a Skype interview invitation in 2 weeks. There were 3 interviewers. The interview lasted for 20 minutes. One person was asking questions, another 2 were observing me and took notes. At the end they contacted me via email and told me I was rejected. They gave me very positive feedback, however. Still didn't explain me why they rejected me.", "Interview Questions": "Introduce yourself briefly. What suitable skills do you think you have for this position ? What challenges you might experience during this internship? How your previous experience may help you to perform better during this internship? What is your plan for the next 5 years?"}, {"date": "23 Aug 2016", "title": "Information Technology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at IAEA (Vienna) in Mar 2016", "Interview Descriptions": "The interview was done using Sonru with pre-prepared questions. Technical Support was given prior to interview; and it was possible to test the Sonru application before starting the interview. During the interview itself, a few minutes were given before you had to answer, and a timer showed up on the screen.", "Interview Questions": "If there is no onboarding process when you get to IAEA , what would be your first actions when you start work"}, {"date": "16 Sept 2013", "title": "Bereichsleiter Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at IAEA", "Interview Descriptions": "Übermittlungszeit-Fragen für weitere Überprüfung der Bewerber (Online).\n \n Eine stundenlange schriftliche Prüfung\n \n Persönliche Vorstellungsgespräche", "Interview Questions": "The questions were very general and I would have expected something more specific. The service management questions were almost non-existent. The written examination was far more difficult and yet somehow easier to answer the questions because they were less about \"me\" and more about \"the work\". The in-person interview was all about getting to know me as the candidate."}, {"date": "20 May 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at IAEA (Vienna) in Mar 2013", "Interview Descriptions": "I applied through their website.  Heard back about six months later.  I had a 40 minute phone call with the manager, and he offered me a 6 month position on the spot.", "Interview Questions": "It was very informal.  Basically asked about my experiences, what they were looking for to complete the project, and if I was interested."}, {"date": "29 Mar 2014", "title": "Supervisory Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 9 months. I interviewed at IAEA in Sept 2012", "Interview Descriptions": "The post was advertised on their website and applications done on their website. After a few months a competency-based interview was done remotely. Then a few months letter a competency-based interview done via video-conferencing.", "Interview Questions": "Since this was competency-based interview all the regular questions were present. At the end  the panel asked whether I had anything to add that would enhance my candidature. The answer I gave should have been more comprehensive."}, {"date": "22 Feb 2012", "title": "Systementwickler Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at IAEA (Vienna) in Dec 2011", "Interview Descriptions": "Es war eine Videokonferenz zwischen mir und fünf weiteren Personen. Drei Techies und zwei HR-Büroleute.", "Interview Questions": "beschreiben Sie die möglichen Gründe, warum ein SSH-Login einmal erfolgreich und ein anderes Mal erfolglos ist, trotz richtiger Anmeldeinformationen."}, {"date": "2 Aug 2013", "title": "Programm-Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took a year or more. I interviewed at IAEA (Vienna) in Jan 2009", "Interview Descriptions": "Das Einstellungsverfahren ist langsam, dauert in den meisten Fällen über ein Jahr, und es gibt etwa 200 Lebensläufe für jeden Beitrag. Zuerst gibt es ein computergestütztes Matching, basierend auf elektronischen Filtern, dann ein Review durch die Manager, dann ein Panel-Interview mit Endauswahl. Ein durchschnittliches Interview beinhaltet 10 Fragen vor 5 Person. Beachten Sie, dass das Visum Sponsoring der UN bedeutet, dass Sie im Wettbewerb mit einem globalen Markt sind.", "Interview Questions": "Standard-Fragen- aber was du getan hast (ich) und nicht das Team (wir) im Fokus"}]]