[[{"date": "17 Jun 2023", "title": "Clinical Lab Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at University of Iowa (Coralville, IA)", "Interview Descriptions": "Basic questions that make sure you know enough to be trained to do your job. You will be with the supervisor that hires you as well as with an HR staff.", "Interview Questions": "The difference between quality control and quality assurance"}, {"date": "28 May 2023", "title": "Software Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Iowa (Iowa City, IA) in Apr 2023", "Interview Descriptions": "The interview process typically involves the following steps: Screening: This is the initial stage where the recruiter or hiring manager reviews the applications received for a particular job posting. They screen the applications based on the job requirements and shortlist the most suitable candidates. Selection: The shortlisted candidates are then selected for further rounds. This could involve additional filtering criteria, such as aptitude tests, assessments, or preliminary telephonic or video interviews. Schedule Interview: Once the candidates are selected, the recruitment team schedules formal interviews. These interviews could be conducted in-person, via video call, or even as a panel interview, depending on the organization's process. Describe the Task: In some interviews, especially for technical or specialized roles, candidates may be asked to complete a task or a project. This is done to assess their practical skills and ability to handle job-related tasks. The task is usually relevant to the job role and provides the interviewer with a better understanding of the candidate's abilities. Further Interviews: Depending on the role and the organization, there may be additional interview rounds, such as with higher-level management or potential team members. Decision and Offer: Post all interviews, the recruitment team and the relevant department's heads make the hiring decision. The selected candidate is then extended a job offer. Onboarding: Once the candidate accepts the offer, the onboarding process begins to smoothly integrate the new hire into the organization.", "Interview Questions": "- Why do you want to join the university"}, {"date": "28 Mar 2023", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "Communicate via Zoom or email. The professor is kind and explains what she needs for this job clearly. The overall interview process is very efficient. I got the offer and got into the system within one week.", "Interview Questions": "Are you good with Python?"}, {"date": "21 Mar 2023", "title": "Medical Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "Easygoing, straightforward, amiable interviewers. In addition to questions about why medicine and why medical schools, questions are also aimed at also getting to know who you are as a person in general and your experiences that speak to your attributes that would make you a good candidate for their school", "Interview Questions": "A questions that is somewhere along the lines of why are you interested in a career in medicine?"}, {"date": "3 Mar 2023", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "Good, efficient, online, comprehensive, smooth, question for both sides, three rounds in a row for different purpose, include current employees, about two weeks waiting time for their decision, job description is clear", "Interview Questions": "Something about your background and strength"}, {"date": "29 Dec 2022", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "The team leader showed up, asked basic questions, and know your resume. The interview process fairly easy, you need to do some homework first. They usually contact you back soon", "Interview Questions": "Why do you want to work for us"}, {"date": "15 Nov 2022", "title": "Event Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "Good impressions, asked a lot of questions that made it feel like I wasn’t going to get the job because I didn’t know their systems already, liked the different groups of people I met with.", "Interview Questions": "What was a time you over came adversity?"}, {"date": "26 Oct 2022", "title": "Cambus Driver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "The interview process was fair, easy, and straightforward. The interviewer was kind and friendly. The job was accurately described before and during the interview. Overall there were no issues with the interview.", "Interview Questions": "Do you have a CDL?"}, {"date": "4 Sept 2022", "title": "Adjunct Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "After getting my masters I got an offer to be an adjunct professor after interviewing with teaching fellows who were already teachers, then I got an email saying I got it a few days later", "Interview Questions": "What teaching experience do you have?"}, {"date": "5 Oct 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Iowa (Iowa City, IA) in Aug 2022", "Interview Descriptions": "I interviewed for several GRA positions, some were more technical oriented, and others were more work oriented. Overall, one professor was impressed by my interview and recommended me to another professor who hired me directly without an interview.", "Interview Questions": "What are similar works done in the past by you? Tech skills that you have? Some research questions"}], [{"date": "9 Jun 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Iowa", "Interview Descriptions": "Interview process was extremely straight forward. Process included an in person interview with consistent communication and a short follow up time. I felt connected to the interview committee and appreciated the transparent nature of the process.", "Interview Questions": "Why do you want to work at the university? "}, {"date": "23 May 2022", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "General questions about yourself and the class. Asking when is your availability for office hours, tutoring, and discussion. Follow by a teaching demonstration from you and the current TA's will ask you specific question about class content.", "Interview Questions": "Why are you interested in being a TA for this course?"}, {"date": "11 Mar 2023", "title": "Facility Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at University of Iowa in May 2022", "Interview Descriptions": "I was interviewed by a panel of employees. I believe they were trying to offer valuable learning experience to their employees. Their were over 100 candidates who participated in the interview process and I was hired on along with 3 other individuals.", "Interview Questions": "They asked the typical “Tell me about yourself”"}, {"date": "23 Apr 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "I have had a variety of interviews with the University of Iowa. For the one mentioned here it was a virtual interview, then in person. Each department has their own way of handling things. If you are already in the university you need 5 references, including your supervisor, so make sure you get a supervisor who you can form a good working relationship with.", "Interview Questions": "Why do you want to work part-time?"}, {"date": "12 Apr 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Iowa", "Interview Descriptions": "It was super relaxed. There was a tour of the hospital and the area that I was interviewing in. Then had separate interviews with different groups within the area I was interviewing in.", "Interview Questions": "A solution to a difficult situation, how you deal with stress, what hobbies you have"}, {"date": "20 May 2022", "title": "Senior Application Programmer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Iowa (Iowa City, IA) in Apr 2022", "Interview Descriptions": "Two rounds of phone or video interviews.  Interviews had multiple people on the call including the hiring manager and HR representative.  Some in-depth technical questions and homework which was turned in 2 days after the day it was given.", "Interview Questions": "They asked how to find a string in a flat file."}, {"date": "22 May 2023", "title": "Maintenance Helper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Iowa (Iowa City, IA) in Apr 2022", "Interview Descriptions": "The interview process was simple. Applied online and the in-person interview contained very basic interview questions related to previous work and what makes you qualified for the position. By the end of the interview there was a good idea of if I had gotten the job.", "Interview Questions": "Why do you think you would be a good fit for this position?"}, {"date": "28 Mar 2022", "title": "Student Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Iowa", "Interview Descriptions": "Very basic questions. Just a one-on-one or two-person interview with the managers. Very causal. They mostly ask about what you can bring to the job and how well you can work with others.", "Interview Questions": "How would you handle a situation where a dining associate is seen on their phone?"}, {"date": "21 Feb 2022", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "A structured interview by the admission committee and 6 questions in total. The questions are kinda typical, but I would suggest that you prepare in advance. I did realize that I did not answer well in some of them because I was somewhat nervous, but all in all they are quite normal.", "Interview Questions": "The ones that you probably can find online. "}, {"date": "18 Jan 2022", "title": "Photography Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at University of Iowa", "Interview Descriptions": "Over zoom my employers and I discussed the workflow and expectations of the job and decided it would be a good fit given my previous experience. They were very kind and willing to work with me and help me learn.", "Interview Questions": "What kind of products do you use to shoot and edit?"}], [{"date": "12 Jan 2022", "title": "Student Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "This job required an in person interview. It took place with a leader in the department that dealt directly with student clerks. The job was explained and I was asked if I had any questions.", "Interview Questions": "What would make you a good fit for this job? "}, {"date": "22 Oct 2021", "title": "Student Transit Coach Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "Easy and short-staffed at the time when I applied and interviewed. I walked up the stairs of the hub, sat in a conference room, and was basically given an overview of the job, organization, and on-boarding process.", "Interview Questions": "When can you start working?"}, {"date": "27 Sept 2021", "title": "Medical Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "I felt like they really cared about the interview and making us feel at home. Everyone was kind.  The food was good. Chill experience. The questions weren't hard and straight from SDN", "Interview Questions": "I would recommend looking at SDN"}, {"date": "12 Sept 2021", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "It is the responsibility of the departmental executive officer or a designee to make certain that prior to any commitment of appointment, the new appointee has a clear understanding of the terms of employment and working conditions.\r\n\r\nNotices of new appointments, changes in status or terminations reaching by the close of business on the 20th of the month are processed for payment or adjustment during that month.\r\n\r\nDepartments are expected to make recommendations of new appointments and changes in status as soon as it is possible for them to do so regardless of the deadline, and in no case later than the effective date thereof. The processing of such recommendations before they are reported to Human Resources may take considerable time and should be originated well in advance of the deadline to assure prompt payment.", "Interview Questions": "Personal:\r\nThese are intended to help the employer understand how you best function and what your strengths are.\r\n\r\n    Tell me a little about yourself. (Keep your answer career oriented).\r\n    What are your strengths?\r\n    What causes you stress and how do you handle it?\r\n    Give me three adjectives that describe you.\r\n    What do you consider your greatest accomplishment?\r\n    What do you like to do in your spare time?\r\n\r\nCareer Goals:\r\nThese are intended to help the employer understand how well you plan and what your ambitions may be.\r\n\r\n    Where do you see yourself in five years? (Again, focus on your career goals).\r\n    How do you define success?\r\n    What type of supervision do you prefer? What do past supervisors say about you?\r\n    What type of steps do you take to stay informed of new developments within your career field?\r\n    How do you feel about working nights and weekends for special events/activities?\r\n\r\nEmployer Information:\r\nThese are intended to let the employer know how much you understand about the organization, and about your preparation and enthusiasm for the position and organization.\r\n\r\n    What do you know about our company/organization?\r\n    What do you know about this position?\r\n\r\nEducation:\r\nThese are intended to help the employer understand how your education fits with the job and also your level of self-reflection about it. \r\n\r\n    How did you decide on your career/field/major?\r\n    What classes have you enjoyed the most/least during college and why?\r\n    How have the activities that you have been involved with during college influenced you?\r\n    Do you have future plans of furthering your education?\r\n    What electives did you enjoy the most? Why?\r\n\r\nExperience:\r\nThese are intended to help the employer understand how your experiences have given you the needed skills and relevant experiences related to the position for which you are interviewing.\r\n\r\n    How would your co-workers/supervisors describe you?\r\n    Tell me about a time when you had to influence someone to accept your idea.\r\n    Give me an example of a time when you had to make an important decision and how you came to that decision.\r\n    Tell me about a time when you had to work with a difficult person and how you handled it.\r\n    Tell me about your position with ___________ and the valuable skills you learned.\r\n    Please give me an example where you have demonstrated the ability to be an effective member of a team.\r\n    Give me 3 reasons why I should hire you.\r\n    Is there anything you would like to add?\r\n    What did you like the most and the least about your last place of employment?\r\n\r\nAtypical Questions:\r\nThese are intended to help the employer understand how much you think on your feet, understand your decision making process or address how creative you may be. There are no correct answers. \r\n\r\n    If you were a fork, knife, or a spoon, which would you be and why?\r\n    Why are manhole covers round?\r\n    Sell me something in this room, anything.\r\n    What did you do poorly in your last position or on your last project?\r\n    If you had to choose, would you be an elephant or a giraffe? Explain why.\r\n    Create an argument for one of these statements: salt is better than pepper or pepper is better than salt.  \r\n    If you had to pick a title for an autobiography about your life (at this point in time), what would you name the title?\r\n    If you were a type of food, what type of food would you be and why?\r\n    If you could have dinner with anyone from history, who would it be and why?\r\n"}, {"date": "21 Jul 2022", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Iowa (Iowa City, IA) in Sept 2021", "Interview Descriptions": "It was pretty straightforward and they really cared that I was not applying for the job just for the money. The interview went well and I got an offer.  I would say I was given a lot of independence at my job, and I always had staff support when I needed it.", "Interview Questions": "Why do you want to work as a Tutor?\r\n"}, {"date": "27 Sept 2021", "title": "Facility Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Iowa (Iowa City, IA) in Aug 2021", "Interview Descriptions": "Interviewed by two facility/operations managers. They asked around 10 questions and the interview was about 15 minutes. I was told sometimes a student supervisor also may participate in the interview.", "Interview Questions": "Tell me about a time when you contributed more than your fair share in a project or at work?"}, {"date": "14 Jul 2021", "title": "Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "Very easy. Came in to office and there was like 2 questions and bunch of comments. Had to submit my resume and that was about it. I found it be very enjoyable.  I had a good conversation with the hiring dean.", "Interview Questions": "How do you manage conflict?"}, {"date": "2 Jun 2021", "title": "Clerk III Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "The process is long, from time of applying to even getting a call back is weeks, after interview it's more waiting. I would have liked to work for the university but I needed to secure a job  more quickly.", "Interview Questions": "Strengths and weaknesses, standard questions"}, {"date": "5 Aug 2021", "title": "Suplly Chain Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Iowa (Iowa City, IA) in Jun 2021", "Interview Descriptions": "We did zoom meeting and talk about the supply chain process and how maby time i have to work. I was students job position so that they wabted know weather i can work in regular semester or not.", "Interview Questions": "Interview questions are so typical one. Such as how to yoy deal with conflict in work place."}, {"date": "27 Feb 2023", "title": "Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of Iowa in May 2021", "Interview Descriptions": "The interview process for University of Iowa is challenging. Since the organization is so big, the first hurdle is Human Resources (before interview). Oftentimes the job descriptions include requirements that are overly exacting for the position at hand in order to slim (sometimes eliminate) the candidate pool. The actual interview is usually a panel interview of 3-10 people. Then there are second round interviews, then chosen candidates.", "Interview Questions": "What is the experience that qualifies you for this job? Are you able to be excellent at all the duties of this job? Are you likeable? [unstated question] Do we all like you? [unstated question]"}], [{"date": "14 Nov 2021", "title": "Student Worker - University Housing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Iowa (Iowa City, IA) in Apr 2021", "Interview Descriptions": "On-site interview about 45 minutes long, I have been asked many questions, many of the questions are job-related and ask you how to manage your past work experiences. The time will go by faster than I thought; we have also discussed some interesting thoughts in my past work experiences and how to handle or avoid mistakes.", "Interview Questions": "Why you choose this job. "}, {"date": "18 Mar 2021", "title": "ITSM Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "the process was very easy and quick. the Job schedule is very flexible, it goes well with my class schedule. nice people to work around. Also, there are great mentors who help you a lot when stuck anywhere.", "Interview Questions": "Why do you want to work with us?"}, {"date": "15 Feb 2021", "title": "Diversity and Inclusion Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "Series of questions relating to a passion for DEI work. The environment was comfortable and the questions were straight forward. I recommend review past experiences so  that you can have more concise answers/ replies", "Interview Questions": "Why is diversity important to you?"}, {"date": "5 Feb 2021", "title": "Supply Chain Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Iowa", "Interview Descriptions": "Slow hiring process, some of this is due to the health screening process that is required, two interviews, basic questions asked, nothing overly difficult, in person and a web interview.", "Interview Questions": "Explain Conflict resolution with past coworker"}, {"date": "15 Sept 2021", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Iowa in Feb 2021", "Interview Descriptions": "The interview was just a quick zoom call, nothing fancy. They offered to hire me on the spot during my interview, so it was nice not having to wait to hear back from them.", "Interview Questions": "Why are you interested in this position?"}, {"date": "7 May 2022", "title": "Teaching Assistant/Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Iowa (Iowa City, IA) in Jan 2021", "Interview Descriptions": "Easy process. They really just want to get to know you as a person and have examples of your work ethic.  Professors at Iowa are very kind and want to help their students succeed.", "Interview Questions": "What is an example of a time you went above and beyond expectations?"}, {"date": "29 Dec 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Iowa (Iowa City, IA)", "Interview Descriptions": "Applied online through university job site\nGot e-mail for onsite interview, I think.\nInterview consisted with technical questions \nReceived the result before long.\nI do not think that I needed to wait for long time.", "Interview Questions": "What probe was used for Southern blotting?"}, {"date": "15 Oct 2020", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "It was very long! You really have to know yourself to make it through this interview. Continue to talk about what you're passionate about. You don't need to know everything about the job to get it.", "Interview Questions": "How would you prioritize a friend calling you versus the duty phone ringing?"}, {"date": "21 Sept 2020", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at University of Iowa", "Interview Descriptions": "Interview with two of the associate vice presidents and included a presentation on some aspect of life at the University of Iowa. The topic was up to you and you were told ahead of time so you were able to appropriately prepare for a speech.", "Interview Questions": "Describe a time when you faced conflict in the workplace. "}, {"date": "5 Sept 2020", "title": "Prefer Not to Answer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Iowa (Iowa City, IA)", "Interview Descriptions": "Had multiple interviews, they were never one on one. In my experience, at least two people interview you. Can be intimidating but it's nice to have a mix of personalities and questions. It takes a while to hear back.", "Interview Questions": "Experience, organization skills, and examples of how well you work with people "}], [{"date": "10 Jun 2020", "title": "Environmental Health and Safety Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "It was about a 30 minute interview with the project leads and then another interview with the department head that was about 45 minutes after the project leads passed my name along", "Interview Questions": "Describe yourself in three words"}, {"date": "6 Jan 2020", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Iowa", "Interview Descriptions": "They asked me some very nice and simple questions, they were also nice during the interview. About ten questions, all of them were  behavioral, they understood that some students never worked before", "Interview Questions": "Why do you want to work here?"}, {"date": "31 Mar 2022", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Iowa (Iowa City, IA) in Jan 2020", "Interview Descriptions": "It was good with nice people and good questions to be asked. The atmosphere is good too. We talked about the plan, the interest, and benefits. It was an enjoyable experience highly recommended!", "Interview Questions": "What is your career goal ?"}, {"date": "21 Mar 2023", "title": "Babysitter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of Iowa in Jan 2020", "Interview Descriptions": "Supe Chill. Focused on what I like to do with kids, and how i would keep entertained. Talked about my big family and how I have always grown up around young children. Also talked about how I worked at a camp over the sumer with kids", "Interview Questions": "How do you handle kids>"}, {"date": "21 Dec 2019", "title": "Chilled Water Student Enginewe Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Iowa", "Interview Descriptions": "I was brought in after my resume was reviewed and given a tour immediately. The maintenance planner and plant manager held my interview and I also met the operators as well during the day. It was quick and easy and ended with an offer", "Interview Questions": "What interests you in manufacturing?"}, {"date": "16 Dec 2019", "title": "Radiology Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Iowa", "Interview Descriptions": "Very laid back. The interviewers wanted to truly get a look at your personality and how you would work in a team environment. It was in a small conference room with two managers.", "Interview Questions": "Basic Strength/Weakeness questions"}, {"date": "4 Jan 2021", "title": "Marketing Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Iowa (Iowa City, IA) in Dec 2019", "Interview Descriptions": "There was a virtual or in-person interview that was relaxed. I dressed professionally and felt comfortable talking with everyone. The interview was with a team rather than a one-on-one. I thought overall it was a great interview.", "Interview Questions": "Why do you want this position?"}, {"date": "15 Aug 2020", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Iowa (Iowa City, IA) in Aug 2019", "Interview Descriptions": "Straight forward, great people, the interview was more of a formality because I basically already had the job beforehand. Emphasized the idea that, because I was still a student, if I needed time off I just had to communicate with them and they would accommodate.", "Interview Questions": "What is your ultimate career goal?"}, {"date": "30 Jun 2019", "title": "Assistant Research Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at University of Iowa", "Interview Descriptions": "I had an Skype interview. It was about my reseach contributions. I presented summary of my research. Then, I asked computational resources I can use. The interview took about an hour.", "Interview Questions": "What's your reseach topic; what is your short term goal; what is your long term goal"}, {"date": "27 Oct 2022", "title": "College Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Iowa (Iowa City, IA) in May 2019", "Interview Descriptions": "Interview process was standard for higher education. I first underwent a phone screening with an employee from HR. Once deemed a good candidate, I was contacted to have an on-sight interview that took up several hours which included interviews with students, colleagues on the team, and a presentation on a current issue/topic.", "Interview Questions": "Questions related to the job tasks and about my past work experience."}], [{"date": "7 Jun 2021", "title": "Front Desk Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Iowa (Iowa City, IA) in May 2019", "Interview Descriptions": "So warm and welcoming! They really wanted to get to know me and did not just ask typical interview questions. I loved how it felt like a real conversation. The job was amazing as well and I would highly recommend their interviewing practices to anybody!", "Interview Questions": "What are you most passionate about and why?"}, {"date": "7 Mar 2019", "title": "Research Assistantship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Iowa (Iowa City, IA) in Feb 2019", "Interview Descriptions": "The interview was about my educational background, personal background and any relevant research experience in the field. The interviewer told me about the kind of experience that is required for an RA like carrying out research on funded projects, publishing research work and supplementing it with a balanced approach.", "Interview Questions": "Mostly, explain your grades. What is your motivation? Why did you do so many entrepreneurship projects during your BS?"}, {"date": "12 Aug 2020", "title": "Dining Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Iowa (Iowa City, IA) in Jan 2019", "Interview Descriptions": "The interview is done through a phone call. First, you can apply for the job through online or walk-in.  In a few days, the assistant manager will call you for the interview.", "Interview Questions": "Do you have any cooking experience?"}, {"date": "1 May 2019", "title": "Medical Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Iowa (Iowa City, IA) in Jan 2019", "Interview Descriptions": "I was called and asked to interview. Interview was scheduled two weeks later. \n\nThere were two nurses and only one social worker present for the interview. \n\nThe interview was unprofessional. Only the social worker introduced herself, I was not offered water or any beverage during the interview. \n\nInterview lasted 45 minutes. I was told I would hear from them within a week. I was never called back.", "Interview Questions": "Was there a time that you disagreed with someone else regarding discharge planning?"}, {"date": "11 Oct 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Iowa", "Interview Descriptions": "Phone interview by principle investigator. The PI takes time to introduce himself and his project. Asked several questions about previous research experiences, research skills and publications. Asked about if I would like to relocate.", "Interview Questions": "Do you need sponsership to work in US?"}, {"date": "27 Sept 2018", "title": "Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Iowa", "Interview Descriptions": "It was a phone interview, very casual and laid back.  There were a few questions asked and I received an offer at the end of the call. The interview purpose was mostly to assess interest in the program and the topic.", "Interview Questions": "Why are you interested in Biostatistics?"}, {"date": "21 Sept 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "just some random easy questions. they call you and you meet them then a little chat and you get hired. its very easy and stress free and a great place to work at. i like it very much", "Interview Questions": "what do you like to do"}, {"date": "30 Apr 2019", "title": "General Science Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Iowa (Iowa City, IA) in Sept 2018", "Interview Descriptions": "The interview was short and informal. I interviewed at the power plant but ended up working elsewhere. I was offered the position immediately, which was great because I really needed a job.", "Interview Questions": "What my schedule availability was"}, {"date": "2 Aug 2018", "title": "Dining Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Iowa", "Interview Descriptions": "There was next to no interview, you submit an application with availability and if they need the workers they will ask you to come into orientation where they go over the basics of what you will be doing", "Interview Questions": "What is your availability "}, {"date": "14 Mar 2019", "title": "Banquet Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Iowa (Iowa City, IA) in Jun 2018", "Interview Descriptions": "Short and great, they got back to me very quickly , I had a phone interview then an in person interview. Later on I was offered the job and the company was very understanding that I had to relocate for the job.", "Interview Questions": "Did you have previous catering experience? "}], [{"date": "4 May 2019", "title": "Student Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Iowa (Iowa City, IA) in May 2018", "Interview Descriptions": "Fairly easy process. Got a call to schedule a in person interview a couple days later. Went in for the interview and just asked basic interview questions. Ended up getting hired on the spot. Was not stressful at all.", "Interview Questions": "Are you okay with the schedule? "}, {"date": "8 Mar 2019", "title": "Human Resources Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Iowa (Iowa City, IA) in Mar 2018", "Interview Descriptions": "There were multiple steps and interviews. I interviewed with three different hiring managers. At least 20 questions were asked, some behavioral. I thought it was very intimidating and was more difficult than any other interview I had as a college student", "Interview Questions": "Tell me about yourself"}, {"date": "6 Feb 2021", "title": "Graduate Teaching Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at University of Iowa (Iowa City, IA) in Feb 2018", "Interview Descriptions": "Two days long, including individual but unguided meetings with all of the faculty in your concentration. No room for introverts to take a breath, no room to escape the constant posturing and forced socializing.", "Interview Questions": "They didn’t ask me questions. They expected me to know all of their work and ask them questions."}, {"date": "17 Oct 2017", "title": "Membership Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Iowa", "Interview Descriptions": "Filled out an online application from the website for the open position. Got a response a week later via email for an  in-person interview with the hiring manager and another student.", "Interview Questions": "Describe a time you had a challenge within a team?"}, {"date": "2 Aug 2017", "title": "Support Services Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "Phone and In-Person Interview were professional, but comfortable and conversational.   There were a number of questions relating to the job, and personal opinions on work related actions.  Overall, the job was explained well.", "Interview Questions": "How do you handle conflicts at work."}, {"date": "27 Mar 2017", "title": "Social Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Iowa (Iowa City, IA)", "Interview Descriptions": "The interview was okay. They asked questions pertaining to the duties of the job. The department head was there as well as three other social workers. \r\nI was never made aware of the fact that I did not get the job, however the position was re-posted 5 weeks later, which is what indicated that I was not being considered.", "Interview Questions": "\"what do you think you would catch on to the quickest and what do you think would take the longest to learn?\" "}, {"date": "3 Jan 2021", "title": "Lecturer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Iowa in Feb 2017", "Interview Descriptions": "They provided you two questions they want you to answer in the email. This is not common. After your answer, they would ask some follow-up questions. I feel the communication is not a lot.", "Interview Questions": "How to teach advanced courses? How would you assist the coordinator's work if you are hired?"}, {"date": "22 Mar 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 months. I interviewed at University of Iowa in Jan 2017", "Interview Descriptions": "Very easy, very simple questions about my back ground and education Approximately 60 minutes, but please allot an additional 10 minutes in case the interview runs over. A specific username is not required to access the site, log in by using your preferred name.", "Interview Questions": "Feel free to log in beforehand if you want to familiarize yourself with the tool. If you experience any issues, please contact customer service ? f you require any special arrangements to be made in order to take full part in the interview, please let us know and we will make every effort to provide appropriate assistance."}, {"date": "5 Dec 2018", "title": "Residential Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at University of Iowa (Iowa City, IA) in Jan 2017", "Interview Descriptions": "The interview process came in different rounds. One was an individual interview, one was a group. The interview process screened for those who were good at working in teams as well as those who could calmly deal with intense situations. The individual interviews screened for good people skills and community involvement.", "Interview Questions": "What do you consider one of your strengths?"}, {"date": "15 Mar 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Iowa (Iowa City, IA) in Nov 2016", "Interview Descriptions": "I had a phone interview and a skype interview with my supervisor and someone from HR. It was nice because they not only asked a lot of questions to make sure you are qualified for the job, but they ask questions that give you the opportunity to show them who you are. They want to make sure the fit is good for both you and them.", "Interview Questions": "What is a policy at the University that you would feel comfortable explaining?"}], [{"date": "29 May 2018", "title": "River Room Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Iowa (Iowa City, IA) in Sept 2016", "Interview Descriptions": "They just want to talk to you to make sure that you are a personable person, make sure that you are okay with cooking meats and and to talk to you about scheduling", "Interview Questions": "Are you okay with cooking meat?"}, {"date": "9 Oct 2017", "title": "IT Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Iowa (Iowa City, IA) in Aug 2016", "Interview Descriptions": "The interview process was quick and comfortable. They asked regular questions. The interview was done in panel setting.  Very easy time, would say just be nice and open to talking. Arrive on time.  Now just trying to finish up so I can see my interview stuff", "Interview Questions": "How do you work with team?"}, {"date": "4 Apr 2017", "title": "Academic Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Iowa (Iowa City, IA) in Aug 2016", "Interview Descriptions": "After submitting a resume via email, I was invited for an interview. However, we immediately began discussing how to schedule tutoring sessions and it was assumed I already had the job.", "Interview Questions": "How many hours do you want to work?"}, {"date": "29 Sept 2017", "title": "Senior Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Iowa (Iowa City, IA) in Jun 2016", "Interview Descriptions": "They have 3 round interview process. First being an introduction of your self, resume discussion, and questions regarding your projects. Second time, They ask you a about technical computer science questions. Third, behavioral and interpersonal skills.", "Interview Questions": "Can you discuss MVC architecture in your own words? What are your weakness and strengths? "}, {"date": "9 May 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Iowa (Iowa City, IA) in May 2016", "Interview Descriptions": "Interviewed with the RN manager and ANM for about 20 minutes, then they left the room and had a few staff nurses come and let me ask them questions. Also a two hour shadow experience for a better feel of the unit culture", "Interview Questions": "What are you looking for in a unit?"}, {"date": "23 Mar 2016", "title": "IT Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at University of Iowa (Iowa City, IA)", "Interview Descriptions": "Interviews are usually conducted in a meeting with several administrators and staff people. These are typically people you'll eventually report to and work with. You'll be assessed with regard to how well you meet the qualifications REQUIRED for the job - skills, experience, education, certifications, etc. You'll also be evaluated on how well you satisfy the DESIRED qualifications. So, take some time to review these and let them be reflected in your cover letter and job interview process. As someone who has also been on the other side of the interview table, I can say that the process is designed to be very equitable with all candidates fairly evaluated by an impartial interview panel. This helps ensure effective and fair hiring.", "Interview Questions": "Questions typically address past work experience and what draws you to the opportunity you're applying for. Some technical questions would be asked to determine basic proficiency. You'll also be given an opportunity to ask questions."}, {"date": "4 May 2016", "title": "Health Records Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at University of Iowa in Mar 2016", "Interview Descriptions": "Online application, was contacted about 4 months later to schedule an in person panel interview. I was disappointed at how slow the process was, but I also feel like it is standard for an entry level position at a large university.", "Interview Questions": "There were very basic questions: how would you handle _____ situation? Describe yourself in three words, etc."}, {"date": "24 Oct 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Iowa (Iowa City, IA) in Feb 2016", "Interview Descriptions": "There was not an interview. I sent an email, expressed interest in the position and the work required- I want to be a researcher. The lab manager added me on as temp prior to my 'review'.", "Interview Questions": "They reviewed my skill set and let me participate as a 'trial' while my skills were vetted. "}, {"date": "8 Jan 2018", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Iowa in Jan 2016", "Interview Descriptions": "No in-person or web interview was done. I just submitted my CV, personal statement, and cover letter, and responded to any email questions that they had for me. The experience was pretty similar to the other graduate programs I applied to, or easier.", "Interview Questions": "Why do you want to attend this graduate school? Why do you want to study statistics?"}, {"date": "31 Jan 2017", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Iowa (Iowa City, IA) in Dec 2015", "Interview Descriptions": "About a 45 minute interview with the Fellows director and the secretary. I was asked to tell them about myself and what are some of my qualities. They asked me different questions about situations and how I handled them. I was asked about my long term goals and if I was willing to go through a background check.", "Interview Questions": "What is a positive quality about myself "}], [{"date": "5 Dec 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Iowa (Iowa City, IA) in Dec 2015", "Interview Descriptions": "More conversational than a typical interview. It was very relaxed and inviting, which is really nice for an undergraduate student. I felt like we really got to know each other quickly.", "Interview Questions": "What are you studying? What do you want to do with that?"}, {"date": "6 Nov 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Iowa", "Interview Descriptions": "This was a pretty standard, straight forward interview. I applied online and received an email from the HR rep. One in person interview took place with a group from the office followed by a job offer within a few days. Everything happened pretty quickly and smoothly. Those interviewing me used a template with standard HR questions that are asked of most job candidates. I was very please with the communication from the HR rep leading up to and after the interview. She even told me ahead of time who exactly would be interviewing me.", "Interview Questions": "How do you multitask or prioritize multiple project?\r\nWhat is your experience with databases?\r\nDescribe a time you had a conflict with a colleague/supervisor/employee and how you handled it?\r\nWhat kind of supervisor do you like to work with?\r\nWhat work accomplishments are you most proud of?"}, {"date": "11 Nov 2016", "title": "Field House Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Iowa (Iowa City, IA) in Oct 2015", "Interview Descriptions": "The interview process was typical. I applied online and then was contacted by HR. I met with HR to discuss the position and explain myself. I then had a one on one interview for the job.", "Interview Questions": "What is your greatest strength?"}, {"date": "13 Jun 2017", "title": "Student IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Iowa (Iowa City, IA) in Sept 2015", "Interview Descriptions": "Applied online. Then the IT Student manager gave me and call and we talked on the phone for a few minutes. The interview was me and then 3 current IT department employees asking me questions. Not a hard interview.", "Interview Questions": "How I would fix a broken router in my home"}, {"date": "29 Jul 2015", "title": "Part Time Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Iowa", "Interview Descriptions": "Very relaxed without almost any structure. I walked into the office and said: \"I heard you run xxx lab doing xxx. Do you have any room for a student?\" Answer was yes, and we chatted about all the cool stuff I'd be doing with them.", "Interview Questions": "Do you have any experience in applied thermodynamics?"}, {"date": "6 Oct 2015", "title": "Staff Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Iowa (Iowa City, IA) in Jul 2015", "Interview Descriptions": "They scheduled an interview with the Nurse Manager. Interview lasted for almost an hour and it went well. After the interview, they have given a tour of the unit too. \r\nAfter the interview, it goes for a long waiting time to get to know the actual outcome.\r\nSome questions asked:\r\nDid you had any conflicts with any of your previous colleagues?\r\nWhat do you like about this unit?\r\nWhat is the best feedback you received?", "Interview Questions": "Did you had any conflicts with any of your previous colleagues?"}, {"date": "3 Jun 2015", "title": "Applications Developer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "An hour long interview that with the Team Lead of the Team you will be on, along with a few others. Mostly standard interview questions and case questions. Nothing too difficult overall. I would suggest getting to the hospital very early, as it can be very confusing on how to get to the offices.", "Interview Questions": "How could you explain a technical problem to a non-technical person?"}, {"date": "24 Jul 2015", "title": "Epic Trainer (Contractor) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at University of Iowa (Iowa City, IA) in Jun 2015", "Interview Descriptions": "My interview was over the phone. It lasted for about 45 minutes. I interviewed with the hiring manager. She asked me about my previous experience supporting Epic, in particular, my Beaker experience. We talked about my availability, how long the contract was, and possible employment opportunities.", "Interview Questions": "How much Epic experience do you have?"}, {"date": "26 Sept 2018", "title": "Postdoctoral Scholar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at University of Iowa (Iowa City, IA) in Jun 2015", "Interview Descriptions": "Flew from Nashville to Iowa City in June 2015, very pleasant trip. Ended up doing a postdoc at UIowa. At the time of interview, the academic atmosphere was excellent in the department I interviewed at. The low living cost definitely contributed to my decision in doing my postdoc in Iowa", "Interview Questions": "What is your career plan?"}, {"date": "1 Jun 2015", "title": "Stutdent IT Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Iowa (Iowa City, IA)", "Interview Descriptions": "I received an email stating that i was a candidate for the position i applied for.  I was interviewed by the manager, asking primarily about basic knowledge and understanding of the types of systems i would be assisting people with.  The interview was casual, brief and friendly.  No silly games or tricks.  Just straight forward questions relevant to the position for whichj i was applying.", "Interview Questions": "What types of relevant software programs do you have experience with?"}], [{"date": "22 Nov 2016", "title": "Membership Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Iowa (Iowa City, IA) in May 2015", "Interview Descriptions": "You meet with HR first. It is very brief and they ask very basic questions about you. If they are happy with that meeting, then they send along a background check to be completed. When they get the results of that back, and you are approved, then you will have a formal interview with your possible supervisor.", "Interview Questions": "If you were a fruit, what would you be and why?"}, {"date": "14 Oct 2015", "title": "Student Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Iowa (Iowa City, IA) in May 2015", "Interview Descriptions": "I submitted my resume online through hireahawk. They then contacted me asking when I would be available for an interview. The interview consisted of mainly behavioral questions and whether or not I was familiar with the software they use. The interview was very laid back setting. I wore professional dress but was later told this was not required. I think they liked the professional look. I received a call from them within 2 days of the interview.", "Interview Questions": "Why do you want to work here?"}, {"date": "21 Mar 2018", "title": "Storekeeper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Iowa (Iowa City, IA) in Mar 2015", "Interview Descriptions": "Unfortunately, there was no real \"interview process\" as they were in need of help. Therefore, my \"interview\" was more or less of coming in to meet the staff and providing my availability. The \"interview\" was also used to explain how to use the different systems that you need to use while on the job.", "Interview Questions": "Have you had experience working with a pallet jack?"}, {"date": "6 Oct 2015", "title": "Membership Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Iowa (Iowa City, IA) in Mar 2015", "Interview Descriptions": "A simple interview with the supervisor. It is a very simple interview. I talked with the supervisor in his office for half an hour. He has a list of questions that he would like to ask you. He is very easy going. The questions are mainly about how you deal with a situation. The university would inform you if you get the offer. I believe it is a pleasant interview.", "Interview Questions": "What if customers complain about our services?"}, {"date": "7 May 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Iowa (Iowa City, IA) in Feb 2015", "Interview Descriptions": "They asked mainly about my Ph.D topic and my publications. They also asked some technical questions and were interested to know either I have a critical thinking capability or not. They also tried to go through my papers and asked me to talk about the paper, the technical parts, the results and my main contribution.", "Interview Questions": "Can you explain your Ph.D?"}, {"date": "25 Jan 2017", "title": "Main Desk Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Iowa (Iowa City, IA) in Feb 2015", "Interview Descriptions": "Interviewed by three people. One manager, one supervisor, and one other employee. They were friendly and asked straightforward questions. Overall the process was smooth and they got back to me quickly after the interview about the position.", "Interview Questions": "What would you say is your greatest weakness?"}, {"date": "19 Mar 2016", "title": "Marketing Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Iowa (Iowa City, IA) in Feb 2015", "Interview Descriptions": "It was a very laid back interview with a panel of both students and full time staff members.  They each went around the table asking their own questions that were focused on specific experiences that related to the job and personality.", "Interview Questions": "Tell us about a time that you received negative feedback. How did you respond to that?"}, {"date": "27 Jan 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of Iowa", "Interview Descriptions": "In order to interview for this position I first had to go through an application. We had a short application process including references, information about involvement in activities, other jobs and organizations, and a few short answers. Once the applications were all received they narrowed it down and called in applicants for an in person 2:1 interview. It only lasted about a half hour and was the final step in the process. Final decisions were made around April. Nothing out of the ordinary. All questions were typical.", "Interview Questions": "What past experiences make you qualified for this position? "}, {"date": "13 Jun 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Iowa (Iowa City, IA) in Jul 2014", "Interview Descriptions": "Fast and easy. Not too harsh. Several questions asked but they were not difficult. The atmosphere was relaxing and people were nice, helpful and sympathetic., although some professors are not very personable.", "Interview Questions": "Do you like teaching?"}, {"date": "25 Mar 2018", "title": "Student Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at University of Iowa (Iowa City, IA) in May 2014", "Interview Descriptions": "It was very short. I was just out of high school and knew the hiring manger. We just talked about what my roles and responsibilities would be. Short and sweet, just the way I like it!", "Interview Questions": "N/A"}], [{"date": "16 Apr 2014", "title": "Rhetoric TA Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at University of Iowa", "Interview Descriptions": "There aren't really any interviews. Your department sponsors you and depending on the number of positions Rhetoric has received that year, you get it or you don't.", "Interview Questions": "You will have to participate in professional development though."}, {"date": "12 Mar 2014", "title": "Catering Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "first receive an email from the supervisor concerning the possible time to conduct an interview; then during the interview I was asked about my expectation to the future work", "Interview Questions": "No unexpected questions indeed and not too much questions for this position"}, {"date": "6 Mar 2014", "title": "Student Research Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Iowa", "Interview Descriptions": "Very simple. I applied the week of finals during the Fall semester and then heard back the week before the Spring Semester began. Went in for an interview, they basically wanted to see my excel proficiency and how I made an ugly spreadsheet look nicer.", "Interview Questions": "Most unexpected questions had to do with Adobe (because a lot of the work is in acrobat pro). "}, {"date": "25 Sept 2015", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Iowa (Iowa City, IA) in Feb 2014", "Interview Descriptions": "Applied online. Got a call requesting I come in for an interview. Attended interview. About 30 minutes long. Basic technical questions. My experience meant fewer tests. Overall nice people. Received an offer the following week. Took the weekend to think it over and eventually accepted. Can't say I regret it, though recent changes in upper management have been extremely troubling.", "Interview Questions": "What was a challenge you encountered and how did you handle it?"}, {"date": "9 Jun 2014", "title": "ESL Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Iowa (Iowa City, IA) in Jan 2014", "Interview Descriptions": "The entire interview process for this position was conducted over the telephone. After a standard application with CV, 3 letters of recommendations, and a cover letter, I was contacted within 6 weeks to set up an initial screening interview. This interview lasted approximately 30 minutes and was conducted with a panel of 3 people from the university's Intensive English Program. Most questions dealt quite specifically with trade based situations (e.g. When teaching pronunciation, do you focus more on segmentals or supersegmentals?) There was little in the way of questioning regarding me personally; it was almost entirely based on teaching practices. A few weeks later, I was contacted for a follow up / final interview. This also took place over the phone, and lasted only slightly longer than the initial interview. Again, questions were primarily based on classroom practice. An example would be, \"How would you explain to a student in the simplest terms the difference between the present perfect and the past continuous?\" All interviewers were cordial and professional.", "Interview Questions": "If a student were to come to you during your office hours upset about a grade that he/she earned and was inconsolable (i.e. was not satisfied with your explanation of your grade), what action would you take?"}, {"date": "11 Dec 2016", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Iowa (Iowa City, IA) in Jan 2014", "Interview Descriptions": "Long process, but worth it. It was a good mix of one on one interview and then group interviews. Ask a lot of questions and take notes as you respond", "Interview Questions": "Why am I interested in this position?"}, {"date": "7 Oct 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 5 months. I interviewed at University of Iowa", "Interview Descriptions": "After admitted by school, I send my former work to a professor and since it matches the lab work, I got the job without a formal interview. But I bet the school applying procedure covered this part already. Compare to RA position, applying school program would be much harder and important.", "Interview Questions": "I have to write something to submit...but to be honest, grad school application is more about all the former experience and submitted documents. The hardest for me might be write out a ps that suitable for this lab."}, {"date": "15 Apr 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Iowa in Apr 2013", "Interview Descriptions": "Two professors interviewed me over Skype. They asked me questions such as why do this... what did you do in the past? What are you planning to do in the future? They chat for about 50 min. Very happy. Finally get an offer.", "Interview Questions": "What did you do in the past"}, {"date": "21 Nov 2016", "title": "Human Resources Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at University of Iowa (Iowa City, IA) in Mar 2013", "Interview Descriptions": "The set-up was quick and easy with a phone call and follow-up email with instructions. The interview was with 3 people and then the dept. head 1:1. The structure was professional but comfortable. The follow-up was timely and via phone. I felt they were prepared and asked appropriate behavioral questions tied to the competencies listed on the advertised position.", "Interview Questions": "Describe your work history that is relevant to this position and why you feel you'd be a great fit."}, {"date": "9 Jun 2017", "title": "Marketing Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Iowa (Iowa City, IA) in Feb 2013", "Interview Descriptions": "Very informal and friendly. I thought everyone there asked me fair and relevant questions. I felt comfortable to speak freely. This was a very good learning experience for myself. I think they did a very good job interviewing me.", "Interview Questions": "What are your biggest strengths?"}], [{"date": "5 Aug 2015", "title": "Recreation and Wellness Services Membership Front Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Iowa in Jan 2013", "Interview Descriptions": "Easy going, laid back, and pain free. I interviewed directly with the hiring manager. We met one on one in the building sat down and just talked for awhile. She asked me about how I heard about the job and why I wanted to work there. She asked me about my schedule so she could see if I was a suitable candidate for their scheduling needs. There were really only about 5 actual interview questions. The rest of the process was just a conversation.", "Interview Questions": "If you were a type of fruit what kind of fruit would you be and why?"}, {"date": "25 Mar 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at University of Iowa (Iowa City, IA) in Jan 2013", "Interview Descriptions": "Pretty selective interview process", "Interview Questions": "Why do you want to do research for the rest of your life."}, {"date": "24 Jan 2013", "title": "Financial Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Iowa in Dec 2012", "Interview Descriptions": "The interview process is very bland. They ask you the stereotypical questions, \"Why would you like to work here?\" and \"why you think you would be good fit with the Alumni Foundation?\"", "Interview Questions": "You don't have any previous finance experience and your not a finance major, so why should we hire you?"}, {"date": "21 Mar 2014", "title": "Dining Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at University of Iowa (Iowa City, IA) in Oct 2012", "Interview Descriptions": "Very casual interview. No real questioning. I walked in and I was immediately given an orientation of the place. There was a great sense of trust once I walking in the door. To be hired you apply online and usually get a call within the first few days. There are always shifts open.", "Interview Questions": "N/A"}, {"date": "25 Feb 2016", "title": "Communications Assistant (Student Worker) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Iowa (Iowa City, IA) in Oct 2012", "Interview Descriptions": "The interview process was very smooth. My interviewers were accommodating to my class schedule, and were polite/prompt. It was casual, but didn't feel too informal, and I came away with a good feeling.", "Interview Questions": "Example-based questions were frequent. Come ready to talk about past work experience!"}, {"date": "23 Sept 2015", "title": "Burge Front Desk Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at University of Iowa (Iowa City, IA) in Sept 2012", "Interview Descriptions": "For the interview process I was given a time and date. I was to meet with the assistant hall coordinator. She was extremely sweet and happy to chat to get to know you. We talked about the job and my former qualifications.", "Interview Questions": "Do you have experience with emergency protocol?"}, {"date": "12 Mar 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Iowa (Iowa City, IA) in Sept 2012", "Interview Descriptions": "I knew the hiring professor so did not need to interview - it was a specific contract for the semester. Had I needed to interview, it would have been different. The application process starts via online system and you get a call or you don't.", "Interview Questions": "N/A"}, {"date": "5 Mar 2014", "title": "Patient Services Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of Iowa (Iowa City, IA) in May 2012", "Interview Descriptions": "Sent in my resume 3 weeks out I received a call to set up a phone interview, it lasted about 15 minutes. 2 on 1. They explained what the position is like and then proceeded to ask regular questions like why do you want to work with us?", "Interview Questions": "Wasn't asked any questions   "}, {"date": "17 Feb 2013", "title": "Student IT Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Iowa (Iowa City, IA) in May 2012", "Interview Descriptions": "It began with an application on the website. I had almost forgotten about applying for the job because they took so long to get back to me but about a month later I was asked to come in for an interview. I was surprised to find a panel of people interviewing me for a part-time student position. The interview was pretty fast-paced and covered behavioral questions to technical questions (how to go about trouble-shooting a given issue, identifying components of a PC, giving definitions of jargon like HTML, XML, HTTP, RAM, etc.).", "Interview Questions": "The most unexpected question was \"Which fictional character are you most like and why?\""}, {"date": "8 Mar 2016", "title": "Facility Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Iowa (Iowa City, IA) in Apr 2012", "Interview Descriptions": "I applied online on the UI Recreational Services website www.recserv.uiowa.edu and then received an email to set up a time for an interview. I believe now the applications must go through HR first. When I arrived for the interview I was directed to an upstairs office room where I waited outside for another interview to be finished.  As the first interviewee left, I was called into the room by both the facility supervisor and coordinator for membership services. They both took turns asking me questions. There was about 10-15 questions and they were very straight forward.  The whole interview was maybe 20-30 minutes long.  After the interview, I received an email after about 1-2 weeks offering me a position.", "Interview Questions": "The hardest questions were about specific situations that one would encounter on the job such as if a patron was upset about facility hours and protocols.  The interviewers wanted to see how you would handle a difficult situation with a patron. They also ask a fun question at the end to just see what your sense of humor is like. One example is, if you were a food what would you be?"}], [{"date": "4 Jan 2013", "title": "Dental Instrument Technician (Student Position) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Iowa (Iowa City, IA) in Feb 2012", "Interview Descriptions": "I applied in February 2012 through the University of Iowa Jobnet and scheduled a brief meeting with the supervisor, the same week after exchanging many e-mail messages.\r\n\r\nOnce the supervisor and I agreed on an appropiate time, I arrived the next day and met with her in her office. She then proceeded to give me a brief tour of the C.O.D. and its dispensaries. When she and I completed the tour, she then brought me up to the sterilization unit (Instrument Processing Room - IPR) and described the specific functions of each area within the IPR (the bur block station, the computer/printing station, the cutting/single instrument packaging area, the decontamination room, the sealing station, and the surgery wrapping area).\r\n\r\nOnce she finished giving me a tour of the IPR, she had asked me what I thought about the job. I then gave her my opinion and she offered me the job within a minute.\r\n\r\nThe interview process has evolved since last February primarily because many full-time employees have been terminated or quit.", "Interview Questions": "Does this seem the job for you?"}, {"date": "21 Jul 2016", "title": "Front Desk Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Iowa (Iowa City, IA) in Jan 2012", "Interview Descriptions": "normal interview process. I had a in office interview with the residence hall coordinator, along with the front desk supervisor. Then they left me quite some time to ask question and gave me a short tour around the hall building. Overall the experience is good.", "Interview Questions": "tell me about yourself. "}, {"date": "2 Apr 2014", "title": "Marketing Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Iowa (Iowa City, IA) in Jan 2012", "Interview Descriptions": "The hiring process begins with reaching out by applying through contacting the individual listed on the website. If you get an interview, you'll speak with a panel of people consisting of both professionals and current student representatives. You'll be asked a series of questions that are pretty straight forward and they're looking to see if you're a sharped minded, young professional looking for a chance to advance your knowledge in the advertising industry.", "Interview Questions": "What are you intentions as a student marketing representative?"}, {"date": "28 Apr 2014", "title": "Administrative Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Iowa (Iowa City, IA) in Aug 2011", "Interview Descriptions": "I applied during the summer but didn't get a call for quite a while, so it was a bit of a surprise to say the least.    The UI has a great system that requires a search committee for every professional hire, so it's not just you and one person during the interview.  I believe there were at least 5 people on my committee.  They all took a chance to introduce themselves and tell me what they do in the organization, and then took turns reading off the questions for me to answer. They were mostly, \"give an example of a time you...\" questions, and since I had plenty of experience, and had read the job description and requirements in advance, they were pretty easy to answer on the fly.\r\n\r\nI was 8 months pregnant so I was very nervous, but everyone was very welcoming and never mentioned my gigantic tummy. When they asked me what my timeline was for starting, I felt I needed to be honest and let them know how far along I was, because the start date they wanted would have been right around when I was due to have my son.  Still, they were very warm and happy for me, and it didn't seem to phase them that I needed to wait longer than they wanted.\r\n\r\nNext, I went in to an empty office and did an hour of soft skills computer work which included drafting a memo in Word and I think mail merging something, and creating a spreadsheet to meet a couple of different scenerios in Excel.  It wasn't anything I couldn't google if I got stuck.", "Interview Questions": "\"If you were needing to send out a mass mailing, tell us what process you would use,\" "}, {"date": "11 May 2015", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Iowa (Iowa City, IA) in Aug 2011", "Interview Descriptions": "It was short, but to the point. The employer needed a student to help out in the lab and wanted to fill it immediately with a suitable person. The interview itself only took about 30 minutes in the employers office. The questions were standard and it didn't take much to prepare for it.", "Interview Questions": "What is one of your downfalls as an employee?"}, {"date": "12 Jul 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Iowa (Iowa City, IA) in Feb 2011", "Interview Descriptions": "I took a class by a professor and got to know him through our discussions about the class material. He voluntarily told me about his research and asked if I had considered research ideas for my thesis. I decided to work with him because his style of teaching matched my style of learning.", "Interview Questions": "N/A"}, {"date": "14 Feb 2013", "title": "Senior Systems Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Iowa (Iowa City, IA) in Jan 2011", "Interview Descriptions": "UI likes to hire/promote internally if a qualified candidate applies.  The known evil is often preferred to the unknown, but it depends on the job, department and who the applicant is.  External people get hired at least as often as internal people, but there is a healthy mix.  All interviews must be identical, so expect a phone interview if you live in town.  Complexity of questions or process depends on the level of job and the hiring department.", "Interview Questions": "Basically they will ask tech questions that any idiot in the space of the job they're applying for should know."}, {"date": "12 Jun 2014", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Iowa (Iowa City, IA) in Apr 2010", "Interview Descriptions": "I was recruited through a third party due to previous work experience outside of college. It was a pretty standard interview related to engineering and what I could bring to the table.", "Interview Questions": "What systematic method would you use to determine the amount of cars on the road in the US today?"}, {"date": "17 Nov 2014", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Iowa in Mar 2010", "Interview Descriptions": "After an online application, I contacted the division regarding my admission status and they responded promptly saying that it would take around 2 months to review the application. I was then called for an interview after 2 months. Interview process was so good, I got a chance to know about the research going on in the institution and division also got to know my skills. Fifteen days later I received an offer letter.", "Interview Questions": "Why do you think you are suitable for Ph.D. and what are your expectations from a Ph.D. program. "}, {"date": "28 Aug 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 months. I interviewed at University of Iowa in Dec 2009", "Interview Descriptions": "You need to be accepted as a Graduate Student first then you will apply for a Teaching Assistant job.", "Interview Questions": "Tell the committee something totally different from your field of study"}], [{"date": "25 Nov 2013", "title": "Chemist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Iowa (Iowa City, IA) in Jul 2009", "Interview Descriptions": "Same questions were asked form all candidate. Focused on prior work experience, problem solving, and conflict management. There was a written assessment after the interview without time limit. It was followed by a tour. Position was offered about a month after the interview after background check.", "Interview Questions": "Say an example when you have a conflict with a co-worker, how did you solve it. "}, {"date": "25 Aug 2011", "title": "Account Executive Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Iowa (Iowa City, IA) in Apr 2009", "Interview Descriptions": "Set up a phone interview for the next week.  I took that afternoon off.  The phone interview lasted 1.5 hours.  She told me I was a top candidate (which I thought was an odd comment) then no call or email back.  Ever.", "Interview Questions": "Who is the most important alum in your opinion."}, {"date": "31 May 2011", "title": "Hall Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Iowa (Iowa City, IA) in Apr 2009", "Interview Descriptions": "Met with Residential Life Staff at Oshkosh Placement Exchange for preliminary interviews.  Received a 2nd phone interview, then was invited for an on-campus interview.  The on-campus interview was a horrendous experience--I had 8 interviews in one day with essentially no breaks to decompress.  The biggest upset was their commitment to diversity/multiculturalism.  The Assistant Director only views GLBT as diversity, and I learned when I was there that I would have been the only person of color to work in their entire division of over 80 people...shocking.  When I asked before my interview to meet with someone of color in student life so I can have someone to discuss UI's overall commitment to multiculturalism, the AD had to use a listserv to find a person of color (because she didn't know any in the entire institution), and found someone to talk with me that had no clue why I was there.  It was absolutely embarrassing and mortifying that the leader of this division knew no one of color and didn't think that was an issue.\r\n\r\nI learned that I didn't get the position--because there were other candidates with more full time experience than my own.  Got this info via email--wish it would have been a phone call.  Also, I learned from another colleague that I was brought it b/c the AD had to show that she was open to bringing ppl of color to the campus, and that the search is fair and equitable.", "Interview Questions": "N/A"}, {"date": "12 Nov 2013", "title": "Admission Visitor Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Iowa (Iowa City, IA) in Mar 2009", "Interview Descriptions": "Initial survey about personal interests and genuine love for the school was extremely helpful to gain insight into who they're really looking for to work in Admissions. Showing you could communicate in both a group setting but also one on one situations was helpful in determining your style and potential to give people a tour and interact with potential students.", "Interview Questions": "If you had to go out of town or had unexpected plans, would you discuss with your employer or how would you approach your employer about time off?"}]]