[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Love working for OP!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Jun 2023", "job_title": "Program Associate", "duration": "N/A", "pros": "At OpenPhil, I feel valued for my expertise and contributions to my team. I am constantly intellectually stimulated and get to interface with lots of experts in my field in really interesting and positive ways. The nature of my work has broadened my professional network and enhanced my experience of my scientific discipline. No day is the same and I'm constantly learning new things and tackling new challenges with the support of my manager and team. It's fulfilling work and I feel supported by a team that has the same goal: to improve the world as much as we can with the resources available to us.", "cons": "Because of the nature of OpenPhil's program area work, I can imagine that someone who enjoys routine and consistency could get overwhelmed by the constant intellectual stimulation that a program staff role entails. I also think that the variety of causes that OpenPhil works on can sometimes seem disconnected, and might be confusing for someone who isn't particularly open-minded beyond their specific area of interest/expertise."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great employer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 May 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- work towards a mission that's meaningful and ambitious, alongside driven colleagues who also care about that mission - supportive environment. people management is taken very seriously and a lot of effort goes into ensuring employees have a good experience - good pay and benefits - good work/life balance - opportunity to spend one week every quarter in San Francisco I love working here and it's easily my best job so far. rare to find a place where you both work to make the world better and feel so well looked after.", "cons": "- most people work remotely, which makes building rapport with colleagues more difficult than at primarily in-person companies"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to do interesting, impactful work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Apr 2023", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "You get to help a large grantmaker accomplish its mission of diligently and strategically doing the most good it can do. Team members are all talented, kind, and interesting people! By far my favorite set of colleagues in my career. Your job will probably be very interesting and engaging, and regardless of your position you'll have the opportunity to learn a ton about different issues and cause areas. Open Philanthropy is remote-friendly and very willing to help you do your job better.", "cons": "Open Philanthropy is growing and scaling quickly from a pretty small organization a few years ago, so you'll have to deal with changing processes. Many employees are geographically scattered, though OP does fly everyone out for quarterly in-office weeks and retreats"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Interesting and impactful work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Apr 2023", "job_title": "Program Associate", "duration": "N/A", "pros": "> Encouraged to take initiative > Small company with lots of personal attention > Ability to influence decisions in most roles > Really interesting work and people > Feel empowered to improve the world > Appreciate openness to critically evaluate themselves > Culture of openness/honesty > Support in creating a productive work environment > Ability to have flexible hours and work remotely if necessary", "cons": "> Can feel self-imposed pressure to not have a work-life balance, since feel that the work is really important > The flexible working hours mean the day is less structured than other jobs"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Apr 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Fantastic mission - Smart, engaged, kind, and enthusiastic colleagues - A collaborative and impact-oriented culture - Trust and autonomy in your work", "cons": "Most people work remotely (including me), which might be an issue for some - however they do a good job of building a really strong culture despite that"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good people, good mission, good procedures", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Feb 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Open Philanthropy basically is what it presents itself as — a grantmaking organization focused on impact and evidence. The people here match the mission; they care about honesty and doing good to an unusual degree. Pay and benefits are very strong. It helps that the operations staff dedicated to help employees actually seem to like everyone they work with. You get a dedicated Slack channel you can use to ask for things, with a minimum of bureaucracy and form-filling, and those things happen quickly!", "cons": "Much of what Open Philanthropy funds is highly speculative work, with impact that's only likely to be obvious years down the line. While there are some huge, obvious wins in areas like global health, some of the work you support may not feel especially inspiring day to day. (Fortunately, the warm-but-professional atmosphere and the excellent people are pretty inspiring themselves.)"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Amazing Colleagues", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Mar 2023", "job_title": "Research Fellow", "duration": "N/A", "pros": "I've never been surrounded by such an intellectually curious, compassionate, interesting group of coworkers. I'm constantly learning new things from my peers. Their dedication and open-mindedness are a source of inspiration. There is an environment of collaborative truth-seeking that both promotes cooperation and facilitates constructive feedback. It's a joy to collaborate with these folks.", "cons": "Working at Open Phil isn't for the faint of heart. This is a high-performing set of individuals. It's a culture that moves fast. While there is a healthy respect for work-life balance, there's not much room for dips in productivity. You really need to be on top of your game most days."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The best organization I have ever worked at", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Mar 2023", "job_title": "Business Operations Assistant in San Francisco, CA", "duration": "N/A", "pros": "Incredibly kind, thoughtful, value-aligned peers and management that heavily invest in your impact, professional development/upward mobility and happiness. Generous compensation and fantastic benefits, Open Philanthropy does everything possible to help you do your best work. I hope to spend my entire career at Open Phil :)", "cons": "The only con I can think of is that some employees will work more than 40 hours because of their passion for their work. This is not expected of any staff member, and management encourages their reports to take time for themselves."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Purpose, People, Policies, Pay", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Mar 2023", "job_title": "Operations", "duration": "N/A", "pros": "Purpose - Open Phil’s mission is to “help others as much as we can with the resources available to us.” Working at Open Phil feels like I get to be a part of a team that's tackling a fascinating research question (“how can we help others the most?”) and then trying to actually move the needle through hundreds of millions of dollars of grantmaking. \r\n\r\nWhether it’s hearing about the latest grants to improve global health by funding a mass vitamin A supplementation program or reducing biosecurity risk by funding research on the efficacy of far-UVC light on the reduction of indoor pathogen transmission, it’s been really motivating to be a part of an organization doing this kind of work. \r\n\r\nPeople - The people are a unique combination of (1) brilliant, (2) excited about Open Phil’s mission, and (3) warmhearted. I think it’s rare to find all three of these traits shared by the majority of staff, but Open Phil seems to have attracted/selected for these kinds of people. \r\n\r\nPolicies - Everything from new hire onboarding and the knowledge management system to expense reimbursement policy and quarterly co-working weeks feels efficient and non-bureaucratic. It’s like the ideal combination of start-up “move fast and try things” culture and top-tier consultancy “smart people have thought about this process for a while” culture combined. \r\n\r\nPay - Last but not least, compensation and benefits are very strong - not just compared to other public sector opportunities, but even some private sector opportunities for similar levels of experience. While I don’t think this is the main motivating factor for many Open Phil employees, getting paid well is an obvious boon.", "cons": "Remote work - I joined after Open Phil had shifted to “remote first” and I don’t live in the Bay Area which is the biggest cluster of Open Phil employees. While the flexibility of working from home/wherever is great, I’ve felt a bit disconnected from other teams at times. I think Open Phil has done a lot to mitigate some of the downsides of this with quarterly, all-team “Togetherness Weeks” in San Francisco, regular all-hands/round table discussions, randomized “Donut” team-building calls, etc. but it’s still something to consider if you’re keen to regularly go into an actual office with colleagues. \r\n\r\nUnique operating values - Open Phil’s operating values are ownership, openness, calibration, and inclusiveness. I think these values make Open Phil a more effective organization, but they’re probably not for everyone. Whether it’s the level of autonomy people have over projects, how much upward feedback is expected and constructive feedback is given, or communicating using reasoning transparency by using quantified probabilities or presenting the best counterarguments to your plan, Open Phil norms are quite different from the other places I’ve worked."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Impact-focused and rewarding work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Apr 2023", "job_title": "Program Officer", "duration": "N/A", "pros": "* Ability to drive change in important causes affecting some of the least well off people around the world * Intellectually curious colleagues * Many roles are high autonomy/responsibility", "cons": "* Largely remote, so if you prefer to work in person it can feel more difficult to stay connected to colleagues"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Hard to imagine a better job", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Apr 2023", "job_title": "Senior Program Associate", "duration": "N/A", "pros": "I feel empowered to work on addressing the world's most pressing problems, and I get to do it alongside some of the most compassionate, thoughtful and interesting people I've ever met.", "cons": "Really nothing worth mentioning here."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Foundation", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Jun 2022", "job_title": "Researcher in San Francisco, CA", "duration": "N/A", "pros": "Wonderful place to work, really amazing mission and coworkers", "cons": "Nothing really, they are rigorous and expect you to work hard"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Inspiring place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Apr 2021", "job_title": "Recruiter in Boulder, CO", "duration": "N/A", "pros": "Smart, kind colleagues who share my values. Everyone at OP really cares about making the world better. There are always tons of interesting conversations going on about important topics, so I'm always learning. The work culture encourages flexible schedules; my supervisor trusts me to get my work done, so it's easy to keep meaningful commitments outside of work. I really feel like my work matters. I could see myself working at Open Philanthropy for the rest of my career.", "cons": "It's been tough joining the organization remotely, without a chance to meet anyone in person (due to COVID-19). I am looking forward to meeting colleagues in person."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Loved  It", "rating": "5.0", "reviewer_affiliation": "Former Contractor", "job_date": "11 Jan 2021", "job_title": "Consultant in Los Angeles, CA", "duration": "N/A", "pros": "Amazing workplace and great staff", "cons": "Longer contract time would be preferable"}], [], []]