[[{"date": "4 Jan 2023", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AltaMed", "Interview Descriptions": "Horrible interview process, had like 5 people interview me the first round and even more the 2nd round. Never heard back about the third round after reaching out several times. Courtney would be to at least send a rejection after wasting so much of my time.", "Interview Questions": "Why I want to work at Alta med, my experiences, how I deal with problems etc"}, {"date": "21 Dec 2022", "title": "Doctor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AltaMed", "Interview Descriptions": "Nice and smooth three interviews with 5 panel members the questions were basic bud demanding to answer I liked the process you talk to a supervisor then a manager then a doctor along with a panel", "Interview Questions": "What is the most difficult time you had with a patient"}, {"date": "13 Apr 2023", "title": "Corporate Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at AltaMed (Commerce, CA) in Dec 2022", "Interview Descriptions": "The entire process of getting hired on at AltaMed was so easy and so efficient. I was contacted by the recruiter Brenda and she walked me through the entire process. This was the start to what I believe will be hopefully the last company I work for and retire here.", "Interview Questions": "I don't recall the questions as the interview was last December but I do remember it being more of a conversation than rigid interview questions."}, {"date": "27 Oct 2022", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AltaMed", "Interview Descriptions": "The recruiter contacted me by email/text for a phone interview. I had the interview then got moved forward to an in person interview with the hiring manager. I got an offer two days later from the recruiter.", "Interview Questions": "Why should we hire you ? How do you deal with an irate patient ? what makes a good leader ?"}, {"date": "4 Oct 2022", "title": "Research Project Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at AltaMed", "Interview Descriptions": "Amazing, relatively easy just want to see you're capable of doing the job. More likely looking to build a relationship instead of anything else. I recommend you apply just to give it a shot!", "Interview Questions": "Tell me about yourself and your history."}, {"date": "30 Jun 2022", "title": "Provider Network Administrator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at AltaMed", "Interview Descriptions": "After you submit your application online, HR may reach out to you to inquire more. The company firmly stick to the requirements/prequalifications in the posting. If you pass HR, then you will interview with the lead of the department.", "Interview Questions": "Questions regarding experience, responsibility, and etc were asked. Asked about time management and how one would prioritize competing projects and deliverables."}, {"date": "10 Feb 2022", "title": "Advocate Patience Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AltaMed in Feb 2022", "Interview Descriptions": "Apply online \r\nRecruiter reached out to me and we discussed qualifications \r\nPhone interview if they like you, another \r\nIn person interview. The recruiter turn around time is good as well. Supervisors are friendly.", "Interview Questions": "Where do you see yourself in five years "}, {"date": "25 Jan 2022", "title": "LVN Charge Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AltaMed", "Interview Descriptions": "Recruiter scheduled me for a 30 min call and we talked about the role and schedule. She was pleasant and helpful and was able to answer all of my questions.", "Interview Questions": "Tell me about a time you encountered a difficult patient? "}, {"date": "12 Oct 2022", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at AltaMed in Sept 2021", "Interview Descriptions": "online application phone call interview in person interview I got an offer the same day of the interview. Followed by an offer letter from manager scheduled a medical physical exam at corporate 2 days of training at corporate office in LA", "Interview Questions": "Previous experience Introduced my las occupations"}, {"date": "5 Apr 2021", "title": "Grant Writer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AltaMed", "Interview Descriptions": "Great process. Very transparent and easy to navigate.  They kept me in the loop on every stage and gave me ample time to prepare for each segment of the interview process", "Interview Questions": "How do you deal with large amounts of highly complex scientific information? "}], [{"date": "18 Feb 2021", "title": "Social Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AltaMed (Los Angeles, CA) in Feb 2021", "Interview Descriptions": "Recruited contacted me via email to information of position along with description. Phone interview will be coordinated with recruiter. Recruiter walks you through process of typing answers to provide for hiring manager.", "Interview Questions": "Are you authorized to work in the US"}, {"date": "15 Dec 2020", "title": "Community Health Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at AltaMed", "Interview Descriptions": "2-part interview process including an initial phone interview followed by an in-person interview (pre-pandemic). The selection process followed a match system, that included ranking several  departments to find the best fit for both the fellow and the department.", "Interview Questions": "What interested you in working for AltaMed?"}, {"date": "17 Dec 2020", "title": "Patient Care Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AltaMed (Anaheim, CA) in Dec 2020", "Interview Descriptions": "Interview Process was fairly easy. \nRecruiter: JP was great informative. \nPanel Interview: It was an experience for sure. It seem unorganized, they didn't have set questions they wanted to ask you. The host panelist needed to start driving, he ended up hanging up on everyone. I found that you can't honestly interview someone while you are driving?? You can tell the Panelist did not have a list of set questions they like to ask it was very impromptu, they spoke over each other. I would of had a list of questions and in order in which each person wanted to ask questions. \nEveryone was very nice but not very talkative it was hard to connect, they didn't show their faces on the web meeting but wanted you to show yours; odd! Good Experience very telling of the company.", "Interview Questions": "How do you deal with Conflict with in the workplace? "}, {"date": "29 Jan 2021", "title": "HIV Patient Navigator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AltaMed (Anaheim, CA) in Sept 2020", "Interview Descriptions": "HR Phone Screen, then panel interview, and then decision. \r\nHR rep reached out and asked why I wanted to work for Alta Med, what I knew about HIV prevention, what PrEP, and PEP was. Then there was a Panel Interview. \r\nI wasn't selected, although I did do research, felt prepared and have had about 2 years of community outreach under me. I actually found out 1 hour after my panel interview that I didn't get the job. How you may ask? Not by phone, not by email, but rather I looked at my applicant portal and it said not moving forward within an hour of my interview. I never received communication nor feedback after I requested it from every member on the panel as well as the HR representative. I felt like it was very unprofessional.", "Interview Questions": "Panel Interview was a bit disorganized, asked you why you wanted to work for Alta Med? describe your knowledge of PrEP/PEP,? How comfortable you are working with the LGBTQ+ community and your experience?  Asked about experience in public health. "}, {"date": "27 Jul 2020", "title": "Technical Support Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at AltaMed", "Interview Descriptions": "The people I interviewed with seemed great on the phone and in person, but it was easy to tell there are a lot of problems with staff. My concerns were proven after the panel interview. I reached out to the manager I interviewed with, a recruiting officer, and the senior officer just to check the status of the application, I received NO RESPONSE from them.", "Interview Questions": "Probably the best thing they did was doing that and showing me their true colors of unprofessionalism. After reading the reviews and walking in to their offices for the interview, I probably would not have accepted any way because of the environment, and even reading the reviews on the company."}, {"date": "17 Nov 2020", "title": "Behavioral Health Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at AltaMed (Los Angeles, CA) in Jul 2020", "Interview Descriptions": "The process was HR was smooth and great. The recruiter was very responsive and helpful. \n\nThe interview is where it got worse.  I hated this interview because I did not feel the clinical director put effort or time in asking me questions about my experience, qualifications, or personal background. She would read off my resume and then ask me an obvious question. Ex: my resume states I’m bilingual, her question “ are you bilingual?” She only asked me a few questions, had me repeat the answers in Spanish to verify if I’m bilingual. The interview was 10 minutes long. I spent days preparing for this interview and I felt very devastated that the interviewer herself didn’t ask questions where I’d be able to express my experience and it’s relation to the position. She didn’t ask me what my work ethic was or what I was interested in the position. She only asked repetitive questions that she read off my resume. It felt very unprofessional and messy.  \n\nI understand if she was tired or overwhelmed with work. It still would have been 100 times better if she wanted to reschedule or would have been more upfront about the situation. Was the interview bad because she had someone in mind for the position and decided to ask meaningless questions? Or was she simply tired and couldn’t prepare?", "Interview Questions": "Are you bilingual in English and Spanish?"}, {"date": "2 Nov 2020", "title": "Social Worker/Case Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at AltaMed (Los Angeles, CA) in Jun 2020", "Interview Descriptions": "Overall it was a very Difficult process to my personal opinion and not very friendly personnel to make you feel comfortable during the entire process  and questions were very strong based on experience.", "Interview Questions": "Questions were Based on experience "}, {"date": "24 Dec 2021", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AltaMed (Los Angeles, CA) in Apr 2020", "Interview Descriptions": "First, I interviewed with the program coordinator, then did a second round with project managers. The initial screening was to identify how you match with the program and which project aligns with your interests.", "Interview Questions": "What made you apply to this position?  \r\nTell me about yourself. "}, {"date": "8 Jul 2019", "title": "High School Pipeline Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 5 months. I interviewed at AltaMed in Jul 2019", "Interview Descriptions": "I was recruited for this role and interview w/several people over 5 months.  I was told an offer was coming to me in May and then heard in July that they decided not to offer it to me. What a terrible and unethical process from an unorganized company.", "Interview Questions": "How do you manage stress levels of employees?"}, {"date": "10 May 2022", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AltaMed (Los Angeles, CA) in Jun 2019", "Interview Descriptions": "I was instructed to arrive at a certain time, it turns out it was before the site opens, so I arrived earlier than needed and had to wait outside. Then the regional medical director was late, he then said he was late as he had gone to the wrong location initially.", "Interview Questions": "They asked that I discuss prior work experiences."}], [{"date": "22 May 2023", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at AltaMed (Los Angeles, CA) in May 2019", "Interview Descriptions": "I was told to arrive at 7:30, they open their office at 8:00 so I had to wait in parking lot, no bathroom access. One of the interviewers arrived late. His excuse was he went to wrong location.", "Interview Questions": "Standard interview questions. What are your strengths, what are your weaknesses? Where do you see yourself in 10 years?"}, {"date": "15 Apr 2019", "title": "Corporate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at AltaMed", "Interview Descriptions": "Interviewed in Oct 2018. Followed up afterwords, no decision yet. Followed up via email again a month later, told me they'd call me with update. I never received that call. \r\nIt is now April 2019 and I have not heard about the position or status or anything. Not one word.\r\nIf you hired someone else, tell me. If you cancelled the hiring for the position, tell me. \r\nIgnoring candidates after they have interviewed in person shows disorganization and lack of respect for the candidate.", "Interview Questions": "Standard interview questions. "}, {"date": "21 Apr 2019", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AltaMed (New York, NY)", "Interview Descriptions": "Started off with a phone interview which involved questions regarding experience and making sure minimum qualifications were met. In person interview was at corporate and involved more in depth questions about my experience and knowledge related to position. You really need to know your stuff, they were not just the usual generic \"why should we hire you\" the really want to make sure you are a good fit, which I think is a good thing. Every one I spoke with was very professional and pleasant. Got an offer within days. Can't wait to get get started!", "Interview Questions": "tell me about your experience with _______ program?"}, {"date": "31 Dec 2019", "title": "Behavioral Health Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AltaMed (Los Angeles, CA) in Apr 2019", "Interview Descriptions": "Interview went very smoothly. It was all about elaborating on my current skills and how it would contribute to the excellent patient service this company provides. The supervisor who interviewed me really wanted to know about my previous experience and EHR programs I knew how to use. There were no scenario questions for this interview.", "Interview Questions": "How long have you been a case manager for? "}, {"date": "23 Oct 2018", "title": "Outreach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AltaMed (Los Angeles, CA)", "Interview Descriptions": "Email, Phone, then in Person. Was told to wait a couple of weeks since there would be a certain process. I didn't hear back so soon, co I reached out to them.", "Interview Questions": "What is your work style"}, {"date": "16 Sept 2018", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at AltaMed", "Interview Descriptions": "Getting through HR, meeting with potential fellow team members, followed by 2nd interview with director. HR vets you for meeting the basic qualifications of the position but they don’t know the position that well. Also found the job description kind of vague, but more details were added during the interview.", "Interview Questions": "Describe a time you handled inter-team conflict."}, {"date": "27 May 2018", "title": "LVN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AltaMed in May 2018", "Interview Descriptions": "Phone interview went well, It was a phone interview took about 30 minutes asked questions about my resume and then some interview questions she told me i would hear from HR if i got selected in a few days.", "Interview Questions": "Why do you want to work for AltaMed"}, {"date": "5 May 2019", "title": "Registered Dental Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AltaMed in May 2018", "Interview Descriptions": "Met with site director and supervisor . They reviewed my resume and ask me about my duties in my past positions. They ask my different scenarios that could happened and how would I handle them.", "Interview Questions": "Why do you think you make a good fit for our team?"}, {"date": "6 Apr 2022", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 6 weeks. I interviewed at AltaMed (Los Angeles, CA) in May 2018", "Interview Descriptions": "Initial interview, HR and followed by regional medical directors. It was interactive and had a lot of space to ask questions. Came from an other state, did tour of facilities Straight forward process.", "Interview Questions": "Why I wanted to work serving the community"}, {"date": "15 Mar 2018", "title": "Food Service Aide Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at AltaMed (Los Angeles, CA) in Mar 2018", "Interview Descriptions": "I applied online. The recruiter was very kind, helpful and explained everything in detail. Went through my resume and explained the duties of the job  and that they will send in my resume to the hiring manager to go through and get back to me.", "Interview Questions": "Describe your experiences related to this job."}], [{"date": "11 Apr 2018", "title": "Analyst Managed Care Data Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at AltaMed in Mar 2018", "Interview Descriptions": "The recruiter from Commerce office reached out via email asking for a phone interview. I give her the dates.\r\nOn the day of the Phone Interview, I waste about 2 hours of my day waiting for her call. I decided to call her back, She tells me she made a mistake and saved my Interview for the next day. She calls me the Next day and the interview was basic phone screen questions. I ask her about certain employment forms, She told me she would get back to me in a week. I followed up with 2 emails and she has not responded yet. \r\n\r\nWorst Interview experience ever. Don't know how they do business here.", "Interview Questions": "Basic phone screen questions."}, {"date": "20 Dec 2017", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AltaMed", "Interview Descriptions": "interview with manager of case management and director of case management.  Read about interdisciplinary team. You will be conducting ICT weekly on at least 4-5 patients a week. You will also be leading team of LVN and coordinators. you will be responsible for 'supervising' their work.", "Interview Questions": "talk to me about motivational interviewing?"}, {"date": "10 Jan 2018", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at AltaMed (Los Angeles, CA) in Dec 2017", "Interview Descriptions": "The whole process was basically what do u do as a nurse assisatant. They ask u few questions and just make sure u have question for them at the end of the interview...", "Interview Questions": "What are the most people to work with"}, {"date": "3 Dec 2017", "title": "Licensed Vocational Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at AltaMed (Los Angeles, CA) in Nov 2017", "Interview Descriptions": "Phone interview with a recruiter for Urgent Care Position. Unfortunately the Urgent Care position I applied for was filled. Recruiter stated he will send my resume to another site. He explained the core values of the company and what they look for in a potential candidates.", "Interview Questions": "What type of work environment do you want to work in ?"}, {"date": "10 Oct 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at AltaMed in Oct 2017", "Interview Descriptions": "What the prcoess of getting hired is there chance to grow im this company  how many days will i work if hired. Would there be a chance if i wanted to go back to school would i", "Interview Questions": "how many days are u open?"}, {"date": "28 Oct 2017", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AltaMed (Garden Grove, CA) in Oct 2017", "Interview Descriptions": "I was contacted through both email and through a phone call to set up a phone interview. After the phone interview, HR at the end stated that they would like to set up an in-person interview. At the end of the interview,  I was informed that HR would get back to me. After a few days, I was called back for a second interview with a doctor and other staff member to see if I would like to work in a particular field that they offered and like the previous interview, was told that HR would get back to me soon. After a few days, I received a call from HR with a job offer.", "Interview Questions": "Why do you want to work with AltaMed"}, {"date": "21 Sept 2017", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at AltaMed (Los Angeles, CA)", "Interview Descriptions": "Very easy and simple. Interviewed by RN manager and Clinical Administrator. 2-3 days later got the job. Once job accepted, training at corporate office is 1 week long (Monday-Friday  8-5pm)", "Interview Questions": "How would you handle an upset parent, with no management on site? "}, {"date": "25 Sept 2017", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AltaMed (Los Angeles, CA) in May 2017", "Interview Descriptions": "First had a phone interview over the phone with a recruiter. About  a week later had an in person interview. About a week after that received a job offer.", "Interview Questions": "What do you do if a patients bp reading is high. "}, {"date": "3 Apr 2018", "title": "Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at AltaMed (Los Angeles, CA) in Mar 2017", "Interview Descriptions": "The process was straightforward, and it took place over the course of 2 weeks. They asked questions that were expected. I was offered a position within a week after my interview", "Interview Questions": "Why do you want to work with AltaMed "}, {"date": "15 Sept 2017", "title": "Regional Medical Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at AltaMed in Jan 2017", "Interview Descriptions": "Efficient and mostly friendly. The CMO appeared to have no interest in the interview.  \n\nI took a position with another health system. My complaint is that I incurred over 1000 dollars in interview fees, flying in and staying 3 nights. I requested reimbursement twice after submitting receipts and they simply never paid me.  If they can't even honor the expenses of recruiting I don't think that speaks highly of their integrity.", "Interview Questions": "Are you willing to learn to speak Spanish?"}], [{"date": "1 Nov 2016", "title": "Dental Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at AltaMed (Los Angeles, CA) in Oct 2016", "Interview Descriptions": "I applied online. After a month, I received an email from recruiter to complete an application as they were interested in my candidacy.  I didn't here back for almost three weeks. Invited for what amounted to be \"Phone Screening\", type interview. The interviewer was horrible,  asked nothing about my knowledge in the field.", "Interview Questions": "Very basic pre screen type interview questions."}, {"date": "4 Aug 2016", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at AltaMed", "Interview Descriptions": "Phone screen by recruiter for basic requirements. Phone screen by hiring manager who gave background on company and department. Panel interview by current staff with case study. Case study was simulated problem at AltaMed where I had to identify root causes and recommended resolutions and next steps.", "Interview Questions": "Why work for AltaMed?\r\nWhat was a team based win?\r\nWhat was a recent failure and how did you learn from it?\r\nHow to I practice personal improvement.\r\nTell me a joke."}, {"date": "2 May 2016", "title": "Representative AR I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AltaMed in Apr 2016", "Interview Descriptions": "It was  a one on one interview  where simple question  like \"tell me something  about yourself \" driscribe  a daily job duties the reason for leaving the lady  who interview me was nice  did not made me feel nervous  I was just nervous  on how to answer  her questions  on a positive  answer", "Interview Questions": "the reason for leaving my job"}, {"date": "26 Feb 2016", "title": "LVN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at AltaMed", "Interview Descriptions": "The site administrator interviewed me and was very nice. A little later the medical Director joined and she was also very nice. They asked standard questions and reviewed my resume with me. It was not anything scary or intimidating. I also got a tour of the facility. I dont recall how long it took but it was quick when i got the offer. It was a good experience. I enjoyed working there.", "Interview Questions": "Are you familiar with HEDIS?"}, {"date": "11 Apr 2016", "title": "Patient Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at AltaMed in Mar 2016", "Interview Descriptions": "It was a group interview and with 3 recruiters interviewing . They made everyone feel at ease and very welcomed. The pannel would ask a question and we all would take turns answering. We also role played how we would greet a patient coming in.", "Interview Questions": "what is exceptional customer service?\r\nwhat is the best customer service experience?\r\ndescribe a time you had a difficul customer experience."}, {"date": "23 Sept 2016", "title": "IT Network Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at AltaMed (Los Angeles, CA) in Jan 2016", "Interview Descriptions": "Interview process was done through the phone by Altamed representative. Interview was a pre-screening of what my work history was. The job I applied for was a full time job that included traveling and required Comp Tia A+ certification as a mandatory requirement.", "Interview Questions": "They asked me about my work history and skills related to my field."}, {"date": "27 Mar 2017", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 months. I interviewed at AltaMed (Los Angeles, CA) in Dec 2015", "Interview Descriptions": "Phone interview by recruiter, then they set up an interview with the hiring manager. Then they wanted a writing sample. I then took online tests for Microsoft skills testing. Once this was done, they called me about 2 weeks later to offer me the position.", "Interview Questions": "What are your skills that are similar to this position?"}, {"date": "2 Nov 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at AltaMed (Santa Ana, CA) in Nov 2015", "Interview Descriptions": "Panel interview. Intervied with RN supervisor,Front office supervisor and clinic administrator. I interviewed with 2 other candidates. Usual questions, weakness/strengths, how do you handle stress, where do you see yourself in 5 -10 years. A few vaccine questions.", "Interview Questions": "weakness/strengths, how do you handle stress, where do you see yourself in 5 -10 years. A few vaccine questions."}, {"date": "27 Oct 2015", "title": "Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at AltaMed (Los Angeles, CA) in Aug 2015", "Interview Descriptions": "I did an online application.  First level was HR screening and then there was a 45 mins interview with HR. The 2nd interview was in person with managers of projects for a little over an hour.  Then I was emailed to request a phone interview with a Physician which was about 30 minutes.  Then I had a request for another meeting with another physician for another interview, which got cancelled. In the meantime I had received a request to meet with the Top Management for final interview. The last interview was a little bit over an hour.  There was confusion with one of the panelists regarding the final meeting times and I was given a back and forth with emails, and texts a few hours before my actual interview. I ended up waiting over 2 hours for the meeting because of their confusion in scheduling.", "Interview Questions": "What would you do in the first 90 days after employment?"}, {"date": "20 Aug 2015", "title": "Front Office PSA II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at AltaMed (Los Angeles, CA) in Jul 2015", "Interview Descriptions": "Online application was challenging to submit. Had to enter information multiple times and there was an assessment took over 30 minutes to complete. Recruiter, Mrs. Vargas, was very professional and gave me detailed information about the job and expectations. Had an interview at the clinic and the staff was great non intimidating interview felt comfortable and interviewers were prepared. Received timely follow up from Recruiter and was happy with my experience at the clinic.", "Interview Questions": "Tell me about a time you gave up something that was important to you in order to help a less fortune group or individual?"}], [{"date": "8 Jul 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at AltaMed (Los Angeles, CA) in Jan 2015", "Interview Descriptions": "Asked a series of questions based on situational scenarios or past experiences. Pretty basic interview questions. Can you handle this, this and this. DO you feel comfortable doing x and y. What experience do you have in that.", "Interview Questions": "Tell me about a time where you failed?\r\n\r\nWhat did you do?"}, {"date": "14 Nov 2014", "title": "Internship Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at AltaMed", "Interview Descriptions": "phone interview and second round in person with supervisor you'll be working with\r\nphone interview is basic behavioral and resume questions with current interns in your position\r\nsecond round is much of the same thing except with two supervisors", "Interview Questions": "how to manage multiple priorities, tell you about yourself, projects you've taken a lead on"}, {"date": "4 Feb 2014", "title": "Business Intelligence Supervisor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at AltaMed", "Interview Descriptions": "Interviewed 3 times.  Provided a past work portfolio.  Initial interview with HR. Then panel interview 2 more times afterwards.  Be very confident in your experience.  This is a Healthcare company, but they were willing to overlook healthcare experience outweighing experience in other requirements.", "Interview Questions": "What would you say is your weakness and how to do plan to overcome it?"}, {"date": "29 Jan 2014", "title": "Clinic Administrator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at AltaMed", "Interview Descriptions": "Took way to long.....", "Interview Questions": "What are your thoughts about unions?\r\nTell me a time you dealt with a difficiult co worker?\r\ntell me a time you had to go against your boss?"}, {"date": "19 Jul 2014", "title": "Trainer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at AltaMed in Oct 2012", "Interview Descriptions": "Absolutely the longest interview process I have ever experienced.  Numerous interviews with several levels of management scheduled and then rescheduled. Some were interviews while others did all the talking.  It felt like the interviewer was not prepared.", "Interview Questions": "Tell me about your high school experience.  "}, {"date": "6 Jun 2010", "title": "Clinical Management Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at AltaMed (Los Angeles, CA) in Nov 2009", "Interview Descriptions": "HONESTLY THE most unprofessional interviewing experience I've been subject to in my long executive health care career. Sadly this from their dir. of staffing & HRVP. Keywords 4 AltaMed: unprepared, rude, condescending no return calls, late, arrogant, very parochial attitudes, AVOID AVOID AVOID AT ALL COSTS!", "Interview Questions": "None, they were quite unprepared, and stumbled often, this from the VP of HR and director of staffing.  "}]]