[[{"date": "4 May 2023", "title": "Associate HR Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Center For Employment Opportunities in Apr 2023", "Interview Descriptions": "The recruiter reached out to me very quickly via email, after I applied online to schedule an initial phone interview. The phone screen was super informative, and went really well. We quickly scheduled an interview with the hiring manager. The hiring manager interview was over Google Meet. It went extremely well. The hiring manager was very transparent and expectations of what was expected of the successful candidate were laid out. Significant time was set aside for me to ask questions. Lastly, I had a panel interview, which like the first two rounds, went very smoothly. I sent in my references and received an offer shortly after. The recruiter is the one scheduling the interviews and doing the reaching out, and she was incredible. An interview tips sheet is provided before every round, which was helpful. Overall, a very smooth and efficient process.", "Interview Questions": "Very thoughtful and thorough interview. The tips sheet provided is really incredible. They ask your behavior/STAR questions, as about previous work, etc."}, {"date": "22 Jan 2023", "title": "Job Coach Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Center For Employment Opportunities", "Interview Descriptions": "Had a couple of interviews. Took them a very long time to get in touch with me since my application then didn't get back to me after my last interview.", "Interview Questions": "Why did you apply to CEO?"}, {"date": "27 Jan 2023", "title": "Strategy Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Center For Employment Opportunities (New York, NY) in Jan 2023", "Interview Descriptions": "HR will reach out regarding interview scheduling 30 min screening interview with Manager Assignment to evaluate technical skills (data analytics, critical thinking, communication) Panel Interviews with prospective team members Final offer letter", "Interview Questions": "Behavioral questions (Tell me about a time when..) Technical Questions"}, {"date": "8 Feb 2023", "title": "Job Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Center For Employment Opportunities in Jan 2023", "Interview Descriptions": "Every person was super open, conversational, and welcoming! The process only took a few weeks. I am very excited to move forward with the Center for Employment Opportunities. Overall a positive experience.", "Interview Questions": "What past experience has prepared you for this role?"}, {"date": "20 Mar 2020", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Center For Employment Opportunities", "Interview Descriptions": "There was a telephone interview and an in-person interview. The telephone interview went fine but with the in-person interview, it really didn't seem the interviewer knew what the company needed in a hire for the position. The interview went well and there were talks of contact and further steps in the interview process. \r\n\r\nAfter writing a thank you email for the in-person interview, and a follow up email one week later, I heard no response whatsoever from the company.\r\n\r\nI'm glad to know early on that they don't take their word seriously, rather than later.", "Interview Questions": "Tell us about yourself. "}, {"date": "9 Sept 2021", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Center For Employment Opportunities (New York, NY) in Aug 2019", "Interview Descriptions": "After a phone interview, a 2-3 hour \"assignment\" and an in-person panel interview, they never responded.... and I later learned that the entire team I interviewed with had moved on to new jobs.", "Interview Questions": "Technical questions about building email marketing strategy"}, {"date": "23 Jul 2019", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Center For Employment Opportunities (New York, NY) in Apr 2019", "Interview Descriptions": "A lady took me into a conference room and asked questions about how I handle situations at a workplace and how do I organize my workload.  It was a calm environment but some of the questions were very similar to each other it felt repetitive.", "Interview Questions": "When was a time you were faced with a challenge?"}, {"date": "30 Mar 2018", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Center For Employment Opportunities", "Interview Descriptions": "Two video interviews and one in person interview. Very conversational. Not intense.  This company seems highly organized, with evidence based work.  I am excited about the opportunity and am glad I applied.", "Interview Questions": "Tell me about your interest in this job?"}, {"date": "11 Oct 2017", "title": "Crew Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Center For Employment Opportunities in Sept 2017", "Interview Descriptions": "I didn't have an interview it was a group orientation that lasted for two days and we started working soon after that. They gave us a book,boots, and a couple of pages front in back to different sites we plung in at. This only last for 75 days.", "Interview Questions": "N/A"}, {"date": "21 Jul 2017", "title": "Job Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Center For Employment Opportunities", "Interview Descriptions": "There were 2 interviews.One was with the direct manager of the position. The second was with the director. They asked formal and informal. Be yourself and express how you plan on assisting thers in reaching their goal. Training is given when hired.", "Interview Questions": "How do you deal with a resistant person? "}], [{"date": "2 Mar 2017", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Center For Employment Opportunities (New York, NY) in Nov 2016", "Interview Descriptions": "I applied online. First I had a phone interview, then two in-person meetings. The person that interviewed me continually interrupted me, didn't listen, and kept saying I wasn't good for the job. Then why did you invite me in...? I explained why I was interested, was told I was one of the finalist, but never heard back after the last interview.", "Interview Questions": "Why do you want this job?"}, {"date": "12 Nov 2016", "title": "Maintenance Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at Center For Employment Opportunities (New York, NY) in Oct 2016", "Interview Descriptions": "The interview process was intense and very active they asked very questions and made me feel very comfortable. They also made sure to provide refreshments,it was very informal and they behaved with respect and dignity. I felt very respected it was a great experience for me and I appreciate having the opportunity to work with these guys.", "Interview Questions": "How will you improve the company?"}]]