[[{"date": "7 Mar 2019", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 days. I interviewed at Meridian Health (Muncie, IN) in Feb 2019", "Interview Descriptions": "The interview was very relaxed, but maintained an appropriate level of professionalism. The interviewer was very personable and easy to talk to. In addition to the interview, I also received a brief tour of the facility.", "Interview Questions": "Have you had experience working with this particular population? "}, {"date": "28 Jun 2018", "title": "Patient Care Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Meridian Health", "Interview Descriptions": "Phone interview and two in-person interviews with managers. The whole process took a little less than a month. Standard interview questions. Didn’t take the job because it said days on the posting but then they said I needed to work overnights instead.", "Interview Questions": "What are your weaknesses?"}, {"date": "2 Mar 2018", "title": "Director of Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Meridian Health (Neptune, NJ)", "Interview Descriptions": "HR phone screen and then onsite interview.  They said they would get back to me and I never heard anything.  I reached out a number of times to both HR and hiring manager.  No response - no call, email or auto form rejection.", "Interview Questions": "Standard "}, {"date": "25 Apr 2019", "title": "Case Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Meridian Health (New York, NY) in Jan 2018", "Interview Descriptions": "Microsoft office ability and personality testing was used after an hour long  interview. Met other staff, explained passions and experiences within the medical field. Was given a tour of the facility as well.", "Interview Questions": "Why do you see yourself as a good fit at Meridian? "}, {"date": "20 Nov 2017", "title": "Utilization Management Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Meridian Health (Detroit, MI) in Nov 2017", "Interview Descriptions": "My phone interview was pretty direct and straight forward.  The questions was pretty common interview questions.  I'm pretty glad they didn't ask tricky questions.  Some employers love to ask questions to trick you up.", "Interview Questions": "The one question they asked was \"Describe a job that would you would love to go to when waking up in the morning."}, {"date": "8 Aug 2017", "title": "Member Benefit Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Meridian Health (Detroit, MI) in Jul 2017", "Interview Descriptions": "It was job fair style and it was a very similar experience to what everyone else has said. Applied on a Friday and was called back that following Monday. I had a phone screen, was given the personality test and then got a call to schedule an interview. Arrived and waited while three sets of people interviewed everyone. When it was done they said it would take 2-3 weeks to hear back.", "Interview Questions": "Which core value do you associate yourself with?"}, {"date": "21 Oct 2016", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meridian Health", "Interview Descriptions": "Very long and drawn out. It took a while between initial hire and start day. Was asked to print out orientation agenda to bring to orientation days. Would have wished for a more seamless process and a little higher pay. Otherwise, all went well once it got started.", "Interview Questions": "About my experience."}, {"date": "7 Sept 2017", "title": "Ultrasound Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Meridian Health in Oct 2016", "Interview Descriptions": "The interview was just like any other interview. The hiring process was extensive which is normal for the medical field. I had to get several vaccinations, a physical, drug test. I also had to go on two orientations.", "Interview Questions": "How would you handle things in a stressful situation? "}, {"date": "23 Sept 2016", "title": "Community Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Meridian Health (Chicago, IL) in Sept 2016", "Interview Descriptions": "Mer with HR and a team member for interview, great energy from both of them. It was a one on one interview and both of them asked different questions. They really wanted to get to know me as a person and took the time to answer my questions about the position and the company. The attire is business casual and there was even a worker there who was dresses in a Tshirt and jeans, I at first thought she was a volunteer or intern but after talking to her in the hallway found out that she had been working for the company for 4 years... I loved the atmosphere and how it felt like a family and how easy going and laid back everyone was but professional.", "Interview Questions": "Why I choose to work in healthcare, What would my past team members say about me, tell me about yourself"}, {"date": "8 Sept 2016", "title": "Staff Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Meridian Health (Holmdel, NJ) in Aug 2016", "Interview Descriptions": "First I had an interview with a recruiter at corporate headquarters then a follow up interview with the DON of the facility. Both interviews were comfortable and laid back.  the facility staff were friendly and happy to answer my questions. The process was not stressful or difficult. The facility residents seemed well cared for and content. the grounds were well maintained..", "Interview Questions": "Why do you want to be a nurse? \r\nTell me about yourself?\r\nTell me about a time where you went above and beyond in your job"}], [{"date": "19 Jul 2016", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Meridian Health", "Interview Descriptions": "Panel interview..very light and informal..other supervisors were interviewing me as well for their teams..zoomed in on certain aspects of my resume and questioned me on it..followed up around 2 weeks later..got the ball moving on the hiring process..from interview until start date about a month and a half.", "Interview Questions": "What are your future career goals?"}, {"date": "1 Jun 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Meridian Health", "Interview Descriptions": "Difficult to get through the computers filters but if you keep trying you will eventually get an interview.  Interviewers are professional and try to find the right placement for you even if it is not in their department. Once you get offered a position you get set up for orientation which is roughly a month later.", "Interview Questions": "What would you improve about your nursing skills?"}, {"date": "19 Apr 2016", "title": "Care Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Meridian Health (Chicago, IL) in Apr 2016", "Interview Descriptions": "The interview process was not too bad. Well organized. However, there are multiple applicants interviewing for the same position. Like others have already mentioned, it is similar to a job fair. I was interviewed by someone from human resource and another by the team leader of the department.", "Interview Questions": "Tell me about yourself."}, {"date": "11 Sept 2016", "title": "CMA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meridian Health (Neptune, NJ) in Feb 2016", "Interview Descriptions": "Interview was good. No issues, went quickly and efficient. Team was positive and polite.\r\nGood question and answer session. Clean and healthy environment. Good team culture.Happy with interview. I would reccomend to friends", "Interview Questions": "Am I familiar with Excel?"}, {"date": "8 Dec 2015", "title": "Payroll Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meridian Health (Charlotte, NC) in Dec 2015", "Interview Descriptions": "Very professional. Evaluated skills and explained expectations of the position. Met some of the people that would be assisting with the position. Overall a very nice company and people to work with. Everyone in the halls or I passed was friendly and smiling. The atmosphere is very nice. Business casual dress attire.", "Interview Questions": "Strongest asset. \r\nWeaknesses."}, {"date": "10 Nov 2015", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Meridian Health in Oct 2015", "Interview Descriptions": "Applied online and heard back within just a few days to come onsite for an interview. First met with the HR generalist and IT director who were both very kind and friendly. However the last group I met with were the hiring managers who were unbelievably rude and condescending. I typically am confident during an interview but this one actually left me wanting to cry towards the end. It was all topped off with an aptitude test, which inevitably didn't go well because I was still upset over the previous interview. Good luck to anyone who ever comes into contact with these particular individuals. Anyway I finished off the day with the HR generalist assuring I would hear back in just a week and it's been a month now and no one has yet to return my email or phone call. It's common courtesy to let someone know their candidate status after coming in for an onsite interview. This was the worst interview and the worst HR department I've ever dealt with.", "Interview Questions": "Know every detail of your resume, and be ready for them to bash on your experience and credentials."}, {"date": "29 Jul 2016", "title": "Medical Receptionist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Meridian Health (Brick, NJ) in Oct 2015", "Interview Descriptions": "I first had a telephone interview and then was asked to come in for a second interview. Overall, I felt the interview went pretty good. They were very informative about the job and all aspects involved. They answered all of my questions.", "Interview Questions": "Are you will to travel to different sites?"}, {"date": "3 Sept 2015", "title": "IT/Programmer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meridian Health in Aug 2015", "Interview Descriptions": "Started with normal phone interview. Was then interviewed 3 separate times by different managers and project leads. Everyone was incredibly friendly. For the most part it was HR style questions trying to gauge what type of person you are and your approach to different situations. It was capped off with an aptitude test with questions very similar to the SAT", "Interview Questions": "HR style questions followed by an aptitude test"}, {"date": "27 May 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Meridian Health", "Interview Descriptions": "I applied online as I had received an email that there was a job opening. A week had gone by and I had received a call. (Later finding out that they only really went with applications that had a resume attached). The pharmacy manager was the person who contacted me for the interview two days after the call.", "Interview Questions": "Are you good at calculations? Are you willing to work overnight? Can you stay if the weather is extreme? Is your ride to work reliable?"}, {"date": "12 Nov 2015", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meridian Health (Wall, NJ) in Feb 2015", "Interview Descriptions": "I got a call from the recruiter asking me to come in, then I interviewed with the recruiter briefly before meeting the assistant manager. Then once I was there the manager above her briefly came in.", "Interview Questions": "They did not really ask questions, they just told me about the job and asked me if I thought it would be a good fit."}], [{"date": "19 Jun 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Meridian Health (Clifton, NJ) in Jan 2015", "Interview Descriptions": "2 step interview\r\nfirst met with manager of unit, then with staff members of the unit that I would be on.  I initially submitted a resume and filled out the online application.  There is also a medication and skills testing as well.", "Interview Questions": "Discussed experience and a 5 year plan"}, {"date": "20 Dec 2014", "title": "Budget Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through a staffing agency. I interviewed at Meridian Health", "Interview Descriptions": "Started as an office temp as do many of their new hires and worked the first budget year as an office temp and the was offered a full time permenent position. Most of the office staff was brought in that way and still is.", "Interview Questions": "Worked as a temp, proved I could do the job that way"}, {"date": "16 Oct 2014", "title": "Greeter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Meridian Health", "Interview Descriptions": "Interviewer was nice and welcoming.  Asked about strengths and weaknesses, future goals, plans, etc.  Explained hiring and training processes and said HR would contact in approximately 2 weeks if hired.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "30 Jun 2014", "title": "Senior Auditor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Meridian Health", "Interview Descriptions": "First HR called and asked about my background. Then I had an in person interview one on one with the Director of Internal Audit and then a Senior Auditor. They said I would hear back in a week. Three weeks later still interviewing and wanted an audit report.", "Interview Questions": "Lots of background questions and tell me about a time when."}, {"date": "20 Jan 2016", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Meridian Health in Nov 2013", "Interview Descriptions": "Interview with VP in corporate then interview with Direct Supervisor then wait to hear from recruiter for offer. Once offer made background check was needed then a screening at occupational health", "Interview Questions": "How your experience can help the company?"}, {"date": "13 Nov 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Meridian Health (Wall, NJ) in Jun 2013", "Interview Descriptions": "The HR recruiters were not very helpful. The entire process from applying online to getting hired took 7 months. The interview itself was average. Once I was interviewed the process moved quicker. It was hard to find to find someone in the meridian health network to hire a new grad. Most jobs listed required experience.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "24 Sept 2015", "title": "Compliance Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meridian Health (Detroit, MI) in May 2013", "Interview Descriptions": "Went for an interview, and discussed: \r\n\r\nCoordinated compliance projects between the legal and compliance departments and the life and property/casualty insurance business units.\r\n- Privacy Notices\r\n- Financial Crimes Enforcement Network (FinCEN) bi-weekly and annual reports\r\n- Draft Non-Disclosure and Confidentiality Agreements\r\n- Administer Insurance Department Communications system to monitor correspondence", "Interview Questions": "what is your background?"}, {"date": "28 Nov 2012", "title": "Senior Human Resources Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Meridian Health (Neptune, NJ) in Aug 2012", "Interview Descriptions": "Candidates had already been identified for positions I had applied for, but recruiting manager kept in touch regarding other opportunities.  Met with the HR Manager for a position being created, brought back for interview with Director and third interview with senior management team.  HR Manager kept me warm for 2 months before I was ultimately told I wasn't a fit for the position.  Hard to believe it took 8 people and 2 months to determine fit.", "Interview Questions": "N/A"}, {"date": "12 Dec 2016", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Meridian Health (Wall, NJ) in Jul 2012", "Interview Descriptions": "It was a lengthy process. You first have an interview with the talent representative which conducts a survey. Then I have 3 interviews following. I was hired about 2 months later.", "Interview Questions": "Why do you want to work for Meridian."}, {"date": "1 Apr 2016", "title": "Nurse Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Meridian Health (Wall, NJ) in Apr 2012", "Interview Descriptions": "The present model for interviewing is different than when I was hired. My experience was a more conversational interview than the template one in use today. During the process we spoke about the role and discussed how my talents would fit the position. The leader interview was preceded by a peer interview with the members of the team. This was also conversational in that they were explaining what they were looking for and asking how I thought I would fit.", "Interview Questions": "From Leader: We are in need of someone with a good eye for detail yet have the vision to take on unit based quality projects and see them through. How do you think your experience and skill set fits our need?"}], [{"date": "22 Sept 2010", "title": "Hospice Assistant Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Meridian Health (Tinton Falls, NJ) in Apr 2010", "Interview Descriptions": "Applied online, received a phone call within one week of sending my resume, had a one-on-one preliminary interview with the Coordinator.  I was told then that if I made it to the next phase, I would be interviewed by the human resources dept and given a drug test and background check.", "Interview Questions": "Tell me something about yourself."}, {"date": "21 Feb 2013", "title": "Mental Health Clinician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Meridian Health in Sept 2009", "Interview Descriptions": "you will apply online and they will call to schedule interview. Sometimes a follow up group interview.", "Interview Questions": "Just the usual, expected questions about qualifications, experience, strengths, weaknesses. "}]]