[[{"date": "13 Feb 2023", "title": "Internal Comms & Employee Experience Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Autistic Society", "Interview Descriptions": "Straight forward, friendly, written test with a two to one interview. Usual star questions, give a situation, what the task was you needed to do, what action was taken and result", "Interview Questions": "Tell us a situation you found difficult and how you dealt with it"}, {"date": "16 Apr 2023", "title": "Partnerships Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Autistic Society in Feb 2023", "Interview Descriptions": "Those who interviewed me were very nice and made the interview feel more chatty. I answered questions and then completed a task related to the role within half an hour.", "Interview Questions": "What made you apply to this role?"}, {"date": "19 Jul 2022", "title": "Autism Information Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at National Autistic Society", "Interview Descriptions": "Initially, I found the process to be smooth and informative. The interview invite was clear and sent out in good time. However, I was shocked at the communication post-interview. It was clearly stated that candidates would hear back on a particular date, but this date passed and I had to send two follow-up emails to eventually get a generic email saying that I wasn't successful. The email said that feedback could be provided which I replied and asked for. I never heard back after that. Considering this is an autistic charity interviewing an autistic candidate, I am shocked at this poor communication and inability to follow through on agreed actions.", "Interview Questions": "What do you feel are some of the key challenges for autistic people?"}, {"date": "4 Jun 2022", "title": "Support Worker Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Autistic Society", "Interview Descriptions": "Interview pannel of two interviewers was asked to meet in one of the branches. Personal questions asked about CV as well as specific questions relating to the job and situations etc.", "Interview Questions": "\"Name one instance where you have come up with a creative solution to a problem you have faced in a previous position\""}, {"date": "18 Mar 2022", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at National Autistic Society", "Interview Descriptions": "Casual conversation at job fair\r\nLed to a telephone interview, about 15 minutes in length\r\nrelaxed interview\r\nquick to respond\r\nfriendly and informative\r\ngood communication\r\ngood initial training \r\ngood friendly co workers and management on arrival", "Interview Questions": "Previous experience\r\nknowledge of autism\r\nskills and hobbies\r\npersonality type"}, {"date": "16 Jun 2021", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at National Autistic Society (Neath, Wales) in Nov 2020", "Interview Descriptions": "Interview process was good. Interviewed by two of the house managers and they were absolutely lovely, and very relaxed. Mostly asked questions on their form that they needed to fill out. Overall great experience.", "Interview Questions": "What is your understanding of Autism?"}, {"date": "21 Aug 2020", "title": "Support Worker Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at National Autistic Society", "Interview Descriptions": "sent cv, was invited to in person interview, declined in favour of a skype interview. technical issues, was meant to be an hour long but was 20 minutes. overall underwhelmed", "Interview Questions": "how would you help someone with autism"}, {"date": "24 Aug 2020", "title": "Support Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at National Autistic Society (Cardiff, Wales) in Jul 2020", "Interview Descriptions": "I applied online and was invited to an interview within 2 weeks. The interview process was good, staff was very friendly and made me feel comfortable. I have also received a list of interview questions and got like 5 minutes to read through them and get myself ready. I have also been provided with a glass of water. Overall good experience. \r\n\r\nI was not successful and did not get a job and received a feedback that although I had some relevant experience and good knowledge there were other candidates that were closer match to the role.", "Interview Questions": "What is your understanding of autism?\r\nPlease outline your experience to date that is relevant to this role.\r\nWhat is your understanding of challenging behaviour and do you have any experience working with people who present with challenging behaviour?\r\nWhat are the most important values  a good support worker should have ? How so you show these values?\r\nHow might you support an autistic person to make choices?\r\nHow could you teach new skills to an autistic person. Tell me about a time you have taught a new skill to someone. \r\nWhat would you do if you were concerned about the welfare of an individual you were supporting?\r\nWhat skills and knowledge do you have that you could pass on to autistic people or use within the NAS?\r\n"}, {"date": "7 Sept 2020", "title": "Marketing Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 3 weeks. I interviewed at National Autistic Society (London, England) in Dec 2019", "Interview Descriptions": "A recruiter reached out to me on LinkedIn and submitted my CV.  I had 3 interviewers and took 20min for a task + 30 min interview including presenting the task.", "Interview Questions": "what do you know about the charity?"}], [{"date": "14 Apr 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at National Autistic Society (London, England) in Jan 2018", "Interview Descriptions": "Two interviews, panel competency interview. Interview process fairly straight forward. People were friendly.\r\nOffices are in City Road in Angel, very easy to find from the station\r\nNice offices, team seemed friendly\r\nI was offered the post but decided to accept another job offer", "Interview Questions": "Demonstrate how you work in a team"}, {"date": "6 Mar 2017", "title": "Performance Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at National Autistic Society (Islington, England) in Jan 2017", "Interview Descriptions": "I interviewed for Performance Data Analyst at the National Autistic Society. I was interviewed by 3 people and I found them very friendly and diligent.\r\nI was asked to do a presentation for 10-mins and the interview and questions followed after.\r\nAlthough the interview went according to plan, I felt the room was not suitable for doing a presentation and it was hard to use the chart-board to write words as there was very little space.\r\nAlso, the feedback process after the interview was slow. I received an email that I did not get the offer, however I was told to email back for further feedback.\r\nI tried a number of times to phone the hiring manager and email, but did not receive a reply for a while - this was frustrating at first, however after composing a long email, I finally got some feedback, which was good.\r\nThe feedback - I agreed in parts and disagreed with other parts. I prepared a lot for the presentation, but the feedback didn't reflect this fully.\r\nNevertheless, it was quite a long haul and was disappointed I didn't get the offer.", "Interview Questions": "Describe a situation when you have been under a lot of pressure from conflicting demands?"}, {"date": "24 Feb 2017", "title": "Lead Project Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at National Autistic Society (Godalming, England) in Nov 2015", "Interview Descriptions": "They ask a little bit about why you want the job and ask scenario questions to see how you would react, to assess how suited you are to the job. I found a lot of the questions were common sense things, however as a psychologist and someone who works well with children that may just be my opinion rather than a generalized view. The interview was very laid back, it was in a professional setting but I was made to feel very comfortable which may be partially why I found the interview provoked little stress. The process was very much an open dialogue with a back and forth nature and as long as you have prepared and are suitable for this job then you also should not find it very stress inducing.", "Interview Questions": "Why do you want to work with us?"}, {"date": "18 Mar 2016", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at National Autistic Society (Wellingborough, England) in Sept 2012", "Interview Descriptions": "Was told I was successful but took their time in organising an interview +4 months.\r\nInterview was not particularly professional as the team of interviewers weren't really sure who was asking what and when..very confusing for the interviewee. Quite embarrassing to be honest.", "Interview Questions": "How do you feel you can contribute to the lives of the service users?"}]]