[[{"date": "12 Oct 2022", "title": "Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Idaho State University", "Interview Descriptions": "Short and not a great time to go into the office due to a collegiate event on the same day so it was not ideal and I did not feel that I was being paid attention to by interviewer", "Interview Questions": "How old are you now"}, {"date": "1 Jul 2022", "title": "IT Service Desk Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Idaho State University (Pocatello, ID) in Apr 2022", "Interview Descriptions": "Zoom meeting with three people. They will go over basic interview questions. They are looking for someone with basic tech and customer service knowledge. They want someone easy to train, open schedule, and someone who will last because they have an extremely high turnover rate.", "Interview Questions": "Describe how you overcame a difficult situation at your previous employment."}, {"date": "24 Dec 2020", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Idaho State University (Pocatello, ID) in Dec 2020", "Interview Descriptions": "It was a web interview. Start with reviewing the job descriptions. Three interviewers are attended and each of them asked me two to three questions. Time for me to ask them a question.", "Interview Questions": "Your skills. Reference from previous coworkers. Managing tasks. "}, {"date": "18 Jan 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Idaho State University (Idaho Falls, ID) in Dec 2020", "Interview Descriptions": "I applied through higheredjob.com\nAbout 3 weeks later, I received an interview invitation.\nIn the first-round interview, I was interviewed by 5 professors at ISU. The interview is around 45 mins.\nProfessors are very nice, BTW.", "Interview Questions": "questions like: \nwhy this position? \nintroduce yourself?\nwhat's your career goal?\nintroduce a project you have done."}, {"date": "9 Jul 2020", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Idaho State University", "Interview Descriptions": "Sit down Semi-formal with 2 interviewers lasted 20 mins got the job it's not bad just be honest they hire for character, not a skill. They are all very chill and nice people.", "Interview Questions": "How to troubleshoot a mouse that won't move."}, {"date": "13 Nov 2018", "title": "Disability Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Idaho State University (Pocatello, ID)", "Interview Descriptions": "The interview process was highly informative and streamlined. I was first contacted on the phone and spoke with one of the coordinators. After we spoke, I was contacted again to ask that I come in to meet with the department director. There, I was able to meet many of the department's employees, and everyone was friendly and engaging. I first interviewed in-person in front of a panel of coordinators, and then 1:1 with the director. The director was wonderful to work with, readily answering all my questions and demonstrated superb listening skills as I recounted some of my education and background that prepared me for the position. The questions were to-the-point and allowed for detailed discussion about anything I was unclear on. Highly recommend both ISU and Disability Services for employment opportunities.", "Interview Questions": "How has your employment up to this point prepared you for working with students with disabilities?"}, {"date": "16 Jan 2018", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Idaho State University (Pocatello, ID)", "Interview Descriptions": "I was interviewed for a faculty position at ISU. Let me say this that the department was full of politics with no clear guidelines. Colleagues were pulling legs of each other. Candidates were already lined up and the university was inviting \"unrelated\" candidates to complete hiring formalities for others. Be prepared to notice what you would not like to experience during an interview at a serious institution.", "Interview Questions": "General interview questions."}, {"date": "13 Sept 2021", "title": "Classified Staff Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Idaho State University (Meridian, ID) in Jul 2017", "Interview Descriptions": "Fast, straight forward. From application submission to interview, the timeline was short with excellent communication. Concise questions and the interviewers responded to all question from the interviewee. Overall great experience.", "Interview Questions": "What my experience was, and why I was seeking a different position."}, {"date": "24 Feb 2016", "title": "Drafter Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Idaho State University (Pocatello, ID) in Feb 2016", "Interview Descriptions": "The hiring process took about 2 weeks, the interview was scheduled with only 2 days of anticipation. \r\nThe interview was alright. 10 questions that were asked to every candidate, plus extra questions based on your resume and previous answers. Overall, the director who was interviewing me was kind and I felt pretty comfortable during the interview.", "Interview Questions": "Did you have the patience to work on high pressure environments?"}, {"date": "28 Jun 2015", "title": "Instructional Faculty Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Idaho State University (Chantilly, VA) in Jun 2015", "Interview Descriptions": "The process wasn't bad. They all went around the table and introduced themselves before asking their assigned question. What really unnerved me is that in the beginning, when my Skype camera wasn't working, I heard them say some snide remarks as I was fixing the problem. Then, throughout the interview, they would give each other looks, almost as if though I wasn't there. HELLO! Interviewers! I know this was Skype but If you can see me, I can see you!! So that ultimately came off as rude to me. After that, I withdrew my application, so naturally I did not get an offer.", "Interview Questions": "What question did you prepare for prior to this interview that we did not ask?"}], [{"date": "28 Apr 2015", "title": "Office Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Idaho State University (Pocatello, ID) in Dec 2014", "Interview Descriptions": "Very basic, nothing unexpected. Tell me about yourself, and other basic interview questions. Interviewed by very friendly warm empolyees. It was a relaxed friendly interview. It was a two on one interview, and notes were taken by those interviewing. My interview took about half an hour. They are looking for the best fit for the position, not just looking to hire anyone. You needed to have a high attention to detail to fill this position and be able to demonstrate it.", "Interview Questions": "Do you have high attention to detail? Asked to demonstrate."}, {"date": "8 Dec 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Idaho State University (Boise, ID) in Oct 2014", "Interview Descriptions": "Depending what department you will be working in, is how many people will be interviewing you. You go into an office and answer general questions that an administrative assistant would know, talk about your experience, and then talk about specific needs they would need from you depending on the department that you are applying for. If you get called back for the job you will have to do a background check.", "Interview Questions": "What computer programs can you work?"}, {"date": "8 Aug 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Idaho State University (Pocatello, ID) in Aug 2014", "Interview Descriptions": "All I did was go in and ask the professor for a research position. The research was outlined and I was questioned on previous research experience and from there I was hired. There was nothing difficult about this interview process. Future candidates only need to show interest and enthusiasm and they will get the job.", "Interview Questions": "Why are you interested in research?"}, {"date": "31 Dec 2013", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at Idaho State University (Pocatello, ID)", "Interview Descriptions": "The position is based on the overall GPA through out career and knowledge of the areas which the department are looking for. 3 Professors has to give recommendation letters.", "Interview Questions": "oral questions regarding previous experience."}, {"date": "8 Feb 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Idaho State University (Pocatello, ID) in Nov 2013", "Interview Descriptions": "This was an extremely casual interview. I was referred to this department by an academic adviser and I had a good reference from her. Met and talked with the supervisor for 10-15 minutes.", "Interview Questions": "Describe your management experience. "}, {"date": "28 Dec 2015", "title": "AV Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Idaho State University (Pocatello, ID) in Sept 2013", "Interview Descriptions": "Set up Take down AV equipment for events. Plus light duties in keeping AV closets clean and organized. Some repairs to equipment is required. Also aid Facilities crew when busy.", "Interview Questions": "Can you hook up AV equipment? Followed with a demastration."}, {"date": "22 Aug 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Idaho State University (Idaho Falls, ID)", "Interview Descriptions": "The interview was email based since I was living in the Middle East prior to this. Dr. Dan Ames was very nice and polite in the interview.", "Interview Questions": "I can't remember any."}, {"date": "13 Mar 2013", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Idaho State University", "Interview Descriptions": "Position advertised for one month, committee review, phone interviews, campus interviews.", "Interview Questions": "All pretty standard interview questions.  Be prepared to know Carnegie Classification of ISU."}, {"date": "5 Jun 2014", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Idaho State University (Pocatello, ID) in Aug 2012", "Interview Descriptions": "the interview was very laid back. I was practically handed the job. Later they wanted to hire me for additional positions. The application process was a simple form that you can pick up from the front desk and they email you about coming in for an interview. The interview is more like and orientaiton.", "Interview Questions": "No difficult quesitons"}, {"date": "22 May 2016", "title": "Assistant Professor (Tenure Track) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Idaho State University (Pocatello, ID) in Feb 2012", "Interview Descriptions": "Everyone was very friendly and welcoming, and also did their best to court me as a candidate. There was much socializing after the teaching demonstration and research presentation. I felt like I got to know my colleagues very well by the time I left after two days or so, and had a positive experience overall. I met with regular faculty, adjuncts, chairs, and deans. The university did their best to represent as many factors of the university as they could. This was a positive experience, but also misleading, considering how many negative qualities exist at the university in terms of morale, faculty support, and financial compensation.", "Interview Questions": "What unique qualifications do you have to contribute to developing this new program we have in [X]?"}], [{"date": "21 Sept 2012", "title": "Custodial Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Idaho State University (Pocatello, ID) in Jun 2011", "Interview Descriptions": "The interview was very informal.  A 4-person panel.  Very relaxed setting", "Interview Questions": "What do you see as your biggest weakness?"}, {"date": "19 May 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Idaho State University (Pocatello, ID) in Feb 2011", "Interview Descriptions": "Interviewed by individual faculty, Dean, and VP of Research. I gave a talk to faculty and students. I was toured to facilities associated with the university. I was not asked to teach a sample class.", "Interview Questions": "If I intended to stay permanently or to use it as a stepping stone."}]]