[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Flexible, supportive, fun, interesting work", "rating": "5.0", "reviewer_affiliation": "Current Intern, less than 1 year", "job_date": "8 Nov 2019", "job_title": "Anonymous Intern in Vancouver, BC", "duration": "N/A", "pros": "My experience working at VACFSS has been nothing but positive. Being a co-op student, I was looking for an opportunity where I could be supported to learn and have a mentor to help me through it. I work in a small department where it's just my supervisor and I, and it's very busy. I was given the opportunity to be involved in as many initiatives as I was interested in being part of, and of which many were outside of the standard responsibilities of that co-op position. As a result, what I have learned in my short time here (about 5 months) would probably correspond to a year or more of experience in a full-time communications coordinator role. \r\n\r\nMy supervisor has also been flexible with my schedule and allowed me to work compressed hours to allow me to continue to go to school and finish my degree. I worked autonomously, and always encouraged to think creatively and really made to feel like I was a part of the team, and that my opinion was valued.  \r\n\r\nIt's a very supportive environment, free of gossip and competitiveness. The agency cares about its staff, and has gone the extra mile to help create a healthy work-life balance and providing in-house resources for stress and mental health support. For instance, they bring in a yoga instructor every week, masseuse twice per month, a full-time Elder who is there to support you through any work-related or personal issues. They also hold regular cultural practices such as smudges, which I found to be an amazing experience. \r\n\r\nThere is also free parking around all three offices which is an extra bonus.", "cons": "At times, the approval process for projects can take a while"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "great supportive company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 May 2023", "job_title": "Administrative Assistant in Vancouver, BC", "duration": "N/A", "pros": "work life balance, pay, pension", "cons": "remote work and growth opportunities limited"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Promises so much and then targets it’s own.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Mar 2023", "job_title": "Social Worker in Vancouver, BC", "duration": "N/A", "pros": "There is so much need and a joy to see success.", "cons": "There is so much apathy, back stabbing, ineffective management."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "VACFSS", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "5 Jun 2018", "job_title": "Family Preservation Counsellor in Vancouver, BC", "duration": "N/A", "pros": "good if you are a mature self-starter with good ego strength and are NOT interested in office politics or drama. if you want an opportunity to work directly with the community and actually do hands on work with parents and families this could be for you.\r\n\r\nchild protection is very challenging, and your team leader and/or coworkers can make it ok or just add to the drama. you can always switch teams or apply to a different department  - family preservation, guardianship, resources\r\n\r\ngood pay, flex days, massage for staff on site, counseling for staff on site, all the bad coffee you can handle!!", "cons": "lots of drama if you want it. it's  a young organization with young management so things are still sorting themselves out"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "A Work in Progress", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Oct 2014", "job_title": "Administrative In Nature in Vancouver, BC", "duration": "N/A", "pros": "Good exposure to Aboriginal cultural programs/events for clients and staff.\r\nCould use some work to ensure the service providers/coordinators are providing relevant and well-organized workshops.  Some service providers are not always clear in their delivery.  Nonetheless, it provides a balanced view for participants and the providers themselves.  E.g. relearning what Aboriginal culture/traditions are.", "cons": "Supervisors & Managers could definitely build on their own leadership skills.  Often times they are not \"open-minded\" to new and updated ways of managing the heavy administration involved in dealing with various government agencies.  Systems are slow and dated.  What's particularly frustrating is the teams of people who do not know how to use the resources that are available to them.  IT services are severely lacking here and again, I have to wonder if those currently working in IT roles are fully capable/qualified.  Leadership is aging and many waiting out retirement (PSPP).  Often they come and go and their senior team members are left to handle the day-to-day operations.  The culture here is tense and it is a typical unionized environment where most work within a silo.  Lower-level employees are more or less stuck in their roles with little creativity for more - unless you are gearing for a career as a Social Worker.  If so, this is a good place for you to get in some learning. The overall building are rundown and the cleaning/maintenance is not very well managed."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Vacfss careers", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Jan 2017", "job_title": "Anonymous Employee in Vancouver, BC", "duration": "N/A", "pros": "Great opportunity to organize and get your experience in the child welfare sector.", "cons": "Chronically under resourced, over worked and no pay incentives."}], []]