[[{"date": "19 Jun 2023", "title": "Communications Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Resources Institute (New Delhi)", "Interview Descriptions": "It was friendly and the interviewers largely wanted to get to know you. Questions were about experience and the the scope of the role was briefly explained. They didn't have any technical questions.", "Interview Questions": "Do you have experience with the responsibilities of the role?"}, {"date": "22 Jan 2023", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "Very fast and responsive. I had 3 rounds of interviews. One with the reporting manager, one with the team and then the HR round. The interview process was a conversation more than an interview to try and understand past experience and interest in the sector", "Interview Questions": "Questions related to past experience and interest in the sector"}, {"date": "10 Oct 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "Friendly, on time, good experience. CV asked expectations asked, synergies explored, discussed other ambitious projects, Salary discussed., benchmarks & renumeration. company culture, climate change in India and in the global south", "Interview Questions": "What is your salary expectation"}, {"date": "10 Mar 2023", "title": "Legal Counsel Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at World Resources Institute (Mumbai) in Apr 2021", "Interview Descriptions": "good. It was taken by HR and CEO. The questions asked were mainly about the past experience and FCRA compliances. Final interview as taken by Legal Counsel, US. The interview process was about 30 days long.", "Interview Questions": "What was your past experience"}, {"date": "5 Dec 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "There were two stages of interviews. Both of them were semi-technical. The interviews went good but the interviewers didn't give any feedback or result. It's been more than two months now and I don't think they will contact me again.", "Interview Questions": "If I get a PhD offer while I am working for them, will I accept the offer? "}, {"date": "7 Dec 2020", "title": "Epp Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute", "Interview Descriptions": "By Microsoft team about 20 minutes they have taken the interview by 2 persons. They were very calm, positive and supportive throughout the interview.\r\nThen they asked me some questions about my previous jobs. The questions they have asked was very logical.", "Interview Questions": "Tell me something about yourself was the first question."}, {"date": "1 Oct 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Resources Institute (Mumbai) in Jan 2019", "Interview Descriptions": "seven rounds of interview and written test. Technology was used so that travel can be avoided, they also take panel interviews to save rounds. The turn around time is slow and it becomes difficult to track the progress.", "Interview Questions": "Tell me something about you?"}, {"date": "15 May 2017", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at World Resources Institute (Mumbai) in Sept 2016", "Interview Descriptions": "It was a good experience. The process was timely. I was made to feel comfortable.\r\nthey took some time to get back to me after the interview with their final offer but it was worth the wait. There were 2 rounds of interview and both were crisp and precise. The questions were strictly work related o gauge my understanding of the field, my previous experience, and to check my fitment to the organization culture and environment.", "Interview Questions": "My understanding of the current trends in the field"}, {"date": "11 May 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "Telephonic interview. I got an internship through a competition. I was easier and there were less questions, but the the organization did not seem to be interested in taking interns.", "Interview Questions": "About the area of internship and what ideas do I have of my own?"}, {"date": "3 Oct 2015", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at World Resources Institute", "Interview Descriptions": "The interview process was pretty straight forward. They make you comfortable to speak during the interview process. Also they are very open minded people. \r\nThe process consists of :\r\n1) Exam\r\n2) Personal Interview", "Interview Questions": "What did you do during your work at Doordarshan?"}]]