[[{"date": "29 Nov 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GAVI ALLIANCE (Geneva)", "Interview Descriptions": "Behavioral interview questions. 2 interviewers (1 senior consultant, 1 head of programme). Overall positive experience. I got rejected but they took time to provide thorough feedback after that. This is something rare in a recruitment process, I highly appreciate it.", "Interview Questions": "Behavioral intvw questions e.g How did you tackle internal challenges (taking into account different opinions, etc)?"}, {"date": "26 Oct 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at GAVI ALLIANCE", "Interview Descriptions": "Pretty straightforward and not too complicated. A few questions toward my experience and what I was covering at my current internship, a few questions how I deal with different scenarios, and questions to my availability", "Interview Questions": "How do you prioritize tasks?"}, {"date": "20 Sept 2022", "title": "Senior Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at GAVI ALLIANCE (Geneva) in Sept 2022", "Interview Descriptions": "Firstly,  i had a written test and 4 question to record my answers, with a time limit of 1-3  minutes per question. I had 1 hour also for the wtitten test.", "Interview Questions": "Tell us a time you had a conflict with a coworker"}, {"date": "8 Apr 2023", "title": "Senior IT Business Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at GAVI ALLIANCE (Geneva) in Jun 2022", "Interview Descriptions": "Interview offer and planning, all through telephone & email were well planned. The interview session was very professionally handled. However, feedback was delayed/not given until I requested it months later.", "Interview Questions": "Why did I want the job with GAVI, and why I felt I qualified for it?"}, {"date": "14 Jun 2022", "title": "Senior Manager, IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at GAVI ALLIANCE (Geneva) in Apr 2022", "Interview Descriptions": "Tri/Selection de dossier post envoi sur le portail dédié \r\nTest Video : Enregistrement de reponses sur l'application Sonru \r\nTest écrit chronométré à uploader sur la plateforme\r\nEntretien panel avec le manager et les clients internes\r\nEntretien Manager\r\nEntretien final avec le Directeur", "Interview Questions": "Questions types CBT sur divers skills : \r\nresolution de conflit, gestion d'équipe/leadership, gestion de la relation client/partner, gestion de projets/programmes, conduite du changement "}, {"date": "23 Feb 2022", "title": "Legal Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at GAVI ALLIANCE", "Interview Descriptions": "It was a zoom based panel interview, around 45 minutes with approximately five to six questions covering competence-based assessment and substantive areas. One of interviewers seemed to be a bit distracted by something off the screen during the entire time of the interview.", "Interview Questions": "N/A"}, {"date": "19 Apr 2022", "title": "In-Country Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at GAVI ALLIANCE (Geneva) in Feb 2022", "Interview Descriptions": "Very involving interview process with 3 different processes- SONRU video, written assessment and panel interview. I lost out to an internal candidate which was obviously disappointing. However, I found the process to be engaging and exciting and an overall pleasant and professional experience.\r\nWhile I understand that going up against an internal candidate is usually insurmountable, I do hope that we all got equal consideration", "Interview Questions": "Several competency-based, and motivational questions"}, {"date": "15 Nov 2021", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at GAVI ALLIANCE", "Interview Descriptions": "Application submission, followed by computerized video interview, panel interview, then final round of six individual 1:1 interviews. Total process took about six months from initial submission to offer. \nApplication was a standard cover letter and CV. Video interview used the SONRU system - it was a timed one way video interview, giving you a series of questions with a few minutes to prepare and then a few minutes to record your response. The questions were fairly easy and straightforward. \nThe panel interview included hiring manager, HR rep, and another team member and was about situational competence. The panel phase used the competency-based interview technique with many of the questions asking you to take them back to a particular time or example that will serve to illustrate the competency they are looking for based on your past experience. You will be asked to briefly provide a context, then focus the majority of the time on your actions and then explain how the situation resulted.\n1:1 interviews were more two-way and allowed me to ask many of my own specific questions about the role/team/strategy.", "Interview Questions": "What is your motivation for applying for the role? \nWhat challenges might you encounter if your were successful in being recruited? How would you handle them? \nWhy do you see yourself at Gavi as opposed to another organization or private sector? \n"}, {"date": "1 Jun 2022", "title": "Strategy Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at GAVI ALLIANCE (Geneva) in Nov 2021", "Interview Descriptions": "I had a series of interviews: first three interviews for the Manager role, but at the final step I was told they were looking for someone more \"senior\", and redirected me to an internship opportunity. \r\nI had two interviews for the internship and was told I did not get the offer.", "Interview Questions": "Why do you want to work for GAVI? "}, {"date": "1 Nov 2021", "title": "Senior Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at GAVI ALLIANCE (Geneva) in Sept 2021", "Interview Descriptions": "First was a short introductive interview where you have to record yourself while answering questions about yourself, your motivation and career path.\nThen a 1H30 written exam focus on the topics mentioned in the job offering.\nThen a panel interview based on competency questions (soft skills). Then two one-on-one interviews", "Interview Questions": "How do you convince people to do something ? Tell me a time when you had to manage a conflict ?"}], [{"date": "13 Jul 2021", "title": "Head of Procurement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at GAVI ALLIANCE (Geneva)", "Interview Descriptions": "The best and most comprehensive interview process I have ever been through.  After applying on-line I was invited to an automated video interview, then a written test and a panel interview. Every step along the was was explained and I really felt that GAVI was trying to get the best out of me.  Even tips like how to do a good video interview, asking for a pause to gather your thoughts in an interview or how best to answer competency based interview questions were provided in a friendly manner and were really useful.  The process is still nerve-wracking but if you prepare you'll be ok. One thing to note, the interview process is 4 months and NOT 6-12 months as I thought - something I messed up. This is critical if you are trying to match up the end of one contract with another.", "Interview Questions": "Tell us about a time when you led a negotiation"}, {"date": "22 Jun 2021", "title": "Senior Project Specialist, Portfolio Management Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at GAVI ALLIANCE (Geneva)", "Interview Descriptions": "The interview process was creative, accomodating and very easy to understand.  Kudos to the HR team!!\r\n\r\nQuestions asked in the written test were relevant to the position's main duties/responsibilities. \r\n\r\nThe Panel Interview was open-minded and sought an alignment between my experience and Skills/Core Competencies.", "Interview Questions": "Why do you want to work for GAVI?"}, {"date": "26 Apr 2021", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at GAVI ALLIANCE", "Interview Descriptions": "The interview preceded a written test with 3 questions, which were very practical and hands down. The initial interview consisted of an automated video interview, where you are speaking to a blank screen with questions listed on the screen and a timer for each question. I felt this process was very uncomfortable and stressful. The face to face interview is definitely more relaxed", "Interview Questions": "How to address high level speakers"}, {"date": "10 Feb 2021", "title": "Head Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at GAVI ALLIANCE (Geneva) in Feb 2021", "Interview Descriptions": "GAVI has the best recruitment process that I have experienced in my entire career thus far (almost 20 years of experience)! The interview process was focused on both sides learning about each other, not simply about GAVI picking a “candidate” with appropriate skill set.   The recruiter listened so carefully that she sensed my needs & constraints and scheduled extra \"conversations\" about the expected lifestyle.  I believe this kind of empathy and transparency as early as the recruitment process itself (not 3 months into the job) shape a fulfilling work environment and ultimately enable staff to have impact.  Thank you so much to the GAVI recruitment team (Armelle!!!) and the expert panels that shortlisted and considered me.", "Interview Questions": "First question is always about your understanding of the role. Then technical and competency questions based on the JD. "}, {"date": "22 Feb 2023", "title": "Senior Assistant Human Resources Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at GAVI ALLIANCE in Mar 2020", "Interview Descriptions": "There were several online interviews (because of Covid at the time) . I have meet different people from their team and the process was smooth, effective with an open conversation.", "Interview Questions": "Talking about my past experiences"}, {"date": "27 Jan 2020", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at GAVI ALLIANCE", "Interview Descriptions": "One asynchronous video interview, one time-limited case study, one online interview and the final round with around 6 interviews back to back in Geneva. Case study is challenging as there is not enough time to complete the tasks properly.", "Interview Questions": "What are your experience and skills in project management? Give us an example."}, {"date": "21 Oct 2019", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at GAVI ALLIANCE (Geneva) in Apr 2019", "Interview Descriptions": "It was detailed and asked about my past experience and skills. I explained my past experiences that had to do with the work that was similar to the position that I was applying to. The interviewer was kind, patient, and asked good questions that gave me a good idea of what I was getting into.", "Interview Questions": "Do you know how to use Excel?"}, {"date": "4 May 2019", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at GAVI ALLIANCE (Geneva) in Nov 2018", "Interview Descriptions": "Exam first, which consists of different questions depending on the position for which you are applying; there is no way to really prepare for it. If you do well, or are selected it is followed by a panel interview, which can be quite long and demanding.", "Interview Questions": "Open-answer scenarios, to see how you'd respond to a given situation. "}, {"date": "9 Mar 2019", "title": "Senior Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at GAVI ALLIANCE in Jun 2018", "Interview Descriptions": "It was a multistage process that started with a Sonru interview, had a written test, then a panel interview (which was my last).\r\n\r\nMy initial impression was that the process was relatively transparent. HR ultimately called me to tell me I was up against internal candidates that were better equipped to hit the ground running.", "Interview Questions": "Most questions were technical, related to the role"}, {"date": "11 Mar 2018", "title": "Senior Manager Resource Mobilization Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at GAVI ALLIANCE (Geneva) in Jul 2017", "Interview Descriptions": "There were several steps to the interview process including a video interview, a written test, and a panel interview with a diverse group representing the team, HR and other teams", "Interview Questions": "How do you win support from others not in your organisation"}], [{"date": "17 Sept 2016", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 4 weeks. I interviewed at GAVI ALLIANCE", "Interview Descriptions": "It is not a traditional face to face interview, but through video recording . One has questions popping up and record one's reply using webcam. There is no human interaction, which could come across as quite weird for some.", "Interview Questions": "why interested in GAVi"}, {"date": "1 Dec 2015", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at GAVI ALLIANCE (Geneva) in Nov 2015", "Interview Descriptions": "Video interview instead of regular phone screen and mass emails through SONRU system, no  human interactions, looks like they want to save the world but don't really care how. Candidate experience is clearly not a priority for GAVI. No second chance or someone to ask you to be more precise on your answers.", "Interview Questions": "How is your current job related to Gavi's open positions"}, {"date": "30 Sept 2014", "title": "Senior Programmer Manager - Monitoring and Evaluation Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at GAVI ALLIANCE (Geneva) in Jul 2014", "Interview Descriptions": "J'ai d'abord passé un entretien en ligne grâce à un logiciel appelé Sonru. On vous pose une question, vous avez une minute pour la lire, puis ça enregistre votre réponse. J'ai eu 5 questions, elles étaient toutes techniques, et une question finale pour savoir si j'avais quelque chose à ajouter. Les questions avaient un rapport avec ce qui devrait se trouver dans un cadre des résultats, etc. J'ai ensuite reçu ce test écrit :\n\n\nConsigne : veuillez consulter le cadre de suivi et d'évaluation d'une demande d'un pays pour un soutien GAVI Health Systems Strengthening. En pas plus de 2 pages, écrivez une critique du cadre de suivi et évaluation, ainsi que de la demande du pays. Vous voudrez bien identifier les points forts, les limites et les conseils pour l'amélioration du modèle et de la candidature du pays.\n\nJ'avais 60 minutes pour répondre à cela et envoyer ma réponse par e-mail. J'ai ensuite eu un entretien avec un panel des RH, le responsable de suivi et évaluation et une personne de l'équipe de soutien du pays. Le processus, de ma candidature à l'entretien avec le panel, a pris 4 mois. L'entretien avec le panel été basé sur des questions sur mes compétences (avec des questions de type STAR et plus).", "Interview Questions": "La question clé avec laquelle ils ont commencé était de savoir quels indicateurs devraient être liés aux renforcement des systèmes de santé."}, {"date": "26 Feb 2014", "title": "Responsable de direction Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at GAVI ALLIANCE in Jan 2014", "Interview Descriptions": "Entretien de sélection vidéo, test écrit de trois heures, entretien avec la haute direction (panel), les ressources humaines et le responsable du recrutement, vérification des références, test de personnalité", "Interview Questions": "Ils ont posé plusieurs questions basées sur la compétence"}, {"date": "12 Oct 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at GAVI ALLIANCE (Geneva) in Jun 2011", "Interview Descriptions": "Lengthy and through interview process.  Interviewed in Geneva, Switzerland and Washington DC with some 1on1 and some panel style.  Questions were challenging and process was engaging.  Questions probed my technical knowledge, communications and organizational skills.  Also, their were several questions regarding my values and judgment for example, how would I handle certain predefined situations.", "Interview Questions": "Explain previous experience and challenges"}]]