[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Patient Focused and a Great Workplace", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Feb 2022", "job_title": "Finance Director in Chicago, IL", "duration": "N/A", "pros": "If you are serious about helping people who can't get access to Healthcare, this is the place. The staff and volunteers are really passionate about the services provided and go above and beyond for the patients. They have a flexible and remote work environment. Medical benefits start after 15 days. They have a fitness incentive. They have PTO days available for parental leave and civic engagement. They work at creating growth opportunities and celebrate the great work of the staff.", "cons": "There are none. It's really a great place to work!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Mission", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Sept 2022", "job_title": "Patient Service Specialist in Chicago, IL", "duration": "N/A", "pros": "-Mission driven\n-Great Services\n-Good Location", "cons": "Poor pay\nNo room for growth"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great mission/values; great as starting off point", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Jan 2022", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Workers truly care about the mission\nFront line and patient facing workers are great", "cons": "Low pay\nNot much room for advancement\nPoor leadership"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good Job, Not Career", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "27 May 2021", "job_title": "Valet Attendant in Chicago, IL", "duration": "N/A", "pros": "Flexible Schedule, Lots of Overtime chances", "cons": "Some bad coworkers cause more work for you"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Terrible management that treats staff like garbage", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Mar 2013", "job_title": "Front Desk Administrative Staff in Chicago, IL", "duration": "N/A", "pros": "Staff is dedicated, patients are appreciative, work is interesting.", "cons": "Bad, bad benefits.  No maternity leave, they make you pay 20% for not good insurance, only 2 weeks of vacation a year, they only pay you for 37.5 hours a week but don't tell you that until you've started.\r\n\r\nNo advancement.\r\n\r\nUpper management (not direct supervisors) talk to staff with no respect.\r\n\r\nDirector makes 6 figures while front desk makes not even $20000 a year.\r\n\r\nThere are over 5 open jobs right now.  Turn over is very high (8 people have quit this year alone).  What does that tell you?"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Great mission, enjoyable work, terrible treatment of employees.", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jan 2014", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Wonderful patients\r\nGreat way to gain experience in the public health field\r\nExcellent staff (excluding upper management)\r\nMany opportunities for networking with influential people in the medical field\r\nGreat programs serving uninsured Chicagoans\r\nMission to grant access to complete and quality healthcare and health education is unparalleled. \r\nExcellent donors to support CommunityHealth programs", "cons": "While the way CommunityHealth treats its patients is excellent, they seem to not stick to their mission with treatment of employees. Employees are made to feel guilty and shamed for seeking change and improvement in their treatment. Upper management are unsupportive and disconnected from staff. Executive director is unapproachable intentionally and pretends that she is an open book and open to criticism. The only way to describe the assistant executive director is just a mean woman whom everyone fears and avoids. CommunityHealth uses a culture of fear to control and manipulate its employees. Even though everyone enjoys the actual work, the treatment of employees leads to burnout and extreme dissatisfaction with work life. Staff turnover in 2012 and 2013 was roughly 40%. Excluding upper management, almost no one is able to stay at CommunityHealth for more than 2 years. Upper management is unwilling to address this issue and refuses to take measures to fix this trend, which must lead to decreased productivity and much staff time being spent on re-hiring. Most people leave on very tense terms because of unhappiness, and upper management hides this from board members and donors. The salaries, especially for front desk staff, are appallingly low, even for non-profits. Since salaries and wages are low one would expect excellent benefits. This is not how CommunityHealth operates. With the low wages, insurance and benefits are terrible. Even with a staff of 95% women, there is absolutely no maternity leave, and women are forced to pay for 100% of their insurance to keep it if they choose to take unpaid leave. There is also no guarantee of a job when someone decides to return to work. Much more could be said here. It is very sad that a place that does such wonderful work treats its employees so poorly. Its mission is wonderful, but seems to apply only to patients and not to employees. Due to the vulnerability of staff with poor salaries and benefits, and no access to maternity leave, many staff would be in the same position as our patients."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Wonderful coworkers and patients, poor leadership and employee treatment", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Sept 2013", "job_title": "Professional in Chicago, IL", "duration": "N/A", "pros": "– - great staff: dedicated, passionate, helpful, low-drama, competent\r\n- patients: often grateful, good structure to help patients\r\n- lots of autonomy in your work\r\n- there is some lip service to the concern that staff morale is quite low, but little action other than token benefits (such as Xmas party or discounted movie tickets)\r\n- recent employee survey showed satisfaction on most things between 78-83%. The Executive Director expressed concern (although is so disconnected that she doesn't understand why, nor asks or engages to find out why). Executive Director is fake, out-of-touch with what is happening in the clinic. Says she’s worried regarding low employee morale, but then doesn’t do anything to address it.\r\n- there was a plan to hire a human resources consultant in order to fix the situation, but staff feels threatened by that since many human resources personnel seem to just reinforce management's philosophy", "cons": "- comparably lower benefits to other non-profits/clinics: low pay (they blame it on resources and then judge you if you if you negotiate for more); poor vacation benefits (only 2 weeks for the first 3 years); only paid hourly for 37.5 hours/week, but you must take a half-hour lunch that is unpaid. However, the ED makes $140,000+ and the Associate Executive Director makes $88K. They seem to have enough money for their salaries.\r\n- no maternity leave policy since not big enough for FMLA\r\n- worse is the motto is “no one should have to go without health care” but as soon as a female employee goes on maternity leave they cease to pay for her health insurance (meaning she either has to go on her partner’s insurance or go on welfare)\r\n- health care reform is around the corner and we are losing patients, but management won't discuss whether they are planning on downsizing staff. They say they will not be closing their doors, but nothing about whether jobs will be eliminated.\r\n- human resources try to make it seem like monthly employee potlucks and discounts on movie tickets are benefits, instead of real benefits like more paid vacation, paid maternity leave or better insurance (organization only pays for 80% of premium\r\n- high turn over (management has been there for 6-14 years, while staff stays for about 1-3 years). I’ve been there for less than 2 years and over 1/3 of the staff has turned over.\r\n- staff feels appreciated by each other, but feels unappreciated by management\r\n- few-to-no advancement possibilities\r\n- volunteer-based providers (doctors and nurse practitioners) -- so quality of care is based on volunteer commitment, not workplace accountability\r\n- Associate Executive Director has a reputation for extreme mood swings and poor treatment of employees and even yelling at  berating coworkers (grown adults!). Much of the issues in terms of turn over and employee morale seem to stem from her management, but upper management and the board don't seem to care or recognize it.\r\n- The organization needs new blood, new ideas and more progressive leadership that cares about employees in a genuine way."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Sept 2020", "job_title": "Communications Associate in Chicago, IL", "duration": "N/A", "pros": "A friendly work environment full of great people.", "cons": "There are no cons to working at this company."}], []]