[[{"date": "2 May 2023", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Facing History and Ourselves", "Interview Descriptions": "Phone interview for 15 minutes, asked standard questions (walk me through your resume, what would you like from this job, etc.). Afterwards, was told I'd hear back in 3-5 days but never did.", "Interview Questions": "What are you looking for in this position?"}, {"date": "16 Mar 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Facing History and Ourselves", "Interview Descriptions": "There was an initial E-mail screening asking about salary requirements (because they didn't put it on the application, which is odd and indicative that they have no pay equity and must hide new salaries from current employees). I did not get past this screening, which is fine. The main issue I had was that when I replied to her original email about salary requirements, she ghosted me and I had to follow up. Extremely unprofessional.", "Interview Questions": "Could you please let me know if your salary expectations sit within our range"}, {"date": "28 May 2022", "title": "Senior Level Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Facing History and Ourselves", "Interview Descriptions": "The process was Lengthy and quite time consuming. After initial application and cover letter the process included multiple rounds of interviewing in both 1:1 and panel formats, and culminated in a performance task.", "Interview Questions": "Describe your approach to equity?"}, {"date": "6 Nov 2022", "title": "Development Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Facing History and Ourselves in Oct 2021", "Interview Descriptions": "Interview process started with an initial phone intake interview with a representative from HR, followed by three virtual one on one interviews with supervisors. After the final interview supervisors contacted references, and then one week later called with a job offer.", "Interview Questions": "Tell us your career goals/plans in five years."}, {"date": "9 Oct 2019", "title": "Programs Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Facing History and Ourselves", "Interview Descriptions": "The interview process consisted of a basic phone interview and in-person interview, however, they never got back to me regarding if they wanted to continue with me or after the in-person interview which was disappointing.", "Interview Questions": "What is one experience in which you were successful working in a group and one experience in which you struggled to work in a group?"}, {"date": "2 Nov 2018", "title": "Area Sales Executive Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Facing History and Ourselves (Leeds, England) in Nov 2018", "Interview Descriptions": "20 minute telephone interview with recruitment team member, very friendly, informative and helpful .\n1st face to face interview with Ops Manager\n2nd face to face interview with a different Ops Manager.", "Interview Questions": "what can you bring to the role."}, {"date": "30 Jun 2017", "title": "ELearning Multimedia Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Facing History and Ourselves (Boston, MA) in Jun 2017", "Interview Descriptions": "This position was almost identical to a previous contract where I designed/developed elearning videos from scripts. During the phone screening, I described that previous gig in detail and shared a number of related files with her. At the end of the call she said the next step would be another round of phone screenings and then a design test (which, quite frankly, was a bit of a turn-off). In my experience, this is usually a bad sign; had she been impressed enough with me then she'd have closed the call by inviting me to a second interview (this is how every successful phone screening I've had plays out, if you made a good impression then they shouldn't have to \"think about\" whether or not you should advance to the next round). Sure enough, I received their rejection email three weeks later. The job continues to be advertised on their webpage, and I am curious as to whether or not they actually hired someone, as the position is a combination of at least three roles in one, graphic designer / instructional designer / programmer.", "Interview Questions": "Nothing out of the ordinary"}, {"date": "2 Jun 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Facing History and Ourselves (Brookline, MA) in Dec 2016", "Interview Descriptions": "Quick Process and engaging conversation. The employer was welcoming and made me feel very comfortable during the interview. After basic questions on skills, we spoke about current affairs, moral education, and politics.", "Interview Questions": "Why did you apply to FH?"}, {"date": "1 Nov 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Facing History and Ourselves", "Interview Descriptions": "For the most part a down to earth conversation. After covering the basic of my resume, experience, and aspects of the job, we talked about current news, weather, etc. Interviewers seemed more interested in whether I  was a match for the organization's environment rather than the job itself. I asked a few easy follow up questions and got comprehensive answers that didn't seem like a memorized script, that was a nice change.", "Interview Questions": "How do you prioritize and manage multiple projects with a variety of deadlines?"}, {"date": "28 Mar 2016", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Facing History and Ourselves (Brookline, MA)", "Interview Descriptions": "A phone interview followed by two in person interviews. The first was with two people who I would work directly with. The second interview I met more staff and the HR person. I declined the offer in the end because, although I was told the starting salary and title at the beginning of the process, the offer was for a lower salary and title.", "Interview Questions": "How would you set up an event?"}], [{"date": "30 May 2016", "title": "Program Assistant/Data Management Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Facing History and Ourselves (Brookline, MA) in Jan 2016", "Interview Descriptions": "Interview process was very intense and thorough. In the end I was overqualified for the position and the pay was very low. Although they appeared to be nice and friendly during the interview, i wasn't too impressed with the way they talked about themselves and the incumbent's position.", "Interview Questions": "The first thing they asked me was if I would be \"okay with 33K a year.\" That initial question about money threw me off and kind of made me leary of this company."}, {"date": "4 Feb 2015", "title": "Data Entry Support Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Facing History and Ourselves", "Interview Descriptions": "There was a phone screen interview first, and there weren't any surprises. I was asked to go through the position description and address the skills needed with my experience. The person I spoke with was very friendly and I was offered an in person interview, but I accepted a position elsewhere.", "Interview Questions": "Describe your background and experience. \r\nWhy are you qualified for this position?"}, {"date": "29 Oct 2014", "title": "Support Role Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Facing History and Ourselves", "Interview Descriptions": "Applied to a support role, got a call back in within a month and then scheduled a phone interview. However I did not hear from them after the interview.I was told that they had found a person who better fit the organizations requirements.", "Interview Questions": "What has been the most challenging role you have faced in your past professional experiences?"}, {"date": "28 Apr 2014", "title": "Director Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Facing History and Ourselves (Los Angeles, CA) in Mar 2014", "Interview Descriptions": "Submitted resume, phone interview and then personal interview. While very nice, the organization has not contacted me or replied to any correspondence in any way, as a still in process, next steps, still waiting or thanks but no thanks. It would be hard to understand why a firm that wants strong communicators to show such little interest in even a basic follow up.", "Interview Questions": "None, she did not ask questions relevant to the position. "}, {"date": "6 Aug 2017", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Facing History and Ourselves (Brookline, MA) in Jun 2013", "Interview Descriptions": "I had a 20-minute long phone call with Human Resources. Next, I had a 30-minute conversation with the hiring manager. Next,  I had  a group interview with eight people representing  broad spectrum of the organization. Finally, I met with the team I would be working with.  Within a few days of that interview I received an offer. The whole process took less than two weeks.", "Interview Questions": "Why Facing History? What about the mission resonates with you?"}, {"date": "3 Jul 2012", "title": "Support Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Facing History and Ourselves (Brookline, MA) in Jan 2011", "Interview Descriptions": "I went through 4 phases of interviews. The first was one-on-one, the second was with two decision makers, the third with HR and finally, my would-be boss. I quite liked the office (hangings, bookshelves, hardwood floors) except that there were mountains of paper everywhere and my interviewer was distracted, hurried, and late. While in the HR office, my primary interviewer had been running late, so I spoke with an HR representative until the phone rang and my interviewer screamed, \"I HAVE TO GO!\" so loudly that it felt like it was on speaker phone -- albeit it wasn't; the HR representative seemed embarrassed, and quickly ushered me up to snag a few minutes with my interviewer. There had already been a few re-schedules, and I was even asked to come at 5pm last minute because of a cancellation. I felt the process was all over the place, highly disorganized, and just plain odd. The first question I was asked upon sitting down was, \"Who are you?\"", "Interview Questions": "Who are you?"}, {"date": "1 Nov 2010", "title": "National/International Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Facing History and Ourselves (Brookline, MA) in Aug 2010", "Interview Descriptions": "First interview was a phone interview with the HR Assistant Director. Went very well. Second Interview was a group interview and than final interview was another group interview.", "Interview Questions": "What is your most difficult experience with a supervisor?"}]]