[[{"date": "5 Jul 2023", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hult International Business School (San Francisco, CA)", "Interview Descriptions": "Smooth and easygoing. Focus was on achievements and mentality. We wanted to show that we are willing to make work by our own side. Showing and proving side project and entrepreneurship skill has been a plus for me.", "Interview Questions": "Why did you choose Hult?"}, {"date": "30 May 2023", "title": "Head of Student Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hult International Business School (San Francisco, CA) in Apr 2023", "Interview Descriptions": "The interviewing process was simple, one interview with the hiring manager and then with the dean of campus. You have to have knowledge about organizing events and have great passion for working with students, clubs, and organizing events to build community for the student body.", "Interview Questions": "Experience doing student events? expand"}, {"date": "5 Feb 2023", "title": "Student Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hult International Business School", "Interview Descriptions": "Two stages First stages concentrates on behavioural aspect and prompt for flyers Second stage focuses on job role. The questions are based on time management, leadership, social media experience, events and operations.", "Interview Questions": "Q1. How do you measure success of a project? Q2. How do you manage your schedule? Q3. How adaptable are you? Q4. How active are you on campus?"}, {"date": "29 Aug 2022", "title": "Lead Communications and Events Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hult International Business School in Jul 2022", "Interview Descriptions": "I was told it would be 3 interviews, in the end I only had 2 and the person who was going to be my boss left unexpectedly and I didn't end up getting the job. Hult is going through a lot of changes right now so I'd just warn you to know what you are getting yourself into. It sounded like a good job but a lot of stress and unrest as they \"build the plane as they fly it.\"", "Interview Questions": "Tell me about yourself, why do you think you'd fit at Hult, etc., they were pretty tame and typical interview questions."}, {"date": "24 Dec 2021", "title": "Enrollment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Hult International Business School", "Interview Descriptions": "Amazing interview, very hands-on and realistic. We had role play. I talked about my background and I understood they hired me because of my distinct story. We role-played sending emails, cold calling, and turning undecided students into interested.", "Interview Questions": "How would you share your experience with a student?"}, {"date": "15 Feb 2022", "title": "Enrollment Advisor Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Hult International Business School (Miami, FL) in Nov 2021", "Interview Descriptions": "Met and conversed with 3 different members of their managerial team. They analized my experience, skills and even tested my performance in an inpromptu scenario. They were very understanding of my conditions and situations. And were able to find the most adapted position to my experience and skills.", "Interview Questions": "What motivates me to do well at this role?"}, {"date": "14 Jul 2021", "title": "Master Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Hult International Business School", "Interview Descriptions": "- 2/3 from application to offer. No difficult interview. The branding behind Hult is very  strong so do not be influnced by how they present you the school. Do you research and then decide if to apply or not.", "Interview Questions": "Tell me about your intership experience. \nWhy are you a good fit for Hult? "}, {"date": "11 Jan 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hult International Business School (Boston, MA) in May 2021", "Interview Descriptions": "Recruiter / Dean and Recruiter / Recorded Q&A / Onsite - teach a class in front of deans.\r\n\r\nThe process was very one-sided. Nothing much was shared about the school, its operation, course structure, etc.\r\n\r\nI had never heard about this school before, so I approached it as usual academic teaching position. I taught a basic mock class, surprisingly without any students, and was rejected because the material was too high-level. \r\n\r\nI was asked to teach the easiest and least technical version but it was not enough. \r\n\r\nIn the hindsight, I am glad that I did not join. I constantly felt like many things were intentionally left unclear, both about the institution and the specific job.", "Interview Questions": "N/A"}, {"date": "18 Apr 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hult International Business School", "Interview Descriptions": "quick and easy. no complaints. interviewed but ended up getting another job before going through the process. Every one seemed nice. no complaints from me. would consider them again. no complaints", "Interview Questions": "Standard questions no issues at all"}, {"date": "6 Apr 2021", "title": "Academic Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Hult International Business School", "Interview Descriptions": "Went through the first screening interview on Zoom. The. interviewer was very friendly and I felt extremely comfortable talking. Most of the questions were based around your reaction to specific situations that might arise on the job.", "Interview Questions": "How would you manage the stress of this job?"}], [{"date": "14 Jul 2021", "title": "International Student Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hult International Business School (Boston, MA) in Mar 2020", "Interview Descriptions": "The first interview was over the phone. Then I got invited to a very extensive interview process at the school where I was interviewed 1-1 by 3 different people and then I was interviewed by 6 staff members who would be my co-workers. Everyone was very friendly and mostly asked normal interview questions.", "Interview Questions": "What do you like to do in your free time?"}, {"date": "27 Apr 2022", "title": "Student Services Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hult International Business School (Cambridge, MA) in Aug 2019", "Interview Descriptions": "1. Phone Interview with Head of Student Services.\r\n2. Rotating group interviews with different team members including manager and other coordinators.\r\n3. Final Interview (on-campus or hybrid) with campus stakeholders including Campus Residence life team and  Director of Operations.", "Interview Questions": "Understanding the diverse international of Hult, how would you handle a disgruntled student who is being inappropriate?"}, {"date": "13 Mar 2019", "title": "MBAN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hult International Business School (Los Angeles, CA) in Jan 2019", "Interview Descriptions": "The phone interview lasts around 30 minutes. Group work experience.  A CHALLENGE, how did I deal with it. How do other people think of me. Different people have different question. Just write down answeres on the laptop and read it when answering the phone interview.", "Interview Questions": "My background"}, {"date": "10 Dec 2018", "title": "Enrollment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Hult International Business School", "Interview Descriptions": "- 2 interviews with many of the team managers\r\n- be sure to know well about the company and do research before\r\n- they call back to tell you next steps", "Interview Questions": "about yourself mostly and past experiences"}, {"date": "24 Mar 2022", "title": "Sale Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Hult International Business School (Miami, FL) in Oct 2018", "Interview Descriptions": "Good experience overall the people that work there were very kind and supportive in the process. I had 3 interviews wuth differnet team menbers and in a week I got the offer, very quick process", "Interview Questions": "Common questions - tgey want to know you first "}, {"date": "24 Jan 2018", "title": "Visa Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hult International Business School (San Francisco, CA)", "Interview Descriptions": "First phone interview with the manager. Then, on-site interview with the manager and director of the department. They're very nice and able to provide insightful information about the company and work culture.", "Interview Questions": "What are your weaknesses and strengths?  "}, {"date": "24 Jan 2018", "title": "Associate Director of Enrollment Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Hult International Business School", "Interview Descriptions": "I applied online and received an email for a Skype interview within a week. My first interviewer was an hour late, and only let me know after I followed up with an email. The first interview was very straight and to the point about whether I had the skills needed for this position. The company/culture was barely discussed, even when I tried to ask. We also discussed salary requirements, and I was told that my salary expectations were too high, without being told what salary level they were looking to hire for. My second interview (also over Skype) was more friendly. It was focused more on personality traits, but was clear that they were looking for specific answers to their questions. Each interview lasted about an hour. I ended up receiving an offer, but declined because they were completely unwilling to negotiate on the (extremely low) salary and benefits.", "Interview Questions": "Pick 2 personality traits that are your strengths and 2 that are your weaknesses."}, {"date": "22 Jan 2018", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Hult International Business School", "Interview Descriptions": "The dean asked for previous teaching evaluations, and demonstration of professional and academic mastery. After a conversation with the dean, I was invited for a guest lecture. Thereafter, I taught a single course on contract. When this course went well, the school offered me a longer contract.", "Interview Questions": "Are you prepared to emphasize teaching over research?"}, {"date": "12 Mar 2018", "title": "Enrollment Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hult International Business School (Boston, MA) in Jan 2018", "Interview Descriptions": "First interview via Skype, interviewer was late but we had a great conversation and it went well. I was told at the end of our call that I would be brought in for an in-person and would hear by the end of the week. I didn't hear back until mid-week the following week, even after following up that Monday. I thought the in-person interview went well, but didn't hear back for over a week. I followed up with my contact at the company who then said they would love to connect and we set up a time to talk the following day. She never showed up for the call and never responded to my follow up email. I found them to be very disorganized and unprofessional. If they aren't interested in moving forward with a candidate, just say so! The job search is daunting and difficult and recruiters take for granted that sometimes people's livelihoods hang in the balance. It's extremely disrespectful to take up someone's time and energy and give false hope.", "Interview Questions": "What do you know about Hult?"}, {"date": "6 Dec 2017", "title": "IT Project Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Hult International Business School", "Interview Descriptions": "It was fairly. Had some good hands on questions.  The difficult part was the intense training sessions, they had promised to help learn some softwares.It was fairly. Had some good hands on questions.  The difficult part was the intense training sessions, they had promised to help learn some softwares.", "Interview Questions": "Unexpected program experiences. that was something not to look forward to. Interviewer was great. Unexpected program experiences. that was something not to look forward to. Interviewer was great."}], [{"date": "9 Feb 2018", "title": "Associate Enrollment Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Hult International Business School (San Francisco, CA) in Nov 2017", "Interview Descriptions": "The interview process took a total of about 3 months. The first interviewer was late to my interview by an hour, then asked to reschedule for the following day. I proceeded to have two more interviews, and it took awhile to receive responses back via E-mails. The process was inconveniently long and unrewarding. I received an offer but declined because of the low salary level. They weren't willing to negotiate either.", "Interview Questions": "What are some of the qualities you look for in a job?"}, {"date": "31 May 2018", "title": "Global Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Hult International Business School (San Francisco, CA) in Nov 2017", "Interview Descriptions": "They asked me some behavioral questions and the main reasons for applying to that kind of position. They wanted to know mainly about my previous academic and professional experiences, as well how many times I failed and how I usually handle a difficult situation. The overall process took 5 days.", "Interview Questions": "Where do you see yourself in 5 years? "}, {"date": "6 Oct 2020", "title": "Enrollment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Hult International Business School (Miami, FL) in Apr 2017", "Interview Descriptions": "It was something really helpful because I was referred by someone. You don't have to be nervous and really pay attention to the questions so you can be certain of what to answer.", "Interview Questions": "What can you contribute to the office?"}, {"date": "12 Mar 2017", "title": "Seasonal Visa Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hult International Business School", "Interview Descriptions": "Applied online through EF website, got a call back less than a week later (basic questions, like why interested in job, some strengths I'd bring to it + salary requirements). This call was at night, which caught me off guard. At the end of the call they said they would follow up to set up a Skype call to interview (I was applying from across the country, so an in-person interview wasn't possible). Did the Skype interview the following week with two current employees. Throughout process, I only spoke to those working in the department I was applying to work in. Interview questions weren't particularly difficult, nothing too unusual, though there was one funner, role-play type question which I enjoyed. The interviewers didn't seem particularly engaged/excited, so I was unsure of my performance, but I did receive the job offer several days later.", "Interview Questions": "How do you manage a heavy workload?"}, {"date": "13 Mar 2017", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Hult International Business School", "Interview Descriptions": "I had a phone interview and then in person interview. had 2 interviews in the office. and got the offer two weeks after that. process was easy, they are not very organizer. there is no HR. weird management.", "Interview Questions": "how comfortable you feel on the phone"}, {"date": "5 Feb 2017", "title": "Student Recruitment Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hult International Business School (Boston, MA)", "Interview Descriptions": "There is no official HR and all your interviews will be managed by your line manager. Usually 2-4 interviews by stakeholders including line managers. Most questions aim to assess if you can handle working under pressure, in a demanding environment with limited supervision. Also aim to assess your customer service skills and dedication to providing good customer services.", "Interview Questions": "Why would you like to work for Hult?"}, {"date": "6 Sept 2017", "title": "Visa Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Hult International Business School (Boston, MA) in Jan 2017", "Interview Descriptions": "1 brief phone conversation, 1 half hour skype, 1 hour skype. If I had lived closer they would have asked me to come in for a 2 hour in-person interview.", "Interview Questions": "How do you handle people who have different work styles?"}, {"date": "26 Jan 2017", "title": "Seasonal Visa Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Hult International Business School (Cambridge, MA) in Jan 2017", "Interview Descriptions": "I had a phone interview, Skype interview, and an in person interview where I met with several different people.  The in person interview lasted about 2 hours.  They communicated well between interviews so I always knew when to expect to hear from them again.  It seems like a long process to go through to end up with no offer, but everyone I spoke with was kind and welcoming.", "Interview Questions": "What would your friends say they like best about you?"}, {"date": "19 Oct 2016", "title": "Teacher Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Hult International Business School", "Interview Descriptions": "If you are a former student, you don't have an interview. You just need to express your interest to the Deans and they will add you on a list of potential candidates. Then, they will contact you as soon as they have an opening.", "Interview Questions": "N/A"}, {"date": "19 Oct 2016", "title": "Career Services Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Hult International Business School", "Interview Descriptions": "Disorganized. Company was adamant that I be ready to leave my current position immediately and that they intended to fill the role by the following week. Weeks passed, additional interviews became required (4 in total), every week I was asked if I could start the following week, and then silence. No responses to e-mails or phone calls for over a week and a half, passing the date I was asked if I could 'start' by, and ultimately no offer. Not a great reflection of a career services department.", "Interview Questions": "How do you engage with your students?"}], [{"date": "13 Jun 2019", "title": "Enrollment Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Hult International Business School (Boston, MA) in Jun 2016", "Interview Descriptions": "phone call/ very stupid questions  cliche questions that everyone asks when applying. Not job eccentric at all. they just want to know if you are going to be good at being on the phone most of the time", "Interview Questions": "where do you see your self in 5 years"}, {"date": "20 Nov 2015", "title": "IT Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Hult International Business School (Cambridge, MA) in Oct 2015", "Interview Descriptions": "Interview took approximately 20 minutes. They asked my about my background and my interest in Technology. There were no specific questions for position. It was mainly about my personality and my interests.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "20 Aug 2015", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hult International Business School (Boston, MA)", "Interview Descriptions": "Met with corporate recruiter who was positive and assuring then met with Dean.  The Dean was also positive and friendly.  He didn't ask many hard questions.", "Interview Questions": "Typical academic and professional questions to judge my skill set"}, {"date": "13 Apr 2015", "title": "Recruitment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hult International Business School", "Interview Descriptions": "Very easy process. Applied online, was called for an interview with the Telesales Director. Another phone interview in which I was asked to do an scenario call to a prosper student.  Within days I was offered the position", "Interview Questions": "nothing out the usual"}, {"date": "12 Oct 2014", "title": "Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Hult International Business School", "Interview Descriptions": "Decent people, I guess. The salary seemed good. The location is nice central. Very very accessible through the Underground. You can take the Central line, the Northern Line, the Circle line, and the Hammersmith and City line.", "Interview Questions": "Something you're proud of"}, {"date": "20 Aug 2015", "title": "Technology Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Hult International Business School (Cambridge, MA) in Oct 2014", "Interview Descriptions": "The job was posted on Campus portal. It took the management about three months to get the intervidw process started. One interveiw with the manager and assistant manager is all it took.", "Interview Questions": "IT Expereince\r\nHow would I troubleshoot\r\nGeneral communication skills"}, {"date": "25 May 2015", "title": "Technology Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Hult International Business School (San Francisco, CA) in Sept 2014", "Interview Descriptions": "Just one email to the technology manager. No interview was really taken students were mostly picked randomly based on their follow up with the Technology manager which showed they are really interested. Asked professors to send a recommendation whom I helped in the class.", "Interview Questions": "Just asked me about my background"}, {"date": "26 Aug 2014", "title": "Student Recruitment Executive Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Hult International Business School", "Interview Descriptions": "Did a preliminary phone interview. Some of the questions were about what kind of international background I had--where I've traveled, if I've studied abroad, etc. There were also questions about meeting sales goals and how to stay motivated in sales. Personally, the role was not what I was looking for as it seemed very based in telemarketing. The interviewer and I both agreed that it was not what I was looking for and we ended it with that.", "Interview Questions": "All questions were pretty straight forward, nothing too difficult."}, {"date": "11 Jun 2014", "title": "Pre-enrollment Advisor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Hult International Business School (Cambridge, MA)", "Interview Descriptions": "A phone interview conducted initially asking about work history, personality, etc.\r\nThis was then followed by a face-to-face interview where the focus was the workplace environment, role-play and overall general questions.", "Interview Questions": "role playing"}, {"date": "5 Jul 2016", "title": "Assistant Dean Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Hult International Business School (Boston, MA) in Jun 2014", "Interview Descriptions": "Great process, met the entire team, interviewed with multiple persons. All of them were very professional and nice as well as welcoming. The job description was not very specific, nor very well described.", "Interview Questions": "Why do you think you are a good fit for the position?"}], [{"date": "14 Nov 2013", "title": "Career Services Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Hult International Business School (San Francisco, CA)", "Interview Descriptions": "Thoughtful initial phone interview. Two days notice for in-person interviews (5 total with 4 would-be, very friendly peers, some very new on job, some pre-occupied; 4 hours, offered water and tour after 2nd hour). Told I'd be contacted early following week, but 2 weeks later. Indication to me of overall chaos from overwork/understaffing above and beyond time to interview others.", "Interview Questions": "Surprisingly, no questions asked about the undergirding whys and how I work with people-the job I'd be doing if hired. "}, {"date": "1 Aug 2015", "title": "Director of Recruiting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Hult International Business School (San Francisco, CA) in Feb 2013", "Interview Descriptions": "I was introduced to the VP of Recruiting through an employee referral. After meeting with him one on one, i was interviewed over Skype by the Global Head of one of the degrees we offer. I was then interviewed by the President for Global Recruiting, before I was brought in again to meet with the rest of the team and go through a final round of interviews. The entire process from first interview to offer took 7 weeks.", "Interview Questions": "Do you have positive energy and can you follow process"}, {"date": "22 Jan 2016", "title": "Recruitment Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Hult International Business School (Miami, FL) in Oct 2012", "Interview Descriptions": "I gave my resume at the university's internship fair. Next week I received a call to see if I could perform an interview the week that follows. I had the interview with two other candidates and three managers. Each of these managers where looking for recruitment coordinators for their own program, therefore, they were evaluating soft and communication skills to determine which program would be best for me to work for.", "Interview Questions": "Have you ever succeed in selling a service to a business professional?"}, {"date": "13 Jun 2014", "title": "Associate Admissions Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Hult International Business School (San Francisco, CA) in Apr 2012", "Interview Descriptions": "Fairly straight forward, nothing too crazy or out of the ordinary. It is a detail oriented job that had a lot of busy work with crazy deadlines that have to be met. All questions basically are involved and around that. You will have to interview with a LOT of people.", "Interview Questions": "Might ask about food, as academics team is a bunch of foodies"}]]