[[{"date": "4 Apr 2023", "title": "Director Contract Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Last Mile Health (Lilongwe) in Feb 2023", "Interview Descriptions": "I attended straight 4 phases of interviews. First it was a questionnaire, then a virtual interview with two panelists. This was followed by a full written interview and then another final interview with a different set of panelists. The entire process took 4 months to be finalized. To be taken through the entire agonizing process and dropped last minute was a traumatizing experience I would not want to undergo again. I wish they had a system of eliminating candidates at each stage of the interview to only remain with one candidate for vetting during the final meeting with the Senior Management Team", "Interview Questions": "If you discover fraud by a sub-awardee, what would be your advice to the Management team?"}, {"date": "14 May 2021", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Last Mile Health", "Interview Descriptions": "1hr long with 5 mins of intro from the interviewers. Standard, who are you questions, understand the need of the role because technical questions will be asked, less competence based interviewing.", "Interview Questions": "What would you tell your younger self? Meaning what are your areas for growth?"}, {"date": "1 Dec 2020", "title": "Senior Manager, External Relations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Last Mile Health (New York, NY) in Nov 2020", "Interview Descriptions": "The process went by quickly. I submitted an application and heard back two days later requesting me to fill out a questionnaire. It asked why I was interested in the organization, my salary expectations, etc. I had 72 hours to complete it and submitted it on a Saturday evening. At 2am on Monday morning, I was asked to do a video interview the following day -- Tuesday. I thought it was strange that the hiring panel was able to review my responses and discuss over a weekend... and at a such a late time. I also was surprised at the times they offered me to interview, both the next day either in the morning (9am) or late afternoon (3pm) during the workday. If we weren't working remotely, I'm not sure I would have been able to make the interview work.\nI thought the interview went well, despite me not having much time to prep, I felt I answered every question. I have more than double the years of experience working at a much larger global NGO doing external communications for executive leadership, but it's very possible I just wasn't what they were looking for. In the end, I am glad the process moved quickly even if it was not in my favor. Perhaps wasn't a good fit for either of us - I would have been the only person of color on the comms team and also the salary for a senior manager role was not comparable to other similar organizations. Wish the best of luck to them.", "Interview Questions": "Why do you want to join Last Mile Health?"}, {"date": "31 Jan 2021", "title": "Senior Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Last Mile Health in Oct 2020", "Interview Descriptions": "Had a phone call with an HR type followed by a video call with the Hiring Manager.  Both were very casual though they were very thorough and asked probing questions.   They were frequently unable to answer more technical questions.", "Interview Questions": "Talk about your experience with Knowledge management."}, {"date": "22 Sept 2022", "title": "Software Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Last Mile Health (Nāgpur, Maharashtra) in Aug 2020", "Interview Descriptions": "Tell me your self and some logic questions as well as js questions . And for what position they take the interview that matter for frontend developer or backend developer that matter first .", "Interview Questions": "Tell mi yourself\nWhat is vh and VW\nWhat is used .\nWhat is this keyword \nEs6 and Es5\nPromise and closer "}, {"date": "10 Jul 2020", "title": "Strategic Partnerships Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Last Mile Health", "Interview Descriptions": "Spoke broadly about my experience and current role during my interview. It was very conversational and I was able to ask several questions. While it went well, I think they were looking for a very specific type of experience in negotiating partnerships with developing country governments.", "Interview Questions": "Tell me about your yourself and your experience in global health"}, {"date": "25 Feb 2020", "title": "HR Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Last Mile Health (Monrovia) in Feb 2020", "Interview Descriptions": "The interview process was very fast and systematic. It provided some level of challenge which is good.The interviewer managed time accurately. The feed back process was also good and that can encourage and one to apply there again when there is vacancy.", "Interview Questions": "Why do I want to leave my present  job"}, {"date": "28 Jul 2019", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Last Mile Health", "Interview Descriptions": "Several rounds with different team members and practical exercise. Fairly timely in terms of how long there is between next steps and hearing things. Will talk to many different people. Seems like a mix of hard and soft skill questions. Advice would be to prepare for situational questions and those on relationship management and building.", "Interview Questions": "What value at LMH resonates most with you?"}, {"date": "12 Jul 2016", "title": "Budget and Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Last Mile Health (Boston, MA) in Feb 2016", "Interview Descriptions": "I reached out to the Director of Finance and Administration at Last Mile Health on LinkedIn for an informational interview. I learnt from him about an open position in finance and was invited for two in-person interviews in the company's office in Boston. One interview was with the Director and the other one was with a partnership officer. \r\n\r\nI had a very positive impression overall. The first interviewer asked me questions about my background, MBA program, and why I would like to work in a non-profit organization. The interview turned to be more like a conversation and he demonstrated strong knowledge of the sector and business/finance aspects of non-profit firms. He was also very excited to share experience from his trip to Liberia. Both interviewers seemed to be very inspired to work at Last Mile Health and help people in remote places in Liberia. The organization has ambitious goals to scale up their model and have more impact on communities in Africa. My impression is that there is a very friendly and encouraging work environment, smart team, and it would definitely be a great place to work. \r\n\r\nI was informed that the position was put on hold unfortunately. However, the interviewer was very kind and supportive and offered me to connect with other professionals in non-profit organizations in the Boston area. He introduced me to several managers with a recommendation and I had successful interviews with those firms.\r\n\r\nAlthough there was no offer from Last Mile, I had a very positive interviewing experience and learnt a lot during the process. I was already interested in pursuing a career in the non-profit sector, but I became even more excited after speaking with both interviewers at Last Mile.", "Interview Questions": "Why are you interested in Last Mile Health?"}, {"date": "5 Aug 2015", "title": "Human Resources Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Last Mile Health (Boston, MA)", "Interview Descriptions": "Two standard phone interviews followed by a more in-depth phone interview with the Director of Finance and Administration. The first two interviews were fine, but wow, the Director of Finance and Administration was horrendous. He was pretentious and condescending in the interview and could not answer why he chose to work at Last Mile Health. When I asked, he essentially said that his friend got him the job and that he \"figured he should do something good for the world before the end of career.\" He had no previous experience in the sector and was very patronizing in his choice of words. Talk about toxic for a nonprofit. He also \"left me with a riddle\" to solve and email back to him. Are you joking? This was for a human resources coordinator position. I'm sure it's a lovely work experience, but after that train-wreck of a conversation I could not accept the offer.", "Interview Questions": "Tell me everything you know about X country in Africa."}], [{"date": "14 Sept 2015", "title": "Senior Partnerships Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Last Mile Health (Boston, MA) in Jul 2015", "Interview Descriptions": "The interview was via Skype and went well. It initially had to be rescheduled to a different day because the person interviewing me was busy. However after that he was on time. Questions were a mix of behavioral and case based questions. I won't say it was easy, but it wasn't super difficult either. \r\n\r\nIn the behavioral questions, I used examples from my previous experience to answer. For case based questions, I was presented with various situations in the field and asked how I would approach it. I was then asked to send in some previous work samples within 24 hours (a little extra time would have been nice :-))\r\n\r\nThe only negative part was they took much longer than I was initially told to get back to me with their decision.", "Interview Questions": "When planning a new program in a new community, what are some of the major costs you would budget for?"}, {"date": "11 Aug 2016", "title": "Human Resources Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Last Mile Health (Boston, MA) in Dec 2014", "Interview Descriptions": "I applied online for the job. The first two rounds were in person. The first  round was mostly informational where we I learned more about the job and my questions were answered about the organization culture. The second round was with the CFO which was also in person and I thoroughly enjoyed the conversation. A series of situation-based questions were asked which let me intrigued and more interested in the organization. The final round was with the interim EMD over the phone and was basically around why I want to work with LMH and how do I organize my day. Overall it was a very positive expereince and there was a quick follow up after every round. I was very satisfied with the process. My direct supervisor was Director fo Finance and Administration who also joined the same date. He served as a great mentor to me during my initial time and provided great leadership to  the department. I felt lucky to be part of such a tight-knit and supportive team. Director of Finance and Administration supported me in the  projects whenever it became difficult to navigate. His vast experience in Finance and Administration greatly supported the team. I will value his leadership and mentorship forever. It's been an absolute  pleasure working with him at Last Mile Health.", "Interview Questions": "What will be my style of working as HR Manager of the organization"}]]