[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An organization with great work culture and ample of opportunities to grow.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 May 2022", "job_title": "Research Associate in Jaipur, Rajasthan", "duration": "N/A", "pros": "- The organization provides a lot of growth opportunities in various domains for each and every employee to grow as an individual and excel in their domain. \r\n- Bask doesn't follow hierarchy system, hence all the employees are provided equal opportunities to grow and excel in their domains of interest. \r\n- Work life balance can be easily achieved in the organization.\r\n- A great organization to work with if one wants to shape their research skills and work in different domains.", "cons": "- Since it is a small organization, one might find it difficult to handle more than one projects at a time. \r\n- A person needs to be self motivated and disciplined enough to work with the organization."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Working with Bask helped me evolve as an independent researcher and the mentorship transformed my career", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 May 2022", "job_title": "Research Associate in Jaipur, Rajasthan", "duration": "N/A", "pros": "1. General experience: You will be working on socially-driven projects for creating tangible impact at the grassroots level. However, the nature of work and field exposure may vary based on the job role and assigned project. Apart from this, Bask invests in the capacity building of employees through workshops and short-term courses.\r\n\r\n2. Organizational structure: Bask has a flat hierarchy and all employees are very approachable.\r\n\r\n3. Work culture: An inclusive, encouraging, and agile work culture encouraging diverse ideas for fostering innovation and creative problem-solving. The top management is always willing to discuss and provide guidance to develop as a professional/researcher within and outside the organization.\r\n\r\n4. Managing work: Bask provides freedom, flexibility, and autonomy to lead the projects and grow as a project manager. Additionally, the organization is well connected to the domain experts to avail expertise and resources whenever required.\r\n\r\n5. Teams: Back in 2020 we were still a small and closely-knit team. We use to participate in social and sports activities such as trekking and half marathons together. I believe that the team has grown significantly since then.", "cons": "Not really a con but like any other small organization, the work might require donning multiple hats at the same time. However, this can also be seen as a learning opportunity to broaden the expertise."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Place with great work culture and growth opportunities", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 May 2022", "job_title": "Research Associate in Jaipur, Rajasthan", "duration": "N/A", "pros": "The organisation has great work culture and provides ample of growth opportunities to it's employees. Colleagues are supportive as well.\r\n\r\nWork / life balance can be easily maintained as the senior management do not promote working after office hours.", "cons": "The job requires a lot of hardwork and efforts from employee's end. One needs to be self motivated to do the assigned tasks completely!"}], []]