[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Being a part of the team is like being a part of the family!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 May 2018", "job_title": "Director of Financial Aid in Greenville, NC", "duration": "N/A", "pros": "I have worked at Alexander Paul Institute for just about two years, and it's been an incredible journey. When I was first hired, it was like a dream. I love the beauty industry, but I'm not a cosmetologist or esthetician! As an administrator, I get to utilize my strengths and strengthen my weaknesses while being a part of something that I have always been interested in. \r\nI am so grateful to be a part of the AP family! Alex, Paul, and George (the owners) love what they do, and that passion translates to the school and the students. They put their team first, even though they are constantly working to improve and grow the school. They understand the importance of a healthy work/life balance and respect it, too. They are willing to work with you if you will work with them!\r\nThe students are amazing. Working with them is rewarding and affirming because we get to help them make their dreams come true! So many of our students have these remarkable stories about how they found their way to the beauty industry, which adds a great culture of diversity to our school. We have students who just graduated from high school, students who have had three careers, students who have families, students who come from out-of-state, and everything between!\r\nCosmetology students are only here for about a year and esthetics students for about eight months, but we create really strong bonds with every class that comes through these doors. Our graduates always come back to check in, seek career advice, or get a service! Graduates also come back to teach, and if that doesn't tell you a lot about the fantastic environment, then I don't know what will!", "cons": "This is tough, because working here has never been negative for me, but if you are someone who doesn't have a strong work ethic or are resistant to learning and growing, then Alexander Paul Institute may not be for you. \r\nOur team of administrators and instructors share a sense of responsibility to do the best for AP that we can, and that's what makes this such a great place to be. This company gives back to you what you put in. \r\n\r\nAnd, best of all, I have never woken up and dreaded coming to work, and that's a blessing. \r\n\r\nThe worst part about working at Alexander Paul Institute? Being so close to Krispy Kreme. Why are those doughnuts so good?!?"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Caring owners with HIGH standards", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "3 Feb 2014", "job_title": "Instructor in Greenville, NC", "duration": "N/A", "pros": "They cared about you, as a person, and your personal life being sustainable. Open to your ideas and opinions. Genuinely want their students to succeed ! They go the extra length to get the staff and the students extra education and knowledge through expanding community involvement.", "cons": "MICROMANAGING !!  it'll drive you nuts if you're not strong enough to deal with it."}], [], [], [], [], [], [], [], [], [], [], [], [], []]