[[{"date": "6 Mar 2023", "title": "Diversity, Equity, & Inclusion (DEI) Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at DCI Donor Services in Feb 2023", "Interview Descriptions": "I applied in February 2023. I received an e-mail six days later for the next screening. I was to record video responses to 9 questions via the link they provided. There was roughly 2 minutes max to respond to each question. Just before the question appeared, it gives you a few seconds to think about your response. It was an impersonal and cold initial screening process; I didn't get a chance to meet or talk to anyone from DCI.", "Interview Questions": "Video Screening Questions: 1) How did you first hear about this position, and what motivated you to fill out an application? 2) Why are you looking to leave your current role, and what are you looking for in a new opportunity? 3) This position requires undergoing a pre-employment drug test, background screening, and receiving the COVID-19 vaccine. Do you have any concerns with these requirements? 4) Briefly describe your role and responsibilities in your most recent position. 5) In your previous position prior to your most recent job, where did you work and why did you leave? 6) Based on the position details, what traits or experience do you have that makes you an ideal candidate? 7) What are you really good at professionally? 8) What are you future career goals? 9) What are your salary expectations?"}, {"date": "3 Sept 2022", "title": "Interview Candidate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at DCI Donor Services in Aug 2022", "Interview Descriptions": "Very impersonal- two rounds and didn’t speak to one individual from the company. First was a recorded interview then the next round was with an outside consultant. If you have any questions of the position, they will not be answered until a later round, possibly?", "Interview Questions": "Do you like to work?"}, {"date": "11 May 2021", "title": "Clinical Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at DCI Donor Services", "Interview Descriptions": "I had to go through a brief phone screen with the recruiter, a video interview where I answered questions on the screen, a personality assessment, and finally an in person interview.  I also job shadowed where I could see a case that people were working on and this gave me a better understanding of what the position required in terms of the 24 hour schedule", "Interview Questions": "What is the most selfless thing you've ever done"}, {"date": "16 Feb 2021", "title": "Donor Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at DCI Donor Services (Nashville, TN)", "Interview Descriptions": "1. Preliminary phone interview with HR just to make sure I met the guidelines for application\n2. Second phone interview with managers of the department\n3. In-person interview with managers of department + 1 other departmental manager -- this lasted about 45 mins; then I shadowed someone in the role for about 2 hours\n4. Was hired later that day!", "Interview Questions": "Q: Why do you want to work here?"}, {"date": "20 Apr 2022", "title": "Clinical Review Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at DCI Donor Services in Aug 2020", "Interview Descriptions": "Multiple interviews, personality questionnaire, thorough, and informative. Many opportunities to ask questions to multiple staff for clear understanding of job duties, expectations. Interviewed with 3 different groups of staff plus department manager.", "Interview Questions": "Please share about a time when things didn’t go as planned, how did you handle that?"}, {"date": "14 Oct 2021", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at DCI Donor Services (Nashville, TN) in Aug 2019", "Interview Descriptions": "Interview Process was okay, tedious but all in all it was okay. I would say that they are not focusing on the things that they think they want to. It is very bias.", "Interview Questions": "Would you consider yourself a high speed worker? "}, {"date": "4 Mar 2021", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at DCI Donor Services (Nashville, TN) in Jun 2019", "Interview Descriptions": "It was great. I felt comfortable and they asked a lot of questions that made me think. I’ve now worked there for 2 years. It’s the best job I’ve ever had.", "Interview Questions": "How would you handle a stressful situation in the work place? "}, {"date": "15 Jun 2018", "title": "Hospital Development Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at DCI Donor Services", "Interview Descriptions": "The entire process takes entirely too long from beginning to end. Candidates are left guessing as to where they are in the process and the whole thing lacks transparency. It would be beneficial if DCIDS laid out all the steps to their interview process in the beginning to have an idea of how long things take. Additionally, communication is lacking which causes valuable candidates to be lost.", "Interview Questions": "Tell me about a time you made a mistake at work. How did you handle it and how did it turn out?"}, {"date": "12 Sept 2017", "title": "Organ Recovery Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at DCI Donor Services (Knoxville, TN) in Sept 2017", "Interview Descriptions": "Long interview process. Multiple interviews with multiple people. First interview tells about job and to make sure you know about the position in depth. Second  interview was to inform you on how hard job is and to give you opportunity to ask questions. Third interview was personality test by phone and took an hour. I still have more interviews to go. So far everyone has been wonderful during this process. No offer yet due to not finished in process of interviewing.", "Interview Questions": "What is you favorite work style? "}], [{"date": "7 Oct 2016", "title": "Senior Quality Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at DCI Donor Services (Albuquerque, NM)", "Interview Descriptions": "Very relaxed, it was more of a social atmosphere, a getting to know you feeling.  There was no pressure and no trick questions.  I felt like they were just trying to get a sense of who I was and if I would fit with the organizations mission and goals.", "Interview Questions": "What interests you about this opportunity?"}, {"date": "14 Aug 2017", "title": "Labeling Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at DCI Donor Services (Nashville, TN) in Apr 2015", "Interview Descriptions": "I was screened over the phone with the HR department. Easy questions on why I wanted to work for the DCI. I was asked to give what I thought of working with mostly females, how do I handle conflict, there were no right wrong answers.", "Interview Questions": "why do you want to work at DCI"}, {"date": "28 Sept 2016", "title": "Collection Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at DCI Donor Services in Jun 2014", "Interview Descriptions": "The manager was not effective. Manager was standoffish and proved to be a poor manager. Would never refer someone to work for her department. There were the interviews,  the last with her and the assistant manager. The assistant spike for most of the interview,  also once hired there was little to no training.", "Interview Questions": "She didn't ask any questions"}, {"date": "29 Aug 2013", "title": "Organ Recovery Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at DCI Donor Services (Sacramento, CA)", "Interview Descriptions": "The hiring process takes a long time.  It's worth the wait but you may feel like your being forgotten.  There are several Interviews and a personality test.  Just keep following up with the hiring manager. They need more people but are locked into a corporate hiring process.", "Interview Questions": "Interview questions are pretty standard.  Make sure you have specific situations in mind. Most questions are situational \"tell me a time when.\"  Don't be afraid to talk about failures. Tell them how you fixed them!"}, {"date": "2 Aug 2013", "title": "Hospital Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at DCI Donor Services in Jul 2013", "Interview Descriptions": "HR representative was courteous, but projected a cold and impersonal demeanor. Was told I had moved to the next interview stage but then was informed in a reply email from HR rep that they had chosen another candidate.", "Interview Questions": "Most questions were ones that were on my application, as if they had never read it despite emails stating they were impressed with my credentials, etc."}]]