[[{"date": "6 Apr 2019", "title": "Education Explorer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Thanksgiving Point", "Interview Descriptions": "After being invited in for an interview, I sat in a large conference room with two other women who were conducting the interview. They were both very friendly and we chatted a before and in between questions.", "Interview Questions": "What does the word \"inquiry\" mean to you?"}, {"date": "14 Sept 2016", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Thanksgiving Point (Lehi, UT)", "Interview Descriptions": "really weird interview. had about three persons interviewing me, including the head manager and two co-managers. first, had me wait around 20 minutes while they made another sales associate watch me and \"analyze\" how I acted. then, they took me outside, asked me some basic questions, and then started talking about weird books for about 20 minutes, mostly with eachother. then they let me go and said a job offer would be extended to me within a week. overall really weird place.", "Interview Questions": "If you could be any MALE Disney character, who would you be? (this was weird because I'm female)"}, {"date": "3 Oct 2015", "title": "Part Time Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Thanksgiving Point (Lehi, UT) in Aug 2014", "Interview Descriptions": "There were two parts. First I met with the head of HR. Then I met with the head of department with the job vacancy. They had similar questions, although the meeting with the head of the department asked questions that were a bit more specific to the job. I think they may be doing a panel of the two now though.", "Interview Questions": "What would you do if you saw a coworker stealing product?"}, {"date": "19 May 2016", "title": "Banquet Server Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Thanksgiving Point (Lehi, UT) in May 2013", "Interview Descriptions": "Applied online, shortly after called and invited to a one on one interview. It was the shortest interview I've been to. They just wanted to make sure I seemed like a reliable and responsible worker. Interviewer was the Banquet Manager at the time and she was very friendly and easy going. It was a very relaxed interview, but you should still dress nice, of course.", "Interview Questions": "If i had previous experience working events."}, {"date": "4 Apr 2015", "title": "Golf Cart Runner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Thanksgiving Point (Lehi, UT) in Jun 2011", "Interview Descriptions": "I was called in for an interview and the interview question about customer service and emphasized quality of business. I was given an offer in the interview and accepted the offer. I should have worn slacks and a golf polo to the interview. I suggest not over dressing. Two experienced supervisors interviewed me.", "Interview Questions": "What is good customer service?"}], [], []]