[[{"date": "16 Mar 2023", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "Good and encouraging environment that was very organized and thorough in their process. Very attentive to needs of candidates and ensuring an informative process. I really enjoyed the experience. It was very good.", "Interview Questions": "It was really good and I enjoyed it"}, {"date": "13 Mar 2023", "title": "Lab Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Clemson University", "Interview Descriptions": "There was a brief phone interview discussing details of the job (location, benefits eligibility) and then I had an in person interview followed by a period of observation of the lab activities.", "Interview Questions": "What is your view on safety?"}, {"date": "30 Jan 2023", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "One interview, multiple people asking questions which was a bit intimidating. Overall not a bad process, but be prepared to be facing 2-3 people interviewing you. Interview was a few years ago and during COVID, so the process might be different now.", "Interview Questions": "If you were a crayon, what color would you be?"}, {"date": "26 Feb 2023", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clemson University in Jan 2023", "Interview Descriptions": "Online HR pre-recorded videos, generic questions unrelated to position. Still waiting... for any response. If I do get a response, I'm playing hard ball, as I'm not a piece of meat.", "Interview Questions": "How can your past skills contribute to the culture at CU?"}, {"date": "14 Jul 2022", "title": "Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Clemson University", "Interview Descriptions": "It will ask you to tell me about yourself and then test your English skills since it faces English-speaking  students. I would recommend you practice your English speaking skill if you are a international student", "Interview Questions": "Please tell me about yourself"}, {"date": "26 May 2022", "title": "Operations Assistant II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Clemson University (Clemson, SC) in May 2022", "Interview Descriptions": "SPARKHIRE one way video interview first. Then if you are called to interview, second interview is a ZOOM meeting/face to face. Once you complete that, they will choose 3 candidates to come in and do a face to face.", "Interview Questions": "There were at least 20 interview questions from \"Please tell me about yourself\" as well as scenarios of problems in the work place and give examples of how you overcame them."}, {"date": "12 Jan 2022", "title": "Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "I applied for part-time web development. As a student at Clemson university it is very easy to get one. But you don't find many open positions. If any open positions are found to be open then apply as soon as possible", "Interview Questions": "Nothing just went to my previous experience"}, {"date": "17 Feb 2022", "title": "Art Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Clemson University in Jan 2022", "Interview Descriptions": "This interview was a video interview. You log into Clemson's web service and answer self guided questions. After submitting it, I never heard anything back from HR, not even telling me they received it.", "Interview Questions": "What inspires you to create?"}, {"date": "23 Aug 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Clemson University (Clemson, SC) in Jul 2021", "Interview Descriptions": "Good and descriptive, had a good talk with the professor and discussed about possible learnings at the end of the project and the necessary skills I would need to acquire for it.", "Interview Questions": "My experience in design and CAD software"}, {"date": "23 Jun 2021", "title": "Student Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "Overall it was a great process and my supervisor at the time was very helpful in answering all my questions. HR was also great at working with me in what I needed.", "Interview Questions": "N/A"}], [{"date": "3 Jun 2021", "title": "Social Media Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clemson University", "Interview Descriptions": "It was good I was asked good questions that really helped me understand more about everything. I was able to be myself and have a good conversation, and the people I interviewed with were professional and very helpful as well. I enjoyed being able to discuss my experiences and also learn more about the interviewers experiences as well.", "Interview Questions": "Why do you want the position?"}, {"date": "10 May 2023", "title": "Server Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Clemson University (Clemson, SC) in Jun 2021", "Interview Descriptions": "The interview process was very casual. Previous restaurant experience is a benefit to being a server, or you may start as a hostess! Once you have served and gained credibility in the company, you can bartend, which is seen as a promotion. You will fill out a short application of questions, and there will be a follow-up interview with the manager face-to-face after he reviews your application.", "Interview Questions": "Tell me about yourself Have you ever worked in the food and beverage industry? Why do you want to work for us?"}, {"date": "26 May 2021", "title": "Operations Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "Zoom Interview where you describe why you want the job. You would receive an email letting you know if you got the job. You should receive an email 1-2 weeks later.", "Interview Questions": "Describe your experience with IT?"}, {"date": "21 May 2021", "title": "Generalist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "Was initially presented with behavioral based scenarios. Was given 30 minutes to work through the issues and then panel re-convened for me to respond. They asked other questions about my work experience and continuing education.", "Interview Questions": "What do you do to stay current on labor laws?"}, {"date": "12 Apr 2021", "title": "Human Resources Manager I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "Great process! Completed a one way video recorded interview that seemed a little uncomfortable at first but the questions asked made it easy to talk about experience. I also completed an in-person interview that was similar to any other interview.", "Interview Questions": "Describe your ideal work culture. "}, {"date": "24 Mar 2021", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "Met with current lifeguards and their manager. Was asked questions regarding the position and had to get into the pool to show I had the skills for the job. Life gaurd certifications are required.", "Interview Questions": "Why do you want this job?"}, {"date": "24 Mar 2021", "title": "Content Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "Great, relaxed interview!  No worries at all going in.  More just a long conversation.  Did not feel interview-like or stressful at all.  People are always very nice and considerate.  Willing to take on someone with less experience.", "Interview Questions": "What kind of experience do you have? "}, {"date": "15 Feb 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "First you have to apply and go through a phone screening. Then you’ll interview for department and hopefully receive an offer. There’s a lot of people who apply to every opening.", "Interview Questions": "Clemson is a great place to work and treats everyone like family, I hope to work here one day. "}, {"date": "11 Feb 2021", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "CUGARS - day of interviews with individual offices around campus in mostly the student affairs department. Brief interviews with mostly traditional questions, behavioral questions, and questions about the program itself.", "Interview Questions": "Tell me about yourself, why Clemson, etc. "}, {"date": "19 Feb 2021", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Clemson University (Clemson, SC) in Jan 2021", "Interview Descriptions": "Easier when you are in the system already as professors tend to want to know the academic strengths of students before they offer them a position, especially if one is an international student who is just getting started with their higher degree program.", "Interview Questions": "What are your interests and research focus areas?\nWhy are you interested in this position?"}], [{"date": "30 Nov 2020", "title": "Communication Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clemson University", "Interview Descriptions": "It was super quick and simple. The interview was set up the day after applying for the internship and I was offered the position the following day. Great overall experience.", "Interview Questions": "What are examples of ways you've shown great customer service? "}, {"date": "18 Sept 2021", "title": "Global Engagaemnt Mentor/ Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Clemson University (Clemson, SC) in Nov 2020", "Interview Descriptions": "One online initial interview with a follow up in person interview with previous holder of position and current supervisor. Very personable and open to teaching experience that was not previously held.", "Interview Questions": "What is an idea you have that could be used to improve the department?"}, {"date": "23 Mar 2020", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Clemson University (Clemson, SC) in Feb 2020", "Interview Descriptions": "Had a group interview with other candidates where the proctor asked personality questions. A couple weeks later had a phone call regarding decision. Then have to go through a background check.", "Interview Questions": "How do you play your part in a  team setting?"}, {"date": "25 May 2020", "title": "Strategic Data Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Clemson University (Clemson, SC) in Dec 2019", "Interview Descriptions": "Had an Initial Phone Interview with the Hiring Manage which went well. Second round was a zoom/skype interview with Hiring manager and a University Leader. Afterwards I was invited for an in person interview with the Entire team at the Department where the job was, plus other leaders. Was given a Data Exercise to prepare and present during the interview. It was a good experience. I was very impressed with the Hiring Manager, she was very  intelligent, professional and kind. I was also impressed by everyone I met during the interview. Overall had a good experience during the interview. Also kind of knew by the end of the interview process that I was not getting the job. To sum up, my overall experience during the entire interview process at Clemson  University was nice and very professional.", "Interview Questions": "During the entire process we covered everything from questions about my experience to a Data Exercise that I had to complete and present during in person interview."}, {"date": "25 Aug 2021", "title": "Graduate Research Assistant/Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Clemson University (Clemson, SC) in Dec 2019", "Interview Descriptions": "The interview process tested me on my fundamentals of my engineering knowledge and reviewed my key skills pertaining to the research role I was interviewed for. I was tested on a mock exam to find an area of expertise and based on that, I was assigned course work.", "Interview Questions": "Q: Describe any previous position which challenged you? \nQ: What do you think are the key skills required to sustain in a researcher role?"}, {"date": "11 Sept 2019", "title": "Natural Resource Extension Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Clemson University", "Interview Descriptions": "Was given a prompt to create a mock presentation based on a relevant subject matter. It was a panel of interviewers and lasted about 1.5 hours. I was asked to deliver a mock presentation on a relevant subject matter and prepare any sort of presentation materials that I saw fit.", "Interview Questions": "What is your experience with outreach and education?"}, {"date": "10 Sept 2019", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Clemson University", "Interview Descriptions": "Current RAs and senior staff will interview you. Be prepared with creative, thoughtful, and unique answers to how you want to make an impact in your community and why you want to be placed in a living community if you have a specific one in mind.", "Interview Questions": "What is your greatest weakness?"}, {"date": "24 Feb 2021", "title": "Assistant Librarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Clemson University (Clemson, SC) in May 2019", "Interview Descriptions": "Fabulous. Warm, welcoming, and very encouraging. I felt like an actual person the entire process instead of just a candidate or number. It was the best interview I've attended, even though I was not offered the position.", "Interview Questions": "I had to prepare a presentation on a topic they provided. "}, {"date": "7 Apr 2022", "title": "Faculty Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Clemson University (Clemson, SC) in May 2019", "Interview Descriptions": "Fantastic hosting of candidates, widely supported and attended candidate presentations, and a very welcoming group of people! The experience made the job that much more appealing because it made you want to work for the University.", "Interview Questions": "Why are you interested in our Institution?"}, {"date": "2 Apr 2019", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clemson University", "Interview Descriptions": "It was a 30 minute skype interview with primary advisor and received offer in about in  a month. The staff was very professional and helpful in the hiring process.", "Interview Questions": "Research interests?"}], [{"date": "14 Oct 2018", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Clemson University (Greensboro, NC)", "Interview Descriptions": "Unimpressed with their recruitment process - will never apply for a position there again.  After a one-way video interview I was then asked to forward  lengthy questionnaires to my four required references.  These are professionals who have very busy calendars!   I had to also complete numerous computer software assessments, and a writing sample which took about an hour to complete.  I received numerous auto-reminders to complete the reference/assessments - very irritating that I received these before the stated deadline.  I was never asked to come in for an actual face-to-face interview, and did not receive any other communication from the recruiter. I did receive a computer-generated email about three months later indicating that my application status had been changed to \"Not Chosen for Job Opening.....\"  For all the effort I put forth I would have appreciated a more personal letter thanking me for applying.", "Interview Questions": "N/A"}, {"date": "1 Jun 2018", "title": "Director of Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clemson University", "Interview Descriptions": "They are very proficient, and as a candidate you are kept informed of your status throughout the process. I was impressed with everyone I worked with and it definitely was the most professional and organized hiring process.", "Interview Questions": "Describe a successful fundraising ask?"}, {"date": "16 Apr 2018", "title": "Postdoctoral Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Clemson University", "Interview Descriptions": "It was based on the adv. and phone interview. All my documents were carefully considered. It was a very detailed interview. Duties and expectations were explained. Job process was introduced.", "Interview Questions": "N/A"}, {"date": "9 Nov 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Clemson University (Clemson, SC) in Apr 2018", "Interview Descriptions": "Very brief. Sent in my resume after being referred by a friend who used to work there.  Went in for a 15 minute interview with two of the office managers. Answered basic interview questions, then was shown the office, Received a phone call saying I was hired the next day.", "Interview Questions": "What is one of your weaknesses?"}, {"date": "23 Sept 2018", "title": "CCIT Laptop Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Clemson University (Clemson, SC) in Apr 2018", "Interview Descriptions": "The Interview was pretty laid back, asked a few standard behavior questions and some technical questions regarding your previous technical challenges and experiences. As long as you can show that you know what you are talking about you will be fine. Prior knowledge of how to work on computers is required.", "Interview Questions": "Hardest Technical Challenge "}, {"date": "9 Sept 2018", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Clemson University (Greenville, SC) in Mar 2018", "Interview Descriptions": "Applied online and application status updated at every step. Received email from recruiter to interview. Professional interview. Very pleased with process although the interview questions were dated but consistent with most companies who are still in the dark ages when it comes to hiring...", "Interview Questions": "Tell me about process you improved? What was it? How did you improve it and what was the outcome? "}, {"date": "23 Feb 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "Submitted app, had followup interview-fairly standard. Be prepared with real reasons for why you want to conduct research. Need have drive and strong work ethic. Self-starters fit well in this sort of position", "Interview Questions": "Why do you want to work in this lab? Etc."}, {"date": "19 Feb 2018", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "ask about what you want to bring to the table, very informal, they want to get to know you as a person and a student. you can always count on your coworkers for advice", "Interview Questions": "if you could change one thing"}, {"date": "12 Mar 2018", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Clemson University in Feb 2018", "Interview Descriptions": "It is an online skype interview, not hard, just a few normal questions  about your research interest  area and your plan after graduation. \r\nFYI, there is only one professor in the interview process.", "Interview Questions": "the Questions are normal."}, {"date": "10 Sept 2018", "title": "Trip Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in Jan 2018", "Interview Descriptions": "very straight forward. Ask blunt and to the point questions. mainly they want to know what you can bring to the program skills and goals wise, rather just wanting a job.", "Interview Questions": "What do you hope to gain from this position?"}], [{"date": "21 Dec 2020", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Clemson University (Clemson, SC) in Jan 2018", "Interview Descriptions": "Asked general questions about college and excel questions pertaining to spreadsheets and verfied knowledge of technological assistance and technical knowledge that included computer management and questions pertaining to general abilities", "Interview Questions": "Q: How to create a spreadsheet in Excel?"}, {"date": "27 Jan 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Clemson University (Clemson, SC) in Dec 2017", "Interview Descriptions": "There was an onsite interview. The department went out of their way to make sure we knew what the academic culture was. We were provided with one-on-one interviews with the professors and were invited to talks by the professors about their research.", "Interview Questions": "What are you interested in pursuing longterm"}, {"date": "4 Dec 2017", "title": "Health and Safety Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clemson University (Clemson, SC) in Nov 2017", "Interview Descriptions": "There were 2 steps in this process, 1 phone interview, one on campus interview around 2 weeks later.  The phone interview lasted about 20 minutes.  The on campus interview was 3 hours with several components, including meeting staff from around the campus.", "Interview Questions": "Name 3 strengths give an example of each, why do you want this job, where do you see yourself in 5 years."}, {"date": "20 Aug 2017", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Clemson University (Clemson, SC)", "Interview Descriptions": "I spend half a year to do research foe my second Master Thesis in Clemson with my future PhD advisor. He mad me do all the work from start to finish and would check up on me first daily, but then later only once or twice a week. After I finished all my work a couple pf weeks before I would leave, I got invited to dinner and we discussed my future. At the end he finally offered me to come back if I wanted to for my PhD.", "Interview Questions": "It was not really a question, more observing me to work for 6 month in his group!"}, {"date": "13 Feb 2018", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in Aug 2017", "Interview Descriptions": "ECE department offers a speech test for all candidates to qualify for the TA/ GA positions. The test is conducted by a panel which grades your performance. The test is easy and only criteria observed is how well you teach and able to communicate to the panel of expert professor judges.", "Interview Questions": "Explain and teach Basic Circuit Laws from Lab Manual : KCL,KVL"}, {"date": "18 Apr 2018", "title": "Visiting Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in Jul 2017", "Interview Descriptions": "The interview was conducted via skype, with several interviewers. I received an offer very quickly. The university offered an employee orientation, which was extremely helpful. I honestly don't know what to add after that, but this thing wants 30 words. which is annoying.", "Interview Questions": "How do you handle a difficult student."}, {"date": "22 Sept 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Clemson University (Greenville, SC) in May 2017", "Interview Descriptions": "Pretty simple.  I went into the professor's office and talked to him about what he would want a graduate teaching assistant to do, and he asked me questions to determine if I would be a good fit.", "Interview Questions": "He asked me to show him my work in previous classes to make sure I was the caliber of student to TA others."}, {"date": "26 Oct 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Clemson University (Clemson, SC) in Apr 2017", "Interview Descriptions": "Fairly informal, easy. Not bad at all - basic at most. Mainly just ask you about yourself and behavioral questions. They really want to get a feel for who you are and what you can bring to the sector you'll be working in. UPIC is an amazing program!", "Interview Questions": "What are your strengths and weakness?"}, {"date": "27 Apr 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Clemson University (Clemson, SC) in Feb 2017", "Interview Descriptions": "Met with four individuals relevant to the position and was asked several questions.  Required to take several skills tests as well as a project after the initial panel interview.", "Interview Questions": "In what ways have you streamlined something in your position?"}, {"date": "19 Mar 2019", "title": "Group Fitness Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Clemson University (Clemson, SC) in Jan 2017", "Interview Descriptions": "Took a fitness instructor class at Clemson that lasted 1 semester.  After the class ended, we took an exam, we were required to teach a mock class and once considered as a potential candidate, we had an official interview.", "Interview Questions": "How would you handle a participant who has had a previous injury but still wants to participate in the workout class?"}], [{"date": "25 Feb 2019", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clemson University (Clemson, SC) in Dec 2016", "Interview Descriptions": "It was conducted by a search committee. I met with 3 of the members individually on different days including Senior Administrators. The communication between the interviews was pretty spotty, and once an offer was forthcoming I did not know what was holding up the start date.", "Interview Questions": "There were lots of questions"}, {"date": "22 Aug 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Clemson University (New York, NY)", "Interview Descriptions": "set up interview time, arrive on time, one professsor will ask your basic background and behavioral, talk about previous project and what is your contribute to that project. professor told you the result right away", "Interview Questions": "what is your previous project about"}, {"date": "24 Aug 2016", "title": "Systems Software Programmer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Clemson University in Aug 2016", "Interview Descriptions": "I had a few offers and one from Clemson came in last. Living in the Upstate of SC, working for Clemson seemed like a great opportunity. I declined my other offers and picked Clemson even though it was not the most lucrative of my offers. I put in my two weeks notice at my current employer and committed to Clemson.\r\n\r\nClemson rescinded its offer a week later due to \"lack of funding\" and \"leadership change\". I will forever regret committing to work for Clemson. I would warn anyone in IT to be very wary about accepting a position at Clemson.", "Interview Questions": "Why do you want to work for Clemson?"}, {"date": "12 Jul 2018", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Clemson University (New York, NY) in Aug 2016", "Interview Descriptions": "Easy interview process. Questions relate to major and past internships. As long as you have excellent communication skills, it is easy to get an internship. Candidates tend to get a job within a week of the interview.", "Interview Questions": "what was the most beneficial experience on your past internship?"}, {"date": "22 Mar 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Clemson University", "Interview Descriptions": "easy face to face interview, got my offer three four days. management was help to get everything started Share your interview experience insights with job seekers so that they can know what to expect from the hiring process.", "Interview Questions": "N/A"}, {"date": "18 Mar 2016", "title": "Venue Operations Team Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Clemson University", "Interview Descriptions": "It was very casual; I went into an office and chatted with the managers for about half an hour. We discussed my course load, how many hours I was hoping to work per week, and what my plans for the following semester were. I wasn't asked any stereotypical \"interview\" questions.", "Interview Questions": "What is your course schedule like for this semester and next?"}, {"date": "18 Jan 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Clemson University (Clemson, SC) in Jan 2016", "Interview Descriptions": "Applied through Clemson joblinks. Got an email from the supervisor to come for a brief interview.\r\nIt wasn't a traditional interview as such. The supervisor straight away started showing me the workplace and tasks which I would have to do if hired. He specified that he needed 10 hrs/week and also the hourly pay.", "Interview Questions": "Area of study?\r\nWeekly schedule?\r\nComputer skills?"}, {"date": "15 Oct 2015", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Clemson University", "Interview Descriptions": "Very relaxed; Grad Assistant reads very basic interview questions from a list of possible questions; nothing to fret over; will probably have another tutor in the interviewing room with you", "Interview Questions": "Why would you be a good tutor?"}, {"date": "13 Oct 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Clemson University (Clemson, SC)", "Interview Descriptions": "Very simple application.  No formal interview since it was a graduate position.  I talked to a few people before applying, and everyone was extremely nice and helpful.  They asked me what type of math I liked best and what I was interested in doing after graduating.", "Interview Questions": "On the application, they asked for my philosophy about mathematics.  Other than that, everything was straightforward."}, {"date": "31 Jan 2019", "title": "Student Affairs Compliance Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Clemson University in Oct 2015", "Interview Descriptions": "The interview process was standard but there were promises made that were not delivered on even after 4 years.  I first had a phone interview, then the in person all day interview that included a presentation.", "Interview Questions": "What's the biggest challenge you've worked through and how did you resolve it?"}], [{"date": "23 Oct 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in Sept 2015", "Interview Descriptions": "I was brought on to help in Major Gifts. The interview was informal as I was just there for a student worker. They wanted to get a gist of what I was interested in and things that I thought I would bring to the table. Be prepared to answer what fundraising means to you.", "Interview Questions": "How do you define fundraising?"}, {"date": "13 Aug 2015", "title": "Graduate Grader Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "There is no interview for this Graduate Grader Assistant position. Just follow the instructions of the ECE department.\r\nThere is no interview for this Graduate Grader Assistant position. Just follow the instructions of the ECE department.", "Interview Questions": "N/A"}, {"date": "12 Aug 2015", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Clemson University (Clemson, SC)", "Interview Descriptions": "I was interviewed by a panel of four individuals. One of them is my now current supervisor, my now current co-worker, the lead recruiter for the university, and another Director within the department. One of the interviewers acted like they were not even listening. They kept yawning the entire time. Needless to say, they are the lead recruiter for the University.", "Interview Questions": "They asked me questions related to my previous experience and how I handled situations related to my field."}, {"date": "22 Aug 2015", "title": "Special Coordinator of Centers and Institutes Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in Aug 2015", "Interview Descriptions": "Was briefly interviewed on the phone because my application was among the first group selected.  Very pleasant, no real specific questions asked.  Felt odd.  Kept being asked if I had any questions instead of asking me about my qualifications.  I asked for specifics about how the position would be developed.", "Interview Questions": "You were previously employed at the Waccamaw Regional Council of Governments.  What is the Waccamaw....of Governments?  What was your experience there like?"}, {"date": "11 Oct 2015", "title": "Financial Analyst III Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clemson University (Clemson, SC) in Aug 2015", "Interview Descriptions": "Applied through online external Candidate applications process.  Was called in quickly for a meeting with 3 people.  Interview was short and to the point.  Director was very knowledgeable and personable.  The other two didn't get much of an opportunity to talk.", "Interview Questions": "Very open ended....\" tell us about yourself\"....\"why do you want to work here?\""}, {"date": "6 Jun 2018", "title": "Supplemental Instruction Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clemson University (Clemson, SC) in Aug 2015", "Interview Descriptions": "Submit via email an  application, then few weeks later offered interview, finally about a week or two later offered position. Overall, very friendly team that is good at interviewing. Therefore, the setting is comfortable and relaxed. Little preparation is necessary.", "Interview Questions": "What superhero would you be?"}, {"date": "2 Jun 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Clemson University (Clemson, SC)", "Interview Descriptions": "Two interviews via Skype were conducted online, asking about my previous experience, career goals and research interests, and later on I have been inveted to join the professors in a campus visit to know the buildings and offices", "Interview Questions": "About my previous experience, research interests, goals"}, {"date": "26 Aug 2015", "title": "Designer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Clemson University (Clemson, SC) in Jun 2015", "Interview Descriptions": "The interview process was easy and seemed to be going well. I am still waiting to hear back and am a little frustrated with the situation. Hearing them say they would be back with me and not ever hearing anything back seemed very unprofessional. I am not sure where I am standing", "Interview Questions": "They asked about my past experience and how that would help me in this position"}, {"date": "8 Sept 2015", "title": "Recreation Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in Apr 2015", "Interview Descriptions": "group interview among the Operations coordinator and current recreation supervisors, very easy, had the job in the bag. currently working there. not hard at all. if you don't get the position you are doing something wrong.", "Interview Questions": "In what way does your experience prepare you for the position as a recreation supervisor?"}, {"date": "2 Mar 2016", "title": "General Engineering Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at Clemson University (Clemson, SC) in Mar 2015", "Interview Descriptions": "Form to fill out describing past experience. Some candidates were given a brief interview if you had never worked for General Engineering before. All candidates had to take a skills test, assessing their abilities in MATLAB, EXCEL, and SOLIDWORKS. These tests were fairly easy and more used to place candidates in their specific grading role.", "Interview Questions": "Q: Find the mistake in the following MATLAB code."}], [{"date": "29 May 2015", "title": "Scholarship Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clemson University (Clemson, SC) in Feb 2015", "Interview Descriptions": "I applied online and was contacted by email to schedule a phone interview. After the phone interview, I was invited to come to campus and interview. I had to prepare a 15-minute presentation on Clemson scholarships and give it to most of the Student Financial Aid staff. I also interviewed with the financial aid selection committee. Then, I interviewed with the director.", "Interview Questions": "Basic interview questions about my skills pertaining to the position."}, {"date": "29 May 2019", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Clemson University (Clemson, SC) in Jan 2015", "Interview Descriptions": "The interview conducted by Prof at Civil engineering. It was very nice.   What i like about the interview it was with Professor at Clemson which gave me idea about people that i am goin gto work with", "Interview Questions": "are you willing to relocate ?  Will you work on weekends ?  Have you every had experience with teaching?  Would you like to work with students ?  will you able to work afternoon?  is there any other position that you applied for before you come to Clemson?"}, {"date": "24 Sept 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in Dec 2014", "Interview Descriptions": "I received an offer to participate in an interview within weeks of applying for the position. The process was very easy once I was selected to fill the position following the interview process.", "Interview Questions": "Why did I select this position instead of pursuing other opportunities on campus?"}, {"date": "12 Jul 2015", "title": "UPIC(Fabrication Specialist) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in Dec 2014", "Interview Descriptions": "I applied through Clemson's career development department and was offered an interview soon after.  The interview itself was set up differently than other interviews I've had.  I had three interviewers and they had brought some of the apparatus they were using and asked how I would improve upon the designs and what benefits my design would offer.  They also asked about my fabrication experience.", "Interview Questions": "How would you improve these designs?  (they brought apparatus they had designed and were using)"}, {"date": "14 May 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in Aug 2014", "Interview Descriptions": "Very casual, in person, briefly discussed research background. Focused on research goals for the lab as well as for me personally. Took about 30 minutes. No behavior-based questions only elaborated on my resume.", "Interview Questions": "Tell me more about this job?"}, {"date": "8 Sept 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Clemson University (Clemson, SC) in Aug 2014", "Interview Descriptions": "After you email in your resume and application , you will get a call to come in for an interview at Vickery hall. Once you get the interview you basically have the job. It is very informal and more like a training session.", "Interview Questions": "What is your experience in certain subject areas? What do you know about Vickery hall? How would you handle certain situations."}, {"date": "14 Nov 2016", "title": "Grants Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in Jul 2014", "Interview Descriptions": "The interview was conducted by a group and each individual asked questions. They asked the typical interview questions like what are your strengths and weaknesses.  The interview was not overwhelming.", "Interview Questions": "Why do you want this position?"}, {"date": "26 May 2014", "title": "Senior Software Engineer Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Clemson University", "Interview Descriptions": "Interviews programmers, engineers, developers, and other technical personnel. Reads previous documentation and design notes, and uses computers. Must have strong communication skills, to include the abilities to: Translate requirements from customer to developer, Translate feedback from superiors.", "Interview Questions": "Rate your C++ abillity."}, {"date": "16 Apr 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clemson University", "Interview Descriptions": "Different departments run their own hiring. So, the process varies widely from one dept to another. In some cases, the GTA's are stuck to a certain supervisor, some have the opportunity to move. A phone interview is sometimes taken, sometimes hiring is based on email conversations. A good background in teaching is helpful in getting hired.", "Interview Questions": "N/A"}, {"date": "3 Apr 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Clemson University (Clemson, SC) in Feb 2014", "Interview Descriptions": "Everyone was very professional and was very organized. I met with all the professors in the department, staff, and students. It was a 1.5 day interview process, starting with breakfast-dinner on day one and breakfast-lunch on day two. I also gave a presentation on my research before lunch on the first day.", "Interview Questions": "I was asked a statistics question on something I learned during undergrad."}], [{"date": "1 Jan 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Clemson University (Clemson, SC)", "Interview Descriptions": "Online application and phone interview as initial screening,  face to face interview was not technical", "Interview Questions": "No difficult questions. Most focused on basics of my undergraduate major"}, {"date": "26 Oct 2015", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in Jan 2014", "Interview Descriptions": "You contact the department of a class you are interested in teaching then personally talk to a professor who is looking for a TA. The professor will then go over the work that you will need to be doing weekly and as long as you are capable, the professor will accept you", "Interview Questions": "Can you commit 10 hours a week?\r\nDid you get a high A in the course?"}, {"date": "21 Nov 2016", "title": "Customer Relations and Learning Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Clemson University (Clemson, SC) in Oct 2013", "Interview Descriptions": "I had to do two interviews to ultimately get this job. The first interview I did was for a help desk position but I don't think they thought I was experienced enough for the position so they recommended me for a clerk position. I did an interview for the clerk position and that one was super easy just the basic behavior questions.", "Interview Questions": "How do you handle conflict? "}, {"date": "20 Mar 2016", "title": "Software Engineer II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Clemson University (Clemson, SC) in Jul 2013", "Interview Descriptions": "Seemed just fine.  Relaxed interview.  The interviewers asked general questions but wanted to know how I could help out the team since I would primarily be working alone in my area.", "Interview Questions": "Tell us about how you handled a prior work issue?"}, {"date": "23 Jun 2015", "title": "Systems Programmer I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in Jun 2013", "Interview Descriptions": "The interview process is very bureaucratic, much like everything is with state agencies. Each department is different but must still adhere to the checks and balances. Sometimes, the people in the room ask you questions that they do not know the answer to, which can be very frustrating.", "Interview Questions": "What is the difference between rights and permissions?"}, {"date": "30 Sept 2015", "title": "CBBS Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Clemson University (Clemson, SC) in Apr 2013", "Interview Descriptions": "There was 1 interview and it was a panel interview with the whole department. They took turns asking questions about myself, work ethic, goals, etc. It was your standard interview but was tough at times because they didn't give themselves away with body language and were quite stern when talking.", "Interview Questions": "What is your biggest strength and weakness?"}, {"date": "1 Mar 2013", "title": "Sergeant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Clemson University", "Interview Descriptions": "A very informal interview process. Not difficult at all. If you get an interview, you are almost guaranteed a job. The interview process varies according to the person incharge of hiring.\r\nIt involves couple of behavioral and situational questions and as long as you you're not stupid, you'll get the job.", "Interview Questions": "Nothing, really."}, {"date": "25 Nov 2015", "title": "Industry Job Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at Clemson University (Buffalo, NY) in Mar 2013", "Interview Descriptions": "Two phone interview, one with HR, second one with a group, HR, future boss and Technical director. This was followed by an  on site interview and some one on one interviews with various managers and future co-workers. I got the job offer a week later per mail. We then started the job negotiations, which took another month. I finally took the job and started working 3 month after the initial interview.", "Interview Questions": "How would you convince upper management to change something?"}, {"date": "26 Oct 2016", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Clemson University in Jan 2013", "Interview Descriptions": "Meeting faculty members, and students representatives, giving a one-hour research talk, having dinners with faculty members. Schedule was pretty tight, and you would meet different people from 8am to 5pm, and then have dinner, and go back to hotel.", "Interview Questions": "N/A"}, {"date": "21 Jul 2015", "title": "Engineer II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Clemson University (Clemson, SC) in Dec 2012", "Interview Descriptions": "3 person panel and two person panel.  Separate interviews.  The three personal panel was of my \"peers\" while the other 2 person panel consisted of a supervisor and his peer.  Relaxed atmosphere.  Its obvious these people are cocky and think they are the best in the world.  I guess Clemson pride can change into an uppity personality.    After the interview on of the people on the panel continues to use his recommendation for me as a reason that I \"owe him\" something.", "Interview Questions": "how would you manage a disgruntled employee"}], [{"date": "29 Sept 2013", "title": "Graduate Grading Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Clemson University (Clemson, SC) in Dec 2012", "Interview Descriptions": "Nothing difficult, requires a professors referral, must be doing a thesis", "Interview Questions": "N/A"}, {"date": "16 Apr 2016", "title": "Student Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Clemson University (Clemson, SC) in Aug 2012", "Interview Descriptions": "very quick and easy, very basic questions about your knowledge of libraries and customer service. Had you take a test about the call numbers and had you e-verified. overall one of the simplest interviews i've experienced.", "Interview Questions": "How would you handle a particularly difficult customer if you had a line of people waiting?"}, {"date": "25 Feb 2013", "title": "Graduate Web Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Clemson University in May 2012", "Interview Descriptions": "It was a 3 step hiring process. \r\n1. A phone interview where i was asked about my experiance with web development and things in my resume.\r\n2. Was a one on one interview with the manager. Same questions about wed development and  \r\nbrowser testing.\r\n3. Sample web application desiging.", "Interview Questions": "Every thing for straight foward"}, {"date": "27 Jul 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in May 2012", "Interview Descriptions": "There is not too much behavior questions asked during the entire interview process. However, lots of technical questions were asked regarding the strain/stress analysis, thermal/ fluid science related fundamentals etc.", "Interview Questions": "Write down NS equations and explain each items."}, {"date": "20 Apr 2016", "title": "Store Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in Mar 2012", "Interview Descriptions": "It took only a day to transfer paperwork and talk on the phone with someone about a potential job. They were very efficient with the process. The interview was very easy and laid-back. They were willing to help me with any weaknesses.", "Interview Questions": "What are your hobbies? Strengths/Weakness?"}, {"date": "2 Sept 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Clemson University (Houston, TX) in May 2011", "Interview Descriptions": "There wasn't really an interview process. It really just consists of you submitting your graduate application. Of course, if you want to get in, you really need to take the ACT.", "Interview Questions": "Why do you want to be a graduate student?"}, {"date": "22 Jul 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Clemson University (Clemson, SC) in Jan 2011", "Interview Descriptions": "Straight forward interview. More wanted to chat and know that you can handle yourself in a group setting and will be able to provide assistance to the students. About as simple as they come. It is already a requirement for you to know the material so most of it is focused on you as a person and what else you can contribute to the program.", "Interview Questions": "What would you do in a strange student situation"}, {"date": "5 Jun 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Clemson University (Clemson, SC) in Sept 2010", "Interview Descriptions": "This position is provided by the department. So no formal interview is required. Basically, if the department wants to give you financial support based on your performance, you will get the job.", "Interview Questions": "N/A"}, {"date": "25 Mar 2014", "title": "No Interview Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Clemson University in Jan 2010", "Interview Descriptions": "I applied for the position and was offered the position without an interview.", "Interview Questions": "N/A"}, {"date": "10 Aug 2012", "title": "Student Services Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Clemson University (Clemson, SC) in Aug 2008", "Interview Descriptions": "was there for a day and a half; talked with the Comptroller of the University, Dean of the College of Education, Director of Educational Services (where job was going to be located), Registrar, Dean of the Graduate School, and Department Chair of elementary & Secondary Education", "Interview Questions": "Do you know the South Carolina teacher certification regulations?"}], [{"date": "29 Dec 2009", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Clemson University (Clemson, SC) in May 2007", "Interview Descriptions": "There actually is no interview process.  you apply to the school and are accepted.  If they like your work they will give you an assistantship.", "Interview Questions": "There were no actual questions that were asked"}]]