[[{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great organization", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Jan 2023", "job_title": "Director in Denver, CO", "duration": "N/A", "pros": "Human-centric company with excellent benefits, a four day work week, and making an impact", "cons": "I can't think of one!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "LOVE IT!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Aug 2022", "job_title": "Production Supervisor in Denver, CO", "duration": "N/A", "pros": "pay, team, purpose, work/life balance", "cons": "organization and direction were often blurry"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Dream come true of a company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Aug 2019", "job_title": "Program Associate in Denver, CO", "duration": "N/A", "pros": "I started working at Uncharted as an intern and was given a lot of responsibility and work that was taken seriously. I had a lot of agency to take on tasks of my own and give my opinion on matters that to me seemed off-limits. Everyone on the team welcomed my opinion and allowed me to be a full member of the team.  For my internship, and continuing on full time, I am lucky to work with people that are constant role-models for driving the kind of change I want to see in the world. Everyone on the team is dedicated to the mission and each person adds value in their own way. This is great because I feel like I can add value too. I am constantly learning something new and developing skills. As a result of the dynamic nature of our work, I get to experience different sides of our business.  \r\n\r\nIf you desire a workplace with great culture and you want to help move the needle on  big issues with people that care about them just as much as you do  this is the place to be!", "cons": "I value feedback a lot in my work. I wish Uncharted's feedback process was more robust including both informal and formal feedback."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Uncharted is next-level energy and next-gen impact!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Aug 2019", "job_title": "Program Manager in Denver, CO", "duration": "N/A", "pros": "Nothing is mundane at Uncharted. The office culture is one of nonstop joy and there is a magic to the convenings at the foundation of this organization. Even email correspondence feels purposeful. Who knew disruption and change could be this fun! Also, flexible hours, a few days of remote work a week, and 5 weeks of vacation is not too shabby!", "cons": "The work is not simple and the emotional labor required to accomplish our goals can feel intense. To move the needle on some complex problems will require bringing your whole self to work! Also, I never want to leave the office because I enjoy the company of my teammates too much which is a con, I guess."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "The best people I've worked with", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "7 May 2019", "job_title": "Anonymous Employee in Oakland, CA", "duration": "N/A", "pros": "Uncharted is full of self-reflective individuals genuinely devoted to delivering impact. The organization continuously works to improve, improving its dedication to measuring impact and adjusting the model to deliver stronger outcomes. In the past few years, the leadership has leveled up the sales engine of the organization, bringing in high-profile partnerships and doubling the budget of the organization positioning it to create more impact. \r\n\r\nThe culture of the organization is exceptional. This is a place where people love their jobs! The leadership is humble, devoted to the team, and extremely strategic.", "cons": "The organization is going through growing pains, with new sales and program partnerships coming in fast, along with the team growing quickly. This results in a heavy workload for staff."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Director", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Aug 2017", "job_title": "Director in Denver, CO", "duration": "N/A", "pros": "Where to start? Awesome team, incredible mission, great work/life balance--there's so much to love about Uncharted!\r\n\r\nTo be more specific, I worked at Uncharted for three years in various roles, and I had a great experience. Here are a few of the many pros: \r\n\r\n--I was given a lot amount of responsibility and freedom from day one despite my limited professional experience \r\n--Your team will trust you 100%, and even if you make a mistake it's treated as a chance to learn rather than a red mark on a test\r\n--You get to work with incredibly talented and driven entrepreneurs who are working on inspiring solutions to the world's biggest problems\r\n--The mentor and investor network! This is a network of people you'll get to hang out with that includes people like former execs at Yahoo, Google, HP, and EDs from the world's best nonprofits. Pretty darn cool.\r\n--The staff and the culture at Uncharted are unparalleled. This is a young, fun loving team who works hard and has each other's back\r\n--Great work/life balance with ample time off and a flexible work from home policy. There are some weekends and evenings required during accelerators, but otherwise I felt like I could unplug during evenings, weekends, and vacations\r\n--Great benefits and compensation. Compensation is tied to the 75th percentile of Colorado-based nonprofits and the benefits are very good--health, vision, dental, along with parental leave policies are among the best i've encountered\r\n\r\nThe other important thing to know about Uncharted is that the entire team has spent a tremendous amount of time and energy making the CEO, Teju,  believe that he's actually good at ping pong. And you'll be expected to do the same. This conspiracy is so extensive that every entrepreneur, mentor, and guest that has ever come to the office or a program has had to be secretly warned before arriving that they need to let Teju win, otherwise his delicate ego would be crushed. I spent 3 years losing to him despite being easily able to beat him any given day with my offhand. But it's a condition of employment at Uncharted that you keep this going, so I did it. \r\n\r\nKidding. Did I mention the team is fun-loving? \r\n\r\nIn summary, Uncharted gets an A+ for  mission, culture, compensation and work/life balance. This is a great place for self-starters and entrepreneurial people who are looking to use their talent and energy to make the world a better place and have one hell of a good time doing it.", "cons": "I have no major cons, but here are a few observations I made during my time at Uncharted: \r\n\r\n--There was no clear performance or feedback policy, so it was hard to get constructive feedback unless you actively and consistently seek it out\r\n--Not really a con as much as just a general observation, but as with any small nonprofits there was limited upward mobility\r\n--Little to no active management from superiors. Again, not necessarily a con but I'd say that people who are highly self-directed would do well while those looking for more oversight, training and guidance may find it difficult\r\n--Little to no professional development opportunities (i.e. manager training, project management courses, etc) \r\n--Strategy and roles shifted often, which was exciting but at times caused disconcert & confusion\r\n--At times the organizational structure and chain of command was unclear"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Be Wary of \"Company Culture\" Accolades", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Apr 2020", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "- Remote work flexibility\r\n- Relationship building opportunities with phenomenal entrepreneurs", "cons": "- Inexperienced executive/leadership team\r\n- Zero professional development opportunities\r\n- Limited upward mobility pipelines\r\n- Pay is horrendous\r\n- Most federal holidays not off\r\n- Team frequently condescended for being \"young\""}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Uncharted is Glorious", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Aug 2019", "job_title": "Program Associate in Denver, CO", "duration": "N/A", "pros": "The best part of Uncharted is the work culture, hands down. Between family meals, punny jokes, random dancing and out-of-work hangouts, there's no doubt that Uncharted's culture is the bedrock of its success. Additionally, working to make the world a better place by elevating those who are doing just that is incredibly rewarding.", "cons": "I honestly cannot think of any cons."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Absolute best place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Aug 2017", "job_title": "Logistics & Operations Manager in Denver, CO", "duration": "N/A", "pros": "Everyone truly treats each other like family\nSnack strategy!!\nFlexible work schedule\nTrust is given to you on day one\nWe're actually doing good things in the world!", "cons": "I need to write at least twenty words here, but honestly there aren't many cons. We're a growing company so sometimes roles shift quickly but that keeps it exciting!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Great people, culture, focus on impact and learning", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Aug 2019", "job_title": "Director in Denver, CO", "duration": "N/A", "pros": "A cohesive team dedicated to the mission, and not afraid to fail forward.  A culture of learning and genuine connection. This is an organization full of people committed to measurable impact.", "cons": "The organization is growing quickly and probably not well-suited to individuals that value predictability in their work."}], [], [], []]