[[{"date": "4 May 2023", "title": "Videographer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Elgin Community College (Elgin, IL)", "Interview Descriptions": "2-3 zoom interviews Over time, were quick to getting back to me. Nice intelligent people. Didn't require me to do a technical interview, which is common for these types of jobs.", "Interview Questions": "Name a time you overcame a struggle"}, {"date": "22 Jun 2022", "title": "Student Services Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Elgin Community College", "Interview Descriptions": "There was an online application with questions on experience relating to diversity. There was one fifteen minute interview. It was a total of three months between application and start date", "Interview Questions": "What was my experience with the population being served. "}, {"date": "5 Jun 2022", "title": "Senior Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Elgin Community College", "Interview Descriptions": "Group interview with 5 people on the panel, questions provided ahead of time. Nice people on the panel. There was no follow up after the interview over a month later. Feels like they just forgot or hired someone else and didn't notify other applicants.", "Interview Questions": "There was a question related to diversity in the educational environment"}, {"date": "28 Mar 2022", "title": "Department Chair Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Elgin Community College", "Interview Descriptions": "Virtual Interview with the Dean and 8 other department heads.  All had questions prepared and went around asking them. It was well organized and lasted approximately an hour.  NIce and friendly people, making the interview comfortable.", "Interview Questions": "Tell us about a time you had a conflict and how your resolved it."}, {"date": "19 Nov 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Elgin Community College", "Interview Descriptions": "Smooth, typical advisor questions related to previous advising experience, experience working with students with different backgrounds, and how you handle stressful/difficult situations. Hiring committee consisted of 5-6 individuals from different areas, one person I have seen several times for different jobs and wish they would mix it up!", "Interview Questions": "Give examples of your experience in working with diverse student populations. "}, {"date": "13 Sept 2021", "title": "History Full Time Faculty Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Elgin Community College", "Interview Descriptions": "Pretty standard timed cc interview. A set of questions, time to answer, a number of points on a list. Sent ahead. It was conducted over zoom due to the pandemic", "Interview Questions": "How you dealt with a problem with a student."}, {"date": "2 Jun 2021", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Elgin Community College", "Interview Descriptions": "The interview was set up online, no contact with HR or the hiring coordinator. The interview only lasted 30 min and was a panel format. There was only one interview, no phone screening.", "Interview Questions": "1. Advising and caseload management experience\n2. My definition of diversity\n3. Examples of how student affairs and academic affairs can collaborate\n4. Experience with data management\n5. How you've analyzed information to inform decision\n6. How advising is involved in retention\n7. Knowledge of and thoughts on early alert systems"}, {"date": "29 Apr 2019", "title": "Lab Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Elgin Community College", "Interview Descriptions": "was quick, asked me about my strength and what i would do in certain situations if i had a conflict with another staff member. quick interview, less than ten minutes long", "Interview Questions": "what are your strengths in this field "}, {"date": "18 Jan 2019", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Elgin Community College (Elgin, IL) in Jan 2019", "Interview Descriptions": "Done by committee, interview is 5 or 6 people firing questions. No real in-depth conversations. They have a list of pre set qustions that they have copies of.  The questions are asked “round robin”", "Interview Questions": "Tell me about a time you had to persuade someone. "}, {"date": "23 Sept 2018", "title": "Executive Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Elgin Community College", "Interview Descriptions": "Came in twice to meet with 2 different committees. Had to do a presentation for one. This is all expected at this level. They were however very inflexible with times for interviews. \nI did not get the position and I feel that was a good decision for both myself and the college. Only real complaint is the way they conveyed I had not gotten this high level position. I had to send an email for an update and was sent a very terse reply stating “position is filled”. Extraordinary unprofessional for a job at this level. HR department needs guidance and leadership.", "Interview Questions": "Why would you like to work here?"}], [{"date": "15 May 2018", "title": "Assistant Director of Admissions Mainland Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Elgin Community College (Chicago, IL)", "Interview Descriptions": "It was quick.  It was more like a detailed explanation of what was expected of the position which was nothing like the job posting or title.  It is really a regional recruiter position for someone living in Northern California, not Hawaii. Whoever holds this position will only travel to Hawaii twice a year for training,", "Interview Questions": "Followed by a very detailed explanation of the main duties, the interviewer asked if I was still interested and what have I done in my previous job that was similar."}, {"date": "22 Nov 2017", "title": "Office Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Elgin Community College", "Interview Descriptions": "Interview done by a committee of four people. They started by telling me about the job, then they asked me about 7 question. At the end I had a chance to ask any questions I had.", "Interview Questions": "What is diversity to you?"}, {"date": "20 Aug 2017", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elgin Community College (Elgin, IL) in Jan 2016", "Interview Descriptions": "quick but i hear thats not the usual. hr screen, phone and in person. they provided list of questions during interview to help you stay on target and i appreciated that", "Interview Questions": "advising philosophy and why"}, {"date": "23 Oct 2015", "title": "Adjunct Librarian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Elgin Community College (Elgin, IL)", "Interview Descriptions": "It was five years ago and I only had a group interview. Now they have candidates do a 30-minutes practice instruction session. You apply through the website and hope for the best - the jobs are always posted whether or not there is an opening, so look for the current postings on Rails or other websites", "Interview Questions": "Don't really remember, but seemed typical. What would you do if it were busy at the reference desk and you had three people there? The different panel members asked questions going around the circle."}, {"date": "15 Sept 2015", "title": "Administrative Role Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Elgin Community College (Elgin, IL)", "Interview Descriptions": "Took a very long time, interviewers were stoic and lacked emotion.  I must have waited for over 30 minutes for them to show up.  It was as if they forgot that I was interviewing that day.", "Interview Questions": "Name a time where you were affected by a diverse experience"}, {"date": "27 Nov 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Elgin Community College (Elgin, IL) in Jun 2015", "Interview Descriptions": "You are interview by the Supervisor assistant of the department. If you pass to the next step and are approve to work, you are sent to Financial Aide where you meet with Angela, whom gives you the necessary documents to fill.  There is a background check and the process of your documents takes around 2-3 weeks.", "Interview Questions": "What are you strengths? "}, {"date": "21 Jul 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Elgin Community College (Elgin, IL) in Feb 2015", "Interview Descriptions": "It was relatively quick and easy going.  The staff that hired me inquired about what my major was along with what I could contribute.  The interview was brief and ended with me being hired.", "Interview Questions": "What were some of my strengths?"}, {"date": "28 Jul 2014", "title": "Staff Position Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elgin Community College", "Interview Descriptions": "Very poor hiring process. Communication from HR aggravating due to being given incorrect information regarding interview time and location. Onboarding process very unorganized. I was asked what I needed to know rather than them telling me what they needed me to know. For heavens sake, I'm the new employee, I don't know what I need to know.\r\n\r\nIf you learn from watching, you're in luck. The training is just following people around prior to being thrown into the job without knowledge of what their full duties and where college resources are. I was told to re-read my job description when I had questions.\r\n\r\nPlan for an additional hour of Word and Excel testing for all levels even when your job does not require excellence in those skills.", "Interview Questions": "You will get a diversity question. Be prepared. Most questions are situational. "}, {"date": "29 Aug 2014", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Elgin Community College in Apr 2014", "Interview Descriptions": "The interview was conducted by three people from HR. They asked a lot of random questions about how I would handle certain situations and what I thought my best personality traits were. I thought these questions were somewhat relevant, but they never really touched on my qualifications, specific job duties, or experience.\r\n\r\nI had to take a timed Microsoft Word and Excel test, plus a typing test. They said they would share the results with me, but never did. \r\n\r\nI was also told that I would hear back about the position in about two weeks. They were very vague, so I didn't expect to hear back soon, but after a month pasted I stopped by to ask about the position and they wouldn't give me the time of day. I was only told that I would get an email one way or the other; I did eventually get one of those mass rejection emails after about a month and a half.", "Interview Questions": "What would my last employer ask me to keep doing, stop doing, and start doing?"}, {"date": "22 Jan 2014", "title": "Job Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Elgin Community College", "Interview Descriptions": "They have all interviews by committee. Usually 5 people and do not usually do second interviews. There are background checks and sometimes testing. All situational interviews.", "Interview Questions": "To give a presentation on topic."}], [{"date": "24 Nov 2013", "title": "Adjunct Librarian Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Elgin Community College", "Interview Descriptions": "Your hiring department is not on the same page as HR.  I was already working 4 weeks before I got a letter from HR \"Welcoming\" me to the Elgin family and saying I should expect to hear from my manager/dead within the next two weeks.  HR also notoriously loses paperwork.", "Interview Questions": "How do you address multi-culturalism in your teaching/instruction."}, {"date": "5 Jun 2015", "title": "Food Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Elgin Community College (Elgin, IL) in Aug 2013", "Interview Descriptions": "I actually did not really have an interview. My former roommate applied for the position he found online. He decided not to take the job when it was offered to him. So she asked him if he knew anyone who would like to work. He recommended me and she had me apply online, she and I had a brief phone conversation and that was it.", "Interview Questions": "She just asked when I could work."}]]