[[{"date": "22 Jun 2023", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University (Nashville, TN)", "Interview Descriptions": "It was a very laid back conversation. The purpose was more about getting to know me than covering any previous experience or technical skills. Overall a great experience and a position I'd recommend!", "Interview Questions": "N/A"}, {"date": "1 Jun 2023", "title": "Assistant Director, Recruitment & Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University (Nashville, TN)", "Interview Descriptions": "Very professional. All three interviews were casual, yet productive and deliberate. I enjoyed meeting everyone on the team. They ensured I was comfortable and that all my needs were met. They also gave me plenty of opportunity to ask questions. The interviews made me more interested in joining their team.", "Interview Questions": "What makes you uniquely qualified for the role?"}, {"date": "24 May 2023", "title": "Temperature Screener Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "Recruiters are nice and helpful. Gave great information about position and what perks were available. It was also a very fast process it only took a week to get hired.", "Interview Questions": "Are you comfortable with the location picked?"}, {"date": "19 May 2023", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "Too many phases and complexed questioning. Following a very long guide, requiring lengthy responses and many times repetitive. Do not let you know the duration of an interview, which usually goes over 2 hours", "Interview Questions": "N/A"}, {"date": "3 May 2023", "title": "Coordinator Student Organizations and Leadership Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "The first round is online one-way interview. It didn't limit the time of preparation or the number of recording times. The second round is online zoom interview with the search committee. The final round is on-campus final interview.", "Interview Questions": "What's your philosophy of service and how do you understand impact on the populations you serve?"}, {"date": "29 Mar 2023", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "Easy! Filled out in application and there was no interview. It was through a google form. I was a Teaching Assistant for Human Organizational Development and taught small group behavior 1300.", "Interview Questions": "They asked about your work experience."}, {"date": "27 Mar 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "It was a long interview process, where I had to meet everyone in the lab.They asked me all sort of questions .They were very welcoming and friendly.They just want to see your interest in their research", "Interview Questions": "Why are you interested in research?"}, {"date": "22 Mar 2023", "title": "Employer Relationship Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University", "Interview Descriptions": "It's a broken process. I think the team/department is great, but the candidate experience is non-existent. I wish I would have been able to spend more time getting to know the team. I was invited to do a one-way interview via a video platform called SparkHire where you record yourself on video. There is no interaction with a human/or two way dialogue- it's very one way. First step is usually always talking to a human to find out why the role was open, align on compensation, etc. This was skipped. Then there was a 5 person interview panel with no indication for who would be on the call beforehand. This is also a strange way to do an interview, they jumped right into one-way dialogue during this interview. I did ask during the call for them to tell me more about the role and they did. After this, they mentioned that there would be a series of in-person interview steps, and a presentation. I thought the call went well. Before going through 10+ more hours of interviews, I asked if I could have a quick convo with HR to understand more about the compensation and next steps in the process. HR led me to a recruiter that I had no idea existed. So we scheduled some time to speak. She didn't know what the salary range was, or what the next steps in the process were- usually recruiters are the gatekeepers of this information. What does the recruiter do all day if she doesn't manage the relationship with candidates or hiring managers? And I think this is where the process fell off- she seemed to make a bigger deal than it should be to know what the comp could be, emailing all of these departments to try to figure it, which is bizarre. It's a little unfair to candidates to make them go through a very lengthy process, and not to tolerate any questions. It was after that, that I was rejected from the role. It's strange because I would have loved the role and would have been great in it, but I wasn't allowed to have human interaction or two-way dialogue, which I think is very tone deaf in 2023. An interview process is a window into the employee experience. I would hope being an employee at Vanderbilt is a better experience than this interview process. Imagine not being able to advocate for yourself or ask questions for fear of consequences? I would hope that this is only a reflection of a broken recruiting process.", "Interview Questions": "N/A"}, {"date": "24 Jun 2023", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University in Feb 2023", "Interview Descriptions": "It was very informal and conversational. The process was laid back and they made me feel very at ease. They emphasized the importance of work culture and being about to self manage a work load.", "Interview Questions": "What are you looking for in a work culture within higher ed?"}, {"date": "18 Jan 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "1- 30 minute interview with the Human Resources Department. 2 - One hour interview with the team I would be working with. 3 - 30 minute meeting with the Director of the program.", "Interview Questions": "Where do you see yourself in the next year, 5 years, 10 years."}], [{"date": "12 Jan 2023", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "Easy process depends on the lab and PI. They mostly want to check your learning about work. Ask you to present your work to lab. Smooth process and very good", "Interview Questions": "What is your final goal?"}, {"date": "2 Feb 2023", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University in Jan 2023", "Interview Descriptions": "One one way interview through sparkhire four interviews with hiring staff One interview with vice chancellor of marketing Then I got an email from the head hiring personnel that they wanted to call and catch up and she said that they wanted to give me an offer", "Interview Questions": "Experience to make your suitable for this role"}, {"date": "6 Dec 2022", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "Fairly straightforward. It started with an HR screen and then moved to a few rounds of interviews with various people I would be working with. Everyone was very friendly and supportive.", "Interview Questions": "Tell us about how you manage conflict on a team"}, {"date": "7 Oct 2022", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "Remote Screening interview, then flew me in for an on-site in-person interview with the entire team/office. Very friendly and courteous through the entire process, and showed me around the building before the interview ended.", "Interview Questions": "What was the worst mistake you ever made? How did you fix it?"}, {"date": "4 Nov 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Vanderbilt University in Aug 2022", "Interview Descriptions": "I applied to a few roles online-- they all were variably different, but interesting Program Manager Roles. I received 2 email invites to complete the HireView process. One each for two different roles. I don't have a personal computer, so I ran to the store to buy one just for the opportunity (huge mistake). Anyway, I completed the hireview process, and hated every second of it. For the financial effort I put in, I felt I had to at least submit the responses. A few times I had to rework my answers just to fit in the short time limit, which kept leading to frustration. Once I submitted, I never heard back. It's left a sour taste in my mouth for the organization. I will not be completing anymore One Way Interviews.", "Interview Questions": "What are your salary expectations?"}, {"date": "12 Oct 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Vanderbilt University in Aug 2022", "Interview Descriptions": "Applied online, got the invitation to interview about a month after submitting my resume. Interview was an automated one way video recording interview. 6 questions, one minute time limit for each answer with unlimited attempts to re-record your answers before submitting. The time limit was a little short for some answers. This was my first ever one-way video interview so it was a little awkward, especially not being able to get live feedback from the hiring manager. I received an automatic rejection ~2 weeks after submitting the interview.", "Interview Questions": "What makes you a good fit for this position?"}, {"date": "8 Jul 2022", "title": "Communications Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "long wait until hearing back, but very nice on the phone. i wish they had gotten back to me sooner because i loved their culture! they are also a remote office.", "Interview Questions": "what is your timeline for this position"}, {"date": "7 May 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "Depends on the professor and/or group that interviews you. EE has a very nice department with very friendly professors. They want to make sure you are a good fit for the team just as much as you want to join them.", "Interview Questions": "Why are you interested in our department?"}, {"date": "17 May 2022", "title": "SMM Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Vanderbilt University (Nashville, TN) in May 2022", "Interview Descriptions": "Overall a smooth process! Questions are there for you to look formidable in one way interview. if you can present your knowledge in the interview, it will work out the best.", "Interview Questions": "Why would you like to work for us?"}, {"date": "27 Jul 2022", "title": "Loss Control/Risk Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Vanderbilt University (Nashville, TN) in Apr 2022", "Interview Descriptions": "So,  I applied for this job in late April. This was an associate-level position. The entire process took 3 months. The interview process composed of three rounds, but I ended up talking to ten people in total. The second round consisted of three different panels, which was excessive by all accounts. During the second round, the hiring manager emails me and tells me that two of the interviewers (high up in the hierarchy) consider me to be the top candidate. So, as I wrapped up my final interview—I sent thank you emails & follow up questions, which weren’t answered. From that point on, I received radio silence until the hiring manager finally responded and told me that HR forgot to reach out to inform me that I didnt get the position. Unprofessionalism at its finest. Throughout this process I have been flexible and carved out a great deal of time to accommodate the interviewers only for them to ghost me in the end. They were completely disrespectful of my time. I will never apply to this university again. This has been the worst interview experience of my career. Highly recommend against applying.", "Interview Questions": "Tell me about your experiences?"}], [{"date": "21 Feb 2022", "title": "Veterinary Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "The interview process was very seamless and explained in depth beforehand. The faculty members were down to earth and relatable. All questions and concerns were addressed realistically. Considering we will be relocating from out of state, there were plenty of opportunities to discuss relocation", "Interview Questions": "Why do you want to work for Vanderbilt "}, {"date": "8 Dec 2021", "title": "Biological Sciences Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Vanderbilt University", "Interview Descriptions": "Participated in several interviews for the department of biological sciences and never heard from them again. They least they could do is send a form rejection email. The interviewers were also underprepared and did not have a set of questions, so it was difficult to interpret what they wanted from the candidate.", "Interview Questions": "The interview team did not have actual questions, so I cannot remember one specifically."}, {"date": "28 Jul 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vanderbilt University in Jun 2021", "Interview Descriptions": "Several virtual interviews with the team members and then manager. All in one day. Hiring manager was late to the interview bc lost track of time watching Vandy in College World Series and then abruptly ended the interview...most likely to get back to the watching the game.", "Interview Questions": "Standard situational questions. Several questions about times you had to let go of an employee."}, {"date": "8 Apr 2021", "title": "Videographer/Editor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "Very simple streamlined process and got back to me quickly about the position. Required a great deal of references but nothing out of the ordinary. There weren't any trick questions or anything of the like. Great experience all around!", "Interview Questions": "Describe a project that you're proud of and why. "}, {"date": "31 Aug 2021", "title": "Associate Director of Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Mar 2021", "Interview Descriptions": "Overall a decent interview process. After the first three interviews they cut the process entirely with no message or warning. I reached out to clarify where we were in the process, and no response from hiring manager. Very unprofessional hiring process in my opinion.", "Interview Questions": "What skills I find most helpful when trying to secure major gifts."}, {"date": "19 Feb 2021", "title": "Teacher Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University", "Interview Descriptions": "Quite extravagant interview process with minimal delays and exceptional interaction with hiring staff and recruiters. Please try to apply to work here, you will not regret your decision. Wouldn't mind going through the hiring process again", "Interview Questions": "What are your biggest weaknesses?"}, {"date": "15 Sept 2022", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Jan 2021", "Interview Descriptions": "I was definitely qualified for the position and immediately received a request for a link to do a one-way video interview where I was given a list of questions to respond to within a week.", "Interview Questions": "Interview questions were basic personality questions and had little to do with the responsibilities of the job. I can understand if my personality/race/gender/age ... was not a good fit for the job, team, department, but I would have appreciated a followup message to let me know. Instead, I received no response or follow up from the recruiter. "}, {"date": "13 Jan 2021", "title": "Care Partner Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University (Nashville, TN) in Dec 2020", "Interview Descriptions": "Phone - I called at designated time, the hiring manager from a different department asked me questions and answers my questions wonderfully! I had a great experience and felt comfortable.", "Interview Questions": "They asked me what I’ve done and what I would do in difficult situations. Basic questions "}], [{"date": "7 Nov 2021", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Vanderbilt University (Nashville, TN) in Aug 2020", "Interview Descriptions": "First round phone call; I thought it went well but never heard back. The interviewer was friendly, though I was disappointed they never responded with updates on the hiring status even when prompted.", "Interview Questions": "How does your previous experience apply to this position?"}, {"date": "30 Mar 2022", "title": "Communications Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Feb 2020", "Interview Descriptions": "The employer wants to learn about you and how you work with others. Very much a leadership interview where they are trying to see if you fit the culture. Nothing too technical.", "Interview Questions": "Why do you want to work for Vanderbilt?"}, {"date": "2 Apr 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "Paper application; no in person interview.  After being accepted to the university, I was told that I would complete all of my research hours under an advisor who had selected me based on my application.", "Interview Questions": "N/A"}, {"date": "8 Mar 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University", "Interview Descriptions": "They fly me and let me do a presentation about my research. I interviewed primarily with the PI and also other faculty members. I talked with the group members as well. It was a great experience.", "Interview Questions": "Talks about your research."}, {"date": "1 Dec 2018", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "It was so long ago I do not remember the process it was so long ago and to get past this to see a different review I am having to corrupt the rest of the results for everyone who may be looking for information", "Interview Questions": "N/A"}, {"date": "12 Aug 2022", "title": "Manager of International Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University (Nashville, TN) in Dec 2018", "Interview Descriptions": "It all depends on who is your Manager.  But overall the interview process was smooth.  They were very interested in what I can bring to the Department and even posed some scenarios and asked me how I would fix them.  ", "Interview Questions": "They asked me about how I would handle a last minute call from a Department wanting to bring someone abroad ASAP.  "}, {"date": "27 Nov 2018", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University (Nashville, TN)", "Interview Descriptions": "It took several weeks. It started with a phone screen. I was finally called in to interview with a woman who said I was overqualified for the position. She asked general interview questions \"why do you want this role\" etc", "Interview Questions": "How have your other position prepared you for this role?"}, {"date": "17 Aug 2018", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University", "Interview Descriptions": "There was no formal interview process.  I reached out to potential advisors in my selected department and we spoke about possible research projects from there.  Most of the interactions were done through phone calls and email, as well as one on one meetings during the visit day to the department.", "Interview Questions": "What research topics you are interested in.  Academic background and previous research experience.  It was also important getting to speak with other members of the department and lab group during the visit day to get a feel for what life is like at Vanderbilt specifically. "}], [{"date": "25 Jul 2019", "title": "Operations Services Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Aug 2018", "Interview Descriptions": "The interview process was pretty much as basic as you can get. You come in and sit down  and they call your name. You go into a office with 2 people and they ask you questions.", "Interview Questions": "What is your schedule like?"}, {"date": "12 Sept 2018", "title": "Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Jul 2018", "Interview Descriptions": "First Interview, received an email to schedule the interview at the most and best convenient time for me and scheduled using a link that they sent to my email for the interview", "Interview Questions": "questions about employment history"}, {"date": "2 Apr 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University in Jul 2018", "Interview Descriptions": "Rotating panel interview with several project coordinators. Asked about prior experience, flexibility. Asked about experience working with underserved populations. Overall, they seemed to be looking for you to say that you understood to balance between implementing curriculum with fidelity and responding to individual situations.", "Interview Questions": "What would you do if a tutored student had disruptive behavior? "}, {"date": "2 Jun 2018", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "Job Talk with research job market paper, meeting with potential colleagues all day long, dining with them twice lunch or dinner, meeting with Dean, meeting with students in the group", "Interview Questions": "how do you describe your research"}, {"date": "12 Jul 2018", "title": "Media Support Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Jun 2018", "Interview Descriptions": "The interview was straightforward, fair, and rigorous. I was interviewed by the hiring manager and another specialist. The interview had three rounds and asked very appropriate questions. Nothing seemed to be out of left field.", "Interview Questions": "No questions were too difficult or unexpected, assuming you work in this field."}, {"date": "16 May 2018", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at Vanderbilt University", "Interview Descriptions": "There is a phone interview with HR prior to any in person interviews. Then the in person interview is a multi step process consisting of one interview with the upper management and one interview with many of the therapy staff.", "Interview Questions": "What is one thing that you have done that you are really proud of in your career? "}, {"date": "11 May 2018", "title": "Talent Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University (Nashville, TN)", "Interview Descriptions": "One phone screen interview and one in person interview. It was very conversational. He let me lead the interview with my questions. It seemed like the interviewer wanted to get to know me.", "Interview Questions": "Tell me about yourself."}, {"date": "3 May 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at Vanderbilt University (Nashville, TN)", "Interview Descriptions": "One employer provided the job offer but then withdrew it right before I was about to start. Another employer didn't show up on time at all. The interview with him was in a very dark, unlit office, as if it were a scene from one of Edgar Allen Poe's stories.", "Interview Questions": "What are your passions?"}, {"date": "19 Apr 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Vanderbilt University (Nashville, TN)", "Interview Descriptions": "very relaxed, easy. asked a few basic questions and got hired on the spot in less than 5 minutes. I was just asked some questions about my time at vanderbilt, if I was enjoying the school, and my major. Really simple", "Interview Questions": "Do you like Vanderbilt so far?"}, {"date": "20 Feb 2019", "title": "Licensing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Mar 2018", "Interview Descriptions": "I interviewed with the Center for Technology Transfer and Commercialization. The office is very laid back and encourages collaboration. The interviewers reached out via email and we set up a time to meet the following week. I came in on a Tuesday afternoon and had a conversation with a licensing analyst and licensing officer. I heard back by that Friday.", "Interview Questions": "Tell us about your background and interests."}], [{"date": "7 May 2018", "title": "Office of Investments Summer Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Mar 2018", "Interview Descriptions": "Started off with a phone interview. Then, a sit down chat with the team and an eventual chat with the head of investments. Whole process did not take long and was only a matter of a few weeks.", "Interview Questions": "Grilled you on resume stuff."}, {"date": "6 Nov 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vanderbilt University (Nashville, TN) in Feb 2018", "Interview Descriptions": "Applied online and get back from a student consultant to interview me. Behavioral interview and pretty laid-back and he recorded my answers to send them later to the person in charge. Interviewed at a cafe.", "Interview Questions": "Describe your time working in a team and encountering conflicts"}, {"date": "16 Jun 2020", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Vanderbilt University (Nashville, TN) in Feb 2018", "Interview Descriptions": "The first round of interviews consisted of three sessions of group interviews. In these, we solve a problem as a team, hosted group discussions, and created posters for presentations. These were weighted less heavily than the individual interview where I was interviewed by one area coordinator and two current RAs. Questions about my personal experiences and ideas for floor community were the focus of the latter interview portion.", "Interview Questions": "What is a plan you have to improve the community on your floor?"}, {"date": "21 Aug 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Vanderbilt University (New York, NY) in Aug 2017", "Interview Descriptions": "Applied online. Then had a phone interview. I was referred by a current employee, so it came down to having the right experience and knowing the right person. It was a painless process", "Interview Questions": "We mostly just reviewed my Resume"}, {"date": "6 Jul 2017", "title": "Graduate Assistantship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "Over the phone interview. Spoke to them for about 15 minutes over the phone and then arranged an in person interview when I finally moved to Nashville. The in person interview was a bit longer, but was very friendly and casual.", "Interview Questions": "background questions"}, {"date": "18 Oct 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Vanderbilt University (Nashville, TN) in Jul 2017", "Interview Descriptions": "Ask about python question and test of understanding economics. Test about how to use machine learning algorithm to solve the data analysis problem . Ask something about behavior economics and what's my availability.", "Interview Questions": "How to use python to do web scraping"}, {"date": "29 Aug 2017", "title": "Postdoctoral Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Vanderbilt University (Nash, TX) in Jun 2017", "Interview Descriptions": "It was a very hard day. I had in my schedule 11-12 people to meet. I was completely tired by the moment I had a presentation (3:00 PM, the interview started at 8:30 AM).\r\n\r\nAs my presentation and the group meeting were scheduled in the middle of the day, so every single person I met during the morning/afternoon asked me the same list of questions.\r\nIt was so annoying. It would be better, if group meeting and presentation were in schedule before this series of individual meetings.", "Interview Questions": "Asked about previous projects, asked questions about my skill set from CV, asked me technical questions, asked me how to solve potential tasks, etc."}, {"date": "9 May 2017", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Vanderbilt University (Nashville, TN)", "Interview Descriptions": "It was a horrible hiring process. I was very annoyed and frustrated throughout; the online formal application is virtually meaningless (do not apply only through the online Vanderbilt HR site; reach out to the lab you want to join directly) and there is little room for negotiations. I was only given three days to make a decision and felt incredibly uncomfortable and pressured.", "Interview Questions": "How do you handle confrontation? "}, {"date": "4 Dec 2018", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University (Nashville, TN) in Apr 2017", "Interview Descriptions": "It was a pleasant and long process. Met two faculty and the fellows to discuss in detail the nature of research work, how they handle work life balance and travel grants", "Interview Questions": "Where do you see yourself in 10 years from now"}, {"date": "28 Apr 2017", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University (Nashville, TN) in Mar 2017", "Interview Descriptions": "Suggestion: An interview works both ways. The hiring manager took pleasure in trying to make the interview difficult. It was very obvious. I knew within a minute I was not interested in working with her.", "Interview Questions": "Why are you interested in this job? What is your favorite movie?"}], [{"date": "27 Jul 2017", "title": "Program Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University in Feb 2017", "Interview Descriptions": "In-person initial interview with three staff members. Asked questions off resume. Short interview (45 mins). Follow-up promised next week (still awaiting communication). There are two more stages of the process to go.", "Interview Questions": "Describe a situation where you worked with a difficult person. How did you move past it and remedy the situation?"}, {"date": "22 Oct 2017", "title": "Front Desk Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vanderbilt University (Nashville, TN) in Jan 2017", "Interview Descriptions": "They asked how I would increase community and diversity. They asked a lot of questions about increasing programs and new projects. Needed to be familiar will dorm situations. Furthermore, I thought the interview process was quite easy.", "Interview Questions": "How will you increase diversity?"}, {"date": "29 Mar 2018", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Dec 2016", "Interview Descriptions": "I submitted a resume and written sample to some questions, and was asked to come into interview a week later. Was offered the job at the interview and accepted on spot.", "Interview Questions": "What are your weaknesses?"}, {"date": "16 May 2017", "title": "Director of Strategic Projects Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University (Nashville, TN) in Nov 2016", "Interview Descriptions": "The interview process was very personal--in a good way--offering job candidates to meet one on one with all team members, including subordinate and reporting roles. However, the process was unnecessarily long, involving a phone interview (30 minutes), an in person interview with the primary team members and boss (1 hour), another in person interview with broader team members (2.5 hours), and a final interview with the team members and the senior leadership of the university (3 hours).", "Interview Questions": "Q: What are the biggest challenges facing higher education today?"}, {"date": "28 Jan 2018", "title": "Student Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Vanderbilt University (Nashville, TN) in Aug 2016", "Interview Descriptions": "The process began with an online application. Job opening are posted on the Wond'ry website and interested applicant are asked to send in their applications. Selected candidates schedule an in-person interview appointment. After the interview, you are required to have basic safety training before work commences.", "Interview Questions": "What do you plan to bring aboard to improve the Makerspace"}, {"date": "26 Jun 2019", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University (Nashville, TN) in Aug 2016", "Interview Descriptions": "Initial phone interview. In person interview. Then offered position and was asked to respond fairly quickly with decision. In all, was about a month log process from application date to offer and proposed start date.", "Interview Questions": "Standard interview questions. Situational and hypothetical. "}, {"date": "18 May 2016", "title": "Senior Service Desk Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Vanderbilt University (Nashville, TN)", "Interview Descriptions": "Interviewed by phone and then days later I was interviewed in person. I was asked a series of questions related to not Windows and Mac platforms. I was then told the job was on hold for 2-3 weeks but only after the I terview was over. This is a terrible way to recruit talent.", "Interview Questions": "How do you login to a machine as administrator"}, {"date": "7 May 2016", "title": "Faculty Trainer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University", "Interview Descriptions": "Received communication to schedule a phone interview.  Interview went well and was with a panel of interviewers.  Interview lasted approximately 40 minutes and was friendly and academic.  Also had communication with the department coordinator and human resources.  All interaction was positive, professional and friendly.  Based on communication with HR, I anticipated that I would receive a follow-up interview.  HR asked about salary and my flexibility to my stated range.  Unfortunately, I never received a request for an in-person interview.", "Interview Questions": "Do you prefer to work in isolation or in a team environment?"}, {"date": "9 Nov 2017", "title": "Student Centers Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Apr 2016", "Interview Descriptions": "I applied online through the campus job portal and was selected for an interview. I was interviewed (behavioral questions) by two professional staff members and one student employee. They invited me to visit the office and gave me an offer.", "Interview Questions": "What skills do you have that would be applicable to this position?\r\nWhy do you want to work here?\r\nWhat would your availability be?"}], [{"date": "6 Oct 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Apr 2016", "Interview Descriptions": "The interview process was not bad at all. You mainly fill out a questionnaire to see if you would fit the specific role. I worked in the plant operations sector and interviewed in a completely different building. As long as you show you are willing to work hard, put in the hours, and have a strong resume you will be good.", "Interview Questions": "Have you ever worked with data to better a community?"}, {"date": "2 Mar 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Vanderbilt University", "Interview Descriptions": "It was casual and comfortable. Be prepared to know your stuff. Also, it really just takes you having a specialized experience that someone in the research group can benefit from. I just got asked basic questions, then I was asked to explain my previous research in detail.", "Interview Questions": "tell me how __ works?"}, {"date": "20 Mar 2017", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Mar 2016", "Interview Descriptions": "Internal hiring - interviewed with HR as a phone screen then with panel internally. Most interviews conducted to external candidates include an HR phone screen, then half day of interviews internally", "Interview Questions": "Describe how you would handle a situation if a parent got involved in the graduate student's life as a student. "}, {"date": "19 Feb 2016", "title": "Java Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Vanderbilt University (Nashville, TN) in Feb 2016", "Interview Descriptions": "Questions fired from 5 people. It was a technical interview asked on the phone then they call for onsite interview . I was interview two times.I gave them answers orally, they are not that difficult but I was not selected", "Interview Questions": "1. Difference between List and Set\r\n2.Mention different java design patterns \r\n3.What is dependency injection \r\n4. Webservices and their uses"}, {"date": "18 Aug 2020", "title": "IT Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Feb 2016", "Interview Descriptions": "I applied in December; I then had a phone screening interview in January;  Followed by an on-site interview (1:1 and team intro which I appreciated) in February. I was  extended an offer a couple of weeks later in February", "Interview Questions": "General questions around my work history and experience"}, {"date": "31 Jan 2016", "title": "Lead Pulse Sequence Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University", "Interview Descriptions": "A few senior engineers asking some common MRI knowledge. Was asked to do a presentation. They also asked about collaborative and lead experience, but I did not have much to answer.", "Interview Questions": "Describe in what situation were you having a leading role?"}, {"date": "27 Jan 2019", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vanderbilt University (Nashville, TN) in Jan 2016", "Interview Descriptions": "I actually did not have to do an interview for this particular job. I am quite aware that this will differ depending on the specific boss or the specific job, but for my position there was nothing that I had to do except send in the application.", "Interview Questions": "N/A"}, {"date": "27 Mar 2017", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Jan 2016", "Interview Descriptions": "Sat at a panel. Pretty informal. Just trying to gauge your background and letting you know more about the position at depth. Pretty good about giving their perspective on the role.", "Interview Questions": "Why do you want this position? Where do you see yourself in 5 years? "}, {"date": "23 Feb 2016", "title": "IT Management Interview Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University in Jan 2016", "Interview Descriptions": "Applied online through the university website.  Had two separate phone interviews with members of the IT Department to discuss the position and the culture followed by an in-person interview that spanned 2.5 hours.\r\n\r\nEveryone was very polite and asked good questions.  The position was eventually given to an internal candidate.", "Interview Questions": "Describe how your experience translates to a University setting."}, {"date": "4 Oct 2016", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Vanderbilt University (Nashville, TN) in Dec 2015", "Interview Descriptions": "I submitted my online application in November. And received an interview offer in December. The interview was a two-day onsite event. We had lunch with potential recruiting companies and had dinner with current students.", "Interview Questions": "Tell me about yourself."}], [{"date": "23 Feb 2018", "title": "Senior Media Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Vanderbilt University (Nashville, TN) in Nov 2015", "Interview Descriptions": "Series of interviews over 3 - 5 months. A screening phone interview followed by another phone interview a few weeks later with the hiring manager and then about a month or so later an in-person interview with that manager. Job offer came a few weeks later.", "Interview Questions": "Questions about experience and availability."}, {"date": "12 Oct 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Vanderbilt University", "Interview Descriptions": "Very brief interview process. For many people it's through Doreways. However, I found out about my position at VUIT Media Services by being a film major and getting to know the director of VUIT Media Services. There were many openings at the beginning of the year, which is definitely the best time to look for jobs. It pays ~minimum wage but it's very low stress and structured time to do homework.", "Interview Questions": "What are your available hours?"}, {"date": "6 Oct 2015", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University", "Interview Descriptions": "Submit an application–Link can be found on the Application Forms page. The Application deadline is Friday, January 11th by 11:59pm.\r\nEach application must include a resume and cover letter\r\nAttend at least one information session. The dates and times of information sessions may be found on the Information Session page.\r\nAttend either the Friday/Saturday or Tuesday interview process which take place in February.", "Interview Questions": "Tell me about a time when you had to deal with conflict."}, {"date": "5 Aug 2016", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University in Oct 2015", "Interview Descriptions": "There were three interviews before they told me they went with another candidate. Each interview was with a different person, but asked similar questions. Be prepared for the \"normal\" interview questions (strengths, weaknesses, five year plan, going over the resume, etc)", "Interview Questions": "What's an obstacle you've overcome in the workplace?"}, {"date": "9 Oct 2015", "title": "Human Resources Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Vanderbilt University in Oct 2015", "Interview Descriptions": "Phone interview went well. Was concerned about lack of higher degree however I had more than adequate experience to suffice for the degree. Was told I would be contacted within the next 2 days. I sent thank you email after interview. I sent followup email 6 days after interview just to let them know I was still interested.  Was emailed the following day indicating I was not chosen because of my lack of education. I find this ironic because the rejection email that was sent to me had numerous spelling errors. I appreciate the time Vanderbilt took to interview me however not moving forward due to the lack of an advanced degree is unfortunate. I think they are doing themselves a disservice. Just because someone may have an advanced degree does not mean that he/she has a good work ethic, passion, drive, etc.  Many famous inventors, leaders, etc. never obtained an advanced degree however they are making huge impacts on the world and society.", "Interview Questions": "Why do you want to work for us?"}, {"date": "4 Sept 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Vanderbilt University (Nashville, TN)", "Interview Descriptions": "Following submission of the online application I was contacted to come for an interview weekend.  Interview was very informal.  I met with multiple professors who told me about their research and then asked me to describe mine.", "Interview Questions": "Describe your research experience"}, {"date": "24 Sept 2015", "title": "Research Analyst III Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Sept 2015", "Interview Descriptions": "Two interviews, one with the lead PI, second with coworkers (one week later). I was contacted via email to schedule it over the phone, since I am not an in-state resident of TN, which was extremely convenient. Smooth scheduling process.", "Interview Questions": "describe a conflict with previous coworkers and how it was addressed"}, {"date": "25 Aug 2015", "title": "Human Resources Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Vanderbilt University", "Interview Descriptions": "I was contacted by the recruiter for the role, and completed a phone interview with her. It was your typical \"get to know you\" phone screen to ensure I met the basic qualifications. I was next phone screen by the Sr. HR Consultant. Following that interview, I was chosen to fly to Nashville to meet with the Leadership Team and HR peers. The panel interview was a day-long event, and I met with 5 different member of the HR community while on-site. \r\n\r\nFollowing that interview session, I followed up with the recruiter a week later to inquire. I received no response. I then followed up again with the recruiter, and again received no response. I sent an email to the Sr. HR Consultant I had interview with previously, and then received a response from the recruiter that there must have been a \"technology error\" as she states she sent me an email in the previous week that the team was still interviewing candidates. I was assured that I would received some follow-up following that interview however that was the last I heard from them.", "Interview Questions": "Typical STAR Format - I was asked a behavioral based question, and I needed to respond with the situation, task, action, and result. "}, {"date": "21 Apr 2015", "title": "Research Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Apr 2015", "Interview Descriptions": "Phone interview, asked if I could come in to interview with two other faculty members and answer basic questions about my lab experience and undergraduate work. The recruiter said they are quick to hire once the interviews are done.", "Interview Questions": "Why im interested in research and i have any prior experience with the specific lab equipment and background they they work on. how long will i be staying here and what do i want to pursue"}, {"date": "13 Sept 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University (Nashville, TN) in Apr 2015", "Interview Descriptions": "The process was simple and easy. I applied online, had a screening phone call followed by an interview in person. Nothing technical was asked, it was very standard. The people were very nice throughout and although I was nervous at the beginning it was easy to ease my way into the interview.", "Interview Questions": "Why do you want to work here?"}], [{"date": "17 Jul 2016", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Mar 2015", "Interview Descriptions": "3 persons at initial interview, follow up was initially to be made by the next week. After what was initial enthusiasm on the part of the interview team, the promised follow up did not materialize.  No explanation was provided for the sudden change of heart.  It appeared that there nay have been an issue with one or more items related to a background check.", "Interview Questions": "How do you feel about working with ancillary non-physician staff?"}, {"date": "16 Jun 2015", "title": "Assistant Director of Stewardship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vanderbilt University (Nashville, TN) in Feb 2015", "Interview Descriptions": "I was an internal candidate, but still had to go through the same basic phone screenings as outside candidates. You interview once with just one person, or this may also be a phone interview.  You then spend almost three hours interviewing with various groups of people.  You get asked a lot of the same questions each time.", "Interview Questions": "What will you do if you do are not offered this position?"}, {"date": "11 Feb 2016", "title": "Information Technology Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Jan 2015", "Interview Descriptions": "The interview process consisted of 2 phone screenings and 1 face to face interview.  All questions were fair and consisted of mostly behavior questions,  The face to face interview was a panel interview", "Interview Questions": "What would you consider the greatest challenge of a new position?"}, {"date": "8 Jul 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vanderbilt University (Nashville, TN) in Jan 2015", "Interview Descriptions": "The interview process was easy for a graduate student visit. Interviewers were simple and we were more interested in seeing where I would place rather than if it would be a good fit.", "Interview Questions": "Questions relevant to my field of study, robotics"}, {"date": "3 Nov 2014", "title": "Graduate Student Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "I am a PhD candidate in the biomedical field and I applied through the IGP program. Got a phone interview and that was all. I think the program selects students mostly based on application materials, e.g., transcripts, CV, etc.", "Interview Questions": "N/A"}, {"date": "30 Oct 2014", "title": "Assistant Dean Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Vanderbilt University (Nashville, TN)", "Interview Descriptions": "It was a national search and they ended up interviewing 5 candidates. It included a search committee of faculty and administrators. Staff that the position supervised were also included in the interview process to provide feedback. Recommendations were made to the Dean of the College by the Search Committee.", "Interview Questions": "We think you will out grow this position very quickly. Why would someone with your credentials be interested in this position?"}, {"date": "3 Oct 2014", "title": "Research Assistant I Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "I first received a phone call directly from the hiring lab. The call came months after I had applied for the position and by that time I already had set plans for the next few months. They asked if I could come in, interview and possibly start right away, but because of my prior engagements, I asked if they would be able to wait a few months. They agreed and a few months later I interviewed and started right away.", "Interview Questions": "The interview process was actually very casual with the manager introducing me to everyone in the lab and describing the work they do. In the end, the only questions she asked was if I had any questions, am I interested in the position, and when can I start."}, {"date": "5 Oct 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Vanderbilt University (Nashville, TN) in Sept 2014", "Interview Descriptions": "I applied online at the beginning of my sophomore year at Vanderbilt. I received a call a few days later asking for me to come in and interview for the position. I was taken into a room and did a preliminary screening interview where they asked me standard behavioral questions and questions about my past experience. I then received a phone call a couple days later that they were very impressed and I got the job.", "Interview Questions": "What relevant experience do you have?"}, {"date": "30 Sept 2014", "title": "Clinical Translational Research Coordinator II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University in Aug 2014", "Interview Descriptions": "I applied online and was contacted for an interview about 3 days later.  I did a Skype interview because I did not live in Nashville.  Following my Skype interview, they checked my references and about a week later I was offered the job.  I took a visit to Vanderbilt to see the facilities and meet the people I would be working with.  I accepted the offer after the visit.  Everyone was very nice and helpful during the process.", "Interview Questions": "The questions were pretty standard.  We talked about my background and experience, why I was interested in the position, and why did I want to work for Vanderbilt."}, {"date": "4 Jul 2014", "title": "Graduate Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vanderbilt University (Nashville, TN)", "Interview Descriptions": "Submission of application and interviews that was one day long. The questions asked was not out of the ordinary. Just a discussion regarding your previous research experience and interests similarly to what other schools would also ask during their interview process. The application is also free online so that the application costs are not prohibitive.", "Interview Questions": "N/A"}], [{"date": "11 Jun 2014", "title": "Graduate Student (PhD) Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "After initial application, students are notified of on campus interviews.  Students on site will interview with a number of professors personally or in groups, and can request specific interviews while there.  Number of interviews ranges from 2-6", "Interview Questions": "\"Getting to know you\" type interviews with professors, wanting to know your research interests and if you fit with their lab.  Research their lab ahead of time"}, {"date": "23 May 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "The whole process took about 3-4 months to complete, but I believe I started searching after other candidates, so may take longer. Contacted several different offices to see if GA positions were available, most had already been filled. Once I reached an opening, I had an initial interview, but didn't hear back for about a month. Eventually received a second-round interview. Interview was a mixture of typical strengths/weaknesses and behavioral questions.", "Interview Questions": "Mostly just behavioral questions about what would happen in unexpected situations"}, {"date": "11 May 2014", "title": "VSA Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University (Nashville, TN)", "Interview Descriptions": "The interview process was painless. They want to know what experience you have working with kids and they ask you some hypothetical situation questions. The questioner writes down your responses and gives you an overall grade that you will never see. Helps if you attend school at Vandy but not required.", "Interview Questions": "What would you do if one of the kids was falling asleep in class? (One of the hypothetical questions)"}, {"date": "3 Nov 2015", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Apr 2014", "Interview Descriptions": "Most of the classes don't have interviews for hiring teaching assistants. If you do well in the class and get to know the professor really well you can land the job.", "Interview Questions": "Tell me about yourself"}, {"date": "4 Jun 2014", "title": "Postdoctoral Research Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vanderbilt University (Vanderbilt, TX) in Apr 2014", "Interview Descriptions": "Applied online. Had a phone interview after one week. Then go for on site interview three weeks later. A full day interview with people there. Got email one week after interview date to inform they would not offer me.", "Interview Questions": "Lots of standard interview questions: why this job, career goal,"}, {"date": "2 Dec 2015", "title": "IT Help Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Feb 2014", "Interview Descriptions": "Simple troubleshooting questions, the whole process was straightforward. It can take a while for hiring cycles to open up, but after first contact the process was swift. I received the offer on the spot, the difficulty depends on how many applicants are interviewing for this round.", "Interview Questions": "What does a BSOD mean and how would you proceed to fix it?"}, {"date": "2 Jan 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vanderbilt University", "Interview Descriptions": "Phone interview dealt with previous work experience and course work. Overall, it was a positive experience and helped me decide which university to choose.", "Interview Questions": "Most of the questions were as expected including why I wish to pursue research work."}, {"date": "25 Apr 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Jan 2014", "Interview Descriptions": "It was a quick behavioral interview that was very easy to go through as long as you look at  typical review questions. There wasn't too much about my skills or background information.", "Interview Questions": "NDA"}, {"date": "27 Mar 2018", "title": "Network Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Vanderbilt University (Nashville, TN) in Jan 2014", "Interview Descriptions": "Very easy. Was not very detailed. They have since complete changed the guard so to speak. It was somewhat short. There was a large amount of buddy system things going on and it was not handled well.", "Interview Questions": "What are the standards for crimping cavles"}, {"date": "14 Jun 2016", "title": "Resident Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Dec 2013", "Interview Descriptions": "The interview was pretty relaxed - you are made to sit before a group of three interviewers, two students and one school official. The questions were pretty standard - of the sort, \"what would you do if x happened to a student... tell me of a time when... \" and so on.", "Interview Questions": "Tell me of a time when you resolved a conflict. What qualities qualify you as a good candiate?"}], [{"date": "8 Oct 2013", "title": "Research Analyst I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Vanderbilt University (Nashville, TN)", "Interview Descriptions": "I only conducted one interview. The hiring processes was really quick. However, they are reluctant to hire anyone outside of the Vanderbilt community. Usually, If you see a job posting, it's just for show as they have already interviewed an hired their candidate that was either an existing employee or a graduating student.", "Interview Questions": "I did not receive a difficult question. "}, {"date": "19 Feb 2014", "title": "GIS Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Vanderbilt University in Oct 2013", "Interview Descriptions": "Had a phone interview, asked some general HR questions, such as tell me a project you did, and how did you solve problems you met, etc.", "Interview Questions": "I thought HR gonna ask me some projects I listed on my resume, but all questions I prepared was different from they asked. So if you are preparing for an interview, be sure to search some general HR questions for the phone interview. "}, {"date": "28 Jan 2014", "title": "Undergraduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Vanderbilt University (Nashville, TN) in Sept 2013", "Interview Descriptions": "Pretty basic, applied online, requested interview later that week.", "Interview Questions": "Talk about a time you had a conflict with a professor. "}, {"date": "9 Oct 2015", "title": "Cook Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vanderbilt University (Franklin, TN) in Jul 2013", "Interview Descriptions": "General hiring and interview process, only had one interview no need for 2nd or 3rd interview, interviewed one day and was hired the next day, needed to take a drug test to finish interview process", "Interview Questions": "How long I had worked in field?"}, {"date": "24 Mar 2015", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Vanderbilt University (Nashville, TN) in May 2013", "Interview Descriptions": "It was quick and straight to the point.  They wanted to know you contribution to the field and your anticipated to the current void.  It was not difficult and I learned alot from the process.", "Interview Questions": "Why do you want to work in this university"}, {"date": "7 Mar 2013", "title": "Faculty Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Vanderbilt University", "Interview Descriptions": "I was already working there, so I just had to interview for the specific position for which I was being considered.  I submitted my resume and waited for them to follow up with me and call me in for an interview.  After that, I was given the offered salary and was able to negotiate up a little.", "Interview Questions": "It was the pretty standard questions...I can't say there was a particularly difficult one."}, {"date": "26 Feb 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "When interviewing for a spot as a graduate student in engineering, typically you go around to all the faculty members you are interested in working with and talk to them about their projects. The most important thing is to show you're paying attention, and try to ask insightful questions of THEM, to show that you can think critically and you find their work interesting.", "Interview Questions": "What do you want to do with your degree? (Ph.D)"}, {"date": "15 Feb 2013", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Vanderbilt University", "Interview Descriptions": "Applied for the Phd program ... got selected ..", "Interview Questions": "Did not have an interview ... "}, {"date": "23 Jan 2013", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Vanderbilt University", "Interview Descriptions": "I emailed the hiring manager through a mutual contact.  We then had several informal in-person interviews to discuss my background, goals, and the responsibilities of the position.  I also met with the senior manager for similar interviews.  The offer came within a couple weeks.", "Interview Questions": "Please talk about one of your best research accomplishments and discuss your roadblocks and how you overcame them."}, {"date": "1 Jun 2015", "title": "Post Doc Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Nov 2012", "Interview Descriptions": "I sent my research summary and power point presentation  and the three reference letters. They asked me about my research expertise and the techniques is used for it. I also explain my plan of work.", "Interview Questions": "How to trouble shoot the problem?"}], [{"date": "22 Sept 2015", "title": "Aa I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Oct 2012", "Interview Descriptions": "mine was quick, got a phone call a week after I submitted the application, interview the next week, started two weeks after. Should have taken that as a bad sign, left the job 11 months later.", "Interview Questions": "N/A"}, {"date": "15 Dec 2015", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Oct 2012", "Interview Descriptions": "I applied for the position in late September.  I was phone interviewed in early October.  I was flown to campus to interview in mid-October.  They made me stay on campus in an apartment that did not have an iron.  I had to hang my suit in the shower and steam it to get the wrinkles out.  They did take me out for a very nice dinner in Nashville.  \r\n\r\nI was offered the job the last week in October.  \r\n\r\nI started my position in December.", "Interview Questions": "What are you like on your worst day?"}, {"date": "10 Jun 2015", "title": "Program Coordinator II Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Vanderbilt University (Nashville, TN) in Aug 2012", "Interview Descriptions": "Very very slow. Three months process. Hardly heard updates.ton of excuses on there side. The law school hr department is horrible. I should of ran when I first got the offer.  The hr lady makes it look good, but in reality it is far from it.", "Interview Questions": "Tell me about your previous jobs ? Why Vanderbilt Law school?"}, {"date": "22 Feb 2015", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Vanderbilt University in Aug 2012", "Interview Descriptions": "They were a little stand-offish and that made me nervous, at first.  The manager did not seem to want to want to be doing the interview at all, so I felt uncomfortable.  I later found out that they were desperate for employees so a short phone interview was all it took.  I was hired after a few minutes.", "Interview Questions": "Do you have any past experience with food handling and preparation?"}, {"date": "15 Mar 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Vanderbilt University (Nashville, TN) in May 2012", "Interview Descriptions": "There was an initial screening through the application process, which required an employee referral along with questions specific to the position for which I was applying. After about a week, there was a phone interview followed by a casual group interview. We were alerted within the next week whether or not we were offered the position.", "Interview Questions": "What would you do if someone called you one the phone very upset?"}, {"date": "26 Apr 2012", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Vanderbilt University (Nashville, TN) in Apr 2012", "Interview Descriptions": "the interview process was very lengthy. First comes a general interview by a Talent Requisition Agent and then they forward their review to the hiring manager. Second, another phone interview, then third, an in person interview. The hiring manager took me to lunch and then I met with a team of people as well as the Executive Director. The questions asked were very general in nature and everyone was very helpful and informative. They welcome questions so be prepared to ask. Also bring an extra resume. Even though I was informed that the hiring manager had distributed my resume, some people still did not have it readily accessible. The job did not completely match the online description, but everyone was very clear on what they expect. Overall, it was a good interview experience", "Interview Questions": "What are you doing in your current job?"}, {"date": "20 Sept 2015", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Vanderbilt University (Nashville, TN) in Mar 2012", "Interview Descriptions": "There wasn't really a process. Was referred and they asked for my resume and then gave me the job thru email. And then asked me to come in, introduced me to the lab members and that was the whole process. Very quick and easy", "Interview Questions": "No interview questions"}, {"date": "25 Feb 2012", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Vanderbilt University (Nashville, TN) in Jan 2012", "Interview Descriptions": "Phone interview lasted about 30 minutes. Interviewer was very pleasant, but questions were unusually broad (ie. \"describe yourself in 3 words\"), which caught me by surprise because I had expected the interview to focus on substantive qualifications for the position. Also, the interviewer went through my resume and asked me for my \"favorite and least favorite part of each job,\" rather than focusing on skills which were utilized or developed in each position. Interviewer asked for a hard number for a salary expectation rather than just asking about previous salary history, so have your number in mind before you go into the phone interview.", "Interview Questions": "Describe yourself in three words."}, {"date": "8 Dec 2016", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Vanderbilt University (Nashville, TN) in Jan 2012", "Interview Descriptions": "Day long process with many interviewees attending at one time. Individually interview with at least 4 faculty members one-on-one. Also, sit through presentations about the institution and programs. Socials are also incorporated into the day with lunch and dinner served.", "Interview Questions": "What research have you done already? Why do you want to come to graduate school? What are your interests? "}, {"date": "6 Aug 2015", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Vanderbilt University (Nashville, TN) in May 2011", "Interview Descriptions": "There were multiple layers to the interview.  I met with people from different areas outside of the one I was applying.  All questions were thought out and effective at finding the correct candidate.", "Interview Questions": "Multiple questions where I had to calculate investment returns."}], [{"date": "20 Mar 2015", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Vanderbilt University (Nashville, TN) in Feb 2011", "Interview Descriptions": "Standard procedure for R1 institutions: You fly in and spend two days with a large variety of future colleagues (administration, faculty, staff. students and postdocs). Two breakfasts, lunch and dinners, 1:1 Meetings with faculty and Dean , 45 minute job talk with 15 minutes of questions right after.", "Interview Questions": "How much will you need to set up your lab?"}, {"date": "18 Sept 2012", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Vanderbilt University (Nashville, TN) in Feb 2011", "Interview Descriptions": "Arrived from Spain.  The professor didn't pay for the airfare to the US; instead, just paid from NYC to Nashville.  She also did not pay relocation costs.  On the day of the interview, I gave a seminar to the department.  Then, met with several professors to talk about my project.  In the evening, my soon-to-be boss took me out drinking....she ended up drunk and I had to carry her home.", "Interview Questions": "To explain the specifics of my research project more as to how it relates to differentiation and proliferation.  "}, {"date": "6 Jul 2014", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Vanderbilt University in Jan 2011", "Interview Descriptions": "Initial communications required a review of my resume. Afterwards, I was called into the office to do an interview initially with the administrator's assistant discussing experience, interests, and basic job responsibilities, as well as a tour of the office.", "Interview Questions": "What could you bring to the office that would streamline some of the filing processes? "}, {"date": "8 Sept 2014", "title": "Computer Systems Administrator II Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Vanderbilt University (Nashville, TN) in Dec 2010", "Interview Descriptions": "Interview/hire process is very slow. Expect several weeks from application to first call back. Expect upwards of a month from interview to being hired. They will pay mileage for you to come in and interview, and I was able to get relocation. The employee orientation is by turns great, and also full of information that isn't relevant to you, such as accountants and technical people getting instruction on how to move patients.", "Interview Questions": "N/A"}, {"date": "24 Jul 2014", "title": "Research Assistant I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University (Nash, TX) in Jun 2010", "Interview Descriptions": "The hiring manager and the HR together interviewed me, they mainly focus on how long I will stay and the skill I had at that time; they also asked about my working status and ask if I need them help spouse my H1 B Visa; they ask me about my organize skill etc.", "Interview Questions": "how to handle a missing data when you collect the data"}, {"date": "17 Feb 2012", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Vanderbilt University (Nashville, TN) in Feb 2010", "Interview Descriptions": "Was recruited at a career fair. Very open and emphasized the environment on campus. Applied online. Was invited to visit (paid for). Met with 4 professors who each interviewed me 1:1 for at least 30 minutes each. were looking for specific interests and how you would fit in with their lab and the department itself. Very open and laid back community but a lot of politics involved. Range of workers from very lazy to insanely busy.", "Interview Questions": "In your past research or project experience, describe a time that something did not go the way it was supposed to and the steps you took to deal with the situation."}, {"date": "21 Sept 2014", "title": "Staff Scientist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Vanderbilt University in Jan 2010", "Interview Descriptions": "Promised to offer instructor, then found an excuse and offer current title, saying same salary. Also, a supervisor, dog of the director, said lots of attractive promotions and exciting projects, and revealed that they just wanted to work hard and stolen what you have achieved later. In this Chixxx group, too many couples and relatives occupied the resources, and too bad relationships caused by the \"leaders\". Don't believe what they say, find out what they have done, and who have benefited and whether any new comers have earned what they deserve.", "Interview Questions": "N/A"}, {"date": "17 Jun 2012", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Vanderbilt University (Nashville, TN) in Jun 2009", "Interview Descriptions": "I applied on their job board and waited and waited.  I had heard that the HR department was really slow, so I did not expect much.  I went ahead and called a few of the departments myself, but it was no use.  They are by the book to go by the usual process through HR.  But I do believe that me taking the initiative did indeed speed up the process a little.  I was called in to meet with 2 managers at the same time since they were hiring for 2 positions and were trying to decide which would be a better fit.  After that interview, I met with 2 sets of co-workers on each team.  The interview questions were very basic.", "Interview Questions": "Why should we hire you?  "}, {"date": "14 Jun 2010", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Vanderbilt University (Nashville, TN) in Nov 2008", "Interview Descriptions": "Sent an email asking a postdoc position available and got an on site interview scheduled in a day. \r\nGave a presentation to group members and was offered.", "Interview Questions": "Describe research interest."}, {"date": "24 Feb 2010", "title": "Help Desk Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Vanderbilt University (Nashville, TN) in Aug 2008", "Interview Descriptions": "General tech questions. Just show interest and have good people skills. Questions were along the lines of if you have virus removal experience.", "Interview Questions": "Do you have experience removing viruses/malware"}], [{"date": "7 Jun 2012", "title": "Legal Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vanderbilt University (Nashville, TN) in Jun 2008", "Interview Descriptions": "Received email application submitted then received call to interview", "Interview Questions": "Standard questions"}, {"date": "13 Dec 2012", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Vanderbilt University (Nashville, TN) in Jan 2008", "Interview Descriptions": "Initial phone inrterview followed by in-person interview at academic conference, followed by visit to Vanderbilt.", "Interview Questions": "Why do you want to leave your current position."}, {"date": "4 Jun 2009", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Vanderbilt University (Nashville, TN) in Mar 2007", "Interview Descriptions": "The BRET office spent a lot of time telling us general information about the university and medical center, background on the IGP program. We then had a series of one-on-one interviews with selected faculty members, who told us about their own research and asked questions about our experience. interests, and our applications. We were chaperoned by 1st year students who were available for questions and we had meals with other senior grad students.", "Interview Questions": "How do you know you will be a good researcher"}]]