[[{"date": "27 Jun 2023", "title": "Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tate (Liverpool, England)", "Interview Descriptions": "Received an email to book the time slot for an in-person interview. Competency-based questions related to the job criteria on the job description. Three-panel members from different teams. very friendly. overall five to six questions.", "Interview Questions": "mostly related to demonstrating the skills"}, {"date": "26 Apr 2023", "title": "Corporate Partnerships Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tate", "Interview Descriptions": "quick and good feedback at the end of the interview. interviewers often cut off before you were finished speaking, which I found quite rude. Personable enough, but were definitely looking for a certain 'type ' of person.", "Interview Questions": "had a corporate partnerships task which we had to present."}, {"date": "21 Feb 2023", "title": "Events Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tate", "Interview Descriptions": "Interview process was relatively straightforward. I was invited to an online interview with a panel of 2 people I would work closely with, then an interview in person with a panel of 3. Standard interview questions with a prioritisation activity.", "Interview Questions": "Talk us through your work history Where do you see yourself in 5 years time Tell me about a time when plans have changed and you have had to adapt"}, {"date": "15 Feb 2023", "title": "Event Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tate", "Interview Descriptions": "After asking some basic questions through a telephone interview and some handling matters for restaurant service, I didn't find it very difficult, probably because it was only a part-time job.", "Interview Questions": "Describe your favourite dining environment that you have experienced."}, {"date": "12 Jun 2023", "title": "Assistant Conservator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tate (London, England) in Feb 2023", "Interview Descriptions": "For Sculpture and Installation Assistant Conservator. The interview was scheduled for one hour with half for a practical task (situation presented on computer to answer in bullet points) and the other for interview.", "Interview Questions": "Please can you tell us about your process for ensuring correct H&S is followed in your work, if possible, with an example?"}, {"date": "10 Mar 2023", "title": "Curator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Tate (London, England) in Feb 2023", "Interview Descriptions": "Involved a presentation and followed standard interview questions which I understood they asked everyone as well as a few specific to the role. It seemed a fair and transparent process, although they did not do a second round of interviews as originally planned and appointed their chosen candidate.", "Interview Questions": "One of the specific questions related to how I view relationships with patrons and any experience in this regard"}, {"date": "26 Dec 2022", "title": "Communications Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tate (London, England) in Oct 2022", "Interview Descriptions": "1 round in person interview, with 3 team members, asking questions about media knowledge and past experiences. Included one question about how you would deal with a journalist asking about controversy related to a Tate sponsorship.", "Interview Questions": "Why did you apply for this role?"}, {"date": "31 Aug 2022", "title": "Retail Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tate (London, England) in Aug 2022", "Interview Descriptions": "Was given situational scenarios to complete in groups. This includes introducing team members, creating a new idea attraction for the museum and picking certain items for a customer brief. Although the tasks were very easy, I gave it my best to answer every problem fully in the most creative manner I could. Especially, since it wasn’t a conventional interview standard it was difficult to prove competency. \r\n\r\nUltimately, didn’t get the job. Wouldn’t have minded, but I just feel that “dumbing down” my answers or contributing minimally would be the only possibility I had of passing the interview.  \r\n\r\nWith such a informal interview approach, I believe they’d already made their decisions based on application. Would have just preferred a conventional interview approach over one that doesn’t really work. \r\n\r\nAs a artist, am really disappointed with the result as museums are my favourite pastime. However ,it has given me the initiative to focus more on monetising my art and writing and working on developing a startup business.", "Interview Questions": "Scenario questions to do with what might happen in the store. Given a customer breif and was asked to select products for customer and explain the reasoning. "}, {"date": "21 Sept 2022", "title": "Development Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tate (Liverpool, England) in Jun 2022", "Interview Descriptions": "Applied online via applications portal. \r\nI was accepted for an interview that was a short 15 minute task - to compose an email for donors which was very informative.\r\nFinally, I was invited to a  face to face interview after the task was completed. The interview was relaxed but formal with a panel of three staff members.", "Interview Questions": "What does diversity mean to you?"}, {"date": "22 May 2022", "title": "Visitor Experience Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tate (Liverpool, England) in May 2022", "Interview Descriptions": "A 30 minute group task, centred around customer experience and crisis management. Followed by a 20 minute interview about views on gallery and museum experience, engagement, attention to detail. Very accessible and friendly interviewers.", "Interview Questions": "Can you tell us about a time when you’ve had to work independently? How did you keep yourself motivated?"}], [{"date": "26 Apr 2022", "title": "Director of Education Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Tate", "Interview Descriptions": "Online application requested 6x 2,500 word questions which should have really been asked in an interview. Some weren’t even worded as questions. \r\n\r\n As I saw the advert quite late I didn’t have the time it would have taken to apply and I’m sure they missed out on other great candidates. \r\n\r\nThey were not willing to have a phone call or provide an extension.", "Interview Questions": "Question example:\r\n\r\n“An in depth understanding of the contemporary challenges of embedding equality and inclusion in programming, audience and workforce.”"}, {"date": "16 May 2022", "title": "Artworker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tate (London, England) in Apr 2022", "Interview Descriptions": "A series of 10 questions, similar to the application process. Two people interviewing, the design director and a senior graphic designer. They also asked about the task we needed to complete before the interview.", "Interview Questions": "Why do you want to be an artworker at Tate?"}, {"date": "2 Jun 2022", "title": "Visitor Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Tate (London, England) in Feb 2022", "Interview Descriptions": "The interview process was divided into three steps:\r\n- a group interview in which you were asked to solve a problem in a simulation.\r\n- presentation of a topic related to your passion/history\r\n- 1 to 1 interview with two recruiters and a manager", "Interview Questions": "Why do you want this job?"}, {"date": "4 Feb 2022", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Tate (London, England) in Jan 2022", "Interview Descriptions": "not great but okay. Would not recommend for anyone having high hopes. Stay away if you are interested in development. Would rather look for better paying jobs. Too much working hours and not professional.", "Interview Questions": "Describe your interest in short words."}, {"date": "6 Nov 2021", "title": "Corporate Partnership Account Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tate (London, England) in Nov 2021", "Interview Descriptions": "Requested to make 5 slide, 10 minute long presentation prior to the interview and to deliver it as though I was speaking directly to partners instead of interview panel.  I can see the value of this, but it was quite contrived and a little off putting to deliver.  I have lots of public speaking experience and even drama and theatre experience and it threw me off totally. Very time consuming process and panel seemed a little inexperienced and unenthusiastic. The follow up questions were very vague and not specific to my experience nor the presentation.  \"What do you think of diversity\" and \"When have you been given a brief and how did you make sure you completed that brief\" - way too broad. Valid questions and I was able to answer with lots of examples but it felt a little bit lazy. If you are asking candidates to spend a minimum of 1 hour to prepare a presentation - prepare a more engaging interview process.", "Interview Questions": "How do you make sure you pay attention to detail \r\n\r\nTell us about a time you were given a brief and how did you achieve that brief\r\n\r\nWhat does diversity mean to you"}, {"date": "27 Oct 2021", "title": "Apprentice Digital Department Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tate (London, England) in Oct 2021", "Interview Descriptions": "Zoom call with 3 ladies who were really nice, before the interview they sent me a prioritisation task that I had to complete during the interview and talk through my answers after.  The task was pretty simple and you had to prioritise scenarios, and also draft an email.", "Interview Questions": "Complete prioritisation task, talk through your answers"}, {"date": "8 Nov 2021", "title": "Head of Programmes Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tate in Oct 2021", "Interview Descriptions": "HR - very friendly and informative. \nIssues with the system meant I was not informed I had an interview, however they did push back the interview date to give all candidates fair opportunity. \nPresentation required for the interview. \nInterviews were conducted via Zoom. \nRequested feedback and never received.", "Interview Questions": "N/A"}, {"date": "4 Apr 2022", "title": "Office Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tate in Aug 2021", "Interview Descriptions": "Very well organised. The team interviewing me made me feel very relaxed and the interview questions were very interesting - leading to an overall chat about the role. \r\n\r\nThe interview was with 3 people and structured well. Gave an overview of the role and how the team is structured. Led with normal administrator based questions and then asked to speak more about myself and my personal experiences.", "Interview Questions": "Why would you like to work for Tate?"}, {"date": "1 Jul 2021", "title": "Visual Merchandiser Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Tate (London, England)", "Interview Descriptions": "3 stage interview process beginning with a phone interview and progressing to a practical/ presentation. A practical element was included in the second round which we were given time to prepare and execute during the interview. For the final stage we were sent a brief before hand to prepare what we were going to present.", "Interview Questions": "A practical task involving choosing a product type and how you would train staff members to merch in-store."}, {"date": "14 Jun 2021", "title": "Visitor Experience Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tate (London, England)", "Interview Descriptions": "Role Play and Incident Management to test knowledge and steps to take in an emergency situation. There were 2 different incidence on top of the role play with further information given as the incident unfolded.", "Interview Questions": "Role Play Performance Management\r\nRespond to different incident types."}], [{"date": "18 Feb 2021", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Tate", "Interview Descriptions": "A written online application about your experience, skills and motivation. Offered a one hour interview with two managers which involved a short presentation, competency questions and two-part written task. Interviewers were friendly and helpful", "Interview Questions": "Why do you want to work for Tate"}, {"date": "26 Jul 2021", "title": "Visitor Experience Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tate (London, England) in Oct 2020", "Interview Descriptions": "Semi relaxed atmosphere and welcoming panel. Very structured in terms of a difficult appraisal role-play given 10-15 mins preparation beforehand.  Felt unconstructive, circular and confrontational from actor. Moved onto easy scenario based Qs.", "Interview Questions": "How would you respond to a bomb threat? "}, {"date": "26 Mar 2020", "title": "Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tate (London, England) in Feb 2020", "Interview Descriptions": "It was very straightforward.  I had to complete an individual task before the interview. I was interviewed by the hiring manager and another member of the team. They were both nice and friendly. Questions were mostly behavioral.", "Interview Questions": "They asked me to give examples of previous experience developing donors/clients"}, {"date": "23 Oct 2019", "title": "Sales Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Tate (London, England) in Oct 2019", "Interview Descriptions": "Very casual, however never heard back from them. I would have appreciated a callback. It was almost too casual, as it was hard to find a balance between being professional and laid back. The people who interviewed me were close colleagues and there was some joking and laughing. I can appreciate that but it's not what I had expected at this interview. They were obviously looking for the right personality.", "Interview Questions": "What would you do if you were at the till and there was a huge line and a customer asked for help?"}, {"date": "10 Jul 2019", "title": "Membership and Ticketing Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Tate (London, England) in Jun 2019", "Interview Descriptions": "The application is online, you then wait to be invited for an interview. The interviews include a 30 min task and a 30-50 min interview. My original task was to complete a mock reply to an email and to serve at the desk (tip is to look at membership and gallery map). For further interviewing (internal) you pick one of three objects from the Tate shop and then have to sell it to the managers. I know it doesn’t make sense seeing as that’s not our actual job but these are the hoops you have to jump through with Tate unfortunately.", "Interview Questions": "What would your friends say about you? "}, {"date": "1 Feb 2020", "title": "Assistant Curator, Programmes Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tate (London, England) in Apr 2019", "Interview Descriptions": "I interviewed with three members from the programming & education team. It lasted roughly 30-40 minutes with probably 10 questions, all prepared in advance. Interviewers were generous and courteous in their feedback process. Tate HR was not very helpful.", "Interview Questions": "I was asked to prepare multiple possible public programmes and then answer standard interview questions about how I've learned from failure, collaborative working style, etc. Given the Tate's size, they seem very interested in ego-free employees."}, {"date": "13 Feb 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tate (Liverpool, England) in Apr 2019", "Interview Descriptions": "Friendly staff and interesting task to complete during interview. However uncomfortably hot interview room made it difficult to focus and a very poor phone connection made one of the interview tasks near impossible to complete.", "Interview Questions": "Examples of past instances when I demonstrated attention to detail"}, {"date": "12 Apr 2019", "title": "Assistant Registrar Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tate (London, England) in Apr 2019", "Interview Descriptions": "I applied online and submitted the day of the deadline, I then received an invitation to interview the following day. The following week I had my first interview with a panel of three members of the team I'd be working for, this interview was quite rigid as there were set questions to answer. \r\nThe day after my first interview I was invited back for a second more formal interview which was a really great chance to have a discussion about the role and ask questions on both sides.\r\nThe afternoon of the second interview I was given a job offer. \r\n\r\nOverall the experience was very efficient and I didn't have to wait long to hear from the employer. The first Interview was a lot harder than the second because you are asked quite a few questions regarding specifics of the role.", "Interview Questions": "What is your experience with Insurance and Government Indemnity Scheme? \r\n\r\nWhy did you apply for the role?\r\n\r\nGive an example of when you were busy and had to prioritise your work\r\n\r\nGive an example of when you have to contact different people "}, {"date": "23 Mar 2019", "title": "Learning And Development Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tate in Mar 2019", "Interview Descriptions": "Panel interview following a very long application. Prior to the interview, I had to prepare a small task for 30 minutes. I found the task easy. Very technical questions, the interview felt more like an interrogation - it lasted approximately an hour. Both interviewers seemed obnoxious and arrogant. I wouldn't like to work with such people so I was happy that I didn't get the job.", "Interview Questions": "How would you approach a team?"}, {"date": "3 Nov 2018", "title": "Visual Merchandising Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Tate (London, England) in Sept 2018", "Interview Descriptions": "A rather long online application followed by two face to face interviews with practical tasks. Before the second interview I was provided with a brief in order to prepare for the practical task.", "Interview Questions": "What do you think the Tate are doing well in terms of their shops, and what can they improve?"}], [{"date": "25 Jun 2018", "title": "Online Customer Service Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tate in May 2018", "Interview Descriptions": "The interview was fairly straightforward. I applied online via the Tate application website and received an invitation to interview a couple of days later. This position was for a Zero Hours Contract and they needed someone to fill in the position shortly after the interview. The interviewers were welcoming. They gave potential scenarios and asked what I would do in that instance. Standard behavioral questions.", "Interview Questions": "Tell us about a time when you gave excellent customer service. "}, {"date": "21 Nov 2019", "title": "Retail Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tate (London, England) in Apr 2018", "Interview Descriptions": "Questions regarding previous retail experience.\r\nOnline questionnaire \r\nFace to face interview .\r\nApplied through the website, vacancies are usually available.\r\nMentioned that a fixed contract was preferable. \r\nBrought passport to interview, DO NOT forget to do this, otherwise it creates a bad impression.", "Interview Questions": "How would you approach customers in the gallery shop?"}, {"date": "12 Jul 2021", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Tate (Liverpool, England) in Feb 2018", "Interview Descriptions": "Great, and friendly. Was with two curators and office manager. Very relaxed and encouraging. Great. Really great. They also did a little task of reading press release for errors to ensure you can do the job", "Interview Questions": "Previous experience, a task and how you achieved difficult task"}, {"date": "20 Mar 2018", "title": "Waiter Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Tate (London, England) in Dec 2017", "Interview Descriptions": "Intensive and in depth application followed by 4 hour trial and interview. You have to dress in black for the trial. You are paid if you’re employed. You can expect the fork test. IE. Check for missing cutlery.", "Interview Questions": "Why do you want to work for Tate?"}, {"date": "7 Jul 2018", "title": "Exhibitions Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Tate (London, England) in Nov 2017", "Interview Descriptions": "Half an hour Excel task, followed by a 45 interview  with a panel of three. The questions followed a similar structure to the ones asked on the application.  I initially was not offered the role, however, I was asked to come in 2 months later for a short interview and then I was offered the role.", "Interview Questions": "Give an example of how you work well in a team?"}, {"date": "10 Oct 2017", "title": "Events Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tate", "Interview Descriptions": "2 interviews, first one included an admin based task. The initial interview was rather informal with two other people you would be working closely with in the team and the second was with more senior staff members. All were very friendly and made it as pleasant as possible.", "Interview Questions": "Why do you want to work at the Tate?"}, {"date": "3 Sept 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Tate (London, England) in Jul 2017", "Interview Descriptions": "Online application, interviewed by two managers, very casual and conversational. The interviewers were very friendly and I felt at ease immediately. Quick admin priority test at the beginning to test my time management approach.", "Interview Questions": "Tell us about a time you dealt with a difficult situation"}, {"date": "25 Feb 2017", "title": "Retail Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tate (London, England) in Dec 2016", "Interview Descriptions": "Thorough but enjoyable. There is a group interview for three hours, where prospective employees are asked to get involved in relevant tasks. They usually shortlist again and ask for a one to one interview shortly after.", "Interview Questions": "How will you cope in a fast paced environment?"}, {"date": "25 Nov 2016", "title": "Senior Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tate (London, England) in Nov 2016", "Interview Descriptions": "Efficient interview booking system. Mostly lunchtime slots. Was kept waiting for 15 minutes past the appointed time. Interview itself was conducted professionally. That said, the interviewers seemed slightly stressed and hurried.  \r\n\r\nWhen asked to describe their culture they got a bit edgy (this is always a good question to ask an prospective employer by the way – if they hesitate and feel uncomfortable responding you know immediately that there are issues). When asked whether the 1 year contract on offer was a maternity cover they responded by saying that ALL new contracts at the Tate are now 1 year fixed term, no matter what the role.", "Interview Questions": "From which designers do you get your inspiration from?"}, {"date": "5 Mar 2018", "title": "Head of IS Solutions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Tate (London, England) in Sept 2016", "Interview Descriptions": "Single interview panel of 6 from different parts of the Gallery.  Asking standard interview questions around ability and personality.\r\n\r\nLooking to see if had the ability to work with 3rd party suppliers as well as other business arms in a proactive integrated process.", "Interview Questions": "General Senior IT role questions"}], [{"date": "22 Jul 2019", "title": "Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tate (London, England) in Jun 2016", "Interview Descriptions": "I visited the Tate for interview, I was met by a member of the team who took me to the department's break room where I took an excel exam which I was told about ahead of time. I was also asked to complete a prioritization exercise, both these tests were given a time limit- I think 30 minutes. Afterwards the Head of Dept and staff who had previously been in the position interviewed me. Competency based questions, they made notes whilst I talked, wanted examples of what I had done and experience, no feedback or engagement simply question answer question answer, very formal.", "Interview Questions": "Why do you want to work at the Tate?"}, {"date": "8 Aug 2017", "title": "Retail Sales Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tate (London, England) in Jun 2016", "Interview Descriptions": "- Online Application\r\n- One on One Interview\r\n\r\nI applied for the role of Retail Assistant. I got rejected and then I received a phone call from Tate HR. They offered me another role which was better than the role I applied for.", "Interview Questions": "Why do you want to work at the Tate?"}, {"date": "5 Jun 2016", "title": "Retail Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Tate (London, England) in May 2016", "Interview Descriptions": "A very lengthy online application and if successful, a one on one interview. Then either a decline or an offer. In this case, I was firstly declined and then they verbally offered me another vacancy which was better suited for my skills. Always ask for feedback, if offered. I think that showed I was more than interested in the vacancy.", "Interview Questions": "Why the Tate? What can you tell me about your experiences ... give examples!!!!"}, {"date": "27 Feb 2019", "title": "Exhibitions Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Tate (London, England) in Mar 2016", "Interview Descriptions": "Very thorough, but the interviewers were pleasant and seemed to take a genuine interest in my work and history. I was aware that applications for this type of position are very competitive so I wasn't expecting a job offer, but it was a good experience.", "Interview Questions": "What within your prior experience could you bring to the table at Tate to make a difference?"}, {"date": "24 Mar 2017", "title": "Development Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Tate (London, England) in Oct 2014", "Interview Descriptions": "One interview, nice enough people and straigtforward. Interviews were from department and not HR, so had idea what they were doing, seemed abit nervous, despite me being junior. Took forever to give me the job, makes me wonder which runner up I was?", "Interview Questions": "Something about passion, what I hope to learn. Junior role, no complexity"}]]