[[{"date": "6 Apr 2023", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "I met with the nurse manager before a 4 hour unit share day. I also participated in a “group interview” with 4 other nurses on the unit after my share day. I was able to ask questions in a less formal environment .", "Interview Questions": "How would your previous co-workers describe you?"}, {"date": "11 Dec 2022", "title": "Student Nurse Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "Share Time - estimated 3 hours introduction to the floor and the climate of the team along with an interview with the nurse manager. Depending on the floor, wear professional/interview clothing but comfy shoes. You will shadow several nurses and the different roles each nurse may have on the team. If there are other interdisciplinary staff, you will learn their general role in patient care on the floor.", "Interview Questions": "Why did you choose this floor to conduct your practicum? Do you have any prior experience for this particular floor? Is your intention to return to this floor after graduating nursing school?"}, {"date": "26 Oct 2022", "title": "Registered Nurse Case Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "Phone call interview with Human Resources and then a in person with the case manager director and then another interview with a panel of case managers. Once completed, they discussed benefits and compensation", "Interview Questions": "Describe what skills make you qualified for this job with no case manager experience"}, {"date": "28 Jun 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "Pleasant and got an offer at the end of the interview. The interview was with the nurse manager of the unit and she was very polite and professional. She emphasized the unit's structure of teamwork.", "Interview Questions": "How do I deal with stress?"}, {"date": "28 May 2022", "title": "Environmental Care Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "Interview was over the phone, lasted a little over 20 minutes. Was offered the position right on the spot. It wasn’t many questions, regular about you questions and a few prior job related questions.", "Interview Questions": "Describe a time where you went above and beyond your job description. "}, {"date": "11 Mar 2022", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "The PI is nice.  The interview is comfortable and I enjoyed the whole conversation.  We talk about my previous projects and experience, and the projects in the PI's lab as well. \r\nThe PI made a decision quickly.", "Interview Questions": "ask my previous experience and projects"}, {"date": "19 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Mar 2022", "Interview Descriptions": "The interview process was good but pretty short. I felt like I didn’t have enough time to fully convey my thoughts. However, the general environment and atmosphere were chill and welcoming", "Interview Questions": "Why did you choose ED over other units?"}, {"date": "7 Jun 2023", "title": "RN II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Feb 2022", "Interview Descriptions": "Easy and quick. I was interviewed back in Feb 2022 via video call in L&D unit. I was interviewed first by a hiring manager then forwarded to Nurse Manager. Questions were straight forward and mostly about related experience. Job offered on the spot.", "Interview Questions": "Most recent experience. Educational background."}, {"date": "10 Dec 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "The surgical faculty talked to me on zoom for an interview and asked about my previous research experience. Most of the questions he had were coming from my CV. It is a research job working in basic science but you don't really need to have certain lab technique skill. MD degree is proffered.", "Interview Questions": "Tell me about your past research experience"}, {"date": "28 Oct 2021", "title": "Graduate Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "there is Multiple steps, take awhile to hear back from them.  I’d say it was about 2 months till finalize everything. It’s an ok job, if you don’t pass nclex, they really have no options. Better to start after taking it", "Interview Questions": "how to work in the environment , previous experience, "}], [{"date": "17 Sept 2021", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "The interview took place during the pandemic so this may not continue in the future. It was a zoom interview with multiple physicians and the head of department. I met with them each individually.", "Interview Questions": "Q: A little about myself (what I like to do)\nQ: Where do I see myself in 5 years? \nQ: Why Hopkins, and this department? "}, {"date": "21 Aug 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Sept 2021", "Interview Descriptions": "It was a pretty basic review of the resume. It also included discussion on availability and compatibility with working and doing school at the same time.  That's really about it.", "Interview Questions": "How many hours are you willing to work?"}, {"date": "5 Aug 2021", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 months. I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "Very technical focused, while also focusing on personal growth, and ability to adapt to new technologies. It was in a group setting, and consisted of multiple interviews with many different engineers and managers from different teams.", "Interview Questions": "Describe what you would do in a situation where you didn't know the answer to a question. "}, {"date": "18 Aug 2021", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Aug 2021", "Interview Descriptions": "Applied online, asked to complete an assessment about how I would handle situations and coworkers (partly a personality assessment), called for an interview. Interview was near the end of day on a Thursday.", "Interview Questions": "Tell me about yourself \r\nWhat was your practicum like? Tell me about a stressful time in your life? Tell me about a difficult patient."}, {"date": "28 May 2021", "title": "New Grad Nurse Residency Program Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "I had a virtual 30 minute interview with them. I joined via zoom and then was placed in an interview with two people. I started off by telling them about myself and then they asked questions.", "Interview Questions": "What is one thing that your friends would say they don't like about you?"}, {"date": "17 Feb 2022", "title": "Occupational Therapy Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at The Johns Hopkins Hospital (Providence, RI) in Mar 2021", "Interview Descriptions": "Awesome!! Everyone was very welcoming and created a homey environment to talk and converse with each other about job openings! Would definitely highly recommend and have only good things to say about this place!", "Interview Questions": "Why do you want to work as an OT? "}, {"date": "7 Mar 2021", "title": "Undergraduate Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Jan 2021", "Interview Descriptions": "Interview was conducted through online teleconferencing program. It was proceeded for approximately 30 minutes, and the interviewer asked several questions about my qualifications and required skillsets, along with examples to support them.", "Interview Questions": "Are you good with time management? If yes, provide an example that illustrates this."}, {"date": "9 Dec 2020", "title": "Material Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "Multiple interactions with HR. Very prompt and helpful. Interested in my qualifications, interests and work history. The process went very smoothly. From start to finish it only took a few weeks.", "Interview Questions": "What could I offer to the company"}, {"date": "23 Aug 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "HR contacts you first to schedule your interview and then the unit manager will reach out. You have to send all your paperwork and certificates before you interview. On the day of you go to HR and then the unit, tour the unit, interview with the managers and then go back to HR for benefits talk.", "Interview Questions": "What are your 5 year goals?"}, {"date": "14 Dec 2020", "title": "CCSR - Clinical Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital in Aug 2020", "Interview Descriptions": "It was great. Very quick. Not a lot of boring question but more straight to the point of how you would react in certain scenarios. Verifies things seen on your resume to ensure accuracy and also ask questions about your back ground.", "Interview Questions": "What are some of your strengths?"}], [{"date": "23 Jul 2020", "title": "Applications Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "Phone interview done with the hiring manager directly. The hiring manager explained the roles and responsibilities of the position I was applying for and made sure I had no further questions or concerns regarding the job. Some clarifying questions were asked to understand my background and my experience to determine my qualification for the position. There is an assessment (exam) that is required and your passing will finalize whether or not you get a chance to have a face-to-face interview.", "Interview Questions": "It was a casual interview, asking about my background and my former work experiences that may provide credibility to the job position that I applied for. Definitely asked about my experience with EPIC."}, {"date": "8 Mar 2021", "title": "Student Nurse Extern Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in May 2020", "Interview Descriptions": "Interviewed with Nurse Manager, she asked a series of questions like how did I go above and beyond in my previous jobs, what do I do for self-care, do I live in the area or am I just here for school.", "Interview Questions": "Explain a situation that you could have handled better than you did."}, {"date": "23 Mar 2020", "title": "Lab Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "Long time. Face to face. The job description is the most important. you should know what have you done. Match your skill set to the job description and do not expect a salary", "Interview Questions": "How to control multiple tasks?"}, {"date": "10 May 2020", "title": "SLP Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at The Johns Hopkins Hospital (Fairfax, VA) in Feb 2020", "Interview Descriptions": "Called in for in person after 2 phone interviews followed by a panel. Was told I was one of top 3 choices and then was ghosted with absolutely no response to emails.\nCalled for an in-person interview a year later for a new opening. Interviewer “forgot” about me until she “read my file 5 mins prior to my arrival”. Told me she would love to have me and will get back to me before the end of the day. Surprise surprise - no call back/response to emails. I have never been treated so unprofessionally in my entire life. Extremely disappointed.", "Interview Questions": "Why are you a good fit?"}, {"date": "15 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Jan 2020", "Interview Descriptions": "The interview was long - met with the nurse manager and got a description of the unit/job, hours, benefits, etc. Went through typical interview questions then shadowed a nurse on the unit for about an hour. Also met with HR for standard paperwork", "Interview Questions": "No clinical scenario questions were asked - just general \"what's your experience\" type of questions"}, {"date": "4 Dec 2019", "title": "Lab Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Dec 2019", "Interview Descriptions": "I spoke on the phone with HR for twenty minutes answering basic questions about my qualifications. When compensation was discussed, they would not go above $15/hr despite my prior six years of related experience. I did not continue with the interview after that.", "Interview Questions": "Why are you a good fit for this position?"}, {"date": "31 Oct 2019", "title": "PSC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD)", "Interview Descriptions": "The process was very warm and welcoming. Interviews with the nurse manager of the unit and she asked about 7 questions. Be very confident and engaging. Take time to think before answering as well.", "Interview Questions": "Tell me about a time you offered great customer service."}, {"date": "16 Sept 2019", "title": "Applications Coordinator Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Sept 2019", "Interview Descriptions": "The interview process has, so far, consisted of a 30-minute phone interview where the HR representative worked to familiarize me with the position and answer any questions. The next step was to schedule a Friday (10am-12) where I could take the EPIC aptitude test.", "Interview Questions": "Q: What things do you already know about the EPIC system?"}, {"date": "30 May 2019", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital (Baltimore, MD)", "Interview Descriptions": "In person interview with a panel of techs and pharmacist and phone interview with HR. Tour of the place where I would be working every one was friendly. Nice environment everyone mad you feel comfortable they answer all questions and explained the job.", "Interview Questions": "Why do you want to work for us?"}, {"date": "24 Apr 2019", "title": "Clinical Fellow - Speech Language Pathologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Apr 2019", "Interview Descriptions": "Interview took an entire day, and it was overall a pleasant experience. The staff was kind and welcoming. Interview questions were tough, but the staff made you feel comfortable. It was a great experience to visit the hospital.", "Interview Questions": "Tell me a time when you showed initiative. "}], [{"date": "22 Jan 2021", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital in Jan 2019", "Interview Descriptions": "it was easy and laidback and chill. they asked me creative qestuions like what kind of aniimal would you be. i said lion because i want to be powerful and strong in the kingdom.", "Interview Questions": "what kind of animal would you be."}, {"date": "16 Oct 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "I had to call HR several timesbefore the interview was scheduled. I eventually met with the Nurse Manager and several other nurses, then did four hours of shadowing before being told by phone several days later that I received an offer.", "Interview Questions": "N/A"}, {"date": "26 Aug 2018", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "There are forty Preset questions. Most are redundant. Interview came after the third month of my initial application.  The interviewer initially forgot about my appointment and I was asked to come back.", "Interview Questions": "What is your best quality "}, {"date": "7 May 2018", "title": "RN Emergency Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital (Baltimore, MD)", "Interview Descriptions": "Months of chasing recruiter. Pre-screen, then told I would interview, but recruiter wasn't returning any messages for a couple of months. Had to chase again to find out what was going on, profile was left open. Contacted another branch of JH hospital. Was finally put through. Had an in-person interview, they were not prepared and didn't seem to know any of my experience, despite having done a phone interview with the manager. Had to wait for clinical specialist to show, interrupted several times. Did 2 hour shadow. Sent further information and certifications to HR to show both enthusiasm and qualifications and waited weeks, they would not respond to enquiries. Received rejection, politely requested information on deciding factor, HR refused to respond, but told me I would not be considered for any positions anywhere in the hospital? What? Oh, Wow.  Extremely poor experience. Just very rude and unprofessional. Waste of time and money pursuing this.", "Interview Questions": "Tell me about your med-surg experience."}, {"date": "25 Aug 2022", "title": "Clinical Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Mar 2018", "Interview Descriptions": "The interview panel was the most difficult part of the interview so be prepared to answer a broad range of questions related to your abilities. Interviewed for half the day, ate lunch with the staff I would eventually work with met in a panel interview setting", "Interview Questions": "Would you be able to handle the patient load"}, {"date": "13 Dec 2018", "title": "Crnp Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Jan 2018", "Interview Descriptions": "Was hired by a Contractor, there were two telephone interview and one in person, not hard, just typical questions. I was moving from Texas so they were quite helpful I guiding me thru the process.", "Interview Questions": "Why do I want to join them"}, {"date": "18 Jun 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Dec 2017", "Interview Descriptions": "I had a quick interview with one of the postdoctoral fellows in a laboratory. She asked me about what my future plans are, and why I am interested in the topic that she is studying.", "Interview Questions": "What are your future plans?"}, {"date": "3 Nov 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Nov 2017", "Interview Descriptions": "I’ve had three interviews at this hospital and was offered all 3 positions. The questions were very tough, probably some of the most difficult interview questions I’ve gotten in any hospital I’ve interviewed for. Overall, I understand because they’re very picky with who they hire and I think it was an amazing experience.", "Interview Questions": "What impact can you make to this unit that could possibly cause a positive influence on the patients?"}, {"date": "24 Oct 2017", "title": "Legal Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Oct 2017", "Interview Descriptions": "The interview process with Hopkins was extremely enjoyable for me! I applied online, received an e-mail about 2 weeks later saying they wanted to do a phone interview. I did a phone interview with the Office Manager, and then within the week I came in and I met with the three attorneys I would be working with. The interview process was very relaxed, and took about an hour. I received e-mails from Human Resources that same day, and received my offer within the week!", "Interview Questions": "What experience do you have with networking?"}, {"date": "9 May 2017", "title": "Clinical Dietitian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "You will meet with the manager to discuss one on one. There is also a peer interview, where current registered dietitian nutritionists ask you a series of questions. You will also be able to go on a tour of the hospital. There is also a short case study assignment to complete.", "Interview Questions": "How do you play to your strengths and compensate for your weaknesses?"}], [{"date": "21 Aug 2017", "title": "Clinical Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in May 2017", "Interview Descriptions": "The interview process was ok. I arrived an hour early... nurse manager was in her office doing nothing but still made me wait the hour. Human resources prior knew I was coming from NYC and didn't alert me they pushed back the start date. The interview was with the CCSC and Nurse Manager and they hired me on spot.", "Interview Questions": "What is your prior experiences? "}, {"date": "6 Apr 2017", "title": "Patient Assess Specialist II Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD)", "Interview Descriptions": "filled out the application. Received a call from a recruiter a month later. Had an over the phone interview with the recruiter. Followed by an in person interview with the hiring manager. Waiting to get answer on weather or not I am chosen for the position....", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 May 2017", "title": "Certified Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Apr 2017", "Interview Descriptions": "I was emailed by HR to come to the hospital to interview. It took about 3 hours and I interviewed with 7 different people; HR, technicians, supervisors, and the director. Everyone was very nice and explained information about the hospital and the role. The position was filled internally.", "Interview Questions": "What is a situation in which you had to deal with a difficult customer? How did you resolve it?"}, {"date": "5 Mar 2017", "title": "Clinical Dietitian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "Had an in person interview with CNM, than met staff.  Asked typical clinical and behavior questions.  After initial interview I heard nothing for 3 months.  HR called me one day and stated \"you start Monday.\"  This was on a Friday; I informed them I needed to give 2 weeks.  Six weeks later I started.  Be aware Hopkins pays much less than other hospitals and your ability to negotiate up is limited.", "Interview Questions": "Why should we choose you for this position."}, {"date": "15 Apr 2017", "title": "Senior Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Nov 2016", "Interview Descriptions": "Direct interview discussing background info, previous roles, experience, responsibilities, project management, program management, direct reports, strategy, consulting, work life balance, technical skills, inter personal relationships, future goals and ambitions, education, likes and dislikes, cultural work environment, diversity and inclusion, core values.\r\nFirst interview was phone screening then in person interview with hiring manager. Then, another in person interview with director. Followed by another in person interview with Sr. Director.", "Interview Questions": "Please discuss your project management background"}, {"date": "20 May 2016", "title": "Pediatric Pharmacy Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD)", "Interview Descriptions": "The interview was long and boring. Too many questions that didn't explain how complicated the position was. Everyone looked very angry. They basically lie to get you here. Orientation was pointless and long", "Interview Questions": "Why do you want to work here"}, {"date": "4 May 2016", "title": "Post Doctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD)", "Interview Descriptions": "I contacted the PI first. Tried to introduce myself and my projects in the email very clearly. He then asked for reference letters. We then talked on the phone and scheduled an on-site one day interview. I gave a seminar about my thesis projects to the department, then met and talked with the faculty group of the department. I got hired right away.", "Interview Questions": "What's your plan in 3 years?"}, {"date": "27 May 2016", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 6 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in May 2016", "Interview Descriptions": "I took a assessment test and then I had an face to face interview today. The interview was pleasant and i feel like I did a good job. I was told it takes a bout 2 weeks before I would here back from them if I got the job.", "Interview Questions": "What set me apart from the other candidates."}, {"date": "2 Jan 2017", "title": "Clinical Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Apr 2016", "Interview Descriptions": "They first ask to take a test to show your ability of working MS office. Once you pass that computer skills testing, they will call you in for an interview.", "Interview Questions": "N/A"}, {"date": "6 Sept 2016", "title": "Web Content Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Apr 2016", "Interview Descriptions": "First I had a phone interview with the person who would be my supervisor. Then I had an in-person interview with the supervisor and other team members. They call these \"360 interviews\" and the plan was for me to meet 6 people total.\r\nThere was a lot of disorganization. I told them what days would work for me, and I got phone calls suggesting different days that I had already said I could not do. I eventually had to re-work my schedule to accommodate their request. Then when I showed up at the set time, the most important person for me to meet (the supervisor) was out sick, so I had to come back the next day. Another person that I was supposed to meet with never showed up. In the end, I never received an email or phone call to thank me for my time, or even an automatic email telling me the position was filled.", "Interview Questions": "How do you feel about being part of a team?"}], [{"date": "31 Aug 2015", "title": "Nurse Clinician I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital (Baltimore, MD)", "Interview Descriptions": "First went to nurse recruitment. They explained the process and made sure I had all the paperwork needed. Was taken to the unit manager who conducted the interview with a nurse on the unit. They were very friendly. Started with introductions, moved on to asking me questions, then answering any questions I had. After this I changed into scrubs that I brought and had \"share time\" (shadowing) a nurse on the unit, then met with the manager again to say goodbye and tie things up.  Offered a job about a week later.", "Interview Questions": "Why would you like to work at Hopkins?"}, {"date": "1 Jun 2016", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at The Johns Hopkins Hospital in Sept 2015", "Interview Descriptions": "After I applied online, I was able to get an interview within 3-5 days. I had an interview on site, they called me about an hour later to let me know I got the job. Then, I received a call from Human Resource to get additional information on training.", "Interview Questions": "What can you contribute to our practice?"}, {"date": "13 Aug 2017", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Sept 2015", "Interview Descriptions": "It was more of real life scenario questions. They want to know how you would handle employees that refuse to follow instructions. Oh, did I mention that you would also be asked how if you're comfortable firing employees? Lol. Yes, they sure do.", "Interview Questions": "How comfortable to terminate employees that are insubordinate?"}, {"date": "2 Oct 2015", "title": "Patient Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Sept 2015", "Interview Descriptions": "Easy interview. Usual questions. Job required two in person interviews as well as a skills test on the computer. The interviews were with multiple people including the director of the department. Overall, the interview process was enjoyable.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "19 Aug 2015", "title": "Patient Access Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "Friend referred to a recruiter. Recruiter reached out to me and set up a time for a phone. Fairly laid back phone call where recruiter described the position and asked if it was something you would be interested in. Came in for a Face to face interview with recruiter. Next day had Interview with Director of Call Center, and Interview with Departmental Manger. Got an offer the same day.", "Interview Questions": "Why do you think you will be a good fit for the job?"}, {"date": "31 Jan 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Aug 2015", "Interview Descriptions": "Since this was my first career out of college, the interview was not very skill-based.  It was more a personality interview and figuring out how I would get along with the team. They are very interested in hiring people who are going to stay at Hopkins because retention has been a little bit of an issue for the nurses here.", "Interview Questions": "They asked me (being from Boston) what made me come to JHH and who is to say I wouldnt leave after a few months and go back to my family? What would make me stay at JHH?"}, {"date": "26 Apr 2016", "title": "Clinical Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Apr 2015", "Interview Descriptions": "The interview process, was very thorough; I felt like I got a clear idea of what was excepted and what duties I would be preforming on a daily basis. The interview process overall was a good one.", "Interview Questions": "How would you handle a combative patient?"}, {"date": "7 May 2017", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital in Mar 2015", "Interview Descriptions": "Group interview with all lead techs in specific lab followed by brief tour of facilities and analyzers. Questions were pre-written and read from a list- mainly situational questions. Overall very welcoming.", "Interview Questions": "In your previous job describe the steps you would take with QC problems or a broken analyzer and how you worked with coworkers to solve the problem."}, {"date": "10 Mar 2015", "title": "Emergency Department Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Mar 2015", "Interview Descriptions": "The process takes long I started applying for jobs since may 2014 I didn't hear back until sep 2014 to take a computer test thts easy people who pass get an interview my friend who got a job there gave me a number to call the person answered and told me I passes I kept applying to more jobs and finally heard back last month had an interview last week n got a phone call today but for a part time postion", "Interview Questions": "If I asked your manager wht kind of person u r wht would they tell me"}, {"date": "27 Mar 2015", "title": "Career Coach Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Feb 2015", "Interview Descriptions": "Horrible and unprofessional.  My appointment was set for 12pm, the Interviewer wasn't ready to speak with me until 40 mins later.  She couldn't find the other panel member so I waited an additional 10 mins.  They never responded to my follow up.  Not rejection or approval ever received.", "Interview Questions": "What have you been doing during the last year?"}], [{"date": "16 Apr 2015", "title": "Medical Office Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at The Johns Hopkins Hospital (Lutherville, MD) in Feb 2015", "Interview Descriptions": "I applied online for a Medical Office Assistant position at one of the Hopkins Community Physicians locations. I was called a few days after my application was submitted and scheduled for an in-person interview the following week. I had a positive experience with the interview - got a chance to meet all of the employees and had a tour of the office. However, I was told I would expect to hear back from them by the end of the week or by the following week and never did until I had to contact multiple times. I followed up with the Practice Administrator three times but was told they were still in the interview process over a month after my interview and to wait to hear back.", "Interview Questions": "Describe a time you broke a rule at work and why?"}, {"date": "29 Jan 2015", "title": "Psych Tech Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2+ months. I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "I was contacted by the recruiter. I met with the recruiter, then the manager, then had a 2 hour long shadow. The interview took 4 hours but was a great opportunity. After the interview I emailed and called for weeks. They would answer my emails promptly but kept me strung along for 5 weeks until after 38 days they finally let me know they discontinued the search.", "Interview Questions": "Previous work experience"}, {"date": "5 Aug 2017", "title": "CCSR Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at The Johns Hopkins Hospital in Jan 2015", "Interview Descriptions": "I had to call and speak with someone from HR to get an interview. I was finally called in for an interview they told me about the position and asked a few questions in reference to my character and resume.", "Interview Questions": "Typical character questions"}, {"date": "22 Mar 2018", "title": "Ambulatory Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Jan 2015", "Interview Descriptions": "I had interviewed for another position and after the interview I was offered my current position. The job was basically given to me because of the difficulty of the position. The hiring team thought that my military background would bring order to a chaotic department.", "Interview Questions": "What positive changes can I bring to the department?"}, {"date": "21 Nov 2014", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "Applied online, received call for face to face interview within a week. Interview with program coordinator and principal investigator. Simple interview questions. Was told would hear back within a week, never heard anything", "Interview Questions": "where do you see yourself in 5 years"}, {"date": "24 Apr 2014", "title": "Clinical Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "HIring process is fairly simple. There is a minimum of two interviews- one with human resources and second with a nurse manager. Interviews are scheduled upon the passing of a comprehensive microsoft office competency test. The turn around time for an interview is usually quick based on the needs of the unit.", "Interview Questions": "There were no difficult questions. "}, {"date": "1 Feb 2014", "title": "Clinical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "Met with the HR department, who gave an overview of the institution.  Took me to the department where the interview was to take place, and introduced me to the supervisor.  Had a tour of the work area, met the staff, and was given the opportunity to ask as many questions as I had.  Never felt intimidated or pressured.", "Interview Questions": "A very typical interview.  Nothing out of the ordinary was asked, from what I recall."}, {"date": "18 Jun 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Feb 2014", "Interview Descriptions": "It was an online application to fill out first. The supervisor for the role called me later that week and we spoke briefly on the phone about my resume. She then invited me in for an in-person interview. It lasted no more than 30 minutes  where it was a little evident I had the job as she showed me around the office and introduced me to everyone.", "Interview Questions": "What would you say your greatest strength is as it pertains to this job?"}, {"date": "15 Aug 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Johns Hopkins Hospital in Jan 2014", "Interview Descriptions": "I saw a posting online for a RA position at Wilmer Eye Institute and applied for it. The senior clinical research coordinator called me and asked me to come in for an interview. Finding the office was horrific though! The interview was very casual, basically asked about my previous research experiences, future goals, why I want this job. Then she gave me information about the study. I was hired on the spot.", "Interview Questions": "How long can you commit to our study?"}, {"date": "29 Nov 2013", "title": "Faculty Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at The Johns Hopkins Hospital (Baltimore, MD)", "Interview Descriptions": "Submit an official application which is then formally reviewed and then you are notified for an interview.  Ther was a follow up interview and then the selection was made.  This was the process for an internship position, which then eventually lead to a full time job offer.", "Interview Questions": "Do you feel your resume places you in the top few percent of the qualified applicants, and why?"}], [{"date": "1 Mar 2017", "title": "Legal Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Nov 2013", "Interview Descriptions": "It was a long process, and to take an online assessment which was over 1 hour.  Interviewed with 4 non-attorneys and 4 attorneys.  They took me into a room and I spoke with each attorney separately, then spoke with the legal secretaries as a group.  I was able to ask any questions, and everyone was very helpful.", "Interview Questions": "Are you committed to working here."}, {"date": "5 Oct 2015", "title": "Clinical Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Oct 2013", "Interview Descriptions": "First you have an interview with HR. This is a pretty straight forward interview. Why do you want the job? ect. After this interview you are available to apply to CCSR positions for any unit in the hospital.\r\n\r\nDepending on the unit you decide to apply to, the interview process varies. Most of which include shadowing a current CCSR (who WILL report back to the hiring Nurse/Manager), and a interview with the nurse manager, hiring person. SO ALWAYS BE ON YOU BEST BEHAVIOR.", "Interview Questions": "Tell me about a when you have to use teamwork to overcome a problem."}, {"date": "24 Mar 2017", "title": "Clinical Customer Service Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Oct 2013", "Interview Descriptions": "Behavioral interview with the Customer Service Coordinator point followed by a panel behavioral interview with a specific clinical unit (PICU, NICU, etc).  The customer service point evaluated my fit for the position and my fit for a clinical area.  She then recommended me to a clinical area.  That \"floor\" conducted a panel interview consisting of the assistance nurse manager, and other staff.", "Interview Questions": "Past experiences going above and beyond to identify and meet customer needs."}, {"date": "5 Sept 2013", "title": "Clinical Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Johns Hopkins Hospital in Jul 2013", "Interview Descriptions": "Completed word 2010 test, math ,English, grammar, comprehension etc. Then I was scheduled for an interview that went well. The interviewer was very pleasant and made me feel comfortable.", "Interview Questions": "Most were situational questions. What would you do if you were doing something for your supervisor and then a patient called asking for something."}, {"date": "13 Jun 2013", "title": "Research Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "Applied online at the Johns Hopkins Website and received an e-mail inviting me for an in-person interview. Interviewed with the lab manager, then with the PI.", "Interview Questions": "Describe your research and how would you fit into this Lab. Do you have experience with FACS?"}, {"date": "9 Aug 2015", "title": "Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at The Johns Hopkins Hospital in May 2013", "Interview Descriptions": "The interview will go on for a whole day. You will meet management at every level that you'll be reporting to directly or indirectly. A tour of the facility is included as well.", "Interview Questions": "How would you handle the \"people problem\"?"}, {"date": "16 Apr 2013", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Johns Hopkins Hospital", "Interview Descriptions": "phone screen, panel interview, one on one interview", "Interview Questions": "average"}, {"date": "29 Mar 2014", "title": "Systems Engineer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Mar 2013", "Interview Descriptions": "Fairly straightforward.  The entire process took much longer than expected.  From submission of application to time of hire took close to two months.  There was a good bit of time between the first and second interviews.  The second interview was a group interview and some of the participants seemed a bit unprepared.  None of the interview questions were difficult or required extended thought.  After job offer was made and accepted, another 2-3 weeks passed before orientation and first day of work.", "Interview Questions": "None"}, {"date": "12 Dec 2012", "title": "Staff Pharmacist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at The Johns Hopkins Hospital (Baltimore, MD)", "Interview Descriptions": "Easy to be picked up for a position after doing a clinical rotation for during school studies. Interview process has 3 steps, phone interview, preliminary interview, then full day interview with various managers, clinicians, and staff.", "Interview Questions": "Have you Arrived?"}, {"date": "10 Jul 2015", "title": "Publications Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Aug 2012", "Interview Descriptions": "cover letter, brief in person interview, job was offered immediately after the interview. asked about background, training and future career goals. i applied through the university's student employment services. i was emailed to schedule an in person interview with the PI when I got to Baltimore. The process was relatively simple and painless.", "Interview Questions": "how do you see this job contributing to your future aspirations?"}], [{"date": "6 Apr 2016", "title": "Ccsc Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in May 2012", "Interview Descriptions": "Once you have completed the application, you will be instructed to complete an online assessment.  This is a personality assessment that analyzes various things about the candidate as they relate to the position. If you meet requirements and have the experience, you will be called by HR to come in for written assessments and an interview. During these assessments you will be quizzed on computer applications and interviewed by an HR specialist. The next step is to interview with the Program Manager to see if you are a good fit for the program. If you successfully interview with the manager, you will be sent to various nurse managers of the hiring units to interview and meet the staff.  A behavioral interview is conducted.", "Interview Questions": "tell me about a time when..."}, {"date": "26 Nov 2011", "title": "Administrative Fellow Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Oct 2011", "Interview Descriptions": "It was mostly like all other phone interviews (first round). I interviewed two people separately and they asked the same questions so I was more ready and relax the second day. They talked about the position first and then asked routine behavioral questions.", "Interview Questions": "Describe a situation you used your analytical skills. "}, {"date": "12 Apr 2012", "title": "Respiratory Care Practitioner I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 6 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Sept 2011", "Interview Descriptions": "The interview process was very casual, even if it did take quite a bit to complete. The questions asked were pretty normal for any interview, evaluating how you would work with other people, how you started in this career, and questions about your schooling.", "Interview Questions": "None were difficult or unexpected."}, {"date": "30 Jan 2015", "title": "Clinical Customer Service Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Apr 2011", "Interview Descriptions": "Longest (3 hours) and most difficult interview I'd ever been on. Asked very, very, detailed questions about customer service interactions. Interviewer didn't make eye contact, which made it even more difficult to gauge how the interview was going.", "Interview Questions": "Describe a time when you and your supervisor disagreed on a process that would ultimately benefit a customer. "}, {"date": "13 Jul 2011", "title": "Radiology - MRI Program Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Dec 2010", "Interview Descriptions": "I was a student in The Johns Hopkins Hospital's Schools of Radiography and was on route to graduate the program and pass my boards as a radiographer. In order to do MRI you need to first be a radiographer. Being in the Hopkins' radiography program we were given the opportunity to apply to the CT program or MRI program. I chose MRI because thats what I was interested in. They asked me questions about what I knew about MRI. They asked me questions about my strengths, weaknesses, why they should pick me, and they also asked about if I had any previous experience in MRI. In order to be considered for an interview, you need to pay a application fee, apply, write an essay, and do a shadow day at the hospital in the MRI department.", "Interview Questions": "What do you know about MRI?"}, {"date": "15 Dec 2012", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Mar 2010", "Interview Descriptions": "It was very relaxed.", "Interview Questions": "N/A"}, {"date": "30 Apr 2010", "title": "Materials Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Dec 2009", "Interview Descriptions": "I interviewed with my current boss and her boss.  \r\n\r\nBoth interviews were casual.  My current boss asked me a lot of questions about managing people.  She asked me what i would do in situations where you have difficult employees.  I later found out why, i would be managing difficult people.\r\n\r\nMy boss's boss was more concerned with my accomplishments at my other job and it was more of a discussion about how I could improve their process as I had in my previous job.  Very casual, jokes told at both interviews.", "Interview Questions": "How would you motivate a staff that is actively disengaged, when you have never done it before?"}, {"date": "21 Apr 2010", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at The Johns Hopkins Hospital (Baltimore, MD) in Jul 2009", "Interview Descriptions": "They were very fast to respond after the interview. Great experience. Friendly. Questions were written ahead of time.", "Interview Questions": "The hardest client you have had to deal with and what you did"}]]