[[{"date": "22 Feb 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Temasek Polytechnic", "Interview Descriptions": "I recently had the pleasure of interviewing with them, and I must say it was a thoroughly enjoyable experience. From start to finish, the interview was conducted professionally and efficiently, with plenty of opportunities for us to get to know each other better. The interviewer was very welcoming and made me feel comfortable from the beginning. They took the time to introduce themselves, and provided a brief overview of the company, the position, and the responsibilities involved. They also allowed me to introduce myself and ask any questions I had. During the interview, I was impressed by how well-prepared the interviewer was. They asked thoughtful and relevant questions that allowed me to showcase my skills and experience. They also gave me a chance to elaborate on my responses and ask follow-up questions. Throughout the interview, I appreciated the way the interviewer actively listened to my responses and provided valuable feedback. It was clear that they were genuinely interested in my experience and my fit for the position. Overall, I would highly recommend them as an employer and would be thrilled to work for such a supportive and professional team. I am grateful for the opportunity to interview with [company name], and I look forward to hearing back from them.", "Interview Questions": "tell me a situation where you demonstrated critical thinking"}, {"date": "21 Jun 2023", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Temasek Polytechnic (Singapore) in Aug 2022", "Interview Descriptions": "Non threatening. I get the impression that besides the hiring school other panellists were there to ensure fairness and completeness in the collective evaluation. The questions were not on a single domain. I appreciated that much info were shared about HR matters.", "Interview Questions": "Describe a happy day for you?"}, {"date": "18 May 2022", "title": "Management Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Temasek Polytechnic", "Interview Descriptions": "Only one interviewer and she is friendly. The interview process is pretty smooth and takes about half an hour duration. Just do your homework by preparing for the interview and you’ll be fine.", "Interview Questions": "Why do you apply for the job? What are you currently doing or working as? Do you have any experience in the education industry?"}, {"date": "7 Mar 2022", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Temasek Polytechnic", "Interview Descriptions": "Fairly good, the whole process took less than a month. The interviewers were nice, some technical questions so i recommend coming prepared. Overall, a good interview in my opinion. Was not as hard as other companies i had interviewed for", "Interview Questions": "Could you elaborate on your past experiences?"}, {"date": "12 Jan 2022", "title": "Lecturer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Temasek Polytechnic (Singapore) in Jan 2022", "Interview Descriptions": "Very smooth and efficient. Conducted over MS Meeting due to covid situation. Not very formal. more like a chat over coffee session. Need to present a slide talking about your life story.", "Interview Questions": "What subjects can you teach?"}, {"date": "16 Dec 2021", "title": "Lecturer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Temasek Polytechnic", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire", "Interview Questions": "ask about past working experience"}, {"date": "15 Dec 2021", "title": "Deputy Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Temasek Polytechnic in Nov 2021", "Interview Descriptions": "I applied for Deputy Manager position in Careers@Gov portal. After about 2 weeks later, the hiring manager called me during lunch to describe the job to me and find out my interest. When I told him that I was interested, he arranged a virtual interview 2 days later with himself and his department director. His director talked non-stop for an hour during the interview to describe the job to me in much detail. At the end of interview, I indicated my interest. The same day itself, the hiring manager called me at 6 pm to ask whether I am available to attempt a written assignment. I was required to write an essay (1 page or less) about what I know about the job after the interview and how I can contribute to make the project a success. The written assignment must be submitted within 3 hours. After that, the final interview with HR, neutral director and the hiring director was more than 2 weeks later. The final interview lasted slightly longer than an hour and questions asked were related to how I manage project and even details like personal interests and family members. A week after the final interview, there was no news. I checked with the HR interviewer and was informed that they are still considering my application. Another week later, I had 2 other offers to consider but I prefer this job the most. The HR interviewer again informed me that they have not come to a conclusion yet. Even up till today (more than 3 weeks later), there is still no news, not even a rejection email which gives me the impression that they are so inefficient and indecisive. Seems like they only interview people for fun and take it like a chit chat session.", "Interview Questions": "Can this methodology be applied to the project that you'll be working on? What are the qualities of a good project manager? How do you deal with difficult colleagues/vendors? What are your personal interests? How many people are there in your family?"}, {"date": "7 Jul 2021", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Temasek Polytechnic (Singapore)", "Interview Descriptions": "2 rounds of interviews in total. First one is with the direct reporting officers with a short teaching presentation while the 2nd one is with the director of the school, hr and a neutral party. Overall questions during the interview were expected and process was quite smooth.", "Interview Questions": "How do you feel about teaching adult learners?"}, {"date": "13 May 2021", "title": "IT Related Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Temasek Polytechnic", "Interview Descriptions": "3 levels of interviews. Senior management carried a very unfriendly and elitist attitude . Entire experience gave a terrible impression on the conduct of a public servant. Not very open to discussing the job role and culture, with a series of stress-test style interview questions thrown your way. Definitely sensed a negative bias heading in and wasn't proven wrong.", "Interview Questions": "How would you solve this (IT)problem?"}, {"date": "14 Jul 2021", "title": "Senior Lecturer, Management Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Temasek Polytechnic (Singapore) in May 2021", "Interview Descriptions": "long process with multiple interviewers in a session. went through 3 sessions over more than one month with 2 weeks interval averagely. HR's role during the interview is minute, appearing on and off with standard communication. HR was only performing a coordinator role. after 3 rounds of interview, didn't even send any response to candidate. bad management! just disappeared. should really review the interview process and HR competencies.", "Interview Questions": "past experiences\r\nsalary expectations\r\nascertain interest on the role"}], [{"date": "17 Jun 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Temasek Polytechnic (Tampines New Town, ) in Feb 2021", "Interview Descriptions": "General questions that would be asked anywhere. Mainly focus on how you respond and prepared for the interview. Nothing that is too difficult or tricky. Its meant for you to learn and ease your way into the outside world", "Interview Questions": "What do you see yourself in the next 5 years?"}, {"date": "12 Nov 2020", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Temasek Polytechnic", "Interview Descriptions": "2 levels of interview.  1st level basic questions with some technical.  Brief and not difficult.  Next level is the director level, just to ascertain that the person to hire can fit in to the role.", "Interview Questions": "Tell us more about your self."}, {"date": "2 Oct 2020", "title": "Lecturer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Temasek Polytechnic (Singapore) in Jan 2020", "Interview Descriptions": "3 panelists in the interview panel. Ask about work experience and reason for applying for the post. Shared about the job expectations and requirements. The panelists were friendly and open to discussion and the process were professional. But tbe time taken to get back to the interviewee were slow. It take about a mont to receive the interview outcome.", "Interview Questions": "Ask about experience in teaching and course development for young and working adults"}, {"date": "19 Aug 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Temasek Polytechnic", "Interview Descriptions": "Interview is smooth. 2 interviews. First with reporting officer, just a chit chat 2nd with a board including department head.  Medical checkup and submission of a lot of documents including o levels.", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "10 Apr 2020", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Temasek Polytechnic (Singapore) in Aug 2019", "Interview Descriptions": "A short chat with the department that is hiring and a phone call with the Human Resource Department Representative. It helps to know someone from within, and better yet if you have worked there before.", "Interview Questions": "When can you start?"}, {"date": "14 Jun 2019", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Temasek Polytechnic (Singapore)", "Interview Descriptions": "2 interviews, 1st with the course, that is just to screen the professional level. wont take long. normally you already know each other in the professional circle. \r\nand the 2nd is with the director, HR and a natural party.", "Interview Questions": "why do you want to work in here?"}, {"date": "30 May 2019", "title": "Mso Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Temasek Polytechnic", "Interview Descriptions": "Interview was conducted with 2 management staff from your department, one neutral party and one HR staff. They would also ask how do would you contribute to the school", "Interview Questions": "Why do you want to join TP?"}, {"date": "21 Mar 2019", "title": "IT Related Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Temasek Polytechnic", "Interview Descriptions": "In the interview, be careful. Dont trust their words entirely. They promised you lots of things. Give you hope. Once you are in, such thumb.  There are also lots of changes along the way.", "Interview Questions": "N/A"}, {"date": "30 Aug 2022", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Temasek Polytechnic in Oct 2018", "Interview Descriptions": "A panel interviewed me. The Director from the school, a neutral Director, my RO, an HR person. They were friendly but asked some pretty sharp questions. Overall a pleasant experience.", "Interview Questions": "Will you regret leaving your old company?"}, {"date": "24 Mar 2020", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Temasek Polytechnic (Tampines New Town, ) in Feb 2016", "Interview Descriptions": "It takes about 3 months from job application to contract offer.  It involves 2 interview sessions: first with the department head that you will be joining and the second one involves the school's director, an independent director as well as a HR representative.", "Interview Questions": "They would required you to do a short 5-minute presentation before the interview commences.  "}], [{"date": "28 Dec 2016", "title": "Senior Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Temasek Polytechnic (Singapore) in Oct 2015", "Interview Descriptions": "Round one to showcase presentation skills and gather feedback on the desire to join, how apt is one able to communicate with youth.\r\nRound two is with a panel of management people to find out the eagerness to join the teaching profession.", "Interview Questions": "How are you able to connect with the youth?"}, {"date": "2 Nov 2013", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Temasek Polytechnic", "Interview Descriptions": "Two rounds of interviews. First round was cast as an 'informal' interview which could be misleading since in any situation (whether they call it formal or informal) you are being sized up by the hiring manager. But nothing too difficult. The second round was a panel interview with the Director of the school, HR, your hiring manager, and an independent (a staff member from another school).", "Interview Questions": "Nothing too difficult. They just need to make sure you know what you are getting into. So they try hard to explain the demands of the job and make sure you're ready for the commitment."}, {"date": "1 May 2016", "title": "Producer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Temasek Polytechnic (Singapore) in Aug 2013", "Interview Descriptions": "Interviewed by a panel of four managers, two of which were from Corporate Comms, one lady was the director of the library. They asked me about my previous work experience, and what skills i had that could contribute to the organization. It was a casual and friendly atmosphere. Prior to this interview, i had been interviewed by my immediate supervisor already, who probably already made the decision to hire me based on my skills. The panel interview was just a formality.", "Interview Questions": "The skills you are able to contribute, what makes you different from others\r\nYour work experiences\r\nwhy did you leave your previous job"}, {"date": "18 Jan 2016", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at Temasek Polytechnic in Feb 2012", "Interview Descriptions": "Lengthy and slow with too many people involved who do not have a vested interest in hiring you.\r\nThere are informal and formal interviews and, depending on the department/school, the whole process can take months.", "Interview Questions": "Do you have any teaching experience?"}, {"date": "7 Aug 2012", "title": "Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Temasek Polytechnic (Singapore) in Aug 2011", "Interview Descriptions": "1. HR telephone interview: ask about your interests, your expected salary, working style, etc, \r\n2. Presentation on your experience: introduce your achievements during your working experience.\r\n3. Top management interview: your ideas on research direction, how to overcome the difficulty when you face lack of resources", "Interview Questions": "They  let you to solve their issues at hand. For example, MOSFET reliability issue. This question is too broad, is it BVdss issue? or Ig at low or high voltage?"}, {"date": "2 Mar 2013", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Temasek Polytechnic (Singapore) in May 2009", "Interview Descriptions": "There will be a lab test to measure your competency. A good GPA is a must.", "Interview Questions": "The lap test requires you to trouble shoot, this is not easy"}]]