[[{"date": "8 Mar 2023", "title": "Resident Assistant (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Grand Valley State University", "Interview Descriptions": "A supervisor and a current RA will meet with you and start the conversation, you will be asked common questions and also more specific ones related to the position. You will do this process twice.", "Interview Questions": "Why did you apply for this job?"}, {"date": "16 Nov 2022", "title": "Writing Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grand Valley State University", "Interview Descriptions": "The interview was a zoom/video chat format with other interviewees, lasted about an hour. They asked a lot of detailed questions and made sure that everyone had a chance to speak.", "Interview Questions": "They asked a lot of hypotheticals about situations that might arise with students and what I'd do."}, {"date": "2 Jun 2023", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Grand Valley State University (Allendale, MI) in Aug 2022", "Interview Descriptions": "Calling script will be sent to you and then you will do a phone Interview with the annual giving manager. Will go through the caller script scenario to see how well you would do on the phone.", "Interview Questions": "Other than the script scenario reading Q: What cause do you feel most connected to and why?"}, {"date": "6 Feb 2023", "title": "Graduate Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Grand Valley State University (Grand Rapids, MI) in Apr 2022", "Interview Descriptions": "The interview was with Finance department chair and Assistant Dean of College of Business where I was given an option to choose from an online interview and an in-person interview where I chose an in-person interview.", "Interview Questions": "What is one of your strength?"}, {"date": "7 Mar 2022", "title": "Health Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Grand Valley State University", "Interview Descriptions": "The interview went very well. They were really interested in knowing about past experiences where I communicated data into a visual format that was easy to interpret and understand. Everyone was super nice and friendly during the interview which made the experience better overall.", "Interview Questions": "How would you specifically visualize COVID-19 wastewater data for community stakeholders?"}, {"date": "19 Feb 2022", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grand Valley State University", "Interview Descriptions": "The team was super sweet and gave ample time to discuss job requirements and answer questions. There was plenty of opportunity to share previous experiences and the interviewers were more than willing to give students a chance.", "Interview Questions": "What is your previous experience? "}, {"date": "2 Apr 2022", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Grand Valley State University (Grand Rapids, MI) in Feb 2022", "Interview Descriptions": "Started with a 6 person panel phone interview conducted in less than 35 minutes. The search committee then had zero communication for 8 weeks and only replied after repeated attempts to connect by me.", "Interview Questions": "Describe a marketing campaign failure and what did you learn from it."}, {"date": "8 Mar 2022", "title": "Senior Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Valley State University (Allendale, MI) in Jan 2022", "Interview Descriptions": "Applied online. Received phone call to schedule on site interview the following week. Attended interview as scheduled, but had not been made aware there would be a committee of six staff members included in the interview. The actual interview was fairly pleasant.  I followed up a few days later but was not acknowledged.  I never received any further communication and was not notified the position had been filled (internally).", "Interview Questions": "What digital platforms have you used in the past?"}, {"date": "26 Oct 2021", "title": "Prospect Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Valley State University", "Interview Descriptions": "An initial phone screen, then an in-person interview at their office with several members of the development team. They each gave their business cards and a packet of information about the department.", "Interview Questions": "To share a time when my supervisor was proud of my work"}, {"date": "17 Sept 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Valley State University", "Interview Descriptions": "It was okay. The Dean is awful and basically nothing else mattered except what she said. So, if she doesn't like you, the rest doesn't matter, which is unfortunate because the faculty is otherwise collegial. She is the worst Dean I have encountered in many years in academia.", "Interview Questions": "Standard Questions regarding interest and fit. They interviewed without knowing whom they wanted which was a bit unfortunate since they didn't have final financial approval on the position..."}], [{"date": "22 Apr 2021", "title": "Recreation Center Employee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grand Valley State University", "Interview Descriptions": "Basic questions, reviewed resume, took about 45 minutes in and out. Manager had a list of questions and we went over them together.  Ranged from basic questions about myself to scenarios in the work place.", "Interview Questions": "Why do you think you are a good fit to this team?"}, {"date": "5 Apr 2021", "title": "Dietetic Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grand Valley State University", "Interview Descriptions": "In-person panel interview with 4 professors, asked basic questions about experience and what value you could add to the program. Some situational questions about what you would do and how you would handle certain situations.", "Interview Questions": "Describe a time when you handled a conflict. "}, {"date": "3 Jan 2023", "title": "Bartender Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Grand Valley State University (Allendale, MI) in Feb 2021", "Interview Descriptions": "Easy fun and they just wanted to be able to get to know me and my skills that I can give to the team to be successful. I really enjoyed it and connexted well with the interviewer", "Interview Questions": "Why did you apply here"}, {"date": "1 May 2021", "title": "Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand Valley State University (Allendale, MI) in Nov 2020", "Interview Descriptions": "Zoom interview with current student employees, student managers, and the supervisor. Asked several questions relating to skills, my resume, and personality. It took approximately thirty minutes to complete. I asked questions at the end", "Interview Questions": "What would you do if I client was upset about something beyond your control?"}, {"date": "5 Aug 2022", "title": "PhD Student Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Valley State University (Allendale, MI) in Feb 2020", "Interview Descriptions": "Great, really liked it a lot. Awesome experience at this university. I learned so much in so little time. They were really nice to me and gave me yummy snacks. I got crumbs on myself and was given a napkin", "Interview Questions": "What’s the craziest party you have ever been to? "}, {"date": "26 Sept 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grand Valley State University", "Interview Descriptions": "The interview process included a telephone interview and a campus visit in which I'm at multiple people. it was rather long and that it took place over two days rather than the conventional one day.", "Interview Questions": "Tell us about yourself"}, {"date": "10 Sept 2019", "title": "Health Educator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grand Valley State University (New York, NY)", "Interview Descriptions": "Very disappointing interview process - consisted of 15 minute phone call to screen out applicants and then invite people to campus. 6 panel members, all women, asking many questions about how diversity affects student life. The irony perhaps being a bit lost on them.", "Interview Questions": "How does diversity affect student retention and graduation?"}, {"date": "3 Mar 2019", "title": "Associate Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grand Valley State University", "Interview Descriptions": "This was for an administration / program associate director position, not faculty. As is typical of university positions, each interview was by a committee. It started with 5 people for a screening interview. In the second round, I had a brief \"get to know you\" panel interview with the team, and was asked to give a one-hour presentation to a group of students who were engaged in that program on campus. Afterward, I was taken to dinner with a group of those students as well as employees from the administration -- the table was perhaps 12 people. This was also a more relaxed \"get to know you\" session where I felt more like a participant than a subject of focus.\r\n\r\nI had a friend who pushed internally for me to get this job; he was on the interview committee. I didn't receive an offer and was told they were pausing filling the position. My friend informed me that I didn't get the job because the wife of the Director, who sat next to me at dinner, asked me what book I'm currently reading. I answered truthfully, that at that moment I was in between leisure books because I was helping a graduate professor with research and all of my reading time was spent in academic journals - of which I listed the titles and provided an overview of the research. She relayed to her husband that \"He doesn't find time to read\" and evidently that's not the kind of person they wanted in that position.\r\n\r\nPretty amazing.\r\n\r\nI kept tabs on the program over the next few months, and it's also true that they didn't hire an associate directly (rather they underfilled it with a more junior, entry-level person).", "Interview Questions": "Who was [the person that the program was named after]? Describe his/her life."}, {"date": "26 Aug 2018", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grand Valley State University (Grand Rapids, MI)", "Interview Descriptions": "It was Online application process  and one week later interview was scheduled. The interview is with the supervisor  itself. I heard back from them within one  week that I was selected. This was a full time GRA position.", "Interview Questions": "Fairly simple, questions based on previous research experience and field specific questions were asked"}, {"date": "20 Aug 2018", "title": "Health Simulation Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Grand Valley State University", "Interview Descriptions": "After applying online, it was a good month before my application had been reviewed and I was contacted.  First there was a 10 minute phone \"screener\" interview with 4-5 people.  About a week later, they called back and requested a face-to-face interview.  The face-to-face interview was with 4 people.  They had three pages of questions typed out, and each person took turns going down the list, asking a question and taking notes.  For someone with interview anxiety, it was fairly stressful.   I will say that everyone was pretty friendly and thanked me after I answered each question, which I thought was nice.  After the interview, I was asked to take a 30-minute proofreading assessment and an assessment on Excel.   The assessments weren't very difficult, but there was not nearly enough time to complete the Excel assessment.  After over two weeks of not hearing anything, I followed up, and received a generic \"you did not get the position\" e-mail from HR the next day.  I found this to be a little disrespectful - I understand that there must have been a better candidate and I accept that, but after the time and effort I had put in to preparing for the interview, someone could have at least called me or written a more personable e-mail (especially since I had met with them face-to-face).  The hiring process here seems to take an extremely long time, so be prepared to wait a while if you want to get hired here.  I would have rated this a more positive experience if the process didn't take so long and I had received a personal phone call or e-mail (versus the generic e-mail).  Also, don't pay attention to the \"application status\" on your online dashboard - it's not accurate, at least not in my case.", "Interview Questions": "How do you handle stress?"}], [{"date": "14 Jul 2018", "title": "Writing Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grand Valley State University", "Interview Descriptions": "Group interview process, interviewed by multiple staff members. An individual interview was conducted as well. Standard questions were asked - very friendly staff and very welcoming environment. Made you feel comfortable and desired. Simple process.", "Interview Questions": "Are you familiar with APA, MLA, and Chicago citation styles?"}, {"date": "4 Oct 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Valley State University", "Interview Descriptions": "Very easy interview, was basically just a conversation about my schedule and start date. The process took two weeks. I received an email to schedule an interview, and only hours after the interview I was offered the position.", "Interview Questions": "What are your hobbies?"}, {"date": "7 Jun 2019", "title": "Graduate Assistant Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Grand Valley State University (Grand Rapids, MI) in Aug 2017", "Interview Descriptions": "Panel Interview. The interview process went for an hour. The interviewers were very friendly but the questions were tough, Your resume is reviewed and it was a typical interview.", "Interview Questions": "Tough Coding Challange, Skill questions"}, {"date": "4 Dec 2016", "title": "Custodian Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grand Valley State University (Allendale, MI) in Aug 2016", "Interview Descriptions": "It is a round table event where they have you come in introduce themselves and then ask questions about your experiences and qualifications. It is fairly administered and seems level headed in its technique.", "Interview Questions": "Previous job: What was the one thing you hated?"}, {"date": "6 Mar 2018", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Grand Valley State University (Grand Rapids, MI) in Apr 2016", "Interview Descriptions": "I was brought into a medium sized conference room and given a moderately easy interview by two project managers. I hear back from them in a timely manner after the interview and was given the job.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "3 Mar 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grand Valley State University (Grand Rapids, MI)", "Interview Descriptions": "I didn't have one. I have got the job because I was studying in the school. \r\n\r\nI had an interview with the supervisor and he liked me and offer me the position.", "Interview Questions": "DO you want to work with us?"}, {"date": "15 Dec 2015", "title": "Program Advisor TRIO Talent Search Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Grand Valley State University (Grand Rapids, MI) in Nov 2014", "Interview Descriptions": "Many questions about work culture and ability to get along with others, interviewed with 4 people from the College of Education then an interview with the Dean.\r\n\r\nWhat worked for me: I had a job packet (CL, my skills vs. what skills they were looking for, resume), sent out handwritten thank you notes to all 5 individuals", "Interview Questions": "How do you deal with conflicts at work?"}, {"date": "27 Oct 2014", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Grand Valley State University", "Interview Descriptions": "standard department group interview plus four 1 on 1 interview series, technical discipline presentation to faculty and students , observed model teaching class, investigation of current research projects, follow-up interviews, dinner with selected faculty, dean, administration leadership, review of CV, tour of campus. meeting lost of unnecessary people, selling of city for family environment, overhyped description of department and school status and accomplishments.", "Interview Questions": "are aesthetic principles axiomatic?"}, {"date": "31 Aug 2017", "title": "Project Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at Grand Valley State University (Grand Rapids, MI) in Apr 2014", "Interview Descriptions": "I applied through the company online site; received a call and came in to interview with who I would work under directly if I got the position. After that interview, I was invited back to a second interview with a bunch of the other staff members and once I surpassed this phase, I was offered a position the same day (a few hours after the second interview).", "Interview Questions": "Explain your experience in project management."}, {"date": "2 May 2017", "title": "Managing Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand Valley State University (Grand Rapids, MI) in Apr 2014", "Interview Descriptions": "short 30 minute interview with 2 employees who talk about the position and what to expect while working there. Very laid back environment. Then a follow up interview with the director which is very similar", "Interview Questions": "talk about leadership"}], [{"date": "23 Jul 2015", "title": "Library Staff A&D Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Grand Valley State University (Allendale, MI) in Jan 2014", "Interview Descriptions": "Very comfortable interview with Theresa Maycroft. Sat in her office for maybe 30 minutes and had a casual conversation about the position. At the end I asked her what I would actually be doing and she explained that it is a varied job with lots of various responsibilities. Overall Theresa is a great boss to work for and the interview with her felt more like the beginning of a friendship!", "Interview Questions": "What is a project you got really excited about? What are looking to achieve here?"}, {"date": "17 Feb 2016", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Grand Valley State University (Allendale, MI) in Oct 2013", "Interview Descriptions": "I applied online through laker jobs website. They were looking for somebody to work at a time that I was available, and the building was close to my apartment. I applied and received an interview within a week. Interviewer was extremely friendly and easy to talk to. Received offer within the next few days.", "Interview Questions": "Future Goals, Academic Major..."}, {"date": "11 Jul 2013", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 7 months. I interviewed at Grand Valley State University", "Interview Descriptions": "Best described as a nightmare, moving at a snail's pace. The entire process was a full 7 months long, from application to computer-generated email from HR saying they weren't filling the job, even though it only consisted of 2 interviews. Attempts to get an update in between interviews proved fruitless even though I had direct emails.\r\n\r\nJust incredibly passive communication and slow moving process, which was enough to make me not want to work there anyway. I received another offer while waiting to hear back from GVSU and accepted it (note: I applied to this job two months after I applied to GVSU). So in the end I wasn't *too* upset that they didn't offer me the position, but it was a huge waste of everyone's time, most importantly mine.", "Interview Questions": "It's a university so be prepared for very general, open ended questions. You are going to put in a LOT more effort for these interviews than for a normal company, mostly because universities do everything, especially hiring, in committees of 10+ people. My specific tip for GVSU interviewees is this: answer with stereotypical answers. \"How would you improve the program\" --> more student involvement, alumni involvement, community involvement. This is more like Miss America than anything else. You need to show you have a personality yet not veer off the acceptable \"world peace\" track or you'll be scored negatively. Be prepared for personal life questions too and answer appropriately. They want academics so portray yourself as a future thought leader. Before your interview, find a book, movie, and musician that is a little off the beaten path but one that's highly regarded. Ex: don't say you read Orwell, say Kafka - or someone even more obscure. Find a classical or jazz musician and talk about how you like to unwind on your car rides or at home.\r\n\r\nOtherwise the questions are all pretty straightforward, if not boring and uninspired (What are your strengths? Do you think diversity is important? When is a time when you were wrong and what did you learn from it? Why do you want to work for Grand Valley? Who is your role model?)"}, {"date": "17 Feb 2017", "title": "Student Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Grand Valley State University (Muskegon, MI) in May 2013", "Interview Descriptions": "I brought my resume to the PI whose lab I was interested in, and he asked questions about why I was interested in the field, along with my research background.", "Interview Questions": "What are you interested in?"}, {"date": "18 Apr 2016", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grand Valley State University (Allendale, MI) in Apr 2013", "Interview Descriptions": "25 minute phone interview.  The committee asked challenging questions about pedagogy but the tone was friendly.  The committee contacted me a few weeks after I had submitted the application dossier.  The department website had plenty of information that helped prepare for the interview.", "Interview Questions": "How do you create collaborative projects in your courses?"}, {"date": "24 Feb 2013", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grand Valley State University", "Interview Descriptions": "Got a phone call for an interview, went in a few days later, very easy interview, pretty much just making sure you were sane, and they could trust you with a knife, since you would be prepping and cooking food. Offered job on the spot, started a few days later after I turned in paperwork and went into the computer system.", "Interview Questions": "Was asked about allergies, which was confusing at first, but makes logical sense since you're working with food and may have food allergies which could affect what station you're placed at. "}, {"date": "21 Jan 2013", "title": "Audio Visual Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Grand Valley State University (Grand Rapids, MI) in Jan 2013", "Interview Descriptions": "Send in Resume, Interview-takes approximately 20 minutes, Training for a few hours then hands on experience for a few hours.", "Interview Questions": "There were none. The interviewers seem to take it as they hire students so as long as they seem responsible, then that's all they need to know."}, {"date": "9 May 2012", "title": "Golf Course Maintenance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Grand Valley State University (Allendale, MI) in Feb 2012", "Interview Descriptions": "Simple, showed up and I was hired on the spot. OK I am really honest, a great place to work made lifelong friends and still go up on occasion whenever i have time and slap a couple balls around on the course. Very fun, rewarding job. I also was very pleased with the benefit package allocated of being allowed to receive free golf whenever possible, and being able to have fun while you work is very important!!!", "Interview Questions": "Is the pay acceptable."}, {"date": "28 Jun 2016", "title": "Network Systems Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Grand Valley State University (Allendale, MI) in Jan 2012", "Interview Descriptions": "Applied for job, waited 3 months for interview, interviewed with 8 people in the room followed by a short tour. Got a call 1 month later to tell me the job was filled, then a call 15 minutes after that to come in for another interview. Second interview with 8 people, followed by a 3rd with 2 people, and a fourth with 1 person. Waited another 30 days for an offer, and then another 30 days to start. Long process, very little feedback in between each interview.", "Interview Questions": "Most questions were very general and focused on what systems I had experience with, what kind of work environment I preferred, and why I was leaving the last job. A few minor technical questions about how I'd handle certain network events, and how I would handle issues that were more user politics involved. Very relaxed interview process."}, {"date": "24 Jun 2015", "title": "Administrative Professional Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Grand Valley State University (Allendale, MI) in Nov 2011", "Interview Descriptions": "Group interview with 2 department internals and 2 externals (one of which was an inclusion advocate). I had to write an essay on diversity. The group took turns asking mainly personality questions.", "Interview Questions": "What do you know about GVSU"}], [{"date": "19 Oct 2015", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Grand Valley State University (Grand Rapids, MI) in Nov 2011", "Interview Descriptions": "Short interview in person. Had to complete a computer typing test to get the job. I did the test after the in person interview. There were four people in the interview with me. It was a round table for question and answer.", "Interview Questions": "Motivation to apply."}, {"date": "15 Aug 2015", "title": "Structured Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Grand Valley State University (Allendale, MI) in Jan 2011", "Interview Descriptions": "Honestly, the application was more heavily weighed than the interview process so I did not really have much of an interview. She asked me about my strengths and weakness. She also asked me about my prior experiences. But like I said, my application was a lot more heavily weighed than my interview.", "Interview Questions": "strengths and weaknesses"}]]