[[{"date": "6 Sept 2022", "title": "Registration Staff, Greeter, Directional, Room Monitor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at BGEA", "Interview Descriptions": "Comprehensive and good listening skills for the Human Resources representative. She had thorough knowledge of the company hierarchy. This interview was conducted prior to the move. That's about all for now.", "Interview Questions": "What would you do with an adverse employee?"}, {"date": "22 Mar 2021", "title": "Prayer Line Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at BGEA", "Interview Descriptions": "It was pretty good and simple. Everyone was nice. They answered as quick as they could but it did take a full month from first confirmation to training and working.", "Interview Questions": "All the questions you filled out on application. Also spiritual and what if situational questions about callers"}, {"date": "16 Mar 2021", "title": "Customer Service (CSR) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at BGEA", "Interview Descriptions": "Easy clean time great wonderful good amazing superior spectacular excellent I would recommend it to anyone looking for a job here it was very great. Yes yes yes very great", "Interview Questions": "What do you want to work here for"}, {"date": "11 May 2022", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at BGEA (Charlotte, NC) in Feb 2018", "Interview Descriptions": "Very slow and drawn out. Positive overall, great vibe and lots of really nice people. Very good experience for interview. Questions not very technical but good engagement and enjoyed the people.", "Interview Questions": "If your friend hosted a wordpress website on their own server and asked you what they should do to secure it, what would you tell them?"}, {"date": "1 Feb 2018", "title": "Material Handler Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at BGEA (Charlotte, NC) in Oct 2017", "Interview Descriptions": "I interviewed twice, once with the director of the department, the second time with my would-be supervisor. Both interviews were one on one, each had their individual yet similar questions. Process took about half a month.", "Interview Questions": "What are your weaknesses? Why do you think you would be a good candidate?"}, {"date": "27 Apr 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at BGEA", "Interview Descriptions": "The interview process varies slightly by department, but it almost always includes interacting with both HR and the hiring manager. It can take time after your application before contact is made, but the interview process usually moves quickly once it begins. For most full time positions, expect 2-3 interviews. If you are applying from out of state, the initial round of interviews can usually be conducted over the phone.", "Interview Questions": "Tell us about how you came to know the Lord."}, {"date": "30 Aug 2016", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BGEA (Charlotte, NC) in Oct 2015", "Interview Descriptions": "The interview was a three part process. It first started with an hour long phone interview, which was more of a conversation and went very smoothly. The second part was an interview with the VP of human resources and it was a two hour intense questioning about my faith. Be prepared, they ask you the hard questions that are sometimes difficult to answer but it was not a bad experience. After this interview I then went and spoke with the Executive Assistant who I would be under. A few weeks later I then met with the Vice President and he interviewed me. None of the interview questions were hard, I could tell they were more worried about getting to know me to see if I would fit with the organization then they were concerned with asking me the hard questions.", "Interview Questions": "They required me to give an account of how I became a Christian and my testimony. "}, {"date": "12 Jan 2015", "title": "Christian Response Associate Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at BGEA in Mar 2014", "Interview Descriptions": "BGEA is an incredible organization, with top-down management style, and employees who clearly enjoy their work. Their interview process is more personable, than other companies HR departments. They care about their employees and try to create a family atmosphere within the work environment. While a more relaxed work atmosphere, there is still a high level of professionalism expected.", "Interview Questions": "How would you deal with a Caller, who had faith-based questions?"}, {"date": "1 Jun 2016", "title": "Print & Digital Media Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at BGEA (Charlotte, NC) in Jul 2013", "Interview Descriptions": "I came in and met with the hiring manager. After meeting with the hiring manager, about a week later, I was brought back in to meet with the Office manager and Department supervisor to review if I was a fit for the company and department. I was then contacted by the hiring manager that I was selected for this position.", "Interview Questions": "How did you come to know the Lord?"}, {"date": "5 May 2012", "title": "Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at BGEA (Charlotte, NC) in Jan 2010", "Interview Descriptions": "Interviewed for an internal supervisory position within the ministry. This consisted of a 1:1 interview initially with the department manager. This was followed by a panel interview with several other supervisors whom I would be working with if selected. During the panel interview I did a PowerPoint presentation on dealing with stress management. The working environment is very fast paced and stressful so the presentation I chose was very appropriate for the interview process.", "Interview Questions": "How would handle a situation involving a team member who was having performance issues?"}]]