[[{"date": "30 May 2023", "title": "Workforce Management Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association (Chicago, IL)", "Interview Descriptions": "It was a phone interview followed by two in-person interviews. The second in-person interview was with the Sr Director of contact center operations. The offer was contingent on passing a drug test.", "Interview Questions": "What is the least you can work for?"}, {"date": "8 May 2023", "title": "Walk to End Alzheimers Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association", "Interview Descriptions": "They reached out promptly, were extremely polite and friendly, and the interview process was very clearly stated. They took time to answer my questions and also followed up with me.", "Interview Questions": "What are your goals within the company?"}, {"date": "26 Apr 2023", "title": "Health Systems Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Association (Little Rock, AR) in Mar 2023", "Interview Descriptions": "Total of 4 interviews. HR and 2-person panel were longest In duration but nothing greater than 45 minutes. It was a lot of steps to not receive an offer. HR did a good job communicating in between the interviews.", "Interview Questions": "Tell me about a quality improvement project. Tell me what sales/client relations software you use."}, {"date": "2 Feb 2023", "title": "Donor Services Gift Processor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Alzheimer's Association", "Interview Descriptions": "Went through two round of interviews. Everything seemed great and they were really encouraging. That all changed after the holidays. Dead silence and unwillingness to give updates. I liked the organization before interviewing, sadly I realized it wasn’t as good as they make it out to be. Don’t apply or donate!", "Interview Questions": "Why do you want to work here?"}, {"date": "28 Feb 2023", "title": "Care Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alzheimer's Association in Feb 2023", "Interview Descriptions": "Heard back pretty quickly for a video interview. The interview was pretty straight forward but the interviewer was reading off a job description that was completely different from the one in the job posting. Was told I’d receive a call or email within a week and didn’t hear anything. I did however receive an email rejection for a position I applied for LAST YEAR and never got an interview for.", "Interview Questions": "How important is diversity to you and how does it impact your current role."}, {"date": "6 May 2022", "title": "Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Alzheimer's Association (Chicago, IL)", "Interview Descriptions": "Went through 6 different rounds of interviews meeting with everyone. When it got to the end, I received an email notifying me I was not chosen for the role (usually receive a phone call at that point in the process). I replied back asking for input on my interview performance and received no response.", "Interview Questions": "How your experience aligns with the role"}, {"date": "21 Apr 2022", "title": "Regional Walk Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Alzheimer's Association in Apr 2022", "Interview Descriptions": "There was a virtual screen with the TA that was easy and very friendly. I was called for a second round, but declined based on salary not meeting my needs.", "Interview Questions": "Do you have experience with peer to peer fundraising."}, {"date": "17 Mar 2022", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Alzheimer's Association", "Interview Descriptions": "I had a phone screen, with HR.  They didn't have specific information on the role and couldn't give a timeline for hiring, role was open for a long time prior to my interview.", "Interview Questions": "Why are you leaving your current role?"}, {"date": "23 Jun 2022", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association (Seattle, WA) in Feb 2022", "Interview Descriptions": "Phone screen, which included salary disclosure. Then one Zoom interview with the hiring manager, followed by a detailed homework assignment. The hiring manager never followed up as indicated, and I got a rejection for the national office after several weeks.", "Interview Questions": "Give one or two specific examples of how you’ve incorporated or enhanced diversity, equity and inclusion in your current role."}, {"date": "1 Nov 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Alzheimer's Association", "Interview Descriptions": "Easy 1st interview - focused on personality and fit. I enjoyed the conversation. The interviewer stated I’d be moved to the second interview when we wrapped up and would send times the same day. She never sent times nor responded to a follow-up email. It has been over a month and no follow-up.  Giving false promises with no follow through is incredibly disappointing, especially as a job seeker", "Interview Questions": "What are you looking for in your next role?"}], [{"date": "29 Nov 2021", "title": "Health Systems Account Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Association (McLean, VA) in Oct 2021", "Interview Descriptions": "I interviewed with the recruiter and she had very little information to proved for me because the role is fairly new.  The next step was to interview with the director of Health System. It went really well. Average questions. Nothing out of the ordinary.  I didn't think the job was a good fit for me.  It was a 2 year project and I am not going to quit my current job for a project that may or may not continue after 2 years.  After a week have gone by I haven't heard from the recruiter if I will be moving to the next  step.  I emailed her and I never heard back from her.  Very unprofessional. That speaks volume of the culture.  I think I dodged a bullet. Plus, the employees review are horrible. Rejection is God protective.", "Interview Questions": "Tell me a little about yourself?"}, {"date": "5 Oct 2021", "title": "Sales Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Alzheimer's Association in Aug 2021", "Interview Descriptions": "I truly appreciate the Alzheimer's Association, and all the work they do helping, and hoping to make a difference to the next steps in finding a cure. \n\nHowever, one bad apple, spoiled my passion to be an employee", "Interview Questions": "No questions, The hiring manager called, and appeared to have no idea what the call was about. "}, {"date": "12 Oct 2021", "title": "Advocacy Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Association (Columbia, SC) in Aug 2021", "Interview Descriptions": "The interview process itself only took a few weeks. I received an initial call for HR for a phone screening. I had a second round interview with two people from the local chapter. The third interview was with a regional leadership member.  I followed up with a staff member after 2-3 weeks following the third interview but never heard back. This seemed like a great place to work, so I was very surprised when I never heard back from them that I did not receive the job. I had to take personal leave from work to attend two of the interviews, so to not hear back anything at all is really disheartening. This organization should treat candidates with more respect than that.", "Interview Questions": "How would you handle an advocate who disagreed with an issue you were advocating for?"}, {"date": "2 Feb 2022", "title": "Senior Associate Director, Digital Fundraising Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Association in Aug 2021", "Interview Descriptions": "I had a total of three interviews in roughly a ten day time period. This was for a national position, rather than a position at a specific chapter so not sure if that process is different. \r\n\r\nThe first interview was screening through HR and was fairly generic. The second interview was with someone on the team I'd be working on and was much more focused on the details on the position. The third interview was with a key person from an adjoining team that focused on more in-depth details on the position.  \r\n\r\nI really enjoyed the first and second interviews, both warned me that nobody had made it through the third interview. I'm not sure if I let that get into my head, but I still felt like the third interview went well. Overall, I feel like they were looking for the \"perfect candidate\" and if you're experience wasn't exact they were just going to move on.", "Interview Questions": "What automation tools did you use for emails? "}, {"date": "23 Jun 2021", "title": "Senior Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alzheimer's Association", "Interview Descriptions": "It was okay, typical interview process. Not as warm and inviting as i thought they would be given they are noted as a non profit. They said they would follow up but never did, also asked if i was still working remote.", "Interview Questions": "How large is the budget you currently work with?\r\nWhat do you dislike the most at your current job? How did you handle covid?"}, {"date": "31 Jan 2022", "title": "Walk Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Alzheimer's Association (Nashville, TN) in May 2021", "Interview Descriptions": "The interview itself was enjoyable and easy. I was pleased to hear that they would be moving forward with my application and would reach out with dates and times. Unfortunately, they never did. I emailed the woman who interviewed me a few times and did not hear back for over 4 months. At that point, I had a new job. So disappointed.  This seems to be a very common issue.", "Interview Questions": "What is your experience in recruitment?"}, {"date": "20 May 2021", "title": "Social Worker/Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Alzheimer's Association (West Los Angeles, CA) in Apr 2021", "Interview Descriptions": "Straight forward and made the process very easy.  Initially emailed me and asked if I was available for a prescreening telephone call. Then called me and asked me some basic questions on the phone and asked if I would be available for a formal interview. Formal interview was with two supervisors of whom were not as warm as I would of hoped.", "Interview Questions": "Tell us about your strengths"}, {"date": "12 May 2021", "title": "Care Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Association (Chicago, IL) in Apr 2021", "Interview Descriptions": "I applied for the position online at the end of March 2021, and completed 3 interviews all via Zoom, and the process took just over a month to complete.  A satisfactory background check and professional references completed the process with an official offer for the position.  I was impressed with their consistent communication, professionalism and energy throughout the whole process.  They were very on top of it and fair.", "Interview Questions": "They were mostly behavioral based questions, using the STAR method - be prepared to talk about past experiences or how you would respond in different situations working with people (particularly in a call center environment).  Also had to complete an online typing and communication skills assessment, as well as 3 call center documentation assessments that were all timed."}, {"date": "8 Mar 2021", "title": "Public Policy and Advocacy Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Alzheimer's Association", "Interview Descriptions": "Very informal, focus on personal connection to Alzheimer's by interviewer. Most of the interview is informational about the corporation, less emphasis on your own skills.  Seems like they only offer internships to schools that give academic credit, otherwise it is volunteering.", "Interview Questions": "What has been you experience with Alzheimer's disease?"}, {"date": "1 Mar 2021", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association (Fredericksburg, VA) in Jan 2021", "Interview Descriptions": "I had an initial call with someone in HR, and during that call I schedule an interview with the Director of the department in which the position was in. After that, I had a follow up interview the Executive Director of the local chapter, though that interview was much shorter than the previous one and was focused on specific follow up questions she had for me.", "Interview Questions": "What are some challenges you have had in your current position and what did you do to overcome them?"}], [{"date": "7 Jun 2021", "title": "Community Outreach and Volunteer Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association (Philadelphia, PA) in Jan 2021", "Interview Descriptions": "The first step was submitting an application to corporate HR via the online portal; The second step was participating in a telephone screening interview with the corporate HR representative; The third step was an online interview with the local manager.", "Interview Questions": "Why are you interested in this position?"}, {"date": "17 Jan 2021", "title": "Care Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association (Chicago, IL) in Jan 2021", "Interview Descriptions": "Started with a typing speed test followed by 3 case notes scenarios in which you read what happened and write notes for it. This was followed by a typical interview over Zoom. Think of scenario-based replies as they recommend in their email instructions.", "Interview Questions": "Why do you want this job?"}, {"date": "8 Jan 2020", "title": "Board Secretary Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association (Cambridge, England)", "Interview Descriptions": "Application form and cover letter followed by interview with 2 people - all very standard process.  However then took 2 weeks to advise of decision although aware that I had other options that I put on hold and reply by Friday was actually monday at 8.30am.", "Interview Questions": "Exactly what you would expect regarding confidentiality , dealing with senior managers and trustees"}, {"date": "11 Dec 2019", "title": "Walk Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association", "Interview Descriptions": "Non profit organizations should treat every job applicant with respect and as the potential donor and or volunteer that they are.  I had an extremely high opinion of the AA before the interview process but sadly that has changed.  I applied online, had a telephone interview with regional HR, and completed an application.  Then I traveled two hours round trip for an in person interview with the Manager.  Both interviews went well and I was told I would hear from them EITHER WAY within one week.  That was two months ago but still no response  after follow up to all. A simple thank you for your time you are no longer under consideration would be appropriate, appreciated and would allow me to continue to view the Alzheimer's Association in a more positive light.", "Interview Questions": "Describe a time that you developed a new sponsorship.  How did you go about doing it?"}, {"date": "9 Nov 2019", "title": "Walk Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Alzheimer's Association (Austin, TX) in Oct 2019", "Interview Descriptions": "Applied online & received a phone interview invitation w/in 8 business days. Phone interview was w/ HR rep a few days later after invite. They said they would recommend me to the hiring manager. W/in 6 business days I received an invite for a live online video interview. That 1rst video interview was a week later w/ 2 development staff members. W/in 4 business days I received another invitation to interview, this time w/ the Executive Director. That 2nd live online video interview was conducted several business days later.", "Interview Questions": "Phone screen interview - asked me about myself, asked follow-up questions about my level of experience, salary requirements, how quickly would I be available to re-locate there (since I was applying out-of-state), am I okay w/ no re-location package.\r\n\r\n1rst online video interview 2 person panel - asked me about myself, to go in detail about my experience, if I was okay w/ various requirements of the job (travel, volunteer recruitment), asked how I would handle certain challenges of the job, asked how quickly I would be available.\r\n2nd online video interview w/ Executive Director - very comprehensive interview covering in-depth details of my experience & how it translates to their job requirements, learned details in day-to-day job duties, asked how quickly I would be available, gave me her business email address for any questions or concerns, & they are still looking for finalists & HR would be in touch.\r\n"}, {"date": "13 Sept 2019", "title": "Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Alzheimer's Association", "Interview Descriptions": "Great! I enjoyed the conversation I have with the hiring manager and my experience overall at the company. I would recommend an internship here to any undergrads or recent grads.", "Interview Questions": "Where do you see yourself in the next 5 years."}, {"date": "9 Sept 2019", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association", "Interview Descriptions": "You first speak with HR for a quick phone interview. Once in the office, you speak with HR and then about an hour interview with direct managers. They usually include both a manager and another person in a leadership position.", "Interview Questions": "What is your experience with crisis management or safety assesment "}, {"date": "6 Aug 2019", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alzheimer's Association", "Interview Descriptions": "Was a thorough interview with questions that showed they cared. You could tell that the managers were passionate about the cause and wanted to bring in the right people.  The questions revolved around why I wanted to help others and how I would help the company.", "Interview Questions": "Why do you want to help others?"}, {"date": "20 Aug 2019", "title": "Director, Cycling Events Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Alzheimer's Association (Denver, CO) in May 2019", "Interview Descriptions": "The initial contact was about 20 days after the posting.  Over the course of the next 4 days there were three 1 hour calls with the Senior Director and one 1 hour call with HR.  They then went completely silent for 28 days.  After contacting them they indicated great interest still and would be in contact shortly.  1 month later HR called to say they had selected another candidate", "Interview Questions": "What is your marketing background.  They had already committed to a bike store to do all event  design/operations/ implementation for the next three years"}, {"date": "8 Apr 2019", "title": "Walk Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Alzheimer's Association", "Interview Descriptions": "I applied online and was contacted for a phone interview  within 2 weeks, however after this is when everything slowed way down. I passed through the initial phone interview as was not scheduled for a second interview till 1 month later. I was not bothered and very excited to interview for a company that I held in such high regard and had a close personal connection to. I interviewed on-site with 4 different individuals and thought we had gotten along great. I sent a follow-up thank you email that day and another one 2 weeks later. I have still not gotten a response back which I find extremely rude considering the time I put into this position. At the very least a sorry we aren't interested is warranted after an in-person interview. Unfortunately this has changed my views on this organization.", "Interview Questions": "They asked lots of situational questions"}], [{"date": "7 Jun 2019", "title": "Development Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Alzheimer's Association in Apr 2019", "Interview Descriptions": "I had an initial phone interview and was told by the interviewer they would be back in touch with me in a week. Well about 5 weeks later I heard back from them asking to set up an in person interview, and of course I was ecstatic. It seemed like  a great opportunity and I have a lot of experience that met the job requirements. I had an in person interview with two of the top people in the office, and it felt like they were attacking me the entire time. There was no empathy, no polite dialog, just questioning every thing on my resume or every response I gave. I have interviewed at well over a dozen companies and have never experience anything so unprofessional and rude. \r\n\r\nThat interview was well over two months ago, and after numerous emails following up with all three people who interviewed absolutely no one has responded back. I know \"ghosting\" is becoming more relevant in the job search, I just hoped with an organization with such a high reputation and one I respected would have been more professional and better than that.", "Interview Questions": "Why do you want to work here."}, {"date": "23 Feb 2019", "title": "Associate Director Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association", "Interview Descriptions": "applied online, slow to respond to set up interview, chapter undergoing a lot of changes, unsure of positions as they were changing some of them and unsure of territory, salary ranges lower than expected", "Interview Questions": " What is your experience with supervising staff and volunteers"}, {"date": "8 Feb 2019", "title": "Development Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Association (Waltham, MA)", "Interview Descriptions": "Very thorough interview process, spoke with multiple members of the organization. Had three interviews, each with 2 or more staff members, they checked my references before offering me the position.", "Interview Questions": "Why are you interested in working for the Alzheimer's Association"}, {"date": "28 Jan 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Alzheimer's Association", "Interview Descriptions": "Interview process was simple. First, was screened via phone call and person on the phone took my interests and forwarded my application to the department that would fit me best.", "Interview Questions": "Why do you want to work here?"}, {"date": "11 Mar 2019", "title": "Event Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Association (Chicago, IL) in Dec 2018", "Interview Descriptions": "The process took about a month. It included 3 interviews, 2 phone and 1 in person. Everyone I spoke to was very nice and took time to answer all of my questions.", "Interview Questions": "How has working with a team taught you something about yourself?"}, {"date": "4 Nov 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Alzheimer's Association", "Interview Descriptions": "Two in-person interviews, not the most in-depth questions, talked about experience and minimally about the position, did not discuss company culture and values, process took one week. HR needs some communication improvement.", "Interview Questions": "Q: What kind of management style do you work well under?"}, {"date": "30 Sept 2018", "title": "Manager of Education Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association", "Interview Descriptions": "Straightforward, easy, comfortable enough. Now National is involved with hiring people so who knows how it is anymore. \r\nThey are friendly to try to rope you in to work for this terrible organization", "Interview Questions": "Asked about my past experience, work in Alzheimer's care"}, {"date": "11 Sept 2018", "title": "Senior Content Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alzheimer's Association", "Interview Descriptions": "There seems to be an extreme disconnect between HR and the hiring managers at this company. My experience dealing with the HR rep was wonderful during the process and she was very communicative with me during the process. \r\n\r\nThe problem arose when I came in for an in-person interview and discovered DURING MY INTERVIEW with the hiring manager that the content position was entirely web based. Nowhere in the job description or anywhere in the process was it mentioned that this was a web content writing position. \r\n\r\nI felt a bit cheated. I have vast web experience, white sheets, KPI's, and more that I would have loved to bring along to this interview had I know the true nature of the position. The head of the department seemed just as confused and frustrated as I did during the interview. I feel like the disconnect between departments ultimately lead to what otherwise could have been the start of a great partnership. \r\n\r\nI ended up accepting another position before hearing back about my candidacy for a third round interview. I emailed the HR woman to let her know that I was removing myself from the pipeline and never got a word back from them.\r\n\r\nUltimately, a unfortunate experience to go through with a company that I've idolized and respected for so long.", "Interview Questions": "What experience do you have with web content writing and SEO?"}, {"date": "26 Oct 2018", "title": "Executive Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Alzheimer's Association in Aug 2018", "Interview Descriptions": "Applied online, had initial call with screener, invited for a phone interview with the hiring manager. A few days later, was invited to in-person interview with hiring manager and local staff.  The hiring manager said he’d be in contact soon with next steps. Never heard from him, no further contact from screener. It’s disappointing that such an esteemed organization chooses to treat job candidates badly. I always view all job candidates as potential volunteers and treat them with respect.  My view of this organization has changed drastically based on this interaction.", "Interview Questions": "Describe how you changed “x state policy” to improve public health?"}, {"date": "29 May 2021", "title": "Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association (Grand Rapids, MI) in Aug 2018", "Interview Descriptions": "One phone interview and one in person interview. Phone interview lasted about 30 minutes. In person interview was done with a group of staff, including local colleagues and other members of the development team.", "Interview Questions": "Tell me about your fundraising experience, including your goals and how you achieved them."}], [{"date": "17 Sept 2018", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Alzheimer's Association (Chicago, IL) in Jul 2018", "Interview Descriptions": "I interviewed with the Alzheimer’s Association back in July. The overall process was a bit stressful but in an exciting way. I first did a computer/typing skills test using vignettes of callers calling in to the center.", "Interview Questions": "What clinical skills do you have ?"}, {"date": "5 Jul 2018", "title": "Office Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Alzheimer's Association (Providence, RI) in Jun 2018", "Interview Descriptions": "Had a phone interview with the HR manager, and an in person interview at the office a week later. I sent a thank you note to the person I interviewed with, as well as the HR manager, but never heard back.", "Interview Questions": "Why are you leaving your current position?"}, {"date": "5 Jun 2018", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Association (Longwood, FL) in May 2018", "Interview Descriptions": "Hiring Manager interview was friendly and relaxed.  follow up for interview with the CEO prior to decision made. General inquiries regards to skill set and experience. Two separate interviews", "Interview Questions": "What skills and qualities can you bring to this role? "}, {"date": "11 Jun 2018", "title": "Operations Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Association in May 2018", "Interview Descriptions": "Phone interview with HR. Second phone interview with area president and then followed with an in person interview with the area president. Basic interview questions and everyone I spoke with was very professional and friendly.", "Interview Questions": "What is something you've done that you are most proud of?"}, {"date": "11 Feb 2021", "title": "Accounting Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association (Chicago, IL) in Jan 2018", "Interview Descriptions": "There was a phone interview where they asked general questions about why I wanted to work there then I did an in person interview where they asked more in depth questions about the actual job to see if I could and would be willing to do it. They let me know it wasn’t an easy job which I didn’t mind because I wanted the experience", "Interview Questions": "What excel functions are you familiar with?"}, {"date": "26 Oct 2017", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Alzheimer's Association", "Interview Descriptions": "They are an EXTREMELY unprofessional and disorganized non-profit. The job I applied for was listed for 6 months. It took them 3 months after I applied to contact me. I had 2 phone interviews, and then I heard absolutely nothing from them when I followed up on the position. \r\n\r\nHow hard is it for HR to send a 2 line email saying I have been rejected? Why can't you show candidates basic human courtesy by responding to them? Is this how you treat Alzheimer's patients too??? Why would anyone ever want to work for you? Disgusting.", "Interview Questions": "What are your strengths and weaknesses? "}, {"date": "16 Aug 2017", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Alzheimer's Association", "Interview Descriptions": "Average is probably the best word. This was a phone interview. I was called 10 minutes late, from an unfamiliar number. The connection was terrible and I was regularly having to ask her to repeat the questions. Questions were fairly basic. None of the questions listed (here on Glassdoor) for this position or similar positions were asked.", "Interview Questions": "Why did I leave my last job?"}, {"date": "6 Jun 2017", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Alzheimer's Association", "Interview Descriptions": "Went well; scheduling took a bit. Looking forward to getting closer to being hired. Very flexible with interview requests. Very polite and welcoming. Spoke highly of the company.  Played phone tag fora bit, but finally connected with them. I had to pursue them a bit.", "Interview Questions": "Why ALZ? "}, {"date": "4 Apr 2017", "title": "Healthcare Outreach Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association in Mar 2017", "Interview Descriptions": "I applied through LinkedIn, and received an email the next day to schedule a phone interview. After choosing a time that worked I never received an email back. I emailed her the day before the supposed interview to confirm the time, and didn't receive a reply again. Anyway the day of there was no call, and I'm very appalled to see the unprofessional manner this was handled. I really loved the position I applied and was looking forward to interviewing, instead my time was wasted and was obviously not a priority to this company. Extremely disappointing.", "Interview Questions": "N/A"}, {"date": "22 Apr 2017", "title": "Constituent Services Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association (Seattle, WA) in Jan 2017", "Interview Descriptions": "I submitted an application, was contacted by the National Organization for a phone screening, was then referred on to the Chapter for an in person interview, had a second interview with a few additional employees, and then Nationals followed up to get a background check/start the on boarding process. While this sounds like a fairly straight forward process, in its entirety it took 3 months! It was also very clear that the chapter was not on the same page as nationals and vice versa. I was getting conflicting information and conflicting timelines from each.", "Interview Questions": "Why are you interested in working for the Alzheimer's Association? "}], [{"date": "23 Apr 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Alzheimer's Association (Birmingham, AL) in Jan 2017", "Interview Descriptions": "very easy. i sent an email that i was interested in working for a nonprofit. immediately got back to me to schedule a time to talk. i was able to schedule interview at my convenience. i was offered an internship at end of interview.", "Interview Questions": "Why non profit?"}, {"date": "17 Oct 2016", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Alzheimer's Association (New York, NY) in Oct 2016", "Interview Descriptions": "Phone Interview from applying online. I wasn't really impressed with the director or their qualifications but I was interested in coming from the for-profit side to see what it was like at a non profit. I did not feel that the person I spoke with was a professional but I felt they were very young and inexperienced even though they were a director.", "Interview Questions": "What is your biggest achievement in your career?"}, {"date": "17 Aug 2016", "title": "Programs and Outreach Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Association (Raleigh, NC) in Aug 2016", "Interview Descriptions": "Applied on ALZ.org & was called by HR in Chicago directs to schedule a phone interview with the supervisor in Raleigh, NC. Next step was face to face interview at the Raleigh office with the Executive Director, Associate Director (Programs and Outreach) and the Administrative Assistant. Interview was less than an hour long.", "Interview Questions": "Tell me a bit about yourself."}, {"date": "27 Jun 2016", "title": "Special Events Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Alzheimer's Association (Peoria, IL)", "Interview Descriptions": "Applied online and reviewed email from recruiter 1 day after applying.  Had interview 1 week from application. Interviewed worth Lisa Lee. Interview was 50 minutes.  I had a good rapport wit Lisa Lee.  I asked how long before next step.  Her response 'as soon as possible'.  I sent follow up thank you email,  but have not heard back.", "Interview Questions": "Why Alzheimers Association? What made you apply?"}, {"date": "6 Feb 2017", "title": "Communications and Marketing Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Alzheimer's Association (Timonium, MD) in Jun 2016", "Interview Descriptions": "Having taken care of a dad with dementia for 5 years, I felt I was a good fit to work for this NPO. I was one of 100 applicants for the job. During my interview with the local chapter Executive Director and the Director of Development, I was told half of the applicants didn't qualify for the position. I was more than qualified due to being a graphic design and marketing consultant for over 20 years. Additionally, I have a Masters degree in Marketing from a respected university.\r\nThe commute to this job would have been about 40-50 minutes on a route known for deadly and frequent accidents. I asked if I could come to the office at 9:15 or 9:30 or work from home once a week. I assured management they would get at least 40 hours/wk from me. This request was met with rejection, and I'm sure it's why I didn't get the job.", "Interview Questions": "Do you like being busy in the fall? The majority of their national fund raising events are September-late October."}, {"date": "19 Jun 2016", "title": "Director of Programs and Services Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Association in Apr 2016", "Interview Descriptions": "I submitted my application via email and received a call very quickly. I did well on the phone interview, and was invited for a in person interview. The in person will not happen until a week from now.", "Interview Questions": "Why do you want to work for this organization?"}, {"date": "12 Apr 2016", "title": "Events Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Association (Houston, TX) in Mar 2016", "Interview Descriptions": "First process was a phone interview. I seemed to have passed because the next day, an in person interview was scheduled with the team for later that week. I arrived and met a total of 5 people. Sent another thank you email and was told that I was being considered for another position. Great huh? Anyway, I was told that I would be meeting with the CEO because they wanted his input, thus 3rd interview. Instead of just meeting with him, I met with 2 other people included.\r\nThe interview literally felt like an interrogation. Although that was the case, I held my own. At one point, he asked me \"If you could work for any nonprofit, who would it be?\" Seriously?? I replied ALZ literally 3x before he backed off and stopped asking. After that, I sent out my thank you emails and didn't hear back for a couple of weeks. I was finally told that they were \"no longer looking to fill the position.\" A candidate shouldn't have to seek an employer out for an answer. Be respectful and get back to them. After this process, I'm glad I wasn't offered a position here.", "Interview Questions": "Why ALZ?\r\nWhat other nonprofit would you work for?\r\nDo you get bored easily?\r\nAre you afraid of dogs?"}, {"date": "5 Feb 2016", "title": "Data Entry Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Alzheimer's Association", "Interview Descriptions": "Was called in for an in-person interview with hiring manager/potential supervisor, potential team mate, and office manager. Interview was pretty standard - typical behavioral interview questions, \"how did you handle similar previous challenges?\", \"what are your software competencies?\" etc. Hammered me pretty hard on the \"do you see yourself here in 5 years?\" question, which was a little disturbing considering the job was entry-level. \r\n\r\nI was told after first interview that second interview was likely, therefore I didn't inquire about salary range as professional etiquette recommends waiting until second interview to do so (salary info was not posted on job requisition). I was then contacted abruptly by the affiliate's CFO (who I had not met previously) the following Monday morning who offered me the job and gave me less than 8 hours to accept. Salary offer was underwhelming and on the mid-to-low range of market value. \r\n\r\nTaking into consideration that I was offered very little time to consider the position, negotiate a higher salary, and was routinely made aware of possible red flags during in-person interview (frequent overtime, overwhelming workload) I declined the offer.", "Interview Questions": "What are your software competencies?"}, {"date": "1 Feb 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association", "Interview Descriptions": "Not a memorable interview, discussed position and office culture, and impact the organization has on the community. Program Manager and Human Resources manager sat in on the interview. Was not as nerve wracking as i thought it would be.", "Interview Questions": "IDK"}, {"date": "24 Apr 2018", "title": "Event Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Alzheimer's Association (Houston, TX) in Jan 2016", "Interview Descriptions": "I applied for an event coordinator position and had a phone screening with the event manager for that region. I thought our phone interview went well and they spoke as if I was going to have an in person interview given how they gave me details on how to get to their location. Discover my shock when I get an email that they did not want to pursue my application.\r\n\r\n2 weeks pass and I get an email from a different manager saying the person that interviewed me the last time passed along my resume and wanted me to come in for an in person interview. Its a group panel, and the manager is 10 minutes late but Im still hopeful this will go well. The manager just wasted my time and everyone else since after talking about how I felt my skills and my goals were a good fit for this place that they didn't think I would be a good fit based off of my resume.\r\n\r\nThe resume that you had time to go over and make that decision before you had me drive 50minutes to tell me that to my face.\r\n\r\nOverall, I had a horrible experience with this company, I have no idea what they want to do and as a person who has a family member suffering with Alzheimer's I personally felt this chapter does not even really care for family members suffering with this illness.", "Interview Questions": "What are your skills?"}], [{"date": "26 Sept 2017", "title": "Community Education Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Association (Melville, NY) in Nov 2015", "Interview Descriptions": "First Interview is with the chapter staff and then with Human Resources. Chapter management did a very good job of listing the requirements and left out the part regarding how use of creativity and experience was not allowed due to micromanaging ways.", "Interview Questions": "What is your connection to the disease?"}, {"date": "6 Oct 2015", "title": "Education Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Association", "Interview Descriptions": "Easy, conversational. The hiring manager, who was also my supervisor, is a very laid back person with a realistic view of the workplace. The job was explained thoroughly and I knew exactly what to expect. All in all a great experience; I have nothing negative to say!", "Interview Questions": "How do you manage conflict?"}, {"date": "29 Oct 2015", "title": "Special Events Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Association (Spokane, WA) in Oct 2015", "Interview Descriptions": "After a phone interview, I was interviewed in person by a small group, including one person on Skype.  They each had a list of questions and rotated asking them.  The person on Skype made notes during the interview.  They had a bottle of water waiting for me, which I really appreciated because my mouth gets dry when I'm nervous!", "Interview Questions": "How well do you work with volunteers?"}, {"date": "1 Sept 2015", "title": "Educator & Family Care Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association (Fort Worth, TX) in Sept 2015", "Interview Descriptions": "I sent in my cover letter and resume and was contacted almost immediately for a phone interview. The phone interview lasted approximately 30 minutes and was quite pleasant. The HR specialist informed me that she would forward my application on to the hiring manager. Overall it was a good experience.", "Interview Questions": "What do you know about the Alzheimer's Association services?"}, {"date": "30 Aug 2015", "title": "Intermediate Giving Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Alzheimer's Association (Chicago, IL)", "Interview Descriptions": "Provess was simple yet Lisa Lee had no idea what she was talking about... The CEO tries to intimidate you and will if/when you get hired. It was a very easy process and they do a poor job in screening potential candidates", "Interview Questions": "Why apply here?"}, {"date": "13 Aug 2015", "title": "Advocacy Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Alzheimer's Association (Chicago, IL) in Aug 2015", "Interview Descriptions": "The interview process is quite informal. I was surprised that a writing sample was not requested for a writing intensive position. When contacted for an interview, the full job description and a job application are emailed to you. Interview questions are just trying to get to know you. Candidates not selected are informed.", "Interview Questions": "How do you prefer to be managed?"}, {"date": "8 Oct 2015", "title": "Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Alzheimer's Association (Chicago, IL) in Aug 2015", "Interview Descriptions": "The phone screen was conducted by the hiring manager.  The questions presented were very brief and the interviewer was mostly concerned with my level of experience using Personify data base.", "Interview Questions": "How much experience do you have with Personify?"}, {"date": "17 May 2016", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Alzheimer's Association (Columbus, OH) in Aug 2015", "Interview Descriptions": "An employee referred me for the position. She and I worked together at a part time retail job. She passed my resume along. For the interview, I met with a woman that would become my direct supervisor. Three days later I met with the Chapter Executive Director.", "Interview Questions": "How long do you plan to be in this position?"}, {"date": "25 Aug 2015", "title": "Walk Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Association (Denver, CO) in Jun 2015", "Interview Descriptions": "A phone interview occurred first, followed by an in-person interview a week later.  The interviewer was very professional and was the same person in both cases. The interview lasted about an hour and a half and was very detailed and thorough. I felt the interview went extremely well and felt very qualified.  Unfortunately I received and email message just a day later that indicated I would not be continuing in the hiring process.", "Interview Questions": "How would you deal with a sizeable sponsor that had contributed for years but this year decided not to participate?"}, {"date": "23 Dec 2016", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Alzheimer's Association (Salt Lake City, UT) in May 2015", "Interview Descriptions": "I inquired about the internship through my college via email and sat down with the regional manager, only 1 time. We discussed why I wanted to intern for the alzheimer's association and other questions about my motivation and time obligations with my other college requirements. She was very helpful and extremely warm/friendly. They need a lot of help from volunteers so my decision to intern there was welcomed.", "Interview Questions": "Why do you want to intern for this organization?"}], [{"date": "14 Apr 2015", "title": "Community Relations and Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Association", "Interview Descriptions": "The interview process was pretty straight forward and moved quickly. I applied online and received an email inviting me for a further interview. I was unable to do an in person interview so the interview was conducted via skype and went fantastic. Typical questions about background, experience and why I wanted to work for them.", "Interview Questions": "Why do you want to work for us?"}, {"date": "20 Apr 2015", "title": "Family Support Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Alzheimer's Association (Denver, CO) in Apr 2015", "Interview Descriptions": "Emailed resume and cover letter.  Was called within a week fir an in-person interview.  Didn't make it to round 2 interview, but the process was very positive.  They worked hard to put me at ease and there were no dumb \"what color bird would you be/ what did you eat for lunch\" type questions,", "Interview Questions": "What is your learning style?"}, {"date": "14 Jun 2016", "title": "Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Alzheimer's Association (Indianapolis, IN) in Apr 2015", "Interview Descriptions": "Very positive and casual. Did not feel nervous or pressured in the interview. On the negative side - I did not hear back from them after the interview, even as a rejection.", "Interview Questions": "Why are you interested in working for a nonprofit?"}, {"date": "1 Apr 2015", "title": "Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Association", "Interview Descriptions": "Very straight forward questions, nothing to out of the ordinary. The interviewer was very nice and was very passionate for the organization. Great experience overall. Started with a 30 minute screening and then an in person interview. Then was contacted for another phone interview and then was offered the position", "Interview Questions": "why do you want to work for the Alzheimer's Association, tell me about your background"}, {"date": "10 Jan 2015", "title": "Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Alzheimer's Association in Dec 2014", "Interview Descriptions": "Interview was LONG (1.5 hours). They had a standard set of approximately 21 questions that they asked every candidate. There were 3 individuals in the interview panel - the Executive Director, the Development Director and one other. Each of them took turns asking one of their standardized questions. Each person in the interview ranked the candidate on a scale of 1 - 5 based on their responses. The panel then gave an opportunity for questions from the candidate.", "Interview Questions": "Please explain one instance in which you worked with volunteers and the desired outcome was not being met. How did you deal with the volunteer? What was the outcome of that interaction?"}, {"date": "16 Nov 2014", "title": "Development Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Association", "Interview Descriptions": "Initial phase is a telephonic interview with the HR Department, standard employment and experience questions. Second phase was with local Chapter Director and was more in depth regarding specific skills and experience. Third phase was again with the Chapter, this time with a committee comprised of employees and volunteers. Focus was on work ethic, experience and compatibility with co-workers and volunteers. Fourth phase was with the National HR Director. Final interview was with the District Special Events Director.", "Interview Questions": "How have you improved an existing program or event in a previous organization?"}, {"date": "30 Aug 2015", "title": "Public Relations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Alzheimer's Association (Worcester, MA) in Nov 2014", "Interview Descriptions": "I had a twenty minute phone interview. It was very quick and painless, the woman I spoke with was very easy to talk to. She offered me the position before it was over.", "Interview Questions": "What I am looking to learn with an internship with the association."}, {"date": "31 Jan 2017", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Alzheimer's Association (New York, NY) in Nov 2014", "Interview Descriptions": "The process began with a Phone Screen, then proceeded In-Person Panel Interview with a Writing Test, and ended with an Interview with the Chapter CEO. They also did ask for and call each of my three references.", "Interview Questions": "Are you connected to the disease?"}, {"date": "17 Oct 2014", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Association (Dallas, TX)", "Interview Descriptions": "Multiple interviews including a final one with the CEO. It is very important that you are a member of the team who compliments the team well. You will be introduced and interact with many people throughout the interview process.", "Interview Questions": "What value can you bring to our current staff that we do not already have?"}, {"date": "4 Sept 2014", "title": "Executive Director Chapter Level Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Alzheimer's Association", "Interview Descriptions": "Initial interviews are by phone\r\nMost contact is from HR rather than with the hiring supervisor\r\nDid not get a chance to see actual facilities during interview process\r\nFinal interview at national headquarters", "Interview Questions": "Questions were as expected"}], [{"date": "11 Dec 2014", "title": "Special Events Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Association in Aug 2014", "Interview Descriptions": "Applied online, received call back within three weeks, and interviewed the next week. Process was quick and easy. Meet with two senior members of department to learn more about the role and their needs. Over all it was a good description of the actual work and felt like a good match.", "Interview Questions": "Always tricky being asked about connection to disease... for me I have one so I shared. "}, {"date": "13 Nov 2015", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association (West Palm Beach, FL) in Jul 2014", "Interview Descriptions": "Two interviews, The first one was with a direct supervisor and HR and then the second one was repetitive, except with the CEO present.  The process happened relatively quickly and took place within two weeks.  The interviews lasted approximately 1-2 hours and each person asked specific questions on the panel.", "Interview Questions": "Discussing previous experience."}, {"date": "11 May 2015", "title": "Reception, Clerical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Alzheimer's Association (Las Vegas, NV) in Jun 2014", "Interview Descriptions": "The interview process was long, intimidating,scary, wasn't what I was in store for so many people asking me question that didn't have to much to do with the position, I started sweating feeling kind of nervous with the observing of the panel of individuals on the question's being asked.", "Interview Questions": "Why should we hire you?"}, {"date": "19 May 2014", "title": "Manager, Special Events Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Alzheimer's Association", "Interview Descriptions": "I filled out the online application and followed up on the phone with the office contact about setting up the interview. They emailed me back, I came in for a face to face interview, asked me normal interview questions. Called me soon after for a second round of interviews and then got offered the job.", "Interview Questions": "Why should we hire you over anyone else?"}, {"date": "30 Apr 2014", "title": "Marketing and Communications Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Alzheimer's Association (New York, NY)", "Interview Descriptions": "I was contacted via emailed and an interview was set up for the following week. I met with the woman who would be my direct supervisor and then two other employees that I would also be working with if I were offered the job. The interview was very relaxed - all typical questions that you would expect.", "Interview Questions": "Salary expectations were asked in the initial interview and I was a bit thrown."}, {"date": "8 Jun 2016", "title": "Development Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Association (Honolulu, HI) in May 2014", "Interview Descriptions": "Applied. Got a call from the ED who did the screening within 3 days. Scheduled an in person interview with Program Coordinator the next week (3 person interview). After we passed that, got a call to schedule a second interview with PC and his supervisor (Asst. Director). A few days later, I got the job offer and headed in for drug testing and paperwork processing.", "Interview Questions": "1. Job History \r\n2. How would I react if a coworker started gossip about office and coworkers/boss. "}, {"date": "12 Mar 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at Alzheimer's Association", "Interview Descriptions": "One interview with CEO. Internship was very unsatisfying.", "Interview Questions": "All questions were behavioral and based on past experiences."}, {"date": "5 Dec 2016", "title": "Development Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Alzheimer's Association (Dayton, OH) in Mar 2014", "Interview Descriptions": "I walked into the office and asked to meet directly with the Development Director. After a quick 15 minute meeting, she encouraged me to apply for one of the Walk Coordinator positions. I sent my application, resume and cover letter that afternoon and was given a phone interview two weeks later. Upon the conclusion of the phone interview, I was invited back to meet with the other Development staff the next week. After that interview, I was again invited back to meet with the Executive Director and after 3 interviews over 6 weeks, I was offered the position because I had been the only candidate to send a handwritten thank you note.", "Interview Questions": "How would you respond to a prospect if they turned you down and how would you turn it into a yes?"}, {"date": "27 Feb 2014", "title": "Development Specialist Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Alzheimer's Association", "Interview Descriptions": "After applying, a phone interview was conducted to get to know me.  The interviewer was very pleasant and engaging.  The interviewer asked relevant questions about the position and my resume.  The next step was to conduct a face-to-face interview, which took longer to schedule than planned, but only by a few days.  This was a little frustrating, but people do get busy and some things have to be re-prioritized.", "Interview Questions": "What did you do with your time when unemployed (in college or high school too)?"}, {"date": "27 Aug 2018", "title": "IT Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Alzheimer's Association in Feb 2014", "Interview Descriptions": "Panel interview with leadership team. Must prepare a 90 day plan and present at interview.  Some leaders texting during interview.  That's the most of it. Pretty demanding interview for such low paying job. Can you tell me a little about yourself? ...\r\nHow did you hear about the position? ...\r\nWhat do you know about the company? ...\r\nWhy do you want this job? ...\r\nWhy should we hire you? ...\r\nWhat are your greatest professional strengths? ...\r\nWhat do you consider to be your weaknesses?", "Interview Questions": "N/A"}], [{"date": "12 Jan 2017", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Alzheimer's Association (Chicago, IL) in Nov 2013", "Interview Descriptions": "Casual interview.  Nothing tricky.  Had a phone interview and then in-person interview with two other staff members.  Interview lasted about an hour to an hour and a half.", "Interview Questions": "Tell me about your background"}, {"date": "24 Dec 2013", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Alzheimer's Association (Los Angeles, CA) in Jun 2013", "Interview Descriptions": "The hiring and interview process consisted of a question and answer of simple questions as to why I wanted to be a volunteer. Followed by a back round check. I did notice that almost everyone on staff was Jewish. Though that did not bother me because I can work with any ethnicity.", "Interview Questions": "There was nothing unexpected or difficult about the interview."}, {"date": "5 May 2013", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Alzheimer's Association (Chicago, IL)", "Interview Descriptions": "Over a month from start to offer", "Interview Questions": "None were difficult"}, {"date": "22 Mar 2013", "title": "Senior Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Alzheimer's Association (Chicago, IL)", "Interview Descriptions": "Applied for a position and it took about a month for them to connect with me.  I had an initial phone screening that lasted about 20-30 mintues.  Asked me various basic questions about my experience and past employment.  About a week later I was asked to do an in person interview with the person that would oversee my position.  That interview was about 45-60 mintues.  Again, background, getting to know me, personality check.  After that I had a 30 minute group interview with a few people whom were to be on my team.  More casual, getting to know you feel.", "Interview Questions": "There really wasn't any difficult questions.  More about my background and experience and what I could bring to the position.  "}, {"date": "10 Jan 2013", "title": "Events Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Association", "Interview Descriptions": "The process begins with a phone call to give an overview of the position and make sure you're really interested. Next will be another phone call or in-person interview with the Regional Director and she will ask situational questions regarding how you would handle certain scenarios. Finally you will meet with the Executive Director, Regional Director and Director of Development and be asked pretty much the same questions again.", "Interview Questions": "The questions are really not terribly difficult if you have any event experience at all in the non-profit industry. I suppose the hardest was \"How do you prevent corporate sponsor fatigue/event overlap?\""}, {"date": "11 Dec 2012", "title": "Development Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Alzheimer's Association", "Interview Descriptions": "I was contacted within three weeks of submitting my application materials. The interview process consisted of a phone and in person interview.", "Interview Questions": "There were no difficult or unexpected questions. "}, {"date": "22 Jun 2015", "title": "Graphic Design Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Alzheimer's Association (Saint Louis, MO) in Aug 2011", "Interview Descriptions": "Interview was to the point, scheduling was flexible. Everyone was very warm and welcoming. I was not judged as a student, but a professional. I applied online and was contacted by phone to schedule an interview. I went in, had a one on one and was called a few days later and offered the position.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 Mar 2015", "title": "Development Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Alzheimer's Association (Houston, TX) in May 2011", "Interview Descriptions": "I interviewed over 2 days.  I met with one person the first day.  I met with 3 people the second day.  Before the second interview I was briefly stuck in the elevator.  Then the air conditioning was not working in the office.  The interview occurred during May in Houston; it was extremely hot and unpleasant in that office.", "Interview Questions": "They asked about my prior education, work experience, and what kind of job I was looking for. "}, {"date": "22 Nov 2013", "title": "Regional Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Alzheimer's Association (Sacramento, CA) in May 2011", "Interview Descriptions": "Applied online, 2 rounds of interviews", "Interview Questions": "N/A"}, {"date": "8 Nov 2011", "title": "Grant Investment and Accounting Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Alzheimer's Association (Saint Louis, MO) in Mar 2011", "Interview Descriptions": "After I applied for Alzheimers' Association, I quickly get phone interview. After the phone conversation, they decided ask me to their office to have a face to face interview. During the interview, they asked me general question and question about my filed of study. My advice is be prepared.", "Interview Questions": "Have you ever had a conflict with a boss or professor? How was it resolved? "}], [{"date": "7 Aug 2012", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Alzheimer's Association in Mar 2011", "Interview Descriptions": "overall it was easy..questions and answers. Basic test were taken. Interviewed and got a offer about a week later but they made sure they informed me that there were still making decisions", "Interview Questions": "N/A"}, {"date": "28 Apr 2011", "title": "Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Alzheimer's Association in Feb 2011", "Interview Descriptions": "Interviewer was very distracted. Asked typical interviewing questions (why do you want to work here? what do you know about the organization? etc). Interview lasted about 2 hours. Never heard from interviewer again after this interview.", "Interview Questions": "What do you know about this organiztion?"}, {"date": "20 Nov 2009", "title": "Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Alzheimer's Association (Morgantown, WV) in Oct 2009", "Interview Descriptions": "Was contacted via phone by HR recruiter.  Then 1:1 interview which lasted only 15 minutes.  Later received offer and accepted.", "Interview Questions": "What makes you more qualified than other candidates for this position?"}, {"date": "30 Aug 2009", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Alzheimer's Association in Jun 2008", "Interview Descriptions": "Everybody was very friendly, and asked fair questions during the interview.", "Interview Questions": "Experience working with diverse groups of people"}]]