[[{"date": "28 Jun 2023", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "Great experience. It was a panel of three interviewers. They each took turns got question and asked generic questions, about myself, personality, and scenarios. They also talked a lot about their benefits.", "Interview Questions": "An example of giving bad news to a customer."}, {"date": "21 Jun 2023", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Easy, 6 people in one interview. The first screening was with the HR manager over the phone. The second screening was with faculty and staff. Personal and situational questions. Ask about how to collaborate with outside vendors.", "Interview Questions": "Why the University of Utah? What do you think about diversity?"}, {"date": "6 Jun 2023", "title": "Student Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "The interview process may seem daunting, but it is quite the opposite. You first are interviewed by other members of the department and the second (and final) interview is with the director and the associate director.", "Interview Questions": "Give us an elevator pitch for this student program. A student comes in asking about our services, what do you say?"}, {"date": "20 Apr 2023", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "no response after interview even after sending emails asking for the recruitment progression twice. The search committee is not patient during the interview and repeated remind me that they only have 20-30min", "Interview Questions": "routine questions you can find online."}, {"date": "22 Feb 2023", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah", "Interview Descriptions": "Apply online and ask professor who you want to work for. Email your resume to the department manager to get the desired TA position. Apply to the positions before hand and don't wait for the last moment.", "Interview Questions": "Tell me about yourself and your experience if any. Then they ask about the knowledge about particular subject. They look for people who knows about the subject."}, {"date": "11 Feb 2023", "title": "Software Developer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Feb 2023", "Interview Descriptions": "There was a phone screening followed by a panel interview and technical assessment. Offer extended over email without any previous conversation about compensation. All was pretty easy and the technical assessment was only a w3 schools quiz/test", "Interview Questions": "They mostly covered resume and experiences"}, {"date": "27 Apr 2023", "title": "Director of Events Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah (New York, NY) in Feb 2023", "Interview Descriptions": "The interview process was virtual which was very good. However, after four interviews, the company ghosted me. They told me they were going to now call my references and then I would have one more interview. I received an email shortly after saying they were a little behind and they would get back to me in a week. By four weeks later I assumed they were no longer interested. After all of that they could have at least had the decency to tell me I was no longer in the running.", "Interview Questions": "I was asked to develop a mock event."}, {"date": "30 Dec 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Interview process began with a Screener with two staff members followed by second interview with larger group. Interview lasted 45 minutes with time for me to ask questions as well. Received offer the same day.", "Interview Questions": "What interests you about this position?"}, {"date": "28 Nov 2022", "title": "Admissions Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "It was a 2 step process. The first was getting to know you interview over the phone that lead into an in person interview which was done with a few members from their management team.", "Interview Questions": "Simple questions like why did I want to work there, what were my strengths, describe a time I had to navigate conflict with a co worker or client."}, {"date": "14 Nov 2022", "title": "Career Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "I had a multi-interview process which included a phone call with the search committee, a virtual meeting with the search committee and a virtual presentation to the entire department. All and all it was an inclusive and comprehensive process.", "Interview Questions": "Why are you interested in this position? Tell me about a time when you had a conflict with a co-worker or friend."}], [{"date": "12 Nov 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah", "Interview Descriptions": "After completing the online application, there was a panel interview with 3-5 people. The process of the application, interview, and hiring took less than a month. There was a lot of helpful information given by the recruiter beforehand. The entire process was straightforward.", "Interview Questions": "- Tell me about yourself - What interests you about us - Difficult challenge and how you overcame it - Previous experience and how it can be used in the new role"}, {"date": "24 Oct 2022", "title": "Operarions Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah", "Interview Descriptions": "It was fairly quick and easy. I don’t think it was longer than 20 minutes. We talked about work life and expectations and then they offered me the job based on my previous work experience.", "Interview Questions": "How would you handle thing going wrong during one of your tasks?"}, {"date": "6 Nov 2022", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Utah in Oct 2022", "Interview Descriptions": "I got a call and then a phone interview. They asked about why I wanted to apply for the school, a brief introduction and they introduced their departments briefly. They have asked me to share a work crisis I've dealt with and what I have learned from it.", "Interview Questions": "Tell me about a time when you made a work mistake."}, {"date": "26 Sept 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Online, oral interview via Zoom. Multiple faculty members of the review panel were involved in the interview. Questions were mostly subject-related. There are some tough question and some easy question.", "Interview Questions": "experience and the salary of  the job"}, {"date": "19 Jul 2022", "title": "Director of Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jul 2022", "Interview Descriptions": "Great process. It was efficient and timely and they were very responsive. There were two rounds - first via zoom and the second in persons. Majority of questions, during both rounds, were behavioral based.", "Interview Questions": "- Tell us about you and why this job? \r\n- Share how you manage conflicting priorities?"}, {"date": "10 Jun 2022", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Microsoft Teams interview with HR and supervisor. Each took turns asking questions.  Later another manager called with additional questions.  She gave me her phone number to call with additional questions", "Interview Questions": "Tell about a time you made a mistake"}, {"date": "3 Jun 2022", "title": "Library Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2022", "Interview Descriptions": "Is easy and chill, nothing really going on you kinda just get the job as a student here. Just submit some information and meet the basic skill bar, and you would be good. Is a student-only job.", "Interview Questions": "There is not much a interview"}, {"date": "7 Jun 2022", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2022", "Interview Descriptions": "Two interviews, one in person the other online.  Was a very comfortable interviewing process.  Appreciated the up front approach of the interviewers. Was able to express my abilities as well as discuss the potential for growth within the company and where it can take a potential employee.", "Interview Questions": "How well can I prioritize needs of department."}, {"date": "29 Mar 2022", "title": "Front Desk Person Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Was held over zoom but was professional and efficient. Done by two people, who both asked questions. Were honest about the expectations and clear when I would hear back. I did not have my answers already written, but the questions that were asked were generic interview questions.", "Interview Questions": "What do you look for in a supervisor? "}, {"date": "31 Jan 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "During the interview, I was asked to present my previous work first. Then we talk about the project I will be doing during my Ph.D. study, and the skills required for this project.", "Interview Questions": "What is your plan for your PhD study?"}], [{"date": "17 Aug 2022", "title": "Administrative Asssistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Feb 2022", "Interview Descriptions": "Applied online. Received an email invitation to interview by phone Phone interview was followed by a zoom interview with the admin manager. Zoom interview with the admin manager was followed by a third peer interview on zoom as well. Withdrew from the process after the third interview.", "Interview Questions": "Describe how you prioritize many competing priorities?"}, {"date": "26 Jan 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Did not get an interview until I called. First interview was zoom, second was in person and like 8 hours long. Did not receive an answer until 6 weeks later.", "Interview Questions": "What makes you unique for this role?"}, {"date": "7 Jan 2022", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Received a phone call for scheduling an interview and met with a manager for an interview. They asks basic behavioral questions then ask you to solve some math problems from basic algebra to calculus.", "Interview Questions": "How would you handle a difficult situation with a coworker?"}, {"date": "4 Jan 2022", "title": "Scheduling Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Phone interview  quick and multiple people. I had two interviews on the phone they. It was during the day  I don’t have any more word to describe this subject  but I can keep typing if you need", "Interview Questions": "Average questions, not hard but a little specific to their job. "}, {"date": "4 Dec 2021", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Utah (Salt Lake City, UT) in Oct 2021", "Interview Descriptions": "The interview process was pretty chill. The people conducting the interview were understanding and friendly to talk with. I got asked questions specific to the post of Academic advisor as to how you would react to some situations.", "Interview Questions": "How would you respond to a student given certain situations?"}, {"date": "13 Sept 2021", "title": "Marketing Communications Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Utah (Salt Lake City, UT) in Aug 2021", "Interview Descriptions": "It took 1 hour and I interviewed three interviewers.  The overall atmosphere was calm and comfortable but most of the interview questions are quite critical and focused on the past projects that I've done.", "Interview Questions": "Based on your prior experiences, tell us about the project that you really liked and you don't like."}, {"date": "11 Jul 2022", "title": "Program Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2021", "Interview Descriptions": "A series of questions that are  delivered via email to which the recipient must respond by a specific deadline. They seem to often contact individuals who qualify directly to ask them to apply.", "Interview Questions": "Do you want to help peers in the program by using your experiences to inform others? How many students are you willing to mentor/how long? Would  you be willing to participate in events during afternoon hours in-person."}, {"date": "13 Aug 2021", "title": "Recruiting Coordinator, Online MBA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2021", "Interview Descriptions": "I had my first preliminary interview. It was a simple phone call and I was invited to come back for a Zoom interview to meet with the rest of the hiring team.", "Interview Questions": "How do you handle stressful situations at work?"}, {"date": "9 Jul 2021", "title": "Biostatistician II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Utah", "Interview Descriptions": "First, a phone call from a recruiter/administrative assistant. Second, a phone interview with the biostatistics manager which included behavioral questions and technical questions, such as: Describe a 95% confidence interval. Describe a p-value to someone who is a non-statistician. A hypothetical linear regression model with a dummy variable for gender in which I was asked to calculate the coefficient for males. Ways to reduce a 95% confidence interval.  I had to take an additional statistical quiz (20-30 minutes) since I barely passed the technical parts of the phone interview. This quiz was mostly on basic SAS programming (less than, greater than...etc.). Third, a full day in-person interview with lunch where I spoke to all the faculty and several biostatisticians in the department. One faculty member had me go through several technical exercises/problems with him, the rest were more casual conversations.", "Interview Questions": "Describe a 95% confidence interval and p-value to a non-statistician."}, {"date": "25 Jun 2021", "title": "Program Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "The interview process was 30 minutes and focused on behavioral questions interested in my leadership and engagement style. This interview included quite a bit of information on the role, and what appeared to be minimal evaluation of the candidate.", "Interview Questions": "What is your leadership style?"}], [{"date": "17 Jun 2021", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Two on site meetings. One with group other with the leader.  Actually did away with position and did not fill it. Very nice people and very knowledgeable about their subjects.", "Interview Questions": "How do you handle stress, team leadership questions, etc."}, {"date": "14 Jun 2021", "title": "Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "It was fairly straight forward, we were give an online interview process where you record yourself answering 3 questions. You can redo it as many times as you like. Then I talked in person with the manager.", "Interview Questions": "Honestly I dont remember sorry"}, {"date": "21 Mar 2021", "title": "Research Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "The interview was informal but detailed and lasted for most of the day, which was expected for the position I was applying for.  I did get to meet the entire research team, which was invaluable for making the decision to work there.", "Interview Questions": "Describe how you would solve an interpersonal problem"}, {"date": "9 Mar 2021", "title": "Data Entry Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Slow to start the interview process, I didn't hear anything for about a month after applying. I didn't get the job but everyone was nice. I've reapplied for another position since, am still waiting for a response.", "Interview Questions": "What is the best and worst part of working from home?"}, {"date": "5 Mar 2021", "title": "IT Help Desk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Had one phone call, explained the position and what it entailed. Interviewer brought up pay and was much lower than expected. Did not receive 2nd interview and that was o k.", "Interview Questions": "Asked me about general experience"}, {"date": "11 Apr 2023", "title": "Academic Advisor Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Mar 2021", "Interview Descriptions": "Application on line, on site interview with two team members with influence on decision, One Zoom meeting, in person interview, phone interview with two more people. Each interview was one on one except the in person meeting.", "Interview Questions": "Tell us about yourself Why do you want this job? What are your goals?"}, {"date": "10 Oct 2021", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Utah (Salt Lake City, UT) in Mar 2021", "Interview Descriptions": "Sent CV and letters of recommendation/Transcripts and all the required documents . Then I was informed I was on of the few chosen . Within a wek I was Interviewed on zoom by three Professors.", "Interview Questions": "On methodology based on my 30 years of experience teaching. "}, {"date": "16 Mar 2022", "title": "Facility Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Utah (Salt Lake City, UT) in Mar 2021", "Interview Descriptions": "Apply with resume and cover letter then interview with hiring team. The job requires you to have worked for the university for 2 semesters at least and you must be a supervisor or above.", "Interview Questions": "What is a way you would solve problems x, y, z"}, {"date": "5 Jan 2021", "title": "Radiation Safety Analyst I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah", "Interview Descriptions": "I had 2 interviews.  The first one was with the director.  It was the normal casual interview of getting to know me.  The second interview was a group interview and was intense.  They asked more questions on my knowledge in radiation and science.  Lasted 1 hour.  Intense but definitely worth it.", "Interview Questions": "What are the units of radiation?"}, {"date": "12 Dec 2020", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "I was interviewed at a conference for a postdoctoral position at University of Utah. I has 2-3 meetings during the conference. I was asked about my work, what I want to do in future and some behavioral questions.", "Interview Questions": "About my PhD thesis work and some were about soft skills I have."}], [{"date": "8 Feb 2021", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Dec 2020", "Interview Descriptions": "Fast, courteous, and professional and they were very kind in the whole process.  Did some of the only background checks I noticed. Panel interview, asked technical and managerial questions, and also asked about hobbies.", "Interview Questions": "How do you manage multiple priorities at once?"}, {"date": "17 Dec 2020", "title": "Medical Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Nov 2020", "Interview Descriptions": "It was really balanced, but stressful and long. I think the school should have less MMI questions and make the interview process a maximum of two hours. The whole thing required 5 hours.", "Interview Questions": "Ethical and behavioral questions in various circumstances"}, {"date": "23 Feb 2021", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Utah (Salt Lake City, UT) in Sept 2020", "Interview Descriptions": "Contact the Prof. who has open research positions.\nSend your CV to the Prof.\nTalk to the Prof. you will work with --- discuss your interest in the project and the abilities you have.", "Interview Questions": "Q: Why would you like to work on the Project?"}, {"date": "26 Aug 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "It was a friendly group interviewing me. Very welcoming and asked good questions relating to the work. They were professional and very well organized. The got back to me in a timely manner.", "Interview Questions": "What background I had in data management"}, {"date": "17 Jul 2020", "title": "Biostatistician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah", "Interview Descriptions": "Introductory interview with one of the biostatisticians mainly simple questions about why I wanted to work there, some basic stats question. Then a follow up test with some simple stats questions agains very similar to the first phase except some more SAS questions.", "Interview Questions": "How would you create a frequency table in SAS"}, {"date": "7 May 2020", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at University of Utah", "Interview Descriptions": "Got called in twice. First round was a group interview. Last one was about a week later, one on one. First it was just casual and get to know you, then technical discussions. Both about an hour. Was final candidate, but budget issues caused the job to be removed and absorbed by another department. Very nice people and explained everything to me.", "Interview Questions": "Tell us about a time you failed at something"}, {"date": "20 Apr 2021", "title": "SQL Database Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah in Apr 2020", "Interview Descriptions": "Started with a 45 min Oracle SQL test.  I had used Postgres before and didn’t know some of the Oracle jargon. Then standard HR questions. The entire process was long.  It was weeks between each step.", "Interview Questions": "What do you do to improve a process?"}, {"date": "12 Feb 2020", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "No interview, you just need to talk to the department and they will let you sign a contract if you are a graduate student. For enrolled into that , you will answer some questions about your research work...", "Interview Questions": "No interview"}, {"date": "4 Apr 2022", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Feb 2020", "Interview Descriptions": "They will contact you for a phone screen for 10 to 15 minutes, after that will be notified if they want to complete a virtual interview with you. They were very flexible on planning dates for an interview", "Interview Questions": "How well do you work with others and how do you communicate with customers. "}, {"date": "24 May 2023", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2020", "Interview Descriptions": "I had a first round Phone interview after submitting my CV and research statement and was then invited to give a science talk at the university as well as meet one on one with a number of researchers and staff.", "Interview Questions": "Describe research experience and research vision"}], [{"date": "3 Apr 2021", "title": "Associate Director of Housing and Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (Castine, ME) in Dec 2019", "Interview Descriptions": "It was great! Phone interview to start and then a thorough in person. Coordinated and paid for travel, were very gracious throughout, and excellent questions. Long day but they made it pleasant.", "Interview Questions": "What area of diversity  do you need to work on/learn more about?"}, {"date": "9 Jan 2021", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Dec 2019", "Interview Descriptions": "Short interview with the director, then a written exam, about half an hour chat with future team members. I was told there will be a project to do as second interview, but I didn’t attend coz I got another internal offer already.", "Interview Questions": "Why do you like this position？"}, {"date": "5 Nov 2019", "title": "Applications Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Nov 2019", "Interview Descriptions": "Uploaded resume and cover letter, answered basic questions, then was required to take a 45 minute \"assessment\" of sorts.  Questions about how you work and react to situations.  Critical thinking drills.", "Interview Questions": "Give an example of a time when you identified a process that needed to be improved upon and how you made that improvement."}, {"date": "28 Sept 2020", "title": "ESL Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Oct 2019", "Interview Descriptions": "After submitting a resume and cover letter through the university website, I had two in person interviews: 1) short in person interview which was 1:1 and 2) a mock lesson presented to the staff followed by a brief Q&A.", "Interview Questions": "Describe your teaching philosophy."}, {"date": "15 Mar 2022", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Utah (Salt Lake City, UT) in Sept 2019", "Interview Descriptions": "I did not have an interview. It was just a meeting with manager to discuss job responsibilities and pay. Very low-key and more focused on what was to come in the future", "Interview Questions": "What kind of experiences do you have.\r\nWhat are you interests regarding your major (Computer Science)"}, {"date": "15 Mar 2022", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Utah (Salt Lake City, UT) in Sept 2019", "Interview Descriptions": "I did not have an interview. It was just a meeting with manager to discuss job responsibilities and pay. Very low-key and more focused on what was to come in the future", "Interview Questions": "What kind of experiences do you have.\r\nWhat are you interests regarding your major (Computer Science)"}, {"date": "15 Aug 2019", "title": "Media Production Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2019", "Interview Descriptions": "Received an email to schedule a phone interview.  Completed that. Followed up twice expressing interest and was offered a second in-person group interview.  Notified the following day I was not selected.", "Interview Questions": "Why do you want to work here?"}, {"date": "30 Aug 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2019", "Interview Descriptions": "Came in for one interview, spoke with the hiring manager. Was then invited back for an interview with the team. They were friendly, asked multiple questions and made me feel comfortable.", "Interview Questions": "How organized am I? Give examples "}, {"date": "4 Sept 2019", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2019", "Interview Descriptions": "Emailed weeks after, asked to come in for one on one interview. Culture seems good, and there seemed to be a total of 3 marketing coordinators in the Office of Admissions (where I applied). They seemed to provide on the job training, but expected a good deal of experience for the low pay of the position.", "Interview Questions": "How have you applied your marketing skills?"}, {"date": "6 Oct 2020", "title": "Special Events Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jul 2019", "Interview Descriptions": "It began by applying online the they asked me to come in for an interview. It was me with three employees in the department. After that they narrows it down and and had me submit a project.", "Interview Questions": "Why do you want this job? "}], [{"date": "21 May 2019", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "Very good interview questions. Good manners and I was very impressed with the hiring committee and the questions they asked as well as an explanation of what they expected from their employees. Great experience interviewing", "Interview Questions": "What can you bring to the table"}, {"date": "5 Apr 2019", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Nothing much I applied for a phd position and the professor took the skype interview.\r\nHe told me he would be wiiling to fund my phd after a week.  d", "Interview Questions": "experience"}, {"date": "15 Mar 2019", "title": "Usher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Utah", "Interview Descriptions": "The employer uses phone interviews to identify and recruit candidates for employment. Phone interviews are often used to narrow the pool of applicants who will be invited for in-person interviews.\r\nThe first in-person job interview is typically a one-on-one interview between the applicant and a hiring manager. The interviewer will ask questions about the applicant's experience and skills, work history, availability, and the qualifications the company is seeking in the optimal candidate for the job.", "Interview Questions": "what is your availability for work?"}, {"date": "13 Feb 2020", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Utah in Mar 2019", "Interview Descriptions": "Reviewed and analyzed a data set involving healthcare data. Prompt was to determine which region the company should open new clinics and why. There were multiple questions to guide the thought process. Final interview involved walking through this case and explaining recommendations. Some fit questions.", "Interview Questions": "Tell me about your case slides. Why did you make the recommendation that you did? etc."}, {"date": "13 Apr 2019", "title": "Data Warehouse Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Utah (Salt Lake City, UT) in Mar 2019", "Interview Descriptions": "The first interview, I was interviewed by three people,one holding the same level position I was applying for. It was mostly structured, with them reading questions from a paper. The technical portion was more free-form. The second interview was with higher management and seemed to be to check personality fit.", "Interview Questions": "Tell us about a time you were asked to do something you think is unethical by management."}, {"date": "14 Jan 2019", "title": "Computer Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah", "Interview Descriptions": "I applied online thru the University of Utah job website and the process took about 2 weeks. The interview type was 1:1 interview. After the interview, I heard back from them in 2-3 hours.", "Interview Questions": "what work environment are you most comfortable in"}, {"date": "15 Jan 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (South Jordan, UT) in Dec 2018", "Interview Descriptions": "It was a long process. I applied in October and was called to see if I was still interested in December, but it was only a week or two between steps following the first interview. \r\n\r\nThey were really great to interview with- very thorough, made sure I knew what was expected for the position, asked if I had any concerns and were happy to answer any questions I had.  They definitely put me at ease and made me feel comfortable. You can tell they are all passionate about what they do and want to hire quality employees.", "Interview Questions": "How I prepared for the interview, what  I knew about the company, that particular clinic, etc."}, {"date": "30 Nov 2018", "title": "Clinical Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "I had two interviews. The first was with the two research managers and the second was a group interview.  Both interviews were straight forward and short. Not a challenging interview process.", "Interview Questions": "Standard interview questions"}, {"date": "5 Nov 2018", "title": "Bio Statistician I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah", "Interview Descriptions": "Submitted resume and cover letter, references, answered other descriptive questions. 1-hour interview one on one with hiring manager and had to complete timed statistical test to see stats abilities. Asked about previous experience, asked statistical questions, and described the job responsibilities and benefits.", "Interview Questions": "What are your greatest strengths?"}, {"date": "22 Apr 2022", "title": "Marketing Coorindator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Nov 2018", "Interview Descriptions": "I had 3 interviews over two months with multiple team members and in different settings. Very formal with group interviews and individual interviews. A tough interview process. Ended up getting the job but it was stressful and time consuming.", "Interview Questions": "What experience do you have in Marketing? How would you handle a difficult client?"}], [{"date": "19 Jan 2019", "title": "Software Design Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Utah (Salt Lake City, UT) in Oct 2018", "Interview Descriptions": "I'm very much aware of the delay that takes place in hiring at the University of Utah but this one was excruciatingly slow. I got called for an initial behavioral interview and then a take-home coding test and later a technical panel interview.  Well, I hate to say this but there is no clarity in the process and the team that I interviewed with, was the least professional outfit I have ever dealt with.  The letter that I received from the recruiter gave vague reasons about why I was not selected (after waiting for more than 3 months) and without informing me, they considered me for a position which I didn't even apply for (Software Design Engineer-Senior). \r\n\r\nI was asked basic-advanced questions related to Java and a lot of questions related to Threads in Java, SQL, and some Spring questions.\r\n\r\nIf you have got time to spare, apply at your own risk, and never wait for an outcome.", "Interview Questions": "Multithreading in Java."}, {"date": "4 Sept 2018", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah", "Interview Descriptions": "No phone interview, went straight to campus interview. The interview included a job talk and 5-6 individual meetings with faculty plus a very nice dinner with 2 faculty. I found everyone to be very warm and welcoming, enthusiastic about my work and very helpful in guiding me around during the interview.", "Interview Questions": "What kinds of research projects would you do here?"}, {"date": "8 Aug 2018", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "Take GRE\r\nComplete online application (free application which is really nice)\r\nYou may be invited for an interview (they pay for you to travel to SLC, UT, they put you up in a hotel, pay for all your food, and take you skiing (if you don't want to ski/snowboard, they have other activities you can participate in).\r\nThey inform you of their admission decision", "Interview Questions": "Tell me about your research"}, {"date": "27 Jan 2020", "title": "Reporter Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2018", "Interview Descriptions": "Interviews were scheduled over the phone or video chat. The final interview is in person. They fly out you and pay for lodging which is nice. They also give you a moment to meet with other reporters which is helpful to gain insight on what the newsroom is really like.", "Interview Questions": "They asked about past experience, reporting interests, investigative skills. "}, {"date": "30 Jun 2018", "title": "Administratoin Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Utah in May 2018", "Interview Descriptions": "Phone call, group call interview, simple questions, quite courteous, too bad no one ever followed up on the interview. Never expected this school would conduct an interview and leave an applicant just wondering what happened. Obviously, no job offer but a courtesy rejection email would at least allow applicants to move on. Leaving it to linger seems so contrary to the school mission and public facing statements about their hiring practices.", "Interview Questions": "How do you deal with stress? "}, {"date": "21 Jun 2018", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Apr 2018", "Interview Descriptions": "They contacted me quickly and were very professional. They set a time and worked around my schedule so that we could meet. They were very friendly and open and honest regarding the position.", "Interview Questions": "Why I would be a good fit. "}, {"date": "1 Nov 2018", "title": "Ios Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Mar 2018", "Interview Descriptions": "Got an e-mail back after a few weeks of my online resume submission for an in-person interview. Straightforward technical questions about data structures and algorithms were asked during the interview and I got the job the same day.", "Interview Questions": "How long have you been working with iOS?"}, {"date": "22 Dec 2017", "title": "Materials Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Utah", "Interview Descriptions": "Professional interview in an outdated facility. Sat in a conference room with three other project managers. They took turns asking questions. It was average paced and comfortable. I do not recall all of the details of the interview.", "Interview Questions": "N/A"}, {"date": "22 Nov 2017", "title": "Producer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Utah", "Interview Descriptions": "No interview process. There was no interview or application process. Jobs are handed to students that the directors believe will be a good fit. One day I received an email regarding an open position and if I was interested. I replied that I was interested and the following week I began working.", "Interview Questions": "N/A"}, {"date": "1 Nov 2017", "title": "Part Time Teller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Utah", "Interview Descriptions": "They would ask about your previous experiences, how can you relate to students from various backgrounds, and if you are willing to work for a full 12 months minimum in the position.", "Interview Questions": "The questions that starts with \"What would you do if...?\"."}], [{"date": "28 Oct 2017", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah", "Interview Descriptions": "Applied through online and received call for an interview. Interviewers are nice and they will get you very comfortable but put yourself in a position that they must hire you.", "Interview Questions": "Why should we hire you?"}, {"date": "6 Oct 2021", "title": "Career Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Sept 2017", "Interview Descriptions": "First interview was conducted by manager and peer level career coach.  Questions were mostly behavior based, professional development, and career goals.  2nd interview was a presentation to the entire coaching team.", "Interview Questions": "What have you done for your own professional development in the last 6 months?"}, {"date": "12 Mar 2021", "title": "Fullstack Dev Bootcamp Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Utah (Salt Lake City, UT) in Sept 2017", "Interview Descriptions": "Had a phone screening to discuss my qualifications, asked some technical questions as well as some behavioral questions. Later, I met with the dean of the school under which this bootcamp was operating.", "Interview Questions": "What would your friends say about you?"}, {"date": "28 Oct 2021", "title": "Admisisons Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2017", "Interview Descriptions": "The interview was full of very professional questions but with a fun, more relaxed environment. They really took the time to not only understand your work experience and how you would fit into the role but to learn about you as a person as well.", "Interview Questions": "They wanted to know how I saw myself fitting into the role?"}, {"date": "7 Jun 2017", "title": "HIM Tech Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah", "Interview Descriptions": "It was a group interview with all applicable supervisors and some staff with whom the position has interacts. While everybody was very friendly, the interview itself was very disorganized and haphazard.", "Interview Questions": "What would you do in a situation where a manager was not easily available (i.e. after hours/weekend) and you did not readily know how to proceed in said situation?"}, {"date": "4 Aug 2017", "title": "Biostatistician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2017", "Interview Descriptions": "First interview: Phone call. For the first 40 minutes I was asked about different projects on my resume, and some questions with my work experience. Then I was asked a series of statistics questions to test my knowledge.", "Interview Questions": "What test would you use to determine if two categorical variables are independent?\r\n"}, {"date": "25 Jan 2018", "title": "Commuter Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Utah in Jun 2017", "Interview Descriptions": "It was good, easy and comfortable I had to go into the office and I was interviewed by two people.  I got an offer for a job different than the one I originally applied for, but I took it and was promoted to the job I applied for a few months later.", "Interview Questions": "general character questions"}, {"date": "24 May 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Utah", "Interview Descriptions": "The interview process at the University of Utah for a Teaching Assistant position is very informal. Majority of the time you need to have previously taken the class that you would be working with. The exception to the rule is if you have taken multiple similar courses to the one that you would be assisting, or you’ve taken courses from the same teacher. Getting to know your teachers and program leaders is the best course of action for landing these jobs.", "Interview Questions": "Why are you interested in this position?"}, {"date": "30 May 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at University of Utah in Apr 2017", "Interview Descriptions": "I had two phone interviews with the professor whose research team I would be joining. No technical questions, just determining if I was a good fit.  Once the interviews were done, I was given a verbal offer over the phone.", "Interview Questions": "What previous lab experience have you had?"}, {"date": "2 Jun 2017", "title": "Recruiting Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Apr 2017", "Interview Descriptions": "The first round was a phone interview. The second round was an hour-long interview with two sets of two interviewers who asked the same set of questions. After the second interview, I didn't hear back for almost three weeks, even with a follow-up. Two of the interviewers were friendly and receptive, but the other two were fairly difficult to get any feedback from.", "Interview Questions": "How did you solve a challenging leadership situation?"}], [{"date": "12 Feb 2018", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Apr 2017", "Interview Descriptions": "I had 2 interviews: one with members of the education team (other advisors) and the administrative manager, followed by an interview with the Division Chief and 2 Associate Chiefs.", "Interview Questions": "Tell how you prioritize tasks when there are many things to be accomplished."}, {"date": "15 Mar 2017", "title": "Recruiting Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Mar 2017", "Interview Descriptions": "Great interview process. One phone interview and two in person with a total of seven people. I've worked in HR for the past 4+ years so interviews aren't too foreign to me, but I think it was a pretty easy process. Nerve-racking waiting for the response though!", "Interview Questions": "Describe your current job duties?"}, {"date": "20 May 2017", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2017", "Interview Descriptions": "Received a call after I submitted my resume. Met with two different people from the department and had an hour long interview. Received a call back on Monday and was hired by the end of the week.", "Interview Questions": "What does social media mean to you?"}, {"date": "12 Oct 2018", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2017", "Interview Descriptions": "Submitted TA application online and wait for notification. Then the professor to teach that class sent me an email for making an interview appointment. I had a face to face interview with him at professor's office.", "Interview Questions": "When would I graduate and what grade I got for the class. "}, {"date": "19 Jul 2021", "title": "Intellectual Property Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2017", "Interview Descriptions": "Was easy and straightforward. Applied online, received a call and had a phone interview, and was subsequently asked to interview on site. Met with the tech transfer team, was given an exam to determine my attention to detail. Took roughly two hours on site.", "Interview Questions": "Why I wanted to work in IP?"}, {"date": "5 May 2017", "title": "Communications Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Dec 2016", "Interview Descriptions": "Interview was on the phone and was very opinionated.  I could tell I was just a 'number' to be supplied.  I found out later, they already had a person for the position.", "Interview Questions": "Asked about writing background, experience in years, and social network competence."}, {"date": "15 Oct 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "meet 3 professors individually, talk ~ 30 minutes in their offices, talk about my own research experience , why I am interested in working with them, ask them questions about their research", "Interview Questions": "Mark asked me one question: Do you use vi or emacs?"}, {"date": "15 Jun 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Utah (Salt Lake City, UT) in Sept 2016", "Interview Descriptions": "I was shortlisted for a phone screen after which i was asked to come down to the office in order to interview for the position. The in person interview was kinda similar, i was asked questions about based on my resume", "Interview Questions": "Etl concepts"}, {"date": "4 Mar 2018", "title": "Study Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 6 days. I interviewed at University of Utah (Salt Lake City, UT) in Sept 2016", "Interview Descriptions": "I completed the job application online and then emailed the supervisor, whom I'd met about 18 months prior. I was called in for an interview that day. I was called back for a second interview the next day and accepted an offer about 3 days after that.", "Interview Questions": "Why are you leaving your job?"}, {"date": "10 Aug 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "The interview included all the basic background and experience questions. Primarily about my educational background and testing my medical knowledge.It was a telephonic and then other round had skype interview. Afterward, i got the offer letter,", "Interview Questions": "Why utah ?"}], [{"date": "4 Oct 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2016", "Interview Descriptions": "Some behavior questions and technical questions. Some algorithms question like linear programming.  Which language do you prefer? It is not so hard, but you really need to prepare for this position. Take a look at some relevant materials. Since I am a part time graduate student research assistant, it would not so hard.", "Interview Questions": "Which language do you prefer?"}, {"date": "30 Jul 2017", "title": "Senior Accountant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Jul 2016", "Interview Descriptions": "Telephone interview and second interview in person.  The current supervisor and another coworker at the same level took turns asking questions the University Human Resources had prepared.  They did not ask follow up questions nor did they ask specific questions regarding my previous position at the University.", "Interview Questions": "What do you want to be when you grow up?"}, {"date": "23 Jul 2016", "title": "Receptionist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2016", "Interview Descriptions": "U of U's invitation for an interview is a miracle. But if the miracle happen, there were three people asked me about ten questions. Questions were also in front of me on the table in a conference room. It took about 30 minutes. They were nice, I couldn't tell what they think during the interview. There is almost no chance to get the job. They usually already have their person for that position.", "Interview Questions": "They asked about multitasking, my hobby, situational questions like for example: 3 phones ring and boss need something important and somebody just came and want something at the same time - how would you handle it, or why they should hire me."}, {"date": "29 Jul 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2016", "Interview Descriptions": "I sat down with the floor manager and the clinical nurse coordinator in the managers small office. Positive people, with kind hearts, who don't seem to know much in general.", "Interview Questions": "What is your experience level."}, {"date": "14 Apr 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in May 2016", "Interview Descriptions": "I submitted my CV. After two weeks I got contacted by the professor. He asked me to meet with him and asked me some professional questions. And two weeks later, I received the offer.", "Interview Questions": "What is your future plan?"}, {"date": "25 Aug 2017", "title": "Executive Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in May 2016", "Interview Descriptions": "Fill out an application online through a job portal, submit a resume, cover letter and list of references. Interview over the phone. Group interviews in person.  Received offer letter.", "Interview Questions": "Where do you see yourself in 5 years? What are you doing now? Why did you leave your last job? What can you bring to this position? What are some of your strengths?"}, {"date": "11 Apr 2018", "title": "Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Utah (Salt Lake City, UT) in May 2016", "Interview Descriptions": "student job, asks basic questions- career goals, skills, walk through your resume, etc. Usually skills from your major are applicable to the position, technical questions as well, what you expect to learn from this position, what do you bring to the table that other applicant won't.", "Interview Questions": "What are you looking to gain from this position?"}, {"date": "2 Jan 2018", "title": "Administrative Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in May 2016", "Interview Descriptions": "I graduated college on a thurday and i applied for this position on friday. got called in the afternoon to do an interview, went and did it, left and got called 5 mins later offering me the position. Many other places on campus take over 3-4 months to hire, this one was quick", "Interview Questions": "What experience I have"}, {"date": "11 Jun 2016", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Utah (Salt Lake City, UT) in May 2016", "Interview Descriptions": "I applied Tuesday morning and was emailed that afternoon to schedule an interview for the following Tuesday. I was offered the position the following day. During the interview I was not asked many questions and was not given a tour of the facilities, which initially worried me. I was introduced to the staff and had an opportunity to ask them a few questions. The interview lasted approximately 20 minutes. My references were called the day after the interview just before I was offered the position.", "Interview Questions": "Tell me about yourself."}, {"date": "13 Jan 2020", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Utah (Salt Lake City, UT) in Apr 2016", "Interview Descriptions": "had a skype interview with my advisor and two other members of the graduate admission committee for about 45 minutes. Answers general questions and talked a bit about my plan for my Ph.D. and why did I choose the University of Utah.", "Interview Questions": "Why am I passionate about astrobiology?"}], [{"date": "22 Mar 2016", "title": "Marketing Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Mar 2016", "Interview Descriptions": "It was a 15 minute phone interview regarding experience and skills. Answered questions and gave details on experience with staff management, data reporting, public speaking skills, and creative abilities. Invited to ask my own questions regarding the position, and after careful review of their website, I had questions on their sponsor base, management team dynamics, and then we discussed the compensation scale.", "Interview Questions": "Pr Skills, data reporting skills"}, {"date": "16 Jan 2016", "title": "APC- Nurse Practitioner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2016", "Interview Descriptions": "well planned, one candidate before a panel of 1 PA, 1 physician, and 1 practice manager.  Initially applied online, then contacted by practice manager for a phone screen/preliminary interview.  A follow up interview before a panel was scheduled the next week.", "Interview Questions": "What can you offer/bring the group?"}, {"date": "26 Feb 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2016", "Interview Descriptions": "Was technical and not that difficult mostly focussed on SQL and previous work experience and also the empoyer ws keen to see how enthu i was about joining the team.", "Interview Questions": "Informatica mappings, power center details"}, {"date": "19 Jul 2016", "title": "Clinical Study Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2016", "Interview Descriptions": "I was given a phone interview within 2 weeks of applying for the job, and then brought in for an interview with the clinical study coordinators and the doctor I would be working with. The in-person interview was only half an hour.", "Interview Questions": "What would you do if you were confused about a task?"}, {"date": "21 Dec 2015", "title": "Business School Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "One 20 minute Skype interview that turned into an hour. The interviewer was pleasant and I felt a rapport and was surprised to get a call that I hadn't been chosen due to a \"lack of leadership experience.\"\r\n\r\nI felt grateful for the honest opinion, but it got ugly when I asked how I could have better explained my years of leadership experience in the military and as a business owner. The conversation turned into a lame defense of how many veterans the interviewer knows, followed by an attack that I don't really understand the current Utah economy.", "Interview Questions": "Explain the current Utah economic situation."}, {"date": "15 Apr 2016", "title": "Data Analyst Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Utah (Salt Lake City, UT) in Dec 2015", "Interview Descriptions": "The interview was very casual. It was more like a discussion on my experience and the job position requirements. Also they explained the tools that they are using and they explained the process, audience and various other aspects of the organization.", "Interview Questions": "Do you have experience as a manager?"}, {"date": "23 Nov 2015", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "6 interviews in one day. That night they organize a dinner with poster session from current students. This is also important, as a lot of faculty and program directors may have an eye on you. The next day you are with senior PhD students for an activity.", "Interview Questions": "Previous research"}, {"date": "5 Jan 2017", "title": "Study Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Nov 2015", "Interview Descriptions": "Interview process lasted about an hour. From first interview to actual hiring took approximately 6 weeks. As an internal transfer, the process was easy. All of my info was already within the system and transferred over easily.", "Interview Questions": "Why I'm interested in the position "}, {"date": "16 Nov 2015", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Oct 2015", "Interview Descriptions": "The first is the phone interview. Then there is the first onsite interview. This interview is interviewed by the group. If you pass the first onsite interview, you will be invited to the second round interview. This time the partners will also interview you for the qualification. For all these interviews, the interviewers usually asked the behavior questions. In the second round interview, they also test you for some technique questions.", "Interview Questions": "How the team work means to you?"}, {"date": "27 Jan 2019", "title": "Conference Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Oct 2015", "Interview Descriptions": "I applied and then was contacted by email to schedule a phone interview with the department supervisor. Two days later was an in-person interview, followed by a second interview with the department manager.", "Interview Questions": "What is something that you have failed at? What did you learn from it? "}], [{"date": "12 Sept 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "It was a typically behavioral-based interview, no hard questions. Questions were like tell me about yourself, what would be your tutoring strategy, why do you want to be a tutor, etc.", "Interview Questions": "tell me about yourself"}, {"date": "4 May 2018", "title": "Psych Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Sept 2015", "Interview Descriptions": "I had about 5 people interviewing me, manager of the unit, a couple RNs from the unit of interest and a couple psych techs from the unit. They went around asking questions and made it comfortable. The manager called me 30 mins later offering me the position.", "Interview Questions": "Describe a difficult situation you had with a coworker in the past, and how you resolved that issue. "}, {"date": "16 Sept 2015", "title": "Behavioral Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 6 days. I interviewed at University of Utah (Salt Lake City, UT) in Sept 2015", "Interview Descriptions": "I applied with excellent credentials and work history. After followup I got the email stating \"look somewhere else.\" So I'm taking them up on it. No sense in waisting time.", "Interview Questions": "What did you do about stress?"}, {"date": "8 Oct 2015", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Sept 2015", "Interview Descriptions": "I applied through the University's website and it took a total of 2 weeks which included a week to work on a design exercise. My first interview was with my potential supervisor and the marketing director. The second interview was with the rest of the marketing team, including my supervisor (3 people).", "Interview Questions": "What is your process for graphic design?\r\nWe discussed some of the projects in my portfolio and my thought process.\r\n\r\nHave you ever had a client not like a piece you've created that you loved?\r\nWe discussed my process for the design exercise."}, {"date": "14 Feb 2017", "title": "Accounting Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Utah (Salt Lake City, UT) in Sept 2015", "Interview Descriptions": "I went to buy textbook for my class and my cashier was the Accountant supervisor for the Bookstore at the time. Then, we were chatting and I told her that I'm in the Accounting program. She told me that they have a position open online and asked me to apply for it. Therefore, I applied online and few days after, I got a phone call for interview. I went to the Bookstore for interview with the Accountant supervisors, then they told me to wait for a response from a phone call.", "Interview Questions": "Why you want to work here?"}, {"date": "3 Aug 2015", "title": "Training Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "Group interview, 2-3 managers, possibly 1-2 co workers.  There was a brief introduction to the group.  I then gave my presentation, it was to be 15 minutes.  I was then asked many of the standard questions posed during an interview.  I also had a chance to ask questions to the group.", "Interview Questions": "Why do you want to work here?"}, {"date": "18 Feb 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2015", "Interview Descriptions": "It is based on previous courses you take or relevant experience in the subject applying for. Talking to  professors teaching the course directly helps rather than just applying online. Recommendation fro research professors or from whom you have taken the class is helpful.", "Interview Questions": "Nothing unexpected"}, {"date": "9 Oct 2015", "title": "IT Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2015", "Interview Descriptions": "One initial phone interview.  Two and three panel interviews with 3 rounds.  First IT Directors.  Second entire IT team.  Third 3 major customers position will serve", "Interview Questions": "Describe a difficult situation and how you handled it."}, {"date": "19 Feb 2016", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2015", "Interview Descriptions": "we had an appointment at 1 but she made a mistake. so there was two interviewee even though it was not the multi people interview. he asked general questions like what would you do in the particular situations. the interview was very easy. I had interview at the warehouse with two people. both were nice and questions were very easy to answer.", "Interview Questions": "general questions"}, {"date": "5 Jan 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2015", "Interview Descriptions": "I met with the professor I would be TAing for. He just asked me why I wanted to be a TA. And asked me how I did in the class I would be TAing.", "Interview Questions": "Why would you like to be a TA?"}], [{"date": "14 Oct 2017", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2015", "Interview Descriptions": "After I have received the work study grant, I applied through the University of Utah's career website for work study jobs specifically.  Afterwards, I received an interview through the specific department that I applied for.  When I went to interview, it was primarily focused upon whether I would be a good fit for the job or not.  Afterwards, I waited a couple of days and received an offer afterwards.", "Interview Questions": "What kind of experience do you have with the tasks the job description has?"}, {"date": "23 Sept 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2015", "Interview Descriptions": "People were required to submit their resume and the selected candidates were interviewed further.\r\n\r\nThe selected candidates were interview by two professors. They needed some with with computer organization background and someone with software practices background. People were required to know c and c++", "Interview Questions": "What is IEEE floating point representation"}, {"date": "30 Dec 2015", "title": "GIS Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jul 2015", "Interview Descriptions": "Applied online.  Did a phone and in-person interview.  Never heard from them again.  Had to call HR to ask about the position.  At least have the professional courtesy to follow-up with those you interview, even if it is to decline.", "Interview Questions": "What did I know about the university?"}, {"date": "16 Sept 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jul 2015", "Interview Descriptions": "Applied online, I took some of the course in the past semesters. I had gathered some cleanroom experience. Then talked to the professor who was in charge of the TA assignments. He reviewed my resume and I got the job.", "Interview Questions": "Asked question about basic microfabrication processing"}, {"date": "6 Nov 2016", "title": "KC Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2015", "Interview Descriptions": "The interview was super chill. They asked basic questions about you and what field you study in. They also asked if you have any computer skills and how comfortable you are with costumers.", "Interview Questions": "What experience do you have with technology?"}, {"date": "16 Feb 2017", "title": "Help Desk Agent Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2015", "Interview Descriptions": "The interview process with University of Utah was better than most, but made me realize the department I was joining lacked a good vetting process for new employees. I went through a brief series of phone calls and e-mails, followed by a short, in-person interview with department supervisors. The interview process felt very rushed overall due to an immediate need to fill a position, but was not unpleasant.", "Interview Questions": "What would you do if you didn't know how to solve a problem?"}, {"date": "15 Oct 2015", "title": "IT Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2015", "Interview Descriptions": "First there was a phone interview, then I had an interview in person. The questions were very to the point, and they try to find ways to incorporate additional skills and knowledge you may possess, and ask you to relate those abilities to the job you are applying for, or how you feel better prepared as a result of them.", "Interview Questions": "I was asked to look at different prints of code samples, and to identify what they did."}, {"date": "22 Sept 2016", "title": "Web Developer III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2015", "Interview Descriptions": "The first two times we scheduled for the interview ended up being postponed. When the interview finally did happen, it started with one of the project's leaders, who was joined by the principal leader a short time later. This part of interview was friendly and conversational, I felt completely at ease. After about an hour, they brought in the two developers already on the project to check my technical skills. We did a few white board exercises and exchanged a few ideas on how to test a developer's skill. Following that, the project lead came back in and we continued the social fit portion of the interview. In the end, he asked me if I wanted the job and told me he'd hire me right there, but had to go through the proper channels. Two days later I got a call from the recruiter that sent me in with an offer that more than met my goals.", "Interview Questions": "Given a specified set of tables, write a SQL query to retrieve data from a RDBMS."}, {"date": "9 May 2015", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "I met the PI of the lab and discussed the research focus of the lab and potential projects. I then met with members of the lab to discuss their projects and then gave a 1 hour presentation of my graduate work.", "Interview Questions": "What about this lab's research focus interests you?\r\nDo you or will you have your own funding?\r\nWould the \"weird\" reputation of Utah pose any issues for you?"}, {"date": "15 Dec 2015", "title": "Sales Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at University of Utah (Salt Lake City, UT) in May 2015", "Interview Descriptions": "They took a very long time to interview me and extend an offer letter. I was hired a total of 10 weeks after my first initial interview, with a two week break in between each of the following interviews (4). I met with everyone on the team, and the job they described in the interview process is much different than the one I'm performing on a daily basis.", "Interview Questions": "Tell me something that isn't on your resume.\r\n\r\nWhy are you interested at working at the University of Utah?\r\n\r\nHow many hours a week are you accustomed to working?\r\n\r\nWhat is something that people perceive of you, that isn't true?"}], [{"date": "29 Jan 2016", "title": "Contractor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in May 2015", "Interview Descriptions": "We went over my CV, as well as several case scenarios that I may encounter in my position.  Additionally, we discussed my transcripts and reviewed the different classes I took while pursuing my advanced degrees.  There was not a lot of idle time during the interview, and I really got a sense of urgency in regards to the position - as well as the gravity associated with performing well for the University and also for those whom I would be serving.", "Interview Questions": "Q: Given the case we have outlined, how would you begin this project?"}, {"date": "22 Jul 2016", "title": "Software Design Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Utah (Salt Lake City, UT) in May 2015", "Interview Descriptions": "I was mainly asked to explain the architecture of one of the Systems that I have built in my previous company. Also, I was asked with certain questions related to Spring and Hibernate in JAVA. Mostly, questions were focused on the previous projects.", "Interview Questions": "How does Autowiring process occur in the Spring framework?\r\nHow a Many to Many Association is performed in Hibernate ? etc.."}, {"date": "2 Jun 2015", "title": "Executive Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at University of Utah (Salt Lake City, UT) in May 2015", "Interview Descriptions": "The entire process took 2-3 Business Days.  I was an employee referral, and met with the Administrative Manager and the Department Chair/Professor face-to-face to discuss qualifications, background and job duties.", "Interview Questions": "What are your long term goals (i.e. two years)?"}, {"date": "1 Mar 2017", "title": "Data Entry Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Utah (Salt Lake City, UT) in Apr 2015", "Interview Descriptions": "I applied for 3 positions and got called on 1 of them for an interview. It was about 2-3 days after I submitted my application. They called on a Friday afternoon and my interview was scheduled for that next Monday afternoon. There was only metered parking and they offered to provide cash for reimbursement. I was interviewing with 3 people and they alternated asking me questions, it took about an hour. It was a very positive experience. I was offered the position the next afternoon and started a week later.", "Interview Questions": "What is the most important thing you need from management?"}, {"date": "31 May 2015", "title": "Bookstore Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Utah (Salt Lake City, UT) in Apr 2015", "Interview Descriptions": "I thought it was not too hard. It's pretty quick, but they do ask a good amount of questions. It's very important to be on time, in fact, early is best. Dress to impress and speak clearly, especially since this position is a lot of talking with customers.", "Interview Questions": "How is your knowledge of Apple and PC products?"}, {"date": "18 Apr 2015", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah (Randallstown, MD) in Mar 2015", "Interview Descriptions": "A Skype interview with a panel of three people - Assistant Dean for Undergraduate Affairs and two other academic advisors that work with the same academic areas as the position. They asked questions about dealing with challenging situations with students, advising philosophy, and professional strengths and weakness. They were very pleasant, seemed engaged, and were frank about the challenges of the position. I was offered a second round interview, but I had to refuse the offer since I had accepted a job offer in the interim.", "Interview Questions": "Describe how you would handle a student in crisis."}, {"date": "24 Jul 2018", "title": "Artist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2015", "Interview Descriptions": "I applied through an employee referral. I interviewed at the University of Utah. No interview process. There was no interview or application process. Jobs are handed to students that the directors believe will be a good fit. One day I received an email regarding an open position and if I was interested. I replied that I was interested and the following week I began working.", "Interview Questions": "N/A"}, {"date": "22 Oct 2018", "title": "Lab Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2015", "Interview Descriptions": "the interview was very casual, I got to meet the members of the lab, the manager of the lab gave me a tour while explaining the research going on at that specific lab, then I got to meet and interviewed the PI, he was pretty relaxed,  the question lead towards getting to know me and my career background, I wasn't nervous at all.", "Interview Questions": "where do you see yourself in 5 years from now?"}, {"date": "18 Dec 2014", "title": "Software Design Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Utah in Dec 2014", "Interview Descriptions": "3 rounds. Applied through university website. Got call from HR after a week. They scheduled technical phone interview with the team. Happy to got the call from her on the same day for face to face round which they scheduled for next week. Met the team and manager.\r\n\r\nAfter face to face got a call from them to meet the director of the department. Got the offer next week !!", "Interview Questions": "Mostly technical question and some behavioral questions."}, {"date": "10 Nov 2014", "title": "Resident Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at University of Utah", "Interview Descriptions": "Resume submission, group interview that was spread across 2 3-hour sessions, 2 in-person interviews. They watch you very carefully during the group interview to see how you are interacting with people. Being a follower and not being positive about the tasks they gave us were the two biggest things that eliminated people. The tasks themselves were pretty pointless (build a city out of blocks) and were just to see how we interacted with a group.", "Interview Questions": "\"How would you deal with complaints you don't know how to handle?\""}], [{"date": "31 Oct 2014", "title": "Scanning Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "This was a great interview experience.  I had all interviewers ask very useful questions without feeling overwhelmed.  There were 6 people interviewing me and i was able to give insight into how I could help each of their departments, which was useful in allowing my future coworkers to understand my work ethic.", "Interview Questions": "Who will win the U.S. Open?"}, {"date": "24 Aug 2015", "title": "Facility Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Utah (Salt Lake City, UT) in Oct 2014", "Interview Descriptions": "The hiring process takes a little while. Started with phone interview, then there was an interview with the hiring manager. After that, there was another interview with the hiring manager and the department director. Overall it took about 2 months from the day I applied online to the day I started working for the department.", "Interview Questions": "What is one capital project that you have completed and what was your method of completing the project?"}, {"date": "1 Feb 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Oct 2014", "Interview Descriptions": "Over skype, friendly easy.. focused on my Cv. career interests in my specific field This was an easy process. I did not expect everything to fall in place easily. It did not, there were a lot of verifications required, but finally everything came through", "Interview Questions": "Background, interest in the subject , future goals etc"}, {"date": "1 Oct 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "The depatment emailed me about the position. I applied. About 5 of us were interviewed. The interview happened a week after the job position was posted. One of our professors took the interview wiht a client, who was from the chemistry department.", "Interview Questions": "What is cache coherency"}, {"date": "30 Aug 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Utah", "Interview Descriptions": "There are two ways to get your feet in the door. Either doing a detailed research and contacting faculty members prior to officially submitting your application For that here's my suggestion. 1) Do your homework ahead of time and make a thorough research on different programs, colleges at which you would like to pursue a degree 2) Once you can be more specific about what you want to do, what kind of research interests you figure out the best faculty members that fits the field you would like to do research in 3) Make sure you update your CV (must be detailed,  several pages for someone who has completed college, worked a job at least for a year or two) and look into sample cover letters to make sure to include why you are applying to specific program. It is crucial to link how your previous experience would make you a good fit to the program you are applying. Even if you don't have any experience in the field, be enthusiastic, original and show you know where the field is going, or at least show interest in doing research in the field (be sure to include reasons and justifications for that). It is not easy to write these letters so, that's why if you have any chance to attend conferences, workshops related to the field try to do that. At least use the internet effectively to get a better sense of why that field of research is important and how you see yourself contributing to the field once you are accepted to the program.", "Interview Questions": "I met my adviser at an international conference, and prior to attending the conference I already knew he was going to be there and I was well prepared to introduce myself, hand out my CV and tell him why I was interested in joining his research group. Since it was not a formal interview, he liked my proactive approach and things went well (simply because he had a project he needed to find a graduate student to work on) "}, {"date": "20 Aug 2014", "title": "Postdoctoral Scholar Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Started working in the same place where I got my doctorate. Based on my performance in previous years I got this offer. So no specific interview process or questions to me for this job.", "Interview Questions": "Based on previous performance I got this job"}, {"date": "8 Oct 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2014", "Interview Descriptions": "I was interviewed by a team within the School of Music. I was contacted pretty quickly afterward.  It was a little difficult to find the building with my GPS, but I called and they were able to walk me to the building. They gave me a tour, and told me what they expected.", "Interview Questions": "They asked why I would like to work for them."}, {"date": "2 Apr 2016", "title": "Print Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2014", "Interview Descriptions": "Thorough but very quick to give feedback. Management was quick to respond with offer and I accepted. Training was good and thorough and the employees were always kind and caring. Great place to work for a student.", "Interview Questions": "Questions related to how you would deal in a customer discrepancy over unfinished work, defects, or misprints."}, {"date": "23 Jul 2014", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "Resume submitted, committee interview, hiring supervisor interview, job offer. Had previously worked with the supervisor during a mufti institutional event.  Knew he would be an exceptional boss. The hiring committee was diverse but generally identified the need for improved customer service.", "Interview Questions": "Most challenging part of current position."}, {"date": "21 Jul 2014", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Utah (Salt Lake City, UT) in Jul 2014", "Interview Descriptions": "It took them 3 months after I applied for them to call me.  When they did I was asked to come in and take a test that included questions about SQL, Excel, and problem solving.  After taking the test it only took a couple of days fro them to call me for an interview.  The odd thing was that both times they called, for the test and the interview, they just had me write down the address and time and never sent me a confirmation email with all the details.  \r\n\r\nThe actual interview had the typical interview questions like \"explain a time when you had to confront a colleague.\" It was a very standard interview and they seemed bored and uninterested to be there from the very beginning, even though I felt like I gave good answers and tried to liven it up a little.  There were two financial analysts and one person from HR in the interview.  They explained all of the job functions and so-called benefits of working for them.  The benefits really just included the same things that every other company has, namely a couple of weeks of PTO a year, 401k match, Health Insurance, and a few Holidays off.  Nothing spectacular.  They said that the next step would be to meet with their boss if he chose to and then they would make their decision.  It was about a week and a half later when I received an email indicating that they were not going to select me for the job.  \r\n\r\nOverall I was unimpressed with the organization of the interview process and the company seemed very bureaucratic.", "Interview Questions": "If there are eight cubes that all look the same, but one of them is heavier than the others, can you figure out which one is the heavier one by only measuring twice using a balanced scale."}], [{"date": "28 Jun 2016", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah in Jul 2014", "Interview Descriptions": "I was first contacted by the study team for an interview with their small team. Once I passed that group interview, I had a second intervirew with the hiring managers", "Interview Questions": "What interests you in working here?"}, {"date": "26 Feb 2016", "title": "Graduate Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2014", "Interview Descriptions": "I was asked what my experience was.  The interviewer asked me to describe a situation where I was able to explain a problem in a unique manner that allowed a student to more easily grasp a problem.  I turned in a writing sample to demonstrate a grasp of written language and show that I had the ability to communicate clearly.  Regular office hours were of concern.", "Interview Questions": "Explain three ways to solve for the current through a resistor in a network."}, {"date": "17 Nov 2016", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2014", "Interview Descriptions": "I was hired as a temp only because someone recommended me.  Most people are hired because they know someone.  If my supervisor did not appreciate my work, I would not have moved up.  She is gone now.  There are no more opportunities for me.", "Interview Questions": "what made you apply for this position?\r\n\r\nwhat is your strength?\r\n\r\nwhat is your weakness?"}, {"date": "25 Oct 2016", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2014", "Interview Descriptions": "Fairly complex, multiple interviews, phone, in-person. I was contacted by the department and asked a few questions on the phone about myself and why I was looking for a job. My background was a bit different so this made complete sense. I answered all the questions with complete honesty and I was asked to come in for an in-person interview.", "Interview Questions": "Why are you looking for a job?\r\nWhat is your background?\r\nEducation?\r\nEtc."}, {"date": "23 Dec 2015", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Apr 2014", "Interview Descriptions": "Phone interview followed by an in-person. Standard questions about background, experience. Interviewed with a panel of 6 or so from the department. Everyone was friendly and at the in-person interview it felt like more of a recruiting event than interview. Also involved a tour of campus and meeting a lot of the people from the department.", "Interview Questions": "Explain how you deal with intrusive parents? A project you've worked on before, etc."}, {"date": "8 Jun 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Utah (Salt Lake City, UT) in Apr 2014", "Interview Descriptions": "Very relaxed interview process. They gave me a programming assignment in Java and asked to finish in 4 days. The assignment was generally easy. It required implementing a data structures based algorithm.", "Interview Questions": "N/A"}, {"date": "6 Sept 2015", "title": "Computer Professional Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Utah (Salt Lake City, UT) in Apr 2014", "Interview Descriptions": "I got the recommend from my advisor when I prepared my graduate thesis,  and submit the application online, and had a 4 people face-to-face interview onsite in the University of Utah campus.", "Interview Questions": "What is the best way to classify some data?"}, {"date": "6 Nov 2015", "title": "Market Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Apr 2014", "Interview Descriptions": "The application process begins online. After applying online potential candidates are invited to interview with one of the several managers. Generally it only requires one interview to determine who they will hire. After informing candidates that they have been hired the managers invite them to begin ASAP. Once they begin they are asked to work on several technologies and conduct the market research for these technologies.", "Interview Questions": "Have you conducted market research analyses?"}, {"date": "7 Mar 2014", "title": "Facility Engineer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of Utah", "Interview Descriptions": "The hiring and interview process was good. Applications are done online and then someone gives you a call to schedule the interview with the department manager. The manager then gets back to you following the interview to let you know if you are offered the job or not.", "Interview Questions": "How do I deal with conflict"}, {"date": "5 Mar 2014", "title": "Assistant Professor In Health Sciences Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "Standard two presentations; misleading statements about the amount of support and collegiality there would be, etc.", "Interview Questions": "What endpoints will you use to evaluate your experiments?"}], [{"date": "21 Feb 2014", "title": "Clinical RN Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Email communications with manager followed by formal interview with manager followed by peer interview", "Interview Questions": "Explain a time when you had a conflict with a co-worker and explain how you handled the situation."}, {"date": "19 Feb 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Utah (Salt Lake City, UT)", "Interview Descriptions": "Hiring was through informal talks with a professor", "Interview Questions": "Questions are tailored to your prior experience."}, {"date": "12 Feb 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 months. I interviewed at University of Utah", "Interview Descriptions": "Hired through routine graduate program administration procedure - applied internationally to the graduate program and the graduate research assistant position with personal statement, resume, and reference letter before the deadline. 5 months later got an invitation letter, and the  graduate research assistant position. It was a very regular graduate school application procedure.", "Interview Questions": "N/A"}, {"date": "7 Oct 2017", "title": "Retail Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Feb 2014", "Interview Descriptions": "Sit down interview with  a supervisor and staff member.  About nine questions asked.  Waited for response and then next person asked open-ended question.  At the end the interviewers said they would get back to me in the next week or so.", "Interview Questions": "In which ways in the past have you successfully multi-tasked in a workplace setting."}, {"date": "13 Jan 2014", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Utah", "Interview Descriptions": "An interview was set up initially by emailing the individual principle investigator of the lab. The interview consisted of talking about my previous research experiences, what my duties would entail, and a tour of the laboratory facilities and an introduction to other lab personnel. I received an offer within a week, but I waited several weeks to respond while I sorted out my options.", "Interview Questions": "There were no difficult questions, but I did get an unexpected question about my convictions of working with human embryonic stem cells. I was also asked if I would mind maintaining mouse colonies for genetic research. Between animal right activists and religious people, they have to ask those kind of questions in order to know whether or not I could perform the work that they were hiring me to do. "}, {"date": "12 Jan 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Utah", "Interview Descriptions": "Good, but difficult questions were asked that lasted about 30 minutes it was nothing much beyond that I would say that it was okay but ultimately it was not called but there could be some preparation made if you wanted to prepare that would be your choice", "Interview Questions": "note your questions"}, {"date": "10 Jan 2014", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of Utah", "Interview Descriptions": "Got hired because one of my professors worked for the company and they offered me a job based off of my in class performance.", "Interview Questions": "What do you want to do with the rest of your life?"}, {"date": "1 Jan 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Utah", "Interview Descriptions": "I contacted the professors one by one and arrange a time in their office. Then go through the application process. The interview is to make sure they need my skill and they want to suppose my PhD program.", "Interview Questions": "There was no unexpected question, but the working load is much more than I expect. "}, {"date": "22 Sept 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2014", "Interview Descriptions": "Went into the Dean's cramped office instead of the spacious conference room, not very lively interviewers. Questions asked were standard and not thought out. The specific department that I interviewed at did not have a specific HR person to interview and hire for the position. It was obvious that management had no professional training in hiring and that they did not utilize Glassdoor as a resource.", "Interview Questions": "Tell me about yourself?"}, {"date": "24 Jun 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2014", "Interview Descriptions": "applied online, two interviews, one on one style, mostly talked about scheduling, experience, and what type of worker one is. The process of hiring, especially for part-time, is quite quick.", "Interview Questions": "Basic questions"}], [{"date": "8 Dec 2016", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Utah (New York, NY) in Jan 2014", "Interview Descriptions": "Sent the CV with the cover letter and a month later, I had the interview. A month later, I have on site interview. Then, I got the offer within two weeks.", "Interview Questions": "N/A"}, {"date": "13 Dec 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Utah (Salt Lake City, UT) in Dec 2013", "Interview Descriptions": "You have to communicate with the professors, the standard affair and every graduate students know that. Once a professor shows interest you will be asked for a skype interview initially.  If the professor likes your previous academic record/achievement they will invite you to a campus visit and they pay for the airfare and lodging.", "Interview Questions": "Depends of which laboratory or  research group the student is applying to"}, {"date": "6 Jan 2016", "title": "Outpatient Service Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Dec 2013", "Interview Descriptions": "Group interview and standard interview questions focus on customer experience and quality of care. University of Utah health has a huge emphasis on patient care and satisfaction. Any positive things you can bring up as examples of making a difference will help.", "Interview Questions": "Example of a time you had a conflict with a coworker and how did you resolve?"}, {"date": "7 Nov 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Talk with the professor and some basic skill questions", "Interview Questions": "most questions are very basic and normal "}, {"date": "2 Nov 2013", "title": "Data Entry Specialist Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Asked typical questions about how I handled a difficult situation.", "Interview Questions": "N/A"}, {"date": "25 Nov 2015", "title": "Undergraduate Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Nov 2013", "Interview Descriptions": "Apply with a professor in your desired field of study. Meet with professor to discuss your interests and the direction and goal of the project. Determine if the project is something you would be interested to take part in. Submit a resume to the professor. Start Working!", "Interview Questions": "Will you enjoy working in this field and going in the prescribed direction of this project?"}, {"date": "25 Oct 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at University of Utah", "Interview Descriptions": "Heavily weighted by transcripts and letters of recommendation. Indications of past success are huge. Candidates with some previous graduate school experience have an advantage.", "Interview Questions": "What do you want to work on?"}, {"date": "24 Sept 2013", "title": "Marketing and Communications Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Utah in Sept 2013", "Interview Descriptions": "I’ll first start off by talking about the initial application submission. I wasn’t sure if the University of Utah used an automated filtering system/automatic data extraction function with their electronic applicants, and seeing as how I was using a PDF for my resume, I had to call the employment department just to make sure. They informed me that actual humans do review each application, so anyone who submits a PDF or other in-extractable document type need not worry about this. \r\n\r\nAfter submitting my application, it took about 1.5 weeks to first hear back from the hiring manager. She was very enthusiastic and requested that I submit a marketing proposal as part of the first round of interviews. I won’t get into the details of it, but she did provide some guidelines for what was to be included in the proposal. I was given about a week to complete the proposal and submit it back to her.\r\n\r\nIt took about another week or week and a half to hear back from her again. I was very excited to have been selected to meet with her and a few others in person as part of the second round of interviews. I assumed at this point that there were only less than a handful of candidates they were seriously considering, so I felt confident. However, the second round interview was frankly, grueling. I’m not sure if this is an institution-wide procedure, but I was required to do a 15-minute presentation to the team I would be working with, followed by half an hour of panel interviews (by the same team of people), followed by another 45-minute interview with just the hiring manager and the director, and finally, to wrap up the TWO HOUR ordeal, a 20-minute writing test, which was to write a short marketing piece on the spot. \r\n\r\nThis was the first time in my career that I’d experienced an interview process such as this one. I understand that a top institution would want to hire the best of the best (well, what company wouldn’t), but is it really necessary to make the candidate do a presentation AND a panel interview? Definitely seemed a little too bureaucratic for my taste. Not to mention, I definitely felt that dialogue was not encouraged. It was simply answer-the-question-answer-the-question-answer-the-question. No time to really have a real, human discussion.\r\n\r\nTo satisfy the bonus points, I’ll give my two cents on the people and company culture. From what I picked up during the in-person interviews, the atmosphere definitely seemed a little more serious than what I’d imagined. One thing I emphasized several times throughout the interview, was that in my previous experience of being a student at the University of Utah, everyone I’d met who’d worked there seemed so happy and proud of what they did there. Ironically, the people interviewing me hardly seemed happy or proud at all. But maybe this was just a departmental issue. I can attest to this observation because during my presentation, I took a “joke break” and cracked a few jokes to lighten the mood a little, and I got a poor, disheartening response from the team. But the way I see it is, I probably wouldn’t have been a good fit there anyway if I wasn’t allowed to be myself. \r\n\r\nOh, one last thing: I spent around a good 24 hours in total preparing for a job that I wouldn't even get in the end (from brainstorming for the marketing proposal and putting it together, to preparing for the interview, to spending two hours at the in-person interview). I won't say it was a monumental waste of time, but... well, you get it.", "Interview Questions": "What do you think are the top three barriers for non-traditional students or students of an ethnic minority to successfully attain a higher education? "}, {"date": "3 Apr 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at University of Utah (Salt Lake City, UT) in Sept 2013", "Interview Descriptions": "They asked me a lot of questions regarding the projects i did during my undergraduate.", "Interview Questions": "No Difficult Question"}, {"date": "23 Sept 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Utah (Salt Lake City, UT) in Sept 2013", "Interview Descriptions": "After I took a specific class in my first semester i asked the professor for a research project. I took many times of asking, finally I got a response with a open research opportunity.", "Interview Questions": "what are my skills and willingness to self-learn and be trained."}], [{"date": "1 Jan 2016", "title": "Biomedical Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Utah in Jul 2013", "Interview Descriptions": "Fun interesting i talked with a big group of people and they asked about my character and how I would worn with the team. I felt they asked enough questions to get to know me and also helped me to relax by  telling a few jokes", "Interview Questions": "What is your favorite Girl Scout cookie?"}, {"date": "23 Sept 2015", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jul 2013", "Interview Descriptions": "It was pretty short and not so hard. they will ask you to answer some math questions to see how much you know about them and also, they ask you how you would explain it if a student asked you a question like this. However, they are not so hard. pretty simple and straight forward.", "Interview Questions": "How do you feel when you see a student struggling in a simple math problem?"}, {"date": "22 May 2013", "title": "Study Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Utah", "Interview Descriptions": "Fairly simple and straight forward. Had to highlight all of my experiences and why i wanted to work in that field.", "Interview Questions": "If you could write an autobiography what would the title be and why?"}, {"date": "4 Dec 2014", "title": "Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Utah in Apr 2013", "Interview Descriptions": "The process was a bit truncated as it was the end of the year and they wanted to move fast. I participated in a phone interview with the full committee. After that I was invited for the two-day on-campus interview. During the trip I met with 3 committees, the search committee, students, and gave a campus talk.", "Interview Questions": "The most difficult question centered on how I go about maintaining self-care in a difficult/highly political work environment. "}, {"date": "22 Mar 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at University of Utah (Salt Lake City, UT) in Dec 2012", "Interview Descriptions": "I applied for the job of teaching assistant online along with applying for Masters degree here at Uni of Utah, I think they give you preference if not only your academic records are good but also you mention on the application that you won't be able to attend school without getting the TAship.", "Interview Questions": "Once they have reviewed and approved your resume submitted online, you are assigned to some professor and then he asks a few simple questions related to the course you will be TAing, nothing difficult."}, {"date": "19 Jun 2015", "title": "Bio Statistician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2+ months. I interviewed at University of Utah in Dec 2012", "Interview Descriptions": "it is not very easy. a lots of statistical knowledge to ask  and  program questions. how to work with others? why do you choose our department.and if you work different people.and good teams. good coworkers and help each other.", "Interview Questions": "what's p-value?"}, {"date": "3 Jul 2014", "title": "Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at University of Utah in Nov 2012", "Interview Descriptions": "The hiring process began in grad school where I volunteered to do research on a project.  After I graduated, I found an opportunity with the lead researcher.  There was not really an interview, more of a get to know you conversation.", "Interview Questions": "Where do you want to be in 5 years?"}, {"date": "6 May 2014", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Utah in Sept 2012", "Interview Descriptions": "One interview with a single manager. Currently, I think they have 2 or more interviewers.", "Interview Questions": "n/a (interview questions were not difficult or unusual"}, {"date": "21 Oct 2016", "title": "Computer Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (New York, NY) in Sept 2012", "Interview Descriptions": "You can find job posting on student job board. You apply on the job site. Then you receive an email from the employer to invite you for an interview. After interview, you will wait for about 2 weeks to receive the employer's final decision.", "Interview Questions": "Describe your experiences with video codec."}, {"date": "7 Jan 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Aug 2012", "Interview Descriptions": "- One on one technical interview with the professor.\r\n- Asked questions about previous work experience.\r\n- Asked questions about undergrad coursework.\r\n- Questions about Engineering Mechanics, Strength of Materials, Statics and Dynamics, Finite Element Analysis, Matlab skills, 3D CAD modeling skills.\r\n- Inquired about research interests.\r\n- Potential PhD candidate.", "Interview Questions": "What were your responsibilities at your previous job?"}], [{"date": "6 Oct 2012", "title": "Graduate Student Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jul 2012", "Interview Descriptions": "I was approached about this opportunity. After submitting a resume I was contacted within a week to set up an interview. The interview was very informal, and focused on the responsibilities of the job and the commitment it would require.\r\n\r\nWithin another week I had a job offer, and started teaching the hen the semester started two weeks later.", "Interview Questions": "I was asked about my knowledge of e software we would be using in the class, as well as my use of the University's LMS."}, {"date": "17 Aug 2015", "title": "Academic Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jul 2012", "Interview Descriptions": "One interview with the director and manager. An online application was due before. I was called for an interview about a week after I submitted the online application. After the interview it took about another week for them to get back to me with an offer. It took a few more days to get the paperwork finished.", "Interview Questions": "How well do you multitask?"}, {"date": "23 May 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jul 2012", "Interview Descriptions": "The advisor will email you first to schedule the time for interview. The interview will be done in phone or skype depend on the professor. The interview will go through the resume that I submitted first. After that, the professor will start to explain the topic and area of his or her lab. The professor will make you choose the area you are interested and go from there.", "Interview Questions": "What is the related experiment experience?"}, {"date": "19 Nov 2014", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2012", "Interview Descriptions": "Every thing was very simple and straight forward. I was referred by someone who use to work here back then and it was all a breeze. I interviewed on a Friday and surprisingly I had an offer on the following Tuesday (in spite of being an international candidate living in Salt Lake City for more than 2 years).", "Interview Questions": "Didn't find anything difficult"}, {"date": "6 Jan 2017", "title": "Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Mar 2012", "Interview Descriptions": "The interview process is the typical one on one and group interview model. Typically, the group interview consists of administrative staff and members of the current research team. The initial interview is with the hiring manager and if selected for a second interview, one more \"one-on-one\" interview will take place with the Division Chief and then the group interview. At the end of the interview a short basic research test is given.", "Interview Questions": "How do you deal with difficult personalities?"}, {"date": "17 Sept 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 8 months. I interviewed at University of Utah in Mar 2012", "Interview Descriptions": "I applied through graduate school and found an academic adviser who was interested to hire me to work in his/her lab. Then I kept email communication with the Professor and he/she interviewed me on different topics. He/she assigned me tasks to make sure I qualify for the position.", "Interview Questions": "I was not able to perform as expected in one of my PI's project."}, {"date": "8 Sept 2015", "title": "Student Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Utah (Salt Lake City, UT) in Feb 2012", "Interview Descriptions": "Typical graduate school admissions process, which involved submitting transcripts, letters of recommendation, and research statement.  Then to seek a specific research assistantship with a faculty, there was some in person interview time and chance to ask for available funding.", "Interview Questions": "What sort of skill set you have, do you have programming experience, etc."}, {"date": "11 Nov 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2012", "Interview Descriptions": "The interview process was through skype. I had a phone interview coupled with a skype interview. It was mostly general asking about my previous bachelors experience, and how that helped me to decide what I wanted to do next.", "Interview Questions": "About interests?"}, {"date": "7 Sept 2016", "title": "Software Design Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2012", "Interview Descriptions": "Initial phone call to screen. Then Skype interview with the team, then meet the team in person.  When meeting with the team, I had the opportunity to talk with each person individually to learn more about the different involved in the process.  After the interview I sent thank you emails to each team member and was soon offered the position.", "Interview Questions": "Gave a hypothetical question related to tables and how to query the data."}, {"date": "24 Jul 2015", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2011", "Interview Descriptions": "One interview was conducted and a second interview about a week later. It was fairly normal and basic. Questions about yourself and you past experience and why you applied and why you would be a good fit for the University.", "Interview Questions": "Basic Questions, strengths & weaknesses, very basic interview."}], [{"date": "8 Dec 2015", "title": "Assistant Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2011", "Interview Descriptions": "Excel, normal interview of what would you do in this situation.  Everyone was very welcoming.  They did interview with two people yet it was not overbearing.  After the interview they were kind and told me they would let me know within a few days.", "Interview Questions": "How would you handle a situation."}, {"date": "2 Dec 2011", "title": "Driver I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 3 weeks. I interviewed at University of Utah (Salt Lake City, UT) in May 2011", "Interview Descriptions": "The process of applying to the driver position was actually quite easy. I applied online, as the University has just adopted an \"online only\" hiring process. That only took me about 3 min to complete because once you have applied to one position, it saves the information so that you can blow through other applications.\r\n\r\nIt took about 3 weeks to get a call, and I was invited to an interview. It was the easiest interview that I have ever done. It took about 15 min, the manager outlined the work, which was actually driving a cart to pick up outdoor trash. I took it!", "Interview Questions": "This is more of a waste management job than a driving job, would you still be interested?"}, {"date": "7 Aug 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Utah (Salt Lake City, UT) in Apr 2011", "Interview Descriptions": "I was invited to attend an interview weekend along with other candidates. I had already been accepted to the program, but hadn't selected an advisor. I was allowed to request meetings with several potential advisors. I met with 5-6 professors in the department and was given tours of different lab spaces. My competency was somewhat tested, but mostly it seemed they were trying to sell me on the university. On the second day, some of the current students took us skiing at Snowbird.", "Interview Questions": "Tell me what you know about random variables."}, {"date": "24 Nov 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Mar 2011", "Interview Descriptions": "telephone interview. let me introduce myself, and asked me several questions related with my previous work and study, and also asked my future research interests. They also described their research and courses.", "Interview Questions": "tell us about yourself"}, {"date": "5 Apr 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2011", "Interview Descriptions": "Search the website, and find the professor who share the same research inetersts with you. Then, I email him direclty. Then, he replies and ask me to write up some documents, such as research interests, the future research plans, and the CV. Then, I got a skype interview opportunity to dicuss some details about my plan and expertise.", "Interview Questions": "Why do you choose our lab"}, {"date": "16 Aug 2014", "title": "Pharmacy Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at University of Utah (Salt Lake City, UT) in Dec 2010", "Interview Descriptions": "I work with the \"U\" in the past and I have some Problems With My Back Ending on a surgery, back on December last year I am fully recovery now. I been trying to come back if is possible to my previous job in the inpatient site but I don't have any success I am willing to start from bases even with all experience that I have.", "Interview Questions": "where part of the field I like the best"}, {"date": "31 Aug 2010", "title": "Postdoctoral Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Jul 2010", "Interview Descriptions": "The process of interviewing for a postdoctoral research (fellow) is to first get a phone interview. These are given to the top ~10 candidates. If the interviewer is still interested (usually the top ~4), he/she will fly the candidate out to the university to meet in person to have more time with individual. Research processes are shared to help both parties determine if the new position will be a good fit. Additional meetings with other professors are scheduled and a seminar on recent work is usually presented by the interviewee. After that, we wait until we hear back with a no or yes.", "Interview Questions": "What do you want to do if you come work here?"}, {"date": "16 Feb 2012", "title": "Lab Technician I Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Jul 2010", "Interview Descriptions": "Was referred by previous employer.", "Interview Questions": "What was it like to work with enother employee."}, {"date": "18 Jun 2014", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Jun 2010", "Interview Descriptions": "The hiring process was very straight forward. I simply submitted my resume online. I needed the recommendation of two teacher from high school (or professors at the University of Utah). After I submitted my resume, I received a call from the professor from the University of Utah. He asked me a few questions about my interests in his research and some of my coursework. Overall, it was a very simply and relaxed process.", "Interview Questions": "N/A"}, {"date": "13 May 2012", "title": "Lab Technician I Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Apr 2010", "Interview Descriptions": "Talked with PI. Was a referal from previous lab.", "Interview Questions": "What was it like working with another lab tech?"}], [{"date": "28 Dec 2010", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Utah (Salt Lake City, UT) in Apr 2010", "Interview Descriptions": "Initially submitted resume online.  I heard back from Idaho Technology within a couple of weeks of posting my resume. They did a screening interview very brief about 10 mins.  Later,  I was contacted by lab manager to have a sit down interview.  The interview consisted of technical questions and character questions.  I was contacted a week later for a group interview.   I meet the lab employees and was taken to lunch at an upscale restaurant downtown.  The atmosphere was relaxed and it was more casual conversation than interview questions.  I was contacted a week later with a rejection.", "Interview Questions": "Give an example when you had to reach a deadline and the circumstances were not ideal."}, {"date": "26 Aug 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Utah in Mar 2010", "Interview Descriptions": "We came in on Thursday. A busy Friday talked with 5 or so professors. On Saturday, went to ski. Its great. Sat evening, its poster session. There were lots of poster presented by fellow graduate student. Its a great opportunity to learn what they doing.", "Interview Questions": "No questions asked. They just talk their way. You just sit there listening"}, {"date": "2 Oct 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Utah (Salt Lake City, UT) in Mar 2010", "Interview Descriptions": "Interviewing at the University of Utah to join their Molecular Biology PhD program is a really great experience. They know they're competing with Harvard, Stanford, etc (much bigger and more well-known schools), so they try to compete by showing off the city and the outdoors opportunities, and also by showing off the wonderful faculty and students at the U. \r\n\r\nEvery interview candidate has a chance to go skiing/snowboarding at Brighton and to meet with pretty much any faculty member they want to.", "Interview Questions": "Describe your desired research program. "}, {"date": "3 Mar 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Jan 2010", "Interview Descriptions": "Wrote a letter to my PI with my CV. I was invited out for an interview, which involved a presentation of my research with detailed questions and answers followed by a discussion of potential projects with the PI and one on one meetings with other individuals in the lab.", "Interview Questions": "I presented my PhD research, and was grilled by the entire lab on my technical work."}, {"date": "31 Jul 2013", "title": "Lab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at University of Utah (Salt Lake City, UT) in Dec 2009", "Interview Descriptions": "Hired because I knew the lab manager and had lab experience, was a telephone interview, went very smoothly.", "Interview Questions": "How long are you wiling to work here? This job requires 6 months of training  and you will only be hired if you can commit at least 2 years, I would prefer 5."}, {"date": "20 Feb 2010", "title": "Programmer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Dec 2009", "Interview Descriptions": "I was called on 1400 hrs I went sat in the interview room. Was asked basic questions in java. I answered all. But still dint get a call .", "Interview Questions": ".."}, {"date": "7 Mar 2010", "title": "App Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Sept 2009", "Interview Descriptions": "face to face interview was easy", "Interview Questions": "past experience"}, {"date": "6 Oct 2013", "title": "Graduate Student Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at University of Utah in Feb 2009", "Interview Descriptions": "Typical grad student interview, but they send acceptances the week following interviews, which is a great benefit.", "Interview Questions": "Why not another university?"}, {"date": "13 Nov 2010", "title": "Quality Assurance Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Utah (Verona, WI) in Jan 2009", "Interview Descriptions": "Turned in resume, and had a phone interview.", "Interview Questions": "What are your weaknesses?"}, {"date": "20 Nov 2012", "title": "Accounting Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Utah (Salt Lake City, UT) in Jul 2008", "Interview Descriptions": "Depends on the Department, usually a phone interview, then a interview or two.", "Interview Questions": "Depends on Interviewer - usual questions."}], [{"date": "11 Oct 2012", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in Jul 2008", "Interview Descriptions": "The interview process is similar to may graduate programs with the exception that the University of Utah offers several additional benefits, such as skiing, and hiking that are often used to help entice students to come.", "Interview Questions": "Didn't have one."}, {"date": "19 Nov 2009", "title": "Executive Cabinet Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at University of Utah (Salt Lake City, UT) in May 2008", "Interview Descriptions": "Sat in a circle with the elected executive officers.  Fairly easy.  Tag-teamed the questions.  Some of the questions were a bit subjective:  what does diversity mean to you.", "Interview Questions": "How do you deal with stress"}]]