[[{"date": "25 Jun 2023", "title": "Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grady Health System (Atlanta, GA)", "Interview Descriptions": "I interviewed with 2 hiring managers. The process took about a month. Interviews were conducted in person and one on one. HR interviews were conducted over the phone and by email.", "Interview Questions": "Tell me how you handled a difficult situation?"}, {"date": "16 Apr 2023", "title": "Recruiting Leadership Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Grady Health System (Atlanta, GA)", "Interview Descriptions": "My interview with the recruiting team was over a month ago. It was an initial call that seemed to go well. While you really can never be sure how the other actually feels, you should be able to expect some sort of follow up as it was promised. Weeks went by with no word. I followed up and the reply was that they were waiting on their VP to make next selections as they were away on vacation. I followed up two more times after, with plenty of distance between each email to allow for movement, but GHOSTED", "Interview Questions": "How would you like it if we give you an interview, build false hope, and then ignore you?"}, {"date": "7 Feb 2023", "title": "911 Dispatcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grady Health System (Atlanta, GA)", "Interview Descriptions": "It was a simple STAR method (two rounds total) and the standard criti-call test. I got a call about a week later from Human Resources with a pretty good offer.", "Interview Questions": "Describe a time when you..."}, {"date": "31 Jan 2023", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grady Health System", "Interview Descriptions": "The interview was easy— The interview was online. They asked the usual Call center interview questions. It is a healthcare environment, so they wanted to see if you are a service-orientated person. How many calls have you taken? What does time management mean to you?", "Interview Questions": "what is the difference between empathy and sympathy"}, {"date": "17 Jan 2023", "title": "ER NP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grady Health System", "Interview Descriptions": "Great. Very knowledgeable. You can learn alot working for Grady. Great Benefits and room.to grow. Serve a lot.of homeless population. Level one trauma. Panel interview. GREAT Providers! Reduce admission rates and frequent usage of the ER", "Interview Questions": "What can you bring to the table?"}, {"date": "19 Dec 2022", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grady Health System (Atlanta, GA) in Dec 2022", "Interview Descriptions": "You're asked if you can work the following hours. Which is shown to you on a piece of paper. There are about 5 different shifts displayed. If you're not able to work any of those shifts the next question will be why.", "Interview Questions": "Do you know what the job entails? Why do you want to work here?"}, {"date": "19 Oct 2022", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System", "Interview Descriptions": "Very smooth, They were very nice and detailed on what their roles where. Explained the position very well and what I could expect.I had a virtual interview with two Emergency room managers. They where really friendly and always smiling. Made the interview process very easy going.", "Interview Questions": "Tell me about yourself what you liked and disliked about you previous manager"}, {"date": "11 Oct 2022", "title": "Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grady Health System", "Interview Descriptions": "Easy easy easy what else can I say not hard at all very easy straight forward and quick. Nice staff and friendly people. Love it. Best hospital and staff. Easy", "Interview Questions": "What are your strengths and weaknesses"}, {"date": "7 Aug 2022", "title": "Anesthesia Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Grady Health System", "Interview Descriptions": "During covid the process changed alot so they may still do video I wouldn't know they might. All you in. I do remeber a test to see if i k ew how to make a artline", "Interview Questions": "N/A"}, {"date": "8 Apr 2022", "title": "Inventory Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grady Health System", "Interview Descriptions": "Great and very informative. Applied online the reached back out quickly to reschedule an in person interview. Managers were very straight forward and friendly. Took about a week after the interview to offer me the position.", "Interview Questions": "Do you have any previous experience with inventory?"}], [{"date": "20 May 2022", "title": "Social Work Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Grady Health System (Atlanta, GA) in Apr 2022", "Interview Descriptions": "Overall a simple process. The interview was a panel of about 6 social workers in different units. Be prepared for a lot of \"tell me about a time when questions\". Took about 1 hour and I heard back within a week.", "Interview Questions": "Tell me about a time when you had conflict with someone at you job and how you handled it. "}, {"date": "10 Mar 2022", "title": "Nursing Support Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grady Health System", "Interview Descriptions": "The interview was straight to the point and completed over zoom. Questions were posed using the STAR method and interviewer was nice and thorough when it came to answering my questions.", "Interview Questions": "Was I comfortable floating between different floors "}, {"date": "13 Jan 2022", "title": "Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System", "Interview Descriptions": "There is a quick turnaround. Process in whole takes one month. Interview questions were mostly about resume. There were no technical questions. Getting an interview took approximately two weeks from recruiter.", "Interview Questions": "Why are you interested in this position?"}, {"date": "16 Jul 2022", "title": "Employment Specialist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Grady Health System (Atlanta, GA) in Jan 2022", "Interview Descriptions": "The first panel interview was with 4 grady employees. They went around via zoom and asked approximately 3 qeustions each. The questions were scenario based. The second interview was more laid back. I didn’t get offered the position until about 5 months later.", "Interview Questions": "Tell me about a time you a to work as a team."}, {"date": "27 Nov 2021", "title": "Nurse Residency Program Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grady Health System in Nov 2021", "Interview Descriptions": "Applied online in September when residency applications were open. Was contacted via email to schedule interview. It was a virtual interview. Was placed in meeting room with 4 panelists. Each introduced themselves and i did as well. Interview questions were standard. Took about 20 minutes. Overall great experience. Received offer same day of interview.", "Interview Questions": "Why do you want to work at Grady?\nWhy did i choose this unit?\nWhat qualities make you the top candidate?\nName a time you had a difficult patient, what was the situation and how was it resolved. "}, {"date": "8 Jul 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Atlanta, GA) in Jul 2021", "Interview Descriptions": "Long and average, but challenging...and explicit, it took about an 1hr all thru the interview...I need to learn more question..needs more interview questions for my upcoming interviews..I have attended series of interview, need ti fully prepared myself", "Interview Questions": "How did u hear about us"}, {"date": "4 May 2021", "title": "Physician Assistant, PA-C Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Grady Health System", "Interview Descriptions": "-Difficult to schedule\n-Asked somewhat personal questions\n-Difficult to communicate with prior to interview\n-Not a very clear-cut process... for instance I was not informed of next steps after the interview was done.", "Interview Questions": "How do you manage stress and keep it separate from the work place?\n\nHave you ever interacted with someone with a different background from you and how did you find common ground?\n\nTell us about yourself. \n\nHow did you guide a patient through something difficult when they did not know about their diagnosis?"}, {"date": "9 Feb 2021", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grady Health System", "Interview Descriptions": "Virtual interview. Ask a few questions about your experience and how would you handle a certain situation with patients, and coworkers. Asked about your can work well under pressure and others", "Interview Questions": "How would you handle a conflict between your co-workers?"}, {"date": "27 Feb 2023", "title": "EMT-Basic Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Grady Health System in Feb 2021", "Interview Descriptions": "It was a casual interview over the phone that lasted maybe 20 minutes. I also had just graduated from the Grady EMS academy and they seemed eager to hire recent grads. General interview questions, know why you want to work for the company and be able to answer questions about your resume.", "Interview Questions": "Tell us about a difficult time with a co-worker and how you handled it."}, {"date": "26 Jan 2021", "title": "Patient Care Tech Aka Nursing Support Tech Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Atlanta, GA)", "Interview Descriptions": "After I'd applied for a few PCT roles, HR contacted me for a group information session and gave us advice on how to answer interview questions i.e. using the P-S.T.A.R.R method (i.e. Prepare, Situation, Task, Action, Result, Reflection). \n\nMy WebEx interview with the unit that I really wanted to work on had about 5 people asking me different questions - standard questions e.g. \"Tell me about a time when you had a stressful interaction with a co-worker. How did you handle it?\" \n\nHowever, be prepared for some \"wtf\" questions which could throw you off your game, e.g. \"What superhero would you choose to be, if you could?\" (true story!)\n\nNeedless to say, I did not have a good answer to some of these questions and did not get the job offer...", "Interview Questions": "Standard behavioral questions about how you handle conflict or stress on the job as well as \"wtf\" questions like, \"What superhero would you choose to be, if you could?\" (true story!)"}], [{"date": "18 Jan 2021", "title": "Dispatcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System", "Interview Descriptions": "First you have to take a computer Typing test /face to face Interview/Then you come back for a panel interview with three or more supervisors in trainers Then you  will be hired on the spot if qualified", "Interview Questions": "Series of questions and Scenarios\r\n"}, {"date": "18 Jan 2021", "title": "Senior LAN Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System", "Interview Descriptions": "Phone Screen, small number of behavioral questions and in person interview.  Questions deal with project management skills, overall skill assessment, and overall experience.  One more meeting with team and site visit.", "Interview Questions": "What was the toughest project you worked on"}, {"date": "14 Jan 2021", "title": "Clinical Research Coordinator III Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Grady Health System", "Interview Descriptions": "Due to covid the interview was over zoom, it was a group interview with the managers, accounts, and principal investigator. We discussed my qualifications and a lot of drawing parallels in skills from gained from previous projects to the qualifications of the position.", "Interview Questions": "The opening question was tell me about yourself and how this position is right for you, and the interview continued on from there."}, {"date": "22 Feb 2021", "title": "Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Atlanta, GA) in Jan 2021", "Interview Descriptions": "It was online and five minutes. Took a week or so to hear back from the recruiter. Very nice interviewer. Be on time for the meeting. There was only one person asking the question but other people were there.", "Interview Questions": "Most difficult pt\nWhy nursing?\nhow to handle a stressful situation\nWhat to do if pt is upset and crying"}, {"date": "17 Jan 2022", "title": "911 Communications Call Taker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grady Health System (Atlanta, GA) in Jan 2021", "Interview Descriptions": "After submitting my resume and application I was contacted via email to take a personal fitness survey and the next step was to take an online test. The test had multiple parts that tested you typing speeds, memory recall, and multi taking skills. Along with other things. If you pass all of the sections you will get both an email and a call confirming your panel interview date and time. As far as the interview goes I was interviewed by 2 employees and we all introduced ourselves then the interview questions began. The questions were asked  round robin\" and  my answers needed to be formatted in the \"STAR\" format. \"Situation. Task. Ask. Result*.", "Interview Questions": "They asked a lot about how I would handle certain situations. Also about the time I handled a stressful environment at work and how I resolved it."}, {"date": "19 Apr 2021", "title": "Ambulatory Operations Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Atlanta, GA) in Jan 2021", "Interview Descriptions": "It was a 3 part interview with quick turnaround and all virtual. Everyone was extremely attentive and asked meaningful questions. I enjoyed this interview and felt they wanted to get to know me as a person as well as my abilities.", "Interview Questions": "I was given a data set and asked to present my findings in the second interview."}, {"date": "6 Oct 2020", "title": "Dispatcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at Grady Health System (Atlanta, GA)", "Interview Descriptions": "I literally had the best interview. I was interviewed by 3 people. I was asked 3 “tell me a time when...” questions. Explained the Grady transformation.  Grady history. Etc. I look forward to hearing back", "Interview Questions": "Tell me a time when you prevented a small problem from being a big problem?"}, {"date": "25 Jan 2021", "title": "PRN INTERPRETER Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Fairview, NJ) in Aug 2020", "Interview Descriptions": "Profesional, relaxed, fun, detailed. \r\nOn time, two participants. Straight forward. Did not workout, I was  aware right away that I was not going to be considered due to PRN availability.", "Interview Questions": "Experience working with difficult plp\r\nWhat to do in different scenarios. "}, {"date": "6 Apr 2021", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Atlanta, GA) in Jun 2020", "Interview Descriptions": "I had a phone  screen with HR. It ran smoothly and everything was standard. Then there was another round with management. The interview was conversational, but a bit disorganized. Did not get any response after interviews.", "Interview Questions": "Are you able to come in? (aka) not a work from home position."}, {"date": "6 Mar 2021", "title": "Student Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grady Health System (Atlanta, GA) in Jun 2020", "Interview Descriptions": "The process was quick. We had to upload requirements. After which we were asked to interview with the company. We knew the results the same day.  They made the process easy.", "Interview Questions": "Tell me about yourself\r\nWhy this hospital ?\r\nStrength/weakness\r\n"}], [{"date": "14 Dec 2021", "title": "Certified Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grady Health System (Atlanta, GA) in Jun 2020", "Interview Descriptions": "The process was fairly simple. An interview of about 3-4 people. Went over resume and experience. Received and email the same day that they’d like me for the same position but another location. Applied for that location, did drug screen, new hire/orientation. Start date was about two weeks later.", "Interview Questions": "STAR method was used during interview. Was very comfortable. More conversation than question/answers. "}, {"date": "30 May 2021", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Atlanta, GA) in Apr 2020", "Interview Descriptions": "Virtual, to the point and all expectations and questions were answered. Easy going and everyone was nice and seem like they enjoy what they do. They interviewed me on a Monday and by Wednesday they had already made their decision. Quick and efficient.", "Interview Questions": "Typical how do you handle certain situations and give an example"}, {"date": "20 Feb 2020", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grady Health System", "Interview Descriptions": "Telephone interview, followed by a group/team interview.  Everything was over the phone, and was very simple.  The only difficult part was getting in touch with my HR liaison, as he was out on leave shortly after the initial interview.", "Interview Questions": "Experiences and background"}, {"date": "24 Oct 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grady Health System", "Interview Descriptions": "Good experience. Met with panel of nursing managers, staff RN, and unit directors. They were cool and asked the usual questions. It was a lot of people and the wait was long.", "Interview Questions": "Why should we hire you?"}, {"date": "30 Apr 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Grady Health System (Atlanta, GA)", "Interview Descriptions": "Great interview. Questions were job related scenarios. This interviewer had lots of knowledge about nursing and the GHS institution. My overall interview was a great experience.  The hiring process took about three weeks. The HR nurse recruiter sent an email and called me personally.", "Interview Questions": "My goals at Grady "}, {"date": "15 Jul 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grady Health System (Atlanta, GA) in Apr 2019", "Interview Descriptions": "Recruiter called and asked questions about my certifications and type of employment i was looking for. setup the interview with the clinic. I Interviewed with Clinic manager and another staff member asked a bunch of situation questions and question about personal life outside of work. Asked about past job and experience.", "Interview Questions": "How would you deal with mean or angry patients?\r\nWhat do you do to cope with stress?\r\nWhat are some hobbies you have?"}, {"date": "9 May 2019", "title": "Surgical Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grady Health System (Atlanta, GA) in Apr 2019", "Interview Descriptions": "I applied online and about two weeks later was asked to come in for an interview. When you get there you have to check in at a desk and they will call you back. Parking can be difficult so get there with enough time to spare. Everyone was friendly", "Interview Questions": "The basics obviously but they also had a list of scenarios for you to describe how you would handle it "}, {"date": "12 Jun 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Grady Health System (Atlanta, GA) in Jan 2019", "Interview Descriptions": "Tough interview! They ask questions then seem disinterested in your answers. I interviewed on a day where tons of interviews were being conducted, sort of like a job fair with on the spot interviews. It was tough, but I got the job!", "Interview Questions": "Situational interview questions and Name a time you made a mistake"}, {"date": "18 May 2020", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grady Health System (Atlanta, GA) in Jan 2019", "Interview Descriptions": "Questions were mostly on my experience and personal experience with patient care. They asked about my values, how i would handle conflict with a co-worker or a patient. They also asked a lot about being a team player.", "Interview Questions": "If you saw someone violate one of the hospital policies, what would you do?"}, {"date": "17 Oct 2018", "title": "Radiologic Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System", "Interview Descriptions": "Applied for both a full time and pool/variable shift position through Grady's Career page, contacted shortly after to schedule interview. Was a panel interview with two supervisors and the manager. I did poorly in the interview, few days later saw on website I was no longer under consideration for either position.", "Interview Questions": "What type of equipment are you familiar with?"}], [{"date": "2 Nov 2018", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Grady Health System (Atlanta, GA) in Oct 2018", "Interview Descriptions": "Process took about 1.5 months for applying to interview results. It was a panel interview for a new grad residency program. Interviews were nice and made me feel comfortable during the process.", "Interview Questions": "Tell me about yourself, strength and weakness"}, {"date": "16 Oct 2019", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Atlanta, GA) in Oct 2018", "Interview Descriptions": "I applied for the RN new graduate residency program and i got an email about a week later asking me to select an interview time. They also let you pick your preferred top 3 units you would like to work in the hospital.", "Interview Questions": "When have you had to go out of your way to make a patient feel better"}, {"date": "1 Sept 2018", "title": "Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Grady Health System", "Interview Descriptions": "The interview process was great. Interview takes places at Grady and it is a group setting. The questions that are ask are common sense. There are no trick questions", "Interview Questions": "When a patient is found wondering the halls, what will you do?"}, {"date": "3 Jul 2018", "title": "Trauma Registrar Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Grady Health System", "Interview Descriptions": "The interview process was long it took about 2 months to complete.  I was first contacted over the phone and was given an overview of the company and the position. We then set up my in person interview. I was told the process would take about 2 hours. I met with the hiring manager and then with the team. After that initial interview  I was called again to interview with the hiring manager and the director of the program.", "Interview Questions": "What’s your favorite color? "}, {"date": "2 Mar 2021", "title": "Undergraduate Research Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Atlanta, GA) in Jul 2018", "Interview Descriptions": "I was called back to a conference room with two gentlemen- one was the chief operations officer and the other was a health educator. My interview application consisted of a writing sample about a health issue of which I have a clearly defined plan for tackling, which I had opportunity to speak about during the interview. Both gentlemen offered feedback and positive reinforcement, which I appreciated. I was also asked the typical behavioral questions which come upin an interview: what would you do if, have you ever had team member that... how did you resolve the issue, etc. The one thing that I didn't particularly care for was how once the interview was finished, I was asked if I was part of any sororities, which I wasn't.  I wasnt sure how it applied to my qualifications, but apparently both gentlemen were in fraternities .  \n\nOverall, the interview process went well. I wasn't offered the position, but that happens sometimes.", "Interview Questions": "Who do you most look up to?"}, {"date": "17 Apr 2018", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "The process took 2 months. I interviewed at Grady Health System", "Interview Descriptions": "Interviewed by inpatient and outpatient manager, all questions were situational (tell me about a time when...), took about 45 minutes, then invited to take tour of the hospital with two other therapist", "Interview Questions": "When was the last time you did something new for the first time and what did you learn?"}, {"date": "11 Apr 2018", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Grady Health System (New York, NY)", "Interview Descriptions": "I applied and about 3-5 days later I was contacted via phone to set up an interview. After I confirmed my time and day I received an official email for the interview from HR.", "Interview Questions": "There were a lot (5-6) typical situational questions, nothing extremely hard. I am in school for a nursing degree so they did ask me why am I interested in Patient Access. Other than that, a lot of the questions were your typical interview questions."}, {"date": "1 May 2018", "title": "Scheduling Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grady Health System (Atlanta, GA) in Apr 2018", "Interview Descriptions": "I applied and was called the next day for face to face panel interview with 2 supervisors. Passed that and did a 2nd interview with the department manager. Was told they would call back in two weeks.", "Interview Questions": "What are some call center core metrics?"}, {"date": "27 Mar 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grady Health System", "Interview Descriptions": "I applied via my school's career portal. I received an email after 2-3 weeks to schedule an interview. The interview itself was very easy. I definitely over-prepared.  Staff is very kind. They want you to succeed.", "Interview Questions": "Why are you interested in this role?"}, {"date": "15 May 2018", "title": "Clerk Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Atlanta, GA) in Jan 2018", "Interview Descriptions": "very cut and dry. nice people. as long as you have common sense and an idea of patient confidentiality then you will be okay. Asked questions about background and strengths/weaknesses.", "Interview Questions": "What can you contribute to the company?"}], [{"date": "11 Dec 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Grady Health System", "Interview Descriptions": "Filled out the forms online, couple of weeks passed got an email and scheduled a phone interview/basic screening, after phone interview had a in person interview, more along a checklist form, the next step was a group training session", "Interview Questions": "tell me 3 qualities about yourself"}, {"date": "23 Oct 2017", "title": "New Grad RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grady Health System (Atlanta, GA) in Oct 2017", "Interview Descriptions": "It was very quick, maybe only 15 minutes. Group interview with nurse manager from the unit. The nurse manager was nice and easy going. Asked the same questions to everyone.", "Interview Questions": "Why Grady?"}, {"date": "6 Jul 2017", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Atlanta, GA) in Jul 2017", "Interview Descriptions": "i applied last month just got a call two weeks ago for an interview My interview went well i arrive 30 mins and we got started i was a little nervous but once we got started i felt in my element. normal questions nothing to be nervous about", "Interview Questions": "Name a time where you were in a difficulty situation "}, {"date": "31 May 2017", "title": "Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Grady Health System (Atlanta, GA)", "Interview Descriptions": "I applied online and got an email  2 days later to schedule an interview. I interviewed with 3 people (manager, doc, tech). They were very friendly. The interview was very laid back. I felt at ease. Just be yourself. They did ask me about everything on my resume  so be honest and be able to talk about it.", "Interview Questions": "How do you handle conflict?"}, {"date": "9 Oct 2017", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Grady Health System (Atlanta, GA) in May 2017", "Interview Descriptions": "It was quick and painless. I was able to interview for multiple specialties at once. The rest of the processing was a long process. I may have been due to hiring new HR staff,", "Interview Questions": "I was given a few scenario type questions."}, {"date": "23 Feb 2017", "title": "RN Residency Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grady Health System (Atlanta, GA) in Feb 2017", "Interview Descriptions": "Behavioral Interview. They were very laid back back. The first question they asked me is tell me about yourself. So from there they give you a chance to guide your interview and address any concerns they might have from looking at your resume. I interviewed on Thursday and got an email Wednesday night saying I got the job.", "Interview Questions": "Tell me about yourself"}, {"date": "16 Feb 2017", "title": "Sterile Processing Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Grady Health System (Atlanta, GA) in Feb 2017", "Interview Descriptions": "It was a friendly interview, the interviewer asked me brief questions about myself and we chatted. Nothing to serious or anything to be nervous about. It was a very casual interview, for those of you that are nervous. Just be yourself and let your personality shine through but also know the specifics about the job that you're applying for.", "Interview Questions": "They just asked me about myself and my interest in becoming a sterile processing tech"}, {"date": "24 Feb 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grady Health System in Feb 2017", "Interview Descriptions": "I interviewed with the residency program. I checked in at the door and waited until I was called. I sat down in a large conference room that was partitioned off for each specialty. I had two people interview me off of a list of question. It lasted approximately 30 minutes. HR gave each interviewee a bag and notebook on their way out.", "Interview Questions": "Describe your clinical experiences. Why did you choose this specialty? How would your fellow students/workers describe you? List your strengths/weaknesses. "}, {"date": "19 Dec 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System in Dec 2016", "Interview Descriptions": "I applied online and got an email 2 weeks later for an interview. I had a panel interview, and they both were nice, which made me feel comfortable. They asked me behavioral based questions.", "Interview Questions": "Q: Tell me about yourself.\r\nQ: What did you do in your previous job?"}, {"date": "2 Jun 2017", "title": "SICU RM Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Grady Health System (Atlanta, GA) in Dec 2016", "Interview Descriptions": "Basic peer interview. Buisness casual. Nice location. Reimbursed parking. Questions were open ended. Having a resume will benefit one greatly then the questions will be more than likely geared towards that. Check website for interview dates.", "Interview Questions": "What was your best experience as a nurse?"}], [{"date": "1 May 2017", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Atlanta, GA) in Oct 2016", "Interview Descriptions": "panel interview for new grad rn residency. previously specified area of interest as critical care. I had a specific ICU unit in mind, but the interview was broader for critical care in general. it was with all of the unit directors for the various ICU units. each manager went around and asked a couple questions. the process was very short. never asked what specific unit i was interested in.", "Interview Questions": "why choose grady"}, {"date": "9 Sept 2016", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grady Health System", "Interview Descriptions": "2 person interview. Some intimidating questions. But nice panel. Looking for integrity and honesty as well as retention in employees. Also , looking for ethical and caring employees. Calm environment. Want to make sure you understand hospital culture and values.", "Interview Questions": "Some current laws surrounding healthcare"}, {"date": "19 May 2016", "title": "Echo Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Grady Health System in May 2016", "Interview Descriptions": "Nice interview and Interviewers. Felt comfortable. I had to scan afterwards. The whole process was a positive experience. This hospital uses echo skills that most other places don't use. That's a plus!", "Interview Questions": "How would you acess a patient with aortic stenosis"}, {"date": "29 Mar 2016", "title": "Scheduling Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Grady Health System (Atlanta, GA) in Mar 2016", "Interview Descriptions": "I applied online which consisted of an application and assessment. The assessment was customer-service oriented and also sought to assess the candidate's personality. A few hours later, I received a call from a recruiter who wanted to schedule an interview. The following day, I went to the interview at Grady Memorial hospital. I was interviewed by two people. One was a executive director and the other was a manager, I believe. They both were extremely nice, which made me feel very comfortable. They asked me about my availability. After that, they each asked me behavioral based questions and wrote down notes in a packet. The questions were designed to assess candidates problem solving, critical thinking, time management, organization, and customer service skills. You'll be expected to present scenarios from previous jobs that you have had. Even though they were the ones asking me questions, it felt much more like a conversation.", "Interview Questions": "Tell me about a time where you dealt with an angry customer?\r\nWhere do you see yourself in five years?\r\nWhat are your major strengths?\r\nTell me about a time where you had to think outside of the box to solve a problem?"}, {"date": "14 Dec 2015", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grady Health System", "Interview Descriptions": "I put in an application online and a week later a someone from HR contacted me and asked me if I was still interested in the job. I of course said yes and the person I was speaking to said they were going to forward my application to the hiring manager of the unit. Two weeks later I heard from the unit manager who wanted to schedule an in person interview for that week. On the day of the interview I sat in a waiting area on the main floor of the hospital where I was eventually met by someone from the interviewing unit who took me up in the elevator to the unit. Once I was up in the unit I sat in the hiring nurse manager's office with another stay member from the unit.  I was then asked questions by both the manager and other staff member.  I received an email a week later for me to take two online assessments. A week after completing the assessments I got a call from someone in human resources with a job offer.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "5 Jan 2016", "title": "Reporting Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grady Health System (Atlanta, GA) in Dec 2015", "Interview Descriptions": "The hiring process was very formal and hiring manager used assessment to question skills beyond technical skills. The level of attention given to soft skills (people management) was significant. Advice to recruiting : Leadership and Communication Skills dove tail with people management skills. You are  loosing talent because how you are choosing people to fill jobs for a skill that you cannot measure.", "Interview Questions": "What adjectives your friends say about you? "}, {"date": "26 Aug 2015", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Grady Health System (Atlanta, GA)", "Interview Descriptions": "It was a good interview process not long at all. The recruiters were nice and professional. The staff throughout the process was professional as well. The manager was very professional the employees were friendly.", "Interview Questions": "How did I feel about working with a diverse group of  people? \r\nHow did I feel about working long hours?"}, {"date": "11 Aug 2015", "title": "Logistics Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Atlanta, GA)", "Interview Descriptions": "Fill out online assessment followed by face to face interview if you do well they will call you in to do a face to face with the supervisor and manger.", "Interview Questions": "Basic interview questions mostly scenarios like describe a time when you had resolve an intense situation at work."}, {"date": "13 Aug 2015", "title": "CNA Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grady Health System (Atlanta, GA) in Aug 2015", "Interview Descriptions": "Panel Style. What would you do questions. Usually in the breakroom of the floor you're interviewing for. Kind of casual but they really want to get a feel for what kind of person you are. Experience is a must.", "Interview Questions": "Tell me a time when you had to take charge when everyone else was busy?"}, {"date": "21 Jan 2016", "title": "Public Safety Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Grady Health System in Aug 2015", "Interview Descriptions": "Overall easy interview. Panel style interview with about 4 command staff members. The interview wasn't very in depth they were mainly talking to me about the types of things I'll deal with. They were also making sure I was willing to do certain things such as morgue duty etc.", "Interview Questions": "Asked if I would mind physically restraining patients?"}], [{"date": "2 Sept 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grady Health System (Atlanta, GA) in Aug 2015", "Interview Descriptions": "was taken up to the floor and talked to staff for a while then the charge nurse came in asked me typical question like tell me about your self, where you see yourself in 5 years, are you interested in an specialty areas. Then proceeded to go through a packet of behavioral questions", "Interview Questions": "tell me about a time when you dealt with a difficult patient"}, {"date": "17 Aug 2015", "title": "Business Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Grady Health System (Atlanta, GA) in Jul 2015", "Interview Descriptions": "It was a phone interview. They asked me about my work and project. Basically, they wanted to know about how I am using analytical skills and project management tools, techniques, and lean six sigma methodology.", "Interview Questions": "SQL experience"}, {"date": "25 Jun 2015", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grady Health System (Atlanta, GA) in Jun 2015", "Interview Descriptions": "I received a call to schedule an interview less than a week after applying. The Human Resource department was on top of their game and getting to the interviewer was a very seamless process. I interviewed with a supervisor for about 30-45 minutes where they used a worksheet to ask questions about how my education and previous work experience would benefit me in this position. There were a few situational questions (i.e. \"Tell me about a time when...\") and some were redundant, in my opinion. I asked about training opportunities, obtaining CPAR certification, and growth opportunities within the Patient Access department and the interviewer SEEMED very impressed and even said they were \"all about advancement.\" The interviewer said they would have a decision in the next 2-3 days and provided me with next steps: receiving a call from HR, coming in for orientation, meeting the Director, etc. that I interpreted to mean I would be getting an offer.\r\n\r\nI did not receive an offer and through the grapevine found out that the interviewer felt I \"only applied to get in the door\" at Grady. I have to say that not getting the job for that reason, and not because of a perceived inability to perform the job successfully, leaves a sour taste and negative impression of Grady's leadership. The interviewer had ample time to review my education and work history before contacting me for an interview so it seems a waste of our time and energy to complete it knowing that I exceeded the qualifications they were looking for.", "Interview Questions": "How do you feel your education will help you succeed in this position?"}, {"date": "7 Jan 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Atlanta, GA) in Jun 2015", "Interview Descriptions": "Applied online, received a call a couple of weeks later from HR.  Had a phone interview with HR, then an interview on campus with the CNO.  About 2 weeks later, I had an all day panel interview with multiple leaders.  Was offered the position within a few days.", "Interview Questions": "Tell us how you proactively educate yourself on healthcare regulatory requirements.\r\nTell us all you know about HIPAA.\r\nTell us about a time when you disagreed with your manager and how you handled it.\r\nTell us about a time you failed. "}, {"date": "13 Jul 2015", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Grady Health System (Atlanta, GA) in Jun 2015", "Interview Descriptions": "Screened by HR and then interviewed by HR. Then interviewed by CNO via Skype then invited in house to interview and have a tour of the facilities. It was a drawn out process for a position I did not get and the pay was extremely low when a quote was given by HR.", "Interview Questions": "Usual job questions."}, {"date": "2 Jun 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Grady Health System (Atlanta, GA) in May 2015", "Interview Descriptions": "The interview process was behavioral base and is set up in 1 or 1 interview panels. Everyone takes a turn asking you questions. The questions are based on your experience and would like to answer in STAR format. Try telling a story and be very detailed it works.", "Interview Questions": "tell me about a time that......"}, {"date": "24 Apr 2017", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System (Atlanta, GA) in Apr 2015", "Interview Descriptions": "A one hour telephone was scheduled, after jumping through that hoop, I was scheduled a 1 hour fact to face interview with a panel of three people, the hiring Executive Director, and manager and  the other specialist doing the similiar  job.", "Interview Questions": "All questions were behavior questions, tell me about a time . . . . . when this happened, how did you react, what was the outcome . . . . .   "}, {"date": "13 Mar 2015", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grady Health System", "Interview Descriptions": "Did application online, received assessment link in my email about 30 minutes later, gave me 7 days to complete and 48 hours once logged in. Recieved a call later for interview.", "Interview Questions": "Describe an incident where you helped a customer"}, {"date": "6 Mar 2015", "title": "Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System", "Interview Descriptions": "Online app, personality test, then typing test, then panel interview. It went fairly quickly. Went to onboarding and then a few weeks later went to orientation which was very thorough and detailed it was however very long and drawn out but there is lots of information to obtain during the session", "Interview Questions": "What would make you a good candidate?"}, {"date": "21 Feb 2015", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Grady Health System in Feb 2015", "Interview Descriptions": "Applied online, waited several weeks, spoke to unit director about my strong interest in working on their unit, recruiter called me to set up an interview two days later, interviewed with unit director formally for 45 minutes. Grady does panel interviews with a packet of situational questions.  Make sure that your answers relate back to previous work experiences.  1 hour later HR department called to offer me a position. I was emailed all the paperwork to fill out, scan and submit online.  Scheduled for vaccines (TB test & flu) and new staff orientation & classes.  Very positive experience with everyone I came in contact with.", "Interview Questions": "Situational questions, why I want to work there, long term goals, etc..."}], [{"date": "2 Dec 2014", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Grady Health System", "Interview Descriptions": "3months process. Clinical and Pharmacology Exam. Orientation Class before Unit Orientation, Grady has excessive turn over ratio. Grady also have significant number of employees that's been employed over 20 years", "Interview Questions": "Make sure understand Electronic Medical Records"}, {"date": "18 Nov 2014", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Grady Health System", "Interview Descriptions": "Very positive experience. The recruiter, unit director, and the unit were welcoming and kind. The whole process took about a month once the initial interview was scheduled. I look forward to a great career.", "Interview Questions": "Name your weaknesses"}, {"date": "18 Nov 2014", "title": "Guess Service Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Grady Health System", "Interview Descriptions": "Tell me something about yourself. Why would you want to work here? Where do you see yourself in 5 years. You will also meet with a panel of people. What does customer service mean to you and are you good a building relationships with your customers and if so, how do you go about doing that", "Interview Questions": "Tell me about a time you work in a team to reach a goal"}, {"date": "19 Nov 2014", "title": "Cardiac Sonographer PRN Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Grady Health System (Atlanta, GA) in Nov 2014", "Interview Descriptions": "Applied online and it was the most complicated application program I have ever experienced.  I would recommend the HR department to upgrade that system and ease the application process.  You are not able to manually type in more than 75% of the information; it is required to use 'school codes', 'license codes', and other vague numbers rather than manually enter your qualifications.", "Interview Questions": "General anatomical questions"}, {"date": "17 Jul 2014", "title": "Applications Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grady Health System", "Interview Descriptions": "There was a panel of people for the first round of interviews. At the end it was not made clear who will be my contact person or what the next steps are. The salary was not discussed at all. After asking for a status update I was told they will keep me posted but no one followed up. One day a recruiter calls me and offers a job but the it was already 1 month since the interview. And he was VERY rude and did not give any clear answer on when he needs the answer by. He also did not answer the questions I had about the position. After few days I contact him for an update and he says they decided to go with someone else. They are horrible with communication.", "Interview Questions": "Many situation based questions that sounded repetitive. "}, {"date": "2 Jul 2014", "title": "Licensed Mental Health Clinician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Grady Health System (Atlanta, GA)", "Interview Descriptions": "The  process from application to interview took 2 weeks, and they gave me their answer within another 2 weeks. The interview lasted 45-50 minutes, and was with a panel of current employees from the team I would be working with. Questions ranged from previous work experience to patient scenarios where it seemed like they were looking for my reaction, and going for shock value, though I know the scenarios were all based on actual happenings. The panel's questions were well rounded and probed at my exposure to various groups of people, my clinical abilities, creativity, comfort on a multi-disciplinary team and my self-care. Several questions touched on situations where I had to use quick judgment, fell short of reaching my goals or handled a difficult interpersonal interaction. They were looking for self-awaremess, willingness to ask for help, and ability to work on a team.They gave me an opportunity to ask questions at the end, which I was expecting so I had made mental notes of things I wanted to know more about. Overall a very pleasant experience.", "Interview Questions": "I was asked what my 5 year plan was, which is illegal. "}, {"date": "20 Aug 2015", "title": "RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grady Health System (Atlanta, GA) in Apr 2014", "Interview Descriptions": "The interview process was engaging, challenging and fulfilling. I was interviewed by the both the social worker manager and the case manager of the department. Both managers provided a even exchange of questions to determine my work ethics, history and experiences.", "Interview Questions": "The questions I asked were focused on the available in-line services available to the patients on discharge as this poses the biggest barrier during the discharge transition."}, {"date": "8 Mar 2014", "title": "Phlebotomist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grady Health System", "Interview Descriptions": "Went for interview with lab director and she was on the phone the whole time", "Interview Questions": "N/A"}, {"date": "5 Dec 2013", "title": "Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at Grady Health System (Atlanta, GA)", "Interview Descriptions": "Great process, was a little slow.", "Interview Questions": "How can you impact the patient being in administration"}, {"date": "14 May 2015", "title": "Systems Status Controller Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at Grady Health System (Atlanta, GA) in Aug 2013", "Interview Descriptions": "There where several interviews. Some where 1:1 and others where with a panel. That is all I remember about the interview.  They do it differentlyrics with everyone.  Apparently there's no system in place", "Interview Questions": "Can you multitask"}], [{"date": "30 May 2013", "title": "Department Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Grady Health System", "Interview Descriptions": "Long Interview/Hiring process.  As a Department Manager I was interviewed by Director and AVP.", "Interview Questions": "None.  Questions were related to the position."}, {"date": "3 Mar 2013", "title": "Junior Applications Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Grady Health System", "Interview Descriptions": "online application, face to face interview.", "Interview Questions": "What will you do on you first day on the job?"}, {"date": "11 Nov 2017", "title": "PRN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Grady Health System (Atlanta, GA) in Feb 2013", "Interview Descriptions": "The interview was very brief and simple. I showed up when I was told to and met the staff and the director. I was coming in with a referral so the process was pretty simple for me.", "Interview Questions": "N/A"}, {"date": "12 Nov 2013", "title": "Central Processing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Grady Health System in Oct 2012", "Interview Descriptions": "Very detailed, you will meet with several people from H.R. be prepared to tell them something about their company as well as been able to talk about an adverse quality about yourself.", "Interview Questions": "What are some of your weaknesses, and how you would over come them."}, {"date": "15 May 2012", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Grady Health System (Atlanta, GA) in Apr 2012", "Interview Descriptions": "The phone interview went well and then the first face to face interview went very well aand I had been given the position as a contractor. I got a call a week later for another interview and I thought the panel interview went well too but they made an offer to someone else", "Interview Questions": "How would you handle a difficult situation"}, {"date": "10 Apr 2014", "title": "Phlebotomist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Grady Health System in Aug 2011", "Interview Descriptions": "Two interview process , After the interview then you are called back to take a series of test and module guestion not moving on to final interviewing process continue when the job is then offered to you, Then you taken on a tour and shown were you will be working at.", "Interview Questions": "Why do you do what you do?"}, {"date": "4 Apr 2014", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Grady Health System (Atlanta, GA) in Apr 2010", "Interview Descriptions": "The RN running the unit was professional. However we rarely ever saw her come to the floor to make rounds. Paperwork kept her super busy.", "Interview Questions": "There were no difficult or unexpected questions presented."}, {"date": "30 Dec 2010", "title": "Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grady Health System (Atlanta, GA) in Sept 2008", "Interview Descriptions": "The overall hiring and interview process was a positive one. I received a call form the Recruiter to schedule a time and date for the interview. On interview day, I met briefly with the Recruiter and then with the Director of the department. I also did a panel interview with the other staff in the department. The entire process took 1-2 hours. I was offered the position before I left.", "Interview Questions": "Why do you want to work for Grady?"}]]