[[{"date": "25 May 2023", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Joseph's Healthcare Hamilton (Hamilton, ON)", "Interview Descriptions": "Panel interview with questions rotating between 6 people for an hour. A series of questions where I had 30 seconds to answer the question to determine how quickly I can think on my feet in a fast paced environment.", "Interview Questions": "Tell us about a time where you had difficulty with a coworker and how did you handle it?"}, {"date": "20 Mar 2022", "title": "Contracts Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Joseph's Healthcare Hamilton", "Interview Descriptions": "I applied online for the position. I heard back fairly quickly. It was a multistage process, with an initial interview followed by a second. The process was well organized and efficient. It moved very quickly.", "Interview Questions": "A mixture of getting to know you and behavioural questions "}, {"date": "20 Mar 2022", "title": "Contracts Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Joseph's Healthcare Hamilton", "Interview Descriptions": "I applied online for the position. I heard back fairly quickly. It was a multistage process, with an initial interview followed by a second. The process was well organized and efficient. It moved very quickly.", "Interview Questions": "A mixture of getting to know you and behavioural questions "}, {"date": "3 Oct 2021", "title": "Research Lab Technician Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Joseph's Healthcare Hamilton (Hamilton, ON) in Sept 2021", "Interview Descriptions": "Took about 2 weeks from applying, and then another week for the interview process. \n\nTwo rounds of interviews. The first was via zoom; then the next round was in-person to see the laboratory and the floor. There was a team of 4 prominent people in the interview process.\n\nThey are a bit disorganized and didn't clearly structure what would happen if I was hired. It sounds like they wanted someone to throw in and go. \n\nAlthough I felt that I could help their laboratory, I was not selected. They did not contact me to let me know I didn't get the position.\n\nHaving said that, they seem to be very busy right now with covid and are very lovely people. They hope to have someone to converse well with and have a positive impact in the laboratory environment.", "Interview Questions": "- Tell me about yourself\n- Why did you quit your last position?\n- Do you have any questions for us?\n\nMany questions were to start conversations. "}, {"date": "5 Aug 2021", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Joseph's Healthcare Hamilton", "Interview Descriptions": "Friendly staff and positive experience. Standard behavioral and situational questions. They want to make sure that you are a good fit for the organization and that you are qualified for the job.", "Interview Questions": "Describe a time that you disagreed with your leader/manager and how did you deal with that situation."}, {"date": "6 Sept 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Joseph's Healthcare Hamilton in Aug 2021", "Interview Descriptions": "It was very easy, very conversational and pleasant. There were 2 interviews. This position was for the Peter Boris Centre for Addiction Research. The first interview was with research manager, second interview with the PI. Both interviews were very relaxed and comfortable. No trick question, just talking about previous experience.", "Interview Questions": "Walk me through your resume\nHow did a day look in your last job \nWhat are the skills you think you would need to be able to work with patients with addiction "}, {"date": "19 Jul 2021", "title": "RPN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at St. Joseph's Healthcare Hamilton", "Interview Descriptions": "Initial interview was via zoom meeting - Two staff members were the ones who interviewed me. Largely situation based and past experiences were discussed. Was applying for the RPN-NRT position.", "Interview Questions": "Name some of the clinical experience you have had"}, {"date": "21 Apr 2023", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Joseph's Healthcare Hamilton (Hamilton, ON) in Jun 2021", "Interview Descriptions": "There was only one step to the interview process. The interview I found was easy. Definitely do your research about the company and the position you are applying for. At the end of the interview, they will ask for your references so if your interview is in person make sure you bring a typed document with your references.", "Interview Questions": "Tell me about yourself? What strengths can you bring to the team? Tell me a time you had conflict with team member and how you resolved it?"}, {"date": "19 Aug 2020", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Joseph's Healthcare Hamilton (Hamilton, ON) in Jul 2020", "Interview Descriptions": "The whole process took 3.5 weeks. Applied online through their career website early july. Got an interview arranged 2 weeks after that. and an offer was made half a week after. References were asked after the interview. Typical nursing interview type: situational, behavioral, and nursing knowledge", "Interview Questions": "Describe a time where planned or intervened on something but didn't expect the outcome that you got.  What steps you took after and why."}, {"date": "7 Oct 2019", "title": "RPN Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at St. Joseph's Healthcare Hamilton", "Interview Descriptions": "I interviewed for Seniors unit on west 5th.They hire you if you are the right candidate  and willing to perform the job as described during interview.Very easy going interview and honest interview.", "Interview Questions": "know 3 D's"}], [{"date": "30 Sept 2021", "title": "Foot Care Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at St. Joseph's Healthcare Hamilton (Hamilton, ON) in Feb 2017", "Interview Descriptions": "Welcoming atmosphere. The personnel who did the interview was eager to hire. The job was discussed right in the interview and what type of employee the company were looking for.", "Interview Questions": "why do you want to join the team"}, {"date": "6 Aug 2015", "title": "Administrative Assistant and Research Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Joseph's Healthcare Hamilton", "Interview Descriptions": "Online submission of resume and cover letter, submit availability sheet and in person interview with the study coordinator and senior research assistant followed by an interview with the principle investigator", "Interview Questions": "Scenario questions"}, {"date": "21 Feb 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at St. Joseph's Healthcare Hamilton", "Interview Descriptions": "After completing the online application, I was offered an interview via email within two weeks.  I was given multiple time slots to choose from - scheduling the interview was seamless and stress-free.  The interview was on time.  The questions and clinical scenarios were relevant and reasonable.  The atmosphere was friendly and comfortable.", "Interview Questions": "What do you anticipate to be an ongoing area of concern within this clinical area?  What suggestions do you have to contribute to resolving the concern identified?"}, {"date": "5 Jul 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at St. Joseph's Healthcare Hamilton", "Interview Descriptions": "Postings once a week on company website", "Interview Questions": "How would you deal with meeting targets while needing to motivate resistive employees?"}]]