[[{"date": "26 Jul 2022", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Boca Raton Regional Hospital in Apr 2022", "Interview Descriptions": "It was planned out well with questions being answered and meeting the manager right away. They were able to explain how the hospital has grown and what accomplishments they have", "Interview Questions": "Tell me a time you had a disagreement with someone and how did you handle it"}, {"date": "22 Feb 2022", "title": "Director of Business Development Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Boca Raton Regional Hospital (Boca Raton, FL)", "Interview Descriptions": "3 steps with different teams from onset with a phone screen.   all professional and inviting teams.\r\n\r\nQ &A bridged between physicians, customers and backend to endure smoothest quality possible from intakes and results", "Interview Questions": "experience with lab intakes and change integration in processes "}, {"date": "27 Feb 2019", "title": "Scheduler Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Boca Raton Regional Hospital (Boca Raton, FL)", "Interview Descriptions": "First interview was short straight to the point. Second interview with DON was more detailed. Great interview process with questions on how to handle situations. Interviewers were pleasant and honest about position. Good interview all in all.", "Interview Questions": "What would you do if your job became too easy?"}, {"date": "12 Nov 2019", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boca Raton Regional Hospital (Boca Raton, FL) in Feb 2019", "Interview Descriptions": "In depth and well organized. The interview process flowed well from the initial telephone screening until my 1:1 meeting with the department heads. I was interviewed by 2 personnel who seemed to know the perfect process of a great interview.  Interview lasted about 25 mins and i felt comfortable and never rushed.", "Interview Questions": "How many years have you been in the healthcare field"}, {"date": "11 Feb 2019", "title": "Medical Social Worker Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2+ months. I interviewed at Boca Raton Regional Hospital in Jan 2019", "Interview Descriptions": "The interview process was horrendous. It took them over a month to actually reply after Initial application was submitted to even express interest for an interview. I completed the interview within 2 days per there request. Then it took HR over a month to even reach out with a determination from the interviewing process. I was offered the job verbally but I countered offered then was told I need to submit pay check stub. I submitted my written request for counter offer as requested  and then they no longer were interested and wanted to give the position to another candidate. HR expressed that I could apply to other jobs in which I politely declined.", "Interview Questions": "Do you have experience with discharge planning and linking services to the community?"}, {"date": "14 Jan 2019", "title": "Health Unit Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Boca Raton Regional Hospital (Boca Raton, FL) in Dec 2018", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps.INTRODUCTIONS. This is your opportunity to make a great first impression. Small talk. This stage is aimed at developing rapport. ...\r\nInformation gathering. \r\nASKING QUESTIONS", "Interview Questions": "How do you anticipate the needs of an executive? "}, {"date": "23 Jun 2022", "title": "Patient Experience Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boca Raton Regional Hospital (Boca Raton, FL) in Sept 2018", "Interview Descriptions": "I assisted two interviews for the position, with different people from a team. It seemed like a competitive position and decision was based on one person at the last interview.", "Interview Questions": "Name a situation in which you had to apply your knowledge to solve a patient interaction issue"}, {"date": "7 Feb 2018", "title": "IT Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Boca Raton Regional Hospital", "Interview Descriptions": "Wait for it---> Spent almost 3 hours completing application / testing online. Waited... and waited. Almost two weeks go by - Email: \"Sorry, we aren't going to interview you....\" \r\nTHE KICKER: Found out later, the job was NEVER really available to the public. It was ALREADY going to someone at the company.\r\nI will NOT waste time applying to this company again!", "Interview Questions": "They didn't really ask me any questions other than filling in your personality traits."}, {"date": "4 Oct 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Boca Raton Regional Hospital (Boca Raton, FL) in Dec 2017", "Interview Descriptions": "HR process was average. Really no issues. Actual interview for the position was disappointing since I was expecting to interview with the manager. Was interviewed by 2 Staff nurses instead. No explanation as to why she was not available for the interview.  Would have rather rescheduled.", "Interview Questions": "What my skills included as far as bedside care. What My availability was.  The interview felt rushed and I was not given the chance to ask several questions I had about the unit/patient population, etc. Also, was not offered a tour of the floor or introduced to any other staff."}, {"date": "11 Aug 2017", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Boca Raton Regional Hospital (Boca Raton, FL)", "Interview Descriptions": "I applied online, and I received a call from HR the next day. I scheduled my interview for the day after. I was shocked that HR called me as quick as they did, since most places take a few days to a week to review applications and get back to you. At my interview, I had 4 people interviewing me at once, so beware- they like to do group interviews. They asked mostly personal questions, like why do you want to work here, why you want to be an assistant, and a lot of scenario situations, like \"how would you handle yourself if this happened\" or \"what would you do if a patient was being rude to you?\" They didn't really focus too much on my experience, but they did ask where I worked now, and why I was looking for a new job. Overall, all the people I interviewed with were extremely friendly. After the interview, i asked my questions, and they said they'd let me know about the job sometime next week. I got a call from HR the day after and was offered the position.", "Interview Questions": "Why do you want to work as a Medical Assistant?"}], [{"date": "3 Dec 2018", "title": "Accounts Receivable Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Boca Raton Regional Hospital (Boca Raton, FL) in Jul 2017", "Interview Descriptions": "You will be interviewed by the manager and future peer. Everyone will ask you different questions, about character and related to the position your are applying. Be sincere, If you don't know say it, is better than fooling around, If you are not technically prepare but you demonstrate to care and potential to learn they will give you the opportunity to study and come back for a second interview.", "Interview Questions": "How would you handle an upset patient call?"}, {"date": "18 Aug 2016", "title": "Clinical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Boca Raton Regional Hospital (Boca Raton, FL)", "Interview Descriptions": "I applied online through Indeed. I received a call back from an HR recruiter 6 days later. There was a phone screening, where I was asked about my certifications and experience. We talked about shifts and hours. She discussed pay with me right then because she noticed from my application that I was making more than the position offered. She told me that the pay for 2 years experience and I gave her a different number that I wanted, and she told me the pay was non-negotiable. I said fine. She put me through for an interview with two hiring Nurses on the floor for the following week (for a unit I didn't have enough experience for surprisingly).\r\n\r\nThere were two hiring nurses there to interview me for the first round of questioning. They asked me to tell them about myself, they asked about experience, skills, certifications, and future education plans. I got the feeling they were very interested in me because I'm a student who plans to further my education and could grow within the hospital. They also asked behavioral questions and gave me scenarios I may be put in and asked what I would do, etc. They were both nice! After they finished, they brought in two RN's who work on the floor and told me they (the hiring nurses) were going to leave and give me a chance to ask the RN's anything I wanted to know about what it's like to work there without them in the room. Then the RN's also questioned me. They were also nice, and asked many of the same questions as the hiring nurses did. That second round of questioning was much shorter than the first. After that, one of the hiring nurses came back in and offered to give me a tour of the unit. As we walked around she kept stopping to introduce me to people who would be my co-workers. She told me what the next steps would be: a 2 day orientation and a 2 week preceptor-ship. She also mentioned (two times) that she still had two other candidates to interview before she was going to make a decision.\r\n\r\nA week went by and I didn't hear back, so I called to follow up because I had another offer from another hospital pending. When I called the HR recruiter offered me the position with the pay she quoted me during the phone screening. I told her I would need to consider it, and I would let her know in 24 hours. I originally emailed and declined their offer because the other hospital made me a better one. Within 5 minutes I got a call from HR wanting to find out why I didn't accept the offer, and they wanted to know if there was anything they could do to change my mind. I explained to them that I had a better offer from somewhere else and then she made me a better offer than that one! So I waited a day to consider and then ended up accepting the position after all. Which is funny because she originally said it was non-negotiable, yet she increased the hourly rate by almost $3.00. It just goes to show, don't let anyone tell you a hospital staff salary isn't negotiable! Because it IS! As long as you make them fall in love with you first.", "Interview Questions": "Tell me about yourself?"}, {"date": "4 Aug 2016", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 days. I interviewed at Boca Raton Regional Hospital (Boca Raton, FL) in Aug 2016", "Interview Descriptions": "Very professional asked pertinent questions that applies to the position I was applying for.  They asked about my previous employer from a different state and what my duties were there.", "Interview Questions": "What is your reason for seeking employment at boca hospital"}, {"date": "22 Oct 2017", "title": "EKG Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Boca Raton Regional Hospital in Jan 2016", "Interview Descriptions": "The the interview with clinical staff was Great,  very comfortable atmosphere. The hr department was disinterested and disconnected, don’t be dissuaded by this. Overall high marks are deserved fo patient care and a commitment to quality care.  I have been treated very well and I will probably stay for a while.", "Interview Questions": "We discussed clinically relevant topics regarding cardiac electrophysiology. I was asked why I was interested in tech positions c.... onsidering my credentials and experience far exceeded the position requirements"}, {"date": "18 Aug 2015", "title": "Human Resources Generalist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Boca Raton Regional Hospital (Boca Raton, FL) in Jul 2015", "Interview Descriptions": "Phone call was received with an offer to meet. The interview with one individual leader in HR. Many questions on work experience. They like to know about you so they will ask where you're from, what you do, and where you want to be professionally. They ask for your opinion on different matters pertaining to the role in which you are applying for.", "Interview Questions": "Why do you think you would be a good addition to this department and role?"}, {"date": "14 Jun 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Boca Raton Regional Hospital (Boca Raton, FL) in Jun 2014", "Interview Descriptions": "Very short, looked over my resume and asked some questions. Internship based on availability. recommend to apply as soon as possible for better chance to get in your area of interest.", "Interview Questions": "What would you like to do? Interests"}, {"date": "1 Aug 2015", "title": "Pharmacy Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Boca Raton Regional Hospital (Boca Raton, FL) in Nov 2013", "Interview Descriptions": "First you will have a brief phone interview with the manager, then an interview with both the manager and the director. The interview was in the directors office and all of the staff was very nice.", "Interview Questions": "How will you bring value to the operation? Where do you see yourself in the next 5 years? Do you plan on continuing your education?"}, {"date": "3 Jul 2015", "title": "Patient Care Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Boca Raton Regional Hospital (Boca Raton, FL) in Oct 2013", "Interview Descriptions": "Very regimented. Includes peer interview all of the time.  Interviewer has standard list of questions. i.e. What is one thing you did in customer service that stands out?  Name an instance when you had a conflict with a co-worker and how you resolved it?  How would you handle a co-worker who wasn't doing their share of the work?", "Interview Questions": "How would you deal with a co-worker who was not doing their share of the work?  Who would you approach?"}]]