[[{"date": "1 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Floyd Medical Center", "Interview Descriptions": "Based largely on experience and personal character. Not difficult questions, but come prepared. Interview was comfortable and not nerve wrecking so long as you prepare prior to interview. Non-intimidating management.", "Interview Questions": "Tell me about your past experience. "}, {"date": "8 Jun 2021", "title": "Front Office Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Floyd Medical Center (Rome, GA) in Jun 2021", "Interview Descriptions": "The interview was set up with in a few days time. Everyone was exceptionally nice. The process ran smoothly and I feel as though they asked appropriate questions for the position that I applied for.", "Interview Questions": "Do you feel as though you could handle the tasks at hand?"}, {"date": "21 Oct 2021", "title": "Security Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Floyd Medical Center (Rome, GA) in Apr 2021", "Interview Descriptions": "Called for interview and panel interview conducted on site.  Interview consisted of 'give me an example of a time' type questions'. Ultimately was not selected for the position and have not since re-applied for position", "Interview Questions": "Give me an example of a time you went above and beyond the call of duty?"}, {"date": "30 Nov 2020", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Floyd Medical Center (Rome, GA) in Nov 2020", "Interview Descriptions": "I met with the Assistant Director of the in-patient pharmacy on the first floor. The interview was resume based and revolved around my past experiences as well as a discussion about retail versus a clinical setting.", "Interview Questions": "Availability, Experiences, Certifications and Licenses. "}, {"date": "3 Feb 2021", "title": "Summer Nurse Extern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Floyd Medical Center in May 2020", "Interview Descriptions": "Panel interview via zoom with several members of the hospital. Questions were pretty basic behavioral questions. They gave me the option to tell them my top unit and why I chose it.", "Interview Questions": "What has been the hardest part of nursing school so far? "}, {"date": "17 Sept 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Floyd Medical Center (Rome, GA)", "Interview Descriptions": "Brief interview with HR then on to hiring manager and maybe assistant manager of unit.\r\nAwait an offer or denial. Accept offer. Consent to drug screen and background check approx 7 days wait time", "Interview Questions": "Describe a situation where you had to deescalate a patient concern and how did you do it?"}, {"date": "21 Apr 2018", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Floyd Medical Center (Rome, GA)", "Interview Descriptions": "Laboratory Supervisor called  to set up in-person interview. I was given tour of phlebotomy area and entire lab. I met with the Laboratory Director and also met other members of the phlebotomy tean", "Interview Questions": "Why FMC?"}, {"date": "14 Dec 2017", "title": "Ultrasound Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Floyd Medical Center (Rome, GA) in Dec 2017", "Interview Descriptions": "They interview process was very laid back and not at all intimidating.  It was a one on one interview with the manager of the department.  This was my first time speaking with her, but she seemed like a lovely person, and was very straightforward about what they were looking for in their next hire.  The interview did not have a lot of structure - the details of the position were explained, and not a lot of questions were asked of me.  In a way this was more difficult, because I did not know if I should bring up any points about myself to discuss without them being asked for.", "Interview Questions": "She asked if I had any questions about the position"}, {"date": "24 Mar 2017", "title": "Catering Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Floyd Medical Center (Rome, GA) in Mar 2017", "Interview Descriptions": "Explained benefits , job duties , and basic functions . She actually asked which position i wanted and which one I thought would fit me more . She also explained to me the hours which they are working which are 12 and 6 hour shifts.", "Interview Questions": "Are there any days or hours I couldn't work."}, {"date": "22 Aug 2016", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Floyd Medical Center (New York, NY)", "Interview Descriptions": "ease of communication with department about the project. friendly interview attendees, honest and openness of workflow, discussion of schedule and time frame of project completion.  discussion of salary after all attendees had left.  no times of silence  very comfortable", "Interview Questions": "Do I enjoy weekly travel"}], [{"date": "12 Feb 2016", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Floyd Medical Center (Rome, GA) in Feb 2016", "Interview Descriptions": "The woman I interviewed with was really sweet. I met with one of the CNAs that worked on the floor on first shift and she told me how it would be on the floor. It was over all a very good experience. I've been wanting to interview there for a while.", "Interview Questions": "Are you a hard worker?"}, {"date": "1 Dec 2014", "title": "Office Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Floyd Medical Center", "Interview Descriptions": "Never got interview,have put in for 25 jobs have resume and can do job but once I put down year gradulatef from school never get interview. Worked 15 years for contractor there and retired but I need to work and love fmc.I can do customer service,office work ,registration. Advocate as long as I can do the job what does it matter about age. I don't need benefits at all", "Interview Questions": "Age graduate from school"}, {"date": "8 Aug 2017", "title": "Recepionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Floyd Medical Center (Atlanta, GA) in Dec 2013", "Interview Descriptions": "The interview consisted of meeting on a one-on-one basis with the Pediatrician I would be working for. We reviewed my previous work experience, and spoke of the type of person they were looking for.", "Interview Questions": "Do you have experience with ___________?"}]]