[[{"date": "18 Apr 2023", "title": "National Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 months. I interviewed at World Food Programme", "Interview Descriptions": "Written assessment (there might be a language proficiency test prior to that in some cases) followed by a competency based interview. The written assessment is technical. Tests depend on the position you apply for and the difficulty is moderate to high and usually it’s between 2 to 4 hours. You have to set aside time to complete the test because once you open it you activate the timer. The test also has access to your camera and records violations such as (depending on instructions) using the internet (if not allowed in your particular case)", "Interview Questions": "Describe a conflict that happened within your team and actions you took."}, {"date": "12 Oct 2022", "title": "Consultant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "After submitting an application, WFP would invite you for a technical assessment. The assessment is based on the job and measures your knowledge about RAM. After the technical assessment, you would be invited for a panel interview.", "Interview Questions": "Describe a time when you had to work with different stakeholders"}, {"date": "29 Oct 2021", "title": "Procurement Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme", "Interview Descriptions": "The process was normal, but i didn't get a feedback till i contacted them. After while they said i was rejected and then contacted me if i am still interseted! i replied to them but then no feedback again!", "Interview Questions": "Normal interview Qs no new."}, {"date": "4 Aug 2021", "title": "Government Partnerships Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "- was quite smooth and went as expected.\n- I had to use the star technique.\n- I was asked about what I know about gender.\n- the panel was generally positive.\n- Almost all questions were competency based questions, but there was no surprises at all.", "Interview Questions": "What do you know about the topic of gender?"}, {"date": "26 May 2021", "title": "Communication Intern Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Food Programme", "Interview Descriptions": "The interview was difficult and disorganized. The interviewer made it extremely hard to get two words in without interrupting me. I am a huge fan of the WFP and its work but the interviewer made me not want to work there", "Interview Questions": "How many social media accounts can you manage simultaneously?"}, {"date": "11 Sept 2021", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at World Food Programme (Cairo, Cairo Governorate) in May 2021", "Interview Descriptions": "It was a competency based interview that was consisted of 6-7 just situational questions . I feel this is not a fair interview type to depend on especially for people with short memory who are required to recall situations on spot. I haven’t also hear from them with the interview results. Note: I applied for the job in jan, got the test in march, and got the interview in may!!", "Interview Questions": "After introducing yourself, give situations on which you have proved innovation, conflict management, decision making, and gender"}, {"date": "27 May 2021", "title": "Project Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Food Programme in Apr 2021", "Interview Descriptions": "first a written exam: include technical skills related to the job. the exam is computer based on the wfp laptop, you will be asked to use MS office tools, word and excel.", "Interview Questions": "Event and TOT planning, Budget planning"}, {"date": "10 Aug 2020", "title": "Finance Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Cairo, Cairo Governorate) in Jul 2020", "Interview Descriptions": "It was an technical assessment and not that hard. Also, English assessment was mandatory for this position. But, I still did not receive any response whether I passes or not.", "Interview Questions": "Basic questions on finance. \r\nTrue or false and mcq."}, {"date": "20 Apr 2020", "title": "Partnerships Officer NOA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Cairo, Cairo Governorate) in Jan 2020", "Interview Descriptions": "the interview revolves around competency based questions. only at first you go through your resume. you have to be well acquainted with the job announcement for it contains the competencies they are going to test in the interview.", "Interview Questions": "Tell me about a situation you had at work where you went above and beyond your manager's expectations."}, {"date": "31 Dec 2021", "title": "Business Transformation Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Cairo, Cairo Governorate) in Apr 2019", "Interview Descriptions": "Situational Interview Questions on the Hr and IT levels.\nIt was 2 Interviews Together after phone one.\nIt was about an hour onsite Interview before pandemic.\nWAs fair Interview with moderate questions.\nTell us about Innovative Idea you presented, Tell us about tough situation you faced.\nThey were 4 in the Interview", "Interview Questions": "Situational Interview Questions on the Hr and IT levels.\nIt was 2 Interviews Together after phone one.\nIt was about an hour onsite Interview before pandemic.\nWAs fair Interview with moderate questions.\n"}], [{"date": "15 Jul 2019", "title": "Head of Business Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Food Programme in Mar 2019", "Interview Descriptions": "through video call with unsuspecting question and time as well you cant estimate the time for the interview and as well the number of question this is the main issue i faced during the interview", "Interview Questions": "what is your best challenge you faced "}, {"date": "22 Apr 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at World Food Programme (Cairo, Cairo Governorate) in Mar 2018", "Interview Descriptions": "It recriutment process takes 2 months after submitting the application the contact with me after three weeks for the online written test and then one month later they invited me for the interview", "Interview Questions": "Q. Why should we hire you?"}, {"date": "23 Oct 2017", "title": "Government Partnerships Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at World Food Programme (Cairo, Cairo Governorate)", "Interview Descriptions": "It was a panel interview of three ladies and a lady from the HR Department in a meeting room. It took around twenty five minutes. One lady was extremely friendly, one was neutral and the the third was quite unpleasant.", "Interview Questions": "Tell us more about yourself.  They also asked for previous case studies that demonstrate ability to work in a team or work under pressure. "}, {"date": "5 Sept 2018", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at World Food Programme (Cairo, Cairo Governorate) in Jul 2017", "Interview Descriptions": "About a month after submitting my application, I was notified that I had been shortlisted to submit a design task in form of a home exam. Time given were 3 days. About three weeks after that, I was invited for interview. The date of the interview was fixed, you had to take it or leave it, but no possibilities for re-scheduling were allowed. The interview itself was in front of a panel (including one that participated remotely from another office via phone). It was timed to 30 minutes and standard questions used in 'behavioural interviews' were applied, as well as questions regarding some more specific design issues relevant to the job. \nI was not notified at any point after the interview that it had been unsuccessful.", "Interview Questions": "Explain your ideas behind the submitted info graphics (that were you sent as part of the home exam)?"}, {"date": "13 Aug 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at World Food Programme (Cairo, Cairo Governorate) in Jun 2015", "Interview Descriptions": "My interview was over the phone. It lasted about 20 minutes. They asked me questions based on my previous work experience. Also, they asked knowledge-based questions about the global food crisis.", "Interview Questions": "What motivated you to apply for this job?"}]]