[[{"date": "19 Apr 2023", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthRIGHT 360", "Interview Descriptions": "Over the phone, then in person with group and direct manager and their boss. Seemed very collaborative and indepth. I enjoyed learning more about the organization. The entire process was very long. Lots of time waiting for folks to get back to me.", "Interview Questions": "What is my experience dealing with people with multiple types of issues?"}, {"date": "22 Feb 2023", "title": "Data Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at HealthRIGHT 360 (San Diego, CA) in Feb 2023", "Interview Descriptions": "This was probably the worst interview experience I've ever encountered. Let me explain, first off the interviewer was late to the time in which we both agreed on. Second, the interviewer cut me off many times and had to call me back because of some distraction in the background. Third, my interviewer was not prepared what-so-ever, he was sifting through questions and also answered his own question that he was going to ask me.", "Interview Questions": "What are some skills that would help you succeed in this role?"}, {"date": "10 Oct 2022", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at HealthRIGHT 360 (San Francisco, CA) in Sept 2022", "Interview Descriptions": "It was brief and to the point . An assignment was included to get an idea of my skills related to the job. Feedback was also delivered timely. And coordination was smooth.", "Interview Questions": "Experience, Recruitment strategies, education background etc."}, {"date": "18 Jul 2021", "title": "Alcohol and Drug Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at HealthRIGHT 360", "Interview Descriptions": "Covid has put a damper on everything. The process took three months , due to them putting my name through three background checks. The interview it’s self was fine, three rounds of interviews which consisted of complicated questions.  It was hard to get a hold of people, but I’m glad that I went through with everything", "Interview Questions": "It was mainly about your experience "}, {"date": "12 May 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthRIGHT 360 (San Francisco, CA) in May 2021", "Interview Descriptions": "Interviewer was very friendly. They asked a lot of question such as my experience and how to handle stress and maintaining time. She was super understanding of my lack of experience in terms of interacting or working with people who have certain mental health issues.", "Interview Questions": "What do you do to stay organized and managing your time? \nHow do you manage chaos in the work environment?\n"}, {"date": "4 Nov 2020", "title": "PA-C Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthRIGHT 360", "Interview Descriptions": "There was a screening phone call and then that was followed by video interview with many of the team members.  Very comfortable and very friendly team members.  Asked standard interview questions with a small clinical component.", "Interview Questions": "why do you want to work here? "}, {"date": "28 Aug 2020", "title": "Mental Health Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at HealthRIGHT 360 (San Francisco, CA) in Aug 2020", "Interview Descriptions": "It was via zoom and the participant was on time. I enjoyed talking with her and she was very friendly. She set up the expectations of the job requirements and answered all my questions. I appreciated that it was kept within the time frame and it was obvious that she was prepared for the interview.", "Interview Questions": "What my experience was like in mental health and with high risk people. "}, {"date": "4 Jul 2019", "title": "Substance Abuse Counselor, Level I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthRIGHT 360 (San Francisco, CA)", "Interview Descriptions": "Interview was almost absent. The job description posted did not match the one I was interviewed for. One was for assessing client needs, the other was for teaching! Was told to take a long test on a very old computer. The test was timed, checking spelling mistakes, etc. Men in the room were very noisy and inconsiderate, it was hard to focus. I had much teaching and research experience, but I wasn’t asked about that, nor did I had a chance to mention it in my resume as teaching was not mentioned in the job ad.", "Interview Questions": "Why did you apply? "}, {"date": "7 Nov 2018", "title": "Patient Access Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at HealthRIGHT 360 (San Francisco, CA)", "Interview Descriptions": "The interview process was so drawn out and I had to continue to follow up to get ANY update. It almost felt like they forgot about me! The interview itself was very thorough and very accurate; they were very honest about how the day to day operations would be working here.", "Interview Questions": "What makes you a good candidate for this position?"}, {"date": "1 Oct 2018", "title": "SUD Counselor I Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HealthRIGHT 360 (San Diego, CA) in Sept 2018", "Interview Descriptions": "I applied online, on their website. I then got an email for a phone screening, passed. After the phone screening, I was asked if a certain date was okay. I went on the day scheduled, and it was an interview with two different individuals.", "Interview Questions": "How would you handle someone in distress?"}], [{"date": "20 Sept 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthRIGHT 360 (San Francisco, CA) in Aug 2018", "Interview Descriptions": "Phone screening with Human Resources and after that the interview at the head office. Another interview and they did a background check. After the background check I received an offer from them. I accepted.", "Interview Questions": "Tell us about your work experience."}, {"date": "15 Mar 2022", "title": "Drug and Alcohol Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at HealthRIGHT 360 (San Francisco, CA) in Aug 2018", "Interview Descriptions": "This was an interview for an internship position. The first phase was a test of computer skills. Next, there was an initial interview of two candidates at a time, facing a panel of about 20 program heads. with myself and another applicant. We were each asked several questions, but one which stood out was to describe my diversity experience--with a demographic my interview partner was a member. Not only did I think that was tactless, I was less detailed than I might have been as a result and that might have hurt my chances. Then I got notified that several program heads were interested in interviewing them for their programs. I followed through on one of them for a second interview, which began with the department head but later included the clinical director as well.", "Interview Questions": "Are you comfortable working with transgender people?"}, {"date": "2 Aug 2018", "title": "Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at HealthRIGHT 360 (San Mateo, CA) in Jul 2018", "Interview Descriptions": "It was about 1:20 minutes. 3 different program coordinators interviewed me. The interview lasted about 1 hour and they made me do a computer test that was based on simple math and grammar as well computer literacy", "Interview Questions": "What do you do for self care "}, {"date": "30 Jul 2019", "title": "Recovery Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at HealthRIGHT 360 (San Francisco, CA) in Mar 2018", "Interview Descriptions": "The process was one interview with the hiring manager and some on hand staff. It was three people firing questions at you about your recovery experience. Overall it was pretty easy as long as you have experience in recovery and work a strong program yourself.", "Interview Questions": "Whats the first thing you do when you wake up in the morning?"}, {"date": "5 Jul 2017", "title": "Care Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at HealthRIGHT 360 (San Jose, CA) in Jul 2016", "Interview Descriptions": "Phone screening. Interview with two staff for first interview. Second interview is conducted by clinical supervisor to assess clinical skills and thinking. There was also a test on mathematical skills and some questions asking about documentation and note taking experience.", "Interview Questions": "Why are you interested in this position?"}, {"date": "21 Nov 2017", "title": "Front Desk Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HealthRIGHT 360 (San Francisco, CA) in Nov 2015", "Interview Descriptions": "Started with a phone screen, then called in for 1st in person interview. If that goes well, you get called back for the 2nd in person interviews and take the computer skills test. Then they do the background check which takes a very long time, can be up to a month or even longer. They only start on the 1st and 16th of the month and verify every job and education you list on application.", "Interview Questions": "Where are you from and how does that inform who you are? "}, {"date": "1 May 2015", "title": "Health and Wellness Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at HealthRIGHT 360 (San Francisco, CA)", "Interview Descriptions": "Met with my director, asked me about my health care experience, oriented me to the facility and introduced me to manager/director of facility. During second interview I met with my director again and 2 coworkers who were in the same job title I was applying for, and they all took turns asking me questions about how i would handle certain  situations,  difficult clients, etc", "Interview Questions": "They asked how I would handle different (stressful  or problematic) situations"}, {"date": "29 Feb 2016", "title": "Overnight Monitor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at HealthRIGHT 360 (Escondido, CA) in Jan 2015", "Interview Descriptions": "There is two interviews. They ask about work experience, behavior questions, what do you know about the place? etc. My overall interview process was excellent. I was very nervous and my bosses made it comfortable for me. They are very nice and are looking for people who are compassionate, know about alcohol and other drugs. Is at least going to school and learning about drugs, etc.", "Interview Questions": "Why do you want to work for us?"}, {"date": "1 Sept 2015", "title": "Administrative Assistant/Patient Advocate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at HealthRIGHT 360 (San Francisco, CA) in Jan 2013", "Interview Descriptions": "you apply online, submit cover letter and resume. \r\nthose applications are then sent to the hiring manager and or his/her staff for review. \r\nYour application is than skimmed and based on interest and education they will call you in for an interview. No double interviews - you have 1 shot. \r\n\r\nyour brought in - Director of Operations and or Vice President and possibly Medical director will interview you. They'll give you a history on the clinics and the mission, and core goals. You'll learn about the tons of programs HR360 offers now and an intro to clinic life and the way the organization functions and what your role would be on the \"Team\"", "Interview Questions": "How would you deescalate a visibly agitated client?"}, {"date": "29 Feb 2016", "title": "Health Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at HealthRIGHT 360 (San Francisco, CA) in Dec 2012", "Interview Descriptions": "Was contacted by the HR hiring personnel to set up a phone interview. Was asked a series of questions and asked to come in for an in person manager. Met with program director and HR hiring manager. Was asked about 10 questions. Interview took about 30 minutes. Was told I would be contacted over the next few days if I was the right person for the position.", "Interview Questions": "How is your previous experience in healthcare prepared you for this position"}], [{"date": "10 May 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at HealthRIGHT 360 (San Francisco, CA) in Aug 2012", "Interview Descriptions": "Easy. One step interview with your new supervisor. A lot of people are not interested in working here so they are desperate for any intern that wants to work there. All of my intern colleagues could not wait to leave.", "Interview Questions": "Background; school"}]]