[[{"date": "28 Apr 2023", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Apr 2023", "Interview Descriptions": "The interview process was very quick – the recorded interview, virtual interview with the director and another staff member, and in-person interview with other team members all happened within a week. Communication was consistent and the next steps were clear. . . until they weren't. No one reached out to tell me I didn't get the job, and instead, I found out through the job portal dashboard that I wasn't selected for the position. After that quick buildup, an emailed rejection would have been nice. Also, make sure to be on campus at least 15 minutes early, as there can be hold-ups at the security gate, and you'll likely have to park on one of the upper levels of the parking garage. No one gave me this heads up, and I'd never been on the campus before, so take note!", "Interview Questions": "What are your values? How have you handled a difficult client or coworker?"}, {"date": "21 Mar 2023", "title": "Business Support Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "It was a very long and drawn out process (about 6 months). The first part was a HireVue interview that involved recording your the answers to the questions. This went to spam and no recruiter reached out to let me know I should be completing the HireVue, so I nearly missed it. Then, I had 2 virtual interviews with the hiring manager and a few team members. Finally, I was invited to campus for a half day panel interview and presentation. After the on campus visit, I heard about a week or two later via email from the recruiter that I had not gotten the position. Great organization, but I'm not sure I would want to go through that lengthy of a process again for the level of position usually is only 1 or 2 interviews elsewhere.", "Interview Questions": "They asked many situational questions and questions about resources I had used in the past"}, {"date": "28 Feb 2023", "title": "Mobile Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "I had a call with a recruiter, and then an interview with the hiring manager and a team member. The interview was mainly a discussion about my familiarity with the technologies they use. There wasn't a whiteboarding or technical challenge portion. Unfortunately, they ghosted me after the interview. I didn't receive a rejection, or any status updates. I emailed them once to check status, and then gave up after they didn't reply.", "Interview Questions": "They walked through different third party frameworks they use within the app, and asked me my familiarity with them."}, {"date": "25 Feb 2023", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "3 rounds of the interview process: 1. Phone screen where you talk to the hiring manager 2. Take-home technical assessment. Mine was to design and implement a few features in an existing application 3. A day-long on-site interview where you meet the entire team a people from the department.", "Interview Questions": "Behavioral questions were mostly related to talking about yourself, your skills, and why you want to work for St. Jude. They want to see if you can work together with everyone there. Take-home technical assessment was as a 3 hours timed box assessment where you design a simple feature in an existing application. This is to show your skills in various aspects of software engineering such as database design, frontend, backend, etc. Onsite technical interview was mostly doing some code review and general OOP questions"}, {"date": "30 Mar 2023", "title": "Senior Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Dec 2022", "Interview Descriptions": "I did not like this interview process. It was incredibly long and drawn out. I had an initial screening, then a recorded HireVue, Interview ( which was very long as well, also like the previous commenter wrote, I almost missed the email b/c no one reached out). After that I had a lengthy (5) person panel interview where they asked various STAR -based behavioral questions. Which were very similar to what the HireVue questions were so it was very redundant and didn't actually assess if someone could accurately do the job. It was clear they were reading from a list of typical interview questions. After that i was requested AGAIN to meet with the manager b/c another team member (higher up) wanted to interview me as well. That was very brief and pointless interview as it was two questions asking me to describe my work style and tell them a little bit about myself. I think a couple days later I received a call stating \" That they loved me but there were many good candidate's. This overall interview process made me feel as though they already had an idea of who they wanted to interview /hire (within the company) and that there were too many \" hands in the pot\" and \"decision makers\". I feel that they were going through the motions b/c they had too but had already decided early on who they wanted to hire internally. The third interview also made me feel as if they wanted to \" get a feel for who I was and if they \"liked\" me, not based on my work ethic but based on their personal feelings. Too many hoops, too many people involved and too may \"approvals\" . The interview wasn't hard. just redundant. Wouldn't interview again.", "Interview Questions": "Describe some of your previous projects"}, {"date": "6 Nov 2022", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Jude Children's Research Hospital (Memphis, TN)", "Interview Descriptions": "Video interview first, required questions in time limit, then face to face interview with department and faculty. Brief meeting with HR, then you wait months, then contacted by recruiter with offer to sign.", "Interview Questions": "Do you have medical experience?"}, {"date": "22 Mar 2023", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital in Nov 2022", "Interview Descriptions": "Phone Screen with Recruiter Phone Screen with Hiring Manager On-Site Interview with Team (~4 hours in duration) Was given a verbal offer but then ghosted by recruiter and hiring manager.", "Interview Questions": "Why do you want this job"}, {"date": "3 Sept 2022", "title": "Project Manager III Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at St. Jude Children's Research Hospital (Memphis, TN)", "Interview Descriptions": "It's a process that takes you through a couple of scenarios to evaluate you would handle certain situations and how effectively you work with others.  A video interview is conducted.", "Interview Questions": "Provide an example of a creative way that you have solved a problem while managing a project in the past."}, {"date": "14 Sept 2022", "title": "Lead Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Aug 2022", "Interview Descriptions": "Initial interview was virtual and directly with the individuals I would be working with. \n\nThe second interview was  a full day onsite which involved meeting other members in the department and giving a presentation.", "Interview Questions": "Q: Why are you interested in this position rather than a traditional post-doctoral fellowship?"}, {"date": "23 Aug 2022", "title": "Sr. Network Security Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital in Aug 2022", "Interview Descriptions": "The interview process starts with an email from a recruiter to setup a phone call to discuss interest in the position.  Then they will schedule an interview with the CISO Manager.  If they feel you are qualified you will move on to a team interview and a technical interview.  From there you patiently wait to see if you are selected as the final candidate. 30 days is the typical hire time.", "Interview Questions": "Everything/question is situational based from how you would handle explaining high level implementations to an executive member of the organization to describe a time you went above and beyond.  Team interview:  10-15 situation questions.  Technical interview 6 questions to describe what is happening given a certain question and how would you handle it/your response."}], [{"date": "13 Jan 2023", "title": "Director (ALSAC) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St. Jude Children's Research Hospital in Aug 2022", "Interview Descriptions": "I received an invitation to complete a HireVue about 1 week after applying.  After submitting the video recordings, I received an email inviting me to a panel interview (virtual) which included the hiring manager. Then the recruiter called to share more about the role, disclosing the salary range. At that point I was no longer interested but I continued with the interview for practice. Had the recruiter just called and spoke with me beforehand, we could have eliminated the HireVue step altogether.\r\n\r\nTo the recruiter's credit, I received a personal call telling me I did not get the job, which was above and beyond what most recruiters will do for a candidate.", "Interview Questions": "They will send you their values beforehand, and all questions are \"tell me about a time when you exhibited Value X\"."}, {"date": "12 Sept 2022", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Nashville, TN) in Jul 2022", "Interview Descriptions": "HR reached out several days after application submitted/ they sent a link to schedule a phone call as a first step/ hiring manager reviewed the application/next step was interview with hiring manager", "Interview Questions": "Walk me through resume/ talk about past experiences/ are you open to relocation"}, {"date": "23 Jun 2022", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "The interview process wasn't bad. I feel like I bonded with my interviewers. The issue is that I have been ghosted by them. I asked about salary and benefits, and that's when they stopped responding to me. I sent a follow-up email and I have yet to receive a response.", "Interview Questions": "Talk about your experience\nDo you have any questions for us?"}, {"date": "6 Jun 2022", "title": "Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "Interview process focuses on behavioral questions. Will include your direct manager and any faculty that you may support. Important skills include coordinating, customer service, team player and more. Good luck in your job search!", "Interview Questions": "Describe a difficult situation and how you handled it? "}, {"date": "19 Apr 2022", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "I received a phone call from a recruiter a little over a week after I applied online. She mainly just asked me what salary range I was looking for. About 5 days later, the hiring manager reached out to schedule a phone call. The call was pretty informative and I learned a basic overview of what the position would entail. After about another 5 days, they reached out to schedule a virtual panel interview. \r\n\r\nThe virtual panel interview consisted of two separate panels with 3 people in each. Each panel was an hour long. I was a little surprised how \"corporate-y\" the interviews were. They only asked me \"S.T.A.R\" questions and they were very difficult. I did anticipate some S.T.A.R. questions and prepared for them, but some of these were so specific that preparing only goes so far. They really want you to describe a specific scenario even if you had not actual experienced it before. There were a couple where I said something along the lines of \"Well this never happened to me, but in those scenarios I would ___\". However, they insisted I describe a specific scenario, which I thought was odd. I feel like the concept of what you're trying to convey should be more important instead of basically coming up with a fake scenario but oh well.\r\n\r\nThe interviewers were all very nice, and I learned more about the position and culture. About a week after the panel interview, I was given a \"creative assignment\" to complete.\r\n\r\nAfter I submitted my assignment, I was told I would hear back \"soon\". A week and a half later, I still hadn't heard back. I followed up with them, and they told me they decided to go with another candidate. I would have appreciated it if they had let me know sooner or at least gave me a heads up on when I could expect to hear back about a decision, especially since I was so far along in the process and it sounded like I was in the running. If I hadn't followed up, I don't know if I ever would have heard back from them.\r\n\r\nOverall, the interview process was a lot longer than I anticipated, but St. Jude is such a huge company so I guess it's expected. I applied in February and was declined the offer in April. To be honest, the whole process seemed just a tad overkill, especially for an entry level position. I think throwing in some more normal questions (instead of solely S.T.A.R questions) would be more beneficial for them to get to know candidates better, but perhaps that's just how they have to do it in every department.", "Interview Questions": "I can't really remember them all. I remember one was something like \"describe when you had a conflict with a coworker\" Another was something like \"describe a time when you had to be creative\" (except a lot more specific than that)"}, {"date": "29 Mar 2022", "title": "Pediatric Oncology Nurse II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Mar 2022", "Interview Descriptions": "Applied through website, got email from recruiter 2 weeks later. Phone screen  scheduled via email 2/3 days after. Talk with recruiter lasted about ten minutes. Interview scheduled with hiring managers several days later. Virtual panel interview and told I would know something by end of wwwk.", "Interview Questions": "Tell me about yourself.\r\nWhy pediatric Oncology?\r\nHow would your peers describe your communication style?\r\nTell me about times you've dealt with a difficult situation?\r\n"}, {"date": "23 Apr 2022", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Mar 2022", "Interview Descriptions": "Did a 1 hour group interview with the entire team of 8 on WebEx. It was overall pleasant, I hadn’t heard anything back in 2 weeks. Repeated questions, due to some teammates not paying attention.", "Interview Questions": "Questions from my past experiences "}, {"date": "10 Feb 2022", "title": "Technical Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "It was a great interview. They made the process very enjoyable, and the managers are always willing to give people with no experience a shot at working there. I am happy I got the chance to be a part of the St. Jude family", "Interview Questions": "Why should we choose you"}, {"date": "27 Feb 2022", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at St. Jude Children's Research Hospital in Jan 2022", "Interview Descriptions": "The process took about 2-3 months. Started with a HireVue recorded video interview. After 2 weeks i had a virtual interview with the hiring manager. 2 weeks after, i had a panel interview which was broken down into 6 separate 1:1 sessions with team members then one month of silence before receiving a reply to my follow-up email from the hiring manager that another candidate got the job. The whole process was well organized and the team members were friendly, informative, and professional. My only concern is the lack of communication after my panel interview.", "Interview Questions": "Why do you think you are a good fit for this position?"}], [{"date": "16 Jan 2022", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jan 2022", "Interview Descriptions": "Video interview with time limit of 3 min per answer and no more than 6 questions. Second round of interviews is schedule to be with the position's immediate boss. The interview is less structured but you learn more about the position and specific expectations.", "Interview Questions": "Tell me about your research experience. "}, {"date": "11 Oct 2021", "title": "Pediatric Oncology Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Sept 2021", "Interview Descriptions": "Overall, this whole process went smoothly. I was contacted by a recruiter and had an interview set up the next week. The recruiter asked me about my interests in different clinical areas, and she recommended other areas that I may find interesting.\nThe interview itself also went smoothly. I had a panel interview over WebEx with 2 managers from different floors and 3 clinical nurse leaders. The interviewers were professional, but they also made a few jokes, which lightened the seriousness and helped calm my nerves. The only downfall of this interview is that they had to wear masks because they were all sitting at the same table. It was hard for me to tell which person was asking the question. I was asked multiple behavioral interview questions, which I used to STAR method to answer.", "Interview Questions": "Why do you want to work at St. Jude?"}, {"date": "27 Aug 2021", "title": "Statistical Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "Started with a 1 hour phone interview with 3 people from the Biostatistics Department, and then a final \"onsite\" interview, which consisted of 3 separate, 30 minute interviews with faculty. All interviews involved technical questions of varying difficulty.", "Interview Questions": "How would you handle missing data? What models would you use for different types of studies? etc."}, {"date": "13 Sept 2022", "title": "Animal Husbandry Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Feb 2021", "Interview Descriptions": "Virtual Interview. You video yourself answer questions that are timed. You will then have an in person interview. In person is a group of staff members that ask you different questions.  It wasan okay process.  ", "Interview Questions": "What are your thoughts on animal welfare?"}], [{"date": "2 Dec 2021", "title": "Lead Research Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jan 2021", "Interview Descriptions": "Easy going with two rounds of interviews conducted by HR and Hiring manager post which you land up ending with the job offer. I would highly recommend as StJude is a great workplace to be in", "Interview Questions": "Tell me about yourself and your research experience"}, {"date": "9 Dec 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at St. Jude Children's Research Hospital (Sacramento Valley) in Jan 2021", "Interview Descriptions": "Detailed and informative within the scope of research. Was interested in my previous research and my current abilities in terms of the equipment I have worked with and other experience in relation to that role. Was very nice and straight forward, however I feel I was not what they were looking for and vice versa", "Interview Questions": "Previous background in research labs"}, {"date": "24 Sept 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "Very smooth and easy process. I enjoyed my experience during the interview. Only one interview.  Really nice staff their that helped with my interview. I would recommend researching the company before the interview.", "Interview Questions": "Mainly behavior questions rather than technical ones."}, {"date": "14 Jan 2020", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Dec 2019", "Interview Descriptions": "Was an excellent and well organized interview process. Started with a phone interview and then a 3-day on site interview with many members of prospective departments including PIs, post-docs, staff scientists students, and technicians.", "Interview Questions": "Where do you see yourself after completing this post-doctoral fellowship?"}, {"date": "2 Jan 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jul 2019", "Interview Descriptions": "the interview process was extensive, lasting at least 2 days. Interviews in person, questions and presentation requests. I interviewed with more than 6 people; limited communication about selection process thereafter.", "Interview Questions": "prepare a slide deck; review a slide deck; impressions of their work approach to a WHO-funded partnership."}], [{"date": "18 Oct 2019", "title": "Clinical Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jun 2019", "Interview Descriptions": "Applied online, months later got an invite to complete a video interview, months later got a call to schedule onsite interview and campus visit, few days to interview received a schedule for the  interview day . St Jude covered the entire cost of travel to Memphis.  HR and entire staff i met during the process were very nice and accommodating.", "Interview Questions": "Why i want to work at St Jude and what attracted me to the position, questions on my background and work experience based on what i have on my CV."}, {"date": "30 Jan 2023", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Tampa, FL) in Apr 2019", "Interview Descriptions": "It was very straight forward and I enjoyed the experience of it. Even though I didn’t get the job I was happy about the opportunity of it. The people were very nice in there and it made the process go smooth.", "Interview Questions": "N/A"}, {"date": "18 Oct 2019", "title": "Project Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Mar 2019", "Interview Descriptions": "the interview process was stressful, but very smooth. The HR department was very friendly and wanted to help me with the process. Also, a video interview was required in order to get selected. there were 9 questions, 20 seconds to prepare for the question and 3 minutes to answer. They gave 2 shots to answer, but you could not review the second choice. If you did not like the first choice, then the second was the one you sent, without review.", "Interview Questions": "describe a stressful situation and how you deal with it. "}, {"date": "10 Jul 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at St. Jude Children's Research Hospital in Feb 2019", "Interview Descriptions": "The interview process was an over the phone interview with their team directly asking me questions. There were about 4 people in the room and overall it was about 15 minutes.", "Interview Questions": "Greatest accomplishment in life so far?"}, {"date": "6 Aug 2019", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Feb 2019", "Interview Descriptions": "The interview will take 2 days.  For the first day, 1-hour presentation, you will meet all of the staffs from the department, and a one-on-one interview with 5 faculties. \r\nThe second day, you will see the other 5 staffs from diverse departments.", "Interview Questions": "They asked about my career goals, my research items, and about my previous careers. "}, {"date": "11 Jan 2019", "title": "Systems Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jan 2019", "Interview Descriptions": "Recruiter scheduled the call after me applying online. I think it would have been helpful if she would have have told that Algorithms would be a part of interview. Besides Algorithms, Database was an important part of the process", "Interview Questions": "How did you increased database capacity ?"}, {"date": "27 Nov 2018", "title": "Statistical Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "First record videos to answer a bunch of questions, then there will be a phone interview, finally  on-site interview during which you will meet department chair, faculties, colleagues and administrative staff.", "Interview Questions": "Mainly about the research experience, courses, interpersonal communication skills"}], [{"date": "28 Nov 2018", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (New York, NY) in Nov 2018", "Interview Descriptions": "Phone interview with 3 PIs.  I start from introducing myself, including my education and research background.  They are interested in my genomic background.  They also asked about what I've done in order to improve my statistical skills.   The most important part is about your CV.  Be ready to explain everything you put in your CV is critical.", "Interview Questions": "Why St Jude?"}, {"date": "4 Sept 2018", "title": "Lab Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "Not a hard interview at all. They wanted to know about me, lab skills, procedures i have performed. Wanted to know about prior job experience and my education. Prepare on past terms you saw in school", "Interview Questions": "What are you lab skills"}, {"date": "30 Aug 2018", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Jude Children's Research Hospital (Marion, AR)", "Interview Descriptions": "a lengthy process. takes WEEKS. you hardly get notified if you got the job, after 2 weeks of constantly checking your email every 15 min and heart stopping at every phone call, you MIGHT get a “sorry” generalized email after a few months. I have a feeling for u interview w the same people and they just don’t like you, you won’t get a chance :( it’s all just frustrating", "Interview Questions": "what makes you a fit for our team"}, {"date": "22 Aug 2018", "title": "Animal Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "Great process, HR department called and set up on the phone interview.  Interviewed in person enjoyed meeting co workers and directors.  Had a great lunch.  Took some time to get the postion, expect a long process and many interviews.", "Interview Questions": "How many years of experience? "}, {"date": "7 Aug 2019", "title": "Faculty Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Aug 2018", "Interview Descriptions": "They hosted me for a 2-day whirl-wind interview with numerous faculty members across multiple departments with whom my research interests might connect. I gave a seminar that was well attended and was a very positive experience, the audience was engaged, supportive, and asked great questions at the end.", "Interview Questions": "Why are you interested at working at St. Jude."}, {"date": "17 Jan 2019", "title": "IT Support Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Feb 2018", "Interview Descriptions": "A couple phone screens, a video conference interview, and if selected an onsite visit.  Interview went very well.  After three interviews, I never received a response.   Very unprofessional.", "Interview Questions": "Why do you want to work for this company?"}], [{"date": "12 Oct 2018", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital in Dec 2017", "Interview Descriptions": "The interview process was relatively easy. A 30 minute phone call with member s of the HR team. I was contacted a couple days later to set up a skype interview in which I had to prepare a powerpoint on the history of St. Jude. The skype interview included no additional questions other than the powerpoint presentations. I was offered the internship a week after my skype interview.", "Interview Questions": "Tell me about a time in which you had to work with someone you disagreed with. "}], [{"date": "25 Sept 2021", "title": "IT Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jul 2017", "Interview Descriptions": "Interview went great, very welcoming and good conversation. There were some basic questions asked by my prior experience. Overall it was a great experience and also they booked a flight ticket and flew me in and booked motel as well", "Interview Questions": "Tell me about yourself ; asked about my prior experience "}, {"date": "5 Jun 2017", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "interview face to face with the PI,\r\nwrite some proposal about what you are interested in for further research,\r\ndiscuss with PI to modify the proposal and exchange ideas about research,\r\nget an offer", "Interview Questions": "What was you previous project focus on?"}, {"date": "26 Aug 2017", "title": "Ambulatory Care Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Jude Children's Research Hospital in May 2017", "Interview Descriptions": "I applied for the job, and got a call back fairly quickly to my surprise( 3-4 days later). I had a panel interview with three ladies. It was very laid back, almost like conversation. The questions were more behavioral based. I felt like I had great responses and got great feedback, but I was not offered the position.", "Interview Questions": "Explain a time where you had an issue with a coworker and how did you handle the conflict?"}, {"date": "26 Sept 2017", "title": "Bioinformatics Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in May 2017", "Interview Descriptions": "Gave a couple of different seminars and met everyone on my potential team.  Mostly focused on what I have done and what I am capable of doing as a scientist at St. Jude.", "Interview Questions": "Most questions were directed towards my research and transferrable skills"}, {"date": "25 Aug 2017", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Apr 2017", "Interview Descriptions": "First had a Skype interview with my advisor and several administrative staff. Within few days I was invited for a onsite interview. The interview was very well planned and got a chance to meet many people in the department. A very positive experience.", "Interview Questions": "What was my experience and how I would use it to the current research project."}, {"date": "1 Apr 2017", "title": "Research Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "The questions were focused on my research. I also asked questions regarding the position to determine whether it is a good fit. Overall it was a positive experience to get to know the company and the position I was interviewed for.", "Interview Questions": "Describe a project from your research. And they asked questions as I went through my project. "}, {"date": "8 May 2017", "title": "Stem Cell Processing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Mar 2017", "Interview Descriptions": "Communication between myself and HR recruiter was excellent. They were very flexible with interview dates and times. Benefits were explained on the front end. Hiring manager was very laid back but detailed about the type of work performed in the department and why the department is the best at what it does. Very good rapport between management and staff; workplace culture and cohesiveness is excellent.", "Interview Questions": "Where do I see myself in the next 5 years?"}, {"date": "9 May 2017", "title": "Talent Sourcing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Mar 2017", "Interview Descriptions": "After a brief screening meeting to review the position, I was invited to an official interview.  I spent 1 hour with the hiring manager and Sr. Sourcing Specialist.  I then met for 1 hour with a panel of recruiters for an informal panel interview.  Then I was able to go on a tour with the Talent Acquisition Project Manager, a recruiter, and the Sr. Sourcing Specialist.", "Interview Questions": "Provide specific examples of how you have been involved in talent acquisition in previous positions."}, {"date": "15 Oct 2019", "title": "Learning and Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Mar 2017", "Interview Descriptions": "I was called by Talent Acquisition and interview set up after a couple of months.  I then had a telephone interview and then a face to face interview.", "Interview Questions": "Describe a time when I had to create a curriculum design. "}], [{"date": "11 Apr 2017", "title": "Patient Access Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Feb 2017", "Interview Descriptions": "LONG! After getting the initial call that my resume was moving forward it took 2-3 weeks to hear back from them again, then after the day of the interview it took another 3-4 weeks to hear any feed back. I did not get offered the position. Then 2 weeks later after I applied for another patient rep i get a call that i had been chosen again, but they had to leave a voicemail. I returned the call, no response. I emailed the guy who called me to see about it, no response. It was almost like he realized i already interviewed for the same position in a different deptartment and didn't mean to call. So now i'm sitting here wondering if it's even worth applyin to anything else if i've interviewed at one spot on campus. and it all hurts my heart because St Jude is a place i've always wanted to work because of the amazing things they do for the children. I understand if i'm not qualified but for these positions i know i am. I was also told i have \"too much energy\" for the position, which is odd.", "Interview Questions": "If i like my job why do i want to leave it after 2-3 months? "}, {"date": "3 Apr 2017", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Feb 2017", "Interview Descriptions": "The interviewing process was a bit nerve racking only because it was a panel interview with behavioral based interview questions.  Also, had  a second interview that was very stressful.", "Interview Questions": "Tell me about a time when you were unsuccessful in communicating information to other.  A time when you were successful.  "}, {"date": "24 Mar 2017", "title": "Administrative Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Feb 2017", "Interview Descriptions": "The interviewer was very professional and asked good questions.  The process had good flow.  All the steps to follow (from beginning to end) were very clear.  There was a sense of urgency.", "Interview Questions": "Reason for leaving my previous job."}, {"date": "20 Jan 2017", "title": "Statistical Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "About 30 minutes phone interview, followed by a full day of on-site interview. One to one meeting with faculty members, biostatisicians, and HR specialists. No presentation required. People there are nice.", "Interview Questions": "How to analyze paired data?"}, {"date": "15 Jun 2017", "title": "Vice President Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jan 2017", "Interview Descriptions": "The interview process was very fast paced and rigorous; however, I appreciated the exposure to an expansive group of individuals and stakeholders in the hire.  The recruiter that I worked with at St. Jude was top-notch and kept me informed throughout the interview/hire process.", "Interview Questions": "What inspires you to be\" all in\"?"}, {"date": "23 Mar 2017", "title": "Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 5 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jan 2017", "Interview Descriptions": "The hiring manager really got to know me and wanted to make absolutely sure that me working here would not only benefit the company, but would also benefit me personally.  The follow ups were so considerate.", "Interview Questions": "One thing that really stuck out among other interviews I've ever had before was \"Do you enjoy being in one place, doing the same task every day, or do you have drive to move onward and upward?\""}, {"date": "24 Feb 2017", "title": "Internal Communications Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jan 2017", "Interview Descriptions": "All told, my interview process took about three weeks—a much shorter time frame than the (rumored) months long process. The interviews themselves, which consisted of two phone interviews and a four-hour panel interview, felt more like conversations over coffee than anything. That isn't to say that the behavioral questions weren't challenging—I had to recall a good number of things to answer them well—but it seemed more like an opportunity to talk shop with knowing colleagues.\r\n\r\nThe reference and background checks are extensive, but what you would expect for a hospital and a highly competitive employer like St. Jude.", "Interview Questions": "Tell me about a time when you had to make a presentation to a group of people.  What tools did you use to create the presentation?  What did you do to try to engage the audience?  "}, {"date": "16 Dec 2016", "title": "Internship Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (New York, NY)", "Interview Descriptions": "Had about a 30 minute phone interview and then was told I would hear back within 2 weeks to see if I made it to the next stage. Asked very basic interview questions.", "Interview Questions": "What are some of my biggest strengths?"}, {"date": "25 Jan 2017", "title": "Statistical Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Dec 2016", "Interview Descriptions": "The whole process was about one month. I applied on-line, then got a phone interview from leader senior biostatistician, asked me technical questions more then one hour. Then next week, I had an invitation to ask for on-site interview. The on-site interview was a whole day from 8:30 am to 4:30 pm. Meet with lots of people in Biostatistics, all were asked technical questions. Everyone is nice. Then two weeks later, I got an offer.", "Interview Questions": "Questions are like longitudinal study, survival analysis, your project, SAS code, etc..."}, {"date": "17 Jan 2017", "title": "Associate Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Nov 2016", "Interview Descriptions": "Several phone interviews, Skype interview, and in-person interview with team and direct supervisor, were conducted. In the end, senior management decided to go in a different direction with the role, which was a great disappointment, since I was the final candidate and very close to an offer.", "Interview Questions": "Describe the largest fundraising event you personally organized and how much was raised?"}], [{"date": "9 Jan 2017", "title": "Research Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Nov 2016", "Interview Descriptions": "The interview process was fairly standard; they called me to let me know I was in the interview round and then flew me out to Memphis, TN. The actual interview itself was pretty standard, though I did meet a lot of people who I had the potential to be working with. While the interview did go pretty well I am sad to say that I didn't get the job. I'm still applying to other positions at St. Jude's since it's my dream job but we'll see. They really made the interview process amazing, other companies should learn from them,", "Interview Questions": "They asked about my past research and lab experience."}, {"date": "22 Mar 2017", "title": "Medical Imaging Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Nov 2016", "Interview Descriptions": "First round, HR contacted asking questions regarding details listed on the job description.\r\nSecond round, the department set up an Skype interview asking specific questions regarding research experience base on the resume. \r\nThird round, onsite interview with a presentation and individual meetings with numerous faculties.", "Interview Questions": "Describe your research projects.\r\n"}, {"date": "13 Sept 2017", "title": "Sedation Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Oct 2016", "Interview Descriptions": "5 person panel interview.  It was intense and parts were thought provoking and hard to come up with adequate answers and may have felt intimidating at times.  Everyone was nice and took time to repeat questions that were somewhat difficult to understand.  The whole process lasted approx. 2 hours and I left the interview feeling confident about the entire process", "Interview Questions": "Describe a time when you acted as a patient advocate  with the physician and what was the outcome."}, {"date": "20 Dec 2016", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Oct 2016", "Interview Descriptions": "The interview process at St. Jude was very intense and detailed.  There was a panel interview with several different managers and coordinators.  The interview lasted up to about 45 minutes.  They asked a wide variety of questions, and wanted to get the best person fit for the job to which I was interviewed for.", "Interview Questions": "Out of all the candidates, why should we hire ;you? "}, {"date": "12 Jan 2017", "title": "Senior Media Relations Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Oct 2016", "Interview Descriptions": "The process was very simple. It consisted of an interview with the department head and my direct manager. It was very informal, but informative. I appreciated the relaxed environment, which I think helped build a rapport between me and who would turn out to be my future boss.", "Interview Questions": "They asked how I would handle developing relationships with media people coming from the media"}, {"date": "26 Sept 2016", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Jude Children's Research Hospital (Memphis, TN)", "Interview Descriptions": "Nice and easy going. Have to present the research project. Meet with different PIs, lab members and other core facilities people. Everything was smooth and arrange by academic programs at St. Jude.", "Interview Questions": "Why do you want to work for St. Jude"}, {"date": "23 Jan 2017", "title": "Database Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Jude Children's Research Hospital (Los Angeles, CA) in Sept 2016", "Interview Descriptions": "I applied online. Recruiter called and asked couple of basic questions. On the following day I had a phone interviews with hiring manager. The hiring manager asked a wide variety of questions. Finally, I had a Skype panel interview with several different managers and coordinators. The Skype panel interview lasted up to 3 hours. Overall it was a great interview.", "Interview Questions": "What tool you used to track your multiple projects? "}, {"date": "2 Jun 2018", "title": "Bioinformatics Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Sept 2016", "Interview Descriptions": "Give one presentation to the ComBio team (about 20 people). Meet different  group leaders. It last about one day. People are really nice. They will ask you about details in your projects.", "Interview Questions": "Technical questions. "}, {"date": "12 Jan 2017", "title": "Genetic Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Sept 2016", "Interview Descriptions": "Two telephone interviews followed by a two day in-person interview. The entire process was incredibly informative and professional and following these experiences I knew St. Jude was the right fit for me. I feel very lucky to be here now.", "Interview Questions": "Why are you interested in coming to St. Jude? Why are you considering leaving your current position? What makes this particular position appealing to you? What are your weaknesses?"}], [{"date": "15 Nov 2016", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Aug 2016", "Interview Descriptions": "Received a call to have an interview, three levels with five individuals of senior management. Was provided and agenda of those attending and all necessary information.The interviewers were very welcoming and inquisitive. It was not a formal, objective question-based interview, much more of a conversation around my skillset, what I would aim to do in the role, as well as conversation around the department, the strategy, and what they were try to achieve. Afterward, was asked to come back in for a second interview with additional members of management. Same three levels, same type of discussion.", "Interview Questions": "Various topics around vendor management and financial acumen."}, {"date": "7 Nov 2016", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Aug 2016", "Interview Descriptions": "After applying online, HR contacted me for a brief screening call and let me know that the hiring manager would be contacting me for a phone interview.  The hiring manager emailed me within the next day and arranged a phone interview with multiple people from St. Jude.  Within a week after that interview I was selected for an in-person interview.  This consisted of multiple brief 1:1 interviews and a small panel interview.  HR contacted me to extend the job offer and I accepted.  The whole process from online application to job offer took approximately 4-5 weeks.  St. Jude was very clear about the process, timely in their response (faster than expected), and the interviews were comfortable (formal but friendly).  There was a good balance between learning about the position and St. Jude as well as describing my experience and answering questions.  Interview questions covered my background/skills/experience, reasons for wanting to work at St. Jude and in the specific position, and situational discussions (e.g., how I would handle different situations).", "Interview Questions": "Describe both a positive and negative supervisory experience and how you handled it."}, {"date": "28 Jul 2016", "title": "Technical Support Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Jude Children's Research Hospital (Memphis, TN)", "Interview Descriptions": "I had a phone interview one week and asked for a face to face the next week. My interview went very well and the interviewers were very professional. My appication status still says 'preferred applicant'. I am waiting and praying on a call back.", "Interview Questions": "Troubleshooting questions"}, {"date": "28 Sept 2016", "title": "Systems Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jul 2016", "Interview Descriptions": "The interview process here consists of a long series of interviews that lasted 4 hours!  Basically every I.T. group asks you the same questions over and over, culminating in the \"executives\" at the end.  At one point, we were talking about the weather and what's going on around town.  And they won't bother getting back with you if they aren't interested, which I suppose is standard nowadays.  But don't say \"you'll hear from us soon\" and then never follow up.", "Interview Questions": "Why should we hire you?"}, {"date": "4 Oct 2016", "title": "Database Programmer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jul 2016", "Interview Descriptions": "The Interview process went smoothly. Proud to be associated with such a wonderful organization.\r\nThe schedule was prepared way ahead and everything went as per the schedule. The response time was also efficient. \r\nOverall the experience was excellent.", "Interview Questions": "Technical questions related to the profile, educational details."}, {"date": "7 Nov 2016", "title": "Business Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jun 2016", "Interview Descriptions": "The interview process was behavioral based and past experience type of questions. I would get a question related to a specific job accomplishment and then asked how I handled certain situations.", "Interview Questions": "Why are you looking to make a transition from your current job to this job?"}, {"date": "2 Aug 2016", "title": "Driver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jun 2016", "Interview Descriptions": "The interviewers took their time to ask prominent questions and allowed me ample time to answer them. The interviewers were friendly, courteous, and they both shook my hand as I left the interview. They were honest about having other people to interview and advised me that they will let me know if I had the job or not", "Interview Questions": "They ask about my experiences in the field applied for."}], [{"date": "4 Jul 2016", "title": "Senior Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in May 2016", "Interview Descriptions": "I applied online. The process took 2 weeks. Had an informal phone interview with the manager and a staff member. The manager introduced the department and the group, asked about my experience followed with some behavior questions. I was asked to prepare an one-hour formal presentation of my research. The on-site interview process took two days with the first day flight to Memphis and had a dinner with my manager. The second day begins with a meeting with an immigration staff. A one-hour presentation with about 20 audiences followed with consecutive meetings with 10-20 people (software engineers, group leads and research scientists) in the department individually or in small groups. \r\n\r\nThe whole interview process is more like a faculty interview in a university. However, there are technical interviews with software engineers, database analysts. Overall, my interview experience is very positive and all the people I met are very kind and friendly.", "Interview Questions": "Many research related questions were asked in the presentation. Explain what is a view? Some questions related to distributed systems."}, {"date": "1 Jul 2016", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in May 2016", "Interview Descriptions": "The interview process was completed in a prompt and detailed fashion. I appreciated how quickly I was contacted and the timely fashion that all three interview process ( initial phone screening, face to face with hiring manager and final panel interview) were completed.  It gave me the sense that the hiring manager posted a position that they were serious about filling with the best candidate as quickly as they could. All contacts were accessible and communication with each one was clear and detailed regarding next steps.", "Interview Questions": "Why was I interested in joining the organization?"}, {"date": "23 Aug 2016", "title": "Quality Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in May 2016", "Interview Descriptions": "Phone screen by the team members and then again by the manager.\r\nMost of the technical question was asked by the team members. \r\nOne of the lady team member asked the same question 5 to 6 times , seems like she wanted to hear her answer. And sometimes gave the answer on her own questions.", "Interview Questions": "Mostly related to QA .\r\nMore related to Selenium Webdriver , automation, java ect."}, {"date": "3 Aug 2016", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in May 2016", "Interview Descriptions": "Recruiter called and asked to set up an interview with himself and the hiring manager. Only 1 phone interview with recruiter and hiring manager. I heard back the next day and scheduled an on-site interview. Here I was set up with 1-1 interviews with individuals throughout the organization that I would have interactions with. They also gave a tour of the campus which is helpful for recruiting.  Offer made within a week of final interview.", "Interview Questions": "How does what you do help meet the mission of St. Jude? "}, {"date": "7 Nov 2016", "title": "Clinical Research Associate I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Apr 2016", "Interview Descriptions": "I applied online. Within a week had an initial phone interview with the recruiter, which went great. Few weeks after I had an interview at St Jude Children's Research Hospital, Memphis TN. The schedule was prepared in advance, all went perfectly well. The coworkers I met were great and the whole atmosphere was wonderful. The impression was that everyone loved their job and was delighted to be part of such an awesome organization. Whole experience was excellent.", "Interview Questions": "What were responsibilities of your previous job?"}, {"date": "27 May 2016", "title": "Infection Preventionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Apr 2016", "Interview Descriptions": "I was contacted from someone in HR to set-up an interview. I first interviewed with the medical director, and after that I sat down with the whole department to answer questions and to ask them questions myself. I loved this style of interviewing for that it let you have insight into the department instead of one person interviewing.", "Interview Questions": "Tell us about a challenging time that you overcame and made a change within you department?"}, {"date": "27 May 2016", "title": "Staff Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Mar 2016", "Interview Descriptions": "1. Phone interview - A week from date of application. \r\n2. Onsite interview call - 3 weeks after phone interview.\r\n3. Onsite Interview - Day long interviews with Faculty in the department followed by a presentation and dinner.\r\n4. Job Offer - 3 weeks after onsite interview. \r\n5. Drug test - A week after offer.\r\n6. Relocation assistance - Sponsored trip to find housing.\r\n7. Final relocation and start of job - little over two months from initial application date.", "Interview Questions": "Mostly research related questions and about the general research trends in the field."}, {"date": "9 Oct 2017", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Mar 2016", "Interview Descriptions": "The hiring process was easy and fast the employer called and made sure I knew where to go for my interview and they asked me about myself they also made me feel comfortable and made sure I understood everything I didn't feel pressure or nothing", "Interview Questions": "Where do I see myself in 10 years"}, {"date": "2 Aug 2016", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Mar 2016", "Interview Descriptions": "Prompt communications and fast paced hiring process. The colleagues and staff were supportive throughout. There was 1:1 interview, followed by work presentation. Afterwards I could meet individual group members and could assess how do they work, what are their aspirations and how do they feel working in their current role. It was an enjoyable experience to communicate with everyone before being hired.", "Interview Questions": "What is my opinion on animal related research work."}], [{"date": "9 Jun 2016", "title": "Software Developer II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Jude Children's Research Hospital in Mar 2016", "Interview Descriptions": "The interview process is very good, the way management considered me was excellent. there were 4 round of tests  telephonic screening, online test(java,spring), technical interview with team and managerial interview analyst and directors.", "Interview Questions": "Java8 and Spring4"}, {"date": "27 May 2016", "title": "Staff Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Mar 2016", "Interview Descriptions": "While staying in Memphis for 3 days, there were two sets of interviewing schedule at St. Jude Children's Research Hospital. The two-day schedules included a presentation, a serial meeting with two PIs, two Lab members, and core facility members, and a hospital tour. The interview was not stressful, but very informative, comfortable, and nice. After finishing the interview, I got an informal letter of my employment in a week.", "Interview Questions": "What have you done in your research career?\r\nWhat do you want to study in this institution?"}, {"date": "12 Feb 2017", "title": "Senior Learning Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital in Mar 2016", "Interview Descriptions": "The recruiter was prompt, assessable and keep me informed of every aspect along the way. The interview panel was professional, asked clear and relevant questions and provided an opportunity for questions.", "Interview Questions": "How do you define excellent customer service?"}, {"date": "2 May 2016", "title": "HRIS Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Mar 2016", "Interview Descriptions": "It was pleasant. The recruiter was very nice. The interview was a mix of interviewing with coworkers, the person who would be your manager, and the Director of your department. Then for me if all went well there was a computer based skills test. Everyone I interviewed with were very nice however you must know your stuff. These people are specialist in their profession can tell if someone is not being truthful or they are being evasive with answers. Ensure that whatever position you are applying for you can back up the information listed on your resume.", "Interview Questions": "Behavioral interview questions. What would I do in a situation. Tell them a time I had to do a certain task. What skills do I posses that qualify me. "}, {"date": "15 Apr 2016", "title": "Bioinformatics Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Feb 2016", "Interview Descriptions": "After submitting my resume and CV I was invited to participate in an initial phone interview.  For the initial interview, I was asked to prepare slides to discuss my research.  After the initial interview, I was asked to complete a second interview.  During the second interview I was asked about personality and HR related questions. I was invited for a site visit where I met members of the Bioinformatics team and gave a formal presentation.  After the onsite visit, I was asked to analyze some important papers in the field.", "Interview Questions": "They wanted me to demonstrate how my research experience  translated into the overall aims of St Jude Children's Research Hospital."}, {"date": "6 Jul 2016", "title": "CRA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Feb 2016", "Interview Descriptions": "I applied online. A few weeks later I received a call for an interview with the team. The itinerary can be somewhat intimidating, but everyone was warm, welcoming, and professional. After 2 weeks, I received a call for a second interview. The second interview with the doctors and director was a bit tougher, but still everyone was courteous and made you feel comfortable. You could tell that everyone loved their job and was proud to be apart of such an amazing institution; which in turn, confirms all the positive things you hear about St. Jude. After about 3-4 weeks I received an offer and I accepted!", "Interview Questions": "How does your past experience and skills relate to the responsibilities/duties of the position."}, {"date": "6 Apr 2016", "title": "Field Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Jude Children's Research Hospital (Chicago, IL) in Dec 2015", "Interview Descriptions": "Submitted my resume online, was then contacted via email to set up a phone interview. After the first phone interview they wanted to set up a second interview with two employees. It was all pretty easy, they were looking more for personality and past experience than anything else. VERY casual interview process.", "Interview Questions": "What is your zodiac sign "}, {"date": "1 Feb 2016", "title": "Senior Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Dec 2015", "Interview Descriptions": "The interviewing process was smooth. If you have the experience required along with the necessary education, you should definitely apply at St. Jude. It is a wonderful place to work.", "Interview Questions": "What qualifications, skills  and education do you possess that would make you the best candidate for this position?"}, {"date": "29 Apr 2016", "title": "Organizational Development Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Oct 2015", "Interview Descriptions": "I first had a phone interview with the department manager and another member of the team within a week of applying. It was a great opportunity to learn more about the role, share some of my experience and gain an understanding of St. Jude's priorities. About two weeks later I was contacted by HR to schedule an onsite interview. The onsite was with the manager and same team member as the phone interview and followed a standard behavioral interview format with time to address any questions I might have. Overall it was a very positive experience.", "Interview Questions": "N/A"}], [{"date": "3 Apr 2018", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Oct 2015", "Interview Descriptions": "Applied online\r\nPhone Interview\r\nPanel Interview w/ Sr. Recruiters\r\nPanel Interview w/ two directors and manager\r\nCompleted some skills testing  - MS Word, Excel, PowerPoint\r\nReceived an offer about a week after the interview; negotiated on salary\r\nHad to complete background check and drug screen", "Interview Questions": "Behavioral-based interview questions i.e.\r\n\r\nTell me about a time when you had to deal with a difficult situation at work and how did you handle it? "}, {"date": "4 Jul 2017", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Sept 2015", "Interview Descriptions": "I was interviewed by three managers. It was very formal and I was asked all of the standard interview questions. It took several weeks to be given an offer. Management did not want to negotiate on pay.", "Interview Questions": "What is your proudest work-related accomplishment?"}, {"date": "29 Apr 2016", "title": "Employee/Labor Relations Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Sept 2015", "Interview Descriptions": "I found the process to be very efficient.  I was initially contacted for a phone screen within 3 weeks of submitting my online application.  The onsite interview followed approximately 1 week later and an offer of employment came approximately 10 days later.  The Talent Acquisition/Human Resources team was both welcoming and responsive  throughout the selection and onboarding process.", "Interview Questions": "Both the phone screen and onsite interviews primarily focused on behavioral questions (tell me about a time when...) specifically related to the skills and competencies needed to be successful in this role."}, {"date": "1 Feb 2016", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Aug 2015", "Interview Descriptions": "I was invited by a St. Jude recruiter to apply to multiple positions, and had the opportunity to interview with four different labs. St. Jude covered all travel expenses and stay in Memphis for three days. I gave a talk to the different lab members on my graduate work and then talked to people in the lab including the PI.", "Interview Questions": "Why you want to join this lab?"}], [{"date": "9 May 2016", "title": "Postdoctoral Researcher Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Apr 2015", "Interview Descriptions": "I was contacted initially by a recruiter and was later accepted as a participant in the National Graduate Research Symposium. They showed me the facilities and I gave a presentation of my graduate research. I met with 7 faculty members was was extended offers from 2.", "Interview Questions": "Why was I interested in St. Jude?"}, {"date": "23 Dec 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at St. Jude Children's Research Hospital in Apr 2015", "Interview Descriptions": "I found the job description on Monster.com and send my resume in. It took a while to hear back from them, but someone emailed me to schedule a phone interview. After that went well, she had me speak to one of her colleagues, who I learned also works in the office and supervised interns directly. Both of the conversations were pretty standard. They were super friendly and just wanted to see that I cared about their mission wholeheartedly!", "Interview Questions": "They asked general get-to-know-you stuff and asked about my past experiences."}, {"date": "14 Sept 2015", "title": "Volunteer Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital in Mar 2015", "Interview Descriptions": "I applied a few months before the internship was to start. I received an email wanting a phone interview with the department director. Once finished that interview I was asked to come in person for the interview. I received a phone call a short time later saying I had received the internship.", "Interview Questions": "Explain a time you disagreed with management"}, {"date": "1 Feb 2016", "title": "Senior Software Developer I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Mar 2015", "Interview Descriptions": "Technology - Java\r\n2 stages of Interview Process, telephonic and onsite\r\nTelephonic Interview\r\nManager called me few days ahead to schedule an interview.\r\n\r\nTech person asked me about technical questions on frameworks, design patterns and dbms concepts, then I was called for onsite interview.\r\n\r\nOnsite Interview.\r\nIts full day process consists of 3 stages.\r\nStage 1:\r\n1. Java online exam\r\n2. Spring 3.0 online exam.\r\nBoth of these exams like certification exams and I have done well with these exams.\r\nStage 2:\r\nManager and Leadership Interview - Check for problem solving capabilities, Attitude, stress management and technical challenges. Director asked me on questions from DBMS etc. This discussion happened for 1 hour.\r\n\r\nStage 3:\r\nTech Interview - All people from the team will ask questions related to the technology and challenges. Have provided a design for specific problem.", "Interview Questions": "1. Strengths and weakness\r\n2. Why St Jude\r\n3. Default isolation level in database.\r\n4. Factory pattern\r\n5. What is closure in java script\r\n6. How spring framework designed and what are all the design patterns from spring..."}, {"date": "13 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Mar 2015", "Interview Descriptions": "First step was a phone call. If you passed that, you were invited for a day of interviews with the office to see where you best fit. You needed to submit a number of forms, background checks, health information, etc.", "Interview Questions": "What qualifies you for this position?"}, {"date": "3 Jul 2016", "title": "Student Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Feb 2015", "Interview Descriptions": "Was done through Rhodes College so I only had to apply through my school. It is largely the only reason I got the job. The selection process was limited to Rhodes students mostly with a few students from other schools.", "Interview Questions": "Why do you want to work at St. Jude?"}], [{"date": "18 Oct 2019", "title": "Marketing Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jan 2015", "Interview Descriptions": "I applied online, but on the job board of a professional organization I belonged to. Not like CareerBuilder or indeed. I had a phone interview with HR, then with department staff, then in person. I received an offer and negotiated it up slightly and got money for relocation and a temporary place as well. Very friendly. HR was not that aware of the duties/position.", "Interview Questions": "I had to perform a written exercise. They also wanted to get to know me and if I liked Memphis."}, {"date": "5 Jul 2016", "title": "Senior Research Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Dec 2014", "Interview Descriptions": "a phone interview first, and then onsite interview, benefits coverage, and talk with everybody in the group. THe overall interview experience is very good, has basically interacted with everyone in the group.", "Interview Questions": "What makes you a good candidate for the position"}, {"date": "1 Nov 2014", "title": "Clinical Research Associate II Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Sept 2014", "Interview Descriptions": "They contacted me quickly, but the decision was quite slow.  I went through three interviews for one job and never had a chance at the last two for the position. I was disappointed as I had every qualification including the preferred ones.", "Interview Questions": "Vague question... Like what were my thoughts on a vague type idea the interviewer had. "}, {"date": "6 May 2015", "title": "Senior Manager GMP Manufacturing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Feb 2014", "Interview Descriptions": "Discussion and review  with  7 different personnel lasted  the whole day with the visit to the manufacturing area. There were good  amount of technical questions, on process , manufacturing,  and technology transfer. discussion with each person lasted for about 30 min.", "Interview Questions": "Questions pertaining to my  experience in  handling and mentoring people and about fermentation"}], [{"date": "21 Jan 2014", "title": "Recruiting Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN)", "Interview Descriptions": "Had a phone pre-screening with a recruiter, went over the details of the position, then asked behavioral questions. That process took about 30 mins. Got a call back the next day to set up for on site interview and yikes: You sit in this conference room and there are 3 rounds: Round 1: a behavioral interview with 3 other recruiters they will just stare at you and take notes, will prob ask follow up questions to your answers. All entirely behavioral. No questions about what do you know about our company, why did you apply, what are your strengths/weaknesses, nothing like that. Very intimidating setting. Round 2: They will leave, then two other recruiters will come and interview you basically asking general questions about your background then ask a couple behavioral interview questions. Round 3: testing on Word, Excel, Outlook. The interview process lasted about an hour and 10 mins. The testing will probably last an hour also depending upon how well you know MS Office. Got the rejection email a week later so they are good at following up and not leaving you hanging.", "Interview Questions": "All the freaking questions were difficult! I hate behavioral interviews."}, {"date": "23 Jan 2014", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jan 2014", "Interview Descriptions": "I applied online and three weeks later I received a phone call to schedule a phone interview for a week later. The phone interview was about 30 min long.  Awkwardly long pauses in between answers so that interviewer could type in my responses.  After reading all of the reviews, I was prepared for the type of questions, but found the overall interview difficult.", "Interview Questions": "All questions were behavioral type questions:\r\nTell me why you left your last position\r\nTell me a specific time you worked on a team and had favorable/non-favorable results\r\nTell me what you liked and disliked about your last position\r\nTell me about a time when you went above and beyond a goal\r\nTell me about a time when you had a conflict with a team \r\nTell me how you organize your day and time\r\nTell me about a time when you had to be creative to come up with a solution"}, {"date": "7 Oct 2013", "title": "Research Technologist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at St. Jude Children's Research Hospital in Oct 2013", "Interview Descriptions": "Once I submitted an online application, the process took about two months to find out whether I was selected for an interview or not. There are two telephone interviews and then an onsite interview. I have not fully completed the interview process so I can only comment on the first two interviews. The first interview is with the recruiter and and they asked basic behavioral questions as pertaining to the lab. She was very straightforward and professional.  The second interview was with the lab manager and seemed more like a conversation than an interview. Overall I've had a great experience and can only hope that the Onsite interview flows as smoothly. Keep in mind that I have not completed the interview process,  so I have filled out this review as no offer.", "Interview Questions": "When was a time when you did something that benefited the whole group and you did it because you wanted to, not because you were assigned it?"}, {"date": "24 Jun 2015", "title": "Bioinformatics Associate Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Oct 2013", "Interview Descriptions": "Started with a phone interview.  The phone interview went over my resume and asked some question to make sure I really understood my area.  Later I was invited for an on site interview to make a presentation in front of the Computational Biology Department.  Afterward I had meetings with 5 to 6 PI and group leaders.", "Interview Questions": "Asked if I had multiple level of data, how I would analyze the data."}, {"date": "4 Nov 2013", "title": "Benefits Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Oct 2013", "Interview Descriptions": "I was contacted by email to schedule a phone interview.  This phase of the process is pure nuts and bolts.  The interviewer seemed to be screening for qualifications (i.e. Give me an example of what you can do on microsoft word).  I was asked to describe duties and previous jobs.  About a week later I was informed that I had been one of the top 3 candidates and that I would be contacted to schedule an on-site interview.  The on-site interview was a grueling 4hr affair.  It included 2 rounds of interviews with the HR manager, the benefits manager, an analyst and the benefits coordinator.  This was followed by skills testing in office, word and excel (kenexa: prove it).  It may not take you 4hrs but it will certainly take longer than the 2.5 hrs they said in the email.  There were many general questions (how does a job that changes goals frequently make you feel, describe a time that you dropped the ball) There were also a fair number of specific questions (describe a complex piece of information you had to advise about and how do you know they understood).  The people were cordial and professional.", "Interview Questions": "N/A"}, {"date": "6 Aug 2013", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN)", "Interview Descriptions": "The interview was very informal and laid-back, but maybe because she was inexperienced", "Interview Questions": "N/A"}, {"date": "23 Jun 2013", "title": "Postdoctoral Research Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "Academic Programs asked which faculty members I would consider working in, and after I gave them my preferences, they set-up the interview schedule.  It's a one-day interview that began by giving a seminar that's open to the entire St. Jude community on my thesis research.  The seminar is a standard 1 hour block with 45 minute talk and 15 minute question.  Afterwards, there are 1-1 meetings with faculty members and members of their labs.  Finally, there's an opportunity to give your lab preferences to Academic Programs and they will coordinate which faculty members similarly have preference.", "Interview Questions": "There were no difficult questions, it's the same set of questions that I received during my thesis defense."}, {"date": "16 Jun 2015", "title": "Director of Hispanic Marketing & Business Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2+ months. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jun 2013", "Interview Descriptions": "The interview process is very lengthy; all behavioral interview questions, be prepared for a panel interview if you get through the first 4 rounds.  A lot of preparation is needed.  A verbal and written test was required to measure the level of Spanish language fluency among bilingual candidates.  2 video Skype interviews were conducted before the panel interview.  Take notes and be prepared to ask questions as well.", "Interview Questions": "Tell me about a time when you had to work on a projected that didn't result in the outcome you expected and why."}, {"date": "21 Jun 2014", "title": "Research Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Apr 2013", "Interview Descriptions": "3 rounds of interview and onsite interview..they paid for my onsite interview, gave me relocation benefits, helped me with housing.. Memphis city is not that great as such but St Jude is very famous", "Interview Questions": "it was an easy interview, mainly concerned how well you get along with ppl"}, {"date": "20 Aug 2015", "title": "CRA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Feb 2013", "Interview Descriptions": "It was informative and simple. I met with many different people and they all took in interest in me and put me at ease for the most part. It looked intimidating on paper when I got my interview schedule but it went by fast and everyone was nice.", "Interview Questions": "Where do you see yourself in 5 years?"}], [{"date": "7 Dec 2012", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at St. Jude Children's Research Hospital", "Interview Descriptions": "Please be as detailed as possible - including initial communications, planning, and number of interviews.  Bonus points for your perception of the people, office, and work culture.", "Interview Questions": "Please try to be as detailed as possible regarding the technical question, business case, etc."}, {"date": "15 Jan 2013", "title": "Volunteer Services Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Nov 2012", "Interview Descriptions": "The interview process begins with the submission of your résumé and cover letter. You then will review a call informing you if you have been offered a phone interview. This interview is conducted by the director of Volunteer Services, Kathryn Berry Carter, and last for about 20-30 minutes. Lastly you are invited to attend an in person interview with both volunteer coordinators and department director in a round table format.", "Interview Questions": "The knowledge of OR the experience in Different databases used in various volunteer coordinating offices."}, {"date": "10 May 2012", "title": "Research Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in May 2012", "Interview Descriptions": "This is only the first step of application, a conversation with the science recruiter, who asked you general questions, like availability, relocation, salary range, career goals, a little detail about your previous experience. some behaviour questions, like how you solve problems, why you switch majors, which job do you like better etc. \r\n\r\nThe recruiter also kept telling you A LOT OF information about the job responsibilities, it feels like they want to scare you away by saying weekend and midnight shifts sometimes... \r\n\r\nfor non-US citizen applicant, the good thing is, they do not really care about visa issues, they'd like to sponser, as long as you are qualified. \r\n\r\nWhen I said I like research, she quickly pointed out, this \"research technologist\" is not like real research job...but more like assisting others, having the well-prepared recipes, nothing too much for you to explore. that's true. but it's wierd to hear , it may take 4-5 weeks to give you a status update, but if you're selected for an in-person interview, please reconsider, and think about if you do want the job. \r\n\r\nbtw, they mentioned, relocation assistance is offered, depending on the distance. the salary for this position is 35k-40k something. not high, but regular though.", "Interview Questions": "what do you switch majors"}, {"date": "21 May 2012", "title": "Postdoctoral Research Associate Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Apr 2012", "Interview Descriptions": "one on one", "Interview Questions": "N/A"}, {"date": "31 Jul 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jul 2011", "Interview Descriptions": "The interview process was really laid back. My interviewer was a really nice lady, who was personable and easy to talk to. She clearly was invested in the mission of St. Jude and it seemed as though the primary purpose of the interview was to ensure that the new hire would be able to bring the same level of passion and care to their work there.", "Interview Questions": "Do you have any non-profit experience?"}, {"date": "17 Jul 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Feb 2011", "Interview Descriptions": "A great trip. Was put up in the Peabody hotel, got to meet lots of great people, and it was a very relaxed environment. Overall I had a good time. They even brought my wife to see the area.", "Interview Questions": "General questions asking about science and technical skills. "}, {"date": "14 Oct 2015", "title": "Senior Research Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jan 2011", "Interview Descriptions": "The process was fairly easy.  I was interviewed by the PI and lab members.  The process was introducing me to possible coworkers, a tour of the hospital and lab and support facilities.  Everyone was very busy, but also friendly and welcoming.", "Interview Questions": "Understanding of molecular biology"}, {"date": "10 Dec 2015", "title": "Administration Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jan 2011", "Interview Descriptions": "Typical - nothing special. Panel interview with team.  1:1 with department head.  They asked some behavioral questions that are pretty standard based on other interviews I've done. Some people asked regular questions. Not everyone had read my application.  They seemed in a hurry.  Talked more than I did - I mostly listened.", "Interview Questions": "Tell us about a time you had to deal with an angry customer."}, {"date": "11 Aug 2010", "title": "Telemarketer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Mar 2010", "Interview Descriptions": "I applied online and htye consistently updated me with the status of my application. I had a phone interview, skills test(basic knowledge of computers), and a face-to-face interview. They asked basic interview questions.", "Interview Questions": "Pretend you are selling them something. "}, {"date": "1 Aug 2010", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jan 2008", "Interview Descriptions": "Presentation, followed by interview", "Interview Questions": "related job experience"}], [{"date": "19 Mar 2009", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 days. I interviewed at St. Jude Children's Research Hospital (Memphis, TN) in Jan 2007", "Interview Descriptions": "Initial contact is usually made through te Academic Programs office.  They will contact you and if they want you to come and interview, will set-up travel arrangements.  Your CV sill be sent out to potential PIs for review and those you want to interview with and who want to interview you are put on your schedule.  It is at minumum a 2 day process, including a 40-50 minute presentation.  \r\n\r\nThe 2 day process can be grueling depending on how many interviews are scheduled for the applicant.  Also, all lunches and dinners are with potential supervisors (PIs) or colleagues (post-docs), so you are always \"on\".  \r\n\r\nThe process is well managed by the Academic programs office and they are into recruiting you as much as you are into getting a position.  They work hard at matching the right person with the right labs.  They also offer a lot of advice on matching personality types - as long as you pay attention to what they are saying.  St Jude has a ton to offer, but picking a PI is the MOST important decision you will make and it is extremely important to not let the place and perks overwhelm you.  Listening carefully to the APO and to the post-docs will give a better feel for how a potential PI is, than the one-on-one interview does.", "Interview Questions": "There were no questions that were unexpected but it was important to know the research of the PIs you interview with.  This can be a lot if you interview with 10 or more PIs."}]]