[[{"date": "3 Jul 2023", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioHealth (Columbus, OH)", "Interview Descriptions": "There were a few different phone interviews during the process followed by several in-person interviews with the hiring manager as well as finance team members, it was a pretty standard process overall.", "Interview Questions": "Why are you interested in this position?"}, {"date": "23 May 2023", "title": "Business Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OhioHealth in Apr 2023", "Interview Descriptions": "I find it odd that they verbally promise a next round interview but then ghost candidates for weeks to only discover themselves that they have been removed. I think it speaks poorly on their work culture.", "Interview Questions": "Generic questions - average difficulty N/A"}, {"date": "22 Mar 2023", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OhioHealth", "Interview Descriptions": "Two days, one with team and one with vp. Both included standard and personal/unique questioning. Very welcoming team, questions were experience based. Team consisted of immediate leader, directors and peer advisors.", "Interview Questions": "Tell me about a time you had to change a project based on new information or direction"}, {"date": "22 Mar 2023", "title": "Physician Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OhioHealth", "Interview Descriptions": "Fast, it was a phone call and then a zoom interview and not too invasive. Discussed compensation early and it was brief. I have not yet met the word min so here we are still typing.", "Interview Questions": "Why do I want the position?"}, {"date": "14 Feb 2023", "title": "Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth", "Interview Descriptions": "I had 3 interviews: HR, hiring manager, and a panel interview. In total, interviews were about 3 hours. \n\nUnfortunately, they never responded to let me know that I did not get \nthe position. I found out my checking the candidate workday site periodically.  Ultimately, it updated that I was not offered the position. I do not feel that the hiring process was professional.", "Interview Questions": "Tell me about management style."}, {"date": "17 Nov 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "The interview process was fairly easy going. The interview was held online, and the tool used for that was easy to navigate. Panel interview with multiple nurse managers and educators.", "Interview Questions": "Lots of behavioral questions--come prepared with scenarios"}, {"date": "24 Oct 2022", "title": "Senior Accountant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at OhioHealth (Columbus, OH) in Oct 2022", "Interview Descriptions": "Things went great, can’t wait for next steps. Really liked the manager I interviewed with, she seems organized. Interesting atmosphere and they appear to believe in work/life balance. Exciting opportunity", "Interview Questions": "How do you think you’re different from other applicants?"}, {"date": "28 Sept 2022", "title": "Technical Support Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "easy was less than 30 minutes. interviewer was polite and share background about themself. interviewer was open and honesty, answered all my questions to the best of their ability. can't wait to get started", "Interview Questions": "time you handled stress, what did you do"}, {"date": "14 Sept 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH)", "Interview Descriptions": "I've applied to many positions as a PCA and I'd interview and not hear back. I interviewed once in person, twice on a webcam, and have had many phone screenings, and all of the times I didn't hear back. I got accepted to one position that asked me if I was interested in becoming a unit clerk and I declined due to the fact that I do not have time, as i am a student. I would call back to see if I got the job and they never would get back to me. I even became very familiar with one of the HR members who promised to help me find a position and would tell me that she was going to get back to me by *blank time* and she never did. I am beginning to get very frustrated because I have been trying to get a job here for over a year now. The hiring process has been very difficult for me. ", "Interview Questions": "Why are you interested in working for Ohiohealth "}, {"date": "20 Sept 2022", "title": "LEAN Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OhioHealth (Columbus, OH) in Sept 2022", "Interview Descriptions": "The process of setting up an interview took way longer than necessary. During the process, two separate email threads were begun by the HR representative requesting availability, and between those two, a no-reply email was sent saying they were moving forward with other candidates even though conversations about availability were occurring. \n\nThe first interview, the HR representative did not call at the agreed upon time, and only once I emailed them to follow up did they tell me they tried to call but it didn’t go through and then we rescheduled the interview. \n\nThe interview once it actually occurred was fine, but the HR representative sounded like they were in a very echo-y room, and did not seem to be very knowledgeable about the position -also could not answer whether or not the company has any professional development programs. \n\nWhen asked about compensation, the representative explained that it is equity-based, and would not commit to any kind of starting point number. \n\nThe representative also mentioned that there were several different layers of interviews should the hiring process progress further, which seems a bit excessive. \n\nAll in all, the number of red flags throughout the the interview process made the final “no thank you, we’re going with other candidates” email feel like a relief. Did not get the impression that the company is very organized or efficient.", "Interview Questions": "No unusual interview questions, just the usual questions about experience and goals."}], [{"date": "17 Aug 2022", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH)", "Interview Descriptions": "Multiple interviews with various Managers, Directors and Direct reports-time consuming and not scheduled timely. Difficult to prepare for interview. Would not suggest. Felt that I was being interviewed to check a box, not a true interest in hiring as a candidate.", "Interview Questions": "Extremely random based on person conducting interview."}, {"date": "11 Aug 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "It was fine…it worked out in my favor but the pay was not enough to accept\nThe position. I may reconsider at a later date if they are paying more…", "Interview Questions": "How well\nDomi work with others"}, {"date": "5 Jun 2022", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "People were\r\nGreat. Looking forward\r\nTo working in such a great environment with such great people. Great drive and fun atmosphere co-workers seem extremely knowledgeable technology up to date application process fun and promising", "Interview Questions": "Where I see myself I. 5 years"}, {"date": "11 May 2022", "title": "Exercise Physiologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OhioHealth", "Interview Descriptions": "I received an email and a phone call to interview. I was in an event so missed the call but responded to the email. I sent two follow up emails over the next two weeks when there was no response. The manager who reached out before then called me again a week later and I missed it as I was at work. I called back a few hours later and left a voicemail expressing interest to finally talk to them. There was no return call and I received an email the following day saying I did not get the job. I will not apply to this department of again as it is obviously not well run.", "Interview Questions": "\"would you like to interview for this job?\""}, {"date": "24 Feb 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "It’s takes a long time and can be hard to get a call back for a interview but if u keep trying and keep calling it might work. It’s a lot easier when u know someone on the inside", "Interview Questions": "What do I bring that other people don’t "}, {"date": "21 Feb 2022", "title": "Sr Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "The interview included around five meetings with different leaders from different teams that included screening call. Relatively responsive recruitment process and lasted about 4 weeks total. Phone calls and in person meetings at different sites.", "Interview Questions": "Time you ran a large project. "}, {"date": "1 Dec 2022", "title": "Senior UX Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth in Feb 2022", "Interview Descriptions": "Email exchange with hiring manager followed by a 1 on 1 skill interview. Then, a team interview for cultural fit, which was beneficial on both sides. Process was very transparent.", "Interview Questions": "They wanted to understand my passion and specialty in order to see how I could add value to the team."}, {"date": "17 Feb 2022", "title": "Senior Consultant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OhioHealth in Feb 2022", "Interview Descriptions": "Virtual meeting with several leaders present. Everyone was very lovely and they listen, They also did a good job explaining the job and all requirements needed. A lot of focus was on teamwork.", "Interview Questions": "Risk assessment experience at previous work."}, {"date": "13 Oct 2022", "title": "Registered Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OhioHealth (Columbus, OH) in Jan 2022", "Interview Descriptions": "It was brief, there were 4 people present. Asked typical questions (strengths, weaknesses, challenges, what you are proud of, etc.) It was very comfortable and easy! No need to prepare extensively.", "Interview Questions": "Strengths, weaknesses, challenges and how you overcame them"}, {"date": "13 Jan 2022", "title": "Patient Care Assistant (PCA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH) in Jan 2022", "Interview Descriptions": "Interviewer was great. Very friendly. She asked me questions about my life. My strengths and weaknesses. She made me feel comfortable. I wasn't nervous because she didn't act like a robot.", "Interview Questions": "Why do you want to be a PCA at ohio health?"}], [{"date": "12 Mar 2023", "title": "Executive Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OhioHealth in Dec 2021", "Interview Descriptions": "I applied for the position at OhioHealth in November, and had my first interview in mid-December with HR via phone. Due to the holidays, I was told that I might not hear from them again until sometime in January. The second interview was scheduled in mid-January with the executive the position supported via video call. Was told they would be making a decision by the end of the month in the interview. However, about a week later was told that they wanted me to interview with two administrative employees who I would be working with, thus delaying that process. I arranged interviews in early February and met with both, sent off thank you letters...and waited...and waited...and waited. Sent a follow-up email to the executive the position supports inquiring again when they would be making a decision. Never received a response. Reached out a final time at the end of February, and to this day have never received even a courtesy response to let me know they had gone with someone else. Although I had considered applying for other positions within OhioHealth, this experience and lack of response after 4 interviews has caused me to look for opportunities with other companies.", "Interview Questions": "Standard questions (tell me about yourself, what are your strengths/weaknesses)"}, {"date": "27 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at OhioHealth (Columbus, OH) in Oct 2021", "Interview Descriptions": "Basic questions were asked.  Everyone seemed very genuine. The interview process was not too long nor harsh. It is a group interview and if you have fear of talking to a bunch of people you may have trouble.", "Interview Questions": "if you have a coworker who is stealing, what would you do?"}, {"date": "30 Sept 2021", "title": "Dietetic Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "The questions were mostly behavioral in nature and followed the STAR format. It lasted around 45 minutes and was a panel interview. The team was a very nice team and provided very good constructive feedback.", "Interview Questions": "What is one of your weaknesses?"}, {"date": "21 Sept 2021", "title": "Host Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at OhioHealth (Columbus, OH) in Sept 2021", "Interview Descriptions": "Very straightforward and professional. I was given a lot of information about the job. This was a basic HR interview following an online application. The person I talked to was clear and listened to my questions.", "Interview Questions": "Whether I was available to work weekends and holidays."}, {"date": "7 Oct 2021", "title": "Human Resources Senior Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OhioHealth (Columbus, OH) in Sept 2021", "Interview Descriptions": "Recruiter phone interview, hiring manager interview, interview with 4 different Vice Presidents split between two interviews.  Total of 4 interviews.  Overall easy interview and general discussions during each of these interviews.", "Interview Questions": "Why do you want to work for OhioHealth?"}, {"date": "24 Sept 2021", "title": "Licensed Practical Nurse (LPN) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at OhioHealth (Marion, OH) in Sept 2021", "Interview Descriptions": "Very straightforward! Super nice and easy going.  It was virtual due to covid but they gave a lot of information about the job duties. They took in consideration that I was a new grad during the pandemic and gave me encouraging words that I will utilize in my career.", "Interview Questions": "Tell me about yourself and Any questions"}, {"date": "15 Oct 2021", "title": "Anonymous Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at OhioHealth in Jul 2021", "Interview Descriptions": "The hiring processes spanned over two months. I applied and a recruiter reached out to me a month later. She then forwarded my information to the hiring manager who I interviewed with a week later. I then interviewed with 3 people I would be working closely with in the role. The first two interviews were very laid back and conversational, but the last one was intense. In my opinion, it was little too intense and in-depth for the position level. \n\nAfterwards, I was told that someone would follow up with me regarding the position. That was four weeks ago. I had to discover that I was not selected for the position by scrolling past a re-post of the job description on Linkedin and proceeding to my candidate portal to confirm. I have still not received a call or even a simple rejection email. Very unprofessional.", "Interview Questions": "Who is your role model?"}, {"date": "25 Jul 2021", "title": "Clinical Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioHealth in Jul 2021", "Interview Descriptions": "First interview was a phone interview. Tell you about the company and position. Then after you explain your roles and how that make you an excellent fit for the company. Talk about research background and your future career goals and how Ohiohealth fits into that picture.", "Interview Questions": "What salary range?\r\nWhat’s your skills and experiences \r\n"}, {"date": "30 Nov 2022", "title": "Facilities Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH) in Jul 2021", "Interview Descriptions": "After 3 interviews I was ghosted by the company. Very unprofessional and discouraging. No longer wish to work for a company like this. Lack of communication and professionalism. Spent many hours interviewing and preparing only to be ghosted", "Interview Questions": "What was my previous experience Have I worked in healthcare before"}, {"date": "24 Jul 2021", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at OhioHealth in Jul 2021", "Interview Descriptions": "The interview process was efficient and also very welcoming . The unit managers were very open and sweet. They were open to answering questions and hearing my answers to their inquiries . I actually enjoyed the process.", "Interview Questions": "They ask about you and nursing related questions "}], [{"date": "14 Jun 2021", "title": "Patient Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "The interview was pretty good. I was asked the typical interview questions. The interview lasted about 15 minutes. It took one week to hear back from them about the position and get an offer. The nurse manager and a charge nurse interviewed me once over the phone.", "Interview Questions": "What would you do if you had a conflict with a coworker?"}, {"date": "13 Jun 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth", "Interview Descriptions": "Overall, I had a good experience. Panel with 3-4 leaders from the unit. I also got a tour of the unit and met some other staff nurses briefly. They were kind and asked simple questions.", "Interview Questions": "Previous experience and what I was looking for now. "}, {"date": "24 Jul 2021", "title": "Digital Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OhioHealth (Columbus, OH) in Jun 2021", "Interview Descriptions": "I went through 3 out of 4 interviews: recruiter phone screening, hiring manager virtual interview, team panel. Last one would have been SVP. Recruiter was very nice, friendly, provided good insight to role. Virtual interview and team panel were quick 30 min interviews. I felt confident I would progress to the final phase but was ghosted. Not a word from the recruiter after the team panel.", "Interview Questions": "Are you comfortable giving presentations?"}, {"date": "19 Jun 2021", "title": "Registered Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at OhioHealth (Marion, OH) in Jun 2021", "Interview Descriptions": "The interview process was literally perfect. \nThey explain everything, they do not ask all the silly questions that you think of when preparing for an interview. \nOverall, perfect experience. If you are even thinking about maybe applying, just do it!", "Interview Questions": "What is your biggest weakness?"}, {"date": "21 May 2021", "title": "RN Fellowship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "You fill out online application for rn fellowship You do not get to choose a particular hospital or particular type of nursing (cardiac, neuro, etc.). You get put where there is an opening. zoom interview with 3 nurses then another zoom interview with med surge fellowship hiring nurses.", "Interview Questions": "what do you think about diversity"}, {"date": "1 May 2021", "title": "Financial Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth", "Interview Descriptions": "Multiple interviews with different people. A first round and second round type of situation. Interviews were roughly an hour each and were pretty low stress overall. The Employees were nice.", "Interview Questions": "What are your Different strengths and weaknesses "}, {"date": "6 Jul 2021", "title": "Applications Architect Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OhioHealth (Columbus, OH) in May 2021", "Interview Descriptions": "This was by far the worst experience I've ever had interviewing for a job in my 16 years of working, including interviews with fast food companies as a teenager.  After three months, four interviews, and two insultingly low offers, I had to give up on my dream job to preserve my sanity.  After this experience I'm going to be suspending my job search for a few months just to mentally recover from this overwhelmingly stressful misadventure.\r\n\r\nIt turns out that the requisition for this position is coded as a Business Developer, a role that has a median salary of less than HALF of an Applications Architect, and is WILDLY different.  The offer I was given was well below the 10th percentile for this role, according to salary.com.\r\n\r\nWhile I shared my current salary and expectations with HR at the outset of the process (and was told my expectations were reasonable), they had the stones to offer me $8k less than my current salary as a full stack developer, TWICE.\r\n\r\nI cannot interpret their behavior as anything but deceptive and downright disrespectful.  These offers were a slap in the face to someone with more than a decade of direct experience in multiple technical disciplines of hospital IT, full stack software engineering experience, multiple Epic certifications, and domain knowledge of nearly every service line in the business.  They talked up a big game about how much they wanted me, but knew that they were going to be lowballing me from the start.  They are predatory, looking for people who are desperate.\r\n\r\nI would never recommend that anyone initiate the hiring process with OhioHealth.  Don't waste months of your time, days of PTO, and your sanity.", "Interview Questions": "What's the lowest possible salary that you'll accept for the enormous responsibility of designing our entire IT portfolio?"}, {"date": "22 Oct 2022", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at OhioHealth (Columbus, OH) in Apr 2021", "Interview Descriptions": "Phone interview with manager and a team interview face to face. Asked great questions from all parties. I felt prepared for the job when I accepted the job. Then toured the unit with managers.", "Interview Questions": "Why I wanted to work there"}, {"date": "12 Mar 2021", "title": "Critical Care Fellowship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "Very easy going. Two people took turns asking me questions. Two scenarios asked. Mostly priority. Very friendly women. Asked about my past jobs,  past employers, my strongest characteristic, etc. The WebEx interview app was way to navigate as well.", "Interview Questions": "What’s one characteristic you’d give yourself?"}, {"date": "9 Mar 2021", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "It was a normal run of the mill interview. Slightly awkward because it was virtual.  Never heard anything up despite following up and being told I would be communicated with in the future whether they were going forward with other parties.", "Interview Questions": "What brought you to apply here?"}], [{"date": "4 Mar 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "The interview went ok. A normal interview for this position. Nothing out of the ordinary, just asked about past experiences and talked more about the position. Also asked about certifications and spoke of job  expectations.", "Interview Questions": "Typical questions, already stated in above section\r\n"}, {"date": "8 May 2021", "title": "Executive Coach and Leadership Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at OhioHealth (Columbus, OH) in Mar 2021", "Interview Descriptions": "It was a good experience where my past experiences and results with the company carried much of the conversation. It was a 2 stage process with an initial information gathering stage and then a proposal review.", "Interview Questions": "How would you go about helping us improve...?"}, {"date": "31 Mar 2023", "title": "Registration Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OhioHealth (Columbus, OH) in Jan 2021", "Interview Descriptions": "Very quick, interviewer only talked about herself. She asked about my experience and if I’ve ever worked in a hospital. I don’t think she had much experience interviewing people, and laughed at her own jokes the entire process. I lost interest pretty quickly.", "Interview Questions": "Tell me about about a time where you were a leader?"}, {"date": "15 Dec 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "Very relaxed and on Webex. Only a few general questions were asked. Answered all my questions. Said I was qualified for the job. Basically hired on the spot. Receive offer letter 2-3 business days later. Interviewed for the Critical Care Fellowship.", "Interview Questions": "Tell me about your nursing school experience"}, {"date": "5 Jan 2021", "title": "Systems Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at OhioHealth (Columbus, OH) in Dec 2020", "Interview Descriptions": "There was a total of two-panel interviews.  There were three additional interviews.  The interview consisted of senior Level Management, Direct Staff, and an HR Representative. \r\nInterviews occurred over 3 days", "Interview Questions": "My approach for the first 90 days on the job."}, {"date": "12 Oct 2020", "title": "PGY1 Pharmacy Resident Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at OhioHealth", "Interview Descriptions": "felt very comfortable throughout the process! seem like great colleagues to work with. The company seems to provide lots of perks for employees. Would have picked to work there if I matched.", "Interview Questions": "tell me about the craziest thing you've ever done"}, {"date": "21 Aug 2020", "title": "Medical Laboratory Technician I (MLT) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "Straightforward and professional interviewing. Very Friendly and welcoming environment. Mask and sanitizer provided in lobby. Thorough discussion of pertinent subject matter and addresses concerns openly and transparently. Displayed a desire to want the employee to succeed in their career.", "Interview Questions": "Which department within the lab do you most enjoy?"}, {"date": "30 Jun 2020", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "Applied online and was notified to schedule and interview. Virtual interview for outpatient job with clinic manager, very relaxed conversation centered email based on my resume. Great mentorship program for new grads.", "Interview Questions": "What was constructive criticism you received from a clinical instructor?"}, {"date": "7 Oct 2020", "title": "Clerical Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH) in Apr 2020", "Interview Descriptions": "Received a call for a zoom online interview  interviewed with several people in management.    After the interview I was called for a second interview, which I declined because of the covid and the difficulties with daycare.", "Interview Questions": "why am I leaving current job?"}, {"date": "4 Feb 2020", "title": "Administrative Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "Somewhat slow HR process, but very positive interview. Use meaningful questions to understand my motivations and interests. I found the interview day to be smooth and I got a good sense of the culture at the organization.", "Interview Questions": "Describe your proudest accomplishment."}], [{"date": "2 Dec 2019", "title": "SARNCO Hospital Advocate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth", "Interview Descriptions": "In person, casual, informative interview for volunteer role within SARNCO. All questions are answered and entire volunteer process is laid out.  You are offered position at the end end of the interview and they explain what you need to do prior to training.", "Interview Questions": "What qualities do you possess that will be helpful in advocating for survivors?"}, {"date": "1 Nov 2019", "title": "Business Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OhioHealth (Columbus, OH) in Oct 2019", "Interview Descriptions": "longer interview process but team was professional. There were several steps in the interview process making the overall experience take quite a while. Campus was nice and overall culture seemed beneficial.", "Interview Questions": "Tell us about a time you went above and beyond in your current position"}, {"date": "12 Apr 2021", "title": "Food Service Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH) in Sept 2019", "Interview Descriptions": "Very brief zoom meeting, he was direct and explained things well. Told me what was needed to fill the role offered a job on the spot. Took a little minute to get everything in order, did a drug test and a background check", "Interview Questions": "What is your strongest skillset"}, {"date": "26 Aug 2019", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at OhioHealth", "Interview Descriptions": "I Applied online for the intermediate fellowship Was emailed a week later for interview. You schedule a fellowship interview thru a web link that they send to you and you select a time slot that works. It is really simple", "Interview Questions": "I go in next week for a panel interview for the intermediate fellowship. I am preparing for the interview with reviewing this website for possible interview questions that I may be asked"}, {"date": "17 Oct 2019", "title": "Occupational Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OhioHealth (Columbus, OH) in Aug 2019", "Interview Descriptions": "Review of resume, questions about clinical experience and how one handles conflict and difficult patients.  Then I asked questions about the position.  Tour of the facility and meet with some of the other OTs.", "Interview Questions": "What does operating at the highest level of your license mean to you?"}, {"date": "11 Sept 2019", "title": "Clinical Fellow - Speech Language Pathology Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at OhioHealth (Mansfield, OH) in Aug 2019", "Interview Descriptions": "Ohio Health was clear and prompt in contacting me via phone and email to start the interview process. They outlined a timeline which they consistently adhered to and remained transparent throughout the interview process.", "Interview Questions": "Where do you see yourself in 10 years within the field?"}, {"date": "8 Jul 2019", "title": "Technical Laboratory Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at OhioHealth (Columbus, OH)", "Interview Descriptions": "I had an email reach out, some phone calls, and then an interview with all the supervisors of the outreach team. I did know someone in the position I had worked with previously so it may have processed faster. \r\nThey offered me the minimum, I took it because I wanted the job, but I recommend asking for more.", "Interview Questions": "Have you had a situation with an unhappy customer and how did you handle it?"}, {"date": "6 Aug 2019", "title": "Advanced Practice Provider Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OhioHealth (Columbus, OH) in Jun 2019", "Interview Descriptions": "Had email and phone communication with a recruiter who set up a phone discussion with the hiring manager.  Very basic questions about myself and why OhioHealth.  Very short discussion, said she would forward her notes to the other decision making parties and I would hear back with a \"no\" or to move forward in the process.  Never heard anything back.", "Interview Questions": "Typical: Tell me about yourself.  Why are you interested in a position with OhioHealth? Why did you become an APP?"}, {"date": "4 Aug 2019", "title": "Staff Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at OhioHealth (Mansfield, OH) in Jun 2019", "Interview Descriptions": "1) apply on OhioHealth website, very detailed questions and a behavior questionnaire (no wrong or right answers). It took me 2 hours in total.\r\n2)interview with accounting manager and controller\r\n3)peer interview with other team members", "Interview Questions": "what is your advantage?"}, {"date": "9 Apr 2019", "title": "Supervisor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OhioHealth (Columbus, OH) in Apr 2019", "Interview Descriptions": "After cancelling interview twice and receiving a call after 45 min passed schedule time I think it would not hurt to say they don't value your time and effort.", "Interview Questions": "Standard interview. "}], [{"date": "2 Apr 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at OhioHealth (Columbus, OH)", "Interview Descriptions": "Recruiting process was VERY unorganized! I had to follow up MANY times with recruiting director. The VP of HR really led the process.\r\n\r\nI had two screening in person interviews w/HR.\r\nTwo half day in-person interviews with company leadership. Interviews were pleasant and seemed to focus on cultural fit and working cross functionally more than job competence.", "Interview Questions": "How would deal with multiple competing goals between care sites and administrative leadership?"}, {"date": "17 Mar 2019", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OhioHealth (Columbus, OH)", "Interview Descriptions": "You'll interview with a couple pharmacy managers and a couple lead technicians. They ask mostly behavioral type questions. The interview process is fairly easy overall. I would focus your answers more on the lead techs, as they have a lot of say behind the scenes. They also know better what to look for when interviewing people.", "Interview Questions": "Describe a time when you didn't get along with a co-worker and how you resolved it."}, {"date": "2 Oct 2019", "title": "Strategic Planning Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at OhioHealth (Columbus, OH) in Mar 2019", "Interview Descriptions": "Got in contact through HR by applying online. The person I spoke with over the phone initially seemed nice but after a few minutes she kept trying to pigeonhole my resume as not having certain skills.\r\n\r\nShe would say things like \"so you don't have any experience with ________\" to which I would reply with a specific example of having said skill but to only have her try to limit my experience in other ways. Was very off-putting and bizarre, almost felt like she was trying to make me intentionally look bad for some strange reason. I was definitely turned off from applying to OhioHealth in the future because of it.", "Interview Questions": "Have you ever used _________ before? "}, {"date": "5 Sept 2022", "title": "Clinical Informatics Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at OhioHealth (Dublin, OH) in Mar 2019", "Interview Descriptions": "Questions were not difficult. Interviewed with team after interviewing with hiring manager. Hiring Manager didn’t follow up for several weeks post interview then stated they were going with more qualified candidate.", "Interview Questions": "What would your team say about you?"}, {"date": "28 Feb 2020", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at OhioHealth (Columbus, OH) in Mar 2019", "Interview Descriptions": "The interview process was easier than expected. \r\nI applied, and I e-mailed a contact I had with the company stating I applied. \r\nI had a phone screening that was about 10 minutes and was asked about why I wanted to work at OhioHealth and what my goals are. On the phone, they set up my interview.\r\nI went to my interview, I was asked about my skills, why I wanted to work there, work history, and then I was shown around the facility.\r\nIt took about a month, and then I was offered the position.", "Interview Questions": "What are my short and long term goals"}, {"date": "21 Feb 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at OhioHealth", "Interview Descriptions": "My interview was actually pretty typical of what one expects of a interview.  Both HR and the hiring manager complimented multiple times how I dressed for success which made me wonder what others who interviewed wore. The people that interviewed me made me feel very comfortable and they were very easy to talk to and hold a conversation.", "Interview Questions": "What are your strengths and weaknesses are asked multiple ways. And why are you leaving your current job? How do you handle conflict with patients and with peers? "}, {"date": "1 Feb 2020", "title": "Patient Registration Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OhioHealth (Columbus, OH) in Jan 2019", "Interview Descriptions": "I applied online and was emailed by a recruiter to set up a phone interview. I went into the hospital and interviewed with one of the managers in the department.", "Interview Questions": "Describe an experience working with a difficult customer"}, {"date": "5 Oct 2018", "title": "Host/Hostess Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Marion, OH) in Oct 2018", "Interview Descriptions": "I was contacted about two days after applying on line.  The two interviewers were Department managers.  I was asked a few “throw you for a loop” questions.  A day after the interview, the recruiter sent an email, advising that another candidate was selected.\r\n\r\nI can only think of two reasons why I was not selected, my age or that I was overqualified.\r\n\r\nWhen I was younger, if I was invited for an interview, I received an offer.  I am retired now and I wanted to work in a  local facility., just a job without all the stress of my original profession.  I wish there was someway to see the qualifications of the person receiving the job offer.  The company advertises that it is an equal opportunity employer but I am having serious doubts.", "Interview Questions": "Name your best supervisors and why you liked to work for them"}, {"date": "22 Aug 2018", "title": "AR Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH)", "Interview Descriptions": "I interviewed June 20, 2018 with the Home Care department. I first received a phone interview request with the hiring department.  This interview took place on June 13.  She said she would forward my resume to a department that she thought would be a good fit. I then received a call from the Home Care department. Their were 3 different department heads interviewing at the same time.  I feel like the interview went well.  I feel like I answered all questions very direct and was knowledgeable about tasks that i would be performing.  I was told that they were conducting some more interviews before they would reach any decisions but either way I would receive a call or email letting me know.  As of yet i have not received any correspondence at all.  I am hoping to still hear from them.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "3 Jun 2019", "title": "Windows Technician/Installer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at OhioHealth (Athens, OH) in Aug 2018", "Interview Descriptions": "I first interviewed with Max(FaceTime iOS) from TEKSystems, followed by Jeff(phone), and finally I met with four gentleman; \r\nBrad - Manager | Nate - Supervisor  & Bryan - SR Tech \r\nwho were employed with Ohio Health at the O'bleness Hospital located in Bobcat country (Athens, OH). As soon as I walked into the room I felt the confidence and high hopes in the room. Then the interview began.", "Interview Questions": "What got you into IT Mr. Hikec?"}], [{"date": "23 Jun 2018", "title": "Staff Accountant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OhioHealth", "Interview Descriptions": "The initial screening took a long, long time--I believe several months passed after I initially applied before I was contacted. Once contacted, the first round screening interview and secondary in-person interview went very quickly, followed almost immediately by an offer. So, patience is required initially but the process speeds up as you proceed. If trying to get into OhioHealth from another employer, best to start early as it may take awhile beginning to end.", "Interview Questions": "Describe a challenge work arrangement of the past."}, {"date": "25 Nov 2018", "title": "Patient Care Technician Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at OhioHealth in Jun 2018", "Interview Descriptions": "Applied in January. Called in May. Played phone tag with the recruiter several times. Interview with floor manager went well. Because my schedule didn’t fit with that floor they called to schedule an interview for another floor but it had been so long I took another job.", "Interview Questions": "Tell me about a time where there was a breakdown in communication "}, {"date": "10 May 2018", "title": "Medical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OhioHealth (Columbus, OH)", "Interview Descriptions": "I applied online and was contacted by HR and spent about 15 mins answering generic questions.  I was then called by the office of the hiring manager to interview. I went in that week for the interview with two managers who asked about my previous experience and told me about the job and what to expect.  About 1 week later I was offered the job.", "Interview Questions": "Tell me about yourself and your experience "}, {"date": "30 Jun 2018", "title": "Director Clinical Quality Value Analysis Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OhioHealth in May 2018", "Interview Descriptions": "The entire process took more than three months.  I applied for the position, had a phone interview, then a panel interview. The interviews went very well.  More than a month after the interview I did not hear back from OhioHeath or the recruiter. I also checked the application status online and there were no change to it. I contacted the recruiter and she told me, \"oh, they really like you but we decided to go with someone else.  Of all the personal time and investment applicants go thru to apply for a job and prepare for an interview, you'd think some organizations would have the decency to simply give you a periodic update on your application, especially a month from when you interview.  Does not seems like an organization I'd want to work for if they are treating potential employees this way (when they should be trying to attract great talents to their organization). Simply because is looking for a job or has lost their job does not means they have lost their dignity. I definitely wouldn't recommend OhioHealth based on my personal experience.", "Interview Questions": "Describe a time you institute change in your previous roles."}, {"date": "23 May 2018", "title": "Prn Pharmacy Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at OhioHealth (Columbus, OH) in May 2018", "Interview Descriptions": "I applied online and recieved a call from the director of pharmacy for an interview the next week. During the call he explained the interview process to me: 30 minute interview with himself and a 30 minute panel interview with the full time pharmacists and technicians.  Due to the panel peice of the interview I was told they only conduct interviews on Tuesdays and Thursdays. I returned his call Wednesday and so he pushed for a next day interview which i didnt like too much but accepted. Once there he didnt ask many questions. A few about experience but left the time very open, and asked if i had questions. Very casual. The panel portion was nice. I got to meet the team and they were very kind and goal driven. This half explained the role and expectations in much more detail. It was the best part of the interview in my opinion. I could sample the atmosphere and how i fit and see what everyones expectations were. Last, i was given a tour of the facility and told what to expect in terms of follow-up.  Although they were all very nice, i think it became apparent during the interview that the schedule and hours werent something that worked for both of us.", "Interview Questions": "How have you dealt with conflict with a coworker or difficult customer in the past?"}, {"date": "19 Apr 2018", "title": "Medical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OhioHealth (Columbus, OH) in Apr 2018", "Interview Descriptions": "Human resources contacted me first after reviewing my application I submitted online. The person from human resources held a 20 minute phone call that went through some generic interview questions specific to the job but as well as the fit to the company. Then the manger of social work contacted me to set up an in person interview. The interview was a review of the position, the manger asked me questions specific to my experience that makes me a good fit for the role . The manger was advertising this position to me as well as myself to her.", "Interview Questions": "Explain your work experience regarding medical social work."}, {"date": "29 Jan 2018", "title": "Team Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at OhioHealth (Marion, OH) in Jan 2018", "Interview Descriptions": "Interviewed with three of the nicest ladies ever. They were very kind and answered all questions I had. The explained upcoming projects and expectations. They talked about the work area that would be offered. They were very knowledgeable and helpful through the interview process. Thanks for you time.", "Interview Questions": "How would I handle a difficult situation?"}, {"date": "22 Jan 2018", "title": "Clinical Nurse Leader Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OhioHealth (New York, NY) in Jan 2018", "Interview Descriptions": "I interviewed with a panel of managers and then a panel of peers. There were 4 managers and 5 peers. The peers were other nurses, techs, and a member of management.", "Interview Questions": "Name a problem you had and the steps you took to solve it"}, {"date": "12 Jan 2018", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OhioHealth (Columbus, OH) in Dec 2017", "Interview Descriptions": "Relaxed but complete. I interviewed with a recruiter and the was asked to come in for a face to face. The face to face was 2 interviewers who went through my background, employment, schooling and asked to get to know me. I felt great like they really wanted to know who I was and my personality.", "Interview Questions": "They asked about strengths?"}, {"date": "3 Nov 2017", "title": "Radiologic Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "Asked basic questions, with a few random questions that really made you think. There were 3  interviewers in the room and all were friendly and very easy to talk to. Overall, it was a decent interview.", "Interview Questions": "What color is your brain?"}], [{"date": "2 Oct 2017", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at OhioHealth (Columbus, OH)", "Interview Descriptions": "The first stage was a phone screening with a recruiter. The second interview was in-person with  2 managers. The final interview was with the director and then a panel question and answer style conversation with would be co-workers.", "Interview Questions": "Describe something you consider a weakness."}, {"date": "14 Sept 2017", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH) in Sept 2017", "Interview Descriptions": "Was a relaxed and positive experience. They were very complete in covering my experience and previous employers. They took the time to get an idea of my skills and personality.", "Interview Questions": "Previous work experience, what problem I had and what I did about it. "}, {"date": "25 Jun 2021", "title": "PSA II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OhioHealth (Columbus, OH) in Aug 2017", "Interview Descriptions": "I had 3 interviews. One over the phone and two in person. The phone interview was a short interview about myself and the next two were with nurses. They wanted to know if I have good time managing strategies and if I can remain calm at work. Now I know why they were asking bout these skills.", "Interview Questions": "how do you keep track of time when busy at work? \n"}, {"date": "8 Aug 2018", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at OhioHealth (Columbus, OH) in Jul 2017", "Interview Descriptions": "Phone interview with a clueless HR assistant. Couldn’t tell me hours or anything. She was very polite and validated my parking. Waited 40 mins to meet a supervisor who had no clue why I was there.", "Interview Questions": "Name something you did in a situation "}, {"date": "2 Sept 2017", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH) in Jun 2017", "Interview Descriptions": "I met with the ED manager, whom I had an initial phone interview, followed by an in person interview. Lastly, an HR interview took place before an offer was made", "Interview Questions": "Customer care experience"}, {"date": "10 Jul 2018", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OhioHealth (Columbus, OH) in Apr 2017", "Interview Descriptions": "I applied online. they called after 3 months.. phone call, then panel interview. when they like you, the HR personnel will call you for the job offer and ask you to have your orientation. then, they required you to have all the vaccinations required as it's mandatory in healthcare company.", "Interview Questions": "Why do you want to work at Ohiohealth?"}, {"date": "13 Jan 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH) in Apr 2017", "Interview Descriptions": "interview with two assistant managers. Both were very nice. Simple questions related to my experience, who I am , and what I like to do. Overall it was very basic. I think got a unit tour.", "Interview Questions": "tell me about your experience\r\nfavorite hobbies\r\n"}, {"date": "20 Mar 2017", "title": "Patient Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at OhioHealth (Columbus, OH) in Mar 2017", "Interview Descriptions": "I went in and I met with the nurse manager. She was super nice. I was interviewing for the ICU cardiovascular unit. She asked me a few question. She brought in a PSA who discussed what the daily routine of a PSA was and what it was like. And also gave me the opportunity to ask any questions I had. Finally she showed me around the unit and if I had any questions too. She showed me to the elevators and said the HR person would be in contact with me in a few days.", "Interview Questions": "What's a strength"}, {"date": "20 Sept 2017", "title": "Senior Financial Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH) in Mar 2017", "Interview Descriptions": "Interview process was absolutely unprofessional - Had a phone screen which was non technical followed by on site where no agenda was given. Interviewers were extremely rude - Found ratio of M:F extremely skewed at the OhioHealth workplace", "Interview Questions": "Experience based, situational based and basic Finance"}], [{"date": "15 Feb 2017", "title": "Pharmacy Technician Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH)", "Interview Descriptions": "The interview process consists with the following:\r\n- First, is an Initial Phone Interview. It consisted on Behavioral interview questions.\r\n- Next, is an Onsite Interview. The hiring managers will schedule a date for you to come in.\r\n- Last, the people that interview you will determine the best fit for you.", "Interview Questions": "Q: Give me a situation where you made a mistake at an internship or work experience. How did you handle it?"}, {"date": "1 Mar 2018", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OhioHealth (Columbus, OH) in Jan 2017", "Interview Descriptions": "You will get a call after you apply by the recruiter. That process isnt always the best because they are unclear on the department needs/wants. Its a very slow process Even after you apply you are lucky to get a call within a week or two.", "Interview Questions": "What is your ideal culture? What are your values? What makes you interested in this role for a nonprofit?"}, {"date": "19 Jan 2020", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH) in Dec 2016", "Interview Descriptions": "They reviewed what I had learned in my clinicals, how I would handle patient situtions and with their families.  The HR woman was very kind though straight forward. They had a few positions open in the areas I wanted, she she asked me what my preference would be.", "Interview Questions": "What would you do if you provided the best care you knew to for a patient, yet their family complained you weren't doing enough?"}, {"date": "9 Jan 2017", "title": "Surgical Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OhioHealth (Columbus, OH) in Nov 2016", "Interview Descriptions": "Quickly contacted by HR to set up a phone interview and then schedule  an interview; and the entire follow up took a week before an offer was extended.  Easy and available for contact and questions", "Interview Questions": "How do you handle difficult people"}, {"date": "5 Jul 2016", "title": "Physician Office Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at OhioHealth", "Interview Descriptions": "Typical interview fairly short about 30 minutes.The supervisor at the time asked slot of questions and kept asking me to explain further. I'm not sure why however after the interview she felt that I would be a great candidate.", "Interview Questions": "why did you apply for position, what experience do you bring for me to hire you?"}, {"date": "4 Aug 2016", "title": "Pharmacy Technician CPhT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OhioHealth (Columbus, OH) in Jul 2016", "Interview Descriptions": "Arrived 15min early and sat in the waiting area and got to know the receptionisy after awhile I was brough back to a room where I was Interviewed with a team of higher ups and other pharmacy memebers, they individually introduced theirselves and asked me questions one by one afterwards I got a tour of the facility and then told that I would hear back with them by tuesday it was friday for my interview.", "Interview Questions": "How will we know when you are stressed out?"}, {"date": "20 Jun 2016", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at OhioHealth (Columbus, OH) in Jun 2016", "Interview Descriptions": "Asked me about my clinical experience and the ideal type of patient I want to work with. Afterwords, the interviewee gave me information on how acute care rehab generally works and took me on a tour of the hospital. Overall, a pretty relaxed interview with lots of room for questions.", "Interview Questions": "Tell me an ideal patient you would like to work with."}, {"date": "10 Apr 2016", "title": "Mental Health Clinician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at OhioHealth in Apr 2016", "Interview Descriptions": "I never connected with tbe interviewer. Literally. Due to difficulty finding parking, no valet available to assist, and then being unable to find the security depart ment for escort to the interview... the interview never happened.", "Interview Questions": "Where are you?"}, {"date": "12 Jan 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH) in Jan 2016", "Interview Descriptions": "Applied on line and three days later the hiring manager called for a interview. I went the next day and the next week I followed up with the manager and she said she had checked my references and HR would get in contact with me.", "Interview Questions": "Did I have my BSN and was I willing to get it"}], [{"date": "21 Dec 2015", "title": "Commercialization Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at OhioHealth (Columbus, OH) in Dec 2015", "Interview Descriptions": "The interview process began with a 45 minute initial phone screening. My resume had been forwarded from an exiting employee. The phone screening involved questions about my background and explaining my graduate degree. Some common interview questions like \"What are your strengths and weaknesses\" were asked. I then had to complete the official job application through the website. The next step involved meeting with more of the team at OhioHealth's Columbus location. It started with a 30 minute interview with a physician, 30 minutes with HR, 1 hour with the director of the office, and 45 minutes with the immediate supervisor for the position. Everyone was very cordial and respectful, and the values espoused by OhioHealth were embodied by the interviewers. Only the director asked specific questions about why I wanted to work at OhioHealth, but the interview was also much of him explaining the nature of the office and other facets of commercialization in the hospital system. At the end of the interviews, I was told that I was in competition with one other individual and that a decision would be reached within a week. Finally, the representative from HR called me to let me know that I did not get the offer, which is different from the norm but also much appreciated.", "Interview Questions": "Where do you see yourself in 5 to 10 years?"}, {"date": "15 Nov 2017", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OhioHealth (Columbus, OH) in Nov 2015", "Interview Descriptions": "Pretty simple, interviewed by the three supervisors at the same time and asked generic \"what would you do\" \"how would you handle this situation\" type questions. They seemed more interested in how you handle the job rather than particular knowledge of tests.", "Interview Questions": "Tell us a time you handled a disagreement with a coworker"}, {"date": "22 Feb 2016", "title": "Marketing Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OhioHealth (Columbus, OH) in Nov 2015", "Interview Descriptions": "I had a phone screening interview with an HR Representative first which was a very basic and short conversation about my background.  I had a second interview onsite with the Marketing department and spoke with a Senior Specialist and the Manager.  It lasted about an hour and a half to talk to both people.  It was relatively casual and I felt very comfortable during the interview.", "Interview Questions": "They asked how I would deal with many tasks at once and basically how I would go about organizing myself in a situation where I had many things to get done all at once."}, {"date": "20 May 2016", "title": "Patient Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at OhioHealth (Columbus, OH) in Sept 2015", "Interview Descriptions": "Quick easy and very welcoming. The interviewers were knowledgeable and very informative. Friendly. I was interviewed by two nurses that were managers on the floor that I work at. They asked me 3-4 questions and then basically let me know I was hired on the spot. They gave me a lot of information on what they did on the floor and what they specialize in and information on what was to be expected of me on the job. I left the interview feeling confident and well informed.", "Interview Questions": "Why do you want to be a patient support assistant?"}, {"date": "5 Nov 2015", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at OhioHealth in Aug 2015", "Interview Descriptions": "This was a telephone interview/initial screening with a panel of managers from the department. They told me about the position, the interview process and asked me a series of questions to assess my knowledge and skills. The interview lasted approximately one hour.", "Interview Questions": "What are your weaknesses? Your strengths? Describe your experience in healthcare. "}, {"date": "2 Aug 2017", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at OhioHealth (Columbus, OH) in Aug 2015", "Interview Descriptions": "Was pretty standard interview process met management and they asked about me and my life, as well as some standard interview questions. Got to meet everyone and learn more about the job, as well as the leadership sharing some of their background.", "Interview Questions": "What are some of your weaknesses?"}, {"date": "10 Jul 2015", "title": "Technical Lab Assistant (Phlebotomist) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at OhioHealth (Columbus, OH) in May 2015", "Interview Descriptions": "I received a call the day after submitting multiple applications online. I met with the recruiter a few days later. The meeting with the recruiter was very laid back. I don't remember any specific questions asked, as the meeting was mostly her going over benefits, base pay, hours, etc. Immediately after, she took me to the site manager's office, which is located in the hospital, across the street from the HR building. The site manager was very nice and easy-going. I could tell she was getting a good grip of my personality just through casual conversation. She asked simple, straightforward questions that you usually get in job interviews (why do you want to do this, where do you see yourself going, etc). After that, she took me to the phlebotomy room, where I met several coworkers and chatted for a while before heading home. A few hours later, the recruiter called me back and offered me the job, citing positive reviews from the site manager.", "Interview Questions": "Why do you want to work in phlebotomy? "}, {"date": "5 Mar 2015", "title": "Volunteer/Grady Memorial Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OhioHealth (Delaware, OH)", "Interview Descriptions": "Only talked with a coordinator once- no follow through!? I reviewed a similar review of the same nature. I am over-qualified if anything. Appears that there is no director or manager and inquiries may be falling through the cracks.", "Interview Questions": "How did you hear about is?"}, {"date": "2 Apr 2019", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH) in Mar 2015", "Interview Descriptions": "normal process- HR will contact you, ask a boring battery of PM questions, then hiring manager will interview you. Then you have a chance to review your background, your interests, and what value you are able to bring to the organization.", "Interview Questions": "why do you choose ohiohealth?"}, {"date": "13 Jun 2015", "title": "Medical Transcriptionist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at OhioHealth (Marion, OH) in Mar 2015", "Interview Descriptions": "First, I was interviewed by a professional and personable woman who works in the H.R. Department at Marion General Hospital.  She went over the paperwork and explained all of the benefits in a very concise manner.  She handed me a folder with all the information we had just gone over, and advised me that I would need to fill out the paperwork and keep it handy in the case that I was chosen for that position.  Next, she made me aware that the supervisor who would be hiring for this position, would be interviewing me in another room.  The supervisor is from Columbus and travels to various OhioHealth facilities for the interviews.  When brought to another room to interview with the supervisor (Melanie), the difference between the two ladies was night and day.  I was surprised someone in this position was incredibly unprofessional.  She sporadically went between looking around the room and rolling her eyes while talking, to talking to my breasts.  I have never been more uncomfortable during an interview.  She said she would be in touch with me by the end of the week.  It has been almost three months and I have heard absolutely nothing; no letter, no e-mail, and no phone call.  There was no test of any kind.", "Interview Questions": "Other than the usual questions concerning hours, etc., I was also asked how I would feel about assisting with laboratory duties and working with slides, as the medical transcription position was based in the lab, transcribing stat reports of various intraoperative findings."}], [{"date": "11 Apr 2016", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OhioHealth (Columbus, OH) in Feb 2015", "Interview Descriptions": "Interviewed with hiring manager and one other hiring manager. Very comfortable interview with open and honest answers and questions for my resume. Was emailed by hiring manager a set of questions I was supposed to answer before the interview. Heard back one week later that I got the job.", "Interview Questions": "What do you like to do for fun?"}, {"date": "31 Aug 2017", "title": "MRI Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH) in Feb 2015", "Interview Descriptions": "Basic interview with the standard questions. Initial phone interview with basic questions about my background. Follow up interview in person about a week later. Interview went well, I was offered a job about a week later.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "12 Oct 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OhioHealth (Columbus, OH) in Feb 2015", "Interview Descriptions": "I felt very comfortable and that the manager actually cares about what I had to say. They did not seem put off by having to do the interviewing process and were very interested in my experience as it realted to healthcare", "Interview Questions": "Where do you see yourself in 5 years?  How to you think we as a company could help you achieve that?"}, {"date": "17 Nov 2015", "title": "Medical Transcriptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth in Jan 2015", "Interview Descriptions": "Group interview, HR interview.  Took 2 weeks to get hired.  Overall, interview process was easy.  Very confident after interview.  Manager made me feel very comfortable.", "Interview Questions": "Tell me about yourself."}, {"date": "8 Sept 2014", "title": "Staff RN Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at OhioHealth", "Interview Descriptions": "After applying through the company website I was interviewed by my direct supervisor and peers. I was then interviewed by HR where I discussed compensation and benefits. The HR representative was a little unprepared and seemed inexperienced but the overall experience was good.  It has been a great experience so far.", "Interview Questions": "What was the most stressful situation you have ever been in and how did you respond?"}, {"date": "5 Apr 2018", "title": "Applications Systems Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at OhioHealth (Columbus, OH) in Aug 2014", "Interview Descriptions": "I had a phone screening, an in-person HR screening, a phone interview with the hiring manager, an in-person interview with the hiring manager and the team.  The process was a little slow, but the people were friendly along the way.", "Interview Questions": "Why do you want to work at OhioHealth?"}, {"date": "28 Aug 2015", "title": "IS Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at OhioHealth (Columbus, OH) in Jul 2014", "Interview Descriptions": "Multiple employees/managers ask technical/help desk/customer service questions and then give you a broken computer to fix. Immediately after they consult with each other and assess your performance and determine whether or not to hire you/short list you.", "Interview Questions": "What is DHCP?"}, {"date": "3 Jun 2014", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at OhioHealth", "Interview Descriptions": "I had an odd couple of interviews which seemed disjointed and confusing.  I was heavily pursued, they wanted to talk to me immediately. However, after phone interview number 5, I never heard back.  I tried asking the HR person what happened but NEVER heard back.", "Interview Questions": "What is your philosophy?"}, {"date": "13 Sept 2016", "title": "Recruitment Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at OhioHealth (Columbus, OH) in Jun 2014", "Interview Descriptions": "I first did a phone screen then a one on one interview, then a panel interview \r\nThe phone screen discussed why I was looking the one on one discussed the skills and my background and the panel interview was more personality based and why I was looking to join the team", "Interview Questions": "Why do you want to work for Ohio Health"}, {"date": "16 Jul 2017", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at OhioHealth (Columbus, OH) in Jun 2014", "Interview Descriptions": "First round was to interview with the managers; second round was with the director and VP; last round was with the team members. A lot of soft skill questions and conversation .", "Interview Questions": "Tell me about one thing that you've failed "}], [{"date": "20 Jun 2014", "title": "OFFICE SPECIALIST Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at OhioHealth (Grove City, OH) in May 2014", "Interview Descriptions": "The interview process was relaxed and fun. I had two interviews, one at the Grove City location and one at the location off Henderson Rd. Those I met with were full of laughs and kept me feeling calm throughout the interview. The hiring process was easy. Once I was accepted for the position, an HR representative called to let me know and explained how my pay will work. They communicated with my old manager (I was a transfer) directly and they decided on a start date for me. The only bump in the road we had: I was told to listen for a call from my new manager and never received one so I called her around 6 days before my projected start date. She had emailed me at a company email I did not have access to and I did not receive the information needed. Fortunately she was quick to explain it to me and told me she would print the documents off and have them ready for me when I got started so I had nothing to worry about.", "Interview Questions": "\"Please explain to me how to make an omelette.\""}, {"date": "28 Jul 2015", "title": "Medical Records Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at OhioHealth (Dublin, OH) in May 2014", "Interview Descriptions": "The first interview was with a person from Human Resources.  She just asked pretty basic questions about work ethic and what I would do in certain situations.  You could tell she was trying to see if I was reliable in a job that must have had a lot of turnover.  The second interview was with the Supervisor of Medical Records and it was over my past experience and how it applies to the job I was applying for.", "Interview Questions": "Describe a situation where you had to change your plans?"}, {"date": "15 Jul 2015", "title": "Site Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at OhioHealth (Columbus, OH) in Feb 2014", "Interview Descriptions": "Met multiple people in short period of time,nquestions were basically the same.  Questions about loyalty, whether I could work for difficult people, willingness to place job above all other elements of my life.", "Interview Questions": "How long I would stay if hired which I found odd"}, {"date": "25 Sept 2015", "title": "Patient Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at OhioHealth (Columbus, OH) in Jan 2014", "Interview Descriptions": "It was quick and painless. They needed people who were competent and willing to get their hands dirty. I specifically applied to the Neuro Critical Care unit -- a difficult unit but I like neuroscience so I was interested and it was pertaining to the field I wanted to pursue (a neuro-medical related path) so I went for it.  It may be drastically different if one was to apply to a different unit.", "Interview Questions": "When can you start?"}, {"date": "27 Aug 2014", "title": "Volunteer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at OhioHealth (Dublin, OH) in Jan 2014", "Interview Descriptions": "I tried to connect with a few of the hospitals to learn about the application process, opportunities, etc. I selected to volunteer at the hospital in Dublin or Delaware due to driving distance, but these two locations ended up not working out. After numerous calls/emails, I was surprised at what I learned from the people I would reach and the lack of follow through and disorganization. \r\nIt appears as though applicants aren't valued, so when I was told from those I spoke with how there was low volunteer morale at both places, I wasn't surprised. It was communicated to me that there was not a manager of volunteer services in place and that this was causing volunteer turnover, and other negative consequences for applicants, current volunteers and staff. One person said everyone was running around with their heads cut off because of lack of direction, supervision and lack of recognition. I never did get an interview face to face. If I would have, I was told there would be a lack of appropriately assessing my skills, because there wasn't the right person in place to do so", "Interview Questions": "How did I hear about the volunteer opportunities"}, {"date": "27 May 2015", "title": "Patient Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OhioHealth (Columbus, OH) in Dec 2013", "Interview Descriptions": "First interview will be with HR and they will ask you general questions then before you leave will do background check. If called for second interview you will meet the manager of the unit you applied for and get a tour of the unit and the manager will also interview you. If you get a third call you will get offered a position", "Interview Questions": "Why do you want this job?"}, {"date": "22 Aug 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at OhioHealth", "Interview Descriptions": "Went through a recruiter. The first step was a telephone interview. It lasted 45 minutes. There was a lot of emphasis place on the core values and balance scorecard. The situational question were straight forward regarding  leadership styles. On site interview was scheduled three weeks later due to vacations and holidays. On site interview was 1:1 with physicians and upper Management. Panel interview were given with all other associates as a group based on job function. On site interview was 1.5 days.", "Interview Questions": "N/A"}, {"date": "5 Mar 2015", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at OhioHealth (Columbus, OH) in Jun 2013", "Interview Descriptions": "Phone interview and then panel interview. Everyone was pleasant and professional. Interviewed with Director and two managers and they made me feel very comfortable. The process overall went very smoothly and quickly.", "Interview Questions": "Standard"}, {"date": "21 Jan 2014", "title": "Aide Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at OhioHealth (Columbus, OH) in May 2013", "Interview Descriptions": "I had two interviews.  The first one was great and made me feel very comfortable.  The questions were pretty standard and easy to answer.  The second interview was uncomfortable.  I could tell she kind of had an attitude and would not make a good manager.  It was very disorganized.  For the interview she pulled out a blank piece of computer paper, asked me maybe 5 questions, and wrote down my answers.  The whole time I could tell she was struggling to think of questions to ask me.", "Interview Questions": "The questions were pretty standard and I didn't really have a problem answering them.  "}, {"date": "10 Jun 2013", "title": "CNP Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at OhioHealth (Columbus, OH) in May 2013", "Interview Descriptions": "HR interview process was quick and easy- no terribly difficult questions; quote on salary was verbally provided to me during interview; fingerprints obtained immediately following interview with HR.  HR called both professional references I provided to them within a day following my interview.  Following HR interview, an appointment was scheduled with employee health to have urine drug screen completed.  At this appointment, If the employee does not have proof of immunizations/titers, then those would also be obtained on that date as well.  My picture for ID badge was taken following my appoinment with employee health.\r\n\r\nFollowing employee health appointment (on a separate date), there is an off-site hospital wide employee orientation meeting, which lasts all day.  Benefits, expectations for employee conduct, etc. are explained on this date.  Introduction to the hospital's computer system also takes place during orientation.   A fully catered free lunch is provided to all employees, as well as a continental breakfast the morning of the orientation.  At lunch, some vendors such as MetLife, Nationwide, etc. are set up to provide employees with options for supplemental benefits, if they so wish to oblige.  The employee receives his/her ID badge during orientation.\r\n\r\nOhio Health truly seems to have very dedicated, loyal employees who truly value their positions and the organization they represent.", "Interview Questions": "I had no difficulties with the interview/hiring process.  "}], [{"date": "29 Mar 2015", "title": "Psychiatric Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at OhioHealth in May 2013", "Interview Descriptions": "Two interviews, one with HR then a panel interview with the three managers. Mostly situational questions relating to mental health. Even though I was hired, it was still almost 6 weeks before I was actually done with the hospital bloodwork/processing etc. The key is to keep calling HR reps, as they have TONS of people they work with. Your managers will push you along if you're a strong applicant, but overall the HR holds up the process quite a bit.", "Interview Questions": "What would you do if a patient was screaming?\r\nAre you ok with doing medical work such as incontinence care?"}, {"date": "21 Jan 2013", "title": "Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at OhioHealth", "Interview Descriptions": "I spoke with the hiring manager over the phone to set up the in person interview. The first round of interviews was with her and one other person in the dept. My second round included a 3 hour session with numerous potential colleagues. They were all very welcoming and our conversation was casual. They were interested in portfolio samples and many questions revolved around my healthcare experience.", "Interview Questions": "N/A"}, {"date": "31 May 2016", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OhioHealth in Oct 2012", "Interview Descriptions": "Getting the initial interview with HR was the most difficult part. After the initial HR interview I then had one interview with the department manager. Very casual interview. Tour of the department. They prefer candidates that are flexible and reliable. Some co workers have said they were gird for one shift and then told they would be working a completely different shift once hired. This was not the case with me but it has happened.", "Interview Questions": "Name a weakness?"}, {"date": "2 Apr 2015", "title": "Information Services Technical Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at OhioHealth (Columbus, OH) in Aug 2012", "Interview Descriptions": "Met with the manager and team, then with the director. Pretty straightforward personality questions and competency questions pretty basic stuff. Then interviewed by HR to talk about my background. This gives them a number for the offer.", "Interview Questions": "They asked about my experience that made me a good candidate, and qualified me to do the job."}, {"date": "15 Apr 2012", "title": "Human Resources Training Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at OhioHealth (Columbus, OH) in Apr 2012", "Interview Descriptions": "Online resume and cover letter submission followed by a phone screening interview. This was followed by a second screening interview, followed by a submission of credentials ( college transcripts and any other awards or certifications relevant to the job) after review, I had a 1 on 1 interview with the H.R. director who explained the responsibilities of the H.R. trainer and what was necessary to progress further in the application process.", "Interview Questions": "N/A"}, {"date": "14 Aug 2012", "title": "OFFICE SPECIALIST Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at OhioHealth (Columbus, OH) in Jul 2011", "Interview Descriptions": "I had an interview with you six people at once. It was uncomfortable at first, but they helped me relax. Then it was great.", "Interview Questions": "Where do you see yourself in five years. I hate that open-ended question. "}, {"date": "28 Oct 2015", "title": "HIM Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at OhioHealth (Columbus, OH) in May 2011", "Interview Descriptions": "HR brings you in to do a first round employment screening.  It helps to have someone pass your resume on to a recruiter due to the shear volume of applications they receive.  Thousands apply and never hear anything back.  Make the recruiter's life easy and get in touch with them.  20,000+ employees its understandable you should get a referral before you submit an application.\r\n\r\nAfter you meet with HR for a brief interview and paperwork to get you in the system, the next round will be with the Hiring Manager of the department you are applying for.", "Interview Questions": "Questions about personality and prior experience."}, {"date": "7 Feb 2011", "title": "Senior Technical Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at OhioHealth (Columbus, OH) in Dec 2010", "Interview Descriptions": "Received a phone call to setup face to face interview for later in the week.  I met with a panel of department personnel and was asked questions about past work history and technical knowledge for about 90 minutes.  The interviewers were professional and easy to converse with.  No follow up interview was granted.", "Interview Questions": "There were questions using acronyms that I was unfamiliar with."}, {"date": "27 May 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at OhioHealth in May 2010", "Interview Descriptions": "I started working here in 2010. I came on board as an intern, and was notified of a position opening in another department. Applied, interviewed with member of Senior Leadership team as well as managers of certain departments. Received job offer within 1 day. Pretty simple process. Once hired, I went through a physical and drug screen before beginning officially.", "Interview Questions": "There weren't any particularly difficult or unexpected questions. The interview for my position was very quick and straightforward."}, {"date": "6 Aug 2013", "title": "Human Resource Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at OhioHealth (Columbus, OH) in Mar 2009", "Interview Descriptions": "3 interviews, 2 of those were done in the group interview format. Applied online, got called in 3 weeks so do not give up.  Interviews were about a week apart. All nice people, they do ask situation based questions.", "Interview Questions": "They asked me to explain what I would do if an associate claimed that I acted in an unethical manner by playing favoritism. "}]]