[[{"date": "27 Feb 2023", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Tower Health", "Interview Descriptions": "The interview was easy. I met with HR first and talked about benefits package. Then, I was taken to the department and interviewed with the direct supervisor. I received a job offer within a few weeks.", "Interview Questions": "The interview question were basic: Strengths , weaknesses, have I used EPIC before…"}, {"date": "25 Mar 2023", "title": "Medical Assistant III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Tower Health (Wyomissing, PA) in Feb 2023", "Interview Descriptions": "I received an email on Tuesday to set up phone interview for Thursday. 2nd interview scheduled Monday on-site with Manager and RN. Friday I received a call with an offer which I accepted. Overall my interview process was great.", "Interview Questions": "Tell about yourself? What are your strengths and weakness? Tell me about a time you had a difficult patient and how you handled it? Why should we hire you?"}, {"date": "12 Nov 2021", "title": "PSR Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Tower Health (Phila, PA) in Nov 2021", "Interview Descriptions": "Great interview! Very professional environment . Nice office. Courtesy staff . Easy directions to follow to building . Great location. Quiet atmosphere. Seems to be a good place to work.", "Interview Questions": "Background  in job applying for ?"}, {"date": "6 Oct 2021", "title": "Access Center Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Tower Health (New York, NY) in Aug 2021", "Interview Descriptions": "application submitted in Aug, by beginning of October no communication received. HR recruiter not very responsive and seems to not remember phone conversations where it was suggested for this to be applied to based on experience. Recruiter then replied to a follow up email afterwards that maybe \"not a good fit as it was a call center\". Clearly resume details where not reviewed for experience. HR recruiter suggested another phone conversation. Provided date and time, to date that email still has yet to be responded too.", "Interview Questions": "previous job duties and relatability to role applying."}, {"date": "14 May 2021", "title": "Business Systems Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Tower Health", "Interview Descriptions": "It was a pleasant interview with great questions and insight to the company.  Typical behavioral based questions that make use of the STAR method.   Made use of multiple examples to navigate my way through the questions.", "Interview Questions": "Why was this job of interest to you."}, {"date": "10 Jul 2022", "title": "VP Application Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Tower Health in Sept 2020", "Interview Descriptions": "Only by phone, positive HR screen and call with Hiring Manager.  Wanted me to consider a lower position- both than the one I had been recruited for and what I was currently in.", "Interview Questions": "Typical questions nothing out of left field "}, {"date": "1 Jul 2020", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Tower Health", "Interview Descriptions": "Interviewed with potential team members and direct reports and was very positive and upbeat.  Interviewed then with the VP that I would be reporting to who kept me waiting a long time and seemed very disinterested in me from the moment we sat down.  From there I was to meet with her boss - she left and came back a few minutes later and said he was too busy to meet with me.  When I suggested I reschedule, she told me that was fine she'd be in touch if he was interested. While the job seemed like something I'd be good at and the team seemed great, I would have had a hard time reporting to her.", "Interview Questions": "Did I remember meeting her (the VP) many years ago?"}, {"date": "22 May 2020", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Tower Health (Pottstown, PA) in May 2020", "Interview Descriptions": "I was briefly screened by HR with a 10 minute phone call. Was told that I would be contacted the following week if the hiring manager was interested in interviewing me. Within four hours, I was contacted and an interview was scheduled for the following week. Interview was video and lasted 23 minutes, untraditional in the fact that she had me asking more questions than initially and limited her questions. I wonder if Reading Hospital and Pottstown Hospital shared information about my background because she seemed to know more about me. I was contacted within 48 hours with a job offer- asked for the job offer in writing and accepted the job offer within 4 hours.", "Interview Questions": "Tell me about yourself"}, {"date": "4 Jun 2021", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Tower Health (Jennersville, PA) in Sept 2019", "Interview Descriptions": "I interviewed with the Corporate Director of Marketing in Reading and then had a full day of interviews at Jennersville Hospital with all of the direct reports to the Hospital Director.  I was told I would hear something soon and was basically ghosted for six weeks until I reached out to the Corporate Director to ask what was going on.", "Interview Questions": "Why do you want this job?"}, {"date": "17 Dec 2018", "title": "Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Tower Health", "Interview Descriptions": "For an organization this size, the interview process was amateur.   The Recruiter lacked the ability to appropriately handle an out-of-town candidate for an onsite interview.   During the interview, departments aired their dirty laundry and disdain for current reporting structure.   It is no wonder this position has been open for over a year.", "Interview Questions": "Questions were focused on seeing whose side would you  be on  - theirs or the 'other side.'"}], []]