[[{"date": "5 Jul 2023", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Save the Children International (London, England)", "Interview Descriptions": "Nice interviewees, very understanding of external circumstances which made me delay the interview. Swift invitation to interview after application and swift follow up. There was a delay in getting back with the final decision but they made sure to keep emailing me to keep me engaged- made me feel valued", "Interview Questions": "Why do uou want to this role"}, {"date": "16 Dec 2022", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Save the Children International (London, England)", "Interview Descriptions": "General analyst questions. Knowledge around processes and problem solving as well as knowledge of what an analyst does generally. General analyst questions. Knowledge around processes and problem solving as well as knowledge of what an analyst does generally.", "Interview Questions": "What is Business analysis and what are requirement gathering techniques used."}, {"date": "13 Dec 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Save the Children International (London, England)", "Interview Descriptions": "Fairly simple interview process with 3 people including HR, Line manager/head of function and another senior staff. Provided opportunity to highlight experience and questions touched all key points from the job description.", "Interview Questions": "Describe key challenges you think you will encounter in this role and how would you address them?"}, {"date": "12 Mar 2023", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Save the Children International in Dec 2022", "Interview Descriptions": "Clear and efficient HR process. HR reached out and responded in a very timely manner. I was asked to give a brief overview of my experience and the interviewer provided an overview of the role. Save sent over a package outlining all consultancy expectations which was very clear. The interview was in line with role expectations.", "Interview Questions": "Straight forward questions about experience and role."}, {"date": "14 Oct 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children International", "Interview Descriptions": "It was very relaxed - The staff are friendly and it feels more like a conversation. The interview was online, reducing additional stresses (eg commuting, waiting with other applicants and etc).", "Interview Questions": "About past experience in similar roles"}, {"date": "16 Aug 2022", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Save the Children International", "Interview Descriptions": "Fast turn around from the point of HR / LinkedIn contact ..Two person interview for one hour. Good interaction and questions. Friendly. Job offered within a week as someone was leaving the post.", "Interview Questions": "About role, experience, good fit "}, {"date": "14 Sept 2022", "title": "PMO Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children International in Aug 2022", "Interview Descriptions": "15 mins interview with HR, and 2 interview with PMO leads and managers. The interview with the HR team was basically a 10 min chat, asked me why I as interested in the role and in the company, and the \"tell me about you\". \r\nThe 2 interview was 1 hour long, standard project questions. One of the manager on the call was clearly in a bad mood, did not even tried to be welcoming nor polite with me, kept looking away and was very disinterested in all my answers.   They said they would inform me of the outcome by the end of the week.. still waiting a month later. Overall, very unprofessional/unpleasant experience.", "Interview Questions": "Why do you want this job? \r\nTell us about skills and experience that would make you a good fit\r\nWhat are the most critical issues you have experienced on a project and how you solved them \r\nHow do you work with difficult people \r\n"}, {"date": "8 Jul 2022", "title": "Deputy Country Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children International", "Interview Descriptions": "Stretching. Evidence based interview. Two reviewers. Questions relatively standard, with usual warm up questions and a range of technical and general competency questions.  Nothing very unexpected. No written test but presentation to prepare.", "Interview Questions": "An evidence based question in child safeguarding. "}, {"date": "9 Jan 2022", "title": "PDQ Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Save the Children International", "Interview Descriptions": "Don’t bother applying for this role if you’re an external candidate. I’ve applied for this role 4 times in 4 different countries. I always managed to get to one of the top two candidates after several interview rounds only to find out they have internal candidates often white young women who were less experienced and qualified than me. I don’t bother with applying for this role anymore.", "Interview Questions": "Mel experience \r\nProposal writing experience \r\nFundraising experience"}, {"date": "12 Jan 2022", "title": "Global External Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children International in Dec 2021", "Interview Descriptions": "Initial 45 min interview with two senior staff, then an assignment with two tasks, then a final panel interview of an hour with two team members.  The interview process went relatively quickly and was pleasant, but after being told I would hear by the end of the week, a period of 3 weeks elapsed. I chased twice and finally got a template rejection email from an HR rep I had not been in touch with. When asking for feedback, I received no response. I followed up with the interviewers to enquire about feedback, also no response.", "Interview Questions": "-\tHow to engage/attract corporate partners\n-\tHow to work with influencers\n-\tHow to use data to persuade different teams\n-\tHow data informs my campaigning decisions\n-\tSomething surprising about me"}], [{"date": "15 May 2022", "title": "Campaign Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children International (London, England) in Nov 2021", "Interview Descriptions": "I was invited to interview with 36 hours notice. I met with one person who was based in West Africa and another in London. They ran through a list of questions and weren't very personable at all (I think often people forget how they come across over video).  Questions were on the scale of easy to difficult but it was very much question and answer with no engagement. They left time for my questions to them. One of them looked annoyed I had questions. Interview ran for an hour. I was told I'd hear back within the week. There was no follow up at all even to tell me I hadn't made it through the next stage.", "Interview Questions": "What's an example of a campaign that you've seen recently and liked?"}, {"date": "22 Jun 2021", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children International", "Interview Descriptions": "It was a standard competency based interview for the role with three panelists over Teams. It lasted over an hour with 8 competency questions. I did not receive a response from HR on the outcome of the interview which is usually appreciated!", "Interview Questions": "Tell us about a time you managed different priorities and stakeholders?"}, {"date": "5 Oct 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children International in Mar 2021", "Interview Descriptions": "Two rounds of competency and values based questions, held over Teams which did not detract from the experience. Panel were engaged and I felt encouraged to speak openly but at the same time questions were suitably challenging", "Interview Questions": "Why do you think you are suitable for this role?"}, {"date": "29 Jan 2021", "title": "Junior Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children International (London, England) in Jan 2021", "Interview Descriptions": "The initial interview with the potential line manager and a team member was great- ladies were welcoming, friendly, non-judgemental and professional.\r\n\r\nThe second stage interview was strange and negative. I felt arrogant and judgemental vibes from the senior management, but the most important is that questions were not really related to the JUNIOR PM role and were not in the scope of what JUNIOR Project Manager should be responsible for and be able deliver. \r\n\r\nI have a feeling that the word \"junior\" was added only because they were not ready to pay a decent PM salary but were looking to hire a senior PM for senior PM responsibilities.\r\nI would advice the company to review the job specs and job titles in order to manage their expectations. \r\n\r\nThere will be always somebody \"senior\" to accept a \"junior\" role/salary but is it fair?", "Interview Questions": "How do you manage a project risk?"}, {"date": "9 Jan 2023", "title": "Accountant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children International (London, England) in Jan 2020", "Interview Descriptions": "It was a straight forward interview process. Questions were based on the previous work experience and on the skills set. The job was explained in more detail to understand the role properly.", "Interview Questions": "Tell us about your experience"}, {"date": "30 Sept 2019", "title": "Human Resources Data and Reporting Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children International (London, England) in Sept 2019", "Interview Descriptions": "The process included 2 rounds of interviews, it was very lengthy, over 2 weeks from application to first interview, then a further 2 weeks until second interview....and then absolutely nothing. 4 weeks after both interviews which seemingly went well....absolutely zero communication about the outcome of the final interview, despite sending a Thank you and a further follow up e-mail. \nI would advise not to waste your time with this organisation, it takes 5 minutes to phone 3 candidates to say, sorry you were unsuccessful...", "Interview Questions": "Generic interview questions, why do you want to work here, what are 3 strengths and one weakness etc... they even asked both these questions in both rounds of interview."}, {"date": "27 May 2020", "title": "Team Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Save the Children International (London, England) in Mar 2019", "Interview Descriptions": "I applied online and was invited for a face to face interview about a month later. The interview consisted of a written test which I had 30 minutes to complete and then competency and technical questions.", "Interview Questions": "Why do you want to work here?"}, {"date": "7 Feb 2019", "title": "Senior Role Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Save the Children International", "Interview Descriptions": "two interviews.  didn't feel ethnically varied - ie all white and wealthy. panel of three. unclear about job specification and at the interview were unclear as to what the job involved. felt like a complete waste of time", "Interview Questions": "about the structure of save the hcildren international"}, {"date": "16 Sept 2018", "title": "Project Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Save the Children International (London, England) in Jul 2018", "Interview Descriptions": "The interview was great. It was a panel of 3 people, one HR and a senior advisor and a director., the former two who were part of the team i was suppose to join, and one who I would be reporting to. They were very friendly and professional.  They asked questions about my cv, background and experience, motivations to apply and career goals. One or two question were challenging but  overall ok, what I had prepared for.", "Interview Questions": "How can you promote Save the Children code of conduct and child policy at work and on a daily basis ?"}, {"date": "24 Jun 2018", "title": "Senior Change & Communications Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Save the Children International (London, England) in May 2018", "Interview Descriptions": "Applied online. Contacted by HR after about a week. Due to my work travels, I asked them about the possibility of a Skype-interview. This was not possible for them at which point I declined further process. After about a month they contacted me again saying they could not find anyone for the role and wanted to do a video call with me which took place after another 2-3 weeks and with changes on their end. The interview was conducted by a team lead who read the questions off a sheet. Standard interview questions. No time for me to ask questions as she did not plan enough time (other people came into the interview room and asked her to leave...). Said they would get back within 1-2 days. After 3 weeks I received an automated system message informing me the job was no longer available. Contacted them and at which point they claimed the message being a technical error. In all a very immature and unprofessional process, and sadly, makes you feel that this is not an organization that should be receiving money as they do - the problem with all these pseudo professional organizations claiming to work for betterment.", "Interview Questions": "How will you ensure that sensitive information does not get into the wrong hands?"}], [{"date": "16 Feb 2018", "title": "IT Role In London HQ Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Save the Children International (London, England) in Jun 2017", "Interview Descriptions": "The whole process started off well - applied by submitting a CV and covering letter and got invited for interview pretty quickly.  Interview was conducted by two people and asked straightforward questions.\r\n\r\nAfterwards I had to chase for an outcome and was told that I was unsuccessful as they went with a more qualified candidate and had no other feedback for me.\r\n\r\nA few weeks later I got contacted again and got invited for a second interview.  Second interview was much the same as the first with a two person panel.\r\n\r\nThen came the really unprofessional part: I never heard from the Save The Children recruitment team again.  Complete radio silence.  I expected better from such a well known company.  What a waste of my time.  Am glad that I never ended up working there.", "Interview Questions": "What is your experience with children>"}, {"date": "15 May 2017", "title": "Project Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children International (London, England)", "Interview Descriptions": "Application process was an online form which included references, education and employment history and a personal statement that needed to match the job description.\r\nIt was relatively simple applying online and then I received an application to interview the following week so was speedy.", "Interview Questions": "What project management tools have you used in the past?"}, {"date": "4 Jun 2016", "title": "Nutrition Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Save the Children International (London, England) in May 2016", "Interview Descriptions": "I submitted an online application. A few days later, I received an email for a first interview. Before the interview, I received another email for a written test. After the first interview and before the written test, I received an email for a second interview. Overall the process was very smooth and surprisingly fast.", "Interview Questions": "What do you know about child safeguarding?"}, {"date": "11 Jun 2016", "title": "Accountability Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Save the Children International (London, England) in Feb 2016", "Interview Descriptions": "The process was very straightforward. I applied online on the company's website. I was sent an email saying that I was shortlisted for the interview and whether I would be available for a phone interview in the first instance. I said yes. Phone interview went well and they invited me for an interview in office where I faced a panel. Panel was a diverse mix. I received a response within 2.5 weeks about the results of the interview.", "Interview Questions": "Tell me about yourself. Process design. Systems i've worked with. team building. Evaluation processes."}, {"date": "1 Apr 2016", "title": "Interview In London HQ - Very Mixed Feelings Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Save the Children International (London, England) in Feb 2016", "Interview Descriptions": "The interview process was long and slow. I have completed 3 stages. People responsible for scheduling were not responsive and didn't keep in touch during the process. It felt a bit like organised chaos. Interview questions were relatively easy to answer. Good location in London but thats about it. Based on the interview process I wouldn't recommend this as a good place to work.", "Interview Questions": "what issues do I think I would come across on regular basis while working at Save the children?"}, {"date": "18 Dec 2014", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3+ months. I interviewed at Save the Children International", "Interview Descriptions": "This was done over the phone as the panel was spread out over multiple locations.  There were no surprises here, it seemed very informal / conversational.  It was not a highly formal, structured process as it is at other NGOs.", "Interview Questions": "N/A"}, {"date": "20 May 2015", "title": "Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Save the Children International (London, England) in Oct 2014", "Interview Descriptions": "I was interviewed by two team members.  The atmosphere was not intimidating, and most questions asked were fairly straight-forward on my background, why I thought I was suitable for the position, what I thought I would gain and contribute from the job as well as what I saw myself doing in the future.  The interview was followed by a written test - where I had to summarise a 4 page document into a paragraph and another where I had to describe the steps that needed to be taken in organising a conference.", "Interview Questions": "Describe a charity campaign that caught your attention, why was it effective or not."}, {"date": "20 Mar 2014", "title": "Senior Finance Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Save the Children International (London, England) in Feb 2014", "Interview Descriptions": "I applied directly. Interview went well, pleasant interviewer. Unfortunately, HR did not respond my emails requesting feedback. When a month later, I managed to speak with a HR Manager he still had no feedback, just 'you did not make it to the second stage'. What is even worse is that they said I would be best suited for a junior role, which is rather insulting. I doubt I will ever apply again to work for Save the Children.", "Interview Questions": "What are the challenges that finance face in an international charity?"}, {"date": "8 Oct 2015", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Save the Children International (London, England) in Jul 2013", "Interview Descriptions": "I was alerted to the role by an employee and encouraged to apply.  To start with I had to submit a CV together with a supporting statement outlining why I was interested in the role.  It was a normal two stage interview process.  The first stage interview was with panel of two (the line manager and HR) working from a pre-prepared question grid.  At the final interview stage I was interviewed by just one person a SMT member.", "Interview Questions": "What's your motivation for applying for this role"}]]