[[{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Extremely strong staff pool, floundering leadership and low morale", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "13 Jun 2023", "job_title": "Advocate", "duration": "N/A", "pros": "The staff are best in class - and the new hires are even better. Staff love the org, love their colleagues, and love the work. The vast majority are highly motivated to be on a path of constant improvement and collective decision-making and learning - the days of condescending know-it-alls are largely in the rear-view mirror (though a few remnants still linger). I've had excellent managers, made life-long friends, and have experienced great personal and professional growth because of my time with NRDC. The pay and benefits are well above market compared to similar non-profit orgs.", "cons": "Leadership - many of whom are relatively new to the organization - don't seem to have control over the cultural and financial issues the org is facing right now. There hasn't been time allowed to build trust with new leadership, and the few touchpoints have fostered an air of skepticism. The culture, once strong, has faltered post covid. I really feel bad for new staff who didn't get to experience the exuberance of the office culture of yesteryear. I don't think mandatory time back in the office will do any good (would likely just build resentment), but something needs to change. Morale is at an all time low, at least in the last six years I've been here."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Continue to nurture employees please!", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "11 May 2023", "job_title": "Advocate", "duration": "N/A", "pros": "I am a better person because of my time at NRDC. Great talent, nurturing team, impressive role models. The work NRDC does is critical and I will forever be grateful for the experience. The place is going through a challenging time, with new executives, and cycles of strategic planning. The culture has improved with new leadership specially the Chief HR Officer who is a breath of fresh air and equally compassionate and transparent (she is caring with strong candor - no b.s.! ). Unfortunately she has her work cut out for her with an HR team that doesn't seem to really care about people, too bureaucratic, lacks even the most basic DEI knowledge, and has had years and years of distrust built. The DEI team is being rebuilt with new expertise that I hope can make a real difference from many misses in the past.", "cons": "I had strong managers in my team that were empathetic and caring. I was lucky. But there is a lack of strong and skilled managers throughout NRDC. BIPOC community on all levels continue to struggle with being seen, heard, valued. Excacerbated by an awful HR team (other than the Chief HR Officer) who couldn't care less about people, lack of DEI support knowledge and practices across that continue to be harmful."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Let's not lose our focus", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "12 May 2023", "job_title": "Operations", "duration": "N/A", "pros": "I love fighting the good fight with true NRDCers. It truly feels like paying it forward to the next generation each day. Fair compensation, good benefits, and the current hybrid work arrangement is the best. The organization is invested in the employees' well-being, professional development, and building cultural identity.", "cons": "I have never known any other employer where leadership lets employees control the organization's directives. It is all about what's in it for me and not the success of our mission. This is not the way to be good stewards of our donor's money. The organization will lose many good-intended and accomplished professionals if they do not set up parameters to stop well-known individuals with hidden personal agendas from sabotaging our true mission. These individuals' social media does not match their true character. Based on previous comments, there is no surprise that the employee blames the HR Team since they are left to deal with all the issues that leadership decides to ignore by playing the political card. Organizational processes are not bad but could improve and provide more clarity. Too many meetings."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great people, great team, great mission--typical non-profit pluses and minuses", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "9 May 2023", "job_title": "Litigator in San Francisco, CA", "duration": "N/A", "pros": "I get to work with people who are caring, humble, feisty, smart, committed, and mutually supportive on issues that matter and with a lot of autonomy. I've worked in private, government, and other non-profit settings. This is hands-down the best.", "cons": "The organization is big enough that some internal processes be bureaucratic and slow. My fellow staff are mostly advocates, and they often turn those skills internally in ways that are sometimes helpful, sometimes not. There has been repeated, high-level leadership change in recent years (although it's a testament to the staff that they've stayed strong throughout, and leadership changes now seem behind us). Like a lot of organizations, this one is still learning and growing on its DEI journey; there's a lot of work to do, although its commitment to doing so feels genuine."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Meaningful work; great team", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "22 Apr 2023", "job_title": "Attorney", "duration": "N/A", "pros": "I love working here. My colleagues are brilliant and I'm constantly learning from them. They're down-to-earth and kind to one another, too, which you don't always find in mission-driven organizations; there's a real ethos of mutual support. People really make the effort to do right by one another. The work is meaningful, challenging, and energizing. Work-life balance is very good (especially compared to most legal jobs).", "cons": "We've been through several leadership changes over the past several years, and a new operating model is in the works; those changes have been hard on staff. But our new president, Manish Bapna, is excellent. So is our new head of Human Resources and the Office of Diversity, Equity, and Inclusion. We still have a considerable way to go on internal DEI, as do all US environmental organizations, but we're heading in the right direction, with HR and ODEI staffing up and really committing resources to do the work."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Extremely Toxic Work Environment", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Jun 2023", "job_title": "Finance in New York, NY", "duration": "N/A", "pros": "None, this place has fallen greatly", "cons": "Employees aren't valued. If you aren't one of the favorites, good luck. A particular Officer in the company has completely changed the culture for the worse. Most of the favorites (ones constantly promoted) aren't mission driven. DEI incentives are laughable at best. Good luck everyone"}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Wag the Dog", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "16 May 2023", "job_title": "Senior Attorney in Washington, DC", "duration": "N/A", "pros": "Noble mission, (above) market rate salaries, excellent benefits, a history of notable contributions to the environmental cause", "cons": "At NRDC, the tail now wags the dog. Weak leadership has let inside special interest groups take over, manipulating the leadership and the entire organization with fear based on accusations of inequity, which are at best greatly overblown. As an organization with a mission to defend the environment, NRDC’s work is inherently to help improve equity in our society, and especially for communities who are disproportionately negatively impacted by environmental issues. Unfortunately, too many within NRDC are driven by their own self-interest and greed and have seized on the recent external narrative in order to extract advantage for themselves. The bitterly ironic result is that the institution gives outsized attention, time and (donated) money to greatly misguided Diversity, Equity and Inclusion initiatives that distract from work that would otherwise be helping create greater equity in society. The current Chief People and DEI Officer has taken this to a new level of absurdity bringing in a long list of expensive ‘DEI consultants and experts’ including a new DEI Office Director with a public record of discrimination, misusing funds to give bonuses to anyone who starts a new 'affinity' group, sending a barrage of platitude-laced propaganda e-mails and putting on a steady show of meetings that seem to be designed to shame weak spined leaders into continuing this distraction staffers into jumping on the bandwagon. All this is pushing this once-proud institution further into decline and further from its mission."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Great Workplace Gone Sour", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Mar 2023", "job_title": "Human Resources in New York, NY", "duration": "N/A", "pros": "- Great benefits package - Good remote working arrangement - Wonderful supervisor (which was terminated too early)", "cons": "- DEI is simply a speech, not an actual initiative - Administrative Assistants are not truly appreciated (low pay, overworked, etc.) - Higher-ups salaries are way too high - Way too much tumultuousness and high turnover rate"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Great place to work but CEO turnovers have been challenging", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Mar 2023", "job_title": "Senior Policy Advocate in Chicago, IL", "duration": "N/A", "pros": "Committed and extremely knowledgeable policy staff and litigators Strong contingent of co-workers pushing for internal equity and inclusion as well authentic engagement with impacted communities", "cons": "Many in management lack experience with authentic community partnerships which can make it difficult to ensure these efforts are supported as needed."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "All change ain’t good change", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Mar 2023", "job_title": "Senior Associate in Washington, DC", "duration": "N/A", "pros": "Mission, benefits. not much else", "cons": "So many change and no stability is leading this place nowhere. The People Officer seems nice but has a huge ego. Watch out if you cross her. A lot of talk about DEI without a lot of support for DEI. Just ask the DEIO. A bunch of window dressing and talk. Don’t look for the diversity in the Hr team because you won’t find it. Do as I say, not as I do there. A lot of promises about how management is changing and working to help and support us. Window dressing for sure."}], [{"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Action doesn't match Talk", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Mar 2023", "job_title": "Director of Diversity, Equity and Inclusion", "duration": "N/A", "pros": "n/a, n/a, n/a, n/a, n/a, n/a.", "cons": "This organization is full of it, majority of the time. Very inauthentic organization with a lot of talk to match. The Chief People Officer is inauthentic, phony with a fake passion for diversity. Massive ego. The HR team has no understanding of DEI."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 1, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Experience was all over the place", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Jan 2023", "job_title": "Program Assistant", "duration": "N/A", "pros": "- Some of the best co-workers I've ever had. \r\n- Some of the most intelligent people I've ever met. \r\n- Incredibly passionate advocates doing incredible work (usually witnessing the advocates, scientists, and attorneys more junior). \r\n- If you are clear on your goals of being a Program Assistant or Entry-Level, you can take advantage of the opportunity to be at NRDC and have doors and experiences opened to you. Otherwise, don't expect much upward mobility or trust from others to do more substantive work. \r\n- Great healthcare benefits, over-time pay was also good. \r\n- Traveling was fun. - It was nice to turn off my laptop at 5pm and not think about work.", "cons": "- Some of the worst co-workers I've ever met especially, in my experience, working for the Arts Culture Partnership Program was the most demoralizing experience I've ever had as a professional. \r\n- Leadership is not in tune with the experience of anyone below a Director, also NRDC doesn't invest in their own talent. \r\n- Decision-making is slow. I understand and appreciate thoughtful strategy, but it is jarring how much brain space and sometimes emotional effort is put into something without measurable impact. \r\n- Witnessed weird, inappropriate, and offensive office dynamics with certain colleagues who had direct supervisor/direct report work relationships. I've seen favoritism, gossiping in the office, and also directors making their direct report cry or arguing publicly in work meetings, managing directors yelling at PAs and receptionists over not getting their BlueJeans meeting to work? \r\n- Old archaic administrative processes that could be more efficient or even automized. \r\n- Program Assistant morale was low while I was there, also there was always a lot of mentioning \"we can't do our work without the PAs\" which is true, but no real compensation. \r\n- As a young, queer, POC, NRDC can do so much better on the D&I efforts. I never truly felt comfortable in my own skin there. - Paternalism and perfectionism should be NRDC's motto.\r\n- Always felt like I needed permission from someone."}, {"Recommended": "N/A", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "A lot of turnover", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "7 Mar 2023", "job_title": "Senior Director in Washington, DC", "duration": "N/A", "pros": "Passionate staff working for a good cause", "cons": "A lot of leadership turnover and constant re-organizing"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 4, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Inequitable conditions and lack of leadership", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 May 2022", "job_title": "Manager", "duration": "N/A", "pros": "The org has a great mission and the benefits package is terrific. The hybrid work schedule, although ambiguous at the the current moment, is desirable. Work/life balance is just right. You'll find some really great individuals who genuinely care about the org's mission.", "cons": "Compensation is blatantly inequitable, and HR and leadership have not shown much concern, nor have they given reasoning for why this issue can't be resolved. Departments are extremely siloed, which has led to a breakdown in communication across the org and has mounted frustration for those who have to deal with it. A large number of staff won't follow standard guidelines and procedures in order to work as a collective team; guidelines aren't enforced by leadership, nor does NRDC have enterprise systems and documentation that work to standardize work across the org. And don't get me started on growth opportunities... It's a mess."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Current leadership is a mess", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "-Passionate people\n-A cause worth fighting for\n-A commitment to equity, trying to turn the organization around to be more inclusive and equitable\n-Amazing chief counsel (only person with \"chief\" in their title who is a real leader)\n-Great benefits", "cons": "-Identity crisis and lack of strategy\n-C-level leadership seem more interested in own reputation than the organization\n-Current leadership micromanages staff, diminishing morale\n-Many in executive leadership, especially in interim capacities, are unqualified for their roles and more focused in self interests\n-In transition mode every year\n-Overworks staff\n-No accountability\n-Inefficient decision-making"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "An org in decline", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 May 2022", "job_title": "Program Assistant", "duration": "N/A", "pros": "Some brilliant, amazing, dedicated, passionate, mission-driven coworkers doing interesting and important work.\r\nGreat benefits\r\nPre-pandemic there were many fun team-building exercises and opportunities to interact cross-departmentally", "cons": "Low pay and significant lack of upward mobility for junior staff across the board. Brilliant and dedicated coworkers consistently denied opportunities or compensation increases. Incredible amount of recent turnover among employees.\r\n\r\nArchaic, unresponsive, unhelpful HR creating and fostering a culture bordering on toxic. Constant restructuring, pushing people out that aren't a \"good fit\" is an absolute morale killer for fear you might be next on the chopping block. \r\n\r\nProgress on DEI issues is paid a lot of lip service but isn't manifested in actual hiring, promotions, or staffing of senior and C-suite level roles. Constant turnover of chief executive and management was also a huge detriment to company-wide morale."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Influential mission driven environmental organization -- external hires focused", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Jul 2022", "job_title": "Clean Energy", "duration": "N/A", "pros": "- Bright individuals designing impactful policies that accelerate the clean energy transition\n- Interesting and impactful work \n- Great work-life balance\n- Lots of autonomy \n- Respectful and inclusive colleagues who are open to having everyone contribute regardless of seniority", "cons": "- Not a lot of full-time entry-level positions in policy advocacy \n- Not a lot of career growth opportunities for young people...most leave to get higher education or work elsewhere to gain experience\n- Hire a lot of people with external experience\n- How they value an employee's experience (internal or external) is very opaque"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good organization with opportunity to grow for motivated employees", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 May 2022", "job_title": "Senior Scientist", "duration": "N/A", "pros": "The organization is flexible to employee needs. Once you prove yourself, the organization will go to great lengths to work with and accommodate your needs. Program staff have ample opportunity to grow professionally and personally.\r\nMission driven organization; the work is impactful and satisfying. Employees have the freedom to shape their work tasks to best impact society and for personal fulfilment. My manager and co-workers are very supportive of my professional ambitions and personal choices.", "cons": "This is a large organization, so organizational decision making can be slow at times. The interests of many programs need to be balanced and thus inter-program processes can especially take time.\r\n\r\nAs with any organization, a lot of job satisfaction is dependent on relationship with managers and closest co-workers."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Exciting New Leadership", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Jun 2022", "job_title": "Senior Attorney", "duration": "N/A", "pros": "Great colleagues with shared vision and values. NRDC is a powerhouse with high standards. If you want to make an impact in the environmental field, it is a great place to work. It is tough confronting today's environmental challenges, but it also can be very satisfying. \n\nThe pandemic was challenging, but the organization was quite flexible in supporting staff (including those with kids).\n\nExcellent benefits that are hard to match (e.g., 10% employer 401k contribution, generous family leave, great medical coverage).", "cons": "The work can be taxing. Lots of leadership changes also have caused internal anxiety. Fortunately, that seems to be turning around. I see a renewed spirit and excitement about the future of NRDC and our work."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "well just so so", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Dec 2022", "job_title": "Internship in Beijing, Beijing", "duration": "N/A", "pros": "flexible and enjoying， good feeling", "cons": "not rich and salary is not high"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Excellent organization.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Nov 2022", "job_title": "Senior Program Assistant in Los Angeles, CA", "duration": "N/A", "pros": "Friendly and flexible environment. Mission-driven work. Thoughtful leadership.", "cons": "Depending on your department, there may be little upward mobility."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "White-dominant culture hiring in-network for all senior positions", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "14 Apr 2022", "job_title": "Program Assistant in New York, NY", "duration": "N/A", "pros": "Good cause \r\nGreat, long-suffering BIPOC staff in the lower-rung steps doing the work of senior management with no compensation", "cons": "- Talks a great game about DEI, does nothing about promoting BIPOC staff. \r\n- No upward mobility for PAs. PAs of color have many more people to support than white PAs. Nearly all PAs are female and treated like the help, unless they are related to some senior staff or donor.\r\n- Internships go to children of donors first and then trickle down to one or two qualified candidates\r\n- Program heads are nearly all white and from the same network of friends and family. Only the president role has a diverse candidate but no president lasts because upper management is toxic and working to actively disempower him/her. \r\n- Many in HR just want to stay in favor of upper management and brush gross violations under the rug which leads to ex-employee lawsuits. \r\n- Like others said in the reviews, drives out people of color in droves. Can't keep a single black attorney because of the toxic culture."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Unstable leadership team and lip service.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Feb 2022", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "The NRDC does a lot of great things globally. The pay is above average in the area.", "cons": "There is a new president every year. I have seen 4 in my almost 5 years of working here. They talk about “change” in the workplace but put in minimal effort to actually make the changes. The top of the ladder is stuck in their ways and refuses to change. They will stiff you on bonuses, salary increases even when declaring that this behavior will change. Over the span of pandemic everyone has worked hard and was told that we were appreciated and that things like bonuses and growth opportunities were coming. Nothing changed. I was presented with a minimal raise that is almost nothing, a half assed restructuring diagram that could benefit my growth in “YEARS”, a poetry book and an “I’m sorry you feel that way”."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "HR Leadership is an abomination", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "5 Jul 2022", "job_title": "Sr. Recruiter in New York, NY", "duration": "N/A", "pros": "Excellent Benefits, great people, casual environment, strategic president. The new CPO may have a positive effect on HR. Remains to be seen.", "cons": "HR Leadership is awful! When you thought the HR Leadership was being upgraded, they went completely left. They made decisions based on imaginary feedback because it fits their personal narrative."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "decent pay, crappy career development", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "27 May 2022", "job_title": "Director in Wayne, PA", "duration": "N/A", "pros": "If you are a senior leader, well-liked, and assertive, you can make your own work and have some autonomy with little accountability. basically you can get paid pretty well and coast. really passionate advocates (pros and cons) and important, meaningful work is being done.", "cons": "No leadership, no accountability, no career growth. Leadership have no idea how to successfully manage or lead, and continue to get promoted and make way more money than they are worth. NRDC doesn't have a strategic vision, don't know who they are, or how to figure it out."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Sinking Ship", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "2 Jan 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- I had previously rated NRDC 5 stars but company's been going downhill this year.\n- People are generally nice & relaxed\n- Great benefits\n- Decent work life balance\n- WFH environment\n- Pay is nice if you are upper management, but low for junior employees", "cons": "- Extremely high turn over, every week is another \"good-bye\" email from employees with long-tenures. Large number of high leadership positions being vacant for a long time (with jr staff expected to pick up the slack, with no compensation)\n- 3 different presidents within the past 4 years. We had a new head of HR recently that joined and resigned within a month. That should say enough about the current state of affairs.\n- Lack of upward mobility for junior staff. Pay raises are very low at 3%. Does not keep up with inflation."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great mission but has its bumps like any other non profit", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Jul 2022", "job_title": "Data Analyst", "duration": "N/A", "pros": "some great staff, good benefits, great mission and they try to listen to their staff", "cons": "It's a big org with lots of different personalities that may not agree on things. This can cause confusion among teams. Historically, collaboration among teams has been challenging but they are working to improve on this."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "save your peace and don’t work here", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "4 May 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "benefits, competitive pay IF you are in the right position/right time, ability to hire talent", "cons": "this organization and its communications department cannot and does not want to retain people who are talented, smart, and have a genuine interest in justice. NRDC’s mission may say it wants to protect people, but in fact it does the opposite by reinforcing a toxic work culture that upholds white supremacy, ageism, and archaic methods to implement “theory of change.” in fact, extraction is their main goal, taking so much time, money, resources, ideas, and power away from staff who do not just shut up and work. sure, there are exceptions. but not enough. as a clever wolf in sheep’s clothing, the people in power are exceptional at tokenism, picking and choosing which BIPOC person to uplift, and which outspoken allies to push out— the institution also pits BIPOC and junior staff against each other by 1) offering zero upward mobility, 2) playing favorites for white folks who don’t “rock the boat,” 3) having arbitrary measures for success that are inconsistent, and 4) never holding problematic colleagues accountable. the communications department in particular cannot retain employees and acts as if everything is normal, and i have witnessed the implicit and explicit bias employees have toward interviewees of color versus mediocre white interviewees. if you fit in with the status quo (DC, political background, ivy league, attorney, centrist/a democrat, a white person, etc), you’ll have an enormously successful career at nrdc. if you’re anyone else, they will politely use you, lie to you, gaslight you, and then throw you away. save your peace, and work somewhere else. this institution wants to work on everything all at once, and does it horribly with their endless supply of money and power."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Not the best place to work for the BIPOC community", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Mar 2021", "job_title": "Director", "duration": "N/A", "pros": "Comprehensive and generous benefits, most people are kind (with some exceptions)", "cons": "Very White Dominant Culture. Lack business savvy leadership. Reactive, unrealistic and poor equity and inclusive culture."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "great mission, people and talent - moving decidedly in the right direction", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Jun 2022", "job_title": "Management", "duration": "N/A", "pros": "mission driven nonprofit with a depth of talent. passionate colleagues who care deeply about creating change. the right organization for this moment in time.", "cons": "transitions and DEI challenges have been real. some early progress is starting to be made but more needs to be done. trends are finally moving in the right direction."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Passionate people", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Aug 2022", "job_title": "Manager in New York, NY", "duration": "N/A", "pros": "Passion for the environment. Voice in the org. Fair salary.", "cons": "Leadership turnover. Need sense of direction administratively."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Poorly organized", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Sept 2022", "job_title": "Project Manager in New York, NY", "duration": "N/A", "pros": "Friendly people can be found in different departments", "cons": "Lots of mismanagement in different key departments"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "A great place to learn", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "30 Jun 2022", "job_title": "Regional Lead in Washington, DC", "duration": "N/A", "pros": "Talented and dedicated colleagues\nMission based work\nVery flexible and supportive during covid\nActively on a path to learn and do more to ensure equity is a core value", "cons": "Meeting heavy organization\nManager quality can vary greatly"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Awesome Workplace with an Amazing Mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 May 2022", "job_title": "Managing Director in New York, NY", "duration": "N/A", "pros": "This place is full of passionate people who want to make a difference in the world. Everyone works hard but they respect work-life balance and each other.", "cons": "There are a lot of new leaders - but they are bringing amazing energy and ideas to NRDC."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great life balance and mission", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Jun 2022", "job_title": "Deputy Director", "duration": "N/A", "pros": "Salaries, vacation time, benefits, DEI goals", "cons": "Transparency, hire more diverse staff, better path to promotion for junior staff"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Awesome place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Jan 2022", "job_title": "Senior Director of Talent Acquisition in Santa Monica, CA", "duration": "N/A", "pros": "Higher than average compensation levels\r\nHigher than average diversity metrics in most divisions\r\nInclusive and caring culture\r\nExcellent benefits", "cons": "A lot of transition in the last year but less than average on a national scale;\r\nOrganization is currently going through structural reorganization at the executive leadership level and this process has been challenging; and\r\nLike most companies and organization in the US and globally, the organization is trying to figure out future of work issues and how to navigate remote vs call back to office issues."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Passionate", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I work with some of the kindest, hard-working, passionate, brilliant coworkers I've ever had the pleasure to work alongside. NRDC is smart, effective, and thoughtful about advocacy and it makes me proud to work here.", "cons": "There is a lot of work to be done, and never enough time. It be stressful given the amount that needs to be done and hard to turn your computer off at the end of the workday."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Developer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Jul 2022", "job_title": "Senior Android Mobile Engineer", "duration": "N/A", "pros": "It is a good company", "cons": "If pay so more salary"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Work Environment - Lacking Upward Mobility", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Mar 2022", "job_title": "Research Assistant in Washington, DC", "duration": "N/A", "pros": "Excellent culture. A very supportive community of passionate and driven environmentalists looking to support one another's goals and development.\r\n\r\nThe mission of the organization is noble and encourages constant engagement. The ability to discuss important topics with experts in all fields is a significant bonus.", "cons": "Not much room for advancement within the company unless you get additional advanced degrees or certifications. This is to be expected but is important to note."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "great org, hard to move up", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 May 2022", "job_title": "Program Assistant", "duration": "N/A", "pros": "Smart coworkers, internal focus on equity, dedication to the mission", "cons": "Hard to move up from Program Assistant role"}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "High Turnover, Toxic culture, No career growth", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Aug 2021", "job_title": "Development Assistant", "duration": "N/A", "pros": "-Salaries are good for a nonprofit, although toward the lower ranges, still difficult to afford the cities we have offices in\n\n-Great benefits\n\n-Great office locations\n\n-Reputable in litigation, policy work, and political relationships", "cons": "-Very much a culture of senior management/leadership mattering the most, junior staff not mattering at all. Deceptively hierarchical and toxic. Almost a culture of celebrity/worship of some leadership \n\n-Some questionable relationships. Org refuses to take a meaningful stance on many issues, and with some problematic people\n\n-Toxic work environment for POC\n\n-Manager ineffectiveness\n\n-No career mobility for junior staff, slow and ineffectual promotions/raise process\n\n-Disrespect toward operational staff and junior staff\n\n-Not diverse. History of driving out Black staff\n\n-Reputation of sucking up all the money in the enviro space, esp. from smaller nonprofits and grassroots orgs\n\n-Slow to communicate out important institutional decisions to wider staff"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Apr 2022", "job_title": "KDR Executive in Houston, TX", "duration": "N/A", "pros": "Loved them would do it again", "cons": "Hard work at all times"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Hiring Process!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Mar 2022", "job_title": "Director of Training and Development in New York, NY", "duration": "N/A", "pros": "- Speedy recruitment process\r\n- Flexible scheduling\r\n- Panel interview with people from across the organization\r\n- A strong focus on promoting diversity and practicing inclusion\r\n- Great experience all around!", "cons": "Nothing that currently stands out."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Collaborative Team and Great Mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Mar 2022", "job_title": "Director, Employee Relations and Compliance", "duration": "N/A", "pros": "Supportive leadership; Fantastic benefits package; Collaborative team; Incredible mission.", "cons": "None -- It's been a good new hire experience."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "BIPOC and junior staff, be wary - toxic culture, no career growth", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Sept 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good benefits. People are polite and largely nice (at least on a surface level)", "cons": "No upward mobility for junior or administrative staff. If you start out in a junior position, you won't be paid enough to live in the expensive cities in which we work, and it will be hard to catch up salary wise to the primarily white folks who come in at higher levels. A lot of language about equity and diversity, but there's been no meaningful process to make the organization a less toxic place to work."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Not a place for young professionals who look for jobs in an equal and intl place", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Feb 2022", "job_title": "Project Coordinator in Beijing, Beijing", "duration": "N/A", "pros": "Nice co-workers\r\nCan learn somethings (bad and good)", "cons": "Terrible terrible terrible management \r\nExtremely low and unfair salary for assistants and coordinators"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Countless internal culture issues", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Oct 2021", "job_title": "Program Assistant", "duration": "N/A", "pros": "Good teamwork, collaboration, and overall mission", "cons": "Total lack of transparency and accountability from senior leadership; DEI values seem to be co-opted to make the institution look better externally, rather than actually support and uplift BIPOC staff; No upward mobility for junior-level staff and significant pay disparities; HR is understaffed and often non-responsive; Staff frequently work unpaid time"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Jan 2022", "job_title": "Research Assistant in Los Angeles, CA", "duration": "N/A", "pros": "Culture, transparency, mission-driven, effective, flexible work from home", "cons": "No institutional path for upward mobility for lower-level roles"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Awesome place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Dec 2021", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "Awesome place to work on important issues", "cons": "None - it's an incredible place to work"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Strong foundations but growing pains", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Aug 2021", "job_title": "Communications in New York, NY", "duration": "N/A", "pros": "Amazing work outcomes and collaborative culture overall. Great benefits.", "cons": "Key leadership positions have been empty for a while. Lots of time and talent going underutilized while management struggles to fill the gaps--historically low turnover is inching up as HR can't get its act together and promotions and raises lag incredible performance. Culture of the me-first Development leadership team is particularly toxic, needs new blood and vision."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Workplace", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Dec 2021", "job_title": "Advocate in San Francisco, CA", "duration": "N/A", "pros": "Extremely intelligent folks. \nHelpful upon request", "cons": "Toxic work environment\nLack of Accountability \nNo internal support for issues."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Dec 2021", "job_title": "Senior Attorney", "duration": "N/A", "pros": "Great place to work. I have nothing bad to say.", "cons": "None. It’s a great place."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Amazing Non Profit to work for", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jul 2021", "job_title": "Coordinator in New York, NY", "duration": "N/A", "pros": "The brightest and the best at what they do. Amazing place to work, great culture. A place you'd want to work for years to come. Loved working here!", "cons": "As with all non-profits, it's a lot of work, but the reward of working within an organization that passionately fights for change in the policies that impact the environment, is one worth being a part of."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Bad", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Oct 2021", "job_title": "Program Assistant in San Francisco, CA", "duration": "N/A", "pros": "Effective org with flawed structure", "cons": "Racism and sexism built into systems"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "16 Aug 2021", "job_title": "Deputy Director in San Francisco, CA", "duration": "N/A", "pros": "People, work-life balance, mission. Strong teams and ability to make an impact. Connections with policy-makers is bar none.", "cons": "Decision-making processes can be protracted. Organizational structure can be difficult to understand but is slowly improving."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Past Employee", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Aug 2021", "job_title": "Senior Development Associate", "duration": "N/A", "pros": "Fantastic place to work, environment is friendly and welcoming, and the management team is easy to work with.", "cons": "NYC office needs to be updated ASAP, it kind of still looks like the 70s. Besides that, everything is awesome."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Extremely difficult to get promoted to a new role as a Program Assistant but people are mostly great", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Mar 2021", "job_title": "Program Assistant", "duration": "N/A", "pros": "NRDC has amazing people who care about the environment and people. There are opportunities to learn about different issues.", "cons": "It's extremely difficult to move into a new role if you start as a Program Assistant. You can get pay raises over the years, but a title change is very unlikely. They expect program assistants to work a few years and leave."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 3, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent benefits, workplace culture and engaged staff", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 May 2021", "job_title": "Human Resources in New York, NY", "duration": "N/A", "pros": "Passionate, engaged and brilliant staff. Excellent benefits show that NRDC really cares about its people. There is an overall commitment to transparency by senior leadership, but there is still work to be done on this front.", "cons": "Internal advocacy can be a problem at times and it is an elitist culture."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 1, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Toxic & Mismanaged Mess: Disservice To The Cause", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Aug 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The mission of the organization.", "cons": "Toxic and hostile work environment allowed to flourish by senior management and left unchecked."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 4, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "good", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Jun 2021", "job_title": "Communications Manager in Beijing, Beijing", "duration": "N/A", "pros": "good pay, nice location in CBD", "cons": "slow workflow, hard to be accommodated"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great employer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Jun 2021", "job_title": "Department Manager in Chicago, IL", "duration": "N/A", "pros": "Flexible and progressive place to work.", "cons": "Can be large and bureaucratic at times."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place to call work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "22 Feb 2021", "job_title": "Lawyer in Chicago, IL", "duration": "N/A", "pros": "The organization cares deeply about staff. This is reflected in the incredibly generous HR and leave policies. It's one of the most generous places I've ever worked.", "cons": "The organization has grown large very quickly. The fast paced growth has caused some behind the scenes issues, but they are being addressed."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 3, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great Company Culture, but limited upward mobility", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Apr 2021", "job_title": "Communications", "duration": "N/A", "pros": "The people you work with are very friendly and supportive. Decent salary for a non-profit.", "cons": "It is fairly challenging to move up if you start at a junior position in the company."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Apr 2021", "job_title": "Administration", "duration": "N/A", "pros": "Competitive salaries w other non-profits", "cons": "I don't have any to share."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 3, "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Earned less than an intern in the US", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Feb 2021", "job_title": "Project Assistant in Beijing, Beijing", "duration": "N/A", "pros": "Professional environment, big name, 15 days of paid leave", "cons": "Basically no promotion ladder  for entry-level employees;\r\nEarn much less than an intern in the States and peer orgs in China;\r\nBad management;\r\nHighly dependent to the hq, and waste tons of time on communication with US"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "great mission, messy leadership", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Jan 2021", "job_title": "Director, Communications in New York, NY", "duration": "N/A", "pros": "when you find the right manager, you can get great work done.", "cons": "lots of leadership change, unskilled managers, large organization that can be bureaucratic, no growth opportunities"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great benefits", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "7 Mar 2021", "job_title": "Manager, Development in New York, NY", "duration": "N/A", "pros": "Really great benefits, flexibility in managing personal and family needs, support in pursuing additional education", "cons": "Transparency; growth for junior staff"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "NRDC Review", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Feb 2021", "job_title": "Intern in Washington, DC", "duration": "N/A", "pros": "Great people that welcome you from the first day and are very flexible.", "cons": "I really cannot think of one!"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "I enjoy NRDC - Great Bosses", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Feb 2021", "job_title": "Executive Assistant in Washington, DC", "duration": "N/A", "pros": "Amazing work life balance\r\nLaid back modern office environment\r\nGood Benefits\r\nGood Pay", "cons": "No upward mobility for admin staff"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Mar 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Wonderful organization to work for", "cons": "I honestly can't think of one."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Feb 2021", "job_title": "Associate Director", "duration": "N/A", "pros": "Great organization and good people", "cons": "Nothing comes to mind now"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great Organization", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Feb 2021", "job_title": "Program Assistant in San Francisco, CA", "duration": "N/A", "pros": "- Amazing non-profit to be a part of", "cons": "- Position has no room for growth"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Good Place to Work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Nov 2020", "job_title": "Policy Analyst in Washington, DC", "duration": "N/A", "pros": "Enjoyable place to work with many smart, passionate people.", "cons": "Many layers of middle management makes for stiff, bureaucratic environment. Most staff are overworked."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 4, "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Values driven organization", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Nov 2020", "job_title": "Program Assistant", "duration": "N/A", "pros": "Great mission-driven company filled with sharp, committed staff", "cons": "Your manager largely drives your experience, thus good manager = good experience, bad manager = bad experience"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Leadership cares", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Oct 2020", "job_title": "Fellow in New York, NY", "duration": "N/A", "pros": "A great workplace environment with management that is trying to help", "cons": "Middle management is often slower to change habits"}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Experience depends wholly on your team", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Sept 2020", "job_title": "Program Assistant in San Francisco, CA", "duration": "N/A", "pros": "The mission. Everyone truly believe in it, and it's an amazing energy knowing your doing something that helps the world. The PAs are an incredibly supportive, smart and fun team. There are the occasional nice perks, such as professional development funds received annual, funded educational trips, and funded office DEI groups.", "cons": "Your experience depends on the team you work for. Managers live and die by decision autonomy, which brews a very toxic environment because there are few checks and balances. Managers were only able to be promoted in the org by taking on managerial duties - which few are competent for or even show a desire to learn the skills. This role is created for post-college grads who need a couple years of experience before moving on (you're literally told it's a 2-year position and you should go elsewhere if you want a promotion). I strongly advise you to avoid this company if you do not fit into this description. Your experience will greatly depend on the people you work for directly, and this is an office full of politicians, scientists and lawyers."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "NRDC is a great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Jun 2015", "job_title": "Staff Advocate in Washington, DC", "duration": "N/A", "pros": "I have worked for several ENGO's over the years, and NRDC stands apart for several reasons. The staff are exceptionally bright and committed (many senior staff have been with the organization for 30+ years). NRDC pays relatively well, invests in its employees, encourages innovation, and is wiling to doggedly pursue even the toughest issues.", "cons": "Though the organization has been around since the 1970's, it very recently has seen massive growth. While NRDC has always managed money very well (the rounds of lay-offs that other NGOs sustained during the Great Recession were avoided at NRDC), its burgeoning size puts the organization at risk of increasing bureaucracy and loss of intimacy and camaraderie organization-wide. Its also generally true that mid-level staff tend to leave as the top positions rarely open (although NRDC does have a transparent and very fair promotional system that does award salary increases as experience is built)."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Not much growth for Program Assistant, but great company to work for.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Sept 2012", "job_title": "Program Assistant in New York, NY", "duration": "N/A", "pros": "NRDC does great work. Hires some of the most intelligent and experienced people in the field. Great work culture.", "cons": "There is not a lot of room for growth especially for the assistant role, which is why there's a high turnover rate. Lots of individuals in the PA position have a high educational background but no chance to move up; either some programs don't have much opportunity for moving up or they would rather hire externally then promote from within. I guess that makes sense since the assistant role really doesn't have much opportunity for growth. No growth opportunities, no position promotion. Also, there is a bit of nepotism like any other company."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Program Assistant", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Feb 2019", "job_title": "Program Assistant in New York, NY", "duration": "N/A", "pros": "Good benefits\r\nGood institutional knowledge in the field\r\nScientists and lawyers are really nice \r\nPeople are smart (and often overqualified) \r\nSome are great and have good ideas but are overshadowed by others", "cons": "Disrespect for many people working in development from other departments and GREAT disrespect for program assistants in this position.   PAs are not treated well almost universally in this organization. Their work is often looked down upon.  I left on my own accord but in the exit interview I mentioned this and they said that they would \"try\" to do a training on it.  \r\nIt's almost impossible to move out of a lower tier position unless you leave for a few years and get a better job. \r\nThey are often elitist and have fair amounts of cronyism. They talk a big talk about diversity integration but they have nothing to show for it."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Working at NRDC", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "8 Sept 2012", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "I enjoyed my years working at NRDC.  I was able to progress in my career during that time, and the colleagues in my department were a pleasure to work with.  Everyone at NRDC is passionate and extremely knowledgeable -- I believe that is what really makes the company so valuable.", "cons": "NRDC as an organization has changed since I first started to how it was when I left.  It's a lot more bureaucratic and corporate than it used to be -- but perhaps that's what's necessary for a growing organization."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Competitive compensation for a NP, but internally disorganized", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Jun 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "+ Competitive pay & benefits compared to other nonprofits\r\n+ Lots of genuinely smart, talented people who care deeply about the mission\r\n+ Org is making a sincere (if not yet effective) effort to focus on diversity, equity, and inclusion.", "cons": "- The org has grown too much and too quickly for the IT, HR, and facilities teams to scale. As a result, offices are very overcrowded, and the HR and IT teams are really unequipped to do their jobs. \r\n- The raise/promotion/performance review process is very opaque. Lots of disparate and conflicting info is made available, but managers are still left w/o answers for their employees.  (Another case of HR not being equipped to handle an org of this size.)\r\n- Internal approvals and hierarchy bog down work. Things move very slowly, and goals are constantly shifting: projects often backtrack due to changing stakeholders/requirements, and teams aren't clear on organizational / department goals."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Grew Too Fast", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Feb 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "The smartest, most passionate colleagues I've ever had. Those that work in programs and litigation are some of the most talented lawyers, scientists, and policy experts in the world.", "cons": "After the Trump election, NRDC sought to position itself like ACLU and Planned Parenthood; on the frontlines of our nation's defense. The problem is that up until that point, NRDC had been operating like a medium-sized, middle of the road environmental non-profit (which they are). They were completely unprepared for the rapid growth, and expanded quickly without 1) enough staff 2) enough structure to succeed. Now, we're looking backwards trying to figure out how to solve all the problems that it may be too late to fix."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "The most effective conservation organization in the world.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Sept 2008", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "The best reason is that you're working with the best and brightest in their fields in a very influential mission-based organization. If you want to make a difference and be right in the thick of where all the action is in environmental advocacy, then this is the place to be. NRDC also offers generous benefits and top pay for an environmental nonprofit organization. NRDC takes its values very seriously. It achieves results and is respected by both its allies and opponents. The organization has a casual dress code. It offers opportunities for work that takes you out in the field to some of the places that you're working hard to protect.", "cons": "The biggest downsides are uneven management, non-profit salary and difficulty in achieving work/life balance."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Great mission, good people, messy management", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Jan 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "NRDC is a mission-driven place and allows individuals to do some real good in the world. I am always proud to say I work for NRDC. There is flexibility to do different things as long as you can find a champion and (if needed) funding to do the work. Lots of lifelong employees and many women in management because the work-life balance is top notch. Offices are great and the technology is improving.", "cons": "NRDC seems to be going through some growing pains and the management is not great. Maybe once the new president is settled and when they get the new strategic plan things will be more streamlined."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "It's OK", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Lot's of driven staff that generally believe in what they're doing.", "cons": "Very little progress on assignments or projects. \r\n\r\nThe organization is obsessed with diversity to the point that if you're a white, cis, heterosexual male, you need not apply here. \r\nA ton of bureaucracy and office politics to navigate. \r\nHR is a joke, it takes months to hire people that are needed and those in HR are feckless with their role.\r\n\r\nCountless time wasted creating a bunch of memos that are circulated internally and get people nowhere."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Employees committed to mission", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Feb 2017", "job_title": "Advocate II in San Francisco, CA", "duration": "N/A", "pros": "Employees are very committed to the central mission of NRDC, which is to protect and improve the environment. Employees are personable, friendly and caring. Salary and benefits are good, for a non-profit.", "cons": "Shows some dysfunction of being a large organization, but employees seem well-intended to improve this. People tend to work extremely hard - their passion for the mission of the job works to their own detriment, as this leads to burnout. Also, low level staff have little-to-no opportunities for advancement in-house. This needs to be addressed!"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Fantastic Non-Profit", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Jan 2017", "job_title": "Program Assistant in New York, NY", "duration": "N/A", "pros": "NRDC has an excellent culture: each day you are surrounded by passionate, intelligent, and interesting individuals. I appreciated working for the organization for their science-based approach to advocacy. As a program assistant, it was my first job out of college and a great way to start a career in environmental research and advocacy. A key element is getting good mentors, as it will shape your experience at the organization.", "cons": "There is limited room for upward mobility for entry to mid level employees. As many of the staff had been there for decades, there was pushback against major institutional changes."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Intern", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The people at NRDC are very passionate, smart and fun to be around.  The office is beautiful and in a great location.  I have not been at NRDC long but it has been a great experience so far.  I am inspired to come to the office and work for the day.", "cons": "I think your experience at NRDC depends on what program you get placed into.  While I love the program that I have been working on, I would be less interested in other programs that are around the office."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Committed and Kind, but in Need of Equity Update", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Mar 2020", "job_title": "Program Assistant", "duration": "N/A", "pros": "I have never had a better job. I looked forward to seeing my coworkers and felt completely respected and strongly supported by my supervisors. I felt committed to the mission and believed in the organization's ability to do the work well. The attorneys I supported invited me into substantive issues that I found interesting and encouraged me to pursue career growth. I will forever be grateful for the opportunity this job provided for me to begin a career in this field.\r\n\r\nHealthcare benefit is very good and most programs respect need to work from home or support moving to less than full-time to accommodate families.", "cons": "Salary offers take advantage of applicants' desire to support the mission. So, to those applying for entry level positions, NEGOTIATE YOUR SALARY. The initial offer is made with the EXPECTATION that you will ask for and receive more. Even if you've never held a similar position and have always wanted to work for this org, negotiate. They will not withdraw the offer and other PAs I know successfully increased their salaries through offer negotiations.\r\n\r\nThe organization has struggled to provide an inclusive and equitable environment. Leadership is almost all white, as are most of the people in advocacy positions, while employees of color tend to hold positions within development, hr, accounting, and other support departments. Most employees recognize this as a huge problem, but the organization has taken only minimal steps to make necessary changes. I see a push to change messaging around environmental justice and the Big Green groups' history of whitewashing and racism, which I appreciate, but not a response to employee requests for a shift in the internal culture.\r\n\r\nDifferent programs treat program assistants with different levels of respect. Every PA I met was overqualified for her (most women in these support roles) work and took the position to get a foot in the door at the organization. However, many programs overwork their PAs with administrative tasks that supervisors could accomplish more efficiently on their own if they took the time to learn how. This keeps PAs from engaging with the organization's mission and from taking advantage of opportunities for career growth. Further, while I was there, salaries for support staff were inadequate and HR horrible to deal with whenever this problem was raised."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Collegial environment, smart people", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Feb 2018", "job_title": "Program Assistant in San Francisco, CA", "duration": "N/A", "pros": "My program had a lot of smart and accomplished people, nice office location and space, good manager, casual office environment, good for those who want to attend grad school after, good benefits", "cons": "Low pay makes it challenging to live in Bay Area, little upward mobility is frustrating for highly-educated Program Assistants, and most move on after a couple years"}], [{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "great place to work, but limited room for growth", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The work is actually meaningful! They are one of the most respected non-profits in the U.S., and they have the means to actually get things done. Really great office culture, everyone is friendly, and the staff at all levels are passionate about what they do. The hourly pay for contract/consultant work was very reasonable.", "cons": "It is very difficult to work your way up through the organization unless you get lucky with timing of someone retiring and a position opening. Essentially, people who are in management stay there -  great if you're in that position, but extremely frustrating for young professionals trying to launch their career."}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Mostly good, but depends heavily on your team and manager", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Jan 2018", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "- People in the communications department are all very smart and most are absolutely wonderful people to work with. Very passionate. \r\n\r\n- Pay is very good for non-profit jobs. \r\n\r\n- Benefits are nice - still a bit expensive for family insurance, but that is pretty standard for non-profits. Fair amount of starting vacation time.", "cons": "- There's a lot of post-work emailing that happens,  due in large part to people being overextended and *lots* of meetings. \r\n\r\n- Wile the hours are 9-5, and a lot of people stick to those hours in other departments and offices, a lot of people in the NY office get in late and leave late. So, if you want to stick to actual business hours, be prepared to feel like you're not putting in as much as those who choose to work outside those hours (including emailing), and be ready to spend the first hour or so of your day working on tasks you don't need your co-workers for. \r\n\r\n- Those in management positions need to advocate for their teams more. Whether that comes in a change in management or for those people to feel more supported by the organization overall, I'm not sure. \r\n\r\n- With some teams it's incredibly unclear who is charge until someone complains that they weren't involved in something after the fact. Other teams have clear roles, but produce work that takes more time to correct than is worth it to begin with. Not clear why either is acceptable."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Good Advocacy Organization, Horrendously Managed", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Aug 2015", "job_title": " in New York, NY", "duration": "N/A", "pros": "- Passionate and effective program, research and advocacy work produced\r\n- Finally hired a new President with a fresh outlook\r\n- Resources (endowment) available to invest in important endeavors", "cons": "- Indecisive and haughty management\r\n- Poisonous grapevine\r\n- Very insular.  Run the same way by the same people for 40 years.  With a staff of 500, much of the staff is clinging to a \"scrappy little law practice\" culture.\r\n- Administrative staff (including executive level) is treated in a demeaning way"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Well Meaning but Disorganized", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Jun 2017", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Passionate people, feeling involved in a cause", "cons": "In non-program departments (where I worked) there can be an abundance of unclear work, lack of institutional priorities backing up decisions, and inconsistent work depending heavily on your manager. As you'd expect, it is very political in higher levels creating a difficult sense of what roles matter and why. Job advancement is there for some and entirely absent for others, which leads to a kind of favoritism. There is also a heavy use of consultants and hiring out for everything."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Mission driven work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Jun 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Working at NRDC is very satisfying.  Everyone there is committed to the organization's mission. There is a lot of opportunity for professional growth by taking on increasingly challenging work and gaining deeper expertise on the job.", "cons": "As an NGO we don't have the most updated technology so administrative tasks like managing a budget are more time consuming than they should be. Also there are very few opportunities for external training."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Communications Intern", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "NRDC is very organized. It's a nonprofit but runs a little like corporate, which isn't a bad thing. The work is very organized and I had very specific tasks of drafting action alerts and event invitations. (These were great to save as writing samples for future employers!) I made a lot of great connections at NRDC that I'm sure will help me land me in another work environment that is just as great!", "cons": "Some days I had grunt work to do-- but that's just a typical internship"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "NRDC is great if you work for the New York office", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "16 Jul 2019", "job_title": "IT Site Manager in San Francisco, CA", "duration": "N/A", "pros": "Most of the people in San Francisco office were great.  They were friendly and Hard working.", "cons": "That if you did not work in the New York office you were not treated equally as that is where the HQ is.  HR department is terrible.  their Ast manager was not allowed to work with the users and only on special projects.  Again this person worked in new York.  If you did not work in New York in the IT department you were not listened to nor treated fairly, and they would not offer you  a promotion.  but people in Ny IT seemed to always get them"}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Program Assistant", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "NRDC is full of a lot of strong advocates and is able to do a lot in the environmental field. This is  a great position to learn a lot and see the inner workings of a successful NGO.", "cons": "Within this role there is no opportunity for upward mobility. While there are plenty of really great people who work at NRDC there are some staff that are not. While this role is within programs it is rare to get opportunities to work on anything related to the program you  support. This role in the organization is much more back end-- finance, development, admin, etc. and might not be good fit if you are hoping to do environmental work."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Attorney", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "20 May 2015", "job_title": "Attorney", "duration": "N/A", "pros": "Everyone is very committed to the environment. The team's passion for their work is inspiring. I enjoyed getting into the detailed work and was satisfied with outcomes that really made a difference.", "cons": "NRDC is not very racially diverse. It is also not very diverse as far as socio-economic status. Everyone is very well-intentioned but it's still an elite crowd to say the least."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "great mission", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Dedicated professionals for the cause.", "cons": "Depending on who you work for, you can either get a great manager and team or one who needs serious improvements if not a complete overhaul."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "A place on the cusp of being great or just a place to play high school politics and chat.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 Mar 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great mission, mostly good people, good working conditions. Has had great success in the past and has had tremendous growth in the last 10 years.", "cons": "Leadership is adrift under the new president. Compensation is well below market. Some serious deficiencies in upper management."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Site Manager", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "3 Jan 2016", "job_title": "Site Manager in San Francisco, CA", "duration": "N/A", "pros": "It's a great organization with several of the brightest, most dedicated, inspiring and interesting people you're likely to meet.  Very well-funded as a non-profit, which helps to provide modern, reliable amenities and equipment and fairly competitive salaries and benefits.  Excellent work-life balance, though the lawyers might disagree :)", "cons": "Difficult to advance within the organization, as a lot of the positions are held by people for decades and many others are held short-term by interns."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Hard work, fantastic colleagues, mission worth fighting for.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Jan 2017", "job_title": "Program Assistant", "duration": "N/A", "pros": "Inspirational colleagues, exciting work (!!!), generous vacation/sick/personal time, great work from home policies, great office atmosphere, great networking opportunities.", "cons": "Minimal opportunities for upward mobility, expectation set by HR that junior employees only stay ~2 years before \"moving on\", unclear process for promotions, lack of transparency from HR department."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "As a Princeton-in-Asia fellow at the Beijing office, overall an overwhelmingly positive experience for a recent graduate", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Mar 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Smart, motivated colleagues; ability to network and interact with leading figures in the China environment/energy realm", "cons": "Meaningful work depends on the program in the office; some supervisors while supportive do not provide enough direction for the fellow to make a contribution"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 4, "review_title": "GOOD JOB", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "12 May 2010", "job_title": "Senior Scientist in Los Angeles, CA", "duration": "N/A", "pros": "Great feeling of accomplishment.  Motivated coworkers and good benefits.  Intelligent motivated staff and management.  Good work environment and decent compensation.", "cons": "No hierarchy so no promotion.  Expected to work extremely hard and into the weekend and evenings.  Pay is much lower than in a for-profit."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Smart Growth Analyst", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Feb 2013", "job_title": "China Analyst in Shanghai, Shanghai", "duration": "N/A", "pros": "Great organization with strong potential towards upward mobility and personal growth. The strength of the organization has to be in the dedicated staff all working towards the noble mission statements of the NRDC.", "cons": "The NGO world can be a little disheartening at times, with long sighted goals and objectives that are sparse on immediate gratification. You have to really be motivated to the \"cause\" to succeed in this environment."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 1, "Senior Management": 3, "review_title": "Great organization, but terribly inequitable pay among comparable staff.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Jul 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Plenty of opportunities to build skill set. Very non-hierarchical. Staff are given tremendous responsibility and autonomy.", "cons": "Just abysmal pay discrepancies among equally qualified staff. For years the institution has failed at fixing the arbitrariness surrounding very comparable colleagues' salaries."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Mar 2017", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "NRDC has an excellent vision, a great staff who are passionate and friendly, and a pleasant work space in New York.", "cons": "Sometimes, there were issues about not receiving enough feedback on work, and of work groups being siloed off from one another."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Environment, no upward mobility", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 May 2017", "job_title": "Program Assistant in San Francisco, CA", "duration": "N/A", "pros": "Flexible schedule, nice environmentally friendly office, stocked kitchen, interesting guest speakers, treated very well overall.", "cons": "Downtown office means either paying to park all day or pubic transportation,  very quiet, work is tedious, software is way outdated, no way to move up from this position. Company is very classist and snobbish.   No dissent is tolerated."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Wonderful people doing great work for environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 May 2013", "job_title": "Intern in San Francisco, CA", "duration": "N/A", "pros": "-Satisfying work \r\n-Great connections to interesting people in the field\r\n-People are friendly\r\n-There were opportunities to work with many different programs", "cons": "Office culture isn't the most outgoing and friendly\r\nOverall, the experience was great.\r\nI would have love to stay if the project I was working on was more challenging."}], [{"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 5, "Senior Management": 0, "review_title": "Who’s the boss?", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "6 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Professional, demanding, good reputation and a great place to learn. Good salaries.", "cons": "Little if any opportunity for advancement. New CEO (no longer Frances Beinecke who was great) is absent and lacks vision. Zero leadership.  Mostly privileged, Ivy League staff so little focus on equity."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Program Assistant", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Dec 2016", "job_title": "Program Assistant in Washington, DC", "duration": "N/A", "pros": "Highly respected organization. Staff are deeply invested in NRDC's work. Brilliant people, who for the most part are very kind and fun.", "cons": "Limited upward mobility for PAs, who generally move onto some other organization or graduate school after ~2 years at NRDC."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "NRDC is comprised of a number of passionate advocates for our most precious resources.", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Jan 2012", "job_title": " in New York, NY", "duration": "N/A", "pros": "If it's important to be an environment where the organization practices what it preaches then NRDC might be for you.", "cons": "I cannot think of a substantial con that is worthy of passing on.  NRDC faces similar issues that most not-for-profits face i.e. depressed salaries, some antiquated tech"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "NRDC is the best workplace around -- enables each and every person to do the Lord's work.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "31 Aug 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Positively uplifting -- protecting our planet and futre generations...!", "cons": "It is subject to the ups and downs of th economy, and too dependent on a few, individual large-donors."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": "N/A", "review_title": "Great!", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Mar 2016", "job_title": "Legal Intern in Lawndale, CA", "duration": "N/A", "pros": "Everyone makes you feel welcome, even as an intern! They highly include their interns in \"real\" work, and not just basic tasks", "cons": "More diversity and inclusion would be great! Seems hard to talk about enviro justice when the people that work there are hardly a representation of the communities they are trying to advocate for."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Fantastic", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Mar 2018", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "As a two year fellowship, this position at NRDC was fantastic. The projects were innovative and the energy of staff (lawyers, scientists, analysts, others) was motivating. Loved it! Wished they had more offices around the US.", "cons": "None that I can think of at this time."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great Summer Internship", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 Oct 2015", "job_title": "Intern in Beijing, Beijing", "duration": "N/A", "pros": "Amazing staff, full support from management, flexibility for interns to pursue projects", "cons": "My internship was funded through my graduate school and there was very minimal compensation through NRDC. Outside of that, know that what people say about how bad the air quality is in Beijing is true."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Distractions in the Office", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Aug 2018", "job_title": "Anonymous Employee in Chicago, IL", "duration": "N/A", "pros": "Great place to work. Passionate and dedicated people who are smart and fun. NRDC works on really interesting and important projects.", "cons": "In the Chicago office, there is a modified open floor plan i.e. short cubicles. The noise from everyone else and the distractions are sometimes hard to overcome."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "Wonderful organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Dec 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "NRDC is a very fulfilling organization. The staff are extremely talented and intelligent, and they all put those wonderful traits to good use by working to protect the environment.", "cons": "Salary is better than many companies, but still non-profit level."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Decent, but riddled with looming problems", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Feb 2016", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Great pay for the nonprofit sector, good work/life balance, friendly people", "cons": "Department issues, structure, and lots of dept vs dept battles"}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great environmental nonprofit", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Entrepreneurship encouraged, some of the smartest colleagues, opportunity to work on groundbreaking issues, great benefits and flexibility of where and when you work (especially for working moms),", "cons": "Professional development and management training need more investment, not always opportunities to move up due to long tenure of staff"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Excellent office environment, genuine passion for company mission, excellent work/life balance", "cons": "Growth opportunities are somewhat limited."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "NRDC Scientist", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Aug 2010", "job_title": "Senior Scientist in Washington, DC", "duration": "N/A", "pros": "I believe in the mission of NRDC, and all the staff are extremely competent and professional.", "cons": "Advancement may be slower than in government."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 5, "review_title": "Awesome attorneys, nice office", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Jan 2015", "job_title": "Legal Intern in New York, NY", "duration": "N/A", "pros": "The attorneys are inspiring, enthusiastic, intelligent and passionate. Some have made huge contributions to the planet and its inhabitants. I cherish all the knowledge and litigations skills learned here.", "cons": "Even with monumental wins that amazingly help society, pay out seems weak..."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Challenging work for great cause", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "20 Mar 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Lots of smart over-achievers. \r\nCome prepared to work hard without much guidance.", "cons": "Challenging workplace\r\nFast-paced\r\nYou make your own way here but there are some managers who encourage innovation.\r\nGreat for self-starters, challenging for those who expect to work in structured teams."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Smart and Inspiring role models", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 May 2016", "job_title": "Program Assistant in New York, NY", "duration": "N/A", "pros": "-- passionate work environment\r\n-- smart and talented co-workers\r\n-- supportive role models\r\n-- great learning experiences", "cons": "-- very little upward mobility"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Lots of great people", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "18 Nov 2019", "job_title": "Communications", "duration": "N/A", "pros": "Lots of great people work here, we do some great work and there's a commitment to being more inclusive, diverse and equitable.", "cons": "There are some bureaucratic issues and due to the size of the org, change can be slow."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great organization, great people", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Incredibly inspiring and brilliant group of people to work with. \r\nGenerous benefits package, matched 401k, great vacation and paid time off package.", "cons": "Not a ton of mid-level growth opportunity in the program departments, most entry-level hires seem to leave after a few years."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great Company - Great Co-workers", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Aug 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "- The work you do makes a substantial impact\n- Leadership looks out for employees \n- Your co-workers are team players\n- Great benefits", "cons": "- Difficult to be promoted without an advanced degree\n- Managers sometimes don't know how much work you do"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Neutral", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Editorial", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "NRDC does great, inspiring work, and the people there are amazing and committed.", "cons": "The communication within the organization is often non-existant, leaving contract workers and freelancers to often wonder where their next project is coming from."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great mission and colleagues", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Mission, smart colleagues, resources to get the job done", "cons": "Administrative staff are stretched thin"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Environmental", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Jun 2017", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Nice people focused on saving the planet and good intentions.", "cons": "Can focus too much on liberal elitist politics. Can be very hostile to pro business solutions."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Laid back work environment; not much opportunity to move up", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Jan 2013", "job_title": "Staff Attorney in Santa Monica, CA", "duration": "N/A", "pros": "Very entrepreneurial work environment \r\nGood work life balance", "cons": "Not very team oriented\r\nNot many promotion opportunities"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Incredibly powerful, but Program Assistant depends on superiors.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Dec 2014", "job_title": "Program Assistant in New York, NY", "duration": "N/A", "pros": "Incredibly intelligent colleagues who are passionate\r\nGood work/life balance\r\nSocial office", "cons": "You're not taken as seriously without a law/graduate degree\r\nDon't work enough with corporations"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great work environment!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "At NRDC you are surrounded by passionate and BRILLIANT people who deeply care about each other and the future of our planet.", "cons": "The work is 24/7 because everyone cares so deeply."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great Work Environment", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Apr 2020", "job_title": "Intern", "duration": "N/A", "pros": "NRDC did a lot to make the work environment as productive as possible. It was a relaxing work environment and a lot of important work was done", "cons": "Not much of an opportunity climbing up the ladder"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "A Great Experience!", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "- Always something to do and was given a lot of autonomy with my projects \r\n- Good pay for a DC internship", "cons": "- Didn't meet many other people in the office than my immediate boss"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Interesting work, great colleagues", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Aug 2019", "job_title": "Legal Fellow", "duration": "N/A", "pros": "Work on pressing issues, emphasis on writing, mentors for early-stage attorneys, office culture is collegial", "cons": "Do not have money to hire all fellows full-time, quality of projects and organization can vary by team"}, {"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Management can be horrendous (but depends on program)", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Dec 2014", "job_title": "Senior Analyst", "duration": "N/A", "pros": "Freedom to create your own projects", "cons": "Unfortunately, insufficient direction and management in some programs. Try to find out more about a given program before deciding."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Dec 2017", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Great benefits.  Competitive pay.  Collegial and smart staff", "cons": "Decision making is very challenging.  Silos and political internally."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Dec 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Very passionate coworkers, doing work that makes a difference.", "cons": "Big separation between higher and lower level staff."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Getting better", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 Aug 2020", "job_title": "Program Assistant II in Washington, DC", "duration": "N/A", "pros": "-New CEO Gina McCarthy \r\n-Committed to working towards diversity, equity, inclusion\r\n- the work is meaningful", "cons": "- Program Assistants not given many opportunities to advance in their careers within NRDC, resulting in high turnover."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "DC Office Program Assistant", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Dec 2015", "job_title": "Program Assistant II in Newbury Park, CA", "duration": "N/A", "pros": "Brilliant colleagues, fast-paced, positive working environment", "cons": "Little to no growth for Program Assistants out of that role and into a higher role."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Program Assistant", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Apr 2018", "job_title": "Program Assistant", "duration": "N/A", "pros": "Great cause; smart co-workers; dedicated staff", "cons": "Organization is not very well-run; programmatic silos"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Overall good place", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Mar 2019", "job_title": "Anonymous Employee in Cedar Rapids, IA", "duration": "N/A", "pros": "Supportive, fun, collaborative, nice, fair", "cons": "Competitive as times, but overall great."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Good place", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Feb 2020", "job_title": "Development Assistant in Newbury Park, CA", "duration": "N/A", "pros": "Nice people and a good work environment", "cons": "No upward mobility  for low level employees"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Intern", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great place to work and learn from, surrounded by professionals that are driven and have a wealth of knowledge in the field.", "cons": "Cannot think of any cons working in this organization."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great people, dysfunctional operation", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Everyone's passionate about the issues", "cons": "They're trying to break down the silos, but it hasn't worked very well"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Great values, confusing communication", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Aug 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Passionate people, professional atmosphere, dedicated cause.", "cons": "Breakdown in communication, lack of transparency with decisions, little support to grow."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Smart folks, good work environment.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Apr 2020", "job_title": "Campaign Manager", "duration": "N/A", "pros": "Employees are bright, driven, and mission-oriented. Industry-leading salaries help prevent constant staff turnover, a regular challenge for most non-profit organizations.", "cons": "There's always more work than time."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great nonprofit to work for", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Jan 2014", "job_title": "Program Assistant", "duration": "N/A", "pros": "- entrepreneurial spirit\r\n- good work/life balance\r\n- managers can be great mentors", "cons": "- limited growth opportunities\r\n- sometimes decisions get trapped in bureaucracy"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great organization with poor organization", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "A fantastic mission and wonderful organization with a long history of environmental wins", "cons": "Disconnected programs and disorganized, internal politics."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Intern", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Aug 2016", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "*Lovely working environment \r\n*My supervisor concerns about the intern experience \r\n*Challenging projects and learn a lot", "cons": "*Projects are not very organized \r\n*Lots of meetings"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": "N/A", "review_title": "Nice place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Everyone is incredibly passionate about their work.", "cons": "Processes are so collaborative it is hard to get a decision at times."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Base salary- Best experience work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Aug 2018", "job_title": "Senior Software Test Engineer in Tehran, Tehran", "duration": "N/A", "pros": "Prefect base salary - on-time payment salary - reward per 3 month", "cons": "Not Maturity of the development process\r\npoor management"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Aug 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The work you do has an actual impact and gives a sense of purpose", "cons": "None that I can think of."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Video Editor", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "They have a Great Mission statement", "cons": "Poor freelance policy and slightly, anti male."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Nice place to start", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great benefits and coworkers, great company culture", "cons": "Not much room to advance from entry-level"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "NRDC", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great mission with incredibly able and intelligent people.", "cons": "Not much room to move up."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 4, "review_title": "NRDC", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "1 Jun 2018", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Committed, smart, effective, family friendly, mutually supportive.", "cons": "It's a tough time to be fighting to protect health and the environment."}], [{"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Smart people, big place", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "16 Dec 2019", "job_title": "Program Director in San Francisco, CA", "duration": "N/A", "pros": "Smart people, advanced expertise, connected", "cons": "disparate management, too federally focused"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Great company with amazing culture", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "4 Mar 2019", "job_title": "Senior Systems Analyst in Kaunas", "duration": "N/A", "pros": "Culture, teamwork, traveling to exotic countries", "cons": "Salary could be higher, more training"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Excellent organization with a mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Jun 2019", "job_title": "Climate Fellow in Washington, DC", "duration": "N/A", "pros": "Most amazing and talented people", "cons": "Nothing really, it is a great place to work in"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Program Assistant", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Jul 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great co-workers. Nice team environment.", "cons": "Some of the management personnel could be better."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Friendly staff, good benefits", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Aug 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great co-workers, nice office, engaging work", "cons": "Low salaries for the level of work being done"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Full stack web developer", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Feb 2020", "job_title": "Full Stack Developer in Tehran, Tehran", "duration": "N/A", "pros": "Applicable Projects, New areas IT Problems", "cons": "Low Salary, Time-consuming projects as not part of project"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Lawyer", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Sept 2018", "job_title": "Environmental Lawyer in New York, NY", "duration": "N/A", "pros": "Great cause. Great benefits.", "cons": "Political infighting throughout departments."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Most effective environmental non-profit there is!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Jun 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Results-oriented, strong advocacy, dedicated staff.", "cons": "I don't have any to report."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Graphic Designer", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Sept 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "coworker are helpful, nice benefits, non profit great messages", "cons": "non profit, low salary, high tunrover,"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Associate", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Excellent organizational culture and good employee morale", "cons": "Salary  is not very appealing"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Great organization.", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good place to learn. Nice people.", "cons": "I was underpaid there. need to bring pc."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Good place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Apr 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great staff, very good HR and other departments.", "cons": "Lack of leadership and direction."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "A great work environment", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "-Great office culture\r\n-Very laid back\r\n-Mission-driven employees", "cons": "-Projects can move very slowly"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "intern", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "they treat interns as real staff", "cons": "there are none. love working here"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Internship", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Nice team, very relaxing working environment", "cons": "Not much independency to do project"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "good luck", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "11 May 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "great people to work with", "cons": "the way the hiearcy is setup"}]]