[[{"date": "5 Aug 2022", "title": "Physician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Grand View Health", "Interview Descriptions": "The interview was very conversational and easy going. Pleasant interactions with everyone involved. I felt like it was more of them just trying to get to know me rather than them asking very specific questions", "Interview Questions": "What are you looking for in a smaller hospital system "}, {"date": "27 Sept 2022", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Grand View Health (New York, NY) in Jul 2022", "Interview Descriptions": "Had a few interviews, never heard back from hr either way after sending a few emails.  She blatantly ignored me.  As a recruiter myself, it is very rude and inappropriate to at least not follow up with candidates you interviewed with whether you want to move forward or not.   They clearly have no respect for applicants or their candidates, shows they do not care. Move on to the next company that at least will get back to you and treat you like nothing.", "Interview Questions": "What do you see yourself contributing to us?"}, {"date": "16 Feb 2022", "title": "Interventional Radiology Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Grand View Health (Phila, PA) in Feb 2022", "Interview Descriptions": "Zoom interview with the manager and a nurse employee. Reviewed day to day tasks and procedures, on call requirement, appointment reminders, IV team, IR and other procedures. The job sounded great. The pay was pittance.", "Interview Questions": "Interest in field, background in nursing, ability to work in a fast paced environment "}, {"date": "5 Sept 2021", "title": "SURGICAL BILLING COORDINATOR Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand View Health (Skippack, PA) in Sept 2021", "Interview Descriptions": "Virtual interview during the work day.  I took my lunch break and stayed on premises.   Air conditioning was on.  I felt very uncomfortable not being at home for this interview.", "Interview Questions": "Where do I see myself in 5 years?"}, {"date": "24 Feb 2021", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand View Health (Perkasie, PA) in Feb 2021", "Interview Descriptions": "Very nice. Open doors to many opportunities. Great place to work at ! I recommend any position in grand view health ! No matter the position it is a great opportunity even for those not yet done with schooling they have many great positions and opportunities", "Interview Questions": "What made you choose grand view ?"}, {"date": "17 Aug 2020", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Grand View Health", "Interview Descriptions": "everyone was nice and efficient and was flexible with a difficult schedule. performed all interview virtual or over the phone due to pandemic. first interview was with HR representative than with the head of the department.", "Interview Questions": "Do i have any experience working with money?\nDo i have experience with different computer application"}, {"date": "20 Nov 2019", "title": "Certified Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Grand View Health (Sellersville, PA) in Nov 2019", "Interview Descriptions": "Applied online and received an e-mail within 1 week. Interviewed by HR then the department director. The expectations were very clear and she answered all of my questions. Very kind and efficient. Went on a tour afterwards.", "Interview Questions": "Why are you leaving your current job"}, {"date": "1 Nov 2020", "title": "Marketing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand View Health in Aug 2019", "Interview Descriptions": "A bit drawn out and some reschedules. Spoke with people at a variety of levels within the company which was helpful. Took longer than I would have liked. People were nice and generally friendly.", "Interview Questions": "If you could have dinner with one person living or dead, who would it be?"}, {"date": "5 Jun 2019", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grand View Health (Sellersville, PA) in Mar 2019", "Interview Descriptions": "Applied online. Email communication from HR. Met with HR . Then another day to meet with director. Not very personable or respectful of time management: Sat behind her desk and typed. Multiple day process.", "Interview Questions": "What didn't I work Med/Surg. before looking at a specialty area?"}, {"date": "14 Nov 2017", "title": "Patient Registrar Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Grand View Health", "Interview Descriptions": "Long.. had to wait for a phone call for them to interview me .. once interviewed it took about 4 weeks for them to call me back then another 4 weeks to get all the hr paper work finalized", "Interview Questions": "What are your goals in this work place "}], [{"date": "9 Feb 2017", "title": "Administrative Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grand View Health", "Interview Descriptions": "Was called within days of submitting my application. Had 1st intwrview just as quickly then was called back forb2nd interview. After HR performed their due diligence was extended an offer of employment.", "Interview Questions": "typical interview questions"}, {"date": "12 Jan 2016", "title": "Clinical Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grand View Health (Sellersville, PA) in Aug 2015", "Interview Descriptions": "slow, too many steps, had to come back several times to meet with different people, getting the offer was very difficult, seems that things are not in order and departments did not communicate well", "Interview Questions": "Tell us about your clinical skills"}, {"date": "25 Jun 2015", "title": "Nurses Aide Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Grand View Health (Sellersville, PA) in Jun 2015", "Interview Descriptions": "I got an email to ask if I wanted to interview and scheduled the same way. Brief meeting consisting of softball questions from HR, kicked up to the unit you applied for to interview with nurse manager(s) if she is satisfied with your answers. They give you a tour of the unit and a description of the job, but not much else. The whole thing took maybe an hour total. \r\n\r\nAs an aside, I didn't get an email or phone call to let me know if I had been chosen or not, which I found to be a bit unprofessional. I happened to find out on my own when I logged into the website to look for a status change myself. I know it's impossible to call each person who applies, but they should take the time to call people they had come in for interviews.", "Interview Questions": "Have you ever had to deal with a difficult patient, and if so how did you handle the situation?"}]]