[[{"date": "11 Jul 2023", "title": "Digital Archivist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oklahoma State University (Stillwater, OK)", "Interview Descriptions": "I was invited to a virtual video conference interview first. The questions revolved around who I was as a person and what I could bring to the position that others could not. They were very friendly and the interview was quick. I was invited back for an on-site interview that focused on what the university could offer me.", "Interview Questions": "What does an ideal weekend look like to you?"}, {"date": "4 Apr 2023", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Oklahoma State University (Stillwater, OK)", "Interview Descriptions": "nice experience with warm welcome. Interactive discussions with faculty and student. Interview includes presentation, individual meetings and campus tour. nice experience with warm welcome. Interactive discussions with faculty and student. Interview includes presentation, individual meetings and campus tour.", "Interview Questions": "How can you raise funds from agencies. What is your teaching style"}, {"date": "27 May 2023", "title": "Enterprise Systems Administrator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Oklahoma State University (Stillwater, OK) in Apr 2023", "Interview Descriptions": "I was contacted over a month after I submitted my application, and I decide to go through with the interview. The first interview was a fantastic process and I really got the sense that they have a wonderful culture in the IT Building. Most of the questions were designed to get an understanding of how I handle certain situations and interact with others. They gave me the questions beforehand to allow me to prepare, but the interview was just a barrage of questions one at a time and I was unable to shift it to more of a conversational exchange. The panel hit me with 25 prepared questions over all, but I really liked their answers to my questions. To prepare for this, I wrote answers for all of the provided questions and gave everyone handouts, which they seemed to love. Next, there were two interviews back to back. First with more senior employees asking about technical experience, and then with management and the IT director. Overall the process was drawn out for my tastes, with panel interviews having as many as a dozen or more interviewers each. Still, they appear to have a healthier work culture than most organizations. After everything was done, I was offered 40k salaried, bottom of the range. The offer would be acceptable for an entry level tech, but unfortunately came across as rather insulting for a level three IT position. I attempted to reach out and give them the benefit of the doubt that there may be a clerical error or miscommunication, but received no response, so I immediately accepted a much higher paying position from one of the other companies I had been interviewing with. The offer was really the nail in the coffin. I largely enjoyed the process despite small issues, but I have to keep my career interests in mind, and the salary offer was simply so low that I could not possibly afford to accept.", "Interview Questions": "Describe a time that you had to make a difficult decision? What makes a decision tough for you?"}, {"date": "21 Sept 2022", "title": "Research Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Oklahoma State University in Sept 2022", "Interview Descriptions": "It was on zoom for almost 1.5 hours and I was interviewed twice. In the first interview, I explained what qualification makes me the best fit for the position but in the 2nd one the recruiter explained why and what benefits I am going to get from joining their lab", "Interview Questions": "1. why should I hire you\n2. why do you want to work for this lab\n3. what are your salary expectations?"}, {"date": "10 Apr 2022", "title": "Claims Processor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oklahoma State University (Tulsa, OK)", "Interview Descriptions": "Great university culture diverse, nice, and professional.  The interview process is thorough and the people are adequately screened.  They will do a complete background check which can continue after the hire date.  Be prepared to offer transcripts.", "Interview Questions": "The interviewers will ask for specific previous job performance accomplishments and work details.  "}, {"date": "27 Jan 2022", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oklahoma State University", "Interview Descriptions": "Interview was okay. They asked questions that would help them know me better and see if I was a good fit for the position. It was not a super difficult one.", "Interview Questions": "What are some of your strengths?"}, {"date": "26 Oct 2022", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Oklahoma State University (Stillwater, OK) in Oct 2021", "Interview Descriptions": "After a screening interview there’s a panel interview, followed by a third interview in which you give a presentation. It’s a lengthy process for a position that pays so poorly.", "Interview Questions": "Please tell me about yourself."}, {"date": "15 Nov 2022", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Oklahoma State University (Stillwater, OK) in Jun 2021", "Interview Descriptions": "I went to find my current PI who was a professor of the food microbiology class I took during my undergraduate and asked for an opportunity to be a master's student in his lab. He didn't accept me at first time but instead, he talked about his future research plan for his master's candidates. He was really passionate about his research and willing to teach me the research concepts clearly. He was really understanding when I said I need some financial help with this program while I didn't have previous lab experience. I am so grateful that he accepted me to his lab with sponsership.", "Interview Questions": "which research project you are interested in? Do you have any previous experience?"}, {"date": "25 Mar 2021", "title": "Fan Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Oklahoma State University", "Interview Descriptions": "It was a great overall interview. There wasn't too many questions about what the job functions were but more how you could contribute to the team. This makes it easier for entry level workers or students to get interview experience.", "Interview Questions": "Name 3 weaknesses you have."}, {"date": "13 Mar 2021", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oklahoma State University", "Interview Descriptions": "Meet over the phone and then in person with manager and team. I also met with the main physician. I had prior experience in the field, so it wasn't too hard to answer his questions.", "Interview Questions": "Where do you see yourself in 5 years"}], [{"date": "14 Oct 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 5 months. I interviewed at Oklahoma State University (Stillwater, OK) in Nov 2020", "Interview Descriptions": "You have to take a class before you can even interview. Then you need to make a project to present to around 15 people in groups of 3, during this process all the other students that took the class will also be presenting. So you're going to have to be engaging to grab some attention. After that, if they are interested they will have you interview with two supervisors. They will ask you about your people skills and how you will engage other poeple.", "Interview Questions": "What are some of your values? How do those values affect your actions?"}, {"date": "11 Sept 2020", "title": "GTA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Oklahoma State University", "Interview Descriptions": "Straight forward meeting with professors. The professor asked about my general background and some course-related question. Straight forward meeting with professors. The professor asked about my general background and some course-related question.", "Interview Questions": "General knowledge about the course materials"}, {"date": "19 Nov 2022", "title": "Unit Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oklahoma State University in Sept 2020", "Interview Descriptions": "Online application requiring references, during covid had a virtual interview. Employee orientation was great. The staff was very involved in making new hires feel welcome. Good benefits and good working environment.", "Interview Questions": "How much experience with health care"}, {"date": "28 Jan 2021", "title": "Apartment Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Oklahoma State University (Stillwater, OK) in Sept 2020", "Interview Descriptions": "The interview process was very straight forward. They push the family atmosphere, which is very true. They laid everything out for extreme transparency. Overall, very a great interview. They are very trustworthy.", "Interview Questions": "Flexibility was the main priority"}, {"date": "3 Mar 2020", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Oklahoma State University", "Interview Descriptions": "Share your interview experience insights with job seekers so that they can know what to expect from the hiring process We review and approve every submission against  Share your interview experience insights with job seekers so that they can know what to expect from the hiring process", "Interview Questions": "experience"}, {"date": "28 Jan 2020", "title": "Dispatcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Oklahoma State University (Columbus, OH)", "Interview Descriptions": "interviewed with 2 people asking typical interview, explained the job expectations and hours needed   questions after interview, called to notify job offer ,set up appointment for drug test, and background check", "Interview Questions": "experience"}, {"date": "25 Nov 2019", "title": "Scholarship Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 weeks. I interviewed at Oklahoma State University", "Interview Descriptions": "I came to CEAT and interviewed in front of SIX individuals that work closely with the position. The people were situated around a long conference table and every one went around the table and asked their questions. ALL. EYES. ON. YOU. Three weeks after the interview I haven't even received a call saying I didn't get the position. If they don't like you don't expect any future professional communication. They just leave you hanging and wondering. I think it's safe to say three weeks after, I didn't get the job but it's unprofessional not to communicate such things to me, even via email. I have sent two follow-up emails and no reply.", "Interview Questions": "Name some thing's that have prepared you to succeed in this position."}, {"date": "7 Oct 2019", "title": "Student Services Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oklahoma State University (Stillwater, OK) in Sept 2019", "Interview Descriptions": "1st interview was conducted via skype (conference call was also offered) with a 3 person panel consisting of hiring manager, manager from a different department, and a peer level employee. Very casual 1st interview, focused primarily on basic qualifications and logistical pieces (i.e. does the schedule work for you). \r\n\r\n2nd interview was conducted in person and on campus, with the same panel. Much more formal and focused on personal strengths weakness and what I brought to the position. Interviewer also requested I prepare a 10 minute presentation for the panel to demonstrate my presentation abilities. Interview concluded with brief tour of the department. \r\n\r\nManager contacted me the following week with a formal offer.", "Interview Questions": "How would you respond to conflict among different departments? "}, {"date": "7 May 2019", "title": "Patient Account Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Oklahoma State University", "Interview Descriptions": "Phone interview very sweet lady... Very attentive and concerned with answering my questions. This writing thirty words is more stressful than the phone interview and your website refuses to allow me to move along with this process until I complete this process", "Interview Questions": "If hours would work "}, {"date": "4 May 2019", "title": "Observer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oklahoma State University", "Interview Descriptions": "Short and sweet. direct questioning about my experience. Asked about my hope for the future.\r\nHow did I feel looking at life ling term. What would be my contribution to the company.", "Interview Questions": "why "}], [{"date": "7 Sept 2021", "title": "Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Oklahoma State University (Stillwater, OK) in Mar 2019", "Interview Descriptions": "very casual atmosphere with tour interview at the end. They really wanted to see how you would interact with prospective students and get to know you as a person. Definitely my favorite interview!", "Interview Questions": "Why did you chose Oklahoma State University"}, {"date": "17 Sept 2020", "title": "Recruitment Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oklahoma State University (Oklahoma City, OK) in Jan 2019", "Interview Descriptions": "The interview process is fairly simple. Consists of a 2-step interview process, 1. is a phone call interview and 2nd is in-person or via Zoom. A eight - ten minute presentation is required to present simulating an audience of prospective students or families.", "Interview Questions": "How do you manage workload in a fast paced environment?"}, {"date": "9 Feb 2023", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Oklahoma State University (Stillwater, OK) in Jan 2019", "Interview Descriptions": "Smooth and well organized. Faculty members are very friendly and students are very nice. The entire interview process is well organized. The interview is 2 day long and very compacted with meetings with every faculty in the department and dean from the Colleage.", "Interview Questions": "Research plan and teaching plan"}, {"date": "7 Dec 2018", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Oklahoma State University (Tulsa, OK) in Sept 2018", "Interview Descriptions": "It was not difficult. They concentrated on SAS and visualization skills. They focussed on approach to problems. The questions were not too technical. Be confident in answering, you will get through the interview.", "Interview Questions": "1. Some SAS projects\r\n2. best accomplishment\r\n3.toughest task\r\n4.they checked communication skills"}, {"date": "19 Sept 2018", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Oklahoma State University (Stillwater, OK) in Aug 2018", "Interview Descriptions": "It was super short and was based off teacher referral that worked for the department. All I needed to do was sell myself and make sure that my schedule allowed me to perform TA activities and grading.", "Interview Questions": "What is your class schedule"}, {"date": "28 Jun 2019", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 2 weeks. I interviewed at Oklahoma State University (Stillwater, OK) in Aug 2018", "Interview Descriptions": "We just had to submit application and then the professor would have to choose the students that they wanted to work with as their teaching assistants, after the application is submitted, the selected students would be notified by an email to let them know that they have been selected, finally, a meeting with the professor to go over the job requirements.", "Interview Questions": "N/A"}, {"date": "31 Mar 2019", "title": "Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Oklahoma State University (Stillwater, OK) in Aug 2018", "Interview Descriptions": "I got the Job on the spot from a previous math professor who knew my capabilities and knew me personally from 2 of her other prior classes. She also knew that I have all A's in my prior math classes.", "Interview Questions": "What is your availability and hours"}, {"date": "20 Jul 2018", "title": "IT Helpdesk Phone Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Oklahoma State University", "Interview Descriptions": "It is a very laid back and relaxing process. The entire interview is casual and not stressful or intimidating. They jump right into asking questions about customer service and how comfortable you are walking people though steps over the phone. They also test your tech knowledge but say you don’t need to have the knowledge but you need customer service.", "Interview Questions": "How would you assist a customer with finding their IP address. "}, {"date": "14 Jan 2020", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Oklahoma State University (Stillwater, OK) in Jul 2018", "Interview Descriptions": "It was just an online application that included an essay. I believe it went to the graduate coordinator of the school. It was a fairly easy process from what I remember. It led to a great position.", "Interview Questions": "Why I would like to be a GTA"}, {"date": "23 Oct 2019", "title": "Community Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2+ months. I interviewed at Oklahoma State University (Stillwater, OK) in Feb 2018", "Interview Descriptions": "First, you must take an eight week class. Then there is a two part interview with Residential Life. Then you get review questions after. After that, they email you if you are placed.", "Interview Questions": "How would you be a great Community Mentor"}], [{"date": "8 Mar 2021", "title": "Customer Service Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Oklahoma State University (Stillwater, OK) in Feb 2018", "Interview Descriptions": "Mostly behavioral questions and a few situational that applied to the job. They want to know how you react to certain situations that may come up or how well you will be able to interact with patrons. They are highly focused on good customer service and being able to react under pressure.", "Interview Questions": "Tell me about a time you stepped up as a leader."}, {"date": "13 Oct 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Oklahoma State University (Stillwater, OK)", "Interview Descriptions": "Presentation to the interview committee. Interview experience insights with previous job expect from the hiring process. It was very helpful to attend the procedure . completely different what what I attended before", "Interview Questions": "Explain about you previous work and achievements"}, {"date": "27 Aug 2017", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Oklahoma State University", "Interview Descriptions": "Fairly long process of panel interviews, presentations and Q&A with various members. The panel was great to work with but the HR team seemed difficult to negotiate with and ultimately was turned off from my interactions with HR.", "Interview Questions": "Q: How do you find more qualified applicants that fit our criteria for admission?"}, {"date": "17 Dec 2017", "title": "Security Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oklahoma State University (Oklahoma City, OK) in Aug 2017", "Interview Descriptions": "I applied online and was contacted by phone about a week later. I interviewed later that week with the director and was hired on the spot.  The interview as very relaxed and friendly. I started the next week after I completed the background check.", "Interview Questions": "Imagine that you are in the middle of unlocking a building when you get two phone calls: (1) a professor in the same building needs you to unlock a classroom for him and (2) a librarian is requesting that you could escort her to her car. What order to you complete each task in?"}, {"date": "3 Nov 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Oklahoma State University (Oklahoma City, OK) in Aug 2017", "Interview Descriptions": "I heard it was open, mentioned it to someone as was encouraged to apply even though I wasn’t really qualified.  There was one group interview where a committee asked set questions from a list. Then later I had a one-on-one interview with an administrator.", "Interview Questions": "Explain diverse students"}, {"date": "5 Jun 2017", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oklahoma State University", "Interview Descriptions": "Applied online and then I was brought in to the LASSO center for an interview. Interview was informal and short, pretty easy to get through and pretty easy to talk to the interviewer.", "Interview Questions": "What would you do if a student came in unprepared?"}, {"date": "3 Apr 2019", "title": "Front Desk Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Oklahoma State University (Stillwater, OK) in Jun 2017", "Interview Descriptions": "It was an easy phone interview. They asked me about my past experiences and about my qualities. Once you get hired you can work as a desk clerk until you graduate if you like the job.", "Interview Questions": "Experiences"}, {"date": "24 May 2017", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Oklahoma State University", "Interview Descriptions": "Relaxed. Had an interview the same day that I was called to set an interview up. It was me and one other person in the room and he had a copy of my resume and asked me questions about my previous work experiences. I was offered the job on the spot and started work immediately.", "Interview Questions": "They asked about how well I interact with people"}, {"date": "16 Mar 2018", "title": "Senior Lab Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Oklahoma State University (Stillwater, OK) in Mar 2017", "Interview Descriptions": "The manager will set up a time and date to come in. You will sit with the lab manager, section head, and HR manager. Routine questions on back ground and experience.", "Interview Questions": "What is your lab experience."}, {"date": "10 Feb 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Oklahoma State University (Oklahoma City, OK)", "Interview Descriptions": "1st interview met with boss and 4 other women whom the position would work with. They asked about my experience, what I had to offer and why I wanted the position. 2nd interview was one on one with boss and boss' boss. Was asked about personal experience, explains the type of person they were looking for. Also was asked a few personal questions.", "Interview Questions": "What is your experience with handling payments?"}], [{"date": "26 Mar 2019", "title": "Tech Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Oklahoma State University (Stillwater, OK) in Jan 2017", "Interview Descriptions": "It was a very casual interview. They asked me questions like my background, why I wanted to be there, but basically was interested in my personality. The lady was great and very easy to talk to.", "Interview Questions": "Why do you want to be here?"}, {"date": "12 Dec 2017", "title": "HR Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oklahoma State University (Oklahoma City, OK) in Jan 2017", "Interview Descriptions": "Pretty easy. Standard questions. Talked about the positions. Talked about the benefits. Met the other employees. yeah. Great boss and made the interview feel very comfortable . IM not writing 30 words this is stupid", "Interview Questions": "Pretty easy. Standard questions "}, {"date": "10 Feb 2020", "title": "Instructional Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oklahoma State University in Aug 2016", "Interview Descriptions": "Brief interview followed by presentation. 2 members asked questions. Asked me about my technical experience, training experience, some behavioural questions , some technical questions and experience in ed tech tools", "Interview Questions": "Strengths/weakness, why this job.."}, {"date": "4 Jan 2017", "title": "Student Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oklahoma State University (Stillwater, OK) in Aug 2016", "Interview Descriptions": "The process was smooth. After applying online for the job, I was called within a week for an interview.\r\nThe whole hiring process took about a fortnight. There were two people taking my interview and it was a comfortable environment to be in for an interview.", "Interview Questions": "How will I deal with a student who does not seem to focus during the tutoring appointment?"}, {"date": "21 Mar 2019", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Oklahoma State University in Apr 2016", "Interview Descriptions": "Very comfy well researched. They did their homework reading my cv and I did mine. Taught  a class, toured the facilities, and visited the town. Met with several faculty over 3 days.", "Interview Questions": "How to deal with a difficult student?"}, {"date": "24 Feb 2016", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Oklahoma State University", "Interview Descriptions": "I went in, and was interviewed by three people: two supervisors, and one potential co-worker, who ended up being a trainer. I went into the conference where I was asked a series of questions from everyone on the room. It was a very relaxed process, many questions coming from the resume that I had submitted before hand. I believe it was ten minutes in total.", "Interview Questions": "How do you keep organized?"}, {"date": "6 Sept 2017", "title": "Computer Support Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oklahoma State University (Tulsa, OK) in Jan 2016", "Interview Descriptions": "Basic computer knowledge is tested. It is like an any other interview. It had 3 rounds. Your knowledge is tested in th e field of computers. And few questions were asked wherein you have to tell the solution for any computer related problems", "Interview Questions": "Do you have previous experience in this field"}, {"date": "5 Oct 2016", "title": "Computer Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Oklahoma State University (Stillwater, OK) in Dec 2015", "Interview Descriptions": "Resume screening followed by in person interview. Resume is very important and plays a vital role. Personal will be 50% behavorial and 50% techincal. very good. ice experience,. Resume screening followed by in person interview. Resume is very important and plays a vital role. Personal will be 50% behavorial and 50% techincal. very good. ice experience", "Interview Questions": "About my experience"}, {"date": "18 Dec 2017", "title": "Sales Associate/Cashier Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Oklahoma State University (Stillwater, OK) in Dec 2015", "Interview Descriptions": "Sat down with my manager to talk about where I could see myself working, how many hours, my availability and desire to work. Manager asked me about my previous work experience and told my about what kind of job I would be doing working as a stocker/cashier as well as a barista.", "Interview Questions": "My previous work experience"}, {"date": "26 Jun 2017", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Oklahoma State University (Stillwater, OK) in Dec 2015", "Interview Descriptions": "I applied for the graduate teaching assistantship on the library's website, and got a phone call to schedule and interview about a week later. My professor put in a good word for me because he knows a lot of library faculty. I was able to interview the next day. Most of the questions have to do with how you would handle certain scenarios, your teaching experience (no experience required), your communication style, and your available hours.", "Interview Questions": "How do you usually communicate with coworkers?"}], [{"date": "16 Feb 2017", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Oklahoma State University (Stillwater, OK) in Dec 2014", "Interview Descriptions": "First, discussion about my interests and previous engineering research experience; Second, they showed the lab facilities and what they do; Third, asked about my interest to work with this research and views about the facilities", "Interview Questions": "Do you have research experience ?\r\n"}, {"date": "26 Jan 2015", "title": "Clinical Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Oklahoma State University (Columbus, OH) in Nov 2014", "Interview Descriptions": "Qucik turnaround.  Easy interview process.  The interview, offer and acceptance within 3 weeks.  Everyone was very positive and upfront about expectations.  Met with hiring manager and HR recruiter.  Overall one of the best interviews.", "Interview Questions": "Asked about technical background."}, {"date": "1 Oct 2015", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Oklahoma State University (Stillwater, OK) in Nov 2014", "Interview Descriptions": "2 Interviews. First was a group interview with about 20 students (prospective employees) and 10 faculty and current tour guides. There were 150 prospective employees and there were 30 spots for the round two interviews. During the round two, you are asked to give a \"tour stop\" audition as you would if employed. Email received to either get or dont get the job.", "Interview Questions": "If you could have dinner with one OSU figure, who would it be?"}, {"date": "16 Jul 2018", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Oklahoma State University (Stillwater, OK) in Oct 2014", "Interview Descriptions": "Instance based no technical interview they were asking to give examples of all situations like how did u do when u failed. how did u learn new things , are u self motivator", "Interview Questions": "what did u do in previous job"}, {"date": "12 Oct 2017", "title": "GRA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Oklahoma State University (Stillwater, OK) in Sept 2014", "Interview Descriptions": "Got a call through referral. Project head took the interview. Interview took place at department . It was easy one.It was mostly behavioral type. He was looking to perform without guidance.", "Interview Questions": "Asked me to explain the past project and role"}, {"date": "11 Jun 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Oklahoma State University (Stillwater, OK) in Aug 2014", "Interview Descriptions": "Position is based on GPA. I got a phone call from the business school offering the position of Graduate Teaching Assistant. They only call students who have a good GPA (Mine was 3.7 at the time). Many positions are available you just need to do well in the first semester. I would recommend getting a 4.0 and then just wait for that call.", "Interview Questions": "The only question was, are you interested in this position?"}, {"date": "14 Aug 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Oklahoma State University (Stillwater, OK) in Aug 2014", "Interview Descriptions": "It was behavioral interview, based on our past experience dealing with students and communication skills, on campus activities etc., I got a mail from College of Engineering Architecture and Technology office to meet Professor in his room. There were 6 other students like me in his office to discuss about roles, our past experiences and things like that. We were told that we would get an email or call if we got selected for the position. I got a mail saying so and asked me to come in for the paper work next day.", "Interview Questions": "Do you have experience in dealing with students?"}, {"date": "9 Jan 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Oklahoma State University (Stillwater, OK) in Aug 2014", "Interview Descriptions": "Get good grades and you will be assigned a Graduate Teaching assistant job or Graduate Research Assistant job easily. If needed in first semester, you might have to do thesis or have prior experience in teaching. Also should have cleared TOEFL with a speaking score of more than 26 or should have cleared ITA exam with a score of 250 at the University.", "Interview Questions": "Do you know to work in VBA?"}, {"date": "28 Jul 2014", "title": "Carpenter Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Oklahoma State University (Stillwater, OK)", "Interview Descriptions": "I received and email shortly after applying for the job to schedule an interview. The actual interview took only 15 minutes. I met in a conference room with only two other people. Both were very friendly, and the questions were not very hard. The dress was business casual, although that was probably overdressed.", "Interview Questions": "They looked over my resume and asked me questions based on it."}, {"date": "8 Jul 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Oklahoma State University", "Interview Descriptions": "Met the professor directly and handed the resume. after some questions of skills and a week time, I got selected. The main questions are regarding the undergraduate project and the corses.", "Interview Questions": "Are you familiar with the laboratory testing and field testing of the soil"}], [{"date": "9 Jun 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Oklahoma State University", "Interview Descriptions": "The first interview was with a panel of four people from the department and people who work closely with the department, including the direct supervisory.  The interview was structured with a specific list of questions prepared in advance.  The second interview was with the same panel of four, and they allowed plenty of time for my questions and more open-ended dialogue.", "Interview Questions": "All the questions were fairly standard and predictable.  "}, {"date": "31 Aug 2015", "title": "Scanning Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Oklahoma State University (Stillwater, OK) in Jun 2014", "Interview Descriptions": "1 round interview. Questions on your previous experience and behavioral questions on how to handle phone calls (Angry customers etc.)\r\nStrengths and weakness.\r\nQuestions on Time Management (How do you plan to manage studies and work while aiming to maintain a good GPA? ).", "Interview Questions": "Previous working experience on scanners and their troubleshooting. Basic troubleshooting on Windows O/S."}, {"date": "27 May 2014", "title": "Lab Manager Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Oklahoma State University", "Interview Descriptions": "First was called for a phone interview...lasted 45 minutes.  Within two days asked for a face to face interview...lasted 90 minutes.  Was contacted within a week to be told they were pursuing another candidate.", "Interview Questions": "What is your biggest failure"}, {"date": "17 Sept 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Oklahoma State University in Mar 2014", "Interview Descriptions": "I heard nothing from the graduate program, but received an e-mail about available assistantships. I applied to each department individually and scheduled Skype interview. I was interviewed with a panel consisting of full staff members as well as students. Everyone was invited to ask questions and afterwards, I was allowed to ask questions. Everyone was very honest about responsibilities, time commitment and difficulties.", "Interview Questions": "Describe a time you failed and what you learned from that experience."}, {"date": "27 Feb 2014", "title": "Zumba Instructor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Oklahoma State University", "Interview Descriptions": "First, I took a Zumba certification course. Once I had my certificate, I notified the head of group fitness at the Colvin Center, and he signed me up for try-outs. I had to teach 3 songs in another instructors class and a few days later, I did my 3 songs in front of the \"judges.\"", "Interview Questions": "N/A"}, {"date": "7 Feb 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Oklahoma State University (Stillwater, OK)", "Interview Descriptions": "The award process is completely based on your application. Given the low number of applicants, I'd say you're almost guaranteed funding (within reason) if you apply.", "Interview Questions": "The most difficult questions are simply those on the application. There is no true \"interview.\""}, {"date": "18 Apr 2018", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Oklahoma State University (Oklahoma City, OK) in Feb 2014", "Interview Descriptions": "Panel interviews. Let them know you like to read! Make sure you are all about diversity and being on time! It helps if you are a minority. Dress like a professional.", "Interview Questions": "Behavior questions"}, {"date": "14 Mar 2016", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Oklahoma State University (Stillwater, OK) in Feb 2014", "Interview Descriptions": "Submit application and cover letter specifying your interest and goals, and if you meet their expectations you may be offered a position. I essentially visited the university after an offer was made, and they did a great job of organizing a custom itinerary for me, in which I was lead around the campus and department by various other graduate students and faculty members. It really gave me a feel for what it would be like to work here.", "Interview Questions": "N/A"}, {"date": "4 Jan 2014", "title": "Cusrodian I Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Oklahoma State University (Stillwater, OK)", "Interview Descriptions": "Must go through the website to apply. The interview was quite relaxed, but the background check and other considerations took a month before I could start.", "Interview Questions": "It was pretty strait forward."}, {"date": "23 Dec 2013", "title": "Extension Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Oklahoma State University", "Interview Descriptions": "Two-tiered system.  Applicant pool interview is a no-brainer and basically if you know someone within the system its a shoe-in.  Its important to get qualified for all subject areas up front otherwise there is no opportunity to move to a slasher position down the road.  Specific site interviews ask basic questions and see how you would fit within the office structure.", "Interview Questions": "Who would you include in your stakeholder panel?"}], [{"date": "2 Feb 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Oklahoma State University (Stillwater, OK) in Dec 2013", "Interview Descriptions": "Fairly easy. I was on my 2nd semester as a master's student in the department of Mechanical and Aerospace engineering in Oklahoma State University. I received an email from the department asking if I was interested in a research position with the thermal systems department. This was my area of interest so I agreed. The interview was rather simple as the professor remembered me as one of the more active students in class and offered me the job straight away.", "Interview Questions": "They asked me about my interest in Thermodynamics and Heat transfer"}, {"date": "14 Jun 2017", "title": "MLSC - Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Oklahoma State University (Stillwater, OK) in Aug 2013", "Interview Descriptions": "First, we need to take an exam where you need to get 90% at least. Later, you will be called for an interview and this will be taken by the MLSC (Mathematics Learning and Success Center) Director and few coordinators. You will be tested mainly in your teaching skills and math concepts. A pro tip is to keep thinking how to make a complicated concept easy to understand.", "Interview Questions": "Explain the concept of domain and range in a plane?"}, {"date": "17 Jul 2013", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Oklahoma State University", "Interview Descriptions": "I am an international student and I was granted the opportunity to work based on my prior experiences and my GRE score. I am enrolled in Management Information Systems department and it has an automated system which does not accept applications but looks up its database of enrolled students and grants the deserving student of the position.", "Interview Questions": "As it was an automated process I was not asked any question and they selected me based on my resume."}, {"date": "28 Apr 2015", "title": "Student Computer Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at Oklahoma State University (Stillwater, OK) in May 2013", "Interview Descriptions": "The interview was quick as I was recommended by a previous employee. They showed me various computer parts and I told them what they were. They were very patient and willing to train me on the specific technologies they used on a daily basis and allowed ample time to get acclimated to their environment before expecting a lot out of me.", "Interview Questions": "They asked if I had experience building computers."}, {"date": "19 Apr 2013", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Oklahoma State University", "Interview Descriptions": "Due to the dueling egos in the Department to which I was applying I had to interview with people with whom I would never work for and rarely interact with.  Thus, I had two more interviews than were necessarily. They interview with my boss to be lasted about 10 minutes.  You could tell he was far too busy to be bothered with much of an interview. He basically glanced at my resume, asked me two questions and then said, \"I think you can do the job.  I had to wait three more weeks and suffer through five more interviews (two of which were unnecessary).", "Interview Questions": "There were only two questions. Both were typical questions and not difficult.  This was I believe, and atypical interview for OSU. "}, {"date": "16 Apr 2012", "title": "Technologist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Oklahoma State University (Columbus, OH) in Mar 2012", "Interview Descriptions": "I must say there is a serious lack of professional courtesy with OSU. They told me they'd get in touch with within two weeks and that time period has doubled with no call, no email, nothing. I drove over an hour for them to say my lack of experience would require more training on their behalf. It was clear as day on my resume that I am a new grad with all the right qualifications. New grads Beware. Don't waste your time or your gas.", "Interview Questions": "What brands of equipment did you work on?"}, {"date": "15 Aug 2013", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Oklahoma State University (Stillwater, OK) in Jan 2012", "Interview Descriptions": "approached the professor, told him about my technical skills and achievements and he was pretty impressed with the paper presentation at higher level.", "Interview Questions": "Are you ready to work for more than what is needed?"}, {"date": "22 Mar 2016", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Oklahoma State University (Stillwater, OK) in Jan 2012", "Interview Descriptions": "Never had like an interview process, my boss had noticed my work through different volunteering opportunities. he gave me a call and asked me to come discuss my schedule with him to come work for him at his office.", "Interview Questions": "How would you like to come work for me starting monday?"}, {"date": "19 Jan 2012", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Oklahoma State University (Stillwater, OK) in Nov 2011", "Interview Descriptions": "Straight forward. Just sit down and answer a few questions.", "Interview Questions": "N/A"}, {"date": "22 Jan 2014", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Oklahoma State University (Stillwater, OK) in Oct 2011", "Interview Descriptions": "easy personal interview!!", "Interview Questions": "What would you do if your'e co worker is not doing his part"}], [{"date": "15 Aug 2015", "title": "Assistant Director of Dining Services Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Oklahoma State University (Stillwater, OK) in Aug 2011", "Interview Descriptions": "Initial Phone interview with Director and head of Human Resources, Second Interview with the Assistant Vice President for the University, and the Assistant Director of the Student Union. Round table interview with all of the Managers, one at a time and then all at once. Computer Competency test. Tour of the facilities. Whole process lasted 10 hours.", "Interview Questions": "What makes you think that you are a good fit for this position ?"}, {"date": "2 Jun 2015", "title": "IT Department Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2+ months. I interviewed at Oklahoma State University (Tulsa, OK) in Jul 2011", "Interview Descriptions": "Called me for an interview, over a month after I'd applied. I'd already gotten another job that I'd had for a month. Asked ridiculously technical questions, well beyond the level/position I'd applied for. Male interviewer seemed out of touch, using pretentious language -as if to impress with extensive vocabulary, or attempting to test candidate with uncommon communication (not IT jargon). Offered job about another month and a half later.", "Interview Questions": "Greatest weakness"}, {"date": "2 May 2012", "title": "Research Assist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Oklahoma State University (Stillwater, OK) in Jan 2011", "Interview Descriptions": "Asked about yourself", "Interview Questions": "Tell me about yourself"}, {"date": "22 Jan 2012", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Oklahoma State University (Stillwater, OK) in Jan 2011", "Interview Descriptions": "First you have a phone call to see if you are available to work on the break. If ou are they intevriew ou further.\r\n\r\nou. have an interview with about 5 or 6 employees that take care of the labs. the questions are only on internet, printting and computer troubleshooting. But they also involve how you deal with your co workers.", "Interview Questions": "how would you deal with and amployee that does no work?"}, {"date": "3 Aug 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Oklahoma State University (Stillwater, OK) in Jan 2011", "Interview Descriptions": "I was interviewed by the lab director and then Ph.D candidate working at the lab. The questions basically revolved around my project work. The interview panel then proceeded to ask me questions on my experience in energy engineering. I had been on one of the site visits for an industrial audit with the crew working at the lab. I was asked questions on my experience during the site visit (eg. what could have been done differently etc.)", "Interview Questions": "Basics on thermal engineering, lighting technology, and industrial processes"}, {"date": "15 Oct 2011", "title": "Computer Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Oklahoma State University (Stillwater, OK) in Oct 2010", "Interview Descriptions": "The interview was easy.", "Interview Questions": "What is the project you have done?"}, {"date": "12 Apr 2013", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Oklahoma State University (Columbus, OH) in Aug 2010", "Interview Descriptions": "Went over publications", "Interview Questions": "It was a really easy interview, but it may depend on a case"}, {"date": "4 Mar 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Oklahoma State University (Stillwater, OK) in Aug 2010", "Interview Descriptions": "I had to talk to the graduate advisor and he recommended me to talk to a professor of my field", "Interview Questions": "What is the most important function of platelets?"}, {"date": "13 Jul 2010", "title": "Web Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 2 weeks. I interviewed at Oklahoma State University (Stillwater, OK) in Jun 2010", "Interview Descriptions": "Registered online on the jobs page\r\nReceived a call from a nice sounding lady to setup an on-site interview. There were no phone interviews involved. Apparently they invite all candidates to the on-campus location.\r\nMajority of the questions were HR type and hardly any technical", "Interview Questions": "Why do you want to work here after finishing your Masters"}, {"date": "23 Aug 2011", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Oklahoma State University (Stillwater, OK) in Jan 2010", "Interview Descriptions": "I was recommended by my friend as I have the skill set to take up the job. Looking at my profile, the supervisor gave me the offer", "Interview Questions": "N/A"}]]