[[{"date": "19 Apr 2023", "title": "Psychologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UMBC", "Interview Descriptions": "straighforward, questions were relevant to the position. Group interview felt slightly overwhelming. Nice to meet with people from different departments. Took a lot of time to hear back about the job", "Interview Questions": "Tell us about your interest in this position"}, {"date": "11 Nov 2022", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at UMBC", "Interview Descriptions": "Completed initial interview with department committee. Was told I would be called back for second round. Was told interview and email questions were good. But was never called back for second review. Other candidates went forward and job was awarded to one of them.", "Interview Questions": "How would you respond to the email inquiries?"}, {"date": "15 Jun 2022", "title": "Enrollment Management Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMBC", "Interview Descriptions": "Very smooth and well planned. A phone interview and then a presentation. Great organization and the people are amazing. The interview was a panel style with a committee. You will receive a presentation prompt with adequate amount of time to prepare.", "Interview Questions": "What is your view on customer service?"}, {"date": "14 Apr 2022", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UMBC", "Interview Descriptions": "Went very smooth. Professor was nice and answered all my questions. A lot of the time was spent with him explaining what the lab researched and some of the basics of it.", "Interview Questions": "What are my interests, have I worked in a lab before, and typical \"tell me a little about yourself\""}, {"date": "9 Mar 2023", "title": "Front Desk Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at UMBC (Baltimore, MD) in Sept 2021", "Interview Descriptions": "The interview was remote (via zoom), quick, and easygoing. The questions were straightforward, and the entire process took less than 30 minutes. I really felt like I could be myself the entire time, and it wasn't a lot of pressure.", "Interview Questions": "What makes you a good fit for this position? Do you have prior experience doing tasks related to the job? Tell me about yourself and prior experience."}, {"date": "1 Aug 2021", "title": "Program Management Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at UMBC (Catonsville, MD) in May 2021", "Interview Descriptions": "Online application > interview offer via email > accepted and chose my date and time > 1st interview was virtual, about 30 minutes and with 6 individuals > 2nd interview offer sent via email a day or two later > selected day > they emailed schedule and calendar invites > the day consisted of 6 individual meetings (4 or so hours in total) with each meeting being a group of people or just one person > received a verbal offer via phone", "Interview Questions": "Please, tell us about yourself"}, {"date": "18 May 2021", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UMBC in Nov 2020", "Interview Descriptions": "Strict. only offered one day to interview\nNever informed of a presentation until day off\nHad way too many people in attendance for presentation even if it was online\nAsked repeated questions \nVPSA asked really off handed questions (see below)", "Interview Questions": "What is something we should be concerned about you?"}, {"date": "22 Jan 2021", "title": "Senior Marketing Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMBC (Baltimore, MD) in Oct 2020", "Interview Descriptions": "I was offered an interview for this position and had what seemed to be a wonderful interview. I was told that I would be informed of their decision (whether or not I was selected to move forward in the process) within two weeks. I was never contacted and my follow-ups were ignored. I understand that I was not selected to move forward in the hiring process, but I am deeply annoyed that I was promised an answer and then completely ignored.", "Interview Questions": "What marketing software have you used in the past? "}, {"date": "28 Sept 2020", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at UMBC", "Interview Descriptions": "The interview process happened in a big room with a lot of mini sections. You will come in for the time slot you selected and check in at the front of the Apartment Community Center. You will be interviewed by a CD of a residential hall and one other person. The interview lasted for about 15 minutes.", "Interview Questions": "How will you help someone from a different culture background."}, {"date": "9 Aug 2020", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMBC (Baltimore, MD) in Feb 2020", "Interview Descriptions": "5 people round table. answered many questions. They asked typical questions about job and how you would handle challenges etc. Had to come back for final interview but Covid interrupted everything and I didn't get the job.", "Interview Questions": "Can you work independently? Without supervison?"}], [{"date": "25 Jan 2020", "title": "Front Desk Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at UMBC", "Interview Descriptions": "Three short essays, interview with supervisor and student staff member. The process was very fast. I got an offer a couple days after my interview. The interviewers were very cordial.", "Interview Questions": "What is one time you dealt with a conflict?"}, {"date": "23 Jan 2020", "title": "Assistant Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at UMBC", "Interview Descriptions": "From the time that I accepted the initial phone interview with the Director of Professional Programs,  I should of recognized that the opportunity would be a big waste of time. During the initial 45 minutes phone call, I had to listen to the guy talk about himself. When he finally attempted to describe the position, expectations, and the university it was clear that he had no idea what he was talking about. On more than one occasion, he stated several things which turned out to be completely false. \r\n\r\nDuring the actual interview, the guy was wore a tuxedo. He looked foolish! Lastly, overall the interview was a sham and really was a handful  of people who appeared to be the only people available that day. The program director is incompetent at the least.", "Interview Questions": "Tell us about yourself."}, {"date": "19 Aug 2019", "title": "Transfer Evaluator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UMBC", "Interview Descriptions": "I was able schedule my interview within 2 weeks of applying.  The interview panel was both extremely friendly and professional.  I also got the opportunity to meet and speak with the assistant registrar", "Interview Questions": "What is your biggest weakness?"}, {"date": "7 May 2020", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at UMBC (Baltimore, MD) in Aug 2019", "Interview Descriptions": "I applied online, and I was offered an in person interview. The interview process was very easy. Answer to the best of your ability. Show them you are committed and you can complete basic tasks .", "Interview Questions": "How would you complete tasks that were given by multiple faculty members? The tasks should be completed by the same day"}, {"date": "4 Aug 2019", "title": "Copier Technician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at UMBC (Baltimore, MD) in Jul 2019", "Interview Descriptions": "I was on the West cost during my internship and was trying to schedule the call which was twice misunderstood by SDS staff. When i finally got a chance to talk they gathered 5 people and asked me various question about my background (even though I try to get a job of copier and office assistant)", "Interview Questions": "Which area are you have strongest skills: humanities of math?"}, {"date": "23 Dec 2022", "title": "Student Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at UMBC (Baltimore, MD) in Jun 2019", "Interview Descriptions": "I sent my resume via an email. Then got a message from one of the managers for an interview. Not a very long process. They communicate frequently about a day.", "Interview Questions": "Do you have any experience with cybersecurity?"}, {"date": "19 Oct 2020", "title": "Residential Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at UMBC (Catonsville, MD) in Mar 2019", "Interview Descriptions": "Several-step interview process over the course of two separate days. The first day consists of two rounds of two interviews, each with a different pair of interviewers: one administrative assistant and one current Resident Assistant. The second day is a group interview in which the applicants are graded in their performance in different group activities.", "Interview Questions": "Which of ResLife's values do you value the most and why?\n"}, {"date": "24 May 2022", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at UMBC (Baltimore, MD) in Dec 2018", "Interview Descriptions": "Quick and easy interview process. Reached out about interest in position and heard back with an interview date approximately 2 days later. Interviewed with two receptionists and the manager, and heard back a day after that.", "Interview Questions": "Why do you want to work here?\r\nName a time you solved a conflict between people.\r\n"}, {"date": "13 Nov 2018", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at UMBC (Columbia, MD)", "Interview Descriptions": "The process was long and very time consuming. Spent over a month and about 10 hours in person interviewing for the position. Position was very operations based so not sure why so much time was spent. Felt like they were more interested in if they would like me as a person rather I could do the job and do the job well.", "Interview Questions": "How do you handle failure?"}, {"date": "5 Jun 2017", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at UMBC", "Interview Descriptions": "Overall, it was brief and to-the-point. They mostly wanted to make sure the potential candidate was reliable and would deliver the designs on time. The interviewer was nice, and relaxed.", "Interview Questions": "What are my greatest strengths? What is your prior experience? Would you be able to deliver products on time with an additional student schedule? How are you working in an office environment? Can you take photos of events?"}], [{"date": "17 Apr 2017", "title": "Postdoctoral Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at UMBC", "Interview Descriptions": "two phone interviews, followed by on-site interview with a powerpoint presentation of previous graduate work. About a 30 minute presentation followed by open questions with about 30 people in the audience including all principal investigators. The questions varied from the content of my presentation to questions on how I believe my expertise may be applicable to the proposed project.", "Interview Questions": "fairly typical for getting to know what my knowledge base is and how it may fulfill the research needs of the lab"}, {"date": "5 Apr 2017", "title": "Adjunct English Teacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at UMBC", "Interview Descriptions": "The interview was brief and to-the-point. There are always high-turnovers, like any English department, and they needed another English professor. As long as you talk about your teaching style, and give examples of assignments, you should be OK.", "Interview Questions": "What is your favorite writing theory?"}, {"date": "3 Apr 2017", "title": "Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UMBC", "Interview Descriptions": "Application was submitted online.  Several emails were done to understand the scope or work and experience and education preference in terms of teaching courses.  Phone interview was done first.  Also, a panel Interview was done.  Each member had questions they asked based on resume and experience.", "Interview Questions": "Demo a course you taught."}, {"date": "18 Jan 2021", "title": "Doctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at UMBC (Baltimore, MD) in Mar 2017", "Interview Descriptions": "Supervisor phone interview\nThen, I received several papers for me to read.\nI need to try my best to have a deep understanding of those papers within 5 days and then answer some technical questions. \nThen, I was asked to tell them my research plan based on those papers.", "Interview Questions": "Read several papers and answer questions. \nShould tell them your ideas and research plan based on the papers they give you."}, {"date": "19 Dec 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at UMBC (New York, NY)", "Interview Descriptions": "The interview was very simple. Basically the department made decisions of admission after reviewing the available applications. after several months, I received an email saying I'm admitted. Then, I had a quick phone call with my potential adviser.", "Interview Questions": "There was no specific question asked "}, {"date": "16 Jun 2017", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMBC in May 2016", "Interview Descriptions": "Meet with different lecturers in the department\r\npresent a lecture on a pre-selected topic to other lecturers, professors and some students Lecture last 15 to 30 minutes using powerpoint, white board, and/or chalkboard.\r\nTour the school\r\nmeet with the chair of the department and discuss your approach to teaching", "Interview Questions": "What is your approach to teaching?"}, {"date": "20 Dec 2015", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at UMBC", "Interview Descriptions": "I contacted the professor directly though email and we set up a 1-on-1 interview. He asked about my past research experience as it related to his projects. He introduced me to the projects he was currently working on. At the time, one of his graduate students was working on a process which I had previously worked on in a previous research experience. The professor asked me to write an essay about the importance of water pollution and water treatment.", "Interview Questions": "How extensive is your experience with solid phase extraction?"}, {"date": "6 Jan 2016", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UMBC (Catonsville, MD) in Sept 2015", "Interview Descriptions": "Professor asked in class if anyone was interested in a lab position and I emailed the professor seeking my interest. He scheduled an interview the next day and at the end of the interview, he told me that I can start working the next day. After the interview, I filled in all my employment papers that I needed to do and started working the next day.", "Interview Questions": "How many hours are you available each week?"}, {"date": "10 Jul 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at UMBC", "Interview Descriptions": "Short phone interview and asked at the end of the phone conversation to came in and meet with the supervisor and team members. Spent about 2 hours in mostly general conversation about background and skills. They were concerned with both my ability to do the job and fit with the group.", "Interview Questions": "What is your background in cardiovascular research?"}, {"date": "26 Feb 2016", "title": "Technical Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UMBC (Baltimore, MD) in Jun 2015", "Interview Descriptions": "I applied online and got selected for interview immediately. I did setup interview time and appeared. Employer asked me few basic question regarding technical skills and how to implement to solve real world problem.", "Interview Questions": "What will you ask student if he/she did not get print correctly from library ?"}], [{"date": "8 Feb 2017", "title": "Audio Visual Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at UMBC (Catonsville, MD) in Jun 2015", "Interview Descriptions": "I was referred by a former employee and had a lot of experience in the field who was a part-time employee and a student of UMBC. He referred me for his role at the job since he was graduating and knew that I needed a job at the time and was a good fit for the role and the team.", "Interview Questions": "Do you feel comfortable working/fixing an issue in front of a crowd?"}, {"date": "5 Jun 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UMBC in May 2015", "Interview Descriptions": "I interviewed for an hour with the head of the Department. They asked me about my prior teaching experience and found that I was a good fit from there.", "Interview Questions": "Describe a time when you had to overcome challenges in the workplace. "}, {"date": "9 Jan 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UMBC (Baltimore, MD) in May 2015", "Interview Descriptions": "I approached by teacher and whom i was taking a curse with. i was doing fairly well. therefore when i asked for the position, i was informed of the research details rather than being asked about my skills and experience.", "Interview Questions": "Can you work with C "}, {"date": "26 Nov 2016", "title": "Inet Animator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UMBC (Baltimore, MD) in Apr 2015", "Interview Descriptions": "You were required to submit a test animation using a package they provide.\r\nThey communicated via email and invited you to an interview.\r\nThey interviewed you as a team and asked you general questions about you and your resume, as well as your test animation, which they had on an iPad during the interview.", "Interview Questions": "What would you like to do as a career?\r\nWho is your favorite artist?"}, {"date": "26 Aug 2016", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at UMBC (Baltimore, MD) in Apr 2015", "Interview Descriptions": "Phone screening followed by technical interview and than final face to face typical interview process first they will ask you to tell something about yourself than how long you can work if we hire you", "Interview Questions": "Tell me something about yourself"}, {"date": "20 Mar 2017", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at UMBC (Columbia, MD) in Sept 2014", "Interview Descriptions": "Round robin interview for many hours with COO, Director of Operations and various team members that you would be working with.  Pretty good process overall, albeit a bit intimidating", "Interview Questions": "What are your values?"}, {"date": "4 Feb 2016", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 months. I interviewed at UMBC (Baltimore, MD) in Aug 2014", "Interview Descriptions": "The interviews made it easy and helped me to be relaxed, the interview was like I was speaking to the panel like they was family or friends. I really don't know what else to say to this. The overall experience was relaxing", "Interview Questions": "what did you like about you last employment"}, {"date": "9 Jul 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 5 days. I interviewed at UMBC", "Interview Descriptions": "Knew the  person prior to the interview, then interviewed members of the lab and finally presented my previous research. It was a basic interview but generally anticlimactic as the person had made the decision prior to offering the interview.", "Interview Questions": "no unexpected questions"}, {"date": "29 Jun 2014", "title": "PhD Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at UMBC (Baltimore, MD)", "Interview Descriptions": "Mostly technical. Questions about previous research experience with emphasis on hypothesis testing. Assessment of level of motivation. They do not ask questions pertaining to coursework that you will take after joining.", "Interview Questions": "Specific to my project"}, {"date": "9 May 2014", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at UMBC", "Interview Descriptions": "RA is supported by the advisor. So choose advisor wisely. Talk with his/her previous students. Usually advisors focus on their own publications. You do not want to choose who does not want to help the student.", "Interview Questions": "As long as you find a good advisor, you will be fine."}], [{"date": "10 Jun 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at UMBC (Baltimore, MD) in Aug 2013", "Interview Descriptions": "Applied with copy of my resume. I was called in to chat with Department head. since it was an internal move between positions it was less of an interview than normal.", "Interview Questions": "We just went over job duties of new position."}, {"date": "12 Feb 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at UMBC", "Interview Descriptions": "None, advisor has to have money to fund your research. So you research credentials and other academic performance is taken into consideration.", "Interview Questions": "There wasnt one."}, {"date": "6 Feb 2014", "title": "Graphic Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at UMBC (Baltimore, MD) in Sept 2012", "Interview Descriptions": "I found out that my initial communications were a reflection of the overall process I would be going through after I was hired - meaning that because ambiguity was a part of the interview, it would also be a part of the job. Discovering the connection each of the employees has with each other was important because it meant that there was a way that I could reach out to respond later on for following up with a thank you note.", "Interview Questions": "The most difficult question was about what I thought art was, and how I believed it applied to this position. It made me believe I was being asked to be too subjective, and it seemed off-topic to me."}, {"date": "1 Apr 2016", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at UMBC (Baltimore, MD) in Jun 2012", "Interview Descriptions": "It was a short interview process because they were looking for students to help in their recruitment of other students into the undergraduate program during the summer. It probably lasted for 25 minutes. I got the offer a day later.", "Interview Questions": "Have you been an advisor in the past?"}, {"date": "10 May 2016", "title": "Program Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at UMBC (Baltimore, MD) in Apr 2012", "Interview Descriptions": "Three person panel interview with a list of questions. Each one asked a different questions and the others were allowed to ask follow up or clarifying questions. After the interview I was asked if I had any questions. I wanted to know to funding sources and the viability of the research.", "Interview Questions": "Why do you want to work here, what experience do you have, favorite part of your current job, most un-favorite part."}, {"date": "3 Jan 2014", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at UMBC in Jan 2011", "Interview Descriptions": "Met through a professional association meeting, presented at several functions and was offered the opportunity to join the faculty.   Interview was informal.  Application and evidence of background in research, writing, and teaching were based on actual examples, reference checks, and transcripts.  Other faculty met with me informally as my background and theirs were similar and they wanted to learn more about my experience.", "Interview Questions": "Nothing was difficult.  "}, {"date": "28 Mar 2012", "title": "Budgeting Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at UMBC (Baltimore, MD) in Sept 2010", "Interview Descriptions": "They asked about my skills and strengths and weaknesses.", "Interview Questions": "Do you have any experience in Finance"}, {"date": "15 Nov 2012", "title": "Executive Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 weeks. I interviewed at UMBC (Greenbelt, MD) in Aug 2010", "Interview Descriptions": "The preliminary step to the interview process for this position requires taking a typing test.  The actual interview was not 1-on-1, but sort of a panel interview, but everyone made me feel comfortable.  Afterwards, there was a series of emails.  I even received emails about doing certain tasks before I actually started working.", "Interview Questions": "The salary cut I endured was a lot more than I expected ($25K) -- nothing to take lightly, but I needed a job, so ...  There really wasn't an unexpected or difficult question -- I just had to get past the 25K paycut!"}, {"date": "29 Apr 2014", "title": "Executive Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at UMBC (Catonsville, MD) in Aug 2010", "Interview Descriptions": "The interview process is like most.  There is the initial paperwork, then testing depending on what position you are applying for.  Then, the people that are considered \"ideal\" candidates are invited in for an interview, which may involve more than one person at a time.", "Interview Questions": "There weren't any difficult or unexpected questions."}, {"date": "11 Jul 2012", "title": "Postdoctoral Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at UMBC (Baltimore, MD) in Mar 2010", "Interview Descriptions": "Phone and Video conference call interviews.\r\nThe phone interview was a 1:1 interview with my new boss, the video conference call was with all the memnber from the lab present.\r\nThe interviews consisted in talking about my previous skills and waht the work was about", "Interview Questions": "N/A"}], [{"date": "1 Oct 2014", "title": "Supervisor III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at UMBC in Jan 2010", "Interview Descriptions": "The interview for the department I applied to was very casual and easy going. The people I spoke with very very friendly. Specifically, the one person interviewing was my direct supervisor. We became friends while I worked there and beyond.", "Interview Questions": "There weren't any difficult questions for the department I applied to."}]]