[[{"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "This company has everything", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Jul 2021", "job_title": "Software Engineer in Berlin", "duration": "N/A", "pros": "- Big focus on work/life balance. Take as much or little responsibility as you want, get compensated well for the time you put in. Hours are flexible, timezones are flexible, holiday schedule is flexible.\n- Competent, diverse, and fun team. Engineering tenure is quite long, everyone is very knowledgeable, and steadily improving. Everyone is incredibly proactive in sharing their knowledge and go in-depth into discussions and code reviews, while still being up for a long, relaxing chat about things unrelated to work.\n- Continuous learning. Employees are encouraged to take time to stay up to date with the industry, discuss new trends internally, and share new techniques with each other.\n- Mission and ambition: The leadership is approachable and motivated, the employees are driven, the students are incredible. In other places, engineering can often feel like you're just another cog in the machine, but Minerva does everything it can to make you feel valued, while allowing you to focus on real-world impact. Most engineers aren't just nerdy about tech, but deeply care about education as well.\n- Good compensation and benefits: Industry-standard compensation, option choices, and benefits like paid company trips, fly-ins, education budget, etc. I haven't had a chance to see how \n- Efficiency and agency: Processes are kept efficient, meetings are kept useful. Engineers get to have a good amount of input into product questions and novel ideas always meet open ears.\n- Opportunity for growth: In my short tenure and through my review of Minerva's history, there are a lot of good examples for growth opportunities within the company, and leadership positions are filled from the inside. Highly diagonal jumps seem to be possible. My manager has been very supportive in thinking about growth opportunities.\n\nOverall it's been a joy to work here, and I'm confident in the growing impact and success of the company.", "cons": "- Technical debt. There's a lot of old tech left over (Backbone/Marionette) and some standalone services have grown out-of-sync and hard to maintain. This is slowly changing, but the growing product demands are making it hard to invest time into reducing debt. Still, code quality is still very high, with a lot of test coverage and a short path to feature release, and there's driven individuals trying to continuously make headway in the everlasting fight against entropy."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Good experience", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Nov 2021", "job_title": "Anonymous Employee in Berlin", "duration": "N/A", "pros": "Ability to grow and improve", "cons": "No major cons identified here"}]]