[[{"date": "28 Jun 2023", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Azim Premji Foundation", "Interview Descriptions": "First round will be an Online assessment, which includes mcq questions to check your general knowledge, knowledge on education etc. Second and the final round will be Face to face interview.", "Interview Questions": "They mainly check your knowledge on education and development."}, {"date": "1 Oct 2022", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Azim Premji Foundation (Bengaluru) in Sept 2022", "Interview Descriptions": "The interviewers were friendly and seemed interested in my journey as a researcher. Although there were some challenging questions they were encouraging through the process. It was a good experience overall.", "Interview Questions": "What are your future goals and career plans?"}, {"date": "15 Sept 2021", "title": "Teacher/Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Azim Premji Foundation in Aug 2021", "Interview Descriptions": "Smooth well behaved interactive process. Discussion on current affairs .. family. Educational background was asked. Your topics related to previous studies will be asked. Your aim goal for the institute will be asked.", "Interview Questions": "Why thia institute? Techinal questions current affairs"}, {"date": "27 May 2021", "title": "District Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Azim Premji Foundation", "Interview Descriptions": "Detailed and elaborate discussion the purpose of the Foundation. Clear description of the role is provided. In depth discussion to understand the experience background and relevance. \r\nMultiple steps of interview.", "Interview Questions": "Why do you want to be part of the Social sector ?"}, {"date": "21 May 2021", "title": "RESOURCE PERSON Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Azim Premji Foundation (Udaipur, Rajasthan) in May 2021", "Interview Descriptions": "The interview process was well planned . I applied in February then got the call for online apptitude test ,then 2 round of interviews. First round was with District manager and 2 round or final round was with Regional Manager .", "Interview Questions": "Questions were more related to Indian education system , tecnincs , theories to improve classroom learning ."}, {"date": "14 Feb 2021", "title": "District Teacher Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Azim Premji Foundation (New Delhi) in Jan 2021", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire", "Interview Questions": "Tell Me About Yourself.\r\nHow Did You Hear About This Position?\r\nWhy Do You Want to Work at This Company?\r\nWhy Do You Want This Job?\r\nWhy Should We Hire You?\r\nWhat Are Your Greatest Strengths?\r\nWhat Do You Consider to Be Your Weaknesses?"}, {"date": "4 Dec 2019", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Azim Premji Foundation", "Interview Descriptions": "First PowerPoint presentation on any topic related to your previous project then Interview most questions will be from your presentation and some from your CV there is no language boundation you can talk in English or Hindi or any regional language.", "Interview Questions": "They will ask from you CV only."}, {"date": "29 Aug 2022", "title": "Fellowship Program Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Azim Premji Foundation (Yādgīr) in Oct 2019", "Interview Descriptions": "I was called to Yadgir. About 30 to 35 people were called. All facilities for stay and food was taken care of. Lot of delay in the interview process.  Interview went on almost one hour per person.", "Interview Questions": "Powerpoint presentation, questions from written exam answers, usual experience based questions.\r\n"}, {"date": "3 Sept 2019", "title": "\"Director de calidad, higiene y medio ambiente\" Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Azim Premji Foundation (Bengaluru) in Jul 2019", "Interview Descriptions": "It was proper subject round, they asked several bssic questions, so we need to be very strong in basics. Proper preparation has to be done before attending. Answer to the point n relevantly.", "Interview Questions": "A single math question with multiple answer's "}, {"date": "7 Jun 2018", "title": "Campus Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Azim Premji Foundation (Rudrapur) in Apr 2018", "Interview Descriptions": "First of all written test was conducted consisting of 18 multiple choice questions of your subjects that is maths or physics or chemistry 2 hours were allotted for the test .Once you get selected then they will call you for  interview. The complete process almost took one and half month. Before appearing in examination study properly upto 12th standard concepts.", "Interview Questions": "I had faced the Mathematics paper .3 questions were asked from geometry ,two from integration and 2 differentiation to from time distance average and 2 questions related to graph and statistics.\r\nAfter clearing the first examination I was called for an interview at Rudrapur city Uttarakhand on April 2018 .\r\nThey are really generous to the candidate provide 3rd AC reimbursement for attending the interview .\r\nInterview lasted for 50 minutes .Questions were asked related to behaviour and social subjects like general introduction famous things of my hometown Bikaner(Raj) and  about my family ,essentially of  national anthem in cinemas Kashmir issues and about my  religion beliefs and why do I want to join organisation instead of Technical sector ?and they told me to teach number system.\r\nYes for teaching the check how do you teach they give you a white board and a marker to teach topic the told me to this number system and prove that the sum of interior angles of a triangle is 180 degree. So keep your basics strong. And also speak with full confidence and speak clearly, don't show your confidence for the wrong answers and and don't try to argue with the interviewer."}], [{"date": "4 Feb 2018", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Azim Premji Foundation", "Interview Descriptions": "Campus recruitment, comprising pre-placement talk, written test, and (if you clear it) presentation & interview. Presentation was to be prepared from a given list of topics. Result of each stage is informed in 10-20 days.", "Interview Questions": "Equality-quality dichotomy in education, government vs private schools, internship experience, master's project, familiarity with rural areas, etc."}, {"date": "8 Jun 2018", "title": "Educator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Azim Premji Foundation (Udham Singh Nagar) in Jan 2018", "Interview Descriptions": "i applied through college recruitment. It consist 3 stages, 1st written test consist of subject oriented questions (physics, chemistry, maths), 2nd and 3rd were an interview at azim premji foundation udham singh nagar. The interviews went for 45 minutes each. 1stview was a face to face interview  took by one person and and second one or last was a skype interview taken by a senior member from their headoffice. I was the only person got selected for the second interview among 200 students who took test still i couldn't make it but the experience was really great.", "Interview Questions": "what is the application of trigonometry in real life?\r\n\r\n"}, {"date": "8 Nov 2017", "title": "Campus Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Azim Premji Foundation (Dehradun) in Jul 2017", "Interview Descriptions": "One written round with 18 questions - (2 hours time ) from 10th, 12th and graduation level, One  rigorous subjective Interview from Maths, Physics or Chemistry (which you will prefer)and one general HR round.", "Interview Questions": "Introduce Yourself\r\nSocial Issues - Your views on God, Religion, beef ban\r\nPolitical Issues - Kashmir Issue\r\n"}, {"date": "17 Jun 2018", "title": "Campus Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Azim Premji Foundation (Dehradun) in Jun 2017", "Interview Descriptions": "The interview was good and there were three members who took the interview. They mainly asked about the present condition of our education system, the place of women in our society etc.", "Interview Questions": "tell us about yourself"}, {"date": "28 Jun 2017", "title": "Campus Associate Human Resources Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Azim Premji Foundation (Bengaluru) in Jun 2017", "Interview Descriptions": "Visited the Org in Bangalore, in the WIPRO park . There was a short PPT , Aptitude Test  and Two rounds of interview. \nThe written aptitude test had 4 sections - Gk, Logical , English and an essay question on situation analysis . The question I got was on how the recruitment drive will be conducted to set up a new branch of an existing company in a new city .", "Interview Questions": "Thoughts on the new Maternity amendment."}, {"date": "23 Jan 2020", "title": "Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Azim Premji Foundation (Bengaluru) in Jan 2017", "Interview Descriptions": "Interview process was very good. The written test was in the first round and personal interview was in second round. The questions in written test about Maths, General awareness, Social science etc.\r\n They did not only ask the question but also offered the question to me for them about Azim Premji Foundation's role. What we are thinking about the education system? Why would be help the foundation in teachers' education. How do you criticize Azim Premji University etc.", "Interview Questions": "What do you think about Gujarat Model?"}, {"date": "27 Mar 2012", "title": "Support Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Azim Premji Foundation (Bengaluru) in Nov 2011", "Interview Descriptions": "Pretty long interview procedure , appreciate the depth ...but i guess its wasteful for a candidate who is rejected on a flimsy reason.", "Interview Questions": "Why you want to join social sector"}, {"date": "21 Oct 2011", "title": "General Occupation Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 6 months. I interviewed at Azim Premji Foundation (Bengaluru) in Sept 2011", "Interview Descriptions": "The company is very eager to have new people on board since they are currently starved for them. The interview process is quick and they are very responsive over emails and phone calls. They currently need people to travel to rural parts of India. So they are eager to interview and hire since not many people want to take on that portfolio. \r\nOnce they think the candidate is not viable for such a position, then the response gets lukewarm, and almost non-responsive.", "Interview Questions": "Tell us about yourself."}]]