[[{"date": "8 Jul 2022", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Management Development Institute of Singapore", "Interview Descriptions": "Three interviewers that consist of the Head of School, Dean and Senior Director. The HR will email and call to set up an online interview. The interview lasts about 30 minutes with a few standard questions that are not difficult to answer.", "Interview Questions": "Why do you want to work for MDIS?"}, {"date": "17 May 2022", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Management Development Institute of Singapore", "Interview Descriptions": "Very systematic though casual. Several stages and meetings more focus on specific skills to bring to the role. Salary negotiation scope is limited.Overall a good and smooth experience.\r\nLook mostly for confident and forward looking person", "Interview Questions": "Why you want this role?"}, {"date": "28 Aug 2022", "title": "Executive Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at Management Development Institute of Singapore (Singapore) in Jan 2022", "Interview Descriptions": "usually 2 interviewers and 1 interview to go through. so quite easy to get the job that you want if you are are fitted for the job. Interview duration range from 15 mins to 1 hour for more senior position.", "Interview Questions": "Why you want to apply for the post?"}, {"date": "4 Oct 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Management Development Institute of Singapore", "Interview Descriptions": "Easy but think highly of themselves. Never give chance for further elaboration . \r\nInterview straight forward and not difficult though.  If you can handle the constant looking down on you then go ahead .", "Interview Questions": "Your previous experience but given almost no chance for elaboration"}, {"date": "24 May 2019", "title": "Assistant Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Management Development Institute of Singapore (Singapore) in Oct 2018", "Interview Descriptions": "Standard interview process with the department head and also a director at the same time.  Standard questions were asked but came with an exam like question/essay in the 2nd part of the interview, with the option of taking it home to complete and submit.", "Interview Questions": "To write an essay on the spot on how to resolve certain issues relating to the job. "}, {"date": "3 May 2018", "title": "Regional Sales Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Management Development Institute of Singapore (Singapore) in Mar 2017", "Interview Descriptions": "I applied for the position online, and HR manager contacts me on the next working day. \r\n\r\nThe Associate Director interview me for 15 mins and COO conduct the second round interview after first 15 mins, total duration about half hour. \r\n\r\nAfter 4 hours, I received a call from HR manager, give me the offer.", "Interview Questions": "1. Introduce yourself and working experience?\r\n2. How do you think this job?\r\n3. Do you think you are easy going person?\r\n4. Do you understand China market, any resource you have?\r\n5. How long you stay in Singapore and which school you study with, why choose them, not MDIS? "}, {"date": "9 Feb 2019", "title": "Sales & Marketing Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Management Development Institute of Singapore (Jurong West New Town, ) in Jan 2017", "Interview Descriptions": "The common queations related to sales strategy. The HR and Manager were friendly. One male, one female. Total two interview in one month. Overall, I enjoyed the interview session. The salary is not high and the confirmation period is quite long.", "Interview Questions": "What is your weakness "}, {"date": "3 Jun 2019", "title": "Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Management Development Institute of Singapore (Singapore) in Sept 2016", "Interview Descriptions": "Professional and engaging. Good exchange of Q&As to understand about role and organisation.  Ample time provided to prepare for interview. Understood well about the expectations of the role and organisation.", "Interview Questions": "Tell us about yourself"}, {"date": "29 Jul 2020", "title": "Associate Lecturer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Management Development Institute of Singapore in Apr 2016", "Interview Descriptions": "I gave a presentation that lasted about 20 minutes to the Academic Director. Only 1 interviewer who basically asked all the questions. Some information provided on the type of subjects to be taught. The problem was that the class was cancelled two weeks before the start date. The main answer was that the class was cancelled due to poor student numbers. I found out later that this class was taught by another associate staff.", "Interview Questions": "Why did you want to be a part-timer lecturer? "}, {"date": "12 Feb 2016", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Management Development Institute of Singapore", "Interview Descriptions": "Simple & what they say during interview doesn't fit job description. Questions ask are standard & process is straight forward. Don't be vague, remember to ask for more details best if you write down as proof", "Interview Questions": "Simple"}], [{"date": "19 Oct 2015", "title": "Programmer Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Management Development Institute of Singapore (Singapore)", "Interview Descriptions": "Submit the CV and wait for 1-2 weeks to get the call from HR. Interviewed by HR followed by HOD. HOD interview may take 30 mins to 1 hr. HR will inform the outcome (via phone call) after 3-5 days stating the confirmed position, salary and the commencement date. On the first day of work, HR will brief you on the company policies.", "Interview Questions": "Questions on your education, past/current experiences. "}, {"date": "15 Dec 2019", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Management Development Institute of Singapore (Singapore) in Mar 2015", "Interview Descriptions": "Amicable and friendly. There were 2 interviewers namely the HR and the hiring manager. The whole session was neutral and questions were mainly about the job and responsibilities. It took about 30 mins.", "Interview Questions": "Tell me more about yourself"}, {"date": "26 Jan 2016", "title": "Sales Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Management Development Institute of Singapore (Singapore) in Nov 2014", "Interview Descriptions": "Application via online job portal.\r\nI applied online. I interviewed at the campus.\r\nFill up some forms , pass all the related document to HR. \r\nHR will collect all the forms, arrange the interview by the sales manager, marketing manager, director & HR. HOD interview may take 30 mins to 1 hr.\r\nR will inform the outcome (via phone call) after 3-5 days stating the confirmed position, salary and the commencement date. No second Interview.\r\nOn the first day of work, HR will brief you on the company policies.", "Interview Questions": "What do you think is needed to be successful in sales?"}]]