[[{"date": "30 Jun 2023", "title": "Science Librarian Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Santa Clara University (Santa Clara, CA)", "Interview Descriptions": "Typical all day academic interview with multiple panels and one on one with the University Librarian/Library Dean. A presentation was required. Interview also included lunch and dinner with potential colleagues.", "Interview Questions": "N/A"}, {"date": "5 Jun 2023", "title": "Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Santa Clara University (Santa Clara, CA) in Sept 2022", "Interview Descriptions": "Very basic questions about interest in marketing. Previous marketing experience? Why you want to work in marketing. Goals for the future. What is your availability? What is your major? How can we help you succeed?", "Interview Questions": "Tell about an obstacle you overcame."}, {"date": "4 Aug 2022", "title": "Administrative Associate I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Santa Clara University in Jun 2022", "Interview Descriptions": "Three rounds. First round was a Zoom panel interview which lasted 45 mins. Second was a brief interview with the dean. Finally, an on-site visit consisting of two or three separate panel interviews. \n\nThe whole process took about a month, starting from when I was first contacted for an initial interview, to when I received an offer.", "Interview Questions": "- How do you organize your work? \n- Why should we hire you?\n- Why Santa Clara?\n"}, {"date": "18 Jan 2022", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Santa Clara University", "Interview Descriptions": "Two-step interview process. Screening interview for first round, then second round included a formal interview that included 4 sessions (management, presentation, team, and supervisor). Overall, three hours with entire team and some campus partners.", "Interview Questions": "What do you want to work here?"}, {"date": "19 Sept 2021", "title": "English Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Santa Clara University", "Interview Descriptions": "I gained this position through a class I took. In this English class, I volunteered to tutor students learning English at a night school. Through this position, I learned how to engage and teach students at lots of different levels of writing.", "Interview Questions": "Had to create a portfolio of work completed throughout the class"}, {"date": "28 Jun 2021", "title": "Lead Peer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Santa Clara University", "Interview Descriptions": "No interview necessary. Was selected by a professor to take the job and I accepted. It was a very easy process. No complaints. Just need to know people. This 30 word minimum is lame", "Interview Questions": "Would you like this job?"}, {"date": "25 Sept 2020", "title": "Kids On Campus Aide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Santa Clara University", "Interview Descriptions": "A few questions about background with childcare. Relatively easy and straightforward. The interview process was short. You get a tour of the facility which does like run down and old from the outside. Weird that it’s a preschool. I personally would not want to send my kids there.", "Interview Questions": "What is your experience with childcare?"}, {"date": "15 Aug 2020", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Santa Clara University", "Interview Descriptions": "Skype interview. Unprofessional search committee not dressed for interview, pets and others in background of call. Had not read my CV. Although I met all qualifications not offered second interview - final hire did not meet any of the qualifications - area of expertise in a completely different field, however male and notably younger", "Interview Questions": "Do you have experience with experiential learning. "}, {"date": "21 Jul 2021", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Santa Clara University (Santa Clara, CA) in Jan 2020", "Interview Descriptions": "The interview process is very swift and respectful. I thought the manager was extremely considerate to my own schedule and how I would be able to attend work at Benson.", "Interview Questions": "Can you get up for the 7 am shift? "}, {"date": "3 Feb 2021", "title": "General Administrative Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Santa Clara University in Jan 2020", "Interview Descriptions": "All behavior questions, people are nice. Two rounds in total. It took one morning to finish all the interview processes. All behavior questions, people are nice. Two rounds in total. It took one morning to finish all the interview processes.", "Interview Questions": "Why do you think you are a good fit for this position?"}], [{"date": "12 Dec 2019", "title": "Media Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Santa Clara University", "Interview Descriptions": "Fair and straightforward. They ask questions to determine if you will be able to not only complete the job, but also learn and adapt to the environment. They don't expect you to know how to deal with A/V equipment beforehand, but they want to know that you are at least familiar with such equipment, and that you are responsible and great at customer service.", "Interview Questions": "Describe what you would do if you did not know how to fix a professor's issue."}, {"date": "20 Nov 2019", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Santa Clara University", "Interview Descriptions": "Very casual. Basically just summed up the job description and asked a few easy questions. I would not stress much. Offer came soon after, sometime within the next day or two, not totally sure.", "Interview Questions": "How would you sell season tickets to a potential customer?"}, {"date": "2 Oct 2019", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Santa Clara University", "Interview Descriptions": "Very easy and low-key. Submitted a resume and was called in for an interview a few days later. Interview was casual and low-pressure with two staff members who I would be working with and the supervisor that I would report to. I heard back with a job offer within 3 days.", "Interview Questions": "How would you handle taking care of several calls and walk-ins at the same time?"}, {"date": "26 Oct 2020", "title": "Benson Info Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Santa Clara University (Santa Clara, CA) in Oct 2019", "Interview Descriptions": "Interview was brief and the two bosses interviewed me at once, so overall I had a fair experience with my interview since they were both respectful and pleasant. Mainly they were focused on knowing my availability since it was also a benefit that I live around the area.", "Interview Questions": "Are you able to work during holiday breaks?"}, {"date": "8 Apr 2019", "title": "Facility Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Santa Clara University", "Interview Descriptions": "Online application with basic information then several long questions. Then a phone interview about background, customer service, and several situational \"what would you do if\" questions, after job offer onsite training including First Aid Certification and several other hours of learning.", "Interview Questions": "What does sustainability mean to you? Why do you want to work in customer service? "}, {"date": "2 Apr 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Santa Clara University", "Interview Descriptions": "Reached out Via Email, got back in a couple of weeks. I was able to go in and talk to the professor to do research.  Made sure that I was informed and that my concerns were addressed.", "Interview Questions": "Asked me to go over my resume"}, {"date": "1 Mar 2019", "title": "Exam Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Santa Clara University", "Interview Descriptions": "Very brief because I was sent on the referral of a friend. It was a brief in person conversation and then was offered the position. I am not sure what the process looks like if you apply online but they mostly want to know that you are reliable, hard working and will maintain academic integrity during exams.", "Interview Questions": "What my schedule is like? How do I work with others?"}, {"date": "17 Mar 2019", "title": "Student Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Santa Clara University (Santa Clara, CA) in Mar 2019", "Interview Descriptions": "I met with 2 if the 4 supervisors I would support. They asked me to share my background with them then told me about the position. Then they asked more specific questions like describe a conflict situation you have faced in the past and how you resolved it.", "Interview Questions": "Would you be comfortable managing student staff and delisting responsibilities to them?"}, {"date": "10 Jul 2019", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Santa Clara University (Santa Clara, CA) in Sept 2018", "Interview Descriptions": "Short and brief but very effective. They posed hypothetical questions to me and inquired how I would respond, and they pointed to some of my previous experience from my resume and asked me to talk about what I contributed to that environment.", "Interview Questions": "How would you handle a situation in which a professor was pushy?"}, {"date": "9 Aug 2018", "title": "Library Student Interview Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Santa Clara University (Santa Clara, CA) in Jun 2018", "Interview Descriptions": "I was picked based on an online application I had put out in January. I was asked mostly behavioral questions, some questions about prior work experience. Very relaxed, laid back interview.", "Interview Questions": "Why did you leave your last job?"}], [{"date": "13 Jun 2022", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Santa Clara University (Santa Clara, CA) in Apr 2018", "Interview Descriptions": "Toured lab work space and discussed expected tasks for summer job. The whole process was extremely casual, as most of the job was just collecting inventory and making sure equipment was functioning properly.", "Interview Questions": "What experience do you have with C&C equipment?"}, {"date": "14 Feb 2018", "title": "Employer Relations Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Santa Clara University (Santa Clara, CA) in Oct 2017", "Interview Descriptions": "I interviewed with the former Employer Relations Coordinator over the phone (I was studying in Spain at the time). My interviewer was kind, asked me questions about specific items on my resume, and talked to me about my time in Spain! I was offered the job a week later via email.", "Interview Questions": "What other employment experiences do you have at Santa Clara? "}, {"date": "11 Oct 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Santa Clara University (Santa Clara, CA) in Sept 2017", "Interview Descriptions": "I was contacted via phone to schedule an in person interview. There was no initial phone screen and it was just the one interview. I interviewed on a Friday and was told I'd hear back early the following week, but it was two Mondays after that I received an email indicating I would not be offered a position. The interview itself was easy enough, a panel of five women, and once the question and answer portion was done I was led to a waiting area where someone was to join me shortly and give me a tour of the center (which I took to be a good sign). They left me waiting for at least 20 minutes, probably closer to 25 minutes, which I thought was strange because it's not like I wasn't aware they were all in the conference room talking about me. Finally I was led on a brief tour and that was that.", "Interview Questions": "Describe a challenging experience in your last role and how you handled it. "}, {"date": "19 Oct 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Santa Clara University (Santa Clara, CA) in Sept 2017", "Interview Descriptions": "The potential supervisor call me around one week after I submitted my resume online, and only ask 2-3 basic questions. Pretty straight forward and the phone interview takes less than 20 minutes. Unfortunately, I didn't get the chance to second interview.", "Interview Questions": "Why do you want to work here (company/position)?"}, {"date": "12 Jun 2017", "title": "Office & Events Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Santa Clara University (Santa Clara, CA) in Jun 2017", "Interview Descriptions": "The receptionist called to scheduled a phone screening with the Assistant Dean. The initial phone screening lasted for about 20 minutes. If you passed that, then they invited you in for a multiple-person interview with the dean, finance department and other team members (done one on one or two on one). The process lasted for about 2-1/2 hours (which may be different if you are interviewing with a different department or position).", "Interview Questions": "How do you handle emergencies? "}, {"date": "10 Feb 2017", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Santa Clara University (Santa Clara, CA) in Aug 2016", "Interview Descriptions": "I applied through university job portal. Met with the manager in person. Got an email for interview in person. The process took around 30 minutes and I got my offer letter next week.", "Interview Questions": "Why do you want to work for us?"}, {"date": "3 Jun 2016", "title": "Web Designer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Santa Clara University in Apr 2016", "Interview Descriptions": "I was called in for an interview by the professor. It went well. I was called in mainly because of the projects I had done previously. It was an easy interview, and I was asked about my work in previous projects.", "Interview Questions": "He told me about what are his expectations and requirements."}, {"date": "9 Feb 2018", "title": "Benson Memorial Center Information Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Santa Clara University (Santa Clara, CA) in Apr 2016", "Interview Descriptions": "The interview was with the building manager, and it was a very friendly, relatively informal interview. It was very much a standard question and answer format, and just the right amount of professional for a student job.", "Interview Questions": "What was one time you had difficulty working with a coworker?"}, {"date": "19 Jan 2016", "title": "TA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Santa Clara University", "Interview Descriptions": "There was no interview process.  I was referred by one of my friends.  The professor in charge of TAs remembered me since I took a course from him.", "Interview Questions": "N/A"}, {"date": "21 Dec 2015", "title": "Sales Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Santa Clara University (San Jose, CA) in Oct 2015", "Interview Descriptions": "2 interviews! First was about myself and how I think I fit in with the company. Second, was more about the company and what I new about it. They asked me where do I see me fitting in, how would I contribute to the company, and where do I see myself in 5 years if I were to still be with them.", "Interview Questions": "What is one of my best qualities"}], [{"date": "23 May 2019", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Santa Clara University in Sept 2015", "Interview Descriptions": "Phone interview with the boss. Was offered the job during that initial phone interview. This was one of the few jobs that didn't only want work-study applicants, so I felt lucky to get the job.", "Interview Questions": "They asked basic phone interview questions for a student worker position"}, {"date": "16 Nov 2015", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at Santa Clara University (Santa Clara, CA) in Aug 2015", "Interview Descriptions": "The interview process was very standard. I applied and within a week and a half, I received an email to schedule a phone interview. That went really well and I was offered an in person panel and presentation interview. However, in the end I did not receive an offer", "Interview Questions": "What was the latest book you've read?"}, {"date": "17 Oct 2016", "title": "Telecommunications Student Tech Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Santa Clara University (Santa Clara, CA) in Mar 2015", "Interview Descriptions": "The easiest interview ever.  They know that the job is able to be done by essentially anyone, so the interview was completely non-technical and more about finding out whether I was going to be a reliable employee or not.  Once they knew that I was available during the times they needed someone and that I wasn't going to actively make their lives harder, I had the job.", "Interview Questions": "My available hours."}, {"date": "26 Feb 2015", "title": "Social Media Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Santa Clara University", "Interview Descriptions": "The hiring process took a little over one month. I was contacted two weeks after submitting my resume to schedule an in-person interview with the Social Media Director in the Office of Marketing and Communications. She asked my interest in digital media and how my past experiences prepared me for the position. One week after my interview I received an offer and accepted it.", "Interview Questions": "Why are you interested in digital media?"}, {"date": "2 Feb 2015", "title": "Student Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Santa Clara University", "Interview Descriptions": "The person in charge of selecting the best applicant for the student assistant position emailed me to schedule a time for an interview.  I walked into the building where I was going to have the interview and I had not been there before. It was very intimidating when we walked through the office area and walked back into a conference room to be interviewed by the person in charge and her assistant who I had just met.", "Interview Questions": "Why do you want to work here in this department for the student assistant position?"}, {"date": "29 Feb 2016", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Santa Clara University (Santa Clara, CA) in Jan 2015", "Interview Descriptions": "Very simple process. One behavioral interview and one interview where you have a mock phone call.  Be sure to demonstrate your persistence and accountability. Be yourself and speak loudly and clearly.", "Interview Questions": "How persistent are you on a scale from 1 to 10?"}, {"date": "3 Nov 2014", "title": "IT Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Santa Clara University", "Interview Descriptions": "Questions ranging from behavioral to technical. Hiring process took about three weeks. It was only one interview, but there have been cases where they do multiple. Interviewed by two people.", "Interview Questions": "What is an IP address and how does it differ from a MAC address?"}, {"date": "5 Aug 2014", "title": "Business Development Representative Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Santa Clara University", "Interview Descriptions": "The interview process was quite quick and simple. I went in to observe the work environment and meet the employees. I was asked several questions about past work experience, other activities I was involved in and what my time commitment would be like. I was then given three mock cold calls in which I would use a script to do the best I could with the fake alumni.", "Interview Questions": "Do you consider yourself a dedicated individual?"}, {"date": "10 Aug 2015", "title": "Adjunct In Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1+ week. I interviewed at Santa Clara University (Santa Clara, CA) in Jun 2014", "Interview Descriptions": "I was inquiring about an adjunct position to teach in the area of finance, under the new incoming chair of the finance department.  As we discussed and I interviewed, I learned the chair wanted me apply for a tenure associate professor position, not the adjunct position.  I learned a tremendous amount, as the Finance Chair was quite courteous and helpful. Dr. Chacko is an outstanding individual. (this took place approximately June 2014).", "Interview Questions": "Do you prefer to teach undergraduate or graduate? Why?\r\nFamiliarity with case studies, and the use of case studies in teaching?"}, {"date": "16 Nov 2014", "title": "Interim Program Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Santa Clara University (Santa Clara, CA) in Mar 2014", "Interview Descriptions": "I was contacted by a recruiter from R&D Technical for an program support.  The recruiter submitted my resume to the program and they requested an interview.  I met on campus with two program directors and an assistant dean for the programs, and provided previous work samples, resumes, references, and a touch of levity..", "Interview Questions": "How would you handle the many competing events and production deadlines of the program's initiatives, and how do you handle adversity and emergency.  "}], [{"date": "15 Nov 2013", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Santa Clara University", "Interview Descriptions": "Day and a half with 30 minute appointments and meals", "Interview Questions": "Why Santa Clara?"}, {"date": "4 Dec 2013", "title": "Exam Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Santa Clara University (Santa Clara, CA) in Sept 2013", "Interview Descriptions": "The faculty support receives applications from more than 50 students, so please be patient if you do not get any response. I only expressed my interest and got interviewed in 2 weeks, then started working when exam came up.", "Interview Questions": "What would you do if one of the students in the exam fainted?"}, {"date": "15 Aug 2013", "title": "Lecturer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Santa Clara University", "Interview Descriptions": "I went to SCU's campus super excited to interview for this position.  After a very successful phone interview, they invited me to check it out and meet the department in person.  They asked me to provide a sample of my teaching style as expected.  Upon gathering in a room full of 5 faculty, I started my presentation.  I had decided to lecture on the chalk board because all of the classes I had in undergrad that I actually learned the material in were on the board and not delivered by a powerpoint presentation.  \r\n\r\nAfter choosing an undergraduate topic, I decided to start at the very basics, as undergrads come from a diverse background, especially in California.  About 5 minutes into my lecture, one of the faculty stopped me, told me the material was too easy, I was putting him to sleep and I wasn't getting to the point (mind you the point involves lots of math... sorry!).  Now, I'm really sorry you are an expert in this field, but do you think freshman and sophomores are???  If you don't start at the fundamentals, how can you expect to even apply the knowledge down the road?  They also continued to ridicule me and say that I should be using a powerpoint presentation and that none of them used book.  WHAT!  I almost fainted, undergraduate education without a book!  Seriously, you have to be joking!  Also, mind you, I am also coming from the #1 ranked university for this particular department so I have seen a lot, TAed for tier 1 researchers and lectures, and lectured in front of hundreds of students.  \r\n\r\nSo, my choice of board over powerpoint was obviously not a good one, and I would recommend if you interview here to prepare both.  Instead of continuing with my interview, the room full of people starting arguing and talking over one another to discuss this issue of ppt vs not ppt for the next 10-15 minutes.  \r\n\r\nAfter finally being motioned to continue, I began my next lesson on a different topic for upper division students.  I chose something I am very familiar with, requires a good amount of math.  Now, this ALSO was too boring for these people.  I am also sorry, I chose a topic I learned in undergrad upper div and graduate school at a top ranked program.  Also, the department chair decided to inform me she teaches this to freshman.  Really, freshman can solve differential equations...  I highly doubt that, not unless it is a prereq, which it was not.  \r\n\r\nSo, the teaching part didn't go very well.  Onto the next part.\r\n\r\nI then had the pleasure of going to lunch with the group.  Lunch, usually the most relaxing part of the day and a chance to get to know the other people in the department.  So, when I sat down after getting a glass of water.  Guess what the topic of debate was for the next 10 minutes!  How fast you got your green card!!!! I was blown out of the water!  Here I was, a Catholic, interviewing at at Catholic university and hearing this, what a distasteful conversation.  No wonder US citizens don't want to major in technical fields.  Goodness! \r\n\r\nI thought that the situation and unprofessional-ism of this department and of the people could not get any worse but it did.\r\n\r\nI went on a casual tour of the labs.  I was shown a lab that had a bunch of students working for this particular faculty member in it.  The professor the began commanding the students orders, like this was some sort of military environment!  Not explaining, just commanding!  \"Clean the bench!\" \"Write the document!\" \"Look this up!\" For a private school, this was not some sort of nurturing environment I had expected...  at all!  \r\n\r\nSo, the whole process continued for a little while longer... it basically made me decide that I actually don't want to teach in this department... I had three other much stronger offers where I could actually use my skills and PhD.\r\n\r\nThe icing on the cake was the following: I looked up the guy giving me a bad time about lecturing on a topic that was too easy, and he was a faculty candidate for my top tier university in our department. I actually remembered his lecture.  I didn't understand it, there was way too much information to process, the slides were jumbled, and there was no story to back the research that made any sense to me. If this is how the courses are taught at this university, like that lecture I remembered from 3-4 years prior, well... I am so sorry for those students paying an arm and a leg to go there and expect a good education.  The students are likely challenged by these people's teaching because they can't figure out what the heck is going on!  \r\n\r\nDespite the beautiful campus, I left feeling very disappointed.  I felt like they were mining ideas, and it is likely I was not alone in this endeavor. The structure and unprofessionalism were ridiculous.  They did not reimburse my flight.", "Interview Questions": "Why lecture and not become full tenured faculty?"}, {"date": "7 Apr 2014", "title": "Sales Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at Santa Clara University (Santa Clara, CA) in Mar 2013", "Interview Descriptions": "I came in for an interview at a time that was convenient for both my employer and myself. After a series of questions I was given two mock calls and was given a rough script in which I had to supplement the conversation. The object was to test my conversation skills", "Interview Questions": "Why are you good at sales?"}, {"date": "4 Dec 2015", "title": "Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Santa Clara University (Santa Clara, CA) in Nov 2012", "Interview Descriptions": "A quick in-person interview with a few of the administrators in the office. Very simple and straight forward conversations just trying to get to know you and your personality. They were all very friendly and welcoming. There were no questions that were trying to \"get you\" and they were very open to sharing what the environment and work would be like.", "Interview Questions": "Tell us about yourself and give us an example of how you are an organized individual."}, {"date": "4 Oct 2015", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Santa Clara University (Santa Clara, CA) in May 2012", "Interview Descriptions": "The interview process is more like pairing you with the right professor for work.  Determining what you're good at whether that be grading, working in the machine shop, advising labs.  It's all part of the process to get the right fit.  Overall it is a fairly straightforward process that is more like a resource allocation than anything.", "Interview Questions": "N/A"}, {"date": "5 Jun 2012", "title": "Tenure Track Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Santa Clara University (Santa Clara, CA) in Apr 2012", "Interview Descriptions": "3 days of meeting with faculty, presented a mock lecture and a research powerpoint.  Faculty were friendly, but not very concerned with the process, as if there were another preferred candidate.  I thought the interview was fair, but a waste of everyone's time.  the only exception to this feeling is that I learned valuable interview skills.", "Interview Questions": "How would you balance teaching and research?"}, {"date": "5 Nov 2015", "title": "ARD Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Santa Clara University (Santa Clara, CA) in Mar 2012", "Interview Descriptions": "Long and tedious. You start on group interviews and then have a series of individual ones with the dorms that have selected you. \r\n\r\nI did two rounds of interviews and then they called to select after several side discussions. \r\n\r\nIn the interviews they are often with a group of diverse people looking to understand a wide array of who you are. They questions can really range and vary.", "Interview Questions": "Often times these are more focused on interpersonal and experience to understand who you are and how you react under certain stress"}, {"date": "17 Nov 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Santa Clara University (Santa Clara, CA) in Sept 2011", "Interview Descriptions": "Very informal and casual. I met with a professor, explained why I was interested in this position and how my volunteer experience/extraciricular activities played to my strengths. I was asked if I knew how to use a couple data bases and I said I did not but that I was eager to learn and that I picked up new processes easily. Expressing interest in both the work and end goal seemed to please my interviewer.", "Interview Questions": "How do your leadership qualities play into your work ethic?"}, {"date": "13 Jul 2015", "title": "IT Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Santa Clara University in Jul 2011", "Interview Descriptions": "The process involves submitting a resume, then waiting to hear if it was acceptable, then you are called for a phone interview, followed by a brief panel the next week, After that is done then you are asked to resolve various issue between staff or students in a role play type arrangement. The actors act out a scene and you are told to advise them on how to resolve the issue. Very challenging for a first time person.", "Interview Questions": "How to solve student problems"}], [{"date": "14 May 2011", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Santa Clara University (Santa Clara, CA) in Feb 2011", "Interview Descriptions": "Phone interview with person who would be direct supervisor, and then set up personal interview.  I first met with HR representative, who told me all about all the benefits, days off, etc.  This struck me as a bit premature and a waste of time, because if I didn't get offered the job, why dangle all the bennies in front of me?  Because they pay below market, and that's how they try to lure you in, that's why.  It was followed up by a panel interview, with one person after another firing off questions.", "Interview Questions": "How judgmental a person do you feel you are?"}, {"date": "12 Mar 2014", "title": "Marketing Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Santa Clara University (Santa Clara, CA) in Jul 2010", "Interview Descriptions": "The actual process of receiving an offer took a lot longer than I anticipated. Once I received an offer, I already had another offer in hand and had accepted.  If it hadn't taken as long, I probably would have accepted this offer.", "Interview Questions": "Not many difficult questions. Very straightforward. "}, {"date": "3 May 2009", "title": "Peer Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Santa Clara University (Santa Clara, CA) in Apr 2009", "Interview Descriptions": "I initially applied by sending in my resume to the business school. After a week they invited me in for a group interview, where I interviewed with five other people. It was mostly behavior. A few questions were asked, and each person was asked an individual question. A week later, I received an invitation to be a peer advisor.", "Interview Questions": "What would you do to maintain contact with your students?"}, {"date": "11 Apr 2010", "title": "Media Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Santa Clara University (Santa Clara, CA) in Sept 2008", "Interview Descriptions": "The interviewing process is easy and relaxed.  You do not need to worry about prior experience.  Just show that you have a good personality and they give all the training necessary.", "Interview Questions": "What is your major?  "}, {"date": "8 Jul 2010", "title": "Assistant Dean of Financial Aid Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Santa Clara University (Santa Clara, CA) in Aug 2008", "Interview Descriptions": "I applied at HR and got a call to interview from the hiring manager.  She initially interviewed me and then called me back for another interview with would be coworkers.\r\n\r\nShe called one week later to say I did not get the job.", "Interview Questions": "Why do you want to transfer?"}]]