[[{"date": "22 May 2023", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Beth Israel Lahey Health (Burlington, MA) in Apr 2023", "Interview Descriptions": "Pretty straightforward. Two weeks after application, there was trouble scheduling and rescheduling with the interviewer. They didn't seem very organized internally. (I had open availability to schedule) Questions were not too difficult, asked about relevant experiences.", "Interview Questions": "Tell me about your most recent experience?"}, {"date": "5 Jun 2023", "title": "Research Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Beth Israel Lahey Health in Apr 2023", "Interview Descriptions": "Frankly the interview process is contrived and antiquated. There do not need to be as many hoops to jump through and people to shuffle through just to GET an interview set up - particularly when I hadn't even applied and was asked over and over again to interview by a recruiter.", "Interview Questions": "About past experience, what brought me to the role, etc"}, {"date": "15 May 2023", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Lahey Health (Boston, MA) in Jan 2023", "Interview Descriptions": "Quick and easy, nothing crazy. They set things up easily for me, and the process moved along at a good pace. No real problems on my end. I would say they were organized and very nice -people.", "Interview Questions": "Tell me about you past experiences at you past roles."}, {"date": "11 May 2023", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Beth Israel Lahey Health (Beverly, MA) in Feb 2022", "Interview Descriptions": "Process began with a phone interview with a human resource recruiter and then an in person interview with the dept supervisor. After recieving an offer there was a medical interview done at the Human Resource office.", "Interview Questions": "If I was a good fit for the position"}, {"date": "4 Jan 2022", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Beth Israel Lahey Health", "Interview Descriptions": "I met with 6 different people from different departments. All of them were very nice and they each had great insight into the hospital and answered all of my questions thoroughly.", "Interview Questions": "Name a difficult situation that you experienced in the past and how did you deal with it?"}, {"date": "10 Dec 2021", "title": "PFS Billing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Beth Israel Lahey Health", "Interview Descriptions": "I had a phone interview with HR. A few days later I had a Zoom interview with the manager and supervisor. A week later I had the job. Interview was easy .", "Interview Questions": "Relative job experience. They spoke mostly during the interview "}, {"date": "7 Sept 2021", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Lahey Health", "Interview Descriptions": "Phone screen, followed by on camera Zoom and/or in person meeting with Hiring Manager and HR team.  Got to see the campus and see other employees. Reviewed benefits and looked at parking situation.", "Interview Questions": "Tell me about a time when you experienced conflict in the workplace, what happened and how did you resolve it. "}, {"date": "11 Jun 2021", "title": "Patient Access Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Beth Israel Lahey Health", "Interview Descriptions": "Very thorough process. I met with the day time & night time shift manager of the ED. They did a great job outlying the roles and responsibilities of the position, and offered good advice to newly graduated students.", "Interview Questions": "They asked about my education and what I learned. They were also curious about my resume and past job experience. "}, {"date": "30 Mar 2023", "title": "Medical Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Beth Israel Lahey Health (Cambridge, MA) in Mar 2021", "Interview Descriptions": "Applied online and had an interview 1 week later. I interviewed with the practice manager and it was a very laid back interview that lasted about 30 minutes. A few days later offer was extended.", "Interview Questions": "Name a time when you had a difficult patient and how did you handle it?"}, {"date": "19 Oct 2020", "title": "Process Improvement Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Beth Israel Lahey Health", "Interview Descriptions": "There was an initial fit call to go over if I was generally qualified. Then there was an in-person interview that went over what the team did and what general tools used in continuous process improvement.", "Interview Questions": "On general Lean thinking,  and other behavioral interview questions."}], [{"date": "26 Sept 2020", "title": "Psychometrist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Beth Israel Lahey Health", "Interview Descriptions": "Applied thru the website career page and scheduled an interview within the week.  Online interview was conducted via zoom. \r\nInterview lasted 15 minutes. The hiring manager discussed the scope of work.", "Interview Questions": "Strength and Weakness\r\nFamiliarity with the job post"}, {"date": "14 Feb 2019", "title": "Patient Registrar Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Beth Israel Lahey Health (Burlington, MA) in Feb 2019", "Interview Descriptions": "The interview was very comfortable.  I felt I was being listened to and given the time to really let them know how much of an asset I would be to their work place.", "Interview Questions": "If I get along well with others."}, {"date": "7 Feb 2019", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Beth Israel Lahey Health in Jan 2019", "Interview Descriptions": "I started the interview process and my first experience with  the HR department was very positive and they show a lot of professionalism. I have been invited  for a second interview after three days from my initial contact.", "Interview Questions": "what is my future 5 years plan?"}, {"date": "3 Oct 2018", "title": "Talent Acquisition Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Beth Israel Lahey Health", "Interview Descriptions": "I had a phone screen with one of the recruiters in the Burlington office. The recruiter was a few minutes late for our call, cut me off every time I tried answering one of her questions and she completely rushed me off the phone.  I found her to be extremely rude and unprofessional.", "Interview Questions": "Why are you leaving a company after only 2 years ?"}, {"date": "29 Jan 2019", "title": "Help Desk Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Beth Israel Lahey Health (Boston, MA) in Jun 2018", "Interview Descriptions": "30 mins long, two interviewers, very detailed but comfortable interview. Was contacted by contract company, received interview confirmation after 2 weeks. Pleasant interview, was hired within a week. Started 3 weeks after initial contact", "Interview Questions": "What ticketing system for incident reports was I familiar with "}, {"date": "15 May 2018", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Beth Israel Lahey Health", "Interview Descriptions": "Met with entire HR team over the course of a day.  Found interviews to be more like easy, thoughtful conversation vs. typical interview questions.   I learned a lot about their upcoming initiatives and was excited to be potentially a part of cutting edge work.  Everyone was very nice and professional.", "Interview Questions": "Why Lahey?  "}, {"date": "2 Apr 2020", "title": "Clinical Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Beth Israel Lahey Health (Burlington, MA) in May 2018", "Interview Descriptions": "I met with the HR recruiter and was asked the interview questions but after reviewing my resume, the position required prior clinical experience which I did not have at that time so I was not offered the position.", "Interview Questions": "What are my strengths and weaknesses?"}, {"date": "4 Oct 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Beth Israel Lahey Health", "Interview Descriptions": "It was split into 4 parts. 2 behavioral, 2 technical. They asked primarily about analytical skills, ability to work in cross-functional teams and project management skills. The interviewers were very kind and often added their own input. It was more of a conversation.", "Interview Questions": "Tell me about yourself"}, {"date": "29 Jun 2017", "title": "Supply Chain Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Beth Israel Lahey Health (Boston, MA)", "Interview Descriptions": "HR is not professional.\r\n\r\nI got the interview to meet director and managers. It was a really nice talk . I felt so great to work in a whole building where people all work in supply chain work. Two days later, I got the news from Lahey Health partner HR that  I was invited for the second round interview with teams. I was so excited and felt that I would have this job.  \r\n\r\nI prepared everything.  Two days before the final interview. This HR called me asked my working status. Do you need sponsorship? I said Yes. Then she just canceled my interview, said they don't hire people who need sponsorship. I was so upset. \r\n\r\nI don't think HR is professional. She didn't do her homework. The process took two weeks. I put a lot of energy and work. Most importantly, I like this job and clicked with managers there.  She should check my status at the beginning and let me know what is the policy. When I applied for this job online, I checked the box that I need a sponsorship in the future.    \r\n\r\nAnyway, It's still a good experienc to have nice conversation with the managers.", "Interview Questions": "What is your weakness?"}, {"date": "19 Sept 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Beth Israel Lahey Health (Newburyport, MA) in Apr 2017", "Interview Descriptions": "the people were nice. general experience discussed. met with the director for  the physical interview. Then the ultimate offer by the company through HR was a general process. benefits not explained that well. sound better than they are. union not active unless you seek them out, so I'm not sure what they do.", "Interview Questions": "what kind of experience do you have?"}], [{"date": "23 Aug 2019", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Beth Israel Lahey Health in Sept 2016", "Interview Descriptions": "Met with both HR and the floor manager in two separate interviews in the same day. HR kind of throws you to the wolves, giving you nothing but a number and a letter and telling you to go find the hiring manager. Very quick - seemed desperate.", "Interview Questions": "What experience do you have that makes this job relevant?"}, {"date": "27 Jul 2016", "title": "Philanthropy Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Beth Israel Lahey Health (Burlington, MA) in Jan 2014", "Interview Descriptions": "From the application to an initial call back it was three months. Then I had two in-person interviews on different days with various people within the department. It gave me a good example of the people with whom I would be working.", "Interview Questions": "If this was the position I was really interested in."}, {"date": "20 Jun 2014", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Beth Israel Lahey Health (Burlington, MA) in Oct 2013", "Interview Descriptions": "I had to come in to meet with the staff about 4 times, which was very irritating because if i had not received the job, it would've been a waster of my time.  They need to come up with a way to meet staff no more than twice before coming to a decision as to whether or not they are interested in the candidate and whether or not they will call them with an offer.", "Interview Questions": "No difficult questions, just lies.  Promises of growth in skill and knowledge, and possible promotion, but it was false.  They just want to put someone in a position, to fill it."}]]