[[{"date": "9 Apr 2021", "title": "Recruteur De Donateur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ONG Conseil", "Interview Descriptions": "Premier entretien au telephone puis entretien physique, qui a eu lieu dans un café,  il a fallu décrire sa motivation, entretien imaginaire avec un passant. Questions sur la résilience et surtout sur la connaissance de l'association à défendre, ses valeurs, donner des chiffres, des actions effectuées, etc", "Interview Questions": "Comment tu réagis face à quelqu'un qui te dis j'aimerai bien mais j'ai pas d'argent"}, {"date": "13 Aug 2020", "title": "Recruteur De Donateurs Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ONG Conseil in Aug 2020", "Interview Descriptions": "Entretien Visio ou téléphonique assez rapide aux alentours des 20 minutes. Question banales motivation, connaissez vous l'ONG ect...  Candidature faites via leur site internent , réponse rapide ( moins d'une semaine ) et entretien dans la foulée ( meme si il a était reporté deux fois).", "Interview Questions": "Mise en situation de recrutement."}, {"date": "11 Aug 2021", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ONG Conseil in Jul 2020", "Interview Descriptions": "Un entretien de 30 minutes avec un responsable. Avec:\n- Des questions sur mes expériences précédentes;\n- Des questions sur mon engagement associatif;\n- Des mises en situations.\nL'entretien s'est bien déroulé, la réponse a été donnée rapidement.", "Interview Questions": "- Pourquoi cette association ?\n- Comment réagiriez en cas de refus de s'arrêter ?\n- Quel est la plus grande qualité chez un Fundraiser ?\n- Est-ce que vous comprenez l'importance du Fundraiser pour une association ? "}, {"date": "12 Sept 2021", "title": "Street Fundraising Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at ONG Conseil (Paris) in Apr 2020", "Interview Descriptions": "A few short questions from recruiter, why you want to work here, why you are right for the job etc. Show passion and negotiation skills. Recruiter puts you in hypothetical situation and you must react (one in which you must convince individual to sign up to monthly contributions)", "Interview Questions": "Why are you right for this role?"}, {"date": "27 Feb 2020", "title": "Recruteur De Donateur Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ONG Conseil (Paris) in Feb 2020", "Interview Descriptions": "J'ai postulé en ligne, ensuite j'ai passé un entretien téléphonique. Le dernier entretien a eu lieu par Skype et je devais fournir des dossiers complémentaires. A l'entretien, on m'a expliqué la mission, présenté l'association concernée, me poser de questions sur mes motivations pour ce poste, surtout que la mission a lieu en hiver.", "Interview Questions": "Savez-vou en quoi consiste la mission du recruteur de donateur? "}, {"date": "29 Oct 2019", "title": "Recruteur De Donateur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ONG Conseil (Lyon) in Oct 2019", "Interview Descriptions": "Entretien a duré à peu près d'une demie heure.  Le recruteur a posé des questions sur lma personnalité ainsi que des questions concernant la connaissance de metier. Un jeu de rôle qui a pour but d'animer notre capacité.", "Interview Questions": "Si la personne dit qu'elle n'a pas envie de supporter l'association ?"}, {"date": "17 Jul 2021", "title": "Recruteur De Donateur Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ONG Conseil (Paris) in Sept 2019", "Interview Descriptions": "Dans un bar, d'abord il nous demande de nous présenter puis question sur l'association que l'on va proposer aux passant, exercice de mise en situation à la fin, on m'a rappelé le soir pour me dire que j'étais pris,", "Interview Questions": "Pourquoi toi et pas un autre? "}, {"date": "23 Jun 2019", "title": "Recruteur De Donateur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ONG Conseil (Strasbourg)", "Interview Descriptions": "Premier entretien téléphonique : il faut se préparer. Se renseigner sur  l'ONG pour laquelle on a postuler c'est très important. Je n'ai pas apprécier cet entretien, j'ai senti qu'on voulait me mettre des bâtons dans les roues, et j'ai trouvé le recruteur méprisant. J'ai quand même réussi à être sélectionnée pour  passer un entretien d'embauche dans un café le lendemain.\r\nJe me suis mieux préparée, et puis finalement je me suis senti plus à l'aise. Le plus important: rester soi-même !!", "Interview Questions": "Présente toi "}, {"date": "11 Jun 2019", "title": "Recruteur De Donateur Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ONG Conseil (Paris) in Jun 2019", "Interview Descriptions": "Une première approche téléphonique qui s'est conclu par un entretien avec un recruteur dans un café. Expérience très mauvaise, dès le début j'ai eu la sensation que le recruteur m'avait catalogué et à cherché la petite bête tout le long de l'entretien pour me descendre. Il aussi fait une petite reconstitution comme ci je l'interpellai dans la rue. De plus, il a beaucoup insisté sur la capacité à \"demander de l'argent dans la rue\". En prime j'ai eu le droit à une superbe question : \"mais psychologiquement tu te sens bien ?\"", "Interview Questions": "Tu penses réussir à avoir combien de donateur par jour ? \r\nC'est quoi un recruteur de donateur ?\r\nQuelles sont les qualités nécessaires ? \r\n"}, {"date": "25 May 2019", "title": "Recruteur De Donateur Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at ONG Conseil (Paris) in May 2019", "Interview Descriptions": "Il faut postuler en ligne. Ils répondent généralement rapidement, par téléphone. Ils posent quelques questions au téléphone et nous donnent un lieu pour l'entretien d'embauche, c'est généralement dans un café: Le Grand Cerf ou Spicy Home", "Interview Questions": "2 qualités et 2 défauts ?"}], [{"date": "21 Mar 2019", "title": "Recruteur De Donateur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ONG Conseil", "Interview Descriptions": "L'entretien s'est fait via Skype, et a duré environ 15 min. Le recruteur mettait à l'aise et finit l'entretien avec une simulation du job. Je n'ai pas aimé ce format d'entretien via skype et était très mal à l'aise durant la simulation. Mais le recruteur était plutôt rassurant et a donné une réponse très rapidement.", "Interview Questions": "Pourquoi vous plutôt qu'un autre ? Que diriez-vous pour convaincre quelqu'un qui dit qu'il n'a pas assez d'argent pour être donateur ?"}, {"date": "27 Apr 2018", "title": "Recruteur De Donateur Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at ONG Conseil (Paris)", "Interview Descriptions": "Bref entretien téléphonique afin d'apprécier la motivation du candidat ainsi que sa connaissance minimum de l'entreprise et du client.\r\nEn cas de succès de l'entretien téléphonique un rdv pour un entretien physique est fixé.\r\nCelui-ci a eu lieu dans un bar.", "Interview Questions": "Demande de présentation (parcours, personnalité)"}, {"date": "1 Jan 2018", "title": "Recruteur De Donateur Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ONG Conseil (Angers) in Dec 2017", "Interview Descriptions": "Entretien téléphonique dans un premier temps puis un entretien face à face avec le responsable régionale .\r\nEntretien téléphonique dans un premier temps puis un entretien face à face avec le responsable régionale", "Interview Questions": "Quelles sont vos motivations pour ce poste ?"}, {"date": "21 Dec 2015", "title": "Recruteur De Donateur Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at ONG Conseil", "Interview Descriptions": "L'entretien s'est déroulé en France,  dans un café, le chef/ recruteur avait 45min de retard , question assez faciles cependant il m'a fait une promesse , comme quoi il me rappellerai le lendemain,  qu'il n'a pas tenu et j'ai dû attendre 4 jour pour avoir une reponse.", "Interview Questions": "Que faites vous si les gens ne veulent pas où ne peuvent pas faire de dons"}, {"date": "27 Feb 2018", "title": "Recruteur De Donateur Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at ONG Conseil (Toulouse) in Jan 2014", "Interview Descriptions": "Entretien sur la personnalité avant tout, il faut être bien renseigné sur le modèle des Ong et la nécessité de collecter des fonds, les hard skills ne sont pas utiles réellement, le socio type sportif aimant les relations humaines et ouvert sur le monde est pertinent.", "Interview Questions": "Quel est selon vous la compétence la plus importante pour ce poste."}]]