[[{"date": "6 Oct 2020", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Argosy University", "Interview Descriptions": "The director and president were very personable. They asked about experience with customer service and how to build trust. They took me to meet the team and also went out a tour of the campus and met with faculty.", "Interview Questions": "What makes you the best candidate for this job?"}, {"date": "1 May 2018", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Argosy University (Eagan, MN) in Nov 2017", "Interview Descriptions": "Typical application. Spoke to a recruiter via phone at first contact. Came in and spoke to a random admissions rep. Spoke briefly to the senior director of admissions. Hired shortly thereafter.", "Interview Questions": "Strengths and weaknesses. "}, {"date": "26 Sept 2017", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Argosy University (Pittsburgh, PA)", "Interview Descriptions": "Interviewed by the department chair. Chair was thorough in describing position and expectations. Chair introduced me to other faculty and administrative support staff. Chair provided information on courses that appeared to be a good match for my education and experience.", "Interview Questions": "How do you see your professional background contributing to the development of the department/program?"}, {"date": "4 Aug 2017", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Argosy University (San Diego, CA) in Feb 2017", "Interview Descriptions": "I was reached out to by the company via LinkedIn, interviewed one week later, and started one week after that. I was interviewed by the campus president directly and then was sent on to a financial aid advisor (who was a close friend of the president and did not actually have a leadership role).", "Interview Questions": "What was your experience like in your last position, and what are you looking to get out of this one?"}, {"date": "12 May 2021", "title": "Admissions of Director Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Argosy University (Chicago, IL) in Jan 2017", "Interview Descriptions": "Went out of business because of issues. Easy interview. Place is now closed. Will not reopen. Feel sorry for students. The college is closed. Will not be reopened. Now is the time for all good people to come to the aid of their college.", "Interview Questions": "Work history is good and important "}, {"date": "17 Dec 2016", "title": "Enrollment Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Argosy University (Atlanta, GA)", "Interview Descriptions": "Enrollment director and another upper management conducted interview. They are partial to former or current UOP employees because of indisputable training. Expectations for high goals is aggressive. I felt as though Argosy was more on a fishing expedition, checking out the competition. They seemed to focus more on operations than me, the applicant. I did not get a good vibe. The temperament if the interview changed as soon as I disclosed how much I had researched the company and started asking my 20 questions. They seemed intimidated.", "Interview Questions": "They asked me to describe my experience at UOP. Every question was focused on University of Phoenix, including my experience as a student. They drove the interview and didn't seem interested in my questions about them, particularly in light of forced changes due to Obama administration mandates on proprietary practices, which grossly affected University of Phoenix."}, {"date": "11 Nov 2016", "title": "Admissions Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Argosy University (Phoenix, AZ) in Nov 2016", "Interview Descriptions": "The initial interview was a phone interview with the HR manager. The interview process was an hour. The process was relevant, to the point, informative, and extremely pleasant overall. The interviewer really dug into my experience, interest, and abilities. The questions were standard questions to expect during an interview for an admissions leadership role.", "Interview Questions": "What has been your most challenging interaction with an employee?"}, {"date": "29 Jun 2016", "title": "Assistant Director of Admissions Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 6 days. I interviewed at Argosy University (Atlanta, GA) in Jun 2016", "Interview Descriptions": "The interview was conducted by telephone. It lasted about 20 mins and I was asked appropriately 5 questions. The interview was conducted by a recruiter from EDMC ( Education Management Cooperation).The interview was conducted on a Wednesday and I heard back (via email) from the recruiter. This was an interview for Argosy University Atlanta.", "Interview Questions": "So, tell me about yourself?\r\nWhat is your greatest weakness?"}, {"date": "19 Mar 2016", "title": "Financial Aid Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Argosy University", "Interview Descriptions": "Had a phone interview with HR then a phone interview with Director and finally an in person interview. Had one last phone interview with the campus president same day. I was hired the day after the in person interview pending background and drug test. They sent an offer letter and I had 48 hours to sign and send back. I accepted.", "Interview Questions": "Why I wanted to work there? How would I reach out to a student to collect a payment."}, {"date": "3 Sept 2015", "title": "Succcess Advisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Argosy University", "Interview Descriptions": "Sign in, taken to a side room, asked for a resume, and asked a few questions. Fairly vanilla for an interview.\r\n\r\nThe interview was fairly short, however, the interview was focused on how many calls can be made at one time as opposed to the \"student relationship\" discussed over the phone. The interviewer said that there would be at least 250 phone calls per day, and when broken down over an 8 hour workday, that comes out to 1.92 minutes per phone call. Assuming that half of those calls are not answering, that still leaves less than four minutes per call, including dialing, and not including breaks or lunch (if it is part of the 8 hours or not).", "Interview Questions": "Can you handle making 250 phone calls per day?"}], [{"date": "27 Nov 2018", "title": "Financial Aid Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Argosy University in Sept 2015", "Interview Descriptions": "Phone interview first. In person interview with usually two managers. HR will call if you got  the position in a couple of days sometimes the same day with Argosy. AI and South tend to not call if you are not selected. You will probably have to call them to check in", "Interview Questions": "How would you handle an upset student"}, {"date": "23 Mar 2016", "title": "Database Administrator Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Argosy University (Chicago, IL) in Aug 2015", "Interview Descriptions": "Their administration department was so effective on learning applicant's background. Most requirements were posted on their websites. If they want know more about the application, a representative will contact you. In addition, you can contact this representative anytime you have questions. They are very friendly and helpful.", "Interview Questions": "What is you GPA in previous school"}, {"date": "13 Jul 2015", "title": "Vice President Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Argosy University (Pittsburgh, PA) in Jun 2015", "Interview Descriptions": "The interview process was very thorough, rigorous. Wanted to be sure I was a chemistry fit as well as skills and expertise.  I interviewed with peers, subordinates and superiors.  They used SKYPE, phone and in-person", "Interview Questions": "Describe one of my failures and what I learned."}, {"date": "8 Feb 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Argosy University (Denver, CO) in Mar 2015", "Interview Descriptions": "it was ok one of the directors was bashing other director red flags no tour director was to busy to have a good conversation. I felt like they kept dragging me a long with no response or any feed back", "Interview Questions": "experience was I willing to work late nights and weekends"}, {"date": "28 Dec 2014", "title": "Admissions Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Argosy University", "Interview Descriptions": "6 total interviews which ensure thorough investigation into the existing culture & team environment. For-profit education is taking a necessary turn towards a student-centric focus which is a long time coming.", "Interview Questions": "Define accountability."}, {"date": "19 Feb 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 days. I interviewed at Argosy University (Chandler, AZ) in Sept 2014", "Interview Descriptions": "The interview process was fairly easy and laid back. The phone interview and the 1:1 was friendly and seemed more like a casual conversation. I was given a phone interview on a Monday. By Thursday I had my 1:1 interview and I was offered the position by Friday.", "Interview Questions": "Advice: Ask a lot of open-ended questions. What? How? Where?"}, {"date": "2 Oct 2015", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Argosy University (Seattle, WA) in Sept 2014", "Interview Descriptions": "Multiple interviews. First is over the phone, then 2 in-person interviews. They are flexible about interview times, and it was obvious that you needed to be in business attire judging by the attire of the staff here doing the interviews.", "Interview Questions": "They ask you about your experience, then delve into the job responsibilities and ask how your knowledge/experience applys"}, {"date": "12 Nov 2015", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3+ months. I interviewed at Argosy University (Salt Lake City, UT) in Mar 2014", "Interview Descriptions": "Through a friends recommendation was referred to the position and met directly with the president and later with the senior director. The president was focused and direct with her questions and objective for the position. During one of the six interviews sat in with an representative to listen in on what a typical conversation with a prospective student. The entire process took 3.5 months and 6 interviews to finally be offered the position.", "Interview Questions": "How I would respond to an applicant who stated they were not interested in attending the campus."}, {"date": "22 Feb 2014", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Argosy University (San Francisco, CA)", "Interview Descriptions": "Called Senior director to follow up on application. A week later was called back for an interview. Interviewed with 3 people and met a few employees. Got job a day after interview", "Interview Questions": "Tell us how your past experience can be beneficial to this position."}, {"date": "9 Jan 2014", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Argosy University", "Interview Descriptions": "Online application, phone interview, two campus interviews", "Interview Questions": "N/A"}], [{"date": "14 Jan 2013", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Argosy University (Arlington, VA)", "Interview Descriptions": "1). Group interview (figure out a way to stand out)\r\n2). In person interview\r\n3). Offer \r\n\r\nPretty straight forward from what I can remember.", "Interview Questions": "I am sorry, I dont remember. "}, {"date": "14 Jan 2013", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Argosy University (Dallas, TX) in Nov 2012", "Interview Descriptions": "Tour and low-key interview with Sr. Admissions Representative, then Interview with the Director of Admissions, then the Sr. Director of Admissions, and finally if each one of them are interested there is an interview with the President of the campus.", "Interview Questions": "What can you do to increase admissions?"}, {"date": "15 Oct 2015", "title": "Online Faculty Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Argosy University (San Diego, CA) in Sept 2012", "Interview Descriptions": "Phone interview where multiple people on the call talking over one another.  This made it very confusing to know exactly who you were speaking and disrupted the flow of the interview process. After the interview there was no follow up, and it was near impossible to contact the school for information regarding the status.", "Interview Questions": "Explain your experience in developing curriculum and student learning objectives. "}, {"date": "13 Aug 2012", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Argosy University (Denver, CO)", "Interview Descriptions": "Applied online and was contacted via email from HR. A phone interview was set up and conducted with the actual hiring manager. The phone interview lasted about 40 minutes. I was emailed about two weeks later about my hiring status.", "Interview Questions": "What do you consider your best success? (either personal or professional)"}, {"date": "5 Feb 2014", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Argosy University (Arlington, VA) in Jul 2012", "Interview Descriptions": "The hiring process went pretty quick and smoothly. The HR manager was VERY nice, however she no longer works for the company. I was interviewed by the Senior Director of Admissions, he was very nice as well, but he no longer works for the Argosy in DC. They even had me interview with some of the current reps, which was very relaxed.", "Interview Questions": "Im not sure. You just need to be self-motivated, and driven. "}, {"date": "2 Mar 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Argosy University (Eagan, MN) in Jul 2012", "Interview Descriptions": "met with both directors and campus president, met also with HR. Interview process was not horrible and pretty straight forward just need to know why you want to work in this industry and why AUTC is a good fit for you and you for them", "Interview Questions": "why this job?"}, {"date": "3 Jun 2016", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Argosy University (Pittsburgh, PA) in Mar 2012", "Interview Descriptions": "The interview was laid back and structured like a conversation (as the prospective employee would be having with potential students).  The questions were typical and I felt that the interview was easy to prepare for.  A lot of my higher level questions were pawned off and never answered.", "Interview Questions": "You seemed to be quite successful with your last organization, what would make you want to leave them for us?"}, {"date": "30 Dec 2012", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Argosy University (Chicago, IL) in Feb 2012", "Interview Descriptions": "Very accommodating and straight forward", "Interview Questions": "What you liked least about your current employer"}, {"date": "15 Sept 2015", "title": "Admissions Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Argosy University (Seattle, WA) in May 2011", "Interview Descriptions": "I applied online. It was a panel interview with three people.  I had to fill out a bunch of paper work and then answer some verbal questions.  The process was actually pretty laid back. Come to find out, the department was desperately understaffed at the time and the people who interviewed me did not have a lot of experience in hiring.", "Interview Questions": "What is your biggest area that you could improve upon."}, {"date": "21 Feb 2013", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Argosy University (Phoenix, AZ) in Apr 2010", "Interview Descriptions": "Not very hard at all.  I just talked to a lady and then met with a manager.  I don't get why others thought this was hard.  I showed up 30 minutes late and I still got the job.", "Interview Questions": "There wasn't any.  They just had some stooge ask questions from \"Interviewing for Dummies.\""}], [{"date": "8 Jun 2012", "title": "Assistant Director of Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 days. I interviewed at Argosy University (Schaumburg, IL) in Dec 2009", "Interview Descriptions": "I got the information about Argosy from a head hunter who put me in toch with the director of admissions.  The interview was good one on one and then I had aecond interview which included the president of the campus.Many peopel are more likely to be successful if they drop off their application in person.  It works.", "Interview Questions": "Describe a difficult challenge and how you addressed it."}, {"date": "18 Oct 2012", "title": "Senior Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Argosy University (Alameda, CA) in Jul 2008", "Interview Descriptions": "One interview, hired within 24 hours.", "Interview Questions": "All situational questions. How would you.... What would you do...... Tell me a time........ Why are the best candidate for this position? "}]]