[[{"date": "10 Jul 2023", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Catholic University of America (Washington, DC)", "Interview Descriptions": "The interview process was 5 stages, involving phone interviews, Zoom interviews, and online assessments. Each stage was conducted remotely. Various members of faculty and staff were present for each round of the interview.", "Interview Questions": "What experience do you have with entrepreneurship?"}, {"date": "18 Dec 2022", "title": "Copyeditor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Catholic University of America", "Interview Descriptions": "There was no formal \"interview\" process for this job. They solicited a resume and asked some questions about my interests via email. I know they checked both references that I supplied before offering me the position.", "Interview Questions": "Any experience editing book-length manuscripts?"}, {"date": "16 Oct 2022", "title": "Assistant Director, Annual Giving Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Catholic University of America", "Interview Descriptions": "5 rounds of interviews with various people on staff. Some of the Interviews were very negative, but most were positive. Not sure some people understood what the actual position was.", "Interview Questions": "Why do you want to work at Catholic University?"}, {"date": "1 May 2022", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Catholic University of America", "Interview Descriptions": "Took a bit to respond to resume, scheduled interview pretty quickly after they called. Long but typical interview process for a university. Interview with multiple people throughout the day. Got a tour of the department as well.", "Interview Questions": "Name a time you dealt with an unhappy individual. How did you mitigate the situation"}, {"date": "20 May 2022", "title": "Metadata Cataloger Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Catholic University of America in Apr 2022", "Interview Descriptions": "the person who interviewed me did not do a good job recruiting me, for sure. it is too bad because CUA is a good school and I was looking forward to the possibility of working there. When I asked the person to expand more on what s/he meant, s/he said, \"you know what I am talking about\" and did not expand on what was requested. It left me thinking, do you want someone to work there?", "Interview Questions": "can you handle cataloging by yourself? \r\nthere is a 5-year backlog, can you handle it all? \r\nhow soon can you start? "}, {"date": "17 Mar 2022", "title": "Admissions Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Catholic University of America (Washington, DC) in Feb 2022", "Interview Descriptions": "First round interview on zoom; second round interview on campus. Interviewers were very prepared, asked 10+ behavioral questions in each round. \r\nI heard back from the CUA about 1 month after I submitted my application and was invited for the second interview 1 week after the first one.", "Interview Questions": "Go over the resume; experience in student services; how do you handle difficulty situation and criticism "}, {"date": "1 Apr 2021", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Catholic University of America", "Interview Descriptions": "We had a good first and second interview. Dropped  off the map after that and wasn't available by phone or email, did not return any communications. Did not message about final decision.", "Interview Questions": "How would mission and values impact your work"}, {"date": "22 Feb 2022", "title": "Director of Corporate Partnerships Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Catholic University of America in Jun 2020", "Interview Descriptions": "The interview advance communication was clear and direct, I felt prepared on who I would be interviewing with. The follow-up communication was non-existent. There was no feedback, which would have been helpful as a jobseeker.", "Interview Questions": "Tell me how you have managed partnerships in your current role."}, {"date": "28 Mar 2018", "title": "Education Abroad Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at The Catholic University of America (Washington, DC)", "Interview Descriptions": "It was an in-person interview with a three person panel comprised of members of the Center for Global Education.  The interview lasted about half an hour and was fairly informal.", "Interview Questions": "Reasons for interest in study abroad, whether I also had any interest in international student affairs."}, {"date": "6 Apr 2020", "title": "Partnership Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Catholic University of America (Washington, DC) in Jan 2018", "Interview Descriptions": "The chief interviewer seemed unprepared/distracted and asked boilerplate questions that didn't really get to the essence of the job.  The setting was informal.  Still, it was a pleasant interview.", "Interview Questions": "Where do you see yourself in 10 years"}], [{"date": "15 Mar 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at The Catholic University of America (Washington, DC) in Jun 2017", "Interview Descriptions": "One in person interview that lasted one hour. There were more basic questions but then it was mainly what was provided from my resume. A lot about my ideas for the team and new ideas and concepts to implement to make better processes.", "Interview Questions": "What is your work style?"}, {"date": "3 Aug 2021", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 3 days. I interviewed at The Catholic University of America in Jan 2017", "Interview Descriptions": "Easy to handle. Nothing hard. Very relaxed and informal and easy. Lots of conversational talking and very few formal questions. You'll do fine if you are relaxed and confident.  Go for it.", "Interview Questions": "They ask about your experience."}, {"date": "9 Aug 2016", "title": "Assistant Director for Global Initiatives Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Catholic University of America (Washington, DC) in Aug 2016", "Interview Descriptions": "Apply online or via snail mail (who still uses snail mail for applications)! They demand that you submit a cover letter and resume (fine that is standard), but download a non-writeable PDF application (old-school) for the university and submit that, plus your salary requirements. That is a bit extreme.", "Interview Questions": "Salary requirements, past work experience, etc."}, {"date": "17 May 2017", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at The Catholic University of America (Washington, DC) in May 2016", "Interview Descriptions": "None really; ask professors if they could use a student assistant. If the department's budget says yes, then its a simple position to apply for. The only stipulation is that the student must have taken that class and passed above a specific grade threshold.", "Interview Questions": "How is your current workload? Can you balance grading assignments and working with students along with your current schedule"}, {"date": "24 Mar 2017", "title": "Graduate Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at The Catholic University of America (Washington, DC) in May 2016", "Interview Descriptions": "The process was fast and it all went smoothly. It was a panel interview of an hour. They were very nice and the question were easy to answer. They reached out to me with an offer 4 weeks later. I accepted the offer and its been great working there.", "Interview Questions": "Why are you applying to this position?"}, {"date": "20 Jun 2016", "title": "Finance Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at The Catholic University of America (Washington, DC) in Mar 2016", "Interview Descriptions": "Very quick and straight to the point. I had two interviews, phone based and then face to face the following day as they were eager to fill a soon to be vacant position. I was asked questions based on my past experiences, and I had a chance to ask questions. the face to face was a follow up on the phone interview, I guess they just wanted to see my face. Was informed about the nature of the job, day to day tasks and basically the hierarchy of staff in the department. I think at that point I knew I was going to be hired.", "Interview Questions": "How familiar are you with numbers?"}, {"date": "27 Mar 2016", "title": "Conference Services Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at The Catholic University of America in Feb 2016", "Interview Descriptions": "I was a little surprised upon arriving to find that it would be a panel interview with four interviewers. However, I found it to be a pretty friendly and casual process. I didn't feel like any unexpected or unfair questions were asked. Anyone who prepared adequately should have been able to address everything they asked.", "Interview Questions": "What strategy would I employ to build on and expand the conference center's existing business?"}, {"date": "14 Dec 2016", "title": "Outreach Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at The Catholic University of America (Washington, DC) in May 2015", "Interview Descriptions": "Paper application, many emails for scheduling, phone interview, then on to on campus interview. Waited for 30 days, then another on campus interview. 2 weeks later, job offer was made.", "Interview Questions": "Why do you wish to continue working with students and why at CUA?"}, {"date": "23 Mar 2015", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Catholic University of America (Washington, DC) in Mar 2015", "Interview Descriptions": "First, there was a phone screening. The person performing the screening told me the interview process would be as follows: finish the rest of the phone screenings; conduct phone interviews for the best candidates from the phone screenings; invite the strongest phone interview contenders onto campus for the first round of interviews; then have a second round of interviews based on the first round of on campus interviews; and finally provide an offer. Apparently, I did so well during the screening, I was asked to come in for an interview. I was flattered.\r\n\r\nHowever, it snowed the day before my interview. The University had a 2 hour delayed opening. I was in constant email contact with one of the two interviewers, letting her know I was going to be there when the university opened if it didn't disrupt the interviewers schedule. She assured me everything was fine, and to be at the university when it opened.\r\n\r\nWhen I arrived at the interview, I was greeted by the phone screener and the second interviewer. She told me that the other interviewer could not make it because the public schools were closed and he needed to stay home and take care of his child.\r\n\r\nShe and I continued the interview, with most of the same questions she asked on the phone being asked again face-to-face. The only other different interview question asked is given below. Whether I answered it properly or not (to her subjective liking) is another question. I'm assuming not, since she told me she'd call me \"In a couple of days,\" to reschedule the interview to include the other interviewer, but she never did.\r\n\r\nShe never even called to say the position was given to someone else. I called after 2 weeks wondering what happened (as I am from academia. This is the first time applying for staff positions. As a professor, I always received an email, phone call, letter, something that told me what was next). That's when she told me they offered the job to someone else, and if that person doesn't accept, then she'll contact me. Pretty rude in my book.", "Interview Questions": "\"We have a male professor who only teaches using videos. How would you approach this person and help him change?\""}, {"date": "20 Apr 2015", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Catholic University of America (Washington, DC) in Feb 2015", "Interview Descriptions": "That was A phone interview which took about 15 minutes. Three interviewers but questions were mainly from one of them, who asked tough questions like why you took an industrial job when you graduated. At the end of the interview, they asked me if I have any questions. The phone interview went fine.", "Interview Questions": "Describe your research in one sentence."}], [{"date": "23 Aug 2014", "title": "Student Affairs Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "The process took 2 months. I interviewed at The Catholic University of America", "Interview Descriptions": "2 part interview process-- First was a phone interview which lasted about 30 minutes. I was then called for an on-campus interview which lasted two hours. The first part of the interview was about 45 minutes with the director followed by a panel interview. \r\nThe interview questions were well thought questions. Not a canned interview approach. Each person had thoroughly read my resume and cover letter and posed relevant questions.\r\n Following the interview all of my references were checked and then I was offered the job about 7-10 days later. \r\nHR called with the job offer and salary offer (not the director/manager) which was unusual. HR was totally unwilling to negotiate on salary or benefit package at all. Experience with HR was negative. \r\nThe entire process took about 2+ months.", "Interview Questions": "N/A"}, {"date": "8 Oct 2016", "title": "Student Assisthant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at The Catholic University of America (Washington, DC) in Aug 2014", "Interview Descriptions": "Normal interview questions. mainly asking about availability since it is a student job. Nothing too hard or complex, and no questions about strengths and weaknesses. I think the only question was in regards to why do you want the position. Its through the school, so they want you to work and will give you the job.", "Interview Questions": "Why do you want to work here"}, {"date": "11 Apr 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at The Catholic University of America", "Interview Descriptions": "Graduate school application", "Interview Questions": "N/A"}, {"date": "23 Jun 2015", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Catholic University of America (Washington, DC) in Oct 2012", "Interview Descriptions": "There was an online application, and then a follow up interview. The interview was professional yet relaxed. The interviewer was kind and welcoming and very approachable. She addressed the mission of the office and the requirements of the position. We discussed how I would handle my course work as well as working with the office.", "Interview Questions": "How would you address a difficult situation?"}, {"date": "31 Aug 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at The Catholic University of America (Washington, DC) in Mar 2011", "Interview Descriptions": "I was interviewed by several people in the department.  Each person asked different questions and were open to answering some of mine.  They discussed duties I was to perform, and what the office was like.  Overall was very decent an interview and each person made a point of making me feel comfortable and laid back.", "Interview Questions": "How long do you see yourself with us?"}, {"date": "20 May 2014", "title": "Sacristan Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at The Catholic University of America (Washington, DC) in Sept 2010", "Interview Descriptions": "I had one interview after submitting a short statement of intent. The interview was short and to the point, and I was offered a position the next day. The interview focused on the technical requirements of the position, the ability to create and maintain my own hours, and the importance of the job for the Church at large, as well as in the community.", "Interview Questions": "Why is this job important to you?"}, {"date": "10 May 2010", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at The Catholic University of America (Washington, DC) in Apr 2010", "Interview Descriptions": "One day interview. The typical: meeting with search committee, school installations and labs tour, meeting with Dean, class presentation to students and faculty, lunch with student leadership, university tour, closing interview with search committee, dinner with a few faculty.", "Interview Questions": "Why do you think CUA should choose to hire you?"}]]