[[{"date": "15 Jun 2023", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dialysis Clinic Inc (Albany, GA)", "Interview Descriptions": "Straight forward interview questions with some analyzing critical thinking. Really nice hiring manager and exceptionally nice nephrologist! They just want to make sure you would be a great addition to the team. They will test your critical thinking skills a bit and the nephrologist will test your ability to doing things under pressure.", "Interview Questions": "Why do you want to work here? What skills do you have that would make you a great fit in joining our team?"}, {"date": "5 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Dialysis Clinic Inc", "Interview Descriptions": "Met with Clinical Supervisor for series of questions and tour of the facility. Talked about pay rate and benefits along with what a daily day is like working as a dialysis Registered Nurse.", "Interview Questions": "Weakness and strengths about myself."}, {"date": "5 Feb 2021", "title": "RN Charge Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dialysis Clinic Inc (Lexington-Fayette, KY) in Jan 2021", "Interview Descriptions": "Quick, gave me time for lots of questions and relaxed. The manager was very professional and transparent without the whole clinic. Even though I didn’t get offered the job, I am still interested in employment with this company.", "Interview Questions": "Many questions were ask but pretty run of the mill. \r\n."}, {"date": "22 Nov 2020", "title": "Social Worker Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Dialysis Clinic Inc (Jacksonville, FL)", "Interview Descriptions": "The Clinic Manager and I played phone tag for a week before we were able to schedule an interview. I then met with her and a social worker that works there. The social worker gave off a negative vibe and was even rude with some of her questions. They basically did their best to put one off from wanting to work at their location in Jacksonville. The Clinic Manager called me a few times after the interview to what I'm sure was to offer me the position.", "Interview Questions": "Can you handle being verbally abused by staff and the patients?"}, {"date": "6 Oct 2021", "title": "Senior Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Dialysis Clinic Inc in Oct 2020", "Interview Descriptions": "For the initial interview, I was sent a link and asked to join an online meeting.  I was then asked questions by four people: manager, database admin, team lead and a developer.", "Interview Questions": "Please tell us about yourself."}, {"date": "12 Dec 2019", "title": "Medical Social Worker Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Dialysis Clinic Inc (Brooklyn, NY)", "Interview Descriptions": "Initial interview,  did not hear much for a while, 2nd interview month later with more staff members. Initial interview,  did not hear much for a while, 2nd interview month later with more staff members.", "Interview Questions": "Flexibility regarding full/part-time \r\n"}, {"date": "30 Jul 2019", "title": "Equipment Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Dialysis Clinic Inc (Lexington, TN)", "Interview Descriptions": "Very laid back interview with none of the crazy interview questions like a lot of companies have now.  More of a get to know you interview and learning your background and family life.  It was the best interview I had ever had.", "Interview Questions": "How flexible I could be with tasks given to me. "}, {"date": "23 Jan 2019", "title": "Dt Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Dialysis Clinic Inc", "Interview Descriptions": "Emailed me after a week. Had interview. Took about a week to hear back. Called references and then called and offered me the position. Did background check and drug screen.", "Interview Questions": "Strengths "}, {"date": "21 Aug 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dialysis Clinic Inc (New York, NY) in Jul 2018", "Interview Descriptions": "I applied online and when I didn’t hear anything I called a few weeks later to follow up on my application. I was then asked to come in for an interview a few days later. After they called all my references they  offered a job 3 days later.", "Interview Questions": "What do you need in a supervisor in order to succeed?"}, {"date": "11 Aug 2018", "title": "RN Position Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Dialysis Clinic Inc (Spartanburg, SC) in Jul 2018", "Interview Descriptions": "Interview went great it lasted over an  hour and I was so impressed with what Dci offered I prayed and prayed I would get the job . Dialysis and helping people with renal care is a passion of mine. I was then called back to shadow the clinic for a day and it was great I loved it,", "Interview Questions": "Lots of questions why I chose this kind of nursing and my history including talents and experiences."}], [{"date": "17 May 2018", "title": "Ccht Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dialysis Clinic Inc (New Orleans, LA) in Mar 2018", "Interview Descriptions": "I thought the interview went well. I even sent a thank you note. I didn't even get a reply saying the position was filled. I think that is very unprofessional.", "Interview Questions": "What was my reason for leaving my last employer."}, {"date": "11 Apr 2018", "title": "Pct Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dialysis Clinic Inc in Oct 2017", "Interview Descriptions": "Went thru 1 interview with the manager, then a 2nd interview that I met with the team and the team was involved in the interview process--assuming that they had an opinion whether or not I was hired.", "Interview Questions": "How do you handle situations with conflict?"}, {"date": "5 Nov 2017", "title": "Junior .NET SQL Software Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Dialysis Clinic Inc (Chicago, IL) in Sept 2017", "Interview Descriptions": "Initially, I have applied online and did not get an invite for a phone screen interview. A month later, a recruiter from TEK Systems contact me regarding the same position and explained briefly about the role and their interview process. After 2 weeks of completing an internal assessment and providing 2 references, I received an invite for a technical phone interview.\r\n \r\nThe technical interview took 20 minutes where the interviewer asked me 15-20 questions about SQL and LINQ. She asked the question, repeated it and typed my answers after I completed answering. There was no time to ask questions and only at the end when I asked about the role, the lady was rude enough to refer me back to the recruiter. Overall, the atmosphere was negative where it felt like I was talking to a robot. \r\n\r\nThe following day, I called the recruiter for a feedback but there was no answer. She called me back 2 hours later where she mentioned that the company decided not to proceed with my candidacy for this role.", "Interview Questions": "Explain what is Denormalization and why would you use that?"}, {"date": "12 Jan 2021", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Dialysis Clinic Inc (Nashville, TN) in Jun 2017", "Interview Descriptions": "The interview consisted of typical interview questions and walking around the lab the meet people. Nothing  was different about their process except that they requested all of my previous transcripts.", "Interview Questions": "Are you ok with taking call?"}, {"date": "21 Jun 2017", "title": "Dietitian Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Dialysis Clinic Inc (Spartanburg, SC) in Jun 2017", "Interview Descriptions": "Interview process was fairly informal. 2 staff members in the conference room. We talked about the job opening, about myself, answered interview questions, and made some jokes/laughed. The ladies were very nice and welcoming.", "Interview Questions": "Basic Interview questions, strengths/weakness/previous experience/why I see myself as a good fit/ etc"}, {"date": "13 Sept 2016", "title": "GL Bookkeeper Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Dialysis Clinic Inc (Nashville, TN) in Sept 2016", "Interview Descriptions": "Interviewed with the accounting manager.  Took a written test.  Was told a decision would be made the following week, but I received an offer later that day.  Office seemed segregated and cluttered", "Interview Questions": "Do you have any experience with your degree?"}, {"date": "7 Mar 2016", "title": "Corporate Nurse Consultant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Dialysis Clinic Inc (Nashville, TN) in Mar 2016", "Interview Descriptions": "I work for DCI already as a PRN Nurse at a Hemodialysis Clinic and saw an internal email about a Corporate Nurse Consultant Position that was open our of Nashville, TN. So I emailed the Talent Acquisition at DCI about my interest in the position and he sat up a telephone interview with the Director of the program at the Corporate Office. After having a brief telephone interview with the Director, she said to email her my availability to get me down to Nashville to do a face to face interview and they would cover the hotel and flight for me to come interview.", "Interview Questions": "Tell me a little about yourself...."}, {"date": "3 Sept 2015", "title": "Histocompatibility Technologist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dialysis Clinic Inc (Nashville, TN)", "Interview Descriptions": "I found the job opening online, called that day and got scheduled for an interview within the week. They were so desperate for qualified candidates that I was hired during the interview.", "Interview Questions": "When can you start?"}, {"date": "21 Oct 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Dialysis Clinic Inc in Sept 2015", "Interview Descriptions": "The interview was very comfortable. I  felt  the nurse manager gave me a good overview of what to expect from the company. I was given an overview of the company. I was given a tour of the clinic and introduced to the staff.", "Interview Questions": "how long have I  been a nurse"}, {"date": "24 May 2014", "title": "Medical Biller Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Dialysis Clinic Inc (Tucson, AZ)", "Interview Descriptions": "Administrator personally interviews. Basically you are interrogated for 2 hours and then told of how they take care of their employees. You are challenged by endless questions. Some of which are not job related. You leave exhausted and your head spinning for a medial job.", "Interview Questions": "Most difficult question was asked before I was told anything about the job - \"Why should I hire you, and what can you bring to this job?\""}], [{"date": "10 Aug 2015", "title": "Unit Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Dialysis Clinic Inc (Osage Beach, MO) in Nov 2013", "Interview Descriptions": "Was basically asked if I would be able to perform the required daily duties, at that time was gone over everything that would include. I was given a tour of the clinic and also a tour of the lab room as it was going to be my responsibility to spin any and all labs and place them in the designated lab fridge and mail them out to corporate on a daily basis. I was introduced to what patients were actually out on the floor that day.at that time I left  and was called a few days later and was hired", "Interview Questions": "If I was outgoing and friendly and a multi tasker"}, {"date": "2 Mar 2013", "title": "Nurse Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. I interviewed at Dialysis Clinic Inc", "Interview Descriptions": "As a manager, you must have prior experience as a RN in dialysis.  Problem solving and multi tasking skills needed.  Salary position which typically cannot be done in a 40 hour work week.", "Interview Questions": "Situational problem solving and physician communication related"}, {"date": "12 Oct 2014", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Dialysis Clinic Inc (Chattanooga, TN) in Jun 2010", "Interview Descriptions": "I was interviewed by one person and it took about 45 minutes and then I had to complete a drug test and background test to qualify for the job.  They asked a lot of questions about my work experience in the health field.", "Interview Questions": "I was asked about what I would do in clinical situations."}, {"date": "22 Jun 2012", "title": "Hemodialysis RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Dialysis Clinic Inc (Clarion, PA) in Jul 2009", "Interview Descriptions": "Sent in resume and cover letter to facility. Received interview in next few days. Offered position day or so later. My initial impression of the facility and people were positive.", "Interview Questions": "N/A"}, {"date": "3 Sept 2010", "title": "Corporate Billing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Dialysis Clinic Inc (Nashville, TN) in Mar 2009", "Interview Descriptions": "After a referral from a friend, i submitted an application with resume. I was called in for an interview which went well, mostly wanting to see that you are driven and have a passion to succeed and grow. Described the responsibilities in detail and then was walked around the office to allow me to get a vibe if the environment would be a fit or not. The people were friendly, but the billing floor was exceptionally quite and the decor drab and depressing, total cubicle hell, very depressing unless you got a cube near an exterior window.", "Interview Questions": "Tell your greatest achievement and greatest failure to date....."}]]