[[{"date": "21 Apr 2022", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Kadlec", "Interview Descriptions": "Begins with virtual interview and then a second interview on zoom. Then background check and drug test, then orientation. Orientation lasts around six weeks for new grads before you are expected to work alone.", "Interview Questions": "What is your biggest strength as a nurse?"}, {"date": "27 Oct 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Kadlec", "Interview Descriptions": "It went really well and it was fast. It was maybe a five minute interview. It was a hiring event, so it seemed everyone was in a hurry.  I wish they've would've asked more questions but they went straight to the point.", "Interview Questions": "Strengths, weaknesses, and availability for work. "}, {"date": "23 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kadlec in Mar 2021", "Interview Descriptions": "The interview was completed virtual. Very professional and casual. Questions were relevant and allowed plenty of time to answer questions. They had unique questions that were outside normal interview questions.", "Interview Questions": "How I could tell when patients were satisfied with my care?"}, {"date": "9 Mar 2021", "title": "Pharmacist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kadlec (Walla Walla, WA) in Jan 2021", "Interview Descriptions": "\"Phone\" interview supposed to be with 3 people, but only 1 showed up. Mostly chit chat, very minor interviews (where do you see yourself in 5 years, and what are your interests?), lasted <30 minutes. Never really got followed up with. Applied for similar position a month later, was invited to the same type of interview with date & time with the same people. The job portal said I was not selected for the position even though I didn't interview yet. Emailed HR and said it was a mistake, then another HR person emailed me 1 hour before said interview to tell me that I interviewed with the same hiring manager and they didn't consider me. Nobody showed up to the phone interview. Thats the gist of it. Absolutely awful experience.", "Interview Questions": "where do you see yourself in 5 years or so. "}, {"date": "25 Jun 2021", "title": "RN Lactation Consultant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Kadlec (Kennewick, WA) in Nov 2020", "Interview Descriptions": "Pretty straightforward in the beginning.  A self-paced computer interview led to a video interview a couple of days later.  There was no follow-through after the video interview despite being told I would be notified of their decision the next week.  It was six weeks before I got a generic email saying I was no longer being considered.", "Interview Questions": "Are you comfortable with self-scheduling?"}, {"date": "5 Mar 2020", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Kadlec", "Interview Descriptions": "They asked the basic questions and was very polite. It was my first ever interview and I enjoyed it.  The interviewer is very soft spoke and patient. I was a bit nervous so I’m still not sure how I did. Hopefully I’ll pass for the next interview", "Interview Questions": "Why did I choose this field"}, {"date": "26 Feb 2020", "title": "Practice Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Kadlec", "Interview Descriptions": "They contacted me to do a one-way video interview after applying online, which I refused to do.  \r\n\r\nThe interview process should allow me the opportunity to evaluate whether the position will be a good fit for me too,  which this process does not allow.  I feel that any organization that cares this little about it's candidates during the interview process probably devalues their employees overall.  I don't want to work for this type of an organization.  \r\n\r\nThey have been recruiting for this position for over 6 months, so I am probably not the only candidate that feels this way.", "Interview Questions": "Who knows what they would have asked?"}, {"date": "21 Jan 2017", "title": "Supply Chain Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Kadlec (Kennewick, WA) in Aug 2016", "Interview Descriptions": "Had to attend a job fair to meet with an HR representative, which took about 4 hours,  then had an interview with the hiring manager a few days later.", "Interview Questions": "Why are you interested in this position as you are obviously too overqualified?"}, {"date": "26 Dec 2016", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Kadlec (Richland, WA) in Mar 2016", "Interview Descriptions": "Streamlined and clear cut the process is very easy to do. You apply on line they call you and set up and interview. The same is said for the vetting process and the on boarding was helpful", "Interview Questions": "What made you chose this field. "}, {"date": "1 Nov 2019", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Kadlec (Richland, WA) in Feb 2016", "Interview Descriptions": "A panel of managers who are seeking to fulfill a vacancy interviews you or you get to do an individual interview with a manager after initial HR initial conversation. The HR person often creates a scheduled time to talk to determine personal goal and visiting within a diverse company.", "Interview Questions": "Tell me a time when you had to deal with a difficult station. How did you approach this?"}], [{"date": "31 Oct 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Kadlec in Oct 2011", "Interview Descriptions": "1 interview with manager via Skype.  Upon hiring, I was not told about the Union.  Apparently I had 30 days to decide if I wanted to be a part of the union, I also had 30 days to negotiate my wage, I have more experience than their nurses and would have asked for more.", "Interview Questions": "Nothing I was not prepared for."}]]