[[{"date": "2 Aug 2019", "title": "Director of Operations and Finance Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Peace First in Jul 2019", "Interview Descriptions": "This was by far the best interview experience I have ever had - even without receiving an offer! The team was communicative regarding next steps throughout the process and available to answer questions. The CEO was very open, honestly sharing where they are as an organization, which was very helpful in my own discernment as to whether or not it was a good fit. He took the time to know me as an applicant and generously shared feedback. Even though I did not receive an offer it was an overall very positive experience.", "Interview Questions": "What are your strengths? What is your kryptonite? "}, {"date": "11 Oct 2018", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Peace First (Boston, MA) in Aug 2018", "Interview Descriptions": "I applied via email and was contacted within a few days to set up a phone screening. It went well and I did another video interview. I advanced to the next round and flew out to Boston for the final interview. It was really nice that they paid for the travel, because most nonprofits expect you to pay out of pocket. The questions were really straight-forward, and everyone was very friendly and respectful of my time, which I appreciated. I didn't get an offer, but they were nice enough to connect with me on LinkedIn and offer to help me with possible job connections at other local nonprofits.", "Interview Questions": "How do you handle conflict?"}, {"date": "6 Oct 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Peace First in Jun 2014", "Interview Descriptions": "I interviewed over the phone and answered basic questions about my organizational habits, my past work experience, and what I thought I could bring to the position. I then did a brief assignment for them, critiquing some educational materials they were promoting. The assignment only took a half hour and the initial phone interview was only 45 minutes. After I had done the interview and assignment I was offered the internship and I then met with their team at their office in Boston.", "Interview Questions": "How do you stay organized?"}, {"date": "27 Jun 2013", "title": "Special Assistant Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Peace First in Jun 2013", "Interview Descriptions": "I saw the position of Special Assistant advertised on Idealist.org and sent my resume and cover letter via email. A week and a half later,  I received a response with a list of five questions that had to be answered before they would decide who to interview. I spent the weekend composing thoughtful answers to each question and then submitted my answers. The next day, the Operations Coordinator emailed back and arranged for a phone interview. The phone interview consisted of standard interview questions such as why you are interested in the position and describe your background. \r\n\r\nSeveral questions were of the \"what would you do in this situation\" variety but hard to answer without any sense of the organization's culture, modus operandi and time to reflect. The Operations Coordinator did not come across as someone with much experience conducting interviews because she was reading from a script and many of the questions she asked were already answered in writing. I was not particularly impressed and struggled to contain my disappointment that she did not bother to read what I wrote. To make matters worse, what they were looking for was a Scheduler for the President who would cater to his every need at whatever time he wanted something. When I asked if there was any other responsibilities it became clear that despite the title, the scope of the position was pretty limited.\r\n\r\nAfter the interview concluded, she indicated that they would be in touch by the end of the week with those that they wanted to invite to meet with the President. I never heard back and wasn't expecting to based on the phone screen. Two weeks later I received the standard email sent to candidates that were unsuccessful which states that your resume will be kept on file.\r\n\r\nThese are the questions that they ask you to respond to in writing:\r\n\r\n1.\tWhy do you want this job? How do you see the role of Special Assistant fitting into your larger professional goals? (Please limit your response to one paragraph.)\r\n\r\n2.\tUsing the job description as a reference, what makes you an exceptional candidate for this position?  Which parts will draw on your strengths?  Which areas will be more of a challenge? (Please limit your response to two paragraphs.)\r\n\r\n3.\tEric’s role requires him to spend a decent amount of time out of the office. In order to have success in this position, you will have to be able to prioritize and work independently. Could you describe a project you had to complete with a limited amount of supervision? (Please limit your response to two paragraphs.)\r\n\r\n4.\tHow would you describe your ideal work environment? How would you describe your ideal supervisor? (Please limit your response to two paragraphs.)\r\n\r\n5.\tWhat are your salary requirements? Is there anything else we should know about what is important to your success? (Please limit your response to one paragraph.)", "Interview Questions": "The most unexpected question was If the President has a meeting in NY that two other staff members were planning on attending and the time has been moved up, what would you do?  "}, {"date": "2 Jan 2013", "title": "Executive Assistant to the President and Chief Operating Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Peace First (Boston, MA)", "Interview Descriptions": "What a thoughtful interview process! I could tell that they hold the EA position in high regard.  First, they asked candidates to respond to some questions electronically. From there, they selected candidates to be interviewed by the president by phone. Lastly, those of us who made the grade were invited in to meet the president and COO, for an in-person interview.  For the in-person interview, I was asked to write a sample letter to a potential funder, as well as put together a page of facts about the individual.", "Interview Questions": "I found the most difficult to be:  \"So, imagine you've been here for 90 days. What have you accomplished?\""}], [], [], []]