[[{"date": "20 Nov 2022", "title": "Civil Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Manitoba in Sept 2022", "Interview Descriptions": "the interview was held in the manager's office, which was very friendly environment all questions were about my resume and some general questions. i could answer all questions very well and after 1 week I could get a job offer", "Interview Questions": "what are your weaknesses and strengths?"}, {"date": "15 Jul 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Manitoba", "Interview Descriptions": "The interview was mainly questions about past experience. You should be ready to apply some methods concepts to examples in the interview. Three people took turns asking questions and there was a brief prepared written piece ahead of time. This could be an existing project or publication.", "Interview Questions": "How past research experience applied to the content area of the job. how this job would help to contribute to overall career goals."}, {"date": "30 Jun 2022", "title": "Service Desk Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Manitoba (Toronto, ON) in Jun 2022", "Interview Descriptions": "Interview time was mainly used by the panel asking questions. They left no time for candidate to ask questions, nor did they offer for the candidate to ask questions. \n\nThey sent a pre work packet and asked for it to be completed and sent back prior to interview date, and during interview they openly stated that they did not read it. Not sure what the point of this was!\n\nThey stated response would be sent out to the candidates 7 business days from the interview date. No response until 15 days later, and no response from the admin people when I sent a request for an update.", "Interview Questions": "describe how you think u of m support would be different than your current company (they would not accept any answer I gave, insisting that u of m support would be wildly different, without allowing me to explain)"}, {"date": "25 Jun 2021", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Manitoba", "Interview Descriptions": "Pretty chill, more like a chat for 45 mins. Some questions and testing about excel. Basically, they handed me their computer and asked me to perform certain operations on excel. Overall, a good interview as well as working experience.", "Interview Questions": "Describe your knowledge in excel"}, {"date": "22 Jun 2021", "title": "Marker/Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Manitoba", "Interview Descriptions": "Apply for the jobs online, and one of the Hr would send you an email. I don't really remember about that. I don't really remember about that. I don't really remember about that.", "Interview Questions": "I don't really remember about that. "}, {"date": "25 Apr 2021", "title": "Ph D Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Manitoba", "Interview Descriptions": "Some of the technical questions were tough, but there were more behavioural questions. Then I sent my documents including transcripts, and IELTS results to the faculty of graduate studies, and after a few months I received my admission letter ...", "Interview Questions": "Did you have prior experience in vehicle dynamics and control? what's your experience with stability analysis, and dynamical system theory?  Have worked with Lyapunov exponents as a tool for stability analysis? are you familiar with nonlinear control system design? "}, {"date": "29 Jan 2021", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "The process took 1 week. I interviewed at University of Manitoba", "Interview Descriptions": "First through email asking for a resume and the names of two references. Then we had a meeting on skype asking about my experience and resume. Overall, it was fine and friendly.", "Interview Questions": "What was your previous research experience?"}, {"date": "15 Sept 2021", "title": "Russian Language TA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Manitoba in Aug 2020", "Interview Descriptions": "The interview was very informal and was conducted by the instructor. I've spent 40 minutes just chatting and we hardly talked about anything job-related. The instructor was more interested in getting to know me personally rather than trying to figure out whether I can do the job-related duties.", "Interview Questions": "- can you name Russian cases in English?"}, {"date": "19 Mar 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at University of Manitoba", "Interview Descriptions": "the interview was basically online and via email and phone, cause i was applying for a RA position overseas. Since my advisor sucks so he didn't really give any good Qs academically but relentlessly bragging about himself.", "Interview Questions": "what is your education background"}, {"date": "10 Jan 2020", "title": "Graphic Designer for the Manitoban Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Manitoba", "Interview Descriptions": "Two people interviewed me for about 10 minutes or less because I was not fully prepared back then, nor did I had enough time to prepare so it was pretty short. But I was fully capable of the job, as I finished something much more complicated later, which was my practicum with 130+ pages of texts and graphics. So people, do prepare well for the interview!", "Interview Questions": "What is there to be improved about the layout of the Manitoban?"}], [{"date": "25 Dec 2019", "title": "Food Server Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Manitoba in Aug 2019", "Interview Descriptions": "Group Interview,  just written interview. it is around 15 questions, take maybe one hour. Then you need to prepare deposit infomation, available working time  and reference together. Then you have to wait till one week to one month to know the result.", "Interview Questions": "how to handle emergency situation, time-management, employee relationship"}, {"date": "17 Oct 2019", "title": "Engineering Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Manitoba (Winnipeg, MB) in Jul 2019", "Interview Descriptions": "It was a formal interview at one of the university meeting rooms.  A group of 5 people from the  UM were the committee.  All the questions were based on the job posting and my resume.", "Interview Questions": "Everything was based on my resume. My skills and hands-on experience."}, {"date": "24 Jun 2019", "title": "Graduate Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Manitoba", "Interview Descriptions": "I did not have an interview, as I was invited to work by my employer. As such, I recommend that those individuals who are interested in having this job network with professors.", "Interview Questions": "N/A"}, {"date": "3 Jul 2019", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at University of Manitoba (Winnipeg, MB) in May 2019", "Interview Descriptions": "just asked standard questions. it was annoying that they didn't let me know the results of the competition. there were 3 people interviewing me. it lasted about an hour. i felt comfortable.", "Interview Questions": "how does your experience relate to this position"}, {"date": "12 May 2019", "title": "Lecturer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Manitoba (Winnipeg, MB) in Apr 2019", "Interview Descriptions": "Today, many companies have an involved interview process starting with screening interviews, which often take place on the phone, followed by in-person interviews, second interviews, and even third interviews. In addition to a hiring manager, you make meet with managers, employees, and other staff.M", "Interview Questions": "Why teaching?"}, {"date": "29 Jun 2019", "title": "Farm Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at University of Manitoba (Toronto, ON) in Mar 2019", "Interview Descriptions": "It was a pretty short interview because they had a few important questions they needed to ask and then they offered me the job. This was probably because of a lack of applicants. It was a good experience overall.", "Interview Questions": "Do you have or intend to grow facial hair? You will need to where a respirator and facial hair can get in the way"}, {"date": "2 Oct 2017", "title": "Admissions Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Manitoba (Winnipeg, MB)", "Interview Descriptions": "I applied for the job and I received a call for an interview shortly after.  Scheduled the interview a couple days later and heard back from them that same day.  I had to turn down the job offer for personal reasons.", "Interview Questions": "How do you deal with a difficult customer?"}, {"date": "8 Nov 2018", "title": "Marker/Grader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 8 months. I interviewed at University of Manitoba (Winnipeg, MB) in Aug 2017", "Interview Descriptions": "Talk to professors about it, express your interests, list your academic standings, and then apply through Jump. After that, people in the computer science department will receive your application and review your application. A few weeks later, received an offer.", "Interview Questions": "Have you taken this course before?"}, {"date": "7 Oct 2019", "title": "Front Desk Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Manitoba (Winnipeg, MB) in May 2017", "Interview Descriptions": "I sat for two interviews. One with the desk staff manager and the arts undergraduate program manager. The next was with the Dean’s office boss. The first asked general questions and the next answered more specified questions to decide whether I was the right fit. I received a call a few days after the second interview informing me I got the job.", "Interview Questions": "How do you handle high pressure lines and doing many things at once?"}, {"date": "10 Apr 2017", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Manitoba (Winnipeg, MB) in Apr 2017", "Interview Descriptions": "Simple ! Professor helped! Apply online. Study about the subject. You should have minimum knowldge about the the subject you are teaching and should also have good communication skills.Please find the attached advertisement for a tenure-track position in Industrial Engineering at Concordia University.", "Interview Questions": "Technical questions regarding the same subject!"}], [{"date": "5 Oct 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Manitoba (Winnipeg, MB) in Jan 2017", "Interview Descriptions": "Apply online first and then talk to the advisor about it.\r\ntalk to each professor about your idea and why you want to work in their lab, they will write back the email to the department advisor.", "Interview Questions": "what's your plan for your project"}, {"date": "7 Jul 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at University of Manitoba (Winnipeg, MB) in Sept 2016", "Interview Descriptions": "Interviewed with manager and director of the department. Interview was an hour long, and there was only 1. Casual atmosphere in office interview, clear questions and easy to communicate my qualifications relating to the position.", "Interview Questions": "My experience with software, how I can use it to improve their business."}, {"date": "12 Aug 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Manitoba (Winnipeg, MB)", "Interview Descriptions": "Two interviews for a lowly research assistant position (level 2).  I think this was just a preference of the department I interviewed in and not the norm. Pretty demanding in my opinion.\r\n\r\nQuestions included:\r\n1) Conflict with coworker and how you dealt with it\r\n2) Experience publishing an article\r\n3) Experience in providing research assistance", "Interview Questions": "Do you prefer working independently or with a team?"}, {"date": "5 Jan 2019", "title": "PhD Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at University of Manitoba (Winnipeg, MB) in Apr 2015", "Interview Descriptions": "CV, transcript will be requested upon your application submitted.\r\nSchedule an interview\r\nPersonal introduction about your previous academic and research background\r\nIn-depth discussion of the research areas you are interested\r\nDescribe your strength and weakness", "Interview Questions": "What is your strength in your research area?"}, {"date": "15 Apr 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Manitoba (Winnipeg, MB) in Mar 2015", "Interview Descriptions": "The hiring process was very straight forward, contact the professor and he saw my qualifications and then offered me the offer. then, he started to help me going through the process then joined 3 months later", "Interview Questions": "why you are interested in this research?"}, {"date": "5 Sept 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Manitoba (Winnipeg, MB) in Feb 2015", "Interview Descriptions": "There was a hiring committee. Everyone on the committee introduced themselves. Each person on the committee asked prepared questions and everyone took notes. The interview lasted about an hour. Nothing out of the ordinary.", "Interview Questions": "What do you know about the University of Manitoba?"}, {"date": "23 Mar 2016", "title": "Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Manitoba (Winnipeg, MB) in Dec 2014", "Interview Descriptions": "Questions are easy and straightforward. Asked some very common behavioral questions. There were two person in the interview board and they were very friendly. The interview took around 20 minutes and after that they were discussing about their programs,", "Interview Questions": "Why am I interested in this position?"}, {"date": "19 Nov 2015", "title": "Information Technologist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Manitoba (Winnipeg, MB) in Nov 2014", "Interview Descriptions": "The head of the department and another departmental executive performed an in-person interview that lasted about an hour. The atmosphere was relatively relaxed and informal. Questioning was primarily focused on knowledge-testing and assessments of interpersonal and customer service abilities. Interviewers were fairly open and responsive to applicant questions about job duties and departmental philosophies.", "Interview Questions": "How I would manage an IT call from someone displaying clear signs of agitation/frustration."}, {"date": "29 Jul 2015", "title": "Food Service Helper Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Manitoba (Winnipeg, MB) in Aug 2014", "Interview Descriptions": "this was a 1:1 process.... I was asked various questions about 50 where I had to reply and my response was written down by the interviewer,,, any question that seemed unclear to me was explained by the interviewer and I was able to provide the response.", "Interview Questions": "how would I use the skills I have to impact the company"}, {"date": "21 Mar 2014", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Manitoba", "Interview Descriptions": "After applying online, received a call for an interview after about a month.  Met with 2 individuals, one of whom was the supervisor for this position.  Questions were asked by each interviewer in alternating format.  \r\n\r\nAsked a lot of questions regarding how I deal with deadlines, confrontations and solving problems.  \r\n\r\nAfter 1st interview, received a call for a second interview 2 weeks later.  Interviewers were the same supervisor and one team member.  Questions were more focused with scenarios and situations being defined.", "Interview Questions": "What would you do if someone was upset for having reached 5 other people and being transferred to you?  They are not willing to be transferred again."}], [{"date": "25 Nov 2015", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at University of Manitoba (Winnipeg, MB) in Sept 2013", "Interview Descriptions": "I met with the PI and he described the project I will be working on and it was more of a discussion later on. Then I was asked about the possible starting date.", "Interview Questions": "All the questions where research project related"}, {"date": "14 May 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Manitoba in Apr 2013", "Interview Descriptions": "I sent an email to the prof I wanted to work with, he answered and asked for transcripts.  Then after a day, he offered me a research assistantship position at U of M.", "Interview Questions": "Checking BSc and MSc transcripts"}, {"date": "24 Mar 2016", "title": "CADLab Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Manitoba (Winnipeg, MB) in Aug 2012", "Interview Descriptions": "I applied online via email. About two weeks later I received an interview which lasted a very short amount of time. The interview was conducted over the phone and it was mainly to verify my information and available start date. I had a strong background and a lot of experience in the field so that may have resulted in a short interview. There may have also been a small applicant pool.", "Interview Questions": "Do you have experience with Mac OS and Windows OS?"}, {"date": "16 Oct 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Manitoba (Winnipeg, MB) in Mar 2012", "Interview Descriptions": "There wasn't really a review process. I had asked if there were any positions available, I was told there was and would I like to apply, I said yes. They asked if they could view my transcript, they did. then I was asked when I could start.", "Interview Questions": "When could I start"}]]