[[{"date": "7 Jun 2023", "title": "Instroctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at edX (Canada, KY)", "Interview Descriptions": "The interview process for this particular scenario begins with an assessment in the form of an exam. During the assessment, you are tested on your knowledge, skills, and qualifications related to the job. This exam allows the company to evaluate your understanding of the subject matter and determine if you meet the basic requirements for the role. After completing the assessment, the company provides you with materials to review. These materials could include documents, reports, case studies, or any relevant information that pertains to the position you have applied for. The purpose of this step is to assess your ability to analyze and comprehend complex information within a given timeframe. Once you have thoroughly reviewed the provided materials, the interview process progresses to the presentation stage. In this stage, you are expected to present the findings or insights you have gained from studying the materials. This could involve preparing a formal presentation or delivering a structured explanation of your analysis. The presentation allows the company to evaluate your communication skills, critical thinking abilities, and how well you can articulate and convey information to others. Throughout this assessment, material review, and presentation process, it is crucial to demonstrate your expertise, attention to detail, and the ability to effectively communicate complex concepts. By excelling in each stage, you enhance your chances of showcasing your qualifications and securing the position you are seeking.", "Interview Questions": "it is an demo class"}, {"date": "5 Jun 2023", "title": "Centralized Grader Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at edX", "Interview Descriptions": "There was a phone screen, a behavioral interview, and an asynchronous recording. While the interview stages were very easy after the entire process they told me I passed but they currently had no position open. I emailed them weekly just for updates, but after the second week they ghosted me. Sometimes situations change and positions need to be closed. It would be professional to let your candidates know this rather than leaving them in the dark.", "Interview Questions": "To record yourself interacting with a student who is having trouble with an assignment."}, {"date": "2 May 2023", "title": "Learning Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 4 weeks. I interviewed at edX in Apr 2023", "Interview Descriptions": "Total of 4 interviews. First contact with recruiter. Then online assessment mix of concepts, coding, and debugging. Then another interview recoding self as if learning assistant. Made it to the last stage. Emailed 3 employees, no response. Waste of my time.", "Interview Questions": "Online coding assessment in react, PostgreSQL, CSS."}, {"date": "27 Apr 2023", "title": "Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at edX (Minneapolis, MN) in Apr 2023", "Interview Descriptions": "Phone screen, online technical assessment, then another interview where you give an example lesson from slides and lead an activity. Interviews took about 30 min, 45 min, and 45 min.", "Interview Questions": "Questions around Pandas and python"}, {"date": "20 Mar 2023", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at edX (Mission, TX) in Mar 2023", "Interview Descriptions": "Very timely and smooth process. Human resource professional kept me informed throughout the process. I received timely information at every step and all of my qestions were answered in detail.", "Interview Questions": "Talk about my previous experience."}, {"date": "26 Feb 2023", "title": "Client Experience Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at edX", "Interview Descriptions": "Met with a recruiter, discussed the position and what the interview would be like. Then had the interview with several members of the team describing what they were looking for and how my experience applies.", "Interview Questions": "Can you Tell me about yourself."}, {"date": "24 Jan 2023", "title": "Account Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at edX", "Interview Descriptions": "Initial call with someone on the team, learned about the mission of the organization and how the 2U merger has gone thus far for the team as well as the partners and students.", "Interview Questions": "Do you have any questions for us"}, {"date": "27 Dec 2022", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at edX", "Interview Descriptions": "Relatively easy, but be prepared to test your knowledge on the fundamentals of coding. Not too high-level, but still questions that might trip people up. I was able to do well on the interview, but had to spend up pretty much all of the time to make sure all of my answers were correct.", "Interview Questions": "N/A"}, {"date": "29 Jan 2023", "title": "Instructor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at edX (Los Angeles, CA) in Jan 2023", "Interview Descriptions": "Recruiter contacted through LinkedIn message. I liked that you can still work and do teaching on the side virtually at nights. I then scheduled call with recruiter from 2u who was hiring for instructor role. The timing was very slow and the soonest i could schedule a call for was over a month out on the calendly link. During the 40-min *recorded* recruiter call it was friendly, second half of call they asked basic questions about my background, rating skill in python, JavaScript, SQL, from 1 to 5, and I asked questions about the role. The first half of the call was just the recruiter talking about the role and how the schedule works. Recruiter would then send to hiring manager who would review the call recording.", "Interview Questions": "Rate your SQL/Python/Javascript experience from 1-5"}, {"date": "23 Nov 2022", "title": "Learning Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at edX (San Diego, CA) in Sept 2022", "Interview Descriptions": "Quick and simple process. Send in your resume and Fill out forms. Then it was around a 2 week wait before another email was sent. then proceed to take some tests and further interview.", "Interview Questions": "Availability, skill pertaining to data analytics, if you took the Bootcamp"}], [{"date": "30 Jul 2022", "title": "Senior Software Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at edX", "Interview Descriptions": "Spoke with a recruiter during a phone screen, and had a phone call with a hiring manager. Technical phone call went over background and a coding exercise to do live.", "Interview Questions": "How would you perform an in-place shuffle of a deck of cards?"}, {"date": "7 Jul 2022", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at edX", "Interview Descriptions": "Met with three people for 30 minutes each. The conversation was casual with some technical questions relating to accounting. Some behavioral based questions that were not difficult. It gives you a good idea of who you could possibly be working with", "Interview Questions": "Tell me about a time you had to work with a team?"}, {"date": "8 Apr 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at edX in Jan 2022", "Interview Descriptions": "First there is an initial phone screen with edX recruiter. Then a meeting happens with someone from the analytics team, followed by a technical interview relating to past projects & a final behavioral interview", "Interview Questions": "Tech stack used for data analytics platforms"}, {"date": "8 Apr 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at edX in Jan 2022", "Interview Descriptions": "First there is an initial phone screen with edX recruiter. Then a meeting happens with someone from the analytics team, followed by a technical interview relating to past projects & a final behavioral interview", "Interview Questions": "Tech stack used for data analytics platforms"}, {"date": "19 Oct 2021", "title": "Partner Support Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at edX", "Interview Descriptions": "First interview was over the phone with the recruiter. After that, I was given a homework assignment to complete and submit. Once that was submitted, I had an interview with multiple people at the organization. The interview took multiple hours. This seems fairly common practice for tech positions. Everyone was very relaxed and pleasant and the experience solidified my interest in joining the team.", "Interview Questions": "I'm blanking on specifics, but along the questions were questions about the assignment I submitted, and they asked me to talk them through my process, if I recall correctly."}, {"date": "8 Oct 2021", "title": "Partner Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at edX", "Interview Descriptions": "The interview process wasn't difficult, but it was quite long and repetitive. Had phone screens with multiple people, in-person meetings with 2 different panels on 2 different days, then 2 additional phone interviews. Altogether, I think I had 13 conversations with people.  It would have been nice to expedite the process for all involved.", "Interview Questions": "Detailed questions about my experience"}, {"date": "8 Jun 2021", "title": "Content Marketing Strategist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at edX in May 2021", "Interview Descriptions": "Overall, a very professional set up and an enjoyable interview process. I had a phone screening with the Senior Talent Acquisition Partner, followed by a 30 minute phone interview with the Content Marketing Manager.\n\nFor the next stage, I was asked to write a short blog post (1-2 hours) and submit it in advance of 3 back-to-back interviews with the Content Marketing Manager, Product Marketing Manager, and Sr. Product Marketing Manager. All three interviews went well, and each person was knowledgeable and passionate about ed tech.\n\nI ultimately accepted another job offer, as the edX position was only a 3-month contractor role with no 100% guarantee of extension.", "Interview Questions": "How do you deal with multiple deadlines coming to a head and competing priorities?"}, {"date": "4 Mar 2021", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at edX (New York, NY)", "Interview Descriptions": "Had a first call with talent acquisition which went pretty well. He was very enthusiastic and gave a lot of good insight into the company. Moved forward with the second call which was ok. The interviewer seemed like she was flustered at times. It seemed like she had just got the technical question of Google and didn't fully understand it herself", "Interview Questions": "What helps you get familiar with a new project?"}, {"date": "20 Mar 2021", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at edX (Boston, MA) in Feb 2021", "Interview Descriptions": "was turned down after the first round interview. We talked about the past experience, project etc and everything worked well. However, a day later I got an email saying not a good fit. I don't understand why I don't get a chance to show any technical skills, wish it could be a more fair hiring process", "Interview Questions": "Have you heard Edx and how you could fit this position?"}, {"date": "13 Jan 2021", "title": "Client Relationship Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at edX", "Interview Descriptions": "The interview went into detail on the nature of the role and the team which was nice. We talked extensively about company mission and goals of the company moving forward. This was a first round call with an HR rep", "Interview Questions": "Be open and show interest in the company mission. "}], [{"date": "11 Feb 2021", "title": "Product Marketing Manger Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at edX in Apr 2020", "Interview Descriptions": "Interview process was good-- got the chance to meet with a variety of people I would be working with to get a full understanding of the role and culture. Downside was the interviews were very spaced out from another-- made it challenging to keep the momentum going.", "Interview Questions": "What changes would you suggest to our strategy within the first 3 months of employment based on your research of our marketing and competitors. "}, {"date": "15 Sept 2020", "title": "Senior Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at edX (Boston, MA) in Feb 2020", "Interview Descriptions": "HR screening, 2 phone interviews, take home assignment, then final round with presentation of the taken home and 4 or 5 rounds of 2 vs 1 interviews. The entire process felt way too involved for the position I was interviewing for. The presentation I gave after the take home had 12 people from the company sitting in. After the last round, didn't hear from them for about 2 weeks. I had to proactively follow up and was told that I was \"too much of a data scientist and not enough of a data analyst\". My job title at the time was Sr Data Scientist and they had reached out to me. Everything was done online.", "Interview Questions": "Goal is to increase rate at which learners earn certifications. The analysis is performed against this dataset: HarvardX Person-Course Academic Year 2013 De-Identified dataset, version 3.0"}, {"date": "3 Mar 2020", "title": "Lead User Experience Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at edX (Cambridge, MA) in Feb 2020", "Interview Descriptions": "I had an employee referral for the position and the recruiter reached out to me within a few days after. During the initial phone screen, I was asked questions about my background with research as well as compensation range. I was pushed forward to a 30 minute phone screen with the hiring manager. I was able to ask more questions about the role itself and the team. After the phone screen, I was referred to an onsite group interview. The onsite interviews were 4.5 hours long, I started out the day with a 30 minute presentation. I think I met with about 8 team members over the course of the day. I was offered the role about a week and a half after the onsite visit and was excited to accept. It seems like a great opportunity!", "Interview Questions": "Whats the most difficult part of doing research?"}, {"date": "18 Feb 2020", "title": "Senior Contracts Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at edX (Cambridge, MA) in Feb 2020", "Interview Descriptions": "The HR recruiter who initially reached out scheduled the interview. A second HR associate provided the schedule and requested a list of references. The interview was 3.5 hours long and I met with 4 people. The interview also included a drafting exercise. Although it was a long day, the interviews were standard and pretty laid back. During each interview, we spent most of the time getting to know one another and discussing the role.", "Interview Questions": "Describe a time you presented with a conflict and how you reached resolution?"}, {"date": "22 Mar 2020", "title": "Software Engineer(Internship) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at edX (Boston, MA) in Jan 2020", "Interview Descriptions": "I was given an initial phone screen, basic behavioral questions, asking why edX, about my previous experiences, etc.\r\nI was then invited to an onsite interview at their office in Boston, MA where I did 3 interviews. The first one was presenting a previous project that I had worked on and talking about what I contributed. The second one was a technical coding interview, language of choice. I was familiar with the question but I stumbled on it, and the interviewer's advice didn't help. The third one was a casual conversation with 2 HR representatives. I didn't hear anything from my recruiter for about 2 weeks. I had to follow up with them, and then I was finally told that they had decided to move forward with other candidates.", "Interview Questions": "Deep copy a linked list with a given node having a next pointer and a \"random\" pointer pointing to any other node in the linked list"}, {"date": "4 Feb 2020", "title": "Software Engineer(Internship) Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at edX (Cambridge, MA) in Jan 2020", "Interview Descriptions": "1 phone interview (30 minutes) and 1 onsite interview (2 hours) .  First phone interview is a deep dive into your resume and personal experience. Onsite interview involves talking about one personal project (45 min) and a technical screen (45 min). A lot of emphasis on personal projects and previous work experience. Expect a lot of questions on those.", "Interview Questions": "Talk about a project that you're proud of. "}, {"date": "20 Jul 2019", "title": "Partner Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at edX", "Interview Descriptions": "Multiple interviews with team and in person interview with leadership team. Frustrating that you know my experience working with larger account sizes that I have worked with in my career and I’m asked to sell you on how I can manage a smaller account base? Usually it’s easier to go from a larger account base to smaller account size. Very flabbergasted by that question which made me uninterested in the company.", "Interview Questions": "Give an example of a time you had to deal with a frustrated partner"}, {"date": "5 Aug 2019", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at edX (Cambridge, MA) in Jun 2019", "Interview Descriptions": "Thorough multi-round interview.  Consisted of the initial phone screen, a remote technical assessment,  an in person technical, product, and cultural assessment, followed up by a final phone interview.", "Interview Questions": "Why edX?"}, {"date": "29 May 2019", "title": "Software Engineer(Internship) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at edX (Cambridge, MA)", "Interview Descriptions": "The interview process consisted of 3 rounds: \r\n1. Phone screen with recruiter.\r\n2. Technical Phone Interview with engineer. \r\n3. On-site interview. \r\n\r\nOverall the interview process was smooth sailing until the on-site, which was a bit of a trainwreck...When I arrived I was welcomed and checked-in no problem however as the recruiter started leading me to the room I noticed that there was a lack of diversity in the office, which is a red flag for me (ironic because the CEO/founder is a POC). If I remember correctly my interview overlapped with another and things got awkward from there because the engineers seemed hasty and kept looking at the time as they asked me questions. I felt they were unprepared (hadn't even seen my resume) and didn't care to get to know me on a personal level. In 3 different occasions I asked what they wanted from an intern and got the same generic response \"someone who is willing to learn, collaborative etc\" only to learn this particular engineer had never worked with an intern before.  My least favorite part was the recruiter's demeanor at the end of the interview rounds, they seemed uninterested on anything I had to say and even scowled at me as if I was wasting their time even though they asked for my feedback and I said positive things at the time. After that experience I was curious as to what might be going on and luckily I found out that they are having sustainability and direction issues within the company which might explain why they want cheap engineers for interns. When the recruiter called me to tell me I got rejected I received generic feedback \"you were a strong candidate but some were stronger\" and had no real feedback to offer me as if everything had been scripted. After that experience I was very relieved it didn't work out.", "Interview Questions": "Why edX?"}, {"date": "16 Mar 2020", "title": "Email Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at edX (Cambridge, MA) in Mar 2019", "Interview Descriptions": "Phone screen with hiring representative, who was lovely and helpful. Call with manager of position who asked rudimentary questions about background and experience. Three-hour in-person interview with four separate employees: the hiring representative, the position manager, the department head, and a team member.", "Interview Questions": "HTML Test: add list items to text, bold text, etc."}], [{"date": "24 Sept 2018", "title": "Account Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at edX", "Interview Descriptions": "We'd scheduled a phone screen, but the interviewer forgot about the interview, and never showed.  I emailed to ask what happened, and she asked to reschedule.  I declined, and said I'd decided it wasn't a good fit for me.", "Interview Questions": "We didn't get to the questions part.  "}, {"date": "28 Jan 2021", "title": "Senior Data Scientist Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at edX (Cambridge, MA) in Aug 2018", "Interview Descriptions": "Full day on-site. Interviewers weren’t prepared with relevant questions. One thought I was interviewing to be an intern. Data department generally lacks direction and purpose. Long day of interviews. People were generally nice though.", "Interview Questions": "Review, explain and edit an algorithm in python. Not very structure and very vague."}, {"date": "28 Mar 2018", "title": "Product Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 5 weeks. I interviewed at edX", "Interview Descriptions": "It was pretty long. A recruiter reached out to me to schedule a call, then I did two other phone interviews before getting invited to an onsite interview. There, I had 5 or 6 30-min interviews. The recruiter was friendly and helpful. The other team members were awkward and it wasn't always clear--as one interview step followed the next--that they had shared information or even knew anything about my candidacy.", "Interview Questions": "Someone on the engineering team asked me about how to assess whether a product was well-architected."}, {"date": "26 Feb 2018", "title": "Partner Support Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at edX (Cambridge, MA) in Jan 2018", "Interview Descriptions": "Completed a one hour phone screening, then scheduled interviews via email. Prior to interviewing with the team, I completed a skills assessment. Had five 1:1 interviews in the Cambridge office with the general team, and two 1:1 interviews with upper management the following week. They were flexible with rescheduling when I ran into traffic issues for my second set of interviews. Did not have to wait long to hear back regarding an offer.", "Interview Questions": "Multiple people on the team asked about my experience working with team members in different regions.  Being able to communicate effectively over a chat client (like hipchat or slack) and understand cultural differences is a plus."}, {"date": "20 Oct 2017", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 weeks. I interviewed at edX in Sept 2017", "Interview Descriptions": "The whole interview process was very smooth and I had an amazing recruiter. I applied online and received an email from a recruiter with a request to answer a few questions about myself and my experiences. After this initial email, I was contacted for a google hangout call with the recruiter and then another google hangout call with the hiring manager. After this was the in-person interview in which I met with several people on my team. \n\nI cannot say enough great things about my recruiter. She was very attentive and so open throughout the whole process. You can tell that she really cares about the people she recruits and she makes a point to make them feel comfortable and prepared for the interviewing process. She is really a great example of what the company is like and is honestly the best recruiter I have worked with. After I started working at the company, she even took me out for coffee to chat about how my first week was progressing. \n\nEdX impresses me with how great their HR department is. Everyone is so friendly and focused on helping others succeed. I am so glad that I made the choice to join this company and my recruiter really added to the positive experience that I had with my interviews here.", "Interview Questions": "Why edX?"}, {"date": "17 Aug 2017", "title": "Devops Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at edX in Aug 2017", "Interview Descriptions": "I applied online and a few days later a recruiter reached out to me. We set up a time for a call and after initial screening she scheduled a Google Hangout interview with the hiring manager where we used CoderPad to solve a simple problem using python.", "Interview Questions": "Given a text, count the frequencies of each word."}, {"date": "22 Feb 2017", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at edX", "Interview Descriptions": "I had two phone interviews- one with HR and one with the hiring manager. HR was very quick to schedule interviews, and did a great job following up with me in a timely manner. The total process took 3 weeks. I felt I had positive interviews with both HR and the hiring manager, so I was a bit surprised when I was told they wouldn't be moving forward with the interview process. I felt I fit all of the qualities they listed in the posting, so I asked for feedback on any areas where I could improve. HR gave me a vague response, and said I was qualified but that other candidates better suited the business' current needs, which is a paradoxical answer in my opinion. This answer left me wondering if it was a close call, or if it was a problem with my personality since they said I was qualified, but also said they didn't see a fit for this particular role. \n\nI think it is rare to receive genuine feedback from HR (probably for liability reasons), but it would be helpful if HR provided more concrete feedback for candidates that are clearly qualified, but are not selected to move forward for one reason or another.", "Interview Questions": "Why EdX?"}, {"date": "4 Feb 2017", "title": "Marketing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at edX", "Interview Descriptions": "Applied online, HR set up time for an interview with 6 (!) interviewers. Didn't have a phone screening, but as I understand it, those are now standard. The standard stuff.", "Interview Questions": "Strictly job experience questions and 'have you worked with X business group before'. A few situational, but more to see how quickly you would adapt to what edX does."}, {"date": "5 Jan 2017", "title": "Project Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at edX (Cambridge, MA)", "Interview Descriptions": "HR seems to have a lot of turnover as the worker who friend who interviewed before left soon after I got an interview. That was warning number one. The work has potential, but they seem to hire by people's personality rather than ability to get work done (which reflects on the courses' management). That was warning number two. I had to meet with 5 members of the team, which is fine, but one had a personal dislike with me right away (and I don't even know her), so I am sure she is the reason I did not get the position.", "Interview Questions": "What do you know about edx?"}], [{"date": "26 Feb 2017", "title": "Documentation Lead Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at edX in Dec 2016", "Interview Descriptions": "Phone screen with recruiter that went well, then a second phone interview with another manager who was not the hiring manager (CTO) due to his scheduling difficulty. I didn't feel like I made a good connection with this person. He didn't seem to know what it would take for a candidate to be successful and he seemed in a rush to get off the phone.\r\n\r\nDid not hear from anyone for a month before getting an email saying that they were moving forward with another candidate. Can't say I was surprised.", "Interview Questions": "Why are you looking?"}, {"date": "7 Oct 2016", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at edX", "Interview Descriptions": "Very fast interview process. Phone interview and several skype interviews because I wasn't nearby. Interviewers were very nice and easy to talk to. Everything was clearly communicated and smooth. Overall great experience.", "Interview Questions": "Remove all duplicates in an array and keep count."}, {"date": "2 Mar 2017", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at edX (Cambridge, MA) in Oct 2016", "Interview Descriptions": "I was referred by a current employee at edX. Soon after my referral, a recruiter reached out to me and guided me through the process. I had two interviews over Google Hangouts before I went to the edX HQ in Cambridge, MA to meet the team. I was shown around the office and provided the opportunity to interface with team members of various levels of seniority. Then I had one more Hangout interview. The entire time I felt valued and desirable. edX made a great effort to get to know me to ensure that the position would be as good a fit for me as it was for them. The HR department was swift to set up check-ins and immediately responsive to my emails and texts.", "Interview Questions": "What is your philosophy on building on and working in teams?"}, {"date": "18 Aug 2016", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at edX", "Interview Descriptions": "Had an HR screening, then 45 min tech screening. Tech screener basically went into further depth about the job and then asked me to talk about my past projects. He determined from this that they needed someone at a higher level. \r\n\r\nIt was a very congenial interview, basically I just needed to know my own past work and be able to describe it. I don't know if all screeners conduct their interviews the same, however.", "Interview Questions": "Describe your task or project X (from resume)"}, {"date": "10 Mar 2017", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at edX in Aug 2016", "Interview Descriptions": "I knew someone in the organization so I had extra information going in. Overall I thought the process went well (maybe there's a halo effect since I took the job?) but it was pretty long - there was a gap between my phone interview and in person interview. The hiring manager was very transparent about the process and I was fortunate enough to meet team members I'd be working with during my in person. I enjoyed the process enough to eventually take the job.", "Interview Questions": "N/A"}, {"date": "30 Mar 2016", "title": "Partner Operations Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at edX", "Interview Descriptions": "The recruiter missed the first call and had to re-schedule. I can image if a prospective employee missed an interview that would be the end of the process for them. After re-scheduling, I had a standard interview about why edX and why this position. I never heard back from them even after following up. This company will never be world class with such a disorganized HR staff. Please treat prospective employees with respect!", "Interview Questions": "Why do you want to work at edX?"}, {"date": "27 Apr 2017", "title": "Senior Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at edX (Cambridge, MA) in Mar 2016", "Interview Descriptions": "The interview process was super fast, efficient, professional and respectful. I was interviewed by 6 people onsite in one day. Follow up phone screen with senior management quickly followed.", "Interview Questions": "Describe a difficult situation with client"}, {"date": "10 Apr 2019", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1 week. I interviewed at edX (Cambridge, MA) in Mar 2016", "Interview Descriptions": "2 hour long interview. Met with the entire team. Started off with a tour of the office, and then met with each individual of the team. It was more of a conversation than an interview, and was very simple and wanted to see if you were comfortable.", "Interview Questions": "Tell me about yourself."}], [{"date": "5 Jan 2016", "title": "Partner Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at edX (Cambridge, MA) in Dec 2015", "Interview Descriptions": "After a phone call with a recruiter, I was invited for an in person interview. I met with two members of the recruiting staff, two other partner managers, and a hiring manager. Everyone was nice but since it was broken up there were a lot of repetitive questions. I was there for 3 hours, and one of the recruiters asked when I could come back for an additional interview, but then I never heard a word and got an automated rejection email 3 weeks later. I think after a face to face interview it is courteous to at least call the person or send a personalized email. It is just as well, but they could have handled it more professionally.", "Interview Questions": "What problems do you see with our course interface? "}]]