[[{"date": "6 Dec 2021", "title": "Surgical Recovery Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at LifeCenter Northwest", "Interview Descriptions": "Friendly and open. I found the people conducting the interview to be knowledgable, receptive, curious and open. I felt comfortable asking questions and did not get the impression that the conversation was routine.", "Interview Questions": "What kind of experience do you have in assisting surgical procedures?"}, {"date": "21 Oct 2019", "title": "Anonymous Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at LifeCenter Northwest (Bellevue, WA)", "Interview Descriptions": "I was in the midst of applying with numerous companies for positions as I was seeking a change. So when I secured a \"phone interview,\" I thought it'd be a cursory 10-minute conversation with a person who had no idea what I actually do. I was wrong. It was a thorough interview, where I gave information and also received information about the company. They realize that the organization has to be a fit for you and your values, not just for the skills they are seeking. My phone interview was about 30 minutes in length. I actually complimented the recruiter for her thoroughness because I felt that she cared enough on behalf of the organization to find the right person.  I had a second interview with the hiring manager and a vice president. Then, I was invited to a third interview with three panels of employees. The third interview with three panels is common practice; they are hiring for cultural fit as well as for skills. Each interview, I felt that people genuinely cared about me. They were gregarious and fun, but also passionate about the work.", "Interview Questions": "Which of the organization's values do I most resonate with and why? "}, {"date": "17 Oct 2019", "title": "Hospital Development Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at LifeCenter Northwest", "Interview Descriptions": "I had a phone interview with a recruiter, then I was invited to an in-person interview in the Bellevue office. The questions were mainly behavioral based. \r\nThe overall experience was good, however, I was told there was \"no timeline\" for the third panel interview. I never received any updates, and only found out I wasn't selected when I emailed the recruiter. I know that companies are busy, but I really wish I received a rejection letter rather than not hearing back because I waited two months (after I applied) to receive a call back from the recruiter inviting me to a phone interview.", "Interview Questions": "How did your last job prepare you to deal with conflict? "}, {"date": "2 Apr 2019", "title": "Tissue Resource Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at LifeCenter Northwest", "Interview Descriptions": "The interview process was 4+ months from application submission. Two phone interviews, two in person interviews with branch staff, and three panel interviews at headquarters. Exhaustive process but it's an important job that warrants that thoroughness. Very awesome company, extremely wonderful people working for them. Challenging work but I can't imagine many other company's whose work is as important. Made it to the final 3.", "Interview Questions": "How does your past job experience relate to this job?"}, {"date": "29 Mar 2018", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at LifeCenter Northwest", "Interview Descriptions": "Apply online through the website, received a phone interview, then an in-person manager interview, then a skills test, and finally a panel interview. The panel was three groups of people and they all ask different interview questions.", "Interview Questions": "Behavioral based questions. "}, {"date": "9 Apr 2018", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at LifeCenter Northwest (Bellevue, WA) in Dec 2017", "Interview Descriptions": "The recruitment team at LifeCenter emailed me promptly after receiving my application, and I was phone interviewed within a few days. The first interview was relaxed and I didn't feel intimidated or stressed out. I really enjoyed the panel interview process - who knew that interviewing could actually be fun! LifeCenter values finding people who believe in the mission and fit the company culture, so they made sure that we were the right fit for each other by introducing me to a number of my team (and other teams). I was offered the job the following day.", "Interview Questions": "How weird are you?"}, {"date": "7 Jul 2016", "title": "Hospital Development Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at LifeCenter Northwest (Bellevue, WA) in May 2016", "Interview Descriptions": "I applied for a job through their website in March 2016 and was called back for a phone screen about   4 weeks later. HR was very busy with hiring new people and filing open position so I did not get an update about next steps until about 2-3 weeks after the initial screening. I checked in every week with HR for updates (gently reminders!). I was fortunate to be called back for an in-person meeting with the Director and Senior Program Manager in Hospital Developments which was about 45 minutes. It was so well that I was called back the next day for a final panel interview and presentation interview, which lasted about 4 hours.", "Interview Questions": "1. Where do you see yourself in five years?\r\n2. On a scale of 1 to 10, how weird are you?\r\n3. How would you use your listening skills when working with managers?"}], [{"date": "27 Jul 2016", "title": "Human Resources Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at LifeCenter Northwest (Bellevue, WA) in May 2016", "Interview Descriptions": "The interview process was thorough but not at all exhausting. LifeCenter uses a panel type interview so you get to meet your potential future team, a cross-functional team, and the higher level managers.", "Interview Questions": "My favorite question was: On a scale of 1-10 how weird are you? :) They also asked about what's important to me in my job, what about my past experience in hospitality would bring to the table, etc."}, {"date": "27 Apr 2016", "title": "Management Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at LifeCenter Northwest", "Interview Descriptions": "LCNW apparently has a reputation for being a good place to work, but I am not at all impressed with how they treat their job candidates.\r\n\r\nI was contacted by a member of LCNW's HR team via Linked In and invited to apply for the job.  Within a two-week period, I had a phone screen with one of their HR staff, followed by an in-person interview with the hiring manager.  At that time I was told that they would follow up with me within two weeks.  That was over a month ago, and I have heard nothing - nor, at this point, do I expect to.", "Interview Questions": "The questions were pretty routine: I was asked to describe my background, talk about how my skills were a fit for the job, etc. "}, {"date": "5 Jul 2016", "title": "Administrative Associate III Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at LifeCenter Northwest in Nov 2014", "Interview Descriptions": "I initially had an informal meeting/conversation with the manager and one of the executives I'd be supporting. Next step was a panel interview with 3 different panels. I also took a Microsoft Suite aptitude test. The panel interview seemed daunting beforehand, but everyone was incredibly friendly so it turned out to be a surprisingly enjoyable. I felt like I got to know just as much about the company as they did about me.  It was really nice to have already met so many of my coworkers by the time I started working here.", "Interview Questions": "The panel interview contained mostly situational questions.  "}, {"date": "16 Jul 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at LifeCenter Northwest (Bellevue, WA) in May 2013", "Interview Descriptions": "Filled out an application online, followed by a phone interview with the Human Resources Generalist, an in-person interview with the department of the job description, and lastly a phone confirmation.", "Interview Questions": "What do you think about LifeCenter NW?"}]]