[[{"date": "21 Apr 2023", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Central Texas College (Killeen, TX) in Apr 2023", "Interview Descriptions": "Easy and frustrating. Be prepared to answers questions that only specify exact job requirements previous work scenarios. If that is not a match, you will not be selected. Do not expect eye contact once the interview is started, they are writing and drawing conclusions.", "Interview Questions": "Previous experiences? Previous reasons to leave prior job? What made you apply for job?"}, {"date": "28 Feb 2023", "title": "General Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Central Texas College (Killeen, TX) in Dec 2022", "Interview Descriptions": "Interview Panel of 4. About 10 approved questions I was graded on, mostly about my work experience. After each question the panel members would look down and write, so there was a lot of silence in between.", "Interview Questions": "Describe you experience in the position How important is student relationships"}, {"date": "26 Feb 2021", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Central Texas College", "Interview Descriptions": "It was a brief phone call after I applied. Basically they just asked if I was still down to teach the two classes CTC offered at Camp Pendleton, and described what working there would be like if there wasn't a pandemic.", "Interview Questions": "(After describing the job) Does that sound good?"}, {"date": "12 Aug 2020", "title": "Simulation Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Central Texas College (Killeen, TX) in Oct 2019", "Interview Descriptions": "the interview process was pretty well organized. Questions were more customer service oriented. I applied online and then was called by hr to set up an interview with the head of the department.", "Interview Questions": "what kind of customer service experience do you have"}, {"date": "30 May 2018", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Central Texas College", "Interview Descriptions": "Standard interview process. It was a single interview process, in person. A panel asked standard questions. They briefly explained the position and minimum salary. It was very brief, about 10 questions.", "Interview Questions": "Name your strengths and weaknesses. "}, {"date": "20 Aug 2015", "title": "Test Proctor/Administrator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Central Texas College", "Interview Descriptions": "Brief and one on one. Basic interview questions - 5 adjectives to describe yourself, etc.. Was very interested in job until pay was mentioned. Very little pay offered for job compared to other schools in the area for same job description.", "Interview Questions": "Name 5 adjectives to describe yourself"}, {"date": "16 Jan 2017", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Central Texas College (Phoneton, OH) in Mar 2014", "Interview Descriptions": "Very simple yet thorough process. I submitted appropriate documents prior to the interview. There was a review of my academic records, transcripts and vitae however they were for the most part a simple review that I was able to meet minimum qualifications for the university. This process took place with 1 or 2 of the staff there on campus and they were accessible to any of my questions or issues that came up prior to or after the interview.", "Interview Questions": "Describe previous experience."}, {"date": "24 Feb 2014", "title": "EEO Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied in-person. I interviewed at Central Texas College", "Interview Descriptions": "Applied for the job and was contacted in less than two weeks for an interview.  Was interviewed by two individuals.  Nothing difficult, sort of run of the mill type questions; i.e., why do you want to work here, what are your long term goals, etc.", "Interview Questions": "Nothing too difficult."}, {"date": "19 Jun 2015", "title": "Office Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Central Texas College (Killeen, TX) in Dec 2013", "Interview Descriptions": "Interview with General Manager.  Second interview with General Manager, followed by request to interview at the corporate office.  Followed by an interview with the owner.  A follow up call from the General Manager with a job offer.", "Interview Questions": "Do you have newspaper experience?"}, {"date": "21 Nov 2016", "title": "Proctor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Central Texas College (Fort Benning, GA) in Jan 2013", "Interview Descriptions": "Very typical and easy questions. Questions about yourself and why you would like to work at the college. Questions about your experience with adult students and how helping them differs from helping traditional students. Questions about difficult situations you faced and how you handled them. Also questions about your customer service experience.", "Interview Questions": "Why do you want to work in higher ed?"}], [{"date": "26 Aug 2014", "title": "Office Specialist II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 days. I interviewed at Central Texas College (Killeen, TX) in Oct 2011", "Interview Descriptions": "Hiring process was smooth.  I applied in person and received a phone call the next day.  Interviewed by two people - 1 supervisor and 1 coworker.  Questions were very basic and easy to answer.  After 1 week I received a telephone call regarding my starting date.  The whole process took at least 2 weeks.", "Interview Questions": "Please describe your strengths and weaknesses."}, {"date": "12 Oct 2010", "title": "Lab Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Central Texas College (Killeen, TX) in Jun 2010", "Interview Descriptions": "I first saw and applied at CTC way before they actually contacted me. Honestly, I had completely forgotten about the job. The asked if I was still interested and I said yes. They set up an interview that same week, they called on a Monday had interview on Wednesday. The Interviewer was polite and asked basic ethic questions. At the end of the interview the Interviewer said that I was the first choice for the job if I was still interested the job was mine.. I said yes", "Interview Questions": "Why do you want to work here?"}]]