[[{"date": "8 Jun 2023", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Riverside Health System (Riverside, CA) in Mar 2023", "Interview Descriptions": "short brief questions fast process good experience learned a lot from the interview I think I was prepared for something else though but when you go to to interviews you must always be prepared for anything next time", "Interview Questions": "what's your future goals with the company"}, {"date": "10 Jan 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Riverside Health System", "Interview Descriptions": "The interview process was on par for an ICU position where my knowledge and skills were tested to perform the duties required. Many questions centered around Patient care Teamwork Adaptability", "Interview Questions": "Tell me about a time you dealt with an unhappy or difficult patient or family member."}, {"date": "23 Jan 2023", "title": "Behavioral Health Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Riverside Health System (Los Angeles, CA) in Jan 2023", "Interview Descriptions": "I have not yet interviewed but do want an insight on the interview process. My interview is tomorrow morning for a behavioral health specialist position specifically in case management and hoping to get some feedback on anyone experiences.", "Interview Questions": "I have not yet interviewed."}, {"date": "4 Jan 2023", "title": "Business Office Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Riverside Health System (Newport News, VA) in Dec 2022", "Interview Descriptions": "Very comfortable one on one with hiring manager. Informative, through and many key questions about type of work expected. Shadowed employee to watch procedures. Software system. Toured the facility and equipment. Talked about expectations.", "Interview Questions": "Scenarios about integrity and honesty"}, {"date": "8 Nov 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Riverside Health System (West Point, VA)", "Interview Descriptions": "Came in and had interview, I was welcomed as I came in and brought into office where the interview would take place. Took about 30 minutes overall. Didn’t know what to expect but it flowed more like a conversation which made it easier", "Interview Questions": "How do you think you fit in here"}, {"date": "8 Oct 2022", "title": "Medical Insurance Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Riverside Health System (Newport News, VA) in Sept 2022", "Interview Descriptions": "Applying online through job posting, department admin. reached out for available interview day/times. Face-to-face interview. If offered A position, human resource will contact you with offer. There is generally no negotiation. They are held to guidelines of what they can pay.", "Interview Questions": "If you are good with change and how you feel about asking for help"}, {"date": "31 May 2022", "title": "Medical Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Riverside Health System (Norfolk, VA) in May 2022", "Interview Descriptions": "The process was haphazardly put together and the interviewers (2) were not engaging, reading from a card an disinterested in hearing answers to the questions. One out of the two seemed to be intimidated by an intelligent prospect who actually asked questions. They are not prepared for questions and refused to even answer what the starting pay rate would be", "Interview Questions": "Have you ever worked within a team where there was a problem and if so how did you handle it."}, {"date": "4 Nov 2022", "title": "Recruitment Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Riverside Health System in Apr 2022", "Interview Descriptions": "I applied and immediately got a call the same day. I scheduled a phone interview, then a panel interview . It was a straight forward process and a good experience overall.", "Interview Questions": "Why are you interested in this position"}, {"date": "13 May 2021", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Riverside Health System", "Interview Descriptions": "it was a 2-step process. First round was by phone with HR and fairly straight forward. Second round is in person with the hiring manager and they gave more info on the job", "Interview Questions": "They asked Why do you want to work here?"}, {"date": "27 Apr 2021", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Riverside Health System (Newport News, VA) in Apr 2021", "Interview Descriptions": "The interview process was very professional, and they did a great job explaining the role and how the job would be once one has more experience. The only thing I can say is you may be waiting a few weeks before hearing back from someone about a job offer, so keep checking the website.", "Interview Questions": "“What was one thing you liked and disliked about a previous supervisor”. "}], [{"date": "6 Apr 2021", "title": "Community Services Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Riverside Health System (Coachella, CA) in Mar 2021", "Interview Descriptions": "Was super welcoming and comfortable. The women were very understanding and took the time to explain each question in detail. They even had them displayed for me. Would highly recommend.", "Interview Questions": "What is your work experience that would benefit this position?"}, {"date": "5 Jan 2021", "title": "Office Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Riverside Health System", "Interview Descriptions": "With 3 people and it was very prominent did not have to wait. They asked about prior experience and why I left my old job. The current office manger left in a sudden needed to fill the position quickly.", "Interview Questions": "Why did you leave past job \r\nHours and available "}, {"date": "8 Oct 2020", "title": "Outbound Appointment Setter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Riverside Health System", "Interview Descriptions": "Very comfortable and straightforward. Interviewers were very polite, kind, and made me feel welcomed.  Make sure to be on time for your interview.  Interview lasted approximately 30 minutes. Great experience.", "Interview Questions": "Tell me about yourself and experience."}, {"date": "13 Aug 2020", "title": "DON Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Riverside Health System (Peotone, IL) in Apr 2020", "Interview Descriptions": "Through and comprehensive. Multiple levels and departments. Behavior based questions. Informative and open to answer questions. Schedule provided by recruiter was clear and participants were timely.  A well put together process", "Interview Questions": "Tell me about why you want to work at Riverside. "}, {"date": "11 Dec 2020", "title": "Helpdesk Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Riverside Health System (Hampton, VA) in Dec 2019", "Interview Descriptions": "The interview was very honey! It was like talking to a family, and yet very informative. I loved the interview process, although it was a very long one. I do not have any real problems with the length of the interview, but if you don't want flu shots, don't join riverside, or any hospital for that matter.", "Interview Questions": "How do you feel about working in a fast paced environment?"}, {"date": "6 Aug 2019", "title": "Medical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Riverside Health System (Onley, VA)", "Interview Descriptions": "The interview was a panel interview which I hate. Each person asked select questions. Some where related to the job and some weren’t. This interview was one of the hardest I have ever been to.", "Interview Questions": "What are your weaknesses?"}, {"date": "4 Aug 2019", "title": "CT Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Riverside Health System (Newport News, VA) in Jul 2019", "Interview Descriptions": "I had two phone interviews, and they went well.  The wait for an offer was very long.  I did reach out to the recruter on two occasions.  However, I did land the job.", "Interview Questions": "Most of the questions were situational."}, {"date": "8 Jun 2022", "title": "Referral Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Riverside Health System in Apr 2019", "Interview Descriptions": "It was interesting.\r\nIt was cool.\r\nIt was informative.\r\nWould do it again.\r\nLove the company.\r\nWould recommend.\r\nI really like working where I work one of the best systems and companies to work for.\r\nWouldn't go anywhere else. Amazing opportunities.", "Interview Questions": "Why do you want this job"}, {"date": "16 Feb 2020", "title": "Lpn Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Riverside Health System (West Point, VA) in Mar 2019", "Interview Descriptions": "Straightforward. First phone interview and then in person . The phone interview was more of a screening . I originally went to a recruiter for riverside and then applied online. The interview was set up two weeks or so later. It lasted a little over an hour in person with the DON.", "Interview Questions": "How being a newly graduated nurse would benifit the company against more well seasoned nurses"}, {"date": "10 Feb 2019", "title": "Echo Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Riverside Health System in Feb 2019", "Interview Descriptions": "The manager asked me a several technical questions in regards to protocol pathology and machines used. She then told me about the facility and staff in the department. I was able to ask her questions as well. The interview went well. However, they were looking for someone with more experience.", "Interview Questions": "list 5 findings you would make sure to include in your report to the reading doctor. "}], [{"date": "3 Jun 2020", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Riverside Health System (Newport News, VA) in Feb 2019", "Interview Descriptions": "The interview process had one phone interview followed by two in-person interviews. After the in-person interviews, you may be invited to shadow one of the employees for an hour. The hiring process included a drug test, wellness exam, TB testing, and a flu shot. It is imperative that you are up to date on your seasonal vaccinations.", "Interview Questions": "What does patient care mean to you?"}, {"date": "24 Mar 2019", "title": "Certified Phlebotomist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Riverside Health System (Newport News, VA) in Feb 2019", "Interview Descriptions": "They first did a phone interview, then brought me in for an in person interview, though they knew i wasnt qualified for. They basically were rude, mocked me for my lack of experience, and told me i wasnt going to get the job.", "Interview Questions": "What would you do if you had a disagreement with a coworker?"}, {"date": "3 Jun 2018", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Riverside Health System", "Interview Descriptions": "Interview was very laid back. Typical interview questions. Interviewer was very talkative and pleasant.  Overall an average interview process. Asked the basic questions like when could I start, etc.", "Interview Questions": "Why I wanted to work night shift "}, {"date": "31 May 2018", "title": "Customer Service Representative and Office Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Riverside Health System (Newport News, VA) in May 2018", "Interview Descriptions": "Got an email to set up a brief phone interview. I got 2 interviews at 2 seperate locations because i applied to several positions. The first one was at their orthopaedic office. There were 2 managers and a nurse who literally was slouched over the desk and you can tell she had no interest. The interviee was a waste of time because it didnt even last 10 minutes. They looked bored. It took them 20 minutes to call me to the back because one of the managers kept coming to the front to see what I looked like and smirking at me.The second was at their billing office. I spent over an hour with the manager after about 20 minutes waiting for the manager to come back to the office because she had to shoe some people around the building. The first time going to this location I was given incorrect directs. This. Office is located in the middle of the woods. So I ended up having to reschedule. I was told I would hear back but i think they tell everyone that. Both interviews could have gone alot better on the managers end. Both were unprofessional if you ask me. I emailed the recruiter about if any decisions had been made and was told I was still being considered but after checking I saw that I was not selected. I probably will never recommend anyone applying here. Their managers represent the company and that was not a good representation", "Interview Questions": "I can not honestly remember. No questions were even asked about my previous employment or skills"}, {"date": "6 Jun 2022", "title": "Protection Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Riverside Health System (Newport News, VA) in Apr 2018", "Interview Descriptions": "The interview process its pretty straight forward no nonsense. There going to inquire about your background and ask what makes you great fit for this department/organization.  You will talk about the scheduling during this event and be asked about something security does that either make YOU turn down the job or embrace it.", "Interview Questions": "What makes you a great fit for our organization?"}, {"date": "9 Feb 2018", "title": "IT Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 months. I interviewed at Riverside Health System (Newport News, VA)", "Interview Descriptions": "First interview was with HR recruiter. It lasted about 30 minutes. I was scheduled for an in person interview. Was told I should hear of a decision in 2 weeks but first HR contact was out of office. Then the hiring manager was out of office. After no response for 3 weeks I saw the job posted on another job site. Shortly after received a standard email but it's the same email you get when they review your application but don't consider you for the job.", "Interview Questions": "Standard interview questions such as Tell us about you and your background?"}, {"date": "14 Oct 2017", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Riverside Health System (Newport News, VA)", "Interview Descriptions": "I was interview for a CMA position and sometime Phlebotomist. When I got hired all I did was mostly triage and do loads of paperwork. I would have rather gotten told the truth then give me false hopes on drawing blood and learning about the lab settings.", "Interview Questions": "If I had any restriction on working 40 hours per week, plus some Saturdays and Holidays. "}, {"date": "17 Oct 2017", "title": "Physician Recruiter Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Riverside Health System (Newport News, VA) in Aug 2017", "Interview Descriptions": "I applied in April and waited till May to hear something back. I was told I will be able to make a phone interview. After the phone interview I had my actual interview in August.  It was a panel interview that lasted 3 hours. After waiting 2 more weeks I was told the position went to an internal hire.", "Interview Questions": "How does this job fit your lifestyle?"}, {"date": "4 Aug 2017", "title": "Nursing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Riverside Health System (Gloucester, VA) in Jun 2017", "Interview Descriptions": "Telephone interview is always very nice and the interviewers are always plesent.  You can set up the day and the time you would like to be called.  The interviewers are always on time when they call.", "Interview Questions": "What would you do if a client is being difficult? "}, {"date": "16 May 2017", "title": "Phlebotomy Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Riverside Health System", "Interview Descriptions": "Very nice people and pleasant process. They called for an interview and we set up a time after that. Interview was several questions then they wanted to hear a little about your experiences", "Interview Questions": "How you have overcame something in your job"}], [{"date": "13 Jul 2021", "title": "Private Duty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Riverside Health System (Newport News, VA) in May 2017", "Interview Descriptions": "Interview was fairly simple. I was interviewed by a recruiter. A few days later I had a one on one interview with the manager. I received a job offer a few hours after the interview", "Interview Questions": "Name a time where you went above and beyond to provide good customer service."}, {"date": "20 Mar 2017", "title": "Pharmacy Resident Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Riverside Health System (Newport News, VA) in Feb 2017", "Interview Descriptions": "4 hour behavioral interview with the pharmacy leadership and residents. They look more for personality fit than anything. Everyone was relatively young with easy personalities. The hospital itself is clean and impressive.", "Interview Questions": "The usual behavioral questions"}, {"date": "13 Dec 2016", "title": "Office Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Riverside Health System (New York, NY)", "Interview Descriptions": "Easy. Submitted application online via Riverside careers site. I received a call from the hiring manager to come in for an in person interview with himself and his front office supervisor. It was brief, roughly thirty minutes as a medical practice is a very busy place.", "Interview Questions": "Are you prepared to work in a fast paced environment? "}, {"date": "29 Aug 2016", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Riverside Health System (Newport News, VA)", "Interview Descriptions": "I applied online and was contacted by the nurse manager to come in for an interview. Very straightforward, typical interview questions (tell me about yourself, strengths/weaknesses) and she also asked about shift preference and scheduling right off the bat. As a new grad, I wasn't given any case study/prioritization or specific clinical scenario questions, just the question I listed below. Took about 20-30 minutes. After the interview I was asked to come in to shadow on the unit and see if it was a good fit.", "Interview Questions": "Describe a time when a patient was dissatisfied with your care."}, {"date": "23 Jul 2016", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Riverside Health System in Jul 2016", "Interview Descriptions": "Very easy. Applied online. Within a week was contacted by the department to schedule an interview. Was told after interview to look forward to speaking to recruiter for job offer.", "Interview Questions": "Basic interview questions."}, {"date": "12 Jul 2016", "title": "College of Health Careers - Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Riverside Health System (Newport News, VA) in May 2016", "Interview Descriptions": "The entire process from application to start date was 49 calendar days; 28 calendar days from Recruiter contact to offer; and 15 calendar days with 3 in person interviews before an offer was extended.   The details of the process:  \r\nI was contacted by the recruiter the week after applying to set up a basic 20 minute phone interview.   This was a basic yet thorough review of my resume, education, and background, the position, and some fundamental interview questions.   \r\nTwo days later the hiring manager called to set up a face-to-face interview for the following week.  This interview lasted over an hour covering some standards interview questions specific to the position and how my background fit with organization.   It was a very open and honest exchange with a lot of notes taken and that other candidates were being interviewed as well.  \r\nEarly the next week I was contacted to set up a 2nd interview with senior staff and the hiring manager for the following week.  The second face-to-face panel interview had more of a meeting feel with a conversational tone among the participants.  There were some direct questions on my approach to integrating into the team would look like etc.  \r\nThe following day the hiring manager invited me back for a tour and meet and greet of the staff the next day, and the following business day I was contacted by the Recruiter with an offer.  I started two weeks later.", "Interview Questions": "How do get buy in during change?"}, {"date": "9 Mar 2016", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Riverside Health System", "Interview Descriptions": "Overall, this process included a lot of different steps, but I was impressed at how quickly my start date followed my application submission. Also, the recruiter who helped me was very encouraging, helpful, and always gave a timely response.\r\n\r\n1. Apply Online\r\n2. Contacted within 24 hours\r\n3. On-site Interview\r\n4. Phone Interview; at the end, offered position, set up orientation dates and start date\r\n5. Received official offer email \r\n6. Filled out New Hire Paperwork\r\n7. Required Pre-Employment Physical and Payroll Processing Appointment\r\n8. System-wide Orientation\r\n9. Started the next day", "Interview Questions": "Please describe a time when you disagreed with a co-worker and how you overcame it."}, {"date": "5 Jun 2017", "title": "Medical Laboratory Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Riverside Health System (Williamsburg, VA) in Oct 2015", "Interview Descriptions": "Interview process was intense but necessary to ensure the person being hired was efficient in the field. Many technical questions asked about procedures and overall knowledge of the laboratory as a whole.", "Interview Questions": "Describe a time when you implemented a change to a process relating to the laboratory. What was the suggested change and what was the outcome."}], [{"date": "29 Sept 2015", "title": "Director of Facilities Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Riverside Health System (Newport News, VA) in Sept 2015", "Interview Descriptions": "Phone interview as a pre-screen. Then a week later I received a scheduling call for an in person interview with the Asst. Director for a week from the day. The following week I received another scheduling call for a panel interview that took place a week later. I received email notification in 2 business days that i was not selected.", "Interview Questions": "Why do you want to work here?"}, {"date": "22 Aug 2015", "title": "Senior Executive Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Riverside Health System", "Interview Descriptions": "Process begins with a phone screening with the HR coordinator. This consisted of behavioral questions and \"what if\" situations. Second step is a face to face with HR. My interview also consisted of meeting with the hiring manager and another secretary.", "Interview Questions": "Questions centered around knowledge of technology, computer programs, and customer service."}, {"date": "19 Oct 2018", "title": "CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Riverside Health System (Saluda, VA) in Jun 2015", "Interview Descriptions": "Got a phone call asking to come to location for interview, got offered the position after answering basic interview questions, went to hospital to take drug test, then you go take a class in Newport News where you get your ID photo taken and information on Riverside.", "Interview Questions": "Ehy you want to ve part of the Riverside team?"}, {"date": "29 Aug 2015", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Riverside Health System (Newport News, VA) in Apr 2015", "Interview Descriptions": "I had a phone interview and then a face to face interview  After I was offered and accepted the position I did have to have a background check for the company.  I also had to get an updated TB test and MMR vaccination.", "Interview Questions": "Why was I interested in the position?"}, {"date": "22 Apr 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Riverside Health System (Newport News, VA) in Apr 2015", "Interview Descriptions": "Very upbeat and friendly. I was interviewed by two nursing managers answering basic questions on why I applied there. After about a 30 minute face to face I was shown around and introduced to a few people. I thought I had the job because I had never been shown around unless I was hired. However she told me she would follow up after submitting my answers to the interview.", "Interview Questions": "What would I contribute to their company?"}, {"date": "15 May 2015", "title": "Assistant HIMS I Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 1 week. I interviewed at Riverside Health System (Newport News, VA) in Mar 2015", "Interview Descriptions": "I was contacted to do a phone interview, the day after the phone interview I was contacted to do an in person interview. Both interviews went great and I really enjoyed meeting the HIM director and a few of the staff. In fact I was questioned by 3 of the current staff members which I thought was a great way to see if a potential employee would be a good fit.", "Interview Questions": "I was asked to describe an experience with a difficult patient/customer."}, {"date": "26 Nov 2018", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 4 weeks. I interviewed at Riverside Health System (Newport News, VA) in Mar 2015", "Interview Descriptions": "It was simple and easy.  Normal interview process first. I got my vaccines and background check done the same day. About 4 days later I was sitting in the New Hire welcome classes about benefits and things. I started my first day of my 4 week orientation the next day.", "Interview Questions": "Describe previous positions, tell them about myself, and describe ideal work environment. "}, {"date": "9 Nov 2014", "title": "Emvs Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Riverside Health System", "Interview Descriptions": "FIllied out application online was called back a month later for an interview meet with both mangers and was told that i would know if i was hiring after they finished interviewing everyone. i was asked basic questions about work history and was told at the end of the interview i got the job", "Interview Questions": "N/A"}, {"date": "11 Oct 2017", "title": "Emergency Department RN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Riverside Health System (Williamsburg, VA) in Aug 2014", "Interview Descriptions": "Submitted application, met with HR folks (they are good at what they do, but VERY rude).  Met with the ED nurse manager, and applied.  Seemed to be more of a hand wave than an actual interview; like they were hurting for people.", "Interview Questions": "Can I work shift work?"}, {"date": "3 Aug 2016", "title": "Environmental Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Riverside Health System (Newport News, VA) in Jul 2014", "Interview Descriptions": "My interview process was fairly easy.  My soon-to-be boss kept in contact with me all week up until my interview day, and he was waiting for me in the lobby when I got there.  I dressed just like anyone would trying to get a job, which was slacks and a tie.  My interview lasted maybe 15 minutes and the other 15 minutes was my interviewer just learning about me, which is always a good thing.", "Interview Questions": "What type of work experience do you have relevant to this job?\r\nHow long did you do that job?\r\nIf you don't mind me asking why did you stop working at your previous job?\r\nWhat type of hours do you prefer?  Are you fine with working weekends?\r\nDo you have any medical limitations that will prevent you from doing certain aspects of this job?\r\nWhen is the earliest you can start?"}], [{"date": "26 Mar 2015", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Riverside Health System (Newport News, VA) in Jun 2014", "Interview Descriptions": "Very informal and easy-going. Asked appropriate questions. Felt at ease during the interview. Have to wait a while for an offer to be presented, and even then the starting pay is up to corporate.  Starting pay is very low compared to other places. Interview was painless. Interviewed with one person, and not a panel of people.", "Interview Questions": "Where do you see yourself in 5 years in your healthcare career?"}, {"date": "12 May 2014", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Riverside Health System (Newport News, VA)", "Interview Descriptions": "Behavioral interview coupled with a computer-based survey. I was interviewed by HR and then by the hiring manager. The hiring manager asked general questions related to how i would handle real-life situations related to patient confidentiality or how I would resolve potential conflicts with coworkers. Overall pretty standard.", "Interview Questions": "There were no \"out of the ordinary\" questions"}, {"date": "18 Oct 2015", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Riverside Health System (Newport News, VA) in Jan 2014", "Interview Descriptions": "Just a few questions about your so where you want to be in 10 years just a typical regular interview. You have to make sure when you submit your application online that you do the survey at the end or you will not get a phone call", "Interview Questions": "Just a few questions about your so where you want to be in 10 years just a typical regular interview"}, {"date": "14 Feb 2014", "title": "Marketing Professional Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Riverside Health System (Kankakee, IL) in Jan 2014", "Interview Descriptions": "They were very professional and seemed to be truly interested in me and my possible employment at their office. They asked about my different experiences in marketing, what originally got me interested in marketing, how good I was with computers, photoshop, writing code, and if I was able to provide my own transportation.", "Interview Questions": "What school I was from. It may seem pointless, but they spoke as if there were so many applicants that they couldn't even remember what was on my resume, even though one was right in front of them."}, {"date": "4 Nov 2013", "title": "Physician Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Riverside Health System", "Interview Descriptions": "I spoke with recruiter and then with CEO. Then I was interviewed by the group I was most interested in.", "Interview Questions": "No difficult questions"}, {"date": "23 Jul 2015", "title": "Administrative Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Riverside Health System (Newport News, VA) in Sept 2013", "Interview Descriptions": "Took forever to get a call from HR. It was a moth after I applied before I heard anything. I had a phone interview with HR department they forwarded info to manager of department.  Had an interview at the department with the department head, and two other upper management employees. After another week and a half wait, HR called to offer me the position.", "Interview Questions": "Why do you want to work for Riverside? "}, {"date": "26 Mar 2015", "title": "Trauma/ER RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Riverside Health System (Newport News, VA) in Jul 2012", "Interview Descriptions": "The interview was conducted in a very comfortable way. I clicked immediately with the Nurse Manager and it was one of the best interviews I've ever had. I was hired on the spot.", "Interview Questions": "Why did I want to work there?"}, {"date": "22 Jul 2014", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Riverside Health System in Jun 2012", "Interview Descriptions": "The manager that interviewed me was very personable, so that helped to relax me. I only had one interview and I was offered a PRN position, which eventually became full-time. The interview process didn't take long at all and I started about a week after my interview", "Interview Questions": "What are your weakness?"}, {"date": "7 Feb 2014", "title": "Recruitment Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Riverside Health System (Newport News, VA) in Apr 2012", "Interview Descriptions": "Applied online which took awhile to receive a call back but you can check your status online, was called and completed an intial phone interview (discussing my resume), had interview with hiring manager, recruiter called back to extend the offer", "Interview Questions": "No difficult questions, research the company and job description and you will be fine."}, {"date": "4 Nov 2015", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Riverside Health System (Newport News, VA) in Jun 2011", "Interview Descriptions": "An initial phone interview with talent recruitment followed by a phone interview with the hiring manager. Two in person interviews. One with hiring manager and another with the other leaderships", "Interview Questions": "Primary asked about my experience. Questions focused on my management style and my ability to management people and process. "}]]