[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Epic mission. Great place to work. Love my colleagues.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Feb 2023", "job_title": "Program Manager in New York, NY", "duration": "N/A", "pros": "I knew it was going to be exciting but I didn't know I would be meeting and interacting with the world's bravest people who are in the news and making a difference in the world. I really like the vibe at my job, I have previous experience at another non-profit which was highly political with a lot of office rivalry. This place is collegial and people are kind. Teamwork here works . It's also real work. And sometimes a lot. We are all expected to fulfill whatever task with a focus on quality work and my colleagues will gently point out when I'm missing the mark.", "cons": "Conference planning for the annual event (Oslo Freedom Forum) can be demanding. I wish the staff was larger. HRF puts on a conference that could easily have 90 staff members but it's done with 30. It's quite the achievement."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Always positive energy", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Mar 2023", "job_title": "Independent Contractor in Washington, DC", "duration": "N/A", "pros": "Even though I worked from home and I was in different location from the HQ, the staff is close, friendly, and incredibly competent. You do fulfilling work and help a lot of people. Always a positive energy from everyone.", "cons": "Everyone was always really busy, but that’s not really a con."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Zero stars and expensive therapy bills", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Dec 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Meeting the activists — because they’re inspiring and to warn them to run far away from this shambolic regime.", "cons": "The entire organization is focused more on preserving its ancient power structure and earning media than it is on human rights. So many valid, reasonable reviews have been deleted. FORCED FIVE STAR REVIEWS: THE AUTHORITARIAN REGIME THAT IS THE HUMAN RIGHTS FOUNDATION."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Cool", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Mar 2022", "job_title": "Head of Marketing", "duration": "N/A", "pros": "It was alright, nothing bad to say", "cons": "I don’t feel there is any cons"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": 5, "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Most toxic environment", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 Apr 2022", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "- passion for the mission\r\n- individual contributors solid, caring\r\n- unique approach to critical issues", "cons": "- toxic management and leadership\r\n- no clarity of growth\r\n- financially unstable"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Solid Place to Work", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Jan 2022", "job_title": "Intern", "duration": "N/A", "pros": "Good exposure to experiences early on.", "cons": "Sometimes mismanaged and you take on a variety of information."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Very team oriented", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Nov 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Fantastic company culture. We’re a well-trained team. We treat each other with the respect we’re due (this includes management). When office drama creeps in, as it inevitably does in this type of work environment, we squash it quickly and make moves to forgive and get back to working as a unit again.", "cons": "We need to grow our team and keep it at a consistent size. You never know who’s going to come and go, so it can be hard to pin point how large your team is going to be month to month. If we plan to make a difference on a much larger schedule, we need more passionate people who intend on making HRF their home."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A very bright future", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Nov 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "If COVID-19 has taught us anything, it’s that we need one another more than ever. The company has its issues, but it has truly been phenomenal over the past few devastating months. We’re closer than ever before as a company. I foresee us actually growing during this crisis, even as everyone else is shrinking and being forced to close their doors.", "cons": "It can be emotionally draining working with so many human rights activists. Hard to say no to someone who’s trying to do good in the world, but we simply can’t meet every request or demand out there."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "The Best Non-Profit to Work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Sept 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "There’s almost too much to say about HRF. Everything from the work we do to the people we work with are truly incredible. It goes without saying that as a Human Rights non-profit organization that we’re literally doing life-changing work every day, but what makes HRF truly great is deeper than that. It’s the work culture that management has created by hiring an incredibly diverse, talented staff of caring and passionate individuals. The people I work with are truly one of the best parts of working here!", "cons": "If you truly love the work, there are no cons to this job."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "An organization dedicated to making a difference", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Oct 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "If you’re not interested in fighting for human rights – basically if you’re just looking for a job to pay the bills – then don’t bother applying. HRF requires individuals who are wholly dedicated to going above and beyond their duties in the pursuit of equality for all. This is an excellent job for those with the right mindset. If you’re just here for the paycheck, you’re going to struggle.", "cons": "No cons. Be willing to work hard and be a team player. Know that your time and energy is being dedicated to a greater good."}], [{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 3, "Compensation and Benefits": "N/A", "Senior Management": 4, "review_title": "Great team", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "22 May 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "A passionate and hardworking group", "cons": "Limited career opportunity but can work your way up"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Best School for Human Rights Defenders", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Mar 2020", "job_title": "Program Officer", "duration": "N/A", "pros": "I work full time at HRF.  The work-life balance is excellent with no set hours and the ability to work from home--except during conferences where you can kiss goodbye to work life balance as everyone pitches in to create what, year after year, is hands-down the best production experience I have ever seen.  \r\n\r\nThe job offers me the ability to travel globally and visit and work with world-class human rights defenders while traveling comfortably (we are consistently allowed to stay in good hotels and out flights, though coach, and never multiple layovers). Good pay for the limited amount of stress and pressure in non-conference periods. Great office located right in the middle of Koreatown with an unbeatable view.  Lots of team-building lunches and dinners and a spectacular brain trust in the office.  I love working here. The mission is unlike  any other at a human rights group.  Senior management is considerate and professional.  I would recommend HRF to anyone who wants to learn the nuts and bolts of effective human rights campaigning and see the impact of their work on the lives of those most oppressed.", "cons": "For four months in 2019 a handful of employees made life at HRF miserable for the staff and management. They were laid off. And now, hell hath no fury like a group of employees who were laid off and, in the space of just a few months, obsessively post reviews on Glassdoor as retaliation. The truth is the organization is 15 years old and will weather the nastiness of 2019."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Made great connections", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Oct 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "If you stick with HRF long enough, you’ll get the opportunity to make connections with a lot of interesting people. These have really come in handy because I was able to connect with some of these individuals after my time at HRF to launch my own projects. It was a good experience overall.", "cons": "Pay isn’t that great honestly, and management can be a little on the controlling side. Micro management was always the most annoying aspect of working at HRF."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "insane amount of work--but at least you're working to end oppression", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Sept 2020", "job_title": "Senior Program Associate in New York, NY", "duration": "N/A", "pros": "-exciting, impactful work in a fast paced environment. you actually get to see the achievements manifested. \r\n-i chronicled how the organization goes from taking political prisoner cases to winning those cases at the UN's WGAD. it was so effective it even looked easy. \r\n-i got to see how a group of five people: two interns and three staffers--could create a top headline impact story across media with three days of work. it's the most I have ever worked but also the most fun I've had. \r\n-management allows you to work with free rein so long as you prove you can deliver\r\n-the organization's film production program is awesome. hrf isn't afraid to get involved with media and culture to bring change and our new film made it into Sundance to great reviews.\r\n\r\nnon program elements:\r\n-we have unlimited PTO and covid has barely affected the workflow in terms of leadership seeming to know what they're doing.\r\n-new computer, cellphone, subscriptions I need to do my job.\r\n-I feel supported\r\n\r\nupper management is an interesting collection of men and women: asian, middle eastern, south american, muslim, jewish, norwegian, gay--yet they seem to work well together. I consider hrf a happy place.  good sense of humor.", "cons": "-the organization works staff hard but in all fairness the managers are willing to work even harder. I think their work-life balance is totally insane but it seems to work for everybody here \r\n-organization's events are unbelievably ambitious for an organization this size\r\n\r\ninstead of a 5 star review I'd like to give them 4.7 but this isn't possible."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A lot to love", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Oct 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Friendly and relatable management. An open-door policy makes it easy to speak with management whenever the need arises. This is a major bonus because it makes managers more approachable.", "cons": "You have to be very coordinated and self-motivated to stay on top of your tasks. If you think someone’s going to schedule out your workload and keep you on track, you have another thing coming. This was jarring initially, but once you get into the groove of things it gets easier."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent company that fights for human rights", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Nov 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Co-workers were a blast to work with. Every day was different. Large variety of projects to work on.", "cons": "No cons. Employees are treated very well."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Horrible C-Suite, Great Coworkers", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Sept 2020", "job_title": "Associate in New York, NY", "duration": "N/A", "pros": "- Passionate coworkers\r\n- the view from the NYC office is nice?", "cons": "- C Suite is run by rich, entitled, conservative white men who are completely out of touch with the reality of non profit work\r\n- Sexism, misogyny and racism are RAMPANT\r\n- No kind of HR procedures\r\n- Employees are overworked and associates are severely underpaid\r\n- completely unethical practices, people are hired based off of who they know NOT bc of merit and fired not bc of work flaws but bc upper management doesn’t like them speaking out and standing up for themselves \r\n\r\nPLEASE PAY ATTENTION TO THE NEGATIVE REVIEWS, YOU WILL MOST DEFINITELY ENCOUNTER THEM ALL IF YOU CHOOSE TO WORK HERE"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "A unique place to work and make an impact on the world", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "6 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "HRF is a great place to work if you want to meaningfully help and assist the bravest human rights activists in the world. No matter your job level, these programs and events and initiatives put you face to face, regularly, with these inspiring individuals. In the past decade the organization has grown significantly, with programs like the Oslo Freedom Forum, Flash Drives for Freedom, and various advocacy campaigns receiving worldwide acclaim. The organizational mission is no-nonsense: to challenge authoritarianism and help people who live under dictatorship.", "cons": "The organization is relatively small (approximately 25 people), which might be a downside for some. There is a lot of travel involved for some staff. The mission doesn't focus on American politics so that might also not work for some people whose passion is more local. Due to the nature of the organization's mission and hte relatively small staff size, there is a lot of work to be done, always, so it may be tough for some people to find the right work-life balance."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A Company that “Walks the walk”", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Sept 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "A lot of organizations pay lip service to diversity, but HRF truly embodies it. Our team is multi-ethnic, multi-racial, multi-gender and all-inclusive regardless of sexual orientation or identification. As an organization, we truly embody the human rights we fight for on a global scale. It’s refreshing to be part of such an incredible company culture that is so open and accepting of everyone. Because of our diverse team, we have some of the best of the best in their fields in the company. This makes the work much more enjoyable, and the comradery among the team is unlike anything I’ve experienced anywhere else. I look forward to coming into work each day and working toward our company goals.", "cons": "None of the problems at HRF are unique to the company. Many of them are across the board for all non-profit organizations, such as: work/life balance, there always seems to be more work than can ever be done (mostly because the world itself is a mess, and not because of the organization itself), and some of the experiences can be emotionally overwhelming."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 5, "review_title": "Amazing human rights job with which to kick-start your career", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Mar 2020", "job_title": "Program Officer and Program Director in New York, NY", "duration": "N/A", "pros": "I worked at HRF for four years full time and my duties ranged from program officer up to program director. \r\n\r\nThere were constant opportunities to learn from expert scholars, professional rights advocates, and to get to know incredibly talented coworkers; the work was interesting and inspiring.\r\n\r\nHRF is a prestigious institution with many connections, relaxed working hours and a fun office environment. They have a strong commitment to producing high-quality research and, impressively, the place has a level of consistency that reflects in its positions. Everyone working there is passionate and devoted to serving people who have been screwed over by oppressive governments.", "cons": "The pay, being a nonprofit, doesn't leave much room to get a salary that could support me and my husband as we prepared to start a family.  I'm giving HRF four stars instead of five because it is unlikely you will get paid more than $100K unless you reach the c-level."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "One of the Best Non-Profits in New York", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 May 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "The overall work experience at HRF is extremely gratifying. The environment is friendly, supportive, and encouraging and the team is staffed by some of the best in human rights activism. Since it’s a mid-size organization, we all rely pretty closely on one another to get every single project completed. Which is why is a very respectful work environment and everyone is always ready and willing to help a colleague in need. Management hosts plenty of team-building lunches and dinners and keeps a valuable brain trust in office to support a more collaborative environment, and it really works. It’s a truly inspiring place to work!", "cons": "Because it’s a non-profit organization, it can sometimes feel like there’s more work to do than can ever reasonably get done. But this is true of non-profits across the board. Also, even though HRF has plenty of great employee benefits, there isn’t currently a 401k plan in place."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Overcoming Adversity with Dignity", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 May 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "HRF had some issues last year with a few employees, but our leaders handled it with dignity and grace. Everyone in management are truly exceptional people. Sometimes I’ll have emails come in at 2am because they always put the organization and its mission first. They’re extremely passionate about helping others and making a real difference in people’s lives. And that’s immediately apparent to anyone who meets them. The organization is also very diverse, with employees from 10-12 different countries, a good majority of female workers, and our founder is openly LGBTQ individual. HRF has always had an incredible community of people and it still does!", "cons": "If you’re not a passionate self-starter, and find yourself to be more comfortable in a corporate setting in which everything is laid out for you and roles and responsibilities are very cut-and-dry, this might not be the place for you."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Life-Changing Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 May 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "In the first four months I worked at HRF, I learned more about international relations and politics than I did in all 4 years at college. The company’s mission is truly life-changing for millions of people around the globe and it’s very gratifying to be able to work for and be a part of such an incredible organization. It’s one of the best non-profits in New York, and I love getting to do work that has a real impact on people’s lives. I wouldn’t leave this company for the world.", "cons": "I’m not going to lie, the work is pretty emotionally demanding. It’s not always easy working for a human rights organization, and you have to be able to handle fighting the good fight."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Unmatched Dedication and Passion", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Jun 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Where to start? If you’re passionate about human right, this is exactly where you should be. Everyone who works here lives and breathes the work we do and it’s refreshing to be surrounded by so many talented, dedicated individuals who are working every day to fight for human rights globally. While there’s plenty of the usual pro’s (competitive pay, great benefits, opportunities for travel), what really sets HRF apart is the group of people you get to work with and be inspired by on a daily basis. Their motivation is infectious and I can’t think of better praise to give an employer but that I genuinely look forward to coming to work every day.", "cons": "Not a lot of cons in my opinion. Only two I can think of is that there’s no 401k plan and the open office layout can be distracting at times."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Amazing experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 May 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "We’re a tight knit group of people who are all trying to make a difference in our own, small way. There’s a lot to learn from the extremely knowledgeable staff who go out of their way to make sure you’re well equipped to meet the needs of your job. Thus far I’ve had an amazing experience, and I look forward to staying with the company well into the future.", "cons": "Lack of a 401K structure. The organization can feel a little unorganized because we lack “robust processes” as one of my friends likes to put it."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "A company that cares", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 May 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "There’s just so much to learn at HRF that it all feels a little bit overwhelming. This job has opened up many avenues for me. I’ve been able to travel globally (check that off the bucket list) and work hand in hand with some truly amazing and passionate people. Our battle to help the oppressed is never ending, but we’re all ready and able to meet the challenge.", "cons": "It should come as no surprise that a non profit organization like HRF doesn’t have the best pay in the world. Wish it were more, but you only get a significant pay bump if you reach a managerial level."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Nonprofit life isn't for everyone", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Feb 2020", "job_title": "Associate in New York, NY", "duration": "N/A", "pros": "Overall, as long as you are able to manage your own boundaries and work/life balance, this will be a very rewarding place to work at.\r\n- Passionate, intelligent and caring colleagues who will support you whenever they can \r\n- Opportunity to meet some of the most brave human rights activists in the world\r\n- You can develop and explore your ideas if they are good, regardless of your title\r\n- Unlimited PTO: If your work involves travel, you can usually take some time off after your trip and see many different parts of the world, as well as several weeks during summer and winter breaks\r\n- Respect for personal boundaries: Nobody will contact you during your PTO unless it's an absolute emergency / Mutual respect among colleagues / Managers will check in with you before you take on a new task of assignment to ensure you aren't overworked\r\n- Informal office culture: No clear hierarchy (unless with budgeting) \r\n- Priceless view from the office", "cons": "In general, this is a good place to work if you have experience working in other non/for-profit firms. Unless you're highly organized, it will be difficult to work here as your first job. \r\n- As a small nonprofit, you have to manage your own time, projects, and resources:  Nobody will keep your tasks and projects on schedule, and you'll be expected to do get things done without someone supervising you (but will give you advice/help if needed)\r\n- There used to be times when things were hectic and everyone was overworked, but management has done a very good job in reducing this since Fall 2018\r\n- Working with activists can be emotionally demanding due to the nature of their work, and if you're not good at saying no to them asking for help, you will end up overworking because of the sheer number of people who are doing good work and want to do more \r\n- Open office layout is distracting"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great place for the internationally-minded", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "6 Mar 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Quality of work: Through the annual operation, everyone gets the opportunity to learn about the world and travel (everyone gets to travel internationally at least once a year to the Oslo Freedom Forum in Norway). Everyone gets to understand and experience the important differences between democracies and dictatorships through the organization’s work, and to personally meet activists on the ground that fight against dictatorship. If you really appreciate the democratic system (whether in the U.S., Canada or Costa Rica or Spain), and really have a disdain for governments who rule tyrannically around the world (from North Korea, Russia, to China, to Iran), you cannot find a better organization in the human rights movement to work for.\r\n\r\nCompensation and work-life balance: Great salaries overall, considering the rest of the nonprofit industry. I started as an intern and was paid $1,000 per month at a time when Human Rights Watch did not pay interns. Excellent health, dental, vision and other benefits. Flexible policy on employees working remotely. I also knew of an employee that, as part of her work arrangement, did not come in on Fridays.\r\n\r\nSize: Also a pro, but with downsides, the organization remains relatively small, with employees never exceeding 30 at any given time. This allows the organization flexibility to act quickly in campaigns when activists get imprisoned, but it also diminishes opportunities for long-term career promotions and significant compensation in an extremely expensive city like New York, which can be challenging.\r\n\r\nManagement: People in management are very professional, and keen on receiving feedback, and acting to improve and fix any perceived shortcomings. This is also a positive aspect of the organization remaining relatively small. Management is majority female, which reflects the overall demographics of the organization.\r\n\r\nDomestic v. International Politics: The organization generally does NOT engage in domestic political debates. However, the organization does engage democratic governments in an attempt to make them allies in exposing the issues in authoritarian regimes, and to make them understand the dangers of authoritarianism taking over, even in democratic nations.\r\n\r\nDiversity: Truly diverse work environment. The organization has employees from 10 or 12 different countries in the world and the founder is an open LGBTQ person and advocate for minority rights both in the U.S. and in the countries that repress sexual-orientation minorities (Chechnya, China, Iran, Cuba, Saudi Arabia, etc.). A lot of organizations pay lip service to diversity but HRF truly embodies this diversity—people from different ethnic and cultural backgrounds, who agree that exposing authoritarianism should the top priority to fix the world. The organization is two thirds female—including in management—and my experience is that they are considerate and excellent professionals—from universities that are top notch: Columbia, Stanford, Penn, etc. \r\n\r\nAs to recent unfair bad reviews on Glassdoor: I have attended multiple Oslo Freedom Forums. The organization carries out several large conferences around the world. In my more than 5 years in the organization, I have never seen anyone from management or the president, or any male staff doing anything inappropriate, nor have I witnessed or heard about actions that would be considered sexual harassment against any man or woman whether on staff or not. Most of the male employees are openly gay (the organization is largely female and gay men outnumber straight men). Anonymous Glassdoor accusations that the organization is always “siding with the offender” and that “rampant sexual harassment” happens are absolutely false. For what I’ve asked around, I heard there were two incidents over ten years where a conference attendee behaved inappropriately. These individuals (who are not members of staff but conference attendees) allegedly made advances to members of staff (for context, these weren’t accusations of rape or groping—but broad unwelcome advances by a drunkard conference attendee at a bar). The reaction from management upon finding out was swift and forceful. These people were told they were NOT welcome and disinvited to attend any future conference. So, the organization sided immediately with the person making the accusation. Management did not consider any “due process” of the accused, but instead immediately acted to listen to and believe the victim, and to disinvite the suspected offender. I agree with this position because, especially in times of the #metoo movement, it is absolutely understandable to NOT give the benefit of the doubt to any conference attendee that gets drunk and as much as appear as acting in any way inappropriately with regard to a member of staff (or any other conference attendee), whether female or male.", "cons": "No 401K plan. There is no system in place to determine regularity of salary raises. Also, compensation tends to fluctuate with economic cycles that affect donations. Because of this lack of process, people who are more persistent at requesting raises and promotions might end up doing better than others at a particular point in time."}, {"Recommended": "N/A", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Pros outweigh the cons", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Mar 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Led by people who really care about the cause. Open door policy and friendly coworkers. Everyone is passionate about the cause and you learn a lot quickly because it's easy to ask questions and get answers. International travel opportunities are open to even lower level employees. Unlimited PTO with no guilt-tripping from coworkers or superiors. Employer-paid health insurance. Generally good work-life balance, except around and during HRF conferences, when it's all hands on deck. You get to meet some amazing people in human rights, policy, and international politics on the job, and get the opportunity to form friendships with those people. There's quite a bit of room to create your ideal position based on your own interest, and to work across team boundaries.\r\n\r\n\r\nIf you're a self-starter, believe in the mission statement, open-minded, and are open to doing a variety of work that isn't strictly limited to your job description, then this is a good place for you. If you're someone who enjoys a corporate setting where everyone has their own office with clearly laid-out and followed job descriptions then this is probably not the place for you.", "cons": "No 401k or annual pay raise structure. If you have new ideas, sometimes you have to insist on them and fight for them. Upper management takes some getting used to - each person has a different working style and strong personalities, and could be frustrating if you are not adaptable to each, but once you figure it out and set boundaries it works fine. Organization as a whole lacks robust processes, but that's partially intentional because management doesn't believe in bureaucracy in such a small organization. So the up side of this is that at times everyone feels equal and can have their ideas heard, but the downside is that sometimes efficiency is lower because of the lack of processes. A good percentage of the staff is based remotely so sometimes there's a disconnect in communications between staff and teams.\r\n\r\n\r\nNone of the problems at HRF is unique to this organization, and overall the pros of working here outweigh the cons."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Great opportunity", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 May 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "HRF is a fantastic work environment wholly dedicated to helping those in need. There are any number of positions you can fill depending on your area of expertise. That said, every role in the company is dedicated towards human rights. No matter what you do, you’re making a difference.", "cons": "Finding a good work-life balance can be tough. The organization is pretty small so each person has to deal with a heavy workload. Work may even spill over into the weekends during busier periods."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Ideal for Passionate Self-Starters", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Jun 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "HRF is a fantastic organization for self-motivated individuals who are passionate about doing meaningful work. Everyone in this organization truly cares about the work they do, and there’s really no room on the team for people who are here for any other reason. Everyone is driven, self-motivated, and passionate about making a difference, and it creates a work environment and company culture that I’ve never experienced anywhere else.", "cons": "You need to be able to set your own boundaries to maintain a work/life balance that works for you, especially because everyone here is so passionate about what they do and, at times, the workload can get overwhelming."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Good experience, caring company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Apr 2020", "job_title": "Program Officer in Brooklyn, NY", "duration": "N/A", "pros": "I have been working at HRF full-time for more than a year\r\n\r\nFierce, smart and caring. The foundation is a mid-size organization where everyone on the \"Team\" really puts everything into making it successful on a daily basis. Employees rely on each other to pull their weight to get the job done. My experience is that all staff is super kind and treats each other well and genuinely cares for each other. I have not come across any malice or office politics as of the time of this review. The CEO , Chief Strategy, and Chief Legal officers are workaholics and their emails are coming in at 3AM and 4AM and sometimes they look haggard on google hangouts because they worked after hours, I sense they are very passionate about the mission of HRF.  \r\n\r\nWith the WFH and Stay Home directive I have come to appreciate the amount they juggle each and every day. It's astounding, all the while truly caring for the employees. the Chief Talent Officer is in charge of HR and she is always responsive. And when I say these people are \"juggling\" I mean handling geo-political issues that have consequence—from films the foundation has produced that premiere at Sundance Film Festival to world-important conferences and events. \r\n\r\nBefore Corona took over the known universe HRF was way ahead of everyone with a network of people inside China informing on what was coming so the foundation took measures weeks before the U.S. was paralyzed. We all began working from home and nobody got sick—I felt very taken care of. Meanwhile, nobody was let go and the company recently announced to all employees that their jobs were secure. The foundation quickly shifted gears and has decided to put together online events to address how Covid was made worse by dictatorships. \r\n\r\nThis special place is a school for heroes and I’m so happy I get to be a part of it. I work with incredibly devoted and decent people and learn every day on the job. My summary is this: considerate employers with good pay and benefits. The place has a family-like feel. It’s also very international. I love it here and I am grateful that in unstable times I can make a contribution to human rights in the world.", "cons": "Wishing we had more team members to help grow. Management does seem to be making a strong attempt to address employee concerns and the person in charge of HR is quick to be in touch.  Responses to issues and support in the IT department is sometimes slow to arrive."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "legal associate", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "the small legal team is very knowledgeable of international law and how it works in closed societies. Great atmosphere at HRF. Great location.", "cons": "For some, the work in a human rights NGO can be overwhelming since our clients are people undergoing severe hardships, but, this can also be very motivating."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "One Big Family", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Aug 2020", "job_title": "Administrative Assistant in New York, NY", "duration": "N/A", "pros": "The work is incredibly rewarding, and we interact with some of the best volunteers and staff that I've ever had the privilege of knowing. In Development, we get the opportunity to travel around the country to work with people, and I love it. We feel like a family and work hard together, but also find time to celebrate accomplishments.", "cons": "If you’re not used to it, the open office layout can get distracting (but, chances are, you’ll get used to it) and the work load is common for any non-profit."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Really Cares About Employees", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 May 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "-Amazing team members\r\n-Management is passionate about HRF’s mission and truly cares about employees\r\n-Hosted team-building lunches and dinners\r\n-International travel opportunities\r\n-Competitive salary\r\n-Excellent health, dental, and vision\r\n-Great location\r\n-Onsite gym", "cons": "While HRF is an amazing place to work, I wouldn’t recommend it to anyone who doesn’t have previous experience in other non-profit organizations. It definitely requires a great deal of drive, passion, and a high level of organization."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Inappropriate Leadership, No Procedures or Protocol, Overworked and Underpaid", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Oct 2019", "job_title": "Coordinator in New York, NY", "duration": "N/A", "pros": "The only reason I continued dragging myself to this organization every day (besides the need for money) was that the team I worked directly with consisted of some of the most passionate, creative, talented people I know, who became real friends and role models to me. Fortunately, those people have now all left HRF, too, for better opportunities.\r\n\r\nBesides a few friends, the only other things I got out of HRF were unbelievably appalling stories of employee mistreatment and a long list of red flags to look out for at other organizations.", "cons": "I worked at HRF full time for 2 years. The wildly inappropriate behavior I witnessed and experienced at this organization from top-level leadership is shocking to everyone I tell the stories to. \r\n\r\nThis organization, though it’s 10 years old, still operates like a disorganized start-up in the early stages. Employees in the NY office are crammed into a loud and hectic “open office” space. No retirement plan, professional development budget, or home office stipends. No HR department, no real procedure or protocol for anything, no solid job descriptions or reporting structure (at least none that are actually adhered to), and sexual assault claims are dismissed and berated.\r\n\r\nContractors have gone unpaid for months or longer. Mid and lower-level employees are severely overworked and underpaid, and often expected to be available at all hours. I would often work on my commute, all day without a lunch break, on my commute back, and then again at home on a minimal starting salary. Pleas for more staff would be dismissed due to finances, while we continued to struggle to manage the workload of 2-3 people each. Employees regularly experienced chest pains, anxiety attacks, ulcers, etc. from the stress.\r\n\r\nHigh turnover rate and lack of sufficient staff means positions are often billed to potential employees as being able to create your own job description, with opportunities for rapid advancement, and the opportunity to work with a \"growing/changing organization\" - that means you'll be constantly overworked and asked to do things way outside of the job description you signed up for.\r\n\r\nWhile core and lower-level staff were primarily women from a diverse range of backgrounds, leadership is all men. They’ve said to all staff on multiple occasions that they “do not care about office diversity” and “just hire the right people for the job” (direct quotes), which usually means hiring upper-level staff directly from their own network without the position ever being posted to the public. Any organization-wide issues concerning race, gender, or sexual assault (and there are many) can be expected to be dismissed as \"toxic gossip\", or at the very least not understood, by them. \r\n\r\nThe CEO/founder rules out of fear with an iron fist, and he quickly snuffs out any whispers of dissent or organization by staff, using threats - ironically like the dictators that the organization prides itself on fighting against. He values perceived loyalty to him and the organization over actual work ethic or work produced, and prefers employees who stay quiet about highly inappropriate leadership and partner behavior. \r\n\r\nThe CEO/founder issued a major layoff in 2019, which has been followed by the hemorrhaging of many other core staff members as they quit before things have the chance to become even worse. It's a shame, considering some of the amazing activists whose work HRF could have supported if not for atrociously poor and inappropriate leadership. I would never, under any circumstances, recommend that anyone look into working for, interning for, contracting with, or partnering with HRF. Speak to any former employee first."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Upper level management never held accountable", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Oct 2019", "job_title": "Associate in New York, NY", "duration": "N/A", "pros": "There was incredible talent at the associate level. I learned from so many of my peers.", "cons": "After being hired, a non-existent onboarding process should have been my first red flag about this organization. I was told HRF functioned like a startup, but this place has been around since the early 2000’s so you can imagine my confusion with this statement. There is no HR department who could answer specific questions about my role and job duties. There was no structure or reasoning behind anything that happened my first week. I learned one aspect of my role, and then I was alone without anyone delegating tasks or telling me what my daily responsibilities would be, or to notify me about any deadlines coming up. As an associate, I essentially ran my entire department by myself, doing the work of a manager or director, on an entry-level salary.\r\n\r\nMorale was so low in the office. Associates were killing themselves to meet deadlines assigned to them by C-Suite execs, yet the executives would miss their own deadlines by weeks with no consequences, leading to more burdens on low level staff and accruing late fees for outsourcing materials and expedited shipping for events - the blame for which, of course, fell on the associates. Upper level staff were not held accountable to anything. The pay gap from Directors/C-Suite to Associates was astronomical, to the point where the workplace became a joke. \r\n\r\nThere was no sense of boundaries between work-life balance, or appropriate workplace conduct. I was spoken to by C-Suite executives multiple times inappropriately. These interactions ranged from publicly shouting at me in front of colleagues and potential partners, to disclosing information about employee personal situations and reasons for termination.\r\n\r\nThe expectation was to make this job your entire life, while shouldering all the responsibility that upper level management can’t handle or refuses to be held accountable for."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Disorganized organization with concerning management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Feb 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "The intelligence and vision of staff members, from interns to policy officers, is consistently impressive and inspiring. The mission attracts a compelling variety of talent and almost everyone within the organization is fully committed to doing everything they can to support HRF’s activist network.", "cons": "Ultimately, this organization is disastrously managed and lacks the internal structures and stability needed to progress as a formidable voice on human rights issues. The organization’s finances have been in dire straits for more than five years and senior leadership often admits to “borrowing from Peter to pay Paul” - seeking more funding to pay for large debts incurred on previous events or programs that generate little support. Staff were often forced to put business expenses on their personal credit cards because the sole HRF credit card was repeatedly cut off or overdrawn. Some staff members aggregated debts of more than $20k with reimbursement slow to come. Donor support is highly skewed toward a few individuals, and many of the requirements for HRF’s most significant grants are not diligently followed. \r\n\r\nThe treatment of women in the workplace has been discussed extensively in competing reviews on Glassdoor and I encourage those who read these reviews to appreciate that many of these employees with negative experiences worked directly with activists within the HRF network and voiced their concerns in addition to their own. Non-staff associated with the organization are still affected by its reputation and decisions to stand by offenders, and I personally know a number of individuals who feel uncomfortable with HRF’s politics but feel that they cannot speak out against the organization because they rely on it for funding and support and fear retaliation.\r\n\r\nIt is also critical to recognize that HRF’s holistic work environment encourages burnout and exhaustion, with threats often made to those who say they are struggling to maintain their workloads. Paranoia is endemic throughout the organization, much of this stemming from the CEO and senior leaders he has mentored, and an assumption that criticisms and questions about the organization and its structure are acts of sabotage or treason. For a considerable period of time, most employees at HRF were drawn from a pool of former interns or international consultants, with few coming to the organization with experience in other nonprofits or business organizations. This led to a culture of complacency within management and a disregard for new ideas. \r\n\r\nI was consistently threatened during my time at HRF for respectfully speaking up during meetings about decisions I felt would bankrupt the organization and personally watched countless employees break down on the job. Drug use, alcohol, and depression were rampant throughout the organization. Rather than demonize those who asked for help, HRF should strive to understand why its employees feel the need to self-medicate, particularly during stretches of time when staff are only sleeping 2-3 hours a night, rarely taking a weekend off, and often encouraged to work while on PTO. \r\n\r\nThere are countless stories to share that can demonstrate how HRF has manipulated its employees and created untenable work environments. However, HRF has a way of always skirting over its flaws and pretending that those who speak out and are removed for it are rare dissenters or employees with a grudge — which has happened every few years as if on a timed cycle. I would recommend for anyone considering working for HRF to reach out to some of those who no longer work at HRF and find out more about their experiences. It takes a long time to recover from the abuse and reputation of HRF, and I would hate for more individuals to go through the difficult process of realizing that an organization promising good work does not deliver on those promises, for either its community or staff."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Do you care about human rights?  Don't work here!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 May 2020", "job_title": "Programs", "duration": "N/A", "pros": "I had the pleasure of meeting the most incredible and inspiring group of activists that continue their work and advocacy despite constant threats from their oppressive governments. The Oslo Freedom Forum is truly a one of a kind conference.\r\n\r\nThe vast majority of the coworkers I had were 100% dedicated to making the world a better place. Despite everything HRF subjected them to, they worked tirelessly to advance the values of human decency, universal liberty, democracy, and freedom for every individual languishing under the yoke of dictatorship.", "cons": "Don’t believe the fawning, sycophantic reviews that have magically populated in past couple of months - despite the good work that the organization manages to do (in spite of its own best efforts), working at HRF was a constant struggle and drained the mind, body, and soul.\r\n\r\nThe organization is poorly managed, and absolutely has “founder syndrome.” The CEO reigns as a king and his word is final. On the more “benign\" end, these decisions forced employees to scramble and change projects and programs at the very last minute with little notice - on the more sinister end, employees who had dedicated years of their lives to the organization were let go for no reason, or humiliatingly demoted to the point where they quit. \r\n\r\nHRF treated its female employees, to put it lightly, terribly (I too encourage others to read reviews from early 2020 and 2019 to hear more stories). Despite consistently making up over 80% of its workforce, women were not represented in C-Level positions until just recently. Women were denigrated and ridiculed in meetings for their ideas, only to see male employees take said ideas and receive acclaim for proposing them. Women who protested this hostile environment were belittled and gaslighted. \r\n\r\nEmployees regularly worked 60+ hours a week without additional compensation, and working on the weekends, while not a requirement, was an absolute necessity if you wished to retain your job. \r\n\r\nA work-life balance was non-existent. Do not expect to be able to enjoy living in New York on a meager salary with the amount of work you will be expected to complete."}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Salary and the extent of responsibilities  vs. Benefits", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Jun 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Health benefits, sick days and other benefits are great", "cons": "Salary schedule is completely arbitrary"}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "OK", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Aug 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "direct work with activists from around the world", "cons": "communication issues between and within teams"}]]