[[{"date": "23 May 2023", "title": "Student Services Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rollins College (Winter Park, FL)", "Interview Descriptions": "On-line interview for the first time and extensive 3-hour for the second interview. One hour each for with the three team members. First one is more of personality and getting to know questions. The second one is about situations and past experiences", "Interview Questions": "What are your accomplishments? Tell me of a time when you failed. How do you define a leader? What will be your challenges in this job?"}, {"date": "28 Mar 2023", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rollins College", "Interview Descriptions": "I met with eighteen people within four hours. It was an exhausting experience, and in my opinion, completely unnecessary. It is very intimidating to be sitting in a room with such a large number of people at once.", "Interview Questions": "Asked me how I woudl speak to a prosoective student regarding the high price tag of tuition."}, {"date": "2 Mar 2023", "title": "Phone-A-Thon Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Rollins College in Jan 2023", "Interview Descriptions": "Was super easy and great! Since I currently work in the office it was easy to apply for and connect with. The office truly makes it a personalized experience no matter what department.", "Interview Questions": "What is your schedule for the semester?"}, {"date": "23 Oct 2022", "title": "Assistant Director of Alumni Engagement Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rollins College", "Interview Descriptions": "The first interview was by phone with the hiring manager/direct supervisor (roughly 30min). The second interview was virtual with the direct supervisor and department head (roughly 1 hr). The final interview was a full day virtual interview with HR, Alumni Engagement team members, and staff from other departments that work closely with Alumni Engagement.", "Interview Questions": "Share your experience with launching alumni engagement digital platforms."}, {"date": "2 Jun 2022", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rollins College", "Interview Descriptions": "Conversation Style and personality test! There were discussions with the team lead as well as other members to understand the role and culture. It was more behavioral than functional. Overall pleasant experience.", "Interview Questions": "Past Experience; Project Experience. Future plans"}, {"date": "12 Nov 2021", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Rollins College (Winter Park, FL) in Nov 2021", "Interview Descriptions": "The interview process was very intense. The final interview involved a day on campus, individual interview with the hiring manager, individual interview with HR, panel interview with the team, and a presentation to a large group.", "Interview Questions": "Tell us about a time you initiated a new idea, and how you got buy-in from constituents."}, {"date": "11 May 2021", "title": "Peer Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rollins College", "Interview Descriptions": "There were 2 interviews. One group interview and then if you made it through that you had individual interviews with the professors who's classes you would be a PM for.", "Interview Questions": "Why do you want this position?"}, {"date": "1 Jul 2022", "title": "Student Services Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Rollins College (Winter Park, FL) in May 2021", "Interview Descriptions": "Very easy and enjoyable interview process. The person I interviewed with was professional and asked me appropriate and job-related questions. I feel like she gave more information and was willing to show the space during the first interview (which isn't always the case).", "Interview Questions": "She asked if I had any previous managers/bosses that I looked up to and why? I thought that was a really interesting questions"}, {"date": "8 Jan 2021", "title": "Intern - Hourly Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Rollins College", "Interview Descriptions": "The interview was very positive. The process was more of a conversation. It was mix of soft and technical skills.  Even though I did not qualify the process was very educating.", "Interview Questions": "Tell us an example of team experience"}, {"date": "4 Nov 2020", "title": "Student Caller Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Rollins College", "Interview Descriptions": "A call over a phone with a future supervisor. An interview focused on highlighting communication skills and previous work experience. It was for an on-campus position meant for current Rollins Students.", "Interview Questions": "Tell me about yourself, why do you want this position."}], [{"date": "3 Dec 2020", "title": "Circulation Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Rollins College (Orlando, FL) in Nov 2020", "Interview Descriptions": "There were 3 interviews. The first was on the phone with HR the second was via webcam on google meet with 3 of your potential supervisors, the third was in person.", "Interview Questions": "When is a time you had a conflict at work?"}, {"date": "16 Jul 2020", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Rollins College", "Interview Descriptions": "At first there was a phone interview with an HR representative. Then I had a phone interview with the hiring manager. After that, I was invited for half day of in-person interviews with team I would be working with.", "Interview Questions": "What attracts you to the culture of Rollins? "}, {"date": "18 Feb 2020", "title": "Administrative Staff Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Rollins College", "Interview Descriptions": "The hiring process was quite lengthy and took a few weeks, but this is usual in higher education. HR and committee was very professional unlike other neighboring institutions. They kept me updated with the process.", "Interview Questions": "What attracted you to Rollins? Why at this point in your career? Where do you see yourself in 5 years? "}, {"date": "30 Jan 2020", "title": "Immersion Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rollins College", "Interview Descriptions": "Overall great process, they had one-on-one interviews. It was goal oriented and everything was laid out. No questions not answered by the end of the interview. Again I enjoyed the process and Rollins is a great place to work out.", "Interview Questions": "What are you career goals?"}, {"date": "3 Feb 2021", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rollins College in Aug 2018", "Interview Descriptions": "It took quite some time from start to finish, but I felt it was thorough and effective. I was able to meet multiple staff, give a presentation, and learn more about the role. Great questions and efficient communication.", "Interview Questions": "How do you handle conflict?\n\nWhat would a former boss say about you?"}, {"date": "29 Jun 2018", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rollins College (Winter Park, FL)", "Interview Descriptions": "A one-hour interview extended to a 3-hour experience including lunch. I was interviewed by 3 team members, including a Director, Associate Director, and Assistant Director. Team members shared information about the job, environment, and their own roles while asking excellent questions that allowed them to evaluate my fit with the job.", "Interview Questions": "Tell me about yourself."}, {"date": "23 May 2018", "title": "Property Management Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Rollins College (Winter Park, FL) in May 2018", "Interview Descriptions": "The application process took roughly 1-2 months from the moment I applied to receiving the letter as to whether or not I received the job. I applied online and received a call to schedule a phone interview a month later. After the phone interview with HR, I received another call to schedule a face to face interview. The face to face interview was between myself and the Property Manager, as this department was very small.", "Interview Questions": "What was one of your biggest challenges in the workplace, and how did you overcome it?"}, {"date": "25 Oct 2017", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Rollins College (Winter Park, FL)", "Interview Descriptions": "I applied on the College's website then was contacted by phone to come in for an interview. Traditional interview with Director and Assistant Director. Business attire and traditional questions were asked. It lasted about 30 minutes", "Interview Questions": "Would my political affiliation and involvement on campus be a problem in the workplace. This organization was listed on my resume because I was the President at that time."}, {"date": "6 Aug 2021", "title": "Project Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Rollins College in May 2017", "Interview Descriptions": "There are usually a series of interviews. First, HR does the screening. If you meet the qualifications, then they send your resume to the hiring manager. Depending on the size of the team, there will be several rounds of interviews. For instance, you may have a panel interview with people you might be working with in the department or cross-campus. Then, you meet 1:1 with the person who will be your supervisor. The last step is usually the \"blessing\" stage where you meet with one of the top administrators who will ask a series of questions and access your candidacy.", "Interview Questions": "Tell me about yourself\nWhy do you want to work here?\nHow does your experience relate to the role?\n"}, {"date": "28 Sept 2016", "title": "Visiting Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Rollins College (Winter Park, FL)", "Interview Descriptions": "Very friendly and welcoming process and was put up in a very posh hotel two blocks from campus that is owned by the college. I had to do a course presentation and a research presentation that students were invited to.", "Interview Questions": "Why are you interested in Rollins College?"}], [{"date": "9 Feb 2017", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Rollins College in Jul 2016", "Interview Descriptions": "There was  a phone interview followed by face to face interview requiring a presentation, a group interview, and an interview with direct supervisors. This was followed by an extensive reference check and another follow up phone interview.", "Interview Questions": "Why are you interested in Rollins"}, {"date": "24 Jan 2018", "title": "Admission Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rollins College (Winter Park, FL) in May 2016", "Interview Descriptions": "I first had an interview with several individuals who work in the Admissions department and then met one on one with Human Resources. It was a bit intimidating, but the process was very professional and thorough.", "Interview Questions": "Why are you interested in working at Rollins?"}, {"date": "2 Aug 2015", "title": "Film and Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Rollins College (Winter Park, FL) in Aug 2014", "Interview Descriptions": "Was taken in to a room and asked a few questions by the head of the Alumni office and a coworker. Nothing too difficult. Really just felt like they wanted to make sure that I would be able to communicate with the alumni.", "Interview Questions": "What is a lesson you have learned from previous filming experiences?"}, {"date": "17 Nov 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Rollins College (Winter Park, FL) in Aug 2014", "Interview Descriptions": "After getting accepted into the graduate school here at the college, I applied for the position online. I was quickly called back and called in for an interview, soon there after I received notice that I got the position. It was an extremely smooth process. This is just for one department tho, some departments may differ in their process and their questions.", "Interview Questions": "What do you think the most important thing we do here is?"}, {"date": "29 Sept 2015", "title": "Student Ambassador and Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Rollins College (Winter Park, FL) in Jan 2011", "Interview Descriptions": "Sat in a small office with the student coordinator and one other student also applying for job.  The interviewer was an upper class student I already knew and the whole thing was very casual.  He asked me and the other applicant probably a total of 10 questions and we were both told that same day we had gotten the job!", "Interview Questions": "Why did I want to be a student tour guide and ambassador?"}, {"date": "17 Oct 2009", "title": "Human Resources Assistant  Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Rollins College (Winter Park, FL) in Jul 2009", "Interview Descriptions": "From what I understand each department runs autonomously so it may vary from one department to the next. Due to the high number of applicants I had an initial (very lengthy) phone interview and was then called back to come in and meet the Director. They all seemed very nice. I previously worked at Stetson University and the culture was similar. I was also made aware that they do use the same enterprise management system called SCT Banner.", "Interview Questions": "They asked for examples of how well you prioritize. "}]]