[[{"date": "29 Jun 2023", "title": "Talent Aquisition Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nuvance Health", "Interview Descriptions": "Interviewed for two months (5 interviews total). Moved my current work schedule around many times to meet needs of virtual and on site interview requests. I was told there was one more round of interviews. That many rounds was unnecessary for questions asked - very repetitive. Hiring manager quit during this process. After that, I outreached twice and did not hear back for 4 weeks. Then I received an automated/non-reply email that they went with another candidate. Poor experience overall, my time was not appreciated.", "Interview Questions": "Basic interview questions on how you can fit the role, hit numbers, understand the demographic of the people you'd be working with, etc."}, {"date": "23 Mar 2023", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nuvance Health (Hartford, CT)", "Interview Descriptions": "The process was good. However, After calling several times and sending emails to HR I never got my travel cost reimbursed. This was all promised and I have emails but they ignored to pay. They asked me to provide my address to mail the check but then stopped responding. This shows how much they care about their employees.", "Interview Questions": "What is my vision for the program?"}, {"date": "15 Mar 2023", "title": "New Graduate RN Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nuvance Health (Danbury, CT) in Mar 2023", "Interview Descriptions": "Interview process was very strange. No transparency about shift availability or what floors were hiring. Was told that the two nurse managers would \"feel me out\" and match me to a floor based on my personality. Interviewers were very nice but left feeling a very incomplete regarding what was actually being offered", "Interview Questions": "Why Danbury hospital specifically? What is something you would bring to the floor? Tell me about a time that you faced conflict in the workplace, both with patients and coworkers, and how you handled it?"}, {"date": "20 Jan 2023", "title": "Human Resources Business Partner Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nuvance Health", "Interview Descriptions": "In person meeting with the TA manager, and then an in person meeting with the manager for the role. One hour each. Typical questions about experience and knowledge about the role", "Interview Questions": "Tell me about a time that you failed"}, {"date": "9 Dec 2022", "title": "Secretary Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nuvance Health (Poughkeepsie, NY)", "Interview Descriptions": "You will get a call back a month after applying from HR. A month after the interview you will be given the job. A month after that is when on boarding starts.", "Interview Questions": "Describe a time some wasn’t pleasant to you and how did you react?"}, {"date": "6 Nov 2022", "title": "Registered Nurse, BSN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nuvance Health", "Interview Descriptions": "It was a quick interview with unit management and then we took a tour of the unit afterward and I was able to meet some of the unit staff, the new building is huge", "Interview Questions": "How do you handle stress? If I were to call your boss what do you think they’d say about you?"}, {"date": "22 Oct 2022", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 7 weeks. I interviewed at Nuvance Health", "Interview Descriptions": "No terrible and met with 4 people - including someone from the team I was interviewing for, who I would report to, his boss, and a Director. All interviews were conversations, rather than a grilling by a ton of questions. In searching for work and talking to a lot of companies, this was very comfortable and it allowed me to be me. Part of the reason I accepted the position.", "Interview Questions": "How have you changed the culture of a team in your previous roles?"}, {"date": "20 Sept 2022", "title": "Medical Technologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Nuvance Health", "Interview Descriptions": "Very straight forward they were in need of help so the interview was quick not many HR questions. They asked a few general HR questions and if I had relevant experience and then told me what my day to day would be.", "Interview Questions": "Tell me about yourself, why would you be a good fit, do you have previous experience with microbiology in previous positions or in college, etc"}, {"date": "12 Aug 2022", "title": "Community Education Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Nuvance Health (Poughkeepsie, NY) in Aug 2022", "Interview Descriptions": "I met with Wendy and Peter who asked a lot of questions about potential scenarios and past experiences. They asked for certification numbers if I had them available. Lots of good conversation.", "Interview Questions": "Tell us about a time when you experienced conflict with a coworker."}, {"date": "2 Jun 2022", "title": "Patient Care Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Nuvance Health (Danbury, CT) in Jun 2022", "Interview Descriptions": "The interview process was very straightforward and only took around 15 minutes. The person who interviewed was very pleasant and allowed time for questions at the end of the interview", "Interview Questions": "What are your strengths and what are your weaknesses?"}], [{"date": "17 Mar 2022", "title": "Clinical Nutrition Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Nuvance Health", "Interview Descriptions": "Initial interview with HR then meet with hiring manager.\r\nMeet with sr. manager then tour of the site. Offer. Top to bottom about a month process. Pretty streamlined. Initial offer very low. Went up slightly. But after the fact concluded that the offer was really not appropriate for the experience. Company does not make accusations for advanced certifications.", "Interview Questions": "How do you handle difficult situations "}, {"date": "31 Jan 2022", "title": "Patient Liaison Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Nuvance Health in Jan 2022", "Interview Descriptions": "the interviewer was nice and super personal ,there was no pressure durring the interview it was a regular conversation with someone who wanted to employ me. I can't wait to fid out if I got the job I am extremely excited to see where this position will take me", "Interview Questions": "what would you say you need to work on"}, {"date": "7 Dec 2021", "title": "Respiratory Therapist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Nuvance Health", "Interview Descriptions": "Smooth interview process. I interviewed with two department chairs and both were very relaxed. Communication post interview was fairly quick. Overall a good interview experience and I would recommend to a colleague/friend.", "Interview Questions": "Tell us about a time when you overcame an adversity? "}, {"date": "11 Nov 2021", "title": "Medical Insurance Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nuvance Health (Poughkeepsie, NY) in Jul 2021", "Interview Descriptions": "Very disorganized. First meet up was with over 30 people in line by line interview by 5 people who’d call you up to over your resume and briefly talk and next. Shortly after they send a test to assess personality. \r\n\r\nSecond time theyd call me a few weeks after and said they were going to move to the final round and have a few (6 potentials left). I was said to get a call in a week or two. Finally got a call and turns out it’s a phone interview by the director of the department. The offer wasn’t strong and I wasn’t in a rush. \r\n\r\nI feel they wait too long and the process drags out. I am also not impressed on how they call, never leaving a name or contact and it’s s nightmare to get in touch.", "Interview Questions": "What was is your revelant experience ?"}, {"date": "29 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nuvance Health (Poughkeepsie, NY) in Apr 2021", "Interview Descriptions": "Very easy interview process for a new grad. I interviewed for a med surg unit that was part of their residency program.  The manager at that time and the assistant manager interviewed me.  It was done through zoom. Really basic questions and both were easy going. Got called two days later with a job offer.", "Interview Questions": "tell me about yourself? why nursing? Why this hospital? Strengths and weaknesses? How do you think your experience as a NA translate to being a nurse? "}, {"date": "28 Apr 2021", "title": "Director of Medical Education Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Nuvance Health (New York, NY) in Apr 2021", "Interview Descriptions": "Honestly disorganized is the best way to describe this process and organization. I had one phone screen with HR then a interview with the VP. I was supposed to hear back in two weeks MAX so after about a week and a half I reached out.  I wouldn't have reach out had the VP not told me they were trying to expedite this process and were looking at a 4-6 week hiring timeline. \r\n\r\n When I finally got ahold of the HR rep I was scolded for reaching out and told they would reach out to me when they were ready. That honestly should have been a huge red flag, but I stuck it out.  Quite literally 6 weeks later I get a request to schedule 4 interviews. The timing was a mess as I was told they were all thirty minutes but apparently some were an hour so I had to shift my work schedule. I was verbally offered week 10 of the process and expected a written offer that week. Week 11 I was verbally offered my minimum salary without any of the incentives we had discussed and when I tried to have a discussion the HR rep said that was “more than they would normally offer someone with my experience”. I was then called later that day to say they were no longer proceeding with my candidacy. It’s a shame. The position has been open for about 2 years and I understand why.  This interviewing process was a complete nightmare. The fact that they weren't even willing to have a conversation about salary and benefits is really disappointing considering the fact if the process hadn't taken 12 weeks I would not have had three competing offers.", "Interview Questions": "How do you manager conflict among peers?"}, {"date": "9 Jan 2021", "title": "Physician Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Nuvance Health (Danbury, CT) in Dec 2020", "Interview Descriptions": "Zoom interview, they were “very impressed “ with my experience.  Scheduled second interview and abruptly canceled after finding out my full name. Steer clear of these bigots at Nuvance, although if you’re a white supremacist I’m sure they’ll hire you. Pretty despicable group that would never survive in a more progressive and civilized state. I’m in the talks with my attorney to follow up with them.", "Interview Questions": "Tell me about yourself (but it won’t matter because we’re bigots)"}, {"date": "5 Feb 2021", "title": "Recruiter Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Nuvance Health (Norwalk, CT) in Dec 2020", "Interview Descriptions": "Conducted a phone interview with AVP, Talent Acquisition and then invited for second round video interview with Recruiter Manager and another Recruiter simultaneously. They were supposed to get back to me within 2 weeks and even after I reached out to all of them directly, they never responded back-very unprofessional.", "Interview Questions": "Typical recruiter interview questions, nothing surprising."}, {"date": "15 Jan 2020", "title": "Office Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Nuvance Health (Danbury, CT) in Jan 2020", "Interview Descriptions": "I was contacted by an HR professional who said she would forward my skills to the practice admin who would be interviewing me. I received an email a week later to have an interview another week later to have to ask for a week the outcome", "Interview Questions": "The only question I was asked at this interview was if I had any questions "}, {"date": "24 Sept 2019", "title": "IT Analyst Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 6 weeks. I interviewed at Nuvance Health in Aug 2019", "Interview Descriptions": "Contacted through a contracted recruiter.  Had 2 phone screens and then an in-person interview with 3 people. The job was posted with a salary range that was not in budget for the role. Waited over a month after an in-person interview to learn they couldn’t meet my salary requirements even though they were discussed early in the process.", "Interview Questions": "Where do you see yourself in 5 years?"}], [{"date": "12 Jul 2019", "title": "Advanced Practice Nurse Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Nuvance Health (Danbury, CT) in Jun 2019", "Interview Descriptions": "I met with the H.R. partner and reviewed the benefits package. Salary was not discussed. I then met with people in the department. The overall process lasted a few hours. Very casual and relaxed.  It has been 2 weeks since the interview and I am waiting to hear a decision.", "Interview Questions": "Tell me about yourself?"}]]