[[{"date": "28 Jul 2022", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Islamic Relief", "Interview Descriptions": "2 stages, first stage was 3 person panel, and the second stage was just with Manager and HR representative. \r\n\r\nGeneric list of questions that were tailored towards the role, everyone was friendly and listened well.", "Interview Questions": "Name and describe 5 of the IR Values. "}, {"date": "12 Jul 2023", "title": "Retail Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Islamic Relief (Leicester, England) in Apr 2022", "Interview Descriptions": "There wasn’t any interview for the job it was school work experience im just doing this review so I can use the website sorry about that idk why I can’t use this website without a review", "Interview Questions": "There wasn’t any interview it was skl work experience"}, {"date": "17 Jul 2021", "title": "Admin Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied through an employee referral. I interviewed at Islamic Relief", "Interview Descriptions": "I was interviewed by a panel of 3 people. I was given simple straightforward questions, nothing there to trip you up. Most questions were quite general and allowed you to really explain why you would be a good fit for the role. I got 6 questions in about 30 minutes online.", "Interview Questions": "Started with a simple tell me about yourself."}, {"date": "14 Apr 2021", "title": "Accountant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Islamic Relief (Birmingham, England) in Apr 2021", "Interview Descriptions": "applied and interview scheduled after a week. interview is via a a panel of at least 3 people who will interchangeably ask question  mostly about your knowledge of IR and about what your previous experience.", "Interview Questions": "That is your greatest strengths\r\nwhat is your understanding of budgets  and grant contracts"}, {"date": "16 Mar 2021", "title": "R&D Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Islamic Relief (Birmingham, England) in Mar 2021", "Interview Descriptions": "2 Interviews with the first being online with two employees from the department and the second face-to-face with a panel, I was required to take a skills test, which lasted 30 mins.", "Interview Questions": "Name 3 of the Islamic Relief values?"}, {"date": "2 Apr 2023", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Islamic Relief (Birmingham, England) in Feb 2021", "Interview Descriptions": "Scored set of interview questions totalling to a certain number of points - it was quite robotic and not much conversation. I was countered on a lot of my answers - for example if I showed experience slightly above the job criteria, rather than expressing interest in my skills, I was met with \"you won't be doing that much at this job.\" Since this is an organisation I'm passionate about, I was quite disappointed", "Interview Questions": "Tell us about a time you... type of questions"}, {"date": "20 Jan 2021", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Islamic Relief", "Interview Descriptions": "Give candidates a chance at getting a job in Islamic Relief. We all don't have contacts who can pave the way into Islamic Relief.  Folks don't bother applying if you have no contacts who can get you in. They recruit people known to them  previously.", "Interview Questions": "1) Tell us your strengths.\r\n2) Which languages do you speak? Notice how this question is asked on the application form. "}, {"date": "14 Jun 2019", "title": "Executive Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Islamic Relief (Birmingham, England) in May 2019", "Interview Descriptions": "I was invited to a video conference call with two Executive Assistants - this was the first stage interview. Both were nice and friendly. They used ZOOM to conduct the interview. Please familiarise yourself with ZOOM - a video conferencing platform. Two weeks later I was informed that I had been selected to attend the second stage interview - scheduled for the 24th June 2019", "Interview Questions": "Describe your career so far.\r\nWhat do you think are the key skills needed for this job? How would you demonstrate these skills in this position?\r\nWhy do you want to work for Islamic Relief?\r\nWhat is your key weakness?\r\nWhat is your key strength?\r\nWhat are the 5 skills/attributes that your current line manager would use to describe you?"}, {"date": "23 Jan 2020", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Islamic Relief (London, England) in Mar 2018", "Interview Descriptions": "Poor and rushed. Senior Manager and his Executive Assistant kept interpreting me while I was answering questions - let candidates answer the question. They end-up employing, young inexperienced staff while rejecting highly skilled people. The is largely due to Senior Managers feeling threatened by the latter. The place is full of inexperienced and incompetent people and it shows in the recruitment process. Give people a reasonable length of time to prepare for interviews - I was invited to interview after only 2 days notice. How are people supposed to prepare and arrange time off from their current jobs.", "Interview Questions": "What are your weaknesses"}, {"date": "26 Feb 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Islamic Relief in Oct 2017", "Interview Descriptions": "I was looking for work experience/voluntary work. I was called in for an interview and the interview was mostly about why I wanted the role and then it went on to telling me what I my day to day role would be", "Interview Questions": "Why do you want this role?"}], [{"date": "17 Aug 2017", "title": "Internship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Islamic Relief", "Interview Descriptions": "Internship. Very interesting, friendly and welcoming atmosphere. Assessment, presentation and interview.\r\nAssessment was challenging, however as previously stated interesting at the same time.  Interview was standard, as was presentation. Preparation is obviously required beforehand. They were very accommodating.", "Interview Questions": "Why do you want to work for Islamic relief?"}, {"date": "25 Aug 2016", "title": "Head of L&D Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Islamic Relief (Birmingham, England) in Oct 2015", "Interview Descriptions": "The interview itself was good but, otherwise, the recruitment process was mediocre: disorganised, very slow and lacking in integration.  Inadequate information was provided, there were long delays, no contact details were given and it was difficult to get in touch with non-replies and very slow replies.", "Interview Questions": "Describe yourself in 3 words"}, {"date": "24 Oct 2014", "title": "Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Islamic Relief", "Interview Descriptions": "Submit CV and covering letter.  Followed by interview. In some cases required to make a presentation at start of interview (title of presentation shared beforehand).\r\nFor more senior positions they'll have externals being on the panel (e.g. from peer organisations), which is unique but gives the process more credibility.\r\nSaying you want to work at Islamic Relief because it's Islamic won't get you far (and nor should it - they're not going to employ you for your religious practices, but your professional competencies; although it's shocking to hear how many people, especially at the more junior positions, use this line).", "Interview Questions": "What do you think are the challenged and priorities for the role you've applied for?"}]]