[[{"date": "30 Apr 2023", "title": "Social Media Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Aveda Institute (Williston, VT)", "Interview Descriptions": "After applying online, I was contacted via email to schedule an in person interview at the location. I met with the person to whom I would have reported, felt it went okay but never received any feedback.", "Interview Questions": "What experience do you have with posting on X platform?"}, {"date": "9 Mar 2023", "title": "Receptionist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Aveda Institute", "Interview Descriptions": "Interview was easy. They will ask about previous employment and how you handle difficult situations. They will then give you a tour of the facility and you’ll meet some of the instructors and students.", "Interview Questions": "How did you hear about us?"}, {"date": "8 Oct 2022", "title": "Facial Educator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Aveda Institute (Tallahassee, FL) in Oct 2022", "Interview Descriptions": "I initially interviewed for the position of facial educator with the Aveda Institute aka TSP. My first interview with corporate via zoom I was asked my salary expectations. I asked for my current rate of $30 an hour plus benefits including PTO. This would be about $50k before taxes. And a little over what a starting teacher makes in the state of Florida. I got a second in person interview. This went well and I received an offer of $20 an hour. 30-34 hours a week. Benefits are not applicable unless you work at least 35 hours a week and at $20 an hour it would be a little over $32k a year. To teach. When billion dollar company like Aveda pays less than the state of Florida for it's teachers and keeps them below benefits it's not surprising they keep advertising this position. Aveda, The Salon People. Estee Lauder corporate. Do better. Pay a living wage and offer benefits.", "Interview Questions": "1.) I was asked my salary requirements. I told them and they seemed amenable. Went on to second interview and they offer me $10 an hour under what I asked for. 2.) They asked me why I wanted to work there. 3.) If I had the \"heart\" of a teacher. 4.) If I had ever \"mentored\" someone before."}, {"date": "23 Jul 2022", "title": "Instructor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Aveda Institute (Chapel Hill, NC) in Jul 2022", "Interview Descriptions": "5 step interview process that took over a month. Incredibly too long for the pay they offer. They need much more transparency about pay before going ask the way through that.", "Interview Questions": "2 phone interviews, a demo, a full day shadowing, and then a final interview. They want strong, dedicated, passionate instructors. "}, {"date": "25 Apr 2022", "title": "SPA Educator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Aveda Institute (Tallahassee, FL)", "Interview Descriptions": "Zoom interview due to covid which was fine.\n\nThe interview went well enough until I asked the tough questions. I.E. what is the pay or salary. I was told that this information cannot be disclosed until I was given a formal offer. \n\nHUGE RED FLAG. \n\nI happened to know for a fact what past instructors make so when they asked me what wage I would ask for I said $20 an hour or basically 40k a year. This is considerably low. Aveda pays 19% below the national average for adult educators at a trade school. This was however the wage past teachers made.  So that is what I asked for.\n\nI also asked about advancement opportunities. They answered that \"there was always certainly more work to do\"\n\nSECOND RED FLAG. Extra work should come with extra pay and advancement. More work for the same money is a pay cut. Simple as that.\n\nAll in all this school is still/constantly looking for educators and it's easy to see why. Low pay, long hours (13 hour days) and oh yes doing extra work (events and such unpaid). No thanks. I dodged a bullet.", "Interview Questions": "-Experience.\n-Education.\n-My comfort level with teaching via zoom."}, {"date": "15 Apr 2022", "title": "Cosmetology Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Aveda Institute (Davie, FL) in Sept 2021", "Interview Descriptions": "I came to the institute for a in person verbal interview as an alumni from the school. The in person went very well, and I was invited back for a practical on doing things the \"Aveda way\" mind I graduated about 8 years ago. I went home and I practiced the cut and color they wanted me to do. One instructor that wasn't management over saw my practical. Critical comments were made during my practical to me about how my techniques are outdated from what they do now. They didn't even want me to let the mannequin process the full time after application. After I was done I was dismissed rudely. No hand shake, no thank you for your time, nothing. I saw myself out. I never heard back. When I reapplied to try again a few months later they asked me when I was available to interview. I said I was free and then they ghosted me. I have the qualifications and standards to meet their requirements. I believe I was not hired due to having an alternative appearance although it was professional.", "Interview Questions": "What does Aveda mean to you? Would you be able to work the schedule? What are your strengths and what are your weaknesses?"}, {"date": "17 Mar 2022", "title": "Front Desk Receptionist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Aveda Institute (Los Angeles, CA) in Feb 2021", "Interview Descriptions": "rescheduled my first interview TWO times. The first t time was meant to be a phone interview and they sent an email 5 minutes before my interview was supposed to start. Appears to be very unorganized.", "Interview Questions": "Give an example of a challenging work experience and how you handled it."}, {"date": "1 Apr 2021", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Aveda Institute (Orlando, FL) in Jan 2021", "Interview Descriptions": "It was a Face to face interview followed by a technical interview that showcases your knowledge on the subject. Must have a valid cosmetology license and must know or be willing to learn the Aveda way.", "Interview Questions": "A you familiar with the Aveda Mission?"}, {"date": "7 Mar 2021", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Aveda Institute (Austin, TX) in Jan 2021", "Interview Descriptions": "To the point and thorough. Nice staff and wants to get to know you as a person to see if both on the same page. Easy going if you love what you do", "Interview Questions": "Tell me a little about yourself "}, {"date": "22 Jan 2021", "title": "Cosmetology Instructor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Aveda Institute in Jan 2021", "Interview Descriptions": "Waited over 30 minutes which was fine. I spent about 45 minutes in the in person interview. Very relaxing atmosphere yet noticed a theme with numbers and time. Timing should come after you build your foundation. After the retail was talked about in a points matter I remembered..., oh yes, Estée Lauder owns them. I felt a bit sad knowing these students would think this is what clients care about. This is what corporate America cares about. There’s a way to do both. I thought this was not the way to teach the Aveda way I remembered. There was no talk about anything Aveda stood for. Zero about sustainability, giving back without getting something out of it and most of all caring about the world at all in any way, shape or form. The whole Aveda foundation has fallen to pieces.", "Interview Questions": "What would you do if you had a student that was falling behind with a haircut or color?"}], [{"date": "26 Oct 2020", "title": "Front Desk Receptionist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. I interviewed at Aveda Institute (Rochester Hills, MI) in Oct 2020", "Interview Descriptions": "They kind of need to chill. The interview was an hour long and they’re hiring process is pretty extensive and takes forever and the paperwork is insane. It’s a hair salon and beauty spa...not oval office. And some of them were just weird and personal. Like they wanted full details of how I interact with other people, it also felt like a psychology appointment.", "Interview Questions": "Q: How do you stand up to people in an uncomfortable situation? "}, {"date": "2 Mar 2020", "title": "Part-time Sales Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at Aveda Institute (Clearwater, FL)", "Interview Descriptions": "There was an online application that I completed and submitted. The next phase included a phone with the district HR manager. There was also a brief test that was required. The final step was an in-person interview with the Retail Manager.", "Interview Questions": "Are you interested in the industry?"}, {"date": "24 Oct 2019", "title": "Esthetics Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Aveda Institute (Las Vegas, NV) in Oct 2019", "Interview Descriptions": "The executive director from Aveda Institute of Las Vegas was very condescending from the moment she met me. I handed her my resume and she asked if I went to Aveda and I said no. After that, the interview went downhill and didn’t even last 5 minutes. The only question she asked me was why I wanted to become an instructor.  \nEven with my few years of spa experience as an Esthetician, I felt like she did not give me the time of day.  She probably judged me by the way I looked. I look a lot younger than I am. It was odd because she never asked about my past experience or anything related to that matter, other than the one question, so I assumed she judged me on that and on my credibility. The only reason why I applied was because the job description said it doesn’t matter if you weren’t a former student of Aveda or have any teaching experience, so I gave it a shot. Guess I was wrong. What I do know is that I got bad vibes from her and she made me feel inferior. I even followed up with a Thank You e-mail and explained to her that I felt that I didn’t have enough time to tell her about my passion about skincare career and the importance of wanting growth in the industry. No response. Next!", "Interview Questions": "Why do you want to become an instructor?"}, {"date": "23 Aug 2019", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aveda Institute (Bel Air, MD) in Jul 2019", "Interview Descriptions": "It was okay, I felt like it went pretty well. They made it seem like they liked me, boy was I wrong . The lady was nice. Questions were interesting I guess", "Interview Questions": "Why did you want to teach? "}, {"date": "2 Sept 2019", "title": "Professional Development Counselor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Aveda Institute (Westwood, CA) in May 2019", "Interview Descriptions": "Aveda Institute, specifically the Westwood location, seems extremely unorganized and unprofessional with some of their practices. I was asked to interview for the Professional Dev. Counselor position. After the first interview I inquired about the salary. I was not given an answer until after my second interview. The position is hourly and was below my pay range so I denied the offer. I was then asked if I would be interested in taking a “new position” they were developing. It was said to be a salary and within my range. I was then asked to come back and interview and meet with a few people, including Jill Sharpe, the director a few times. I was asked to shadow for 4 hours on a weekday. This makes a total of 3 times I traveled to meet with them and over 8 hours  total at the school. I received a phone call about a week later stating that the did not get the position secured and they would only be able to offer the lower paying position. How unprofessional to proceed with a 4 hour shadowing day without even confirming the role within the company. I’m glad it did it work out.", "Interview Questions": "How would you deal with a challenging student or their parents? "}, {"date": "15 Feb 2020", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Aveda Institute (Austin, TX) in Sept 2018", "Interview Descriptions": "There was an initial in person interview with the director asking the typical interview questions about my goals, and why I believe I would qualify for the position. After that I got a phone interview by the HR department and then a practical to see I can perform services required.", "Interview Questions": "Would my life maintain balance working the hours required? "}, {"date": "17 Jul 2018", "title": "Admissions Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Aveda Institute (Orlando, FL) in Jun 2018", "Interview Descriptions": "I was contacted via email to schedule a Skype interview.  We made an appointment for the following week.  I joined her on Skype and began answering questions.  I could tell that they were only interested in people who were former sales reps vs. HR or had recruiting backgrounds.  I think once she saw my looks (not young I am an experienced recruiter and a college grad), the interview for her was over.  I am guessing they only want people who look a certain way, young and heavily made up or young and more trendy.  This would I guess appeal to the type of people who would go to the institute.  She talked a lot about sales, not a lot about my experience in admissions at a local university.  She rushed thru every single question, not allowing me to elaborate because I knew my age (46) was a detriment.  So, the rest of the interview was just \"for show.\"", "Interview Questions": "What type of matrix did you use to measure your sales goals?"}, {"date": "16 Dec 2017", "title": "Assistant Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Aveda Institute (Portland, OR) in Dec 2017", "Interview Descriptions": "Interviewer was over 20 minutes late and did not apologise,I was about to leave as I don’t appreciate unprofessional conduct and if I had been 20 minutes late I doubt I would have been seen. Really unfriendly and didn’t listen to my answers to the questions, when I was halfway through a question and didn’t even finish the second half, she interjected with a new question.  Didn’t understand my professional background and clearly hadn’t reviewed my resume. I asked at the end when was the position starting and she responded as if I had asked “So when do I start?” Very negative experience.  I am new to the area but had some positive interviews today and last week so I realised its not the norm, I would stay away from Aveda if this is what the management is like.", "Interview Questions": "What is the best and worst manager you have had and why?"}, {"date": "10 Aug 2018", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aveda Institute (Atlanta, GA) in Sept 2017", "Interview Descriptions": "Phone interview followed by a Skype interview then an in person interview with campus director and lastly a technical interview. The process was lengthy but never felt stressful or uncomfortable. The process is to ensure qualified candidates are selected. If you have experience with Aveda product you're likely to get the job. However I would not recommend it if you have an ounce of self respect. They go out of thier way to humiliate staff and hold educators responsible for everything", "Interview Questions": "N/A"}, {"date": "5 Oct 2017", "title": "Admissions Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Aveda Institute (Chamblee, GA) in Aug 2017", "Interview Descriptions": "Such a huge waste of my time. I went through 4 interviews and there was always miscommunication regarding time and date on their end. Interviewed with a ‘higher up’ manager and they never called me back. I emailed and called and asked for my results either way. No response. The entire group is very unprofessional", "Interview Questions": "There was no rhyme or reason to their questions. They were all over the place. I mainly talked about myself and my skill sets"}], [{"date": "16 Mar 2017", "title": "Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Aveda Institute (San Francisco, CA) in Feb 2017", "Interview Descriptions": "easy interview and application process, nice facilities, snobby interviewer and not great communication about their decision. Front desk staff was nice , great location, easy to find, pay rate was laughable and not great benefits. I didn't want the job after talking to them", "Interview Questions": "What I was looking for long term."}, {"date": "27 Nov 2017", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Aveda Institute (Portland, OR) in Nov 2016", "Interview Descriptions": "I applied online in August and constantly called to get an interview with no return call. I was relocating to Portland and had worked for Aveda in Dallas. I finally gave up for a couple months before seeing an ad on craigslist and applying again. I applied online again and was called for an interview. I was interviewed with the owner and he said he would call me for a second interview. I had my second interview a couple weeks later and eventually was offered the job.", "Interview Questions": "Why Aveda?"}, {"date": "27 Feb 2018", "title": "Call Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Aveda Institute (Clearwater, FL) in Sept 2016", "Interview Descriptions": "sitting in an office with 2 friendly management representatives being asked basic previous work/personality questions. all together it was a very laid back yet professional interview.  For future interviewees I would not stress too much about the process but I do recommend attending in professional all black attire since that is the AVEDA attire.", "Interview Questions": "what experience(s) do you have in customer service?"}, {"date": "20 Jan 2017", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Aveda Institute (Washington, DC) in Sept 2016", "Interview Descriptions": "3 interviews. My first interview was by phone. My second was via Skype. And my third was face to face in Washington. They just want to be sure you have knowledge of the company And its culture.", "Interview Questions": "Where do you see yourself in 5years"}, {"date": "12 Jun 2016", "title": "Admissions Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Aveda Institute (Dallas, TX) in Mar 2016", "Interview Descriptions": "The process seemed, expedited, overly-promising. Phone screening by internal recruiting, and personality evaluations and then traditional interviews. The professionalism of all where incredible. Most interviews were fantastic, including speaking to the CEO.", "Interview Questions": "Basic questions, better conversations that questions. You just apparently have to be a culture fit."}, {"date": "29 Jun 2016", "title": "Educator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Aveda Institute (San Francisco, CA) in Mar 2016", "Interview Descriptions": "The hiring and interview process was clmfortable and easy. I had an initial meet and greet with the director and then a follow up interview with Cinta, herself along with a tour of the institute. \r\nAt both meetings, we were about 10 minutes behind. Which is understandable now that I understand the day to day obligations of the Leads and Management.", "Interview Questions": "What made me decide to make the shift from behind the chair and into education?"}, {"date": "15 Oct 2017", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Aveda Institute (Washington, DC) in Nov 2015", "Interview Descriptions": "Basic questions about previous experience, problem solving questions, and where do you see yourself in 5yrs. Questions about Beauty trends and \"If this were to happen, what would you do?\" questions.", "Interview Questions": "Why do you want to work at Aveda?"}, {"date": "8 May 2017", "title": "Educator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aveda Institute (Portland, OR) in Nov 2015", "Interview Descriptions": "Great first and second interview, received employment handbook, was told all the details of the job... left feeling positive that I nailed it, only to never hear from them again. Even with a follow up email", "Interview Questions": "What made you take the step to come here, instead of working in a salon?"}, {"date": "21 Oct 2015", "title": "Cosmetology Instructor Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "The process took 2 weeks. I interviewed at Aveda Institute (Portland, OR)", "Interview Descriptions": "Applied online, had a quick phone interview, was very strange. Set up a face to face interview with director ended up interviewing with someone else. Very casual. Then played phone tag for the third interview. Process seemed flaky, ended up excepting another offer.", "Interview Questions": "Can you handle high stress.?"}, {"date": "3 Oct 2015", "title": "Front Desk Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Aveda Institute", "Interview Descriptions": "I applied to an online ad and was called within the same day for an interview.  The interview process was very casual, but it seemed as though they were looking for someone who could work long term and who had more of a beautician background.", "Interview Questions": "Why do you think you would be a good fit for this position?"}], [{"date": "9 Sept 2016", "title": "Guest Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Aveda Institute (Minneapolis, MN) in Oct 2015", "Interview Descriptions": "Resume is submitted through Estee Lauder corporate. I received email re: face to face interview. Interview was conducted by team lead, lasted about an hour. It was very personable and was informative about what the job entails, although not about the negative parts of the job.", "Interview Questions": "What is your greatest weakness?"}, {"date": "16 Jun 2016", "title": "Finance Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Aveda Institute in Jun 2015", "Interview Descriptions": "Very easy. General questions. No background check needed - which I thought was odd. They should definitely require this since it's a school. They made the school sound very appealing, since they mentioned they are \"growing\" and they train new employees. Talked about \"awesome\" benefits e.g. free services at the salon and discounts.", "Interview Questions": "What's my knowledge in working at a school"}, {"date": "23 Apr 2014", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Aveda Institute (San Francisco, CA)", "Interview Descriptions": "Interview with director then Cinta. It was very conversational and not hard.", "Interview Questions": "N/A"}, {"date": "26 Feb 2018", "title": "Retail Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Aveda Institute in Mar 2014", "Interview Descriptions": "Brief interview of fine minutes about yourself over the phone. Questions about your last job experience, the position you held. How long you stayed in the previous company and the reason you left the previous job.", "Interview Questions": "Why Aveda Institute?  What do you know about Aveda Institute? Your strengths and weaknesses?"}, {"date": "4 Dec 2013", "title": "Experience Center Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Aveda Institute (Minneapolis, MN)", "Interview Descriptions": "I walked in to pick up an application. I filled it out while I was there and was asked if I had time for a first interview. I met with a manager and we had a great talk with some basic interview questions mixed with get-to-know-you questions. She stated how much she would like to hire me, but needed to get her manager's approval. I got a call the next day from her manager and was asked when I could start.", "Interview Questions": "I always hate the question about what your expected pay is."}, {"date": "13 Oct 2015", "title": "Cosmetology Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Aveda Institute (Atlanta, GA) in Jun 2013", "Interview Descriptions": "I applied online and did not hear back from the company for almost 3 months. The interview was vague and did not explain expectations of the position. Estimated salaries were different based on who you spoke to.", "Interview Questions": "Are you willing to work 45-48 hours per week?"}]]