[[{"date": "5 Oct 2022", "title": "PSR I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Central California Alliance for Health", "Interview Descriptions": "Culture-driven, customer service excellence, strong communication skills. They have a two to three-step process with various leadership team members in a panel format. They take turns asking the candidate questions.", "Interview Questions": "\"Tell us a time when\" questions\""}, {"date": "6 Sept 2022", "title": "Quality Improvement Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Central California Alliance for Health (Modesto, CA) in Jul 2022", "Interview Descriptions": "First interview is a HR screening phone call. Second and third are panels of leadership and someone on the team with leadership. The combination of levels of staff makes it more of a friendly atmosphere.", "Interview Questions": "They asked about my skillset in relation to the job role. They asked how to stay organized and what do I do to prioritize  work loads. "}, {"date": "8 Mar 2023", "title": "Senior Systems Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Central California Alliance for Health (Merced, CA) in Feb 2022", "Interview Descriptions": "Interview consisted of a phone screen with director of IT, a technical panel interview and a culture fit interview I didn't make it to. The questions were easy and I flubbed the technical by being nervous and thrown off.", "Interview Questions": "When would you choose thin or thick provisioning?"}, {"date": "22 Jan 2022", "title": "Interview for Claims Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Central California Alliance for Health", "Interview Descriptions": "1st Phone interview was 20 mins. 2nd  interview was via Microsoft Teams and it lasted about 30-40 mins. Friendly interviewer panel. Asked many job related questions about admin duties, medical terminology, codes.", "Interview Questions": "Tell us about your experience from your previous jobs that would be relatable to the position you are applying for? \r\nHow did you handle conflict with manager?\r\nYour expectations in the next 5 years?"}, {"date": "7 Aug 2020", "title": "Program Integrity Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at Central California Alliance for Health", "Interview Descriptions": "Applied through the companies website, received an email two weeks later scheduling a phone screen. Had a phone screen on a Friday, received an email Monday to schedule the 1st panel interview for the next day, Tuesday. Had a video interview with two panelist for the department and a recruiter. I felt I was underprepared for the interview in a short amount of time given but they were very professional. I was asked 14 questions regarding background and how I’d handle various situations. \nI received an email a week later politely explaining I was not chosen to continue with the interview process.", "Interview Questions": "What do you know about the Alliance?"}, {"date": "6 Nov 2019", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2+ months. I interviewed at Central California Alliance for Health (New York, NY)", "Interview Descriptions": "Communication throughout the process was good.  Questions asked were standard  questions.  The explanation of the company didn't match what people I know describe.  Location is good and first call with the recruiter made me interested in the company.", "Interview Questions": "Tell me how you deal with an angry customer?"}, {"date": "19 Sept 2018", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Central California Alliance for Health (Merced, CA) in Aug 2018", "Interview Descriptions": "Phone interview, panel of two interview, then there was a panel of four. Skills assessment was conducted next. Then there was a background check. one month start to finish. The director and HR were really amazing and down to earth.", "Interview Questions": "Tell me about yourself"}, {"date": "13 Jul 2018", "title": "Human Resources Representative II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Central California Alliance for Health (Merced, CA) in Jul 2018", "Interview Descriptions": "I have been very impressed with the overall interview process.  The hiring manager contacted me about a week after I submitted my application to schedule a phone screening.  The phone screen took place about a week later (about 30 minutes).  Thereafter, I was scheduled for an in-person interview with the hiring manager and a Talent Acquisition Manager (who joined us remotely).  I was really impressed with the way they leveraged technology to allow a panel member to join remotely, but still create a welcoming, pleasant experience for the candidate.  I was invited to a second interview at CCAH headquarters which took place 3 weeks after the first interview.  The panel for the second interview panel included the hiring manager, the Talent Acquisition manager, another HR manager, and the HR Director.   With over a decade of experience interviewing employees, I must say that I was very impressed with the quality of the interview questions.  They were the best that I'd ever seen from any of the industries I've worked in.  Questions were thoughtful, relevant, and designed to really make you think and draw out the desired skills and experience.  Behavioral, situational, and case-related.  They were not difficult, but required you to really think.   I am awaiting a response regarding CCAH's hiring decision.", "Interview Questions": "Each interview consisted of 15-16 detailed and sometimes complex questions."}, {"date": "2 May 2018", "title": "Contract Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Central California Alliance for Health (Scotts Valley, CA) in Jan 2018", "Interview Descriptions": "1 Phone interview, an in-person 2 panel interview, and an in-person 4 panel interview, 2 skills assessments. All interviews were very structured with pre-determined questions. From first interest email to finish was 3 months.\r\n\r\nIt was a bit stressful trying to find out if you made it to the next step in the interview (several weeks between interview and acknowledgement of advancement to next step) and it felt like a really long process. Then once you finished the interviews, the reference checks to 2 weeks and the background check another 2 weeks. This felt like a very tough position to obtain.", "Interview Questions": "It was something like: How did you handle a difficult situation and what did you learn from it."}], [{"date": "13 Mar 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Central California Alliance for Health (Scotts Valley, CA) in Jan 2018", "Interview Descriptions": "My interview process consisted of a 30 min phone screening, 2 in-perso interviews and a skills assessment at the end. CCAH brings in the most qualified candidates and does an extensive amount of recruiting to bring the right people in. The whole process from beginning to getting hired was about 2 months. 1st in-person interview consisted of two managers and the last in-person consisted of a manager, department director and a recruiter. Skills assessment tested on Microsoft Word, Excel and Powerpoint. Overall amazing experience and I love working here!", "Interview Questions": "What's your understanding of the position?"}, {"date": "15 Sept 2017", "title": "Human Resources Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Central California Alliance for Health (Scotts Valley, CA)", "Interview Descriptions": "Awesome process, not many companies out there ensure an excellent candidate experience. Interview was very structured  with behavioral type questions in all -phone screening, followed by 2 in-person, quick decision making process and flexible.", "Interview Questions": "I don't remember specific questions but they were tailored around the actual work performed on the job. Had behavioral type interview questions."}, {"date": "26 Jun 2017", "title": "Claims Technician II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Central California Alliance for Health (Scotts Valley, CA) in May 2017", "Interview Descriptions": "The interview process was very easy and comfortable.  I also appreciated the rate at which the interview went.  Probably took about 1/2 hour with 3 panel members.", "Interview Questions": "In previous employment, what decision did you make that you would change?"}, {"date": "11 Oct 2017", "title": "Accounts Payable Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Central California Alliance for Health (Scotts Valley, CA) in Mar 2017", "Interview Descriptions": "The interview process took quite a bit of time and had many steps, there was a phone interview and then paperwork and then two interviews where you need to go in person", "Interview Questions": "How did you handle a different situation with a customer?"}, {"date": "13 Nov 2016", "title": "Compliance Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Central California Alliance for Health", "Interview Descriptions": "There are three rounds of interviews. The first one was on the phone and the next two are in person. While the interviewer had a great poker face, I did not find the first two interviews to be difficult with any tricky questions.", "Interview Questions": "One question was about my experience with auditing."}, {"date": "19 Mar 2017", "title": "RN Manager Concurrent Review Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Central California Alliance for Health (Scotts Valley, CA) in Oct 2016", "Interview Descriptions": "A little intimidating, but nice to know they are selective in their hiring process. A panel of 3 plus a glass of ice water. I was very happy for that glass of ice water.", "Interview Questions": "Explain how you manage remote employees? "}, {"date": "20 Jun 2017", "title": "Coding Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Central California Alliance for Health (Scotts Valley, CA) in Sept 2016", "Interview Descriptions": "After submitting my application and resume, I received a call to set up the initial phone interview with the recruiter.  About a week or so later, I was in the office for the initial review with the recruiter and manager.  After about a week, I received a call to set up the second round of interviews with the manager, director and recruiter.  I received a call a short time after with an offer.   It was a very smooth process and well organized.", "Interview Questions": "N/A"}, {"date": "24 Oct 2016", "title": "Business Systems Analyst I Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Central California Alliance for Health (Scotts Valley, CA) in Aug 2016", "Interview Descriptions": "I got a call from a recruiter for availability for the screening round. After that i was called for the first onsite interview with the team. The interview experience was okay. I was told that I should expect an email within two weeks which turned out to be more than month with no reply to my emails and phone calls from either of the recruiter. Finally one of the recruiters answered my call and assured that I should hear back within two days. I get an email next day saying that i was not selected for the next round. The company didn't even had courtesy to give me a feedback or the reason for rejection, Utterly disappointing and highly unprofessional.", "Interview Questions": "Tell me about a time when you had to work with people with different experiences and skill set?"}, {"date": "24 Jul 2016", "title": "Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Central California Alliance for Health", "Interview Descriptions": "There was a phone screen, then first and second round panel interviews.  I was given the panelists names and positions in advance, and was also given background information on the organization.  There was a strong emphasis on the culture of the organization, which appealed to me.", "Interview Questions": "I don't remember specifics, but they were very thoughtful and tailored to the position."}, {"date": "24 Aug 2015", "title": "Manager Role Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Central California Alliance for Health (Scotts Valley, CA)", "Interview Descriptions": "Applied online, HR contacted me within a week to schedule phone screen with Hiring Manager, that was followed by an In Person interview with the Hiring Manager and another Manager, then another In Person Interview with Hiring Manager again as well as the hiring manager's manager, and an HR Representative, the third interview required substantial prep time for a presentation that had limited details to plan from and a request to show work samples.  Following that interview there were computer tests (Word, Excel, and Powerpoint). The tests were fairly easy. Then I met with a recruiter to answer a few more questions. The interview questions were fair, but some of them were repetitive particularly given that you are interviewed by the same person 3 times so you have to repeat your answers. Most of the questions are pre-written and require the interviewers to hand-write your answers on paper which is a little awkward. The entire hiring process was the longest and most demanding process I've ever been involved in for a job.", "Interview Questions": "Tell me about a time that something went wrong and what was your approach to fix it."}], [{"date": "11 Sept 2015", "title": "Software Developer III Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Central California Alliance for Health (Scotts Valley, CA) in Jul 2015", "Interview Descriptions": "Phone screen interview with two people: 1) Director of Technology Dylan Jones; and 2) Dylan's co-worker Rick, who I believe serves as Application Development Manager. After Dylan apologized for calling a bit late (a meeting ran over; not a big deal), he immediately turned the interview over to Rick, who immediately asked the first question. All business; no ice-breakers.\r\n\r\nRick proceeded from question to question, with a few follow-up questions, it seems, to poke around for more info. Rick thanked me, at the end. Did not ask if I had any questions, for them. He said they would discuss and take appropriate next steps. Interview lasted about 15 minutes. Rick's voice seemed tense...perhaps he felt nervous about interviewing (?)\r\n\r\nSent a thank-you email, via human resources contact Casey Nixon. No communication for about three weeks. Followed-up with Casey via email. The next day, received what seemed like an automated, generic email thanking me and letting me know they had decided to go forward with another candidate.\r\n\r\nNote: received callback day after applying online, on silkroad, from Dylan. Followed-up the next business day. Did not hear back until late the following week, from HR representative Casey, who set up the meeting. \r\n\r\nOverall impression: professional interview, a bit on the scripted, impersonal side, and loosey-goosey on communications & logistics. Probably just a busy time. Wishing everyone involved all the best and have no bad feelings about anyone or the organization.", "Interview Questions": "Tell me about your greatest strength, in terms of development background"}, {"date": "22 Aug 2013", "title": "Systems Administrator I Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Central California Alliance for Health (Scotts Valley, CA) in Aug 2013", "Interview Descriptions": "First there is the phone screen with hiring manager and IT manager then if you move past that there is an in person interview with the hiring manager and IT manager. If you get past that the top two candidates meet with the previous two people plus the HR manager and IT Director.", "Interview Questions": "What is the different between shared permissions and NTFS permissions. "}, {"date": "16 Jun 2013", "title": "Greivance Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Central California Alliance for Health (Santa Cruz, CA)", "Interview Descriptions": "Phone interview was first, then a face to face interview at their headquarters near Santa Cruz with the HR manager. A second face to face interview was the HR manager and director. Once the second face to face interview is concluded, you are given a practical exam on Microsoft Word and Exel, followed by a written vignette that you provide a response to.", "Interview Questions": "I thought I was fairly good at word and excel but found the hot-key shortcuts were not enough, they wanted formal methods"}, {"date": "11 Feb 2013", "title": "RN HEDIS Abstractor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 days. I interviewed at Central California Alliance for Health in Feb 2011", "Interview Descriptions": "Initial phone screen was short and sweet- I was instructed to review the company website before coming in for the panel interview- considering how unprepared I was for the phone screen I felt very fortunate for a face to face interview, and prepared appropriately.", "Interview Questions": "How do you feel about sitting in a cubicle."}, {"date": "12 Jan 2014", "title": "Mid Level Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Central California Alliance for Health (Scotts Valley, CA) in Jun 2010", "Interview Descriptions": "Three part interview.  First there is a phone screen after screening of resumes by human resources.  This is 10 to 15 minutes and done by the hiring manager.  Then the immediate supervisor schedules a 3 to 4 member panel onsite.  If successful, a second 2 to 3 member panel with the supervisor, human resources and one to other technical experts.  Questions are set by the hiring manager at all three levels but reviewed and approved by human resources.  Many questions for management are about cultural fit and for technical positions about specific skills sets defined in the job advertisement.  Health care experience, like many basic skills are a boilerplate add on to all staff requests.\r\n\r\nAt a second interview, consider asking questions about work environment and specific cultural personality of your department (for example flexible hours, independent decision making, supervisors view and requirements to successfully pass the probationary period, what is considered a successful year to obtain high evaluation scores). Follow your intuition.  There is a very detailed human resources program that supervisors take before they are allowed to run an interview and hire.", "Interview Questions": "N/A"}]]