[[{"date": "9 Nov 2022", "title": "Global Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ECRI (Penn, PA) in Oct 2022", "Interview Descriptions": "Applied online, phone screen with HR within a week... all seemed pretty standard. On the surface, company seems very interesting and an agent of change to the current healthcare landscape. Had an interview with the hiring manager within a week, was only given a MS Teams link (no name((s)) of the people attending the interview. Turned out to be more than one person on the MS Teams meeting... overall meeting was positive, but they were very rushed and had a hard stop at 30 minutes... was asked to have a follow up call about a week later (set up through hiring manager, not HR). Second meeting was awkward and strange... seemed to me like it was a repeat of the first interview (despite the hiring manager \"looking at my notes\" from the previous interview. Pretty much asked the exact same questions (and follow up questions) as the first, rushed interview.... was abruptly cut short (which was fine with me) and absolutely no follow up. Completely unprofessional and unprepared on their part, not to mention the JD did not match their description AT ALL. Company seems to have good bones, but their marketing department seems like a hot mess... beware!", "Interview Questions": "Tell me about you, tell me about your experiences, describe your experience with supply chain (even though this is not outlined in the job requirements)... sloppy..."}, {"date": "20 Oct 2022", "title": "Sr. Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ECRI in Sept 2022", "Interview Descriptions": "Applied online. Took them 3 weeks to get back to me. Around 1-2 weeks between interview stages. Strange interview experience. The HR interview was pretty standard. It was encouraging to hear how the company promotes a \"people first. work environment.\" For the second interview, the panel showed up 10 min late to a 30-minute interview, which is understandable as people are hopping from previous meetings. However, the interview panel clearly felt rushed on time, as the interview felt like a line of questioning more than a conversation. No time for pleasantries. Can you do these things, \"Yes/no?\" There were no cameras used from their side, but I needed to be on camera. It made the whole thing super awkward. When I asked to elaborate, they were more interested in the products my last company sold and how they sold them rather than my skills from that job, and it felt like they were using the time to scope out the competition. Maybe the interviewers were having a bad day .... but the company HR pitched to me, and then meeting the actual people, it felt like two completely different organizations.", "Interview Questions": "Tell me about this product your last company sold."}, {"date": "12 Jul 2022", "title": "Systems Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ECRI", "Interview Descriptions": "Pretty standard:  Phone call, In person, Offer.  In person interview was with all the 4 to 5 managers in IT dept.  Lasted for about 2.5 hours. Basically questions about past experience and some general tech questions.", "Interview Questions": "Desc your experience working with so and so technology."}, {"date": "27 May 2022", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at ECRI", "Interview Descriptions": "I got an email inviting me to an interview the day after applying. I interviewed the next week, and that was the end of the prompt communication. As several others have noted, ECRI is somewhere between slow and nonexistent with their communication. I would think it is common courtesy to promptly inform candidates when a decision has been made, but instead the process was dragged out over 6 weeks.", "Interview Questions": "Typical interview questions, what kind of supervisor would you prefer, do you prefer to work independently or on a team, etc."}, {"date": "6 Dec 2021", "title": "Accounting Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at ECRI (Plymouth Meeting, PA) in Oct 2021", "Interview Descriptions": "I received a call on a Friday and Interview was set up for Tuesday.  It  Interview was only set up for 30 minutes to just try to get the process started.  Interviewer did most of the talking.", "Interview Questions": "N/A"}, {"date": "12 Sept 2021", "title": "Medical Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ECRI", "Interview Descriptions": "I met with the hiring manager, the hiring manager's manager, the manager of a related team, and a senior writer on the team. The interview was focused but conversational, with each person asking questions and sharing information about the day-to-day responsibilities of the job and company environment. The whole interview took a few hours.", "Interview Questions": "What are three words your friends would use to describe you?"}, {"date": "17 Jun 2022", "title": "Contract Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ECRI in Jun 2021", "Interview Descriptions": "Excel Test, Writing Test, PowerPoint Presentation, Meetings with internal higher ups. About a 3 hour process all in all.  Initial screening then interview. Orchestrated as a virtual Teams/Zoom meeting.  Round table questions in casual format.", "Interview Questions": "Past Experience and Casual Questions"}, {"date": "14 Apr 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at ECRI", "Interview Descriptions": "A personnel member emailed information regarding a phone interview after finalizing the interview time with me, and then the interviewer called right on time. Very pleasant, gave a lot of information on the company/job description", "Interview Questions": "What is your experience with systematic reviews?"}, {"date": "23 Mar 2021", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at ECRI", "Interview Descriptions": "It was pretty quick and straightforward process.  Took couple weeks before I got call.  The interview was about 2 hours long.  5 different people including managers, architects interviewed.  Mixed questions.", "Interview Questions": "Past technical experience in detail."}, {"date": "3 Mar 2021", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at ECRI", "Interview Descriptions": "It was a bit unpleasant. I had to keep reaching out to them for updates with no avail. Even if someone else is chosen, it is important to give candidates you interview feedback.", "Interview Questions": "Tell me a bit about yourself"}], [{"date": "23 Oct 2020", "title": "Healthcare Technology Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at ECRI", "Interview Descriptions": "Very prompt . I met with 4-5 employees to get a good feel of the department I’d potentially be working in.  The process took about 3 hours or so but that gave me a very thorough understanding  of the position, the company and the overall culture .", "Interview Questions": "N/A"}, {"date": "17 Jun 2020", "title": "Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at ECRI (Phila, PA) in May 2020", "Interview Descriptions": "Received an email then an invitation for video conferencing. It was done on zoom as a group interview. Overall it was straight forward. It was strange how I wasn’t contacted by HR initially. It took a total of 30 mins.", "Interview Questions": "Describe characteristics of your ideal boss "}, {"date": "31 Jul 2017", "title": "Accounting Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at ECRI (Plymouth Meeting, PA) in Feb 2017", "Interview Descriptions": "During my interview the HR manager spent much time telling me that she would keep me informed about the process and stressed that she felt that I deserved to know what was happening because I had spent so much time with the ECRI team interviewing-I met with 4 people and was onsight for almost 4 hours.  A week after the interview I followed up with HR, and was told they were still interviewing candidates.  I followed up again about a week later, and never even got a response.  After stressing in the interview that she would keep me informed along the process, I got no feedback at all!  Five months later and I have never heard from the company, not even a form email telling me they chose someone else.", "Interview Questions": "N/A"}, {"date": "17 Oct 2017", "title": "Project Officer, Health Devices Group Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "The process took 6 weeks. I interviewed at ECRI (Whitpain Woods, PA) in Feb 2016", "Interview Descriptions": "Required to put together a power point presentation for the HD managers on a topic. This was a little overwhelming especially if you don't have experience doing this on a regular basis. Met with 4 people from the group individually.", "Interview Questions": "Tell us a time when you felt strongly about something"}, {"date": "24 Jan 2016", "title": "Information Technology Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at ECRI (Plymouth Meeting, PA)", "Interview Descriptions": "Long interview (about 3 hours over a single day) meeting with four individuals, one at a time.  Some were mangers, other analysts, and then HR.  A mix of discussion about the position, interview questions and resume review, and an opportunity to ask questions.\r\nIncluded a writing sample. The writing sample asked to compare the features of  two medical devices.", "Interview Questions": "Some of the time is spent learning about responsibilities and asking questions about the job.\r\nBasic questions regarding motivation, time management skills, ethics, career goals, leadership, etc.\r\n\r\nTell me about yourself.\t\r\nWhat interests you about the position?\r\nWhy are you interested in ECRI Institute?\r\nWhat did you like most about your last job? \r\nWhy are you seeking a new job?\r\nDo you prefer working independently or as a team?  \r\nDescribe your ideal job?"}, {"date": "19 Nov 2015", "title": "Healthcare Technology Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at ECRI (Plymouth Meeting, PA) in Oct 2015", "Interview Descriptions": "I had a phone interview first and then an onsite interview a week later. It was very straightforward, and everyone was really nice. You will meet with 4-5 people, and they will mostly ask you about your experience with healthcare.", "Interview Questions": "Can you describe a time when you had to condense and summarize a lot of data? What are your strengths and weaknesses? Why did you choose your major? What did you like most about working for so and so company? "}, {"date": "20 Sept 2015", "title": "Healthcare Technology Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ECRI", "Interview Descriptions": "Straightforward and Easy. 30 minute phone interview, waited two weeks for an on-site interview. On-site interview I met one by one with 4-5 people.Then waited another two weeks for an offer. Offer was non negotiable. Interview was easy as expected for entry-level.", "Interview Questions": "Strengths and Weaknesses, Name a time you explained something complicated, basic questions."}, {"date": "18 Oct 2015", "title": "Healthcare Technology Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at ECRI (Plymouth Meeting, PA) in Aug 2015", "Interview Descriptions": "Started off great, applied online and heard back in a couple of weeks that they wanted a phone interview. After the phone interview I was notified in just a few days they wanted to bring me in for an onsite interview. The onsite interview went well..met with five people one after the other..had a written assessment, and met with the recruiter. All of them, esp the recruiter, made it sound like I was sure to get an offer and that I would hear back in just a week. Well that's when things went bad. I didn't hear back after a week so I decided to reach out and ask about my candidacy. I emailed, called, and no response back. Then finally almost 1 month later I find out from this website (glassdoor) that they offered the position to someone else and they accepted. It's just common courtesy to let an onsite interviewee know if they are no longer being considered. I FINALLY, this past week, two months after my onsite, get my rejection email. Wow. They really need to learn to communicate in a timely fashion and not ignore any calls or emails, so rude and inconsiderate.", "Interview Questions": "Strengths and weakness, name a time you had to explain something"}, {"date": "15 Aug 2014", "title": "Regional Account Executive Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at ECRI (Plymouth Meeting, PA) in Feb 2014", "Interview Descriptions": "The hiring process involved {2} phone interview with recruiters.  I then interviewed with the Area Vice President who would be my boss.  I then interviewed at headquarters with the CFO, the national Sales Manager and the vice presidents of each different department.", "Interview Questions": "N/A"}], [{"date": "19 Sept 2013", "title": "IT Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at ECRI (Plymouth Meeting, PA) in Sept 2013", "Interview Descriptions": "Contacted by HR by phone and email. Scheduling was fine. Has an initial phone interview, and was called for in person interview. In person lasted about 2 hours with various people.  Person that seemed to ask most relevant questions was the HR rep. It was rather strange as some of those discussions I was expecting from the hiring manager. IT director was busy to do an interview even though he was scheduled.", "Interview Questions": "Job description was not sufficient. They were looking for a senior system admin with some management rather than a manager"}, {"date": "20 Apr 2013", "title": "Applications Developer Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. I interviewed at ECRI (Plymouth Meeting, PA)", "Interview Descriptions": "Initial techincal phone screeing. This will have basic .NET questions. Once you pass this then you will be called for the inperson interview. You will be interviewd by pairs of lead developers and managers. They will ask you basic .NET questions and about your project. Talk confidenlty and you will be selected.", "Interview Questions": "They ask basic questions , what are triggers and what is difference between datareader and dataset."}, {"date": "15 Mar 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at ECRI", "Interview Descriptions": "Process depends on the department and position. Some departments require completing a test that involves analysis, writing, editing. Typically interview with several people at different levels plus HR to give an overview of the team and organization. Interviews are several hours long and may require 2 visits on different days. The point is to give candidates a good idea of the environment and culture and for the organization and department to assess \"fit\" as well as expertise.", "Interview Questions": "Describe a project you did that went awry and why\r\nDescribe a project in which you received surprising extensive critical feedback\r\n"}, {"date": "18 Feb 2014", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 7 weeks. I interviewed at ECRI (Plymouth Meeting, PA) in Mar 2013", "Interview Descriptions": "One phone interview and one on-site interview with two managers and one director. They ask a lot of behavior questions, but none of them was too difficult.", "Interview Questions": "Tell me a time when you failed"}, {"date": "31 Aug 2012", "title": "Healthcare Forecast Writer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at ECRI (Plymouth Meeting, PA) in Jul 2012", "Interview Descriptions": "I applied online. Within a few days, I received a phone call and had a phone interview with a senior employee in the department. It was a pretty simple and straightforward interview. They asked about my knowledge of the position and the company, as well as previous related experiences that i had. Then, they sent me a sample assignment that I was given 10 business days to complete. After completion, I submitted the assignment and did not receive any response.", "Interview Questions": "There were no difficult questions"}, {"date": "5 Jul 2015", "title": "Technical Writer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at ECRI (Plymouth Meeting, PA) in Jun 2011", "Interview Descriptions": "Had a one-on-one interview and HR interview (I think). HR gave me a detailed benefits package. There was some back-and-forth about salary, later. They gave me a lowball offer that I refused. They came back with a good offer.", "Interview Questions": "Writing experience, clips, previous jobs, education. All the standard interview questions. The interview was focused on my writing skills, though the actual job did NOT require any writing, as I later found out."}]]