[[{"date": "11 Jul 2022", "title": "PSR I Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lone Star Circle of Care in Jan 2022", "Interview Descriptions": "Hiring manager called and asked typical interview questions- What was my pay inquiring- where do I see myself within the company. How often do I like talking on the phones, was virtual okay", "Interview Questions": "How long I’ve I been in Customer service "}, {"date": "16 Apr 2021", "title": "Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Lone Star Circle of Care", "Interview Descriptions": "First interview was a phone interview. Company considered it “informal”. However, the questions seemed pretty formal like an interview and not a screening. If you get selected, you get a second virtual interview considered to be “formal” where you meet with numerous directors.", "Interview Questions": "Therapeutic techniques used in therapy "}, {"date": "25 Jun 2019", "title": "Billing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Lone Star Circle of Care (Georgetown, TX)", "Interview Descriptions": "Everyone was very nice, we had a good conversation during the interview.  I thought it went in a positive direction.  I followed up both verbally and by email but never heard anything in response.", "Interview Questions": "N/A"}, {"date": "10 Jul 2023", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Lone Star Circle of Care (Austin, TX) in Jun 2019", "Interview Descriptions": "average asked about schooling and experience. interview was done by clinic manager and then was offered a tour of the clinic and got to meet some of the staff at the location id be working at if hired. received an offer the same day.", "Interview Questions": "what will you bring to the company?"}, {"date": "23 Aug 2018", "title": "Certified Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Lone Star Circle of Care (Hutto, TX)", "Interview Descriptions": "Had a Manager and Lead Nurse ask me a series of questions. Mostly relating to old job experience. They were going off a piece of paper and constantly writing.", "Interview Questions": "What do you do when you're bored at work?"}, {"date": "28 Jun 2018", "title": "Benefits Specialist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Lone Star Circle of Care (Bastrop, TX) in Jun 2018", "Interview Descriptions": "Interview was ok. Met with  2 managers/supervisors and spoke about the position. Very informative but asked if I was bilingual (preferred but not required) but the way that the interview was going was as if they wanted someone who was bilingual.", "Interview Questions": "How would you communicate with clients who are limited English proficient?"}, {"date": "31 May 2017", "title": "CMA Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Lone Star Circle of Care in May 2017", "Interview Descriptions": "They got all my information over the phone asked me to email them my certifications. It was a bout 2 days then I heard back was giving a  offer and 2 days later they called and took offer back but would not discuss why. They never spoke with my pervious manager just called other references even though they said they needed to speak with a previous manager. When I questioned HR about reason they took back offer she just said sometimes that's how things workout.", "Interview Questions": "How many years experience? If I work well with others they spoke about current employees."}, {"date": "26 May 2014", "title": "Patient Service Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Lone Star Circle of Care (Austin, TX)", "Interview Descriptions": "Submitted application, phone interview, and then an in person Interview with director, manager, and HR at Administration building in Austin, Texas. Was not that hard. Straight forward. Review past experiences and behavioral interviews.", "Interview Questions": "Why Lone Star?"}, {"date": "21 May 2015", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Lone Star Circle of Care (Georgetown, TX) in Apr 2013", "Interview Descriptions": "Excellent!  The response and follow up from the hiring manager and recruiter was very good; they provided me with an interview itinerary, travel plans, and hotel accommodations.  The day was set with three stages of interviews with various departments and job levels.  I found the interview questions to be pretty standard, they were behavior-based as well as just conversational.   The job offer followed within two weeks and was handled professionally and efficiently.", "Interview Questions": "Tell me about a difficult manager you worked with and what you did to create a good relationship?"}, {"date": "5 Jan 2013", "title": "Lackey Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Lone Star Circle of Care (Round Rock, TX) in Apr 2012", "Interview Descriptions": "3 interviews, HR only available if person is getting hired, otherwise, hard to get a hold of.", "Interview Questions": "N/A"}], [{"date": "31 Aug 2011", "title": "Human Resources Position Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Lone Star Circle of Care (Georgetown, TX) in Mar 2009", "Interview Descriptions": "The interview was a large panel.  Each asked a series of questions on their roster.  After the long interview, I was invited back to a second time for a job preview (aka I demonstrate my skills to their team) which would require a few hours at their company and additonal time away from my company.  That was just the beginning.  \r\n\r\n I was very interested in the position but the process seemed rather time consuming for the candidate.  It was hard to explain to my current employer why I need to take another half day in the middle of the week without raising a flag.  Working in HR for over 10 years, I did not feel this was ideal.  Also, the team seemed to have some incohesive interaction during the interview.  Otherwise, the team was professional and the setting appeared like a nice place to work.", "Interview Questions": "Describe a difficult situation and how you handled it?"}]]