[[{"date": "1 Feb 2022", "title": "Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Energy Foundation (Virginia Beach, VA) in Jan 2022", "Interview Descriptions": "Informal interview process which made me very comfortable. Interviewer was very polite and responsive before and after the interview. All of my questions were answered, and she addressed common concerns amongst interviewees.", "Interview Questions": "How do your skills translate to this role ?"}, {"date": "31 May 2022", "title": "Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Energy Foundation (Washington, DC) in Aug 2021", "Interview Descriptions": "Process was extremely unprofessional. In the final round of interviewing they severely mismanaged informing candidates of the outcome. I don't recommend applying to any positions here based on my experience.", "Interview Questions": "Standard interview questions about why you're interested, etc."}, {"date": "23 Aug 2021", "title": "Systems Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Energy Foundation in Jul 2021", "Interview Descriptions": "30 minute call with recruiter. They were very upbeat and positive. Said they would contact with an interview with the manager of the position. Never heard back. I contacted to follow up, recruiter said they would be speaking to them next week. This happened three times. I followed up each time and the recruiter put me off again and again. I ended up never hearing back from from them.", "Interview Questions": "Basic questions you wld get in an initial screening with a recruiter. "}, {"date": "12 Aug 2016", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Energy Foundation", "Interview Descriptions": "One phone interview and two in person interviews.   Questions weren't technical- they were more about your style of working and collaborating.  First interview felt more like a screening; the second was with the director you report to plus a couple others; the third interview was with three staff (junior, senior, and upper management).", "Interview Questions": "Describe how you would go about a type of project etc. (emphasis on organizational skills and process). "}, {"date": "19 Jul 2013", "title": "Coal Program Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Energy Foundation (San Francisco, CA) in May 2013", "Interview Descriptions": "I applied after seeing a post on Idealist. Apparently I was one of 10 selected out of 160. I was interviewed first via phone by the assistant HR guy Dale. Then I went in for an in-person interview in their lovely offices. There were four people interviewing me, including the woman who was vacating the position, the woman who would have been my boss, the head of HR and another member of the team I'd be on.", "Interview Questions": "They asked several times for examples of how I kept myself organized. Since I didn't have a particularly unique response this was maybe the most difficult question. But the questions were generally pretty standard. "}], [], []]