[[{"date": "29 Jun 2023", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Essentia Health (Duluth, MN) in Jun 2023", "Interview Descriptions": "Recruiter asked more questions from me. Meet n’ greet - about one or two questions were asked of me. Overall, it seemed like they weren’t too picky if they needed you in a unit.", "Interview Questions": "The recruiter asked me: They consisted of the amount of hours I spent in the unit, the type of patient care experience I have, the time I’ve gone above and beyond for someone, a challenging situation. During the meet and greet they asked to tell them about about the type of work experience i have, and about a time I faced a challenging situation."}, {"date": "20 May 2023", "title": "Ophthalmic Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Essentia Health (Duluth, MN) in May 2023", "Interview Descriptions": "First off,  I have never once left a bad review but this left such a sour taste in my mouth. I had a virtual interview with 2 woman & 1 man. The women seemed nice but the man kept interrupting my answers as if I shouldn't be given the time of day. He then asked why I left my most current job, the reason was on my resume right in front of him. Then he said, \"ugh I guess I'm just trying to figure out why you want to be in healthcare with no previous experience\" as if to say that my want to get into the healthcare setting was beyond stupid or that moving into a different career area is so off-the-wall. My resume is good & I am a good employee, I have never received a bad performance review. I was not applying to be a doctor, a nurse, something way out of my league, etc. I was reached out to on Indeed to apply and my skills matched the description almost 100% other than the fact that I would have to obtain a certificate within my first year of employment (which I was totally okay with). They must have liked what they saw, hence an interview invitation showing up in my email. I have never come across someone this rude and disrespectful while interviewing before. I'm thankful true colors showed during the interview, as I so evidently dodged a bullet working here. Never would I accept an offer with this department. Yikes.", "Interview Questions": "Tell me about a time you took the initiative."}, {"date": "15 Mar 2023", "title": "Supervisor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Essentia Health", "Interview Descriptions": "Interview was done by a teams Video call - panel of 4-5 people. All supervisors, manager, and the director. Asked basic interview questions and role play scenarios. Very friendly and supportive people.", "Interview Questions": "How would you explain to a co-worker you constantly chose for extra work why you always chose them?"}, {"date": "28 Dec 2022", "title": "Patient Financial Representative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Essentia Health", "Interview Descriptions": "I had someone reschedule my interview. After it was rescheduled I informed them that I was having trouble accessing the interview on teams chat. The HR person gave me a nonchalant answer and they denied my application stating I missed my interview after I reached out to them.", "Interview Questions": "N/A"}, {"date": "6 Mar 2023", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Essentia Health in Oct 2022", "Interview Descriptions": "I had a phone screen and a TEAMS interview. I interviewed for a CNA position/patient care and unbeknownst to me was hired to be part of the cleaning crew. The nurse manager knew I had 28 years of CNA experience and am a nurse masters student. So they lied", "Interview Questions": "Typical nursing questions; how do you handle a difficult co-worker, etc"}, {"date": "12 Dec 2022", "title": "Workforce Management Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Essentia Health in Oct 2022", "Interview Descriptions": "I was contacted by a representative from the company by through cold-calling. The representative stated he was busy while on the call due to taking a walk but could schedule the initial phone interview in 2 hours. Keep in mind he was not able to distinguish between different time zones (very telling). So I agreed to speak with him again in a couple hours for the initial phone interview. Fast forward to 20 minutes prior to the interview I get a text saying \"this will now be a video-interview\" be prepared. Obviously this representative is completely detached from reality and does not consider other's time. I went to the last-minute formal interview, which lasted for over an hour. The guy finally identified himself as the actual hiring manager. He proceeded to dig for information as if he was inexperienced and looking for ideas. After all of this, never heard anything back, even after following-up. Very unprofessional. If you value your time, don't apply here.", "Interview Questions": "The interview consisted of the manager fishing for information."}, {"date": "28 Sept 2022", "title": "Business Analyst Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Essentia Health", "Interview Descriptions": "The preliminary virtual interview is conducted via Microsoft Teams using audio only. This was 30 minutes long. The second interview is face to face via Microsoft Teams and is scheduled for 1 hour in length.", "Interview Questions": "Describe a time you had to deal with a difficult customer and how you mitigated the situation."}, {"date": "30 Aug 2022", "title": "Physician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Essentia Health", "Interview Descriptions": "Initial \"just discuss\" with the recruiter actually involved interview questions of the type I haven't heard since residency interviews. The recruiter did a fantastic job every step along the way of keeping everyone informed and coordinating flawlessly.  This was followed by a meeting with the department director to determine if she liked me enough to proceed. Then this was followed by a typical interview day for a physician involving the department head, manager, other providers, a financial officer (they discussed salary and benefits with apparently no plan to hire me), and a regional director. \nI must have interviewed very poorly, because I received an automated rejection letter one business day after the day-long interview.  All in all, it seemed like a great place, but they didn't think I was a great fit.", "Interview Questions": "Close the gap for me (in regard to not living there already, even though it was for a remote job)"}, {"date": "18 Jul 2022", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Essentia Health", "Interview Descriptions": "It was a very good interview. Super laid back. Super casual. 10/10 definitely recommend. They keep you coming back for more. Always always always love nursing. We are the heroes. Wahoo.", "Interview Questions": "The questions were very very unique"}, {"date": "5 Jun 2022", "title": "Patient Scheduler Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Essentia Health (Duluth, MN)", "Interview Descriptions": "I was interviewed by four people at the same time I was asked pretty basic situational questions. All the  interviewers were very friendly and professional and we even shared a few laughs during the interview. The interview is 30 minutes long via Microsoft Teams.", "Interview Questions": "Why do you want to work for Essentia Health?"}], [{"date": "24 Apr 2023", "title": "Nursing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Essentia Health (Fargo, ND) in Jan 2022", "Interview Descriptions": "Phone call from the recruiter and then teams interview with the managers of the units you are interested in as a new grad where they explain the units and what each will be like", "Interview Questions": "Why were you interested in Essentia Health"}, {"date": "28 Nov 2021", "title": "Customer Service Representative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Essentia Health", "Interview Descriptions": "Virtual experience. Very professional and organized. Three people interviewed together and it was an easy set up and they did a good job explaining the job and asking questions. Interviewed with management directly without an HR pre screening.", "Interview Questions": "Why are in interested in working at Essentia Health?  "}, {"date": "14 Aug 2021", "title": "Project Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Essentia Health (Duluth, MN) in Jul 2021", "Interview Descriptions": "Initial contact by Human Resources about interview. \n Step one was a phone pre-screen interview with basic background questions.  The next step was a formal Panel interview with questions regarding project management.", "Interview Questions": "Why are you interested in this position?"}, {"date": "24 Jun 2021", "title": "Certified Athletic Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Essentia Health", "Interview Descriptions": "They were easy to talk to and answered all my questions thoroughly.  They responded promptly and were available to answer questions even after the interview. I got a good sense of the company I would be working with and their expectations.", "Interview Questions": "What do you consider essential items in your kit?"}, {"date": "28 Jan 2021", "title": "Advanced Practice Provider Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Essentia Health in Nov 2020", "Interview Descriptions": "Very slow, from time of application to time of interview it took about 4 months. Interview went very well, but it's been 2 months since then and I have heard nothing. I guess if you don't get the job, they don't feel the need to tell you.\r\n\r\nInterviewer asked if I was familiar with insurance billing and charting for maximum reimbursement, so definitely got the feeling they are very concerned about profit.", "Interview Questions": "What makes you think you would be a good fit for the companies values?"}, {"date": "20 Aug 2020", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Essentia Health", "Interview Descriptions": "The interview was very formal and kind. It was quick, and the questions were individually answered by you. They were all adequate questions for the position. They offer great benefits for going to college too!", "Interview Questions": "\"What would you do if your colleagues did something wrong, that you knew was wrong.\""}, {"date": "3 Feb 2020", "title": "RN Float Pool Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Essentia Health", "Interview Descriptions": "I applied online, moving into an in person interview at the facility. The review itself was very good, and I have nothing bad to say about it. The staff were pleasant and informative, helping me decide that employment with this company was the right call.", "Interview Questions": "Why did you apply for this position rather than a floor position?"}, {"date": "4 Dec 2019", "title": "Scheduling Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Essentia Health", "Interview Descriptions": "Easy to apply and track application process. Though the response time, even after interviews is very slow from time of application, to setting an interview, to response from employer for job offer.", "Interview Questions": "N/A"}, {"date": "5 Oct 2019", "title": "Business Support Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Essentia Health (Duluth, MN) in Sept 2019", "Interview Descriptions": "The interview location was a little hard to find. But the interview was well conducted. It was in a private location and was laid back. Everyone was very supportive.", "Interview Questions": "How do you handle disagreements with your superiors"}, {"date": "2 Aug 2019", "title": "Licensed Practical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Essentia Health", "Interview Descriptions": "Met with Clinical Coordinator and discussed previous work history and desire to work in the NICU. The supervisor Vicky was very nice and seemed very forthcoming that this was a new position in the NICU and that I would be starting from scratch and establishing the role.", "Interview Questions": "Why are you interested in working in the NICU"}], [{"date": "18 Nov 2020", "title": "Patient Access Representative Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Essentia Health (Duluth, MN) in Nov 2018", "Interview Descriptions": "Straightforward interview process, Human Resources was fairly communicative throughout the process, Interview questions were not too complex or intimidating and all of the people that I came into contact with during the process were fairly nice", "Interview Questions": "How have you previously handled a difficult situation?"}, {"date": "18 Oct 2018", "title": "NAR/HUC Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Essentia Health (Deer River, MN) in Oct 2018", "Interview Descriptions": "They made me feel very comfortable during the whole process and were very positive during the interview. They gave great feedback and answered any questions I had in depth.", "Interview Questions": "Give me a situation in a workplace that made you upset or angry."}, {"date": "31 Mar 2018", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Essentia Health", "Interview Descriptions": "In person interview, was asked a set of behavioral questions.  Questions like dealing with difficult coworkers, a time you made a mistake, a time you had a triumph, gave good customer service, etc.", "Interview Questions": "N/A"}, {"date": "6 Feb 2018", "title": "Sterile Processing Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Essentia Health (Duluth, MN) in Sept 2017", "Interview Descriptions": "Fairly standard interview. Most questions will have a right answer, and all others are wrong. They will ask you if you skip steps to save time, etc. Obviously in Sterile Processing quality is better than quantity so the answer here is clear. Most of the questions are like this. There are a lot of questions that will ask you about your experience with previous jobs and how it will relate to this job.", "Interview Questions": "Were you ever late for work? Did you call to let them know?"}, {"date": "22 Aug 2017", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Essentia Health (Fargo, ND) in Aug 2017", "Interview Descriptions": "Very simple and friendly. They asked typical interview questions. The interview was held in the eating area. They give me a tour of the unit I would work if hired. Easy process.", "Interview Questions": "Why do you want to work for us?"}, {"date": "3 Jan 2017", "title": "CNA Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Essentia Health (Brainerd, MN) in Oct 2016", "Interview Descriptions": "Applied for a position and was called for an interview within in two weeks. Interview was short and asked questions appropriate for health care setting. Facility got back to me and informed me within 2 weeks about whether or not I received the job.", "Interview Questions": "If a coworker approaches you in the hall and starts talking to you about a patient how would you respond?"}, {"date": "20 Apr 2016", "title": "Supply Chain Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Essentia Health (Brooksville, FL) in Mar 2016", "Interview Descriptions": "was fast,felt at ease,thought I did well and had the job...then email said I did not,i  have 8 years with supply chain on last job with great reviews and praise,i had 4 months  to learn supplies3.500 basically and I did,from ostomy supplies to toe nail clippers,i was very  on key .", "Interview Questions": "experience,problem solving"}, {"date": "12 Nov 2015", "title": "Case Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Essentia Health", "Interview Descriptions": "applied online. You can track the status of your application on their website. Was contacted by HR for an interview time. Was interviewed by a panel of managers, case workers and social workers. Asked lots of behavioral questions, team oriented questions, and a lot about personal experience. It was a pleasant experience.", "Interview Questions": "What do you know about Medicade, Medicare, and DRG's? "}, {"date": "14 Jan 2016", "title": "Accounts Payable Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Essentia Health (Duluth, MN) in Sept 2015", "Interview Descriptions": "I applied online via the website. After about a few days I was called by Human Resources and we scheduled an interview with the Finance Manager. I went down and did the interview with Finance Manager and one of the team leads.", "Interview Questions": "Why do you want to be part of the Essentia Family"}, {"date": "6 Mar 2017", "title": "Biomedical Equipment Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Essentia Health (Duluth, MN) in Aug 2015", "Interview Descriptions": "Applied online and received a phone call from Human Resources wanting to schedule a phone interview. Had the phone interview with the supervisor and received another call afterwards that they wanted to have an in person interview. Had the in person interview and received an offer about a week later.", "Interview Questions": "Where do you see yourself in 5 years? "}], [{"date": "16 Jul 2015", "title": "Phlebotomist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Essentia Health (Wahpeton, ND)", "Interview Descriptions": "Sat in a conference room with 3 others and was asked a bunch of questions of my schooling and they gave me a brief description of the job role. Was explained the values of the company. Asked me questions about myself and asked my questions on how I would deal with different types of patients.", "Interview Questions": "How long in medical assisting schooling?\r\nWhat made you move to the area?"}, {"date": "8 Jun 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Essentia Health (Fargo, ND)", "Interview Descriptions": "Very simple.  Initial interview was over the phone due to living out of state at the time.  Basic questions. No surprises or difficult questions.  My manager interviewed me and was very pleasant and relaxed.", "Interview Questions": "How do you deal with conflict in the workplace?"}, {"date": "9 May 2016", "title": "Supply Maintenance Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Essentia Health (Virginia, MN) in Feb 2015", "Interview Descriptions": "Casual conversation, asked a number of questions about my background and asked for examples.  Got a tour of facility that allowed me to get a good idea of the place where would be working and the people that would be working with", "Interview Questions": "What do I want to do in the next 5 years"}, {"date": "21 Apr 2015", "title": "Director Position Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Essentia Health (Duluth, MN) in Jan 2015", "Interview Descriptions": "Met with individuals of two levels. Job offered had different description and terms than job applied for. Concerned that significant terms would be switched from what was initially discussed. Human Resources representative was inconsistent, as several individuals were involved and no one knew who would be calling me next. There was a lack of accountability in the hiring process.  Also, hiring manager used discriminatory language and examples.", "Interview Questions": "When can you start?"}, {"date": "26 Aug 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Essentia Health (Brainerd, MN) in Feb 2014", "Interview Descriptions": "Kind of like a firing squad.  A bit intimidating, but the were friendly.  Need to have work examples for many of the questions, may be harder for new grads with little experience.", "Interview Questions": "Give an example of a situation where you disagreed on a course of action with a superior and how did you handle it?"}, {"date": "1 Oct 2015", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at Essentia Health (Duluth, MN) in Nov 2013", "Interview Descriptions": "Took about three months until I was scheduled for an interview and then another month until I actually started, so its a slow process. Fairly basic questions about experience and your general mood/attitude.  Interviewed by a group of 3 each alternating questions.  After the interview was shown around the pharmacy and briefly given a description of what took place.", "Interview Questions": "Are you willing to pick up extra shifts?"}, {"date": "16 Oct 2013", "title": "RN-Med/Surg Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Essentia Health (Fargo, ND)", "Interview Descriptions": "Online application, resume, HR interview, 1:1 interview", "Interview Questions": "Tell me a time when you went above and beyond in a work situation?"}, {"date": "28 Jan 2017", "title": "Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Essentia Health in May 2013", "Interview Descriptions": "one interview with hiring manager, no opportunity to interact or even meet team.  should have been first indicator of future problems. strange that future co-workers weren't part of interview process at all.  manager did not want input from staff.", "Interview Questions": "interested in work history and how i would fit in with their culture"}, {"date": "8 Dec 2015", "title": "Patient Services Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Essentia Health (Brainerd, MN) in Nov 2012", "Interview Descriptions": "i received a call from human resources that set up the date and time. I interviewed with the two supervisors in the department. They asked questions back and forth for twenty to thirty minutes and wrote down my answers. I got a call back a week later with an offer.", "Interview Questions": "Mostly scenario questions."}, {"date": "11 Nov 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Essentia Health (Duluth, MN) in Oct 2011", "Interview Descriptions": "The first step was to meet with Hr recruiter to do a phone screen. After initial phone screen was selected for phone interview to gauge level of knowledge. After passing phone screen I was asked to come in for an onsite interview. After the onsite interview I was made an offer.", "Interview Questions": "What project management skill sets do you possess?"}], [{"date": "13 Jun 2015", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Essentia Health (Duluth, MN) in Jul 2011", "Interview Descriptions": "First was a telephone screen, next an interview with recruiter (telephone).  There was a telephone interview with hiring manager who was a director.   Finally, there was a trip to Minnesota and an in person interview with hiring manager.", "Interview Questions": "About my approach to leadership development"}, {"date": "15 May 2013", "title": "Applications Analyst I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Essentia Health (Duluth, MN) in Apr 2011", "Interview Descriptions": "There was a long time lag before the interview and the job offer, however I was in no hurry to start and I was even allowed to further delay my start date by a month.", "Interview Questions": "No real surprises"}, {"date": "13 Oct 2011", "title": "Pharmacy Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Essentia Health (Duluth, MN) in Jan 2010", "Interview Descriptions": "Pharmacy Director, Pharmacist, and a Pharmacy Technician present in the interview.  Took turns asking the questions with lots of quiet moments while replies were written. Most of the questions asked are standard interview questions like - why do you want to work here, what got you interested in Pharmacy, where would you like to be in 5 years, why should we hire you etc", "Interview Questions": "Tell us about a time when you went above and beyond your responsibilities in a previous employment or school setting"}]]