[[{"date": "8 May 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Denver", "Interview Descriptions": "The interview process with the University of Denver is very formal, and is not terribly difficult. As a private university though there is some fairly substantial competition, especially with local candidates, or, understandably those who are university alumni", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "31 Mar 2023", "title": "Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Denver (Denver, CO) in Mar 2023", "Interview Descriptions": "Meet with IT managers, IT peers, and with the department you'd be embedded with. The questions were scripted, but non-traditional. You needed to be able to think on your feet.", "Interview Questions": "Tell me when you had a conflict with a customer or co-worker, and how you resolved it."}, {"date": "10 Oct 2022", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Denver", "Interview Descriptions": "Great interview process and thorough all day interview. Meet with multiple members of the university and have a presentation at the end of the day. Very well thought out of process.", "Interview Questions": "Discuss a difficult decision that you encountered and how you handled it."}, {"date": "28 Nov 2022", "title": "Attorney Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Denver in Oct 2022", "Interview Descriptions": "First phase was a telephone screener with an administrative staff member from the department. Second stage would have been full panel interview (remote/electronic), and third stage would have been in-person on campus.", "Interview Questions": "Questions for screener were pretty standard - why are you interested in this position, what is your biggest accomplishment or what are you most proud of in your current role, etc."}, {"date": "23 Aug 2022", "title": "Kindergarten Teacher Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Denver", "Interview Descriptions": "I interviewed twice, once with the head of lower el and one with the other teacher in the classroom and the coach.  I had a hard time with communication, they would say follow up and I wouldn't hear, so I would reach out, leading to a response of interest/", "Interview Questions": "How I handled gifted and talented, how I handle behavior, what my beliefs were on communication."}, {"date": "12 Jul 2022", "title": "Academic Counselor Senior Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Denver", "Interview Descriptions": "It was easy and straight forward. I it was to the point and they sent all the questions ahead of time so you had a chance to prepare. They were mostly about UDL", "Interview Questions": "They sent questions ahead of time "}, {"date": "2 May 2022", "title": "Reaseacher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Denver", "Interview Descriptions": "average, ask about domain related questions, past experience, outlook, interest in fields. Overall good experience I had with them. Its great campus and people are generally very nice. I like the culture of the place.", "Interview Questions": "Q. Describe previous projects\nQ. Current domains of interest"}, {"date": "11 Apr 2022", "title": "GTA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Denver", "Interview Descriptions": "Reviewing coursework and determining if a good fit for the role. Asked me what I am comfortable with supporting in terms of specific courses, office hours, and grading coursework for the classes.", "Interview Questions": "What are your time constraints?"}, {"date": "4 Feb 2022", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Denver in Jan 2022", "Interview Descriptions": "It is an extremely long and time-consuming interview process consistent out of a long waiting period before you hear anything (3 months) and four interviews (plus presentation). \r\nThe first question / answer interview consists of a group of eight people from different departments that will work closely with you. \r\nIf you make it through the first round, you will be invited to an all-day interview process (virtual at the moment), including an interview where you will have to hold a presentation (virtually) in front of 30-40 employees from different departments. After you are done with your presentation, all employees are allowed to ask you a question for the rest of the 45 - 60min.\r\nAfter that, you have a one-on-one with the Vice Chancellor which lasts 30min in the question/answer format.\r\n\r\nAnd then finally another 45 min question/answer interview with the same group of people that did the first interview.\r\n\r\nWhile I believe that it is beneficial to briefly meet all the different departments and employees you will get to work with, I do not believe that such a process is necessary for a position like this and have never experienced something like this before.\r\n\r\nWhat I do not appreciate is that you go through the complete process with all the waiting and interviewing and questioning and then they do not even have the curtesy to send a quick email to decline you as an applicant if they decide not to choose you. I even followed up with an email myself after waiting for a week and half and did not receive a response. \r\nInstead, I realized that the position was re-posted online a week after I had my interviews. \r\nSo, if you do decide to go through all these hassles and nerve-wracking interviews, just keep in mind that you will never hear a word back from them if you are not chosen.\r\n\r\nIt really angers me that there is no consideration of the time and afford that an applicant puts into such a process so that he/she can move on with the job search.", "Interview Questions": "Interview questions are situational to the position. Have examples ready in the STAR format. Also, be ready to provide solutions to different situations."}, {"date": "17 Nov 2021", "title": "Associate Director, Creative Services & Web Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Denver (Denver, CO) in Aug 2021", "Interview Descriptions": "It was a long interview process (3 totally interviews, all over Zoom). They moved quickly though, so it was a fairly quick process (about 8 weeks total). The 3rd interview was a bit intense as I was interviewed by several groups of people I would be working with. Each of them were allowed to ask me questions. I did this all over 4 hour time period.", "Interview Questions": "There were several, all typical to my field. One was \"Are you ready to come back and work in an office?\" because I've worked for myself for so long."}], [{"date": "25 Jun 2021", "title": "Finance Chinese Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Denver", "Interview Descriptions": "Just walk into the office, tell them I am a current student with the required background. Since it is inside of the school, it is not really restricted. Overall, there is no difficulty in the interview.", "Interview Questions": "Can you breifly introduce yourself?"}, {"date": "25 Apr 2021", "title": "Technologist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Denver", "Interview Descriptions": "Good beyond words and experience loved every minute of it would require you to finish things with smile love hope trust caked out houses in subway for like five hours", "Interview Questions": "How much mineral do you have "}, {"date": "23 Aug 2021", "title": "Assistant Professor of the Practice Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Denver (University of Denver, CO) in Apr 2021", "Interview Descriptions": "There are two interviews possible. The first interview is with the search committee for approximately 20 minutes. It is usually 5 people. All were part from the same department. If you make it beyond the initial interview, you will be invited for a second round, which will be an all-day interview with a colloquium. There will be several interviews over an 8-hour day, beginning with the search committee (same group as initial interview) and ending with the Dean of the department and/or a rep. from Diversity, Equity, and Inclusion (DEI). The interviews range from 20, 30, and to 60 minutes. The colloquium runs about one hour. You will have 40 minutes for the presentation. They will give you the prompts for your presentation at least one week prior to the second interview. After your presentation, there will be time for questions and answers. The colloquium is recorded if via Zoom.", "Interview Questions": "In the first interview, there were several questions. I cannot remember any. The second interview was all day. However, there questions re ethical dilemmas and DEI. "}, {"date": "6 May 2021", "title": "Career Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Denver (Denver, CO) in Mar 2021", "Interview Descriptions": "Phone interview (first interview) and then a Zoom interview with the hiring committee along with a presentation and Q&A session that was with the entire department (second interview). Followed up with an informal interview/question session with the hiring managers.", "Interview Questions": "Why are you interested in this position and DU?"}, {"date": "8 Feb 2022", "title": "Program Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Denver (Denver, CO) in Mar 2021", "Interview Descriptions": "I interviewed with the School of International Studies. About two weeks after the application period for the job closed, I received an email to schedule a 15 minute Zoom interview. The interview felt extremely rushed as there were 3 people on the panel who all asked questions so I didn't feel like I could give too much detail on my answers since I only had 15 minutes total.  Despite that, I still felt pretty confident about it so I was a little surprised when I never received any communication after that. But they did eventually reply to my follow-up email about a month later telling me that they offered the position to another candidate.", "Interview Questions": "Why I was interested in this position, what experience I had in event and project management and what experience i had working with a diverse group of individuals "}, {"date": "25 Feb 2021", "title": "Intramural Official Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Denver", "Interview Descriptions": "Initial 10-15 minute phone call going over background and interest in the position. Answering a few mock scenario questions in the context of intramural officiating. Describing past officiating experience, if any.", "Interview Questions": "What would make you a good official?"}, {"date": "3 Feb 2021", "title": "Web and Mobile Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Denver", "Interview Descriptions": "Interview was a initial screening with a manager followed by two, one-hours interviews with team members. The first  was behavioral with leadership within the IT department and the second was technical with more peer roles.", "Interview Questions": "Behavior questions included a lot of the classic ones: \"Why should we hire you?\" \"Tell us about a weakness of yours.\"\nTechnical included defining HTTP request methods and reading a snippet of HTML for errors"}, {"date": "30 Nov 2022", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Denver (Denver, CO) in Feb 2021", "Interview Descriptions": "Mostly behavioral questions: what is leadership? What is the difference between graduate and undergraduate study? Why you choose our university? What’s is your career plan in the future? Please introduce a little bit about yourself.", "Interview Questions": "N/A"}, {"date": "15 Jan 2021", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Denver", "Interview Descriptions": "Typical student affairs interview - phone, video, in-person with presentation. First round phone, second video, third in-person with a variety of different offices and community members. Had to give a presentation with Q&A.", "Interview Questions": "Why are you interested in this position."}, {"date": "11 Jan 2021", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Denver in Nov 2020", "Interview Descriptions": "Relatively quick sequencing in terms of setting up interview and providing feedback.  I think it was about a month in total from application to interview and final decision.  Interviewers were very friendly and asked reasonable questions.", "Interview Questions": "How does your background fit into this role?"}], [{"date": "4 Jan 2022", "title": "Work Study Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at University of Denver (Denver, CO) in Aug 2020", "Interview Descriptions": "Must submit application through Pioneer Career  website with resume and then create meeting with interview where multiple questions are asked from interviewer. After that offer is either given or rejection.", "Interview Questions": "Tell me about yourself. Why do you want the job? What can you add to the job?"}, {"date": "5 Oct 2021", "title": "Technician Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Denver (Denver, CO) in Mar 2020", "Interview Descriptions": "three steps interview process. Group interview was also conducted. Overall,  interview is holistic. Written interview was also taken. An oral interview was taken.  The interview were 30 minutes long. Overall a positive experience", "Interview Questions": "why do you want to work with us?"}, {"date": "10 Dec 2019", "title": "Executive Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Denver", "Interview Descriptions": "Had a phone interview with the hiring manager. Hiring manager talked very quickly and had a lot of information to share, which was great. Once the 30 minutes were up the hiring manger had to go, and I received a call a number of weeks later that my application had no been successful.", "Interview Questions": "Have you supervised staff in the past?"}, {"date": "25 Jun 2021", "title": "Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Denver (Denver, CO) in Dec 2019", "Interview Descriptions": "There 2 rounds, the first one is a phone interview (for basic personal information and work experience )and then in-person interview with the department manager. It took 4 weeks to get the final offer.", "Interview Questions": "Talk about prior marketing experience.  "}, {"date": "19 Nov 2019", "title": "Grants Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Denver in Oct 2019", "Interview Descriptions": "Took a month for initial phone interview request after submitting application online.\r\nPhone interview was only 20 minutes with 4 team members, one of whom was 10 minutes late. \r\nA week later, offered interview dates that were 2 weeks apart.\r\nIn person interview was same 4 team members. Received a tour of building as well.", "Interview Questions": "Had to do a simple spreadsheet to identify errors"}, {"date": "17 Sept 2019", "title": "Associate Registrar Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Denver (Denver, CO)", "Interview Descriptions": "After submitting my resume and cover letter there was a short wait (1-2 weeks), after which I was asked to write an essay on customer service. After that, I was scheduled for a video conference interview with a 5-6 person committee of office and campus stakeholders. After that, I was brought to Denver to interview in person. Within just a few days I was offered the position.\r\n\r\nThe hiring manager, committee and the administration were genuinely friendly and appeared dedicated to their work and collegiality. Were circumstances slightly different I would have accepted the position.", "Interview Questions": "Anyone applying for this job as a serious candidate would be unsurprised by the questions. Pretty straightforward for the field."}, {"date": "19 Mar 2019", "title": "Assistant Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at University of Denver (Denver, CO)", "Interview Descriptions": "I was excited for this position and applaud the DU team for taking the time to vet candidates and make the appropriate decision for their department, but overall the process was an unfortunate use of time and resources on all sides. I had nine one-hour interviews with a total of 26 university staff. According to the hiring team, there were four candidates that were interviewed in this way (and some were flown in from out of state), so at least 100 hours of staff time went into this interview process (not counting additional work like application review, debrief conversations, travel booking, etc). After my last interview I was asked to submit several sample work products, which is standard and expected but also takes quite a bit of time to prepare. Finally, the hiring team decided not to hire for the position because they wanted to reexamine their department and reorganize. I totally understand that this happens but after such an investment of time and energy on all sides, it indicates a poor use of resources and foresight on behalf of the DU staff.", "Interview Questions": "Do you have any ideas for us to make our current program better?"}, {"date": "29 Jan 2021", "title": "Marketing and Communications Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Denver (Denver, CO) in Feb 2019", "Interview Descriptions": "DU required multiple half-day interviews, including giving presentations to a group of 40 individuals.  After being jerked around literally for three months and many meetings, they sent my rejection in a form email.  No helpful feedback, no kind words.  It was an email that would be appropriate after a phone screening, not months of meetings.  They will waste your time with no compunction about it.", "Interview Questions": "Lots of \"tell me about a time...\" questions."}, {"date": "15 Mar 2019", "title": "Associate Dean Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of Denver (Denver, CO) in Jan 2019", "Interview Descriptions": "while the interview process was more corporate feeling the university, because they sat on the application for a month and then they hurried the multiple steps for the interviews. There was very little time to prepare between meetings and a presentation was required with a one day turnaround. Overall, it followed the same guidance with initial screening, then in-person group interview, followed by a one-to-one with the hiring manager and time with the team. the problem I have with the university's process is that there was no outreach after the team met with their decision and/or after another candidate accepted the offer. If I hadn't contacted the recruiter, who actually had no clue how far along I was involved, then I doubt I would have ever heard from them.  That said, I am not impressed by the way this university treats its candidates.", "Interview Questions": "q. what is it about this position that interested you?"}, {"date": "17 Nov 2018", "title": "Senior Payments Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Denver (Denver, CO) in Nov 2018", "Interview Descriptions": "I had one phone interview with a manager of Shared Services, and then a group interview. The interview was fairly simple. They were all behavioral and situational questions. The group interview was with 5 people, and the interview questions that were asked in the phone screening, were very similar if not the same to the group interview.", "Interview Questions": "Tell me about yourself"}], [{"date": "10 Jul 2019", "title": "Facilities Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Denver in Nov 2018", "Interview Descriptions": "Phone interview very informal, easy and personal with interviewer. Asked basic questions.\r\nEach Dept head conducts their own phone interview with a panel in person interview if chosen.\r\nIn person interview included direct manager, co worker and direct report. Was very informal and relaxed.", "Interview Questions": "Tell me about yourself."}, {"date": "22 Feb 2019", "title": "Reference Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Denver (Denver, CO) in Jul 2018", "Interview Descriptions": "I had one interview with the director of the reference center and a reference librarian. It was very friendly and comfortable, and I felt respected. I also appreciated that in scheduling an interview, they were very flexible as I was traveling from outside Denver for the interview.", "Interview Questions": "What is your experience with conducting research? "}, {"date": "15 May 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at University of Denver (Denver, CO)", "Interview Descriptions": "Attended out of state job fair. Interviewed twice at job fair and was offered on-campus interview. Visited campus, was taken to dinner on first night and attended full day of interviews with different committees while touring campus for the second day.  I felt very welcomed and the university paid for hotel expenses during interviews.", "Interview Questions": "What is your leadership style? \r\n"}, {"date": "15 Mar 2018", "title": "Regional Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at University of Denver in Feb 2018", "Interview Descriptions": "Multiple phone calls and video interviews, with slow communications in between. Phone interview to start. Then two panel video interviews, with people reading questions off of a sheet of paper. Questions were extremely vague and somewhat non-productive. They did very little to understand the candidate's background and were mostly interested in asking questions that referred to the way that they work. I was not terribly impressed. There didn't seem much interest in me. I ended up withdrawing from the search because they were slow and non-communicative.", "Interview Questions": "How would you work remotely?"}, {"date": "14 May 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at University of Denver in Jan 2018", "Interview Descriptions": "It was an easy process and it lasted less than a couple of hours. Questions based on my qualifications and my CV. Standard procedure and friendly environment. I received an offer after a few days and I accepted it.", "Interview Questions": "What are your strengths and weaknesses "}, {"date": "15 Dec 2017", "title": "Director of Digital Communications Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Denver (Denver, CO) in Nov 2017", "Interview Descriptions": "Panel video interview to start, with people reading questions off of a sheet of paper. Questions were extremely vague and somewhat non-productive. They did very little to understand the candidate's background and were mostly interested in asking questions that referred to the way that they work. When I asked basic questions of them, they had trouble answering, which illustrated that they are comfortable with the way they do things and probably not much else. I sent multiple follow ups to the hiring assistant without a response after their self-imposed response date had passed. They pride themselves on communication and respect but don't exhibit those qualities. I ended up taking another job because they were slow and non-communicative.", "Interview Questions": "How would you go about an integrated marketing campaign?"}, {"date": "12 Oct 2017", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 8 weeks. I interviewed at University of Denver", "Interview Descriptions": "Phone interview and then an in person panel interview. People seemed friendly and cohesive. However, after the in-person interview there was no follow-up. Emailed the hiring manager several times and got no response.", "Interview Questions": "Typical interview questions asking about your qualifications and why you want to work there."}, {"date": "13 Nov 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Denver (Denver, CO) in Oct 2017", "Interview Descriptions": "Process was pretty standard. I had a phone interview with the person who the job would be assisting first, and then two weeks later did a 3 round Skype interview with a couple Chancellors, other admins, and the person who would be my boss again. Not being in Colorado they were great about setting up the interview for long distance, though I had a ton of tech difficulties on my end that I was at least able to work through. Everyone seemed very pleasant and easy to talk to. \r\n\r\nI didn't get the job, which is fine, but it would have been nice to hear that from them. We were in communication every step of the way and then once it got down to the final 2-3 people I didn't even get a rejection letter.", "Interview Questions": "Standard job fit questions - Tell me about a mistake you made and how did you fix it? "}, {"date": "10 Aug 2017", "title": "Business Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Denver", "Interview Descriptions": "Many hoops - 2 weeks after online application, they contacted me to set up an 8 person search committee Skype call.  Then a few days later, emailed and asked me my salary requirements. Then 3 weeks later in person interview with 8 different people, some in groups, some solo, and 2 separate presentations on business cases, which were both given to me only a few days in advance of my interview date.  Then, they asked me for my references.  Then, the Dean that I would report to called to chat again.  Then, he told me he would check my references and get back to me in 48 hours.  Then I NEVER HEARD FROM THEM AGAIN.  After they indicated several times that I was the lead candidate, and talking to all of my references (I confirmed positive discussions with all of them) I couldn't believe they wouldn't even send me a one line email saying they chose another candidate.  It was a nice group of people but the incredibly unprofessional way it ended left a terrible taste in my mouth.", "Interview Questions": "Describe a time you had to manage a budgeting situation"}, {"date": "5 Jan 2018", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at University of Denver (Denver, CO) in Jul 2017", "Interview Descriptions": "About two weeks after applying I received and invitation for a Video Conference interview. That interview was conducted by a committee. While a little awkward due to being video conference I did get an good overall feel for the position and a chance to demonstrate my skills and knowledge as well as ask question. The following day I received an invite for the final round of interview. I then met in person with the committee, as well as separate interviews with the Dean and Sr. Associate Dean. Within a week of the in-person interviews I received an offer.", "Interview Questions": "What tools do you use to organize your work?"}], [{"date": "20 Jun 2017", "title": "Cashier Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Denver (Denver, CO)", "Interview Descriptions": "This was a two part interview. The first interview was over the phone and second one was in person. It didn't take them long to get back to me after the first interview, but after the second interview it took them 2 weeks to get back to me.", "Interview Questions": "They asked me a question I was not expecting. If you could be any animal what would you be and why?"}, {"date": "5 May 2017", "title": "Sports Information Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of Denver (Denver, CO)", "Interview Descriptions": "I was able to find this position through a work-study program on campus. I met with the hiring manager in her office and walked through standard questions. Upon completing my interview, I was offered the job via phone while walking back home.", "Interview Questions": "What systems have you used in the past?"}, {"date": "1 Oct 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at University of Denver (Denver, CO) in Apr 2017", "Interview Descriptions": "They asked for a resume. Then we had a video interview which consisted of the researcher as well as the PhD professor who sponsored the lab. They explained the lab and then asked questions about my previous experience. It was very straight forward.", "Interview Questions": "What sets you a part from other candidates? "}, {"date": "14 Mar 2017", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Denver (University of Denver, CO)", "Interview Descriptions": "Meet with hiring authority for one-on-one interview, then meet with panel of employees from the department. Answer scripted questions by the various panel members.  Questions were part knowledge based and part behavioral.", "Interview Questions": "What is the biggest challenge you have faced?"}, {"date": "11 Dec 2019", "title": "Adjunct Lecturer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at University of Denver (Denver, CO) in Jan 2017", "Interview Descriptions": "Very brief in person, followed by two or three weeks of back and forth via emails and paperwork. They're friendly, but not super involved--you're hired, but then need to prompt responses in order to get people engaged with you. It's very frustrating.", "Interview Questions": "Teaching guide/planning "}, {"date": "5 Oct 2016", "title": "Student Services Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Denver (Denver, CO) in Sept 2016", "Interview Descriptions": "Q&A with search committee (30 minutes or so), followed by a presentation.  The presentation was difficult because it was not made clear to me in advance who my audience would be.  I probably should have asked before the actual interview but it didn't occur to me.  I recommend you ask who will be there if you have a presentation!  People had questions very specific to their areas, but since I wasn't sure who they would be, I hadn't prepared specific answers for them.  The topic was also a little vague, so I would additionally recommend asking for more specific guidelines, or clarifying what they want from you beforehand.  Interviewing is scary enough without extra mysteries to add to it.", "Interview Questions": "How do you stay current?"}, {"date": "4 Apr 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Denver (Denver, CO) in Sept 2016", "Interview Descriptions": "Easy interview - questions about about myself such as my major, experience at University of Denver, hobbies/community involvement, and time availability. I received an immediate response on the day of the interview and started working on the second week back from summer break.", "Interview Questions": "When am I available?"}, {"date": "26 Jul 2016", "title": "Data Analyst and Technology Administrator - Graduate School of Professional Psychology Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Denver (Denver, CO) in May 2016", "Interview Descriptions": "I applied online and was called for an interview within one week. Standard panel interview that was scheduled late in the day. What was unnerving was that one interviewer kept looking at her watch. I felt uncomfortable and compelled to shorten my answers so that I could get the interview over; I felt I was wasting their time.", "Interview Questions": "Describe a project that was unsuccessful and how did you manage it?"}, {"date": "29 May 2018", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Denver (Denver, CO) in Apr 2016", "Interview Descriptions": "One-on-one phone interviews with Chair of the Dept. and program managers.  One-on-one in-person interview with Chair of the Dept., and group interview with program managers, and professors. Tour of campus.", "Interview Questions": "Describe a time you had to learn a system in order to do your job."}, {"date": "3 Aug 2017", "title": "Research Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Denver (Denver, CO) in Feb 2016", "Interview Descriptions": "Easy process with both Skype and on campus interviews. A presentation about my background, skills, research plans and interests and also my future research plans. The questions were wasy and expected. The environment was friendly and all went well.", "Interview Questions": "My research interests"}], [{"date": "20 Nov 2015", "title": "Lifeguard Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Denver", "Interview Descriptions": "It was over the phone and it wasn't really an interview, I was just asked about my previous lifeguarding jobs and when I could work (they are desperate for staff).", "Interview Questions": "What is one thing you would change about the last pool you worked at?"}, {"date": "24 Aug 2015", "title": "Executive Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at University of Denver (Denver, CO) in Aug 2015", "Interview Descriptions": "First I was called for a brief phone interview. It was, somewhat oddly, a group phone interview with three people. I am normally great during phone interviews but hearing multiple, disembodied voices was difficult.\r\n\r\nVery shortly after I was invited in for an in-person interview. I was expecting to interview with the three people I spoke on the phone with, but when they let me into the interview it was a full round table of nearly everyone in the office—at least 10 people. I wish I would have been warned because is a very nerve-wracking experience and feels more like public speaking than an interview.", "Interview Questions": "How do you encourage diversity in the workplace?"}, {"date": "22 Feb 2016", "title": "Language Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Denver in May 2015", "Interview Descriptions": "The process took probably two-three weeks. Must send cover letter, resume, writing sample and references. Interview was via Skype because I was out of the country. It was not difficult, very generic questions.", "Interview Questions": "Why do you want to work as a Language Consultant?"}, {"date": "28 Sept 2016", "title": "Food and Beverage Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Denver (Denver, CO) in Apr 2015", "Interview Descriptions": "The interview was straight forward. Questions were asked about my experience and what I was looking for, etc.  there was a lot of discussion about the operation what could be expected, a typical day, etc.", "Interview Questions": "Tell me about your experience."}, {"date": "22 May 2015", "title": "LEP Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at University of Denver (Denver, CO) in Nov 2014", "Interview Descriptions": "Brief interview conducted by one of the LEP counselors in her office.  She asked all the standard questions, was pleased with my answers and educational background, and offered me the job on the spot.", "Interview Questions": "If I had any experience in teaching / education or working with disabilities."}, {"date": "21 Oct 2015", "title": "Student Services Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Denver (Denver, CO) in Apr 2014", "Interview Descriptions": "Simple, know examples of ways you managed multiple projects and experiences you've had with program development and implementation.  Experience in higher education is somewhat necessary.  Also, know how to deal with student populations, the difference between undergrads and grads.", "Interview Questions": "How do you manage multiple projects?"}, {"date": "23 Dec 2013", "title": "Associate Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Denver (Denver, CO)", "Interview Descriptions": "Normal interview process. People are nice, but aloof. Quality of personnel varies considerably. Some are pretty good. Others would likely not find comparable employment elsewhere. Mismanagement leads to missed opportunities so most good personnel leave.", "Interview Questions": "Nothing unexpected."}, {"date": "25 Jul 2013", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Denver (Denver, CO)", "Interview Descriptions": "I was called to set up a phone interview. This interview was with about 5 people who asked pre scripted questions, that I assume they asked all the candidates, it is a University after all and they have to adhere to strict guidelines so they don't get sued. One of the questions they asked was about what diversity and inclusive excellence meant to me so be sure you know that answer as it is in their motto. Other things they asked were regarding ethical situations and how I worked with a team. \r\nThen I was called in for an in person interview. It was a full day long process where I met several people and they all asked pre-scripted questions again. You meet with people from different departments as well so do your research. You'll meet with the director and other student life people too. \r\nAfter that they call and let you know if you got the job or not.", "Interview Questions": "What does diversity and inclusive excellence mean to you? "}, {"date": "17 Sept 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Denver (Denver, CO) in Jun 2013", "Interview Descriptions": "Shortly after taking the GRE and applied to the school, I was asked to come to campus and meet with the advisers and chair of the department. During the interview process, we discussed my duties and responsibilities, it was straightforward.", "Interview Questions": "What skills and experiences can you contribute to the university?"}, {"date": "22 Oct 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 months. I interviewed at University of Denver in Jun 2013", "Interview Descriptions": "My phone interview went pretty smooth. There were questions relevant to the research I was pursuing at the time. There were delays in the joining date due to immigration issues but the international students office was supportive through the process.", "Interview Questions": "Questions related to my experience and interests"}], [{"date": "17 Mar 2015", "title": "Technology Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at University of Denver (Denver, CO) in May 2013", "Interview Descriptions": "I found the job on the DU website. I had one interview and it was in person and at the school. It was with two members of the technology team and very laid back.", "Interview Questions": "How comfortable are you working under pressure and with technology? Why are you interested in this job? "}, {"date": "16 Apr 2014", "title": "Part-Time Lecturer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Denver (University of Denver, CO) in May 2013", "Interview Descriptions": "Went well, as I was already an adjunct at the university and I have the right blend of experience and practice. I had a phone interview, which they followed up on. I had a teaching presentation and met with the faculty. I had connections within the department and I was teaching at the school already.", "Interview Questions": "There were none that were off-putting or unexpected, and my interview was collegial and straightforward. No drama."}, {"date": "10 Dec 2015", "title": "Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at University of Denver (Denver, CO) in May 2013", "Interview Descriptions": "You submit an application, then if you are selected to have an interview, it is a full day. You go through questions as well as scenarios and giving a mock tour.", "Interview Questions": "Why do you want to be a tour guide?"}, {"date": "5 May 2014", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Denver (Denver, CO) in Mar 2013", "Interview Descriptions": "Submitted resume and had one in-person interview", "Interview Questions": "Nothing out of the ordinary"}, {"date": "28 Feb 2013", "title": "Resident Director Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of Denver (Denver, CO) in Jan 2013", "Interview Descriptions": "It's all about behavior questions. I will be a PhD student at University of Denver on Gender studies, that's why I want to apply for this position. It takes about 1 hour, and meet with other co-worker after the interview. If is also asked about my education background and career background about residential education experience. I did not have that much of experience so far, so I felt I did not get the job, but still waiting for it.", "Interview Questions": "Tell us about your experience on mediating a conflicts, and how to control a situation quickly"}, {"date": "18 May 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Denver (Denver, CO) in Sept 2012", "Interview Descriptions": "Informal, with the professor for whom you'll be working. It can depend on the professor if it'll be an in-depth or basic interview. Some professors want people interested in their expertise.", "Interview Questions": "Post law school goals."}, {"date": "14 Apr 2014", "title": "Writing Center Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Denver (Denver, CO) in Aug 2012", "Interview Descriptions": "I emailed my resume and had an interview.", "Interview Questions": "N/A"}, {"date": "11 May 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Denver (Denver, CO) in Jul 2011", "Interview Descriptions": "The interview process consisted of a phone interview that last about one hour. I was interviewed by two people who were wonderful and very easygoing.", "Interview Questions": "How do you handle a difficult customer?"}, {"date": "13 Aug 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Denver (Denver, CO) in May 2011", "Interview Descriptions": "they are slow! Be prepared for a phone screen, an interview with HR, an interview with your team, then a final interview with upper management (associate dean, etc).", "Interview Questions": "Stupid stock questions: the weakness question reared its ugly head again. You have my resume, education and excellent feedback from former employers; why ask stupid questions? How about we talk more about my skills and what I will bring to the job rather than your outdated questionnaire from the 1980s. Does asking me about my weaknesses really tell you anything except that I know you are not ever supposed to answer that question and you should be suspicious of companies that still ask that question. "}, {"date": "4 Jun 2011", "title": "Content Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 1 week. I interviewed at University of Denver (Denver, CO) in Apr 2011", "Interview Descriptions": "I had a phone interview with the Institute for the Advancement of the American Legal System's Director of Marketing & Communications many months ago. The Director came off as incredibly arrogant and condescending. It was very obvious that my opinion on several questions was irrelevant, especially whenever my opinion differed from his. Overall, he did not seem like a pleasant person to work for (you could tell he thought very highly of himself), and I was glad that I did not get the job.", "Interview Questions": "What skills will you bring to this position?"}], [{"date": "23 Oct 2014", "title": "Applications Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Denver (Denver, CO) in Jan 2010", "Interview Descriptions": "Interest in higher education institutions, learning new technologies and long term employment with the university. Outgoing and team players are appreciated. Interview is with a panel and then one on one interview with upper management in the later phases. Phone interview or skype interview is a possibility.", "Interview Questions": "Nothing difficult or unexpected. Interviewers often look for long term candidates."}, {"date": "20 Nov 2013", "title": "Database Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of Denver (Denver, CO) in May 2009", "Interview Descriptions": "Very drawn out process. Team interviews. At one point I thought that the job had been filed and was read to move on to another job.", "Interview Questions": "N/A"}, {"date": "9 Nov 2010", "title": "Technology Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Denver (Denver, CO) in Dec 2008", "Interview Descriptions": "The HR person called me to schedule an interview in person. I was interviewed by four different staff members. Two managers were there to ask me technical questions and test me on my skills. The other two managers were there to understand your personality and customer service ability.", "Interview Questions": "How do you find the IP address on a MAC and on a Windows computer?"}]]