[[{"date": "2 Jun 2023", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "Online interview during lockdown. It was smooth with 2 people online took around thirty to fourth five minutes. Before the interview there was a call to set up the dates and to verify the qualifications.", "Interview Questions": "General vision about the the mission of the organization and the reaches they have."}, {"date": "2 Jun 2023", "title": "Database Administrator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Habitat for Humanity (Chicago, IL)", "Interview Descriptions": "Very, very thorough. Be prepared for 3-4 interviewers for maybe 90+ mins. This is a great organization. I was willing to reduce my salary but in the end felt the job was not a good fit.", "Interview Questions": "Very detailed questions about any situation that could ever arise."}, {"date": "2 Jun 2023", "title": "Communications Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Bridgeport, CT)", "Interview Descriptions": "The interview process exceeds expectations with its comprehensive and rigorous approach, setting a higher standard for evaluating candidates. The interview process exceeds expectations with its comprehensive and rigorous approach, setting a higher standard for evaluating candidates.", "Interview Questions": "N/A"}, {"date": "19 May 2023", "title": "Lending Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity (Denver, CO)", "Interview Descriptions": "Fairly easy and quick hiring process. Quick responses. I first had a phone interview for the first screening, and then I had one more panel interview where I was interviewed by two people.", "Interview Questions": "What draws you to Habitat? They will also ask a lot of scenario questions where you need to give examples."}, {"date": "3 Apr 2023", "title": "Senior Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity", "Interview Descriptions": "First interview was a telephone screening with the recruiter. The recruiter was pleasant, but didn't seem to be at the expected professional level searching for someone in the CEO Office. Second interview was with two senior leaders and went well. It was quick, but efficient and professional. Four weeks passed after the second interview, so I emailed the recruiter to ask about my status, but the recruiter never responded.  Ghosted!  Six weeks later, still no response. Pretty low level of professionalism and not a good representation of the CEO's office.", "Interview Questions": "Why are you interested in this position?"}, {"date": "7 Mar 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "Very straightforward online one on one interview, asked me questions about coursework/experience relating to the position, why I was interested in it, etc. Only talked to one person for the interview and then I heard back about 1.5/2 weeks later", "Interview Questions": "Have you had any prior experience relating to this position?"}, {"date": "24 Mar 2023", "title": "Financial and Home Ownership Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity in Mar 2023", "Interview Descriptions": "Phone interview with the HR rep was very pleasant. They ask, why one is interested in the position and if they have prior experience. Also, what personal qualities outside of work, makes one best for the role.", "Interview Questions": "What qualities outside of work, will make you perfect for this role?"}, {"date": "22 Feb 2023", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity", "Interview Descriptions": "Inconsistent with the advertised understanding of what the process would entail. Some of the staff involved were very difficult to communicate with, while others were very well balanced. Thank you.", "Interview Questions": "My most challenging experience that I learned from."}, {"date": "26 Jan 2023", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Habitat for Humanity (Tucson, AZ) in Jan 2023", "Interview Descriptions": "The HR representative and the CEO had very little idea about the Marketing position & couldn't answer questions about the position. You could tell they were uncomfortable when I asked questions related to the position.", "Interview Questions": "They read off the job description and would ask me if I knew how to do items on the job description without checking on my resume that I listed that experience, They were ill-prepared for the interview,"}, {"date": "6 Feb 2023", "title": "Chief Executive Officer (CEO) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Habitat for Humanity (Kansas City, MO) in Dec 2022", "Interview Descriptions": "Simple, perhaps too simple. Semi-transparent process. Initial phone screener with the primary point of contact. Limited interpersonal time with the CEO Search Committee - less than 45 minutes, multi-person interview. No proactive updates as the process went past its deadline. Provided a form letter final response with no direct outreach.", "Interview Questions": "There were multiple areas ID'd as critical like retail operations, executive leadership, financial management, etc.."}], [{"date": "6 Dec 2022", "title": "Global Entrepreneurship & Innovation Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Habitat for Humanity (London, England) in Oct 2022", "Interview Descriptions": "I was invited to a first stage of interview remotely held (the role was UK based) and it did go well, basic questions about previous experience. Got cheered for my current experience, so I was very positive about getting a second stage. I had been told I would have been informed after a week or so, got ghosted. Never heard back.", "Interview Questions": "Basic previous experience and interest for the company."}, {"date": "8 Sept 2022", "title": "Public Relations Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 2 months. I interviewed at Habitat for Humanity", "Interview Descriptions": "The process consisted of a phone screen followed by a video interview with the hiring manager, then a team interview followed by an interview exercise. The process was a little lengthy, but the team is small and wanted to make sure they were choosing the right candidate. Everyone was so nice from start to finish and communication was always there!", "Interview Questions": "What three adjectives would you use to describe yourself?"}, {"date": "22 Apr 2023", "title": "Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Spartanburg, SC) in Sept 2022", "Interview Descriptions": "It took a long time to go through the process. The process was a little disorganized and confusing. However, the staff and Executive Director were great and asked great questions.", "Interview Questions": "Strengths and weaknesses Describe an event you would put on. Why would you want to work there?"}, {"date": "15 Aug 2022", "title": "Project Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (San Francisco, CA)", "Interview Descriptions": "Phone screening with recruiter followed by zoom interview with senior management, and in person meeting with construction supervisor at the project site in San Francisco. Interview was fairly straight forward and friendly", "Interview Questions": "What is your experience with Procore and Microsoft Project?\n\n\n"}, {"date": "4 Aug 2022", "title": "Truck Driver Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity", "Interview Descriptions": "It was relaxed and the  managers asked about experience, skills, no DUI's, no drugs, etc. I felt good about the process. I have not heard back yet but am satisfied how it went.", "Interview Questions": "How many years of experience do you have for the position?"}, {"date": "23 Sept 2022", "title": "Assistant Public Funding Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 months. I interviewed at Habitat for Humanity in Aug 2022", "Interview Descriptions": "The interview process was very slow, the hiring process took about 2 months. The team seems friendly. The HR was helpful.  The interview was focused on getting to know me personally, rather than more professionally.", "Interview Questions": "Can you give an example of a time you solved a conflict with a colleague?\nWhy do you want to work here?\n"}, {"date": "13 Feb 2023", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Habitat for Humanity (Atlanta, GA) in Aug 2022", "Interview Descriptions": "Long interview process. The initial interviews are more about company culture, ethics, diversity and inclusion, etc. then, the next round includes several interviews with your actual team (finance or counterparts). I found it to be a bit extensive.", "Interview Questions": "Why do you want to work for our company?"}, {"date": "25 Jul 2022", "title": "Public Relations Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity in Jul 2022", "Interview Descriptions": "I was invited to a 15 minute phone screen via Teams without video.  The second interview was with the Director, camera on only lasted 30 mins. The final interview was  a panel with the PR team; everyone was very nice, friendly and engaging.  The questions were mainly about my experience and work style.", "Interview Questions": "Why did you apply for this position? "}, {"date": "11 Sept 2022", "title": "Grant Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Habitat for Humanity (Omaha, NE) in Jul 2022", "Interview Descriptions": "First interview was by phone for about 40 minutes. A second interview was set up to meet the manager. The HR employee stated she would get back to me with more details, she never did. After reaching out to her, she still didn't contact me. I was ghosted.", "Interview Questions": "What is  your editorial experience? Also, how do I express being detail-oriented in my life outside of work? Which I thought was a poor question."}, {"date": "9 Jun 2023", "title": "Donation Ambassador Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Habitat for Humanity (Bellingham, WA) in Jul 2022", "Interview Descriptions": "Easy interview process. I sat at a table with several of their employees who asked me questions. They gave me a call the next day. I decided to take the job.", "Interview Questions": "What are your strengths on the job?"}], [{"date": "9 Jun 2022", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Habitat for Humanity", "Interview Descriptions": "Thorough and interesting screening call with Talent Acquisition that was followed by interview with hiring manager who had a clear vision. From there, I had interviews with key stakeholders.  Impressed by talent, commitment and energy of members.", "Interview Questions": "Hiring Manager's dovetailed with job description. Stakeholders each had a specific need/interest in experience related to their roles/needs. "}, {"date": "23 May 2022", "title": "Fundraiser Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "The entire process was pretty straightforward. I applied online and then waited to hear from HR. After some emails back and forth an interview was scheduled. At the time, everything was done virtually. Overall, the entire process was easy to navigate.", "Interview Questions": "Tell me about yourself and your past experiences."}, {"date": "13 May 2022", "title": "Account Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "Phone interview. Scheduled and occured on time. Representative was very friendly and engaging. We discussed my experience and what I was looking for and then she discussed what they were looking for. All went well. It was a pleasant process overall.", "Interview Questions": "What did you like best about your prior position?"}, {"date": "12 May 2022", "title": "Senior Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Habitat for Humanity", "Interview Descriptions": "Started with general questions on experience from previous employment, followed by topic-specific related questions on project development and project management. The interviewers also asked me to do a short presentation (much more like a pitch) on project proposal I designed one week prior to the interview process.", "Interview Questions": "(i) Experience in humanitarian projects; (ii) "}, {"date": "6 May 2022", "title": "Senior Marketing Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "I had one phone interview as well as two in person interviews. The questions were standard. I received an job offer, but I did not accept due to benefits package.", "Interview Questions": "Do you have experience with Google Analytics?"}, {"date": "23 Aug 2022", "title": "Programme Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Habitat for Humanity in May 2022", "Interview Descriptions": "Phone screen,  interview with the hiring manager,  \"final\" interview with panel.  The interviews with both the hiring manager and the panel were awkward verging on unprofessional - lots of discussion that veered into the personal, an off-putting amount of time spent by the interviewer talking about themselves.  Interview questions were frequently leading--along the lines of \"Do you like (x)?\".  No discussion of competencies,  no opportunity to offer examples. Finally,  hiring manager responded to follow up email and punted to HR rep,  who then never replied. Did I get an offer?  Your guess is as good as mine.", "Interview Questions": "Do you like working with people with different backgrounds? "}, {"date": "21 Jan 2023", "title": "Executive Director, Non-Profit Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Habitat for Humanity in May 2022", "Interview Descriptions": "Interview with head of search committee first, then eventually met with all staff. They were able to ask anything, pertaining to the work, and conversations were had about all things regarding leadership, employees, and how the two meet.", "Interview Questions": "What will I do when an employee has an idea to improve and the board doesn't like the idea?"}, {"date": "12 Apr 2022", "title": "Executive Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "It was a lengthy process for the hiring director and the VP and their direct reports. Several roles + powerpoint presentation were created to display your written skills and ability to navigate through different tech platforms.", "Interview Questions": "I cannot recall what the questions were"}, {"date": "13 Jul 2022", "title": "Senior Financial Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Habitat for Humanity (Atlanta, GA) in Apr 2022", "Interview Descriptions": "I went through a total of 8 interviews... 1 preliminary with HR and then another 7 with various members from their finance team. I was still working with my previous employer at that time and at 30 minutes each, I spent approximately 4+ hours of my time, to not even get a response when the interview process was concluded. \r\n\r\nThat was the most frustrating aspect. To devote so much time in my schedule for their thorough interview process, to not even receive an email from them stating that I was not selected for the position. For a supposed \"Christian\" company, I would have expected more. I believe in following things through to the end and being transparent & honest. For these reasons, I do not believe I would have been happy long-term had I received a job offer from Habitat for Humanity. \r\n\r\nUltimately, I believe that everything happens for a reason. I accepted a job offer with a company that I love working for and feel valued with.", "Interview Questions": "What do you know about Habitat for Humanity?"}, {"date": "18 Apr 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Habitat for Humanity (Houston, TX) in Apr 2022", "Interview Descriptions": "Smooth respectful and to the point ,the people there seem friendly and helpful . I’m just about to start working there but so far based of the interview it seem like a good place to work . Especially since we get to learn new thing we could apply in the real world", "Interview Questions": "Not many just why you would like to work there "}], [{"date": "26 Mar 2022", "title": "Director of Business Development Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity (Chicago, IL)", "Interview Descriptions": "The interview was thorough, but the HR staff made an active effort to focus on my background — there was little deviation from the context of my resume and background, which was useful to establishing a relationship with them from the outset.", "Interview Questions": "Heavy emphasis placed on “what would you do”-type scenarios."}, {"date": "28 Mar 2022", "title": "Volunteer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Habitat for Humanity", "Interview Descriptions": "Easy to work with, professional and organized. A great experience. Our office will participate again in the future. I didn’t feel shamed about my lack of skill and the teamwork was inspiring. Will recommend to others.", "Interview Questions": "What types of skills do you have on a build site? \r\n"}, {"date": "28 Feb 2022", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "Pretty straight forward, very friendly, I was able to comfortably talk about my experiences. One round of one on one interview, then they contacted about a week and a half later", "Interview Questions": "Have you had previous experience before with our issues?"}, {"date": "10 Nov 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity in Mar 2022", "Interview Descriptions": "Call after receiving application and given the option to meet in person or online. Interviewed by a panel of current workers in their office. Interview discussed the role and basic job interview questions.", "Interview Questions": "What do you know about Habitat for Humanity?"}, {"date": "25 Feb 2022", "title": "Credit Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Habitat for Humanity", "Interview Descriptions": "Really enjoyable interview process with a series of one-on-one interviews with people that I am now working with on a daily basis. Certainly want to know about qualifications but there a great focus on your desire to join an organization like Habitat.", "Interview Questions": "Asked about you desire to serve Habitat's mission for affordable shelter for all. "}, {"date": "25 Jan 2022", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "Basic interview questions. The individual who interviewed me was very friendly. Had one zoom interview and they decided to go with a candidate who was local to the area.  Would apply again.", "Interview Questions": "Tell me how your experience relates to this position"}, {"date": "21 Jan 2022", "title": "Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "The first call was a screening call with the HR Team and it was fairly straightforward - no hard-hitting questions. The second conversation was a one-hour call with a member of the team. The third day was a series of three 30-minute interviews, two with higher-ups and one with an HR member.", "Interview Questions": "Tell me a time you exerted courage, humility and accountability at a past job"}, {"date": "12 Jan 2022", "title": "Family Services Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Habitat for Humanity", "Interview Descriptions": "I applied for the job. There was an excel proficiency test required with the Indeed application submission. The following morning I received an email from the executive director followed by a text from him asking for an interview same day. Umm no, I work. I scheduled for a few days out. I was completed thrown off that my first interview was essentially a show and tell car ride seeing job sites and getting a high level overview about HFH. \n\nAfter the first interview I immediately received an email asking for a second interview. I was surprised and accepted. During the second interview I was asked standard questions but a lot focusing on conflict with superiors. Definitely seems like a toxic environment has previously occurred. \n\nLeft the second interview and was asked to email my references. All three references said they would let me know when they reached out. None of my references were called. It’s now been a month and never heard back. Just saw online they filled the position. \n\nFor a Christian non-profit organization I’m very disappointed in their lack of communication after 2 interviews and references being requested. I’d suggest passing on this organization.", "Interview Questions": "What do you know about HFH"}, {"date": "4 Jan 2022", "title": "Volunteer Experience Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "The process was great. I had an interview with the HR manager and then HR & Department lead then the CEO. That was a bit stressful but the whole process was very casual.", "Interview Questions": "Tell me about yourself and your experience that relates to the role."}, {"date": "20 Dec 2021", "title": "VP-Communications Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity", "Interview Descriptions": "Very thoughtful - met with ceo and then a panel. Panel had planned ahead on which questions they would ask and who would ask them. Hard to get a read on how my responses were resonating but the team seemed very friendly. Second round was another well-prepared panel.", "Interview Questions": "What charities do you most admire?"}], [{"date": "8 Dec 2021", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "A group of 3 people interviewing and asking you questions, and you of course are giving a response. Feedback on certain safety and rules and regulations when working on houses and what operations must be done", "Interview Questions": "Questions more so regarding my past work history and background. "}, {"date": "14 Nov 2021", "title": "Development Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Habitat for Humanity", "Interview Descriptions": "Applied on Indeed. Had two in-person interviews. Process was smooth and communication was good. I followed up with questions by email, and my interviewer responded promptly. There was some back and forth around salary and benefits what the situation was resolved.", "Interview Questions": "Behavioral, answered using STAR method. "}, {"date": "17 Oct 2021", "title": "Communications Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Habitat for Humanity", "Interview Descriptions": "The interview process consisted of a phone screening with the recruiter, a phone interview with the hiring manager, and an on-site day of interviews with various members of the staff that the position interfaced with. I find this process to be standard among a few companies I have interviewed with.", "Interview Questions": "Situational questions around how I would handle a comms scenario. "}, {"date": "7 Oct 2021", "title": "Graphic Designer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity", "Interview Descriptions": "Interviewed with two people over video call, with cameras turned off. Fairly straight forward questions and friendly interviewers. They went with someone with more experience, but were quick to let me know.", "Interview Questions": "What does diversity and inclusion mean to you?"}, {"date": "16 Sept 2021", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity", "Interview Descriptions": "First round of interview was pretty straighfoward. Asked about your work history, why are you drawn to the organization.  Talked more about the role, salary range. Automatic, generic e-mail response if you do not make it to the next round.", "Interview Questions": "Why did you apply for this role?"}, {"date": "2 Oct 2021", "title": "ReStore Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at Habitat for Humanity (Fresno, CA) in Sept 2021", "Interview Descriptions": "Amazing. I was treated with  the utmost respect. It was a phone interview. The manager was very kind and considerate. The organization places importance on how employees are treated. I highly recommend people looking at Habitat for Humanity for a job. They have a wonderful culture.", "Interview Questions": "What do you want out of life?"}, {"date": "28 Jan 2022", "title": "System Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Habitat for Humanity in Sept 2021", "Interview Descriptions": "Initial phone interview and then a video interview with the CTO. Very informal. Not really a surprise considering it’s a non-profit. \r\n\r\nAfter the interview with the CTO I sent two follow up emails and didn’t get a response. That’s unacceptable in my eyes, and says everything about the company.", "Interview Questions": "Basic sys admin stuff. I remember that the CTO really wanted someone with a lot of Azure experience to lead their future cloud migrations, but my experience there was limited."}, {"date": "16 Aug 2021", "title": "Family Services Coordinator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity", "Interview Descriptions": "Submit resume and cover letter through Indeed. First interview with Executive Director and then a second interview with 2 volunteer members of the Family Services Committee, one of whom held the position of Coordinator in the past.", "Interview Questions": "How would you approach a delinquent client who is late on submitting forms or a payment?"}, {"date": "14 Jul 2021", "title": "Executive Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "The interview process was great, they were able to answer all questions and provide clarity on the role and direction of the organization.  Based on the interview I would recommend them.", "Interview Questions": "Why do you want the role"}, {"date": "1 Oct 2021", "title": "Global People Team Transformation Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Habitat for Humanity (Cleveland, OH) in Jul 2021", "Interview Descriptions": "Unimpressive process. Interview for a high level position with international scope, conducted in a very unprofessional manner by a recent hire. Multiple interviews, posted the opportunity as remote only to \"ding\" you for not wishing to relocate. Let you progress far into the process and not select you with ZERO feedback as to why. At this level of opportunity, it is expected that solid feedback will be given.", "Interview Questions": "Why do you want to work for Habitat for Humanity? "}], [{"date": "20 Jul 2021", "title": "Computer Programmer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity in Jul 2021", "Interview Descriptions": "It was easy. I had two interviews and both times I felt at easy and everyone was easy to talk too. I highly recommend this organization. You will have to interview with multiple people.", "Interview Questions": "What are your strengths and weaknesses?"}, {"date": "29 Jun 2021", "title": "Secretary Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "Several questions were asked by the interviewer. Everything went swiftly. The interviewer was very kind and well-mannered. The interviewer also offered to provide a cup of coffee or tea, which helped ease the interview process.", "Interview Questions": "Why do you want to work for Habitat for Humanity?"}, {"date": "21 Jun 2021", "title": "Public Funding Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Habitat for Humanity", "Interview Descriptions": "Phone screen interview was about 30 minutes with HR, followed by a 1-hour interview with the same HR professional and supervisor of the position applied for over a Zoom video conferencing call.", "Interview Questions": "Explain a time where you had a disagreement with a superior and how it was resolved. "}, {"date": "14 Jun 2021", "title": "Retail Sales Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "Easy in-person conversation. Tour facility, met other staff and volunteers, talked about schedule. Shared my past experience and interest in the part-time job. Flexibility in schedule was important to balance family responisbilities.", "Interview Questions": "Experience in customer service, mission focus"}, {"date": "5 Jun 2021", "title": "Communications Coordinator Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "They all seemed like nice people to work with. They extended the job offer to me, and then out of nowhere left me a voice-mail and rescinded the offer. Never returned my calls or emails, I was totally ghosted. Overall though feel like I dodged a bullet.", "Interview Questions": "They had a practical application for indesign and social media. "}, {"date": "2 Oct 2021", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Saint Paul, MN) in Jun 2021", "Interview Descriptions": "I had a 20ish minute interview with someone over the phone. They were friendly and asked basic questions. Even though I wasn't offered the job they sent me a nice email wishing me well.", "Interview Questions": "They asked about past experience, why I wanted the job, and why I thought I'd be good for the job."}, {"date": "6 May 2021", "title": "Digital Media Marketing Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "I got the position by applying through UVA's IPP program. During the interview with habitat for humanity, make sure you know what habitat for humanity is and what they do. Be prepared to talk about your passions and strengths.", "Interview Questions": "Have you worked with Habitat for Humanity before?\nWhat's your strength?"}, {"date": "12 May 2021", "title": "Development Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Greenville, SC) in May 2021", "Interview Descriptions": "After submitting my resume and cover letter, I was quickly asked to come in for an interview. I drove 4 hours to the Greenville, SC office and met with the Development Team. I was asked basic interview questions with just a couple of job-specific questions. Then, in about a week, I was asked to return to Greenville to meet other department heads for a second interview. This was almost an exact repeat of the first interview, with basic questions.", "Interview Questions": "What could you bring that this Development Team could not live without?\nWhy non-profit?\nHow do you work best, as an individual or in a team?\nHow would you describe your ideal work environment?\nWhat is your biggest regret/ best choice?\nWhat frustrates you at work?"}, {"date": "26 Apr 2021", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "The interview process was typical with a few situational questions, past experiences, and logistical questions. The interviewer was very kind, and was keen to answer any questions I had. There was only one interview total.", "Interview Questions": "What are 3 adjectives employers would describe you as? "}, {"date": "2 Apr 2021", "title": "Government Relations Intern Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "Contacted by recruiter after submitting online application. The interview was not conducted specifically with information about the position, it was a general interview. They did not reach out after the interview.", "Interview Questions": "Describe your duties at your current job. "}], [{"date": "11 May 2022", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity in Apr 2021", "Interview Descriptions": "Fast application and interview process. My application was in for a week or so before they contacted me for an interview. Did one in person interview and one virtual interview. They contacted me shortly after the second interview, within a few days.", "Interview Questions": "If I had construction experience. "}, {"date": "17 Jun 2021", "title": "U S Transformation Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Habitat for Humanity in Apr 2021", "Interview Descriptions": "4 Phases: phone screen, phone interview with hiring manager, virtual interview with Sr. Director - U.S. Transformation, final virtual interview with VP - U.S. & Canada Operations\r\n\r\nOverall communication at the beginning and end of the process was rough. The process also took over a month and a half, far too long for an entry-level position.", "Interview Questions": "What drew you to apply for this position?\r\n\r\nHow has your past experience prepared you for this role?\r\n\r\nHow do you organize your work when juggling multiple responsibilities?\r\n\r\nTell us about a situation when you weren't clear on what was needed from you. How did you handle that?\r\n\r\nWhat do you look for in a manager?\r\n"}, {"date": "14 Jun 2022", "title": "Project Supervisor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity (Hendersonville, NC) in Apr 2021", "Interview Descriptions": "2 phone calls & 1 in-person interview. In-person interview was on site, casual, & mostly detailed the responsibilities of the job. Phone calls were more formal but still fairly relaxed.", "Interview Questions": "Are you comfortable managing older volunteers?"}, {"date": "26 Mar 2021", "title": "Americorps Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "Applied online through both HFHI and AmeriCorps federal website, received information about a phone interview through the affiliate, then moved onto the final round. Worked with the Habitat International team to figure out final efforts and placement, the talent team at HFHI could not be more helpful.", "Interview Questions": "What experiences have prepared you for this position?\n\n"}, {"date": "15 Mar 2021", "title": "Construction Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "The interview was straightforward, about an hour long and consisted of a mix of standard interview questions and job-specific scenario questions. HR, the Project Manger and the Department Director were present.", "Interview Questions": "What do you do if someone does not follow your instructions?"}, {"date": "19 May 2021", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity in Mar 2021", "Interview Descriptions": "Phone screening took place the end of March 2021, with indication that I would have a second interview done in early April.  The end of April I received an e-mail stating the process was taking a bit longer, but would still be scheduled an interview.  The end of May I received an e-mail that they moved on with another candidate.  Very little communication.", "Interview Questions": "Phone interview was general questions about your background."}, {"date": "5 Oct 2022", "title": "Construction Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Habitat for Humanity (Atlanta, GA) in Mar 2021", "Interview Descriptions": "The process was very lengthy with weeks to months of no contact before finding out whether or not you move on to the next round. The questions in each round were very similar, just with different interviewers.", "Interview Questions": "What does working for Habitat mean to you?"}, {"date": "24 Feb 2021", "title": "Constituent Engagement Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity in Feb 2021", "Interview Descriptions": "Phone screen with HR. She was super sweet and asked a few questions pertaining to the position. She informed me during the phone interview, that I would be moving on towards the second interview. My second interview is set up for next week.", "Interview Questions": "What experience do you have with volunteer services? \n \nAre you familiar with HFH? \n"}, {"date": "13 Jan 2021", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "The interview process was less structured than others. More of a conversation and less of a back and forth question and answer format. Lovely hiring staff, super nice and addressed all of my questions about the position.", "Interview Questions": "Tell me about your most recent work experience. "}, {"date": "10 Mar 2023", "title": "Director of Thought Leadership Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Habitat for Humanity in Dec 2020", "Interview Descriptions": "Phone interview with HR Phone interview with hiring manager Writing assignment Video interviews with department heads Final interview with hiring manager/ leadership Very communicative and quick responses. Approximately a 4 week process", "Interview Questions": "How would you pitch a Habitat executive to participate on a speaking panel?"}], [{"date": "4 Nov 2020", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity", "Interview Descriptions": "The interview process was extensive, friendly but sometimes inconsistent.   Much time passed between interviews and follow ups with also inconsistent communication from focal points.  There was minimum or no feedback provided.", "Interview Questions": "why did you apply to the position?"}, {"date": "24 Apr 2022", "title": "Executive Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Habitat for Humanity (Kingsport, TN) in Oct 2020", "Interview Descriptions": "I completed an application form, then met with a four members of the Board of Directors and also completed a personality profile. I also toured two ReStores with one board member. From when I first applied until I heard a response, it took more than 3 months.", "Interview Questions": "How do you create, track, and manage a nonprofit budget?"}, {"date": "22 Oct 2020", "title": "Sales/Warehouse Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Habitat for Humanity (Edmonton, AB) in Oct 2020", "Interview Descriptions": "Overall the interview was a good experience, the hiring manager was very friendly, and so was the assistant manager. But when I had arrived, I asked an employee where the hiring manager was, the employee seemed to be annoyed with me, she gave me an attitude for no reason.", "Interview Questions": "What makes you want to work for Habitat for Humanity?"}, {"date": "6 Oct 2021", "title": "Finance Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Maseru) in Sept 2020", "Interview Descriptions": "Fair and relaxed. they  tested more on internal Controls\nand disbursement processes. data analysis was bit tricky but all in all the interview was fair. they give the  feed back like they have promised", "Interview Questions": "i was askes to Describe Budget process"}, {"date": "20 Jul 2020", "title": "Project Development Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity", "Interview Descriptions": "I applied online for this position and was contacted by a member of neighborhood revitalization team. It was a brief phone screening, where the interviewer discussed the position and asked very general questions about my work experience and background.", "Interview Questions": "What type of experience do you have with data analysis and visualization? "}, {"date": "27 Apr 2020", "title": "Volunteer Services Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Habitat for Humanity in Mar 2020", "Interview Descriptions": "Very relaxed, great experience. They allowed you to talk as much as needed to answer the question, no leading questions, allowed time to just chat and get to know you.", "Interview Questions": "How do you handle conflict between volunteers?"}, {"date": "6 Feb 2020", "title": "Research Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity", "Interview Descriptions": "Well the interview was actually quicker than I expected. I came in prepared and did my background check on the organization but we actually jumped straight to the role and salary discussion.", "Interview Questions": "Can you avail yourself to travel?"}, {"date": "8 Apr 2021", "title": "Painting/Rehab Team Leader Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Saint Paul, MN) in Feb 2020", "Interview Descriptions": "I did a pre-interview on the phone with a lovely human. It went well. She set up an in-person interview at the Saint Paul location. The manager and the employee I'd be temporarily replacing asked me questions/facilitated a conversation at an overwhelmingly long table.", "Interview Questions": "At the end of the interview I asked if there was any reason they wouldn't hire me--anything I could clear up or have a chance to discuss further. They said, \"no,\" then never followed up. I think I may have been overqualified and didn't affirm how badly I might need the job. I didn't need the job, I just wanted the job as I knew I had a skillset (construction) and heart that would add value to the clients they were serving."}, {"date": "26 Jan 2020", "title": "Project Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 months. I interviewed at Habitat for Humanity", "Interview Descriptions": "2 rounds - first via email. Only one in-person interview with 3 people at the head office. First round via email was answering some simple questions, with a 48hour window to reply. I found they took a long time to get back to me after each interview round.", "Interview Questions": "Tell me about a time you worked well on a team"}, {"date": "21 Mar 2022", "title": "Housing Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity (Gulfport, MS) in Jan 2020", "Interview Descriptions": "It was a two interview process. The first interview was with the immediate supervisor and the second interview was with the executive director. Very responsive during the process. They narrowed the field to several top candidates.", "Interview Questions": "What is a mistake you made in the past?"}], [{"date": "18 Mar 2021", "title": "Technical Project Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Atlanta, GA) in Jan 2020", "Interview Descriptions": "First had a phone screen with HR.  Then a phone call with the hiring manager.  Then on site and met with 4 different groups, some one on one and some with multiple people.  Very nice and welcoming.", "Interview Questions": "Tell us about a major project that you were in charge of and what was the outcome of that project?  \nA few technical questions about how to run queries for data and knowledge about databases."}, {"date": "16 Jan 2020", "title": "Director of Construction Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Habitat for Humanity (Indianapolis, IN) in Dec 2019", "Interview Descriptions": "Multi-phase, multi-day process. 1 phone interview, one in person interview, 3 in-person interviews. Went through entire process, as a highly qualified candidate. It took 4 weeks. I had over 8 hours of interview time, and they hired an internal candidate. It was clear that they only used me to check a box that said they went through a hiring process. Unethical interview practices that wasted a lot of my time. I even went out of my way to take time off of my current job, and made arrangements to have my daughter picked up from school after they moved the last interview day a week earlier than originally scheduled. They also have no process for hiring, as they do not have a human resources department. The 2nd interview was 3 directors that had no idea how to conduct an interview. Clearly a massive disconnect among departments and poor leadership during the process. Nice enough people, but need true business instruction.", "Interview Questions": "Tell me about your experience"}, {"date": "27 Nov 2019", "title": "Product Services Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Habitat for Humanity (Toronto, ON) in Nov 2019", "Interview Descriptions": "After submitting my cover letter and resume via e-mail I was called for a telephonic interview. The interviewer seemed as if they were reading up questions from a script rather than being genuinely interested in knowing what my background is. They were supposed to get back by end of the week but didn't and when I followed up, I received a one-liner stating that I haven't been selected. They are not obligated to inform of their decision even after an interview I guess, but I would've expected an organization like Habitat for 'Humanity' to be a bit more considerate towards a job-seeker when informing them of the result. Automated rejection emails from organizations have better wording", "Interview Questions": "Standard set of behavioral questions"}, {"date": "5 Nov 2021", "title": "Marketing & Communications Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Habitat for Humanity (Austin, TX) in Nov 2019", "Interview Descriptions": "I had three interviews: one on the phone and two in person. The process took about a month, and the interviews went very well. However, even though I emailed to thank the interviewer for their time, I never heard back either way about my standing for the role. I even followed up a couple of weeks after but was completely ghosted. I get that things can change within a company, but this felt unprofessional.", "Interview Questions": "Tell us about yourself and your professional background"}, {"date": "24 Feb 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity (Atlanta, GA) in Nov 2019", "Interview Descriptions": "The interview process was very clear and straightforward. There was an initial interview with HR and a second interview with the hiring team. The initial interview was a phone screening then I was invited to the office for an in-person interview with the team.", "Interview Questions": "Questions were pretty specific to the team"}, {"date": "20 May 2021", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Habitat for Humanity in Oct 2019", "Interview Descriptions": "The interview was friendly and relaxed. After submitting my application, I was called in for a written test. The test was in the form of a presentation for the project I had applied. I had to then present this at the interview. This was followed up by interview questions.", "Interview Questions": "Q. Why do you want to apply for this position?\nQ. Are you comfortable with relocating since this is a field based job?\nQ. What are areas you would require more support to better carry out you role?"}, {"date": "20 Nov 2019", "title": "Donor Care Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity (Toronto, ON) in Sept 2019", "Interview Descriptions": "It took around 2 weeks the process after I sent my resume. They were really nice, the only thing I didn't like is that after the interview I sent a thank you note and didn't get replied and I had to send another email to check if I was selected as nobody notify before.", "Interview Questions": "If the money wouldn't be a problem, what would you like to spend your time?"}, {"date": "23 Aug 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "Business Casual dress code. Basic questions to know your hands-on skills such as carpentry, floor laying, roofing, use of power tools, wall partitioning, etc. They inquired your non-available working days and time in a month", "Interview Questions": "Why are you interested in Habitat for Humanity?"}, {"date": "29 Oct 2019", "title": "Marketing and Communications Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Habitat for Humanity (Philadelphia, PA) in Aug 2019", "Interview Descriptions": "I was contacted over the phone and then invited in to interview in person. Everyone was incredibly nice and kind, over the phone and in person. I brought writing samples, articles that were published nationally and internationally, as well as a publication I was founder/editor of that I created from scratch. I invested a significant amount of time, from applying, driving, and taking a full day to come to Philadelphia for the interview, which I thought, had went extremely well. \r\n\r\nAfterward, I sent a thank-you follow-up email and never received a word back. It was disappointing because I believe if someone was brought in to be interviewed, the least a company or organization could do is get back to them, especially after an extremely kind thank you note. I would have expected that from Habitat for Humanity, but I received nothing.", "Interview Questions": "This is a paraphrase, but I was caught off guard by this particular question, and somewhat offended. I didn't want to harp on it, but I was surprised someone would ask me something like this, considering my faith calls me to love all, which was one of the reasons I applied for the job...\r\n\r\n\"From your background, you seem like someone who is of Christian faith. Many of the families we help are of other races and some are particularly Muslim. Would you have a problem helping people like that?\" "}, {"date": "2 Aug 2019", "title": "Community Engagement Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Waco, TX) in Jul 2019", "Interview Descriptions": "got an interview set up about 2 weeks after applying, then had one hour long in person interview with two managers who had about 5 printed pages full of questions, questions were basic, behavioral, creative and mathematical. Was told I'd hear back either way in about a week. never heard back at all. was really a ridiculous amount of questions for the position i applied for.", "Interview Questions": "if you could be any animal would what you be, how many dollars are in 38 quarters, situation you had to take leadership in"}], [{"date": "24 Jul 2019", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Habitat for Humanity (Denver, CO) in May 2019", "Interview Descriptions": "I was called and ask for a day I was asked when I could come in for and interview. They told me who i was looking for and what time to be there. I got told the job describe. Asked about myself and what skills i may bring to the company. What I was hoping to learn for this job. Asked for my references. They contacted them and then extended me and offer.", "Interview Questions": "Tell me about yourself?"}, {"date": "1 May 2019", "title": "Cashier Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 1+ week. I interviewed at Habitat for Humanity (Henderson, NV) in Apr 2019", "Interview Descriptions": "Applied for the position via indeed. About 3 weeks later was emailed for a phone interview. Was ask the regular questions ( “ tell me a bit about yourself”). They informed me they would contact me if I moved to the second interview. A few days later they called me and asked for a second interview with the store manager. \nWent to the second interview with the store manager and the COO of the stores in the state. They asked me questions and what the position consists of. They informed me that they will make a decision at the end of the week.", "Interview Questions": "Do you accept change as a form of payment?."}, {"date": "27 Jun 2020", "title": "Grant Writer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Habitat for Humanity (Richmond, VA) in Apr 2019", "Interview Descriptions": "There were two 30-minute phone interviews where I was asked many general, generic questions. I wish I would have been given an opportunity to share specifics about my background and how it aligned with the position.", "Interview Questions": "One challenging aspect of working with team "}, {"date": "7 Aug 2019", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 months. I interviewed at Habitat for Humanity (Atlanta, GA) in Mar 2019", "Interview Descriptions": "Zero response! This is not only a problem for candidates, but for the brand. There is no excuse for so called ghosting a candidates when the organization relies uponon donations and volunteer work. Wow, just wow. My experience started when I applied on-line for a role that sounded perfect for me. Six months later, I receive a call asking if I would like to interview now for the role. I then interviewed with multiple people who seemed very kind, but never completely shut down and would not return email or calls. It is so simple: follow up. Let a candidate know if they aren't chosen or something else outside of their control such as funding dries up, etc.", "Interview Questions": "Ran through the job req line by line, asking about experience with each skill or experience. "}, {"date": "10 Nov 2018", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Denver, CO)", "Interview Descriptions": "Great experience overall. Organized and sincere. Interested in wanting to make the experience the best for me. Wanted the internship to be a learning experience and interesting. Interview was very casual but they wanted to get to know me, too.", "Interview Questions": "What do you want to learn during your time as an intern?"}, {"date": "27 Oct 2018", "title": "Marketing Communications Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity", "Interview Descriptions": "The first interview was in person in their Manhattan office. When I got to the office I waited for them to come get me. The two people who interviewed me were very kind and friendly and made me feel comfortable. It felt like they wanted to get to know me and not just ask me questions and me answer. There were no outside of the box questions.", "Interview Questions": "Why are you seeking to leave your current position?"}, {"date": "27 Sept 2018", "title": "Field Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Habitat for Humanity (Jacksonville, FL)", "Interview Descriptions": "Short and basic.  It was a normal conversation with two females on whic they made most of the talk to each other.  It looks like they didn’t have too much experience interviewing or it wasn’t their fortet.", "Interview Questions": "Tells us about yourself."}, {"date": "14 Sept 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Habitat for Humanity (Peoria, IL) in Sept 2018", "Interview Descriptions": "Informal, easy questions asked and can tell interviewee was unprepared. Very basic just asked question about yourself and what was already on resume. Seems like they are not looking for much in a person at all.", "Interview Questions": "What skill can you bring to the organization? "}, {"date": "15 May 2020", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Winston-Salem, NC) in Jul 2018", "Interview Descriptions": "They called and asked me to come in for an interview. It felt good and there were no odd questions - very standard. I was not offered the position but only found out of this non-offer through the fact that I never received a phone call or email telling me that they were going to look elsewhere. I just wish someone had contacted me and said they didn't want to pursue me anymore.", "Interview Questions": "Why are you interested in this position?"}, {"date": "22 May 2018", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Habitat for Humanity", "Interview Descriptions": "I applied online and was contacted for an interview within a few days. My interview was with the previous Director of Development. It was a fairly casual interview with the standard questions asked about my previous experience and why I would be the best fit for the position.", "Interview Questions": "How would you handle a volunteer becoming upset or angry at another volunteer? "}], [{"date": "12 Aug 2021", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Habitat for Humanity in May 2018", "Interview Descriptions": "Good. They ask good questions that prepare you for the work as well as if you are a good fit for the company and its mission. Would interview with them again.", "Interview Questions": "Do you handle ambiguity well?"}, {"date": "30 Apr 2019", "title": "Development Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 5 weeks. I interviewed at Habitat for Humanity (Palm Beach, FL) in Mar 2018", "Interview Descriptions": "The process was long and drawn out.  The hiring VP was disorganized and unprepared.   The people I interviewed with were not engaged and or knowledgeable about the role.", "Interview Questions": "Why do you want to work for Habitat for Humnaity?"}, {"date": "1 Apr 2018", "title": "Development Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Habitat for Humanity in Mar 2018", "Interview Descriptions": "I was contacted about a month after I emailed my resume and asked to do a phone interview on a Monday. I was told I’d hear back by Friday, but I never did. Two weeks later I got another job and emailed them letting them know I wanted to withdraw my candidacy. I then received an email that they had moved on with another candidate. I’m not sure why this process took so long.", "Interview Questions": "On a scale of 1 to 10, how would you rate your experience with soliciting donations?"}, {"date": "7 Feb 2019", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 days. I interviewed at Habitat for Humanity (Charlottesville, VA) in Mar 2018", "Interview Descriptions": "The process was very mundane, very simple. This was mostly because they were actively looking for work, especially volunteer worker. The employer was very nice and asked very straight forward questions.", "Interview Questions": "What are you looking to accomplish during your time here?"}, {"date": "25 Feb 2018", "title": "Executive Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Habitat for Humanity (Grass Valley, CA) in Feb 2018", "Interview Descriptions": "The interview started with a tour of the varying locations and then involved questions from a board of directors.  Each part of the interview process took only one hour.", "Interview Questions": "How would you lead change?\r\nWhat is your biggest leadership failure?"}, {"date": "1 Mar 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Habitat for Humanity (Asia) in Jan 2018", "Interview Descriptions": "I send my application online and few weeks later they invited me to a job interview with HR. Before I had the job interview they re-post the job . The interview took 45 minutes, it was pretty easy, the HR person knew about the position so it was a mix of personal and technical questions.  He told me that in one week I would know something. It was in January and I still know nothing.  When I wrote him to ask he told the Director needed more time.  I saw re-post and re-post the position over and over again.", "Interview Questions": "Personal and techcnical (stress management, teamwork, examples of experience)"}, {"date": "25 Dec 2017", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Habitat for Humanity", "Interview Descriptions": "Excellent experience, met with a panel of people. After the phone  screen it went pretty quick. the whole experience was not stressful at all. I received my offer letter within 48 hours.", "Interview Questions": "Can you multi task?"}, {"date": "2 Sept 2017", "title": "Customer Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Habitat for Humanity (Mobile, AL)", "Interview Descriptions": "Informal- met with two managers separately after filling out application. Immediately I talked with each of them maybe fifteen to twenty minutes; then got a call later that afternoon asking me to start as soon as possible.", "Interview Questions": "What do you know about Habitat?"}, {"date": "25 Aug 2017", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at Habitat for Humanity", "Interview Descriptions": "It was short and simple!  I was hired on the spot.  They went over what the job entailed and the hours they wanted me to work.  They asked if I could pass a background check.", "Interview Questions": "They asked me if I could work a particular shift.  They asked about doing a background check on me. "}, {"date": "5 Aug 2017", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Habitat for Humanity", "Interview Descriptions": "Phone Interview after submitting resume. 25 minutes nothing out of the ordinary. I had not submitted or viewed the online application at this point. See details under interview questions to see why I did not pursue this position further.", "Interview Questions": "why did you leave your last job. what are you expecting for a salary. what work experience do you feel will benefit you in this position. Have you been to restore."}], [{"date": "11 Sept 2017", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Eugene, OR) in Aug 2017", "Interview Descriptions": "This interview was with the Springfield-Eugene Habitat for Humanity.  A three person panel interview comprised of the Executive Director, the Volunteer Coordinator, and the Development Director--all had prepared questions.", "Interview Questions": "What is your experience writing and researching for grant proposals?"}, {"date": "24 May 2019", "title": "Associate Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Habitat for Humanity (Atlanta, GA) in Jul 2017", "Interview Descriptions": "Phone screen. A call.with hiring manager. A week later a call with other team member. A few weeks later an interview at hq with hiring manager and second interview with other 2 team members. Then another 5 weeks to get decision.", "Interview Questions": "Questions were very generic, never diverged from script even when answers may have warranted a follow-up question that wasn't pre-rehearsed."}, {"date": "25 Jul 2017", "title": "Longview Community Engagement Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Big Sandy, TX) in Jul 2017", "Interview Descriptions": "I sent a resume and somebody called me for an initial interview.  And I told the person about my experience.  And I'm going to submit some writing samples with e-mail.", "Interview Questions": "What experience do you have in writing?"}, {"date": "14 Jul 2017", "title": "Administrative Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Boston, MA) in Jul 2017", "Interview Descriptions": "I was contact by the HR manager.  We set up an interview and she was very accommodating to my schedule-.  I met with two directors.  Came back for second interview with three directors.", "Interview Questions": "Why do you want to work for this company?"}, {"date": "16 Nov 2019", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Habitat for Humanity (London, ON) in Jun 2017", "Interview Descriptions": "Typical interview with typical middle managers. Low stress and easy. To be honest, they're desperate most of the time. When I worked there we interviewed a guy and he came in with his fly down and got the job so...", "Interview Questions": "Typical 'how would you handle...?' its retail."}, {"date": "3 Jul 2017", "title": "Family Services Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Habitat for Humanity (Raleigh, NC) in May 2017", "Interview Descriptions": "Straight-forward interview where they went over the position and learned about why I was interested/what made me qualified. Having experience in community development and speaking Spanish were pluses for working in Family Services.  I think it also helped that I have volunteered with Habitat in the past and had some personal connections.", "Interview Questions": "How does this internship fit in with your career goals?"}, {"date": "26 Apr 2017", "title": "Director of Development Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Bloomington, IL) in Mar 2017", "Interview Descriptions": "They were really accommodating when setting up the interview. It was a full panel interview with multiple staff members and Board members present. Each person asked multiple questions. There was only one round of interviews, but they mentioned a potential second round if deemed necessary.", "Interview Questions": "How are you in dealing with people from different faiths?"}, {"date": "22 Feb 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "it is simple,just go online,watch small safety movies,answer the safety quiz and u r ready to work.After  clearing the safety quiz a link is sent  to you ,u can log in by making your ID and choose the shift u want to work.", "Interview Questions": "safety questions"}, {"date": "25 Jul 2017", "title": "Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Silver Spring, MD) in Feb 2017", "Interview Descriptions": "It was three rounds - first on the phone, then in person with the development team and supervisor, then I met with the Executive Director. Took a couple weeks to go through it all.", "Interview Questions": "How will your experience help you perform this job?"}, {"date": "23 Oct 2017", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Habitat for Humanity (Grand Junction, CO) in Feb 2017", "Interview Descriptions": "thay introduce me to the difternt seccesions greeen red blue  yelow (\"i loved the prosses thair was no hard ball questions it was licke peas in a pod i vonlenter at habatat", "Interview Questions": "will i work "}], [{"date": "18 Jul 2018", "title": "Data Entry Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Habitat for Humanity (Fort Pierce, FL) in Jan 2017", "Interview Descriptions": "Very nice people, made me feel very comfortable during the whole process. I hope to get a job with this company as soon as possible. The office was very clean and professional looking, I think they know what they’re doing.", "Interview Questions": "Q: give us an examp,e of a time you went above and beyond for a coworker?"}, {"date": "23 Jan 2019", "title": "Crew Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Habitat for Humanity (Cincinnati, OH) in Jan 2017", "Interview Descriptions": "ou will be responsible for working together with the Special Events team to coordinate annual fundraising events with all aspects related to the execution of these events as well as additional development projects", "Interview Questions": "Why do you want to work here"}, {"date": "13 Apr 2018", "title": "Day Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Habitat for Humanity (San Antonio, TX) in Dec 2016", "Interview Descriptions": "Quick and easy. I met with the boss on site and talked to him about setting up the interview. He gave me his card and we were able to set one up. It took me a while to get started with leading because I had to wait for an available house. But other than that I love my job and love working with the staff and homeowners.", "Interview Questions": "Tell me about yourself"}, {"date": "21 Nov 2016", "title": "Development Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Habitat for Humanity (Dallas, TX) in Oct 2016", "Interview Descriptions": "Initial phone interview went well with the HR representative, followed by a second in-person interview with the development supervisor -- was told a third interview with other development associate staff would be follow if candidacy was to proceeds. Both interviews went very smoothly and provided great company culture.  Still waiting and looking forward to their response.", "Interview Questions": "Development history. Donor portfolio.  "}, {"date": "31 Oct 2016", "title": "Repair Foreman Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Habitat for Humanity (Oakland, CA) in Oct 2016", "Interview Descriptions": "I interviewed at the Oakland office.  It's a little difficult to find if you have never been their so give yourself a little time.  It's actually in the beautiful church you'll see on the corner.\r\n\r\nFirst I had a phone conversation with HR. I was told she would forward my resume to the appropriate place and she did!  I revived a phone interview later in the week.  After the phone interview I was called and asked to come in for a face 2 face a few days later.\r\n\r\nAt the interview,  I met with three different people.  The first person I met be my direct supervisor then the next two were his supervisors.  Originally I was to also interview with someone involved in the hiring process but they weren't available that day.  Things happen, I just really appreciate their transparency. \r\n\r\nHowever all three people I met with would be wonderfull to work, likeminded intelligent and professional.  \r\n\r\nAfter the end of the rather thorough three hour interview I felt as if my experience was perfect and that I would make a great member of the team.  I definitely impressed mysel!  \r\n\r\nAt the end of the interview my potential supervisor was instructed to take me to meet the HR rep.  I felt as if this was a good sign however unfortunately I wasn't told when or if I would be notified of the decision.  I maybe should have been direct.  I am currently mulling over and delaying as best I can a job opportunity that is far more money but doesn't have what Habitat has. \r\n\r\nThe people and the passion to do what I know I was meant to do.  \r\n\r\nWell we'll see. Good luck", "Interview Questions": "How could you motivate a volunteer that wasn't neccesarialy motivated to help the cause."}, {"date": "31 Aug 2016", "title": "Human Resources Interview Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Habitat for Humanity (New York, NY)", "Interview Descriptions": "HR Director missed my interview on 3 different occasions and never made an effort to give me a proper date when it was rescheduled. She just said expect a call in the afternoon. The most unprofessional interviewing experience I've ever had", "Interview Questions": "How do you handle stress? "}, {"date": "4 Aug 2016", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Habitat for Humanity", "Interview Descriptions": "Long interview process, hard to get the manager on the phone after the call you and leave a message.  Clearly didn't care about the candidate experience because they could never confirm an interview and expected you as the interviewee to just be ok with it.  Sorry we're just busy right now was the answer.", "Interview Questions": "How would you handle working on multiple different project with multiple different deadlines and all needing to be completed right away?"}, {"date": "4 May 2017", "title": "Project Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Habitat for Humanity (Atlanta, GA) in Aug 2016", "Interview Descriptions": "Phone interview with HR, then phone interview with hiring manager. They wanted to know if I would be comfortable with a high stress environment with many moving parts. It was conversational.", "Interview Questions": "Describe yourself in 3 words, why do you want this job, why are you leaving your current job?"}, {"date": "16 Feb 2020", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Habitat for Humanity (Atlanta, GA) in Aug 2016", "Interview Descriptions": "There were three interviews.  1. an initial phone screen.  2. a phone call with one current employee 3. an in person panel interview.  The in person panel interview consisted of three other potential coworkers and the person exiting the position I was applying for.", "Interview Questions": "Many situational questions were asked such as tell us a time when you.... or tell us about a time when you handled a challenge at work."}, {"date": "28 Jun 2016", "title": "Homeowner Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Habitat for Humanity", "Interview Descriptions": "Applied via career website -> phone interview by the manager within a few days -> scheduled an on-site interview -> manager explaining the details of the job -> 1st manager interviewed me -> another manager interviewed me -> both interviewed me at the same time -> Done!", "Interview Questions": "What does our organization do?"}], [{"date": "18 Jun 2017", "title": "Institutional Research Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2+ months. I interviewed at Habitat for Humanity (Tyler, TX) in Jul 2016", "Interview Descriptions": "Moderately formal, but friendly and focused on skills, potential for the organization, and personal integrity. They looked for a balance of skill, honesty, and your work ethic, which must be solid.", "Interview Questions": "What is your educational background?"}, {"date": "6 Jun 2016", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Habitat for Humanity (Kamloops, BC) in Jun 2016", "Interview Descriptions": "Interviewed by the Executive Director and Store Manager. they were very personable and seemed like and amazing team to work with\r\nthe starting wage is very low, understandable with non-profit, but to recruit the right fit, sometimes spending more can be better", "Interview Questions": "Why do you want to work for Habitat?"}, {"date": "30 Jun 2016", "title": "Customer Service Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at Habitat for Humanity (Kelso, WA) in Jun 2016", "Interview Descriptions": "I was seclude for my interview at 9:30 at Habitat for Humanity.  I was on time. Dressed for success. My interview went very well.  He hired me for a part time position. I will start tomorrow and work 20 hours a week. He review all the Hazards assonated with the Job. Dewayne was very professional and respectful.", "Interview Questions": "What would like to learn from this Job."}, {"date": "11 May 2016", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Habitat for Humanity", "Interview Descriptions": "I just exchanged some Emails with Habitat. I didn't have any real interviews.\r\nThey are happy to welcome as many volunteers as possible. But make no mistake, if you commit yourself to work, even as a volunteer, you'll have to work seriously and follow orders.", "Interview Questions": "They just wanted to know what were my physical abilities to make sure they didn't give things too complicated or dangerous to do."}, {"date": "5 Jan 2018", "title": "Homeownership Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Portland, OR) in Mar 2016", "Interview Descriptions": "They interviewed me over the phone, which I felt went very well.  They told me at the end of the phone interview, that I was one of the top candidates, due to my experience in the field, and community.  I was also told the next step would be an in person interview with the executive director and some board members.  I never heard back from them, despite placing several calls. Because they were a community partner of the non-profit where I worked at the time, I heard who that they hired internally - from the person they hired.  To me, it felt extremely unprofessional to not give me the courtesy of a \"we've decided to go a different direction\" phone call - particularly considering they tabled at an event held by my then current employer that same month.", "Interview Questions": "What experience do you have supporting new immigrants as they work toward homeownership?"}, {"date": "30 Mar 2016", "title": "Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Atlanta, GA) in Mar 2016", "Interview Descriptions": "Friendly initial phone interview, then I was recommended for a second interview, hopefully I will be referred for an in person interview. the website prepared me well. However you need to know how well you work with a team.", "Interview Questions": "what motivates you to come to work everyday"}, {"date": "25 Feb 2016", "title": "Fund Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity", "Interview Descriptions": "Very smooth process. Contacted 2 weeks after closing date of posting to have a phone interview the following week. Interviewer called on time and was very polite. I was asked a few typical questions and then allowed time for questions. It was a short interview but that could be because my answers were fairly concise.", "Interview Questions": "Why do you want to work for Habitat for Humanity?"}, {"date": "2 Jan 2018", "title": "Fundraiser Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Habitat for Humanity (London, ON) in Feb 2016", "Interview Descriptions": "Very short interview with high level questions.  Was offered the position right after the interview. I had done some research on the organization ahead of time and went prepared with their past and current projects, also noted that they had amalgamated with three other smaller Habitat locations and brainstormed some potential fundraising and marketing ideas for them.", "Interview Questions": "Tell us about a successful fundraising event that you organized."}, {"date": "6 Dec 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Habitat for Humanity (Santa Barbara, CA) in Feb 2016", "Interview Descriptions": "There was no interview for the internship, but the employer told me information their organization and the job description. The employer mentioned what they expect me to do for the internship.", "Interview Questions": "There was no interview question."}, {"date": "21 Mar 2016", "title": "Community Outreach Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Habitat for Humanity (Canton, OH) in Jan 2016", "Interview Descriptions": "I was emailed within a couple of days to go in for an interview the next week.  The interview was very informal.  Two girls interviewed me on a set of couches in a large, shared office.  They didn't ask me any questions that were difficult to answer.", "Interview Questions": "The girls who interviewed me did not seem to have a list of questions.  They mostly talked about Habitat for Humanity and what the person hired would do in this particular role, and then would just ask me something like, \"What do you think about doing that?\" or \"How would you feel about ___?\"  There were not any difficult questions, and I did not have many opportunities to speak, as most of the time was spent with the two girls explaining things that I had already read about on the website and in the job description.\r\n\r\nI had read about other interviews on Glassdoor and felt what was said about interviewing for Habitat was pretty accurate to my experience."}], [{"date": "6 Jan 2016", "title": "Construction Administrator Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Habitat for Humanity in Dec 2015", "Interview Descriptions": "Very relaxed interview. 3 way questions and answers. Manager and Director were very nice. \r\nInterview took about 40 minutes. Request for background check and drug test came about 10 days after initial interview.", "Interview Questions": "Previous experience?"}, {"date": "28 Aug 2016", "title": "Operations Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Kamloops, BC) in Sept 2015", "Interview Descriptions": "Normal. Very standard interview process. Typical questions like describe X situation and how you managed X. Group papal interview with final decision being the board of directors. The ED makes recommendations and then they vote.", "Interview Questions": "Typical questions easy to prepare for. Just need to show passion."}, {"date": "16 May 2019", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Habitat for Humanity (Toronto, ON) in Sept 2015", "Interview Descriptions": "Very casual. They have high turn over for roles. Were looking for people who would stay longer than a year. They were interested in my background and ability to lift over 50 pounds. Wanted to know my hobbies and my personality. To get along with the team. The interview was laid back and they did not have a lot of qualified candidates.. i'm assuming.", "Interview Questions": "How do you handle conflict between team members?"}, {"date": "29 Jan 2016", "title": "Business Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Habitat for Humanity (New Rochelle, NY) in Sept 2015", "Interview Descriptions": "Sat in the office until it was my turn to interview. When i did, they interviewed me  and wanted to see if I knew the organization and was interested in working for  a non for profit organization.", "Interview Questions": "What is Habitat for Humanity's mission?"}, {"date": "8 Dec 2015", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Habitat for Humanity in Aug 2015", "Interview Descriptions": "Went back for a second interview with Manager and Director, as well as board president. Interview was 20+minutes. Many questions regarding interacting with volunteers and prior employees, coming in as a new (and younger) assistant manager. Overall, good (but nerve-wracking) experience.", "Interview Questions": "How would you deal with a disagreement with a volunteer that has been here for a while? A Customer?"}, {"date": "4 Jan 2017", "title": "Monitoring and Evaluation Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Habitat for Humanity (Nairobi) in Aug 2015", "Interview Descriptions": "Short interview on phone. Followed by Face to face, with three members of the project team, whom if i got the job would work with. The three members each asked me a set of questions one after the other. Some of the questions asked was if i ever worked in an NGO, and how my experiences will add value to the organization. I was then given time to ask questions and concerns.", "Interview Questions": "How good are my interaction skills?\r\nComputer and reporting skills"}, {"date": "6 Oct 2015", "title": "Operations Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at Habitat for Humanity (Austin, TX) in Jul 2015", "Interview Descriptions": "We went and had coffee, discussed the role and whether or not I was a fit for it. It was determined that I was and now I sit here at my desk typing this. I really don't have much to say but I have to hit a 30 word min. It was very informal, as are most interviews in real estate development.", "Interview Questions": "informal interview"}, {"date": "19 Jun 2015", "title": "Director of Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity", "Interview Descriptions": "There was a Phone call first that latest about 5 minutes. I was then asked to a face to face meeting with the senior director. The interview was not at all what I expected. I had worked with habitat before as a volunteer and i felt like they were unprepared for me. They asked me very basic questions. Nothing specific to my past experiences or how I could fit this position. I was not impressed.", "Interview Questions": "What can you contribute here?"}, {"date": "12 Oct 2015", "title": "Warehouse Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Habitat for Humanity (Casselberry, FL) in Jun 2015", "Interview Descriptions": "It was quick and very personal. The interviewer made you feel at home. I was asked why I wanted to work there, if I knew what Habitats goals were, what makes me think I'm suited to work this job. I was also asked about my background/things listed on my resume.", "Interview Questions": "Why would you like to work for the Habitat ReStore?"}, {"date": "25 Jan 2016", "title": "Retail Sales Associate Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Habitat for Humanity (Cary, NC) in May 2015", "Interview Descriptions": "Management explained history and culture of company and explained the job role. Introduced to other team members as well as the facility. Manager provided feedback and answered questions in a very pleasant informative manner.", "Interview Questions": "Why volunteer?\r\nWhy volunteer here?\r\nIdentify past experiences that relate?\r\nExplain experience in working closely with others?\r\nidentified shifts, hours available."}], [{"date": "4 Jul 2019", "title": "Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Dallas, TX) in Apr 2015", "Interview Descriptions": "within few days i applied online, I did phone interview with CFO.  Few days later, in person interview with CFO.  Few days later, in person interview with executive director.", "Interview Questions": "Reason for applying for the position"}, {"date": "19 Feb 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 4 days. I interviewed at Habitat for Humanity (Saint Paul, MN) in Apr 2015", "Interview Descriptions": "Met with a supervisor to explore interests and see if there were projects that would benefit both parties. The interview itself was very laid back and mostly used to determine areas of need within the organization and how I might best use my skills to help them.", "Interview Questions": "What are academic projects you've worked on in the past year?"}, {"date": "3 Jan 2018", "title": "Driver Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Habitat for Humanity (McDonough, GA) in Apr 2015", "Interview Descriptions": "The store needed employees so the hiring process was quick and incredibly easy and friendly. I met with two people overall, one from HR and another was my store manager. They sat me in a room in the store I was working and the atmosphere was light and relaxing.", "Interview Questions": "What is important to remember when you go out on the truck and meet donors face to face to pick up donations?"}, {"date": "30 May 2015", "title": "Capacity Development Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at Habitat for Humanity (Bangkok) in Mar 2015", "Interview Descriptions": "The first round of interview was just a basic HR interview asking why i wanted the job and what skills i had to handle the job. Though it ended positively i did not hear back from them for a month. The second round interview was at their office. Two out of three panelists joined and then one of them left midway! The questions they asked were all about my past experience to see how it would fit into their requirements. They were pleasant and it felt more like having a conversation. After the first panel there was another panel where again only one out of two people joined....it was very basic and conversational. However they did not bother to get back on the results for about 2 months.", "Interview Questions": "what is your experience in capacity building?"}, {"date": "31 Dec 2016", "title": "Retail Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Habitat for Humanity (Denver, CO) in Mar 2015", "Interview Descriptions": "A short interview with the store manager of the store I had applied for. The interview was short and sweet because the staff at Habitat already knew what my skills were.", "Interview Questions": "What can you do for the company?"}, {"date": "23 Mar 2015", "title": "Marketing Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Habitat for Humanity (Atlanta, GA) in Mar 2015", "Interview Descriptions": "I had a phone screen with Habitat for a marketing director position. The human resources rep with whom I spoke was very good. He described the position and was willing to talk about the culture. He asked standard questions for a phone screen style interview, including what I already knew about Habitat for Humanity. Also asked about why I'm thinking of leaving my current job.", "Interview Questions": "Asked me about my strengths and for an example of where I applied that strength."}, {"date": "21 Sept 2017", "title": "Mortgage Servicing Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Atlanta, GA) in Mar 2015", "Interview Descriptions": "1. Phone interview with hiring manager- very informal \r\n2. Face to Face with hiring manager and HR-formal  but not hard just went over past experiences and how it related to position I was applying for\r\n3. Face to Face with VP -Simple for like a conversation to see if I would fit in \r\n4. Face to Face with CEO- Just a formality", "Interview Questions": "Describe a time you had to handle multiple projects at once?"}, {"date": "26 Mar 2015", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Habitat for Humanity in Mar 2015", "Interview Descriptions": "Applied online received a phone call the next day. Called back the next day had a 15 minute interview. Pay was well below average even for a non profit. I read the over reviews and they are accurate.", "Interview Questions": "Why non profit?"}, {"date": "3 Apr 2015", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 days. I interviewed at Habitat for Humanity (Aurora, IL) in Mar 2015", "Interview Descriptions": "I was initially called and he wanted to do a phone interview.  I had time when he called, but that didn't give me any time to prep.  I was asked to come in two days late for an interview with the general manager.  I got there 10-15 min early (seemed like I was inconveniencing him by being early) we did the interview. And even though I was told and the posting said it was a full time position,  the manager said it was part time.  He also made me full or the application again.", "Interview Questions": "what do you dislike most about your current job?"}, {"date": "22 May 2017", "title": "GIS Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Habitat for Humanity (Dallas, TX) in Feb 2015", "Interview Descriptions": "I got an email for an on site interview with options for interview time. There are four people interviewed, the atmosphere is not easy going. After one week, I sent an email asking for the result and get a positive answer.", "Interview Questions": "Introduce yourself and what do you know about GIS."}], [{"date": "4 Sept 2016", "title": "Accounting Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Habitat for Humanity (College Station, TX) in Feb 2015", "Interview Descriptions": "Very friendly environment.The stuffs were welcoming and friendly as well. The hiring manager only asked me a few questions about myself and career goals and told me I was hired right then.", "Interview Questions": "About myself, my career goals"}, {"date": "24 Sept 2015", "title": "GIS Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Habitat for Humanity (Dallas, TX) in Feb 2015", "Interview Descriptions": "Their process is simple. Probably due to it is an intern, not so competitive compare to a real job. One round interview with their manager, HR and two other staffs.", "Interview Questions": "Most of questions are related to technics. They are trying to figure out if you have the skills to complete their daily jobs."}, {"date": "1 Jul 2015", "title": "Development Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Habitat for Humanity (Cincinnati, OH) in Dec 2014", "Interview Descriptions": "There were 2 in-person interviews scheduled. One was with the direct supervisor for the position and the other included the HR manager. Both interviewees were very nice and made it the process comfortable.", "Interview Questions": "Why Habitat?"}, {"date": "7 Nov 2014", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Habitat for Humanity", "Interview Descriptions": "I had applied via the career services department at my university, where they did the first round of interviewing. The people who made it to the second round were then interviewed by Habitat for Humanity directors at their offices. They were really good at communicating with me before my interview. When I arrived and got settled into the meeting room, everything went smoothly. They're really nice and willing to answer any of your questions.", "Interview Questions": "There weren't any unexpected questions."}, {"date": "10 Oct 2018", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Habitat for Humanity (Atlanta, GA) in Nov 2014", "Interview Descriptions": "First round, phone screening with an HR rep, basic questions. Second round, phone interview with boss and team. More detailed questions and opportunity to engage. Third round, in-person at the office with both HR and Boss/team.", "Interview Questions": "Pretty standard questions - strengths/weaknesses, why do you want this job, what ideas do you bring to the table."}, {"date": "11 Dec 2014", "title": "Truck Driver/Donation Pick Up Driver Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 weeks. I interviewed at Habitat for Humanity (Dade City, FL) in Oct 2014", "Interview Descriptions": "I applied at a local job fair. Was given an on the spot interview. The interview was brief and the person interviewing me told me they'd give me a call in a week or so. Two weeks go by and then I'm finally called back and given the first of two interviews. I was asked typical questions about my background and driving record. Told them everything was clean. The person interviewing me seemed impressed and said they'd call me soon about a second interview. Another two weeks go by and I'm called again for the second interview. This time I'm interviewed by a different manager. I'm pretty much asked the same questions all over again. Strangely I'm also asked questions that have absolutely nothing to do with the job I'm applying for.", "Interview Questions": "Asked questions about experience that was irrelevant to the said job I had applied for."}, {"date": "5 Oct 2018", "title": "Marketing Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at Habitat for Humanity (Cleveland, OH) in Oct 2014", "Interview Descriptions": "After submitting resume and cover letter, the first interview was with director and I received a tour of the operations. They requested to see samples of my work. The second with representatives of several departments.", "Interview Questions": "Why did you choose to apply to the organization?"}, {"date": "9 Sept 2014", "title": "Social Media Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Habitat for Humanity", "Interview Descriptions": "job was posted on kijiji, application process to time of call for interview was at least 2 weeks, interviewed before Christmas holidays and wasy noit hired on until early January, was pretty painless after that", "Interview Questions": "nothing out of the ordinary"}, {"date": "1 Dec 2016", "title": "Real Estate and Construction Project Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Habitat for Humanity (New York, NY) in Aug 2014", "Interview Descriptions": "Scattered, lengthy (3+ interviews over a 2+ month period), and deceptive. Managers did not reveal that the organization was having serious senior management troubles that left the NYC office without a CEO for over a year.", "Interview Questions": "Have you had prior affordable housing experience?"}, {"date": "28 Jul 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "Started as volunteer and got to know the organization. Researched the company. Met with the staff and work-sites. No need to meet with the BOD for this position. Gave me the basic job functions.", "Interview Questions": "N/A"}], [{"date": "11 Jul 2015", "title": "Construction Volunteer Facilitator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Habitat for Humanity in Jul 2014", "Interview Descriptions": "I applied online and was contacted a week later for a phone interview.  Phone interview consisted of questions about previous work experience, willingness to participate in educational activities and workshops outside of construction work. I was asked mainly about previous leadership and volunteer management experience. Half of the interview contained questions  about me and the other half was informational about the position and company.", "Interview Questions": "What are your strengths?"}, {"date": "5 Jun 2014", "title": "ReStore Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Habitat for Humanity", "Interview Descriptions": "You will have to meet the a panel of store manager, Human Resources, Resource director, Business analyst. Be prepared to discuss your work history, management style, your strengths and weaknesses, your plans to change the culture and work with volunteers.", "Interview Questions": "Where do you see yourself in 5 years."}, {"date": "1 Apr 2015", "title": "Development Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Habitat for Humanity in Jun 2014", "Interview Descriptions": "The interview process was very quick. I was contacted for an interview and within a week, I had Skyped with two employees and was offered the position. This was several months after applying though. The Skype interview was casual and more conversational. They were very friendly and the questions were relatively predictable.", "Interview Questions": "How do you deal with multiple projects at once?"}, {"date": "25 May 2014", "title": "Video Editor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "It took a long time to go through the hiring process, but it paid off in the end. People were very friendly and gave me a good idea of what to expect with the job. I interviewed and met with almost everyone on the creative team before being offered the job.", "Interview Questions": "Why work for an non-profit?"}, {"date": "29 May 2014", "title": "Specialist- Volunteer Operations Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity in May 2014", "Interview Descriptions": "I applied a week ago and received a phone call from the hiring department. She was very nice and wanted to go over a few questions with me. The phone interview was formal with a casual tone. I was asked about my abilities, experience, and what I would be expected to add to the organization. From there we went over my salary expectations, and benefits package. We went over my availability and am expected to hear from them in the next few days about a possible second interview, in person, with the youth departments hiring person.", "Interview Questions": "No unexpected or difficult questions. Just know what you bring to the table and you'll be fine."}, {"date": "27 Mar 2016", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Habitat for Humanity (Atlanta, GA) in May 2014", "Interview Descriptions": "Had a phone interview with HR and two weeks later contacted for an in person interview with HR two person team, Finance Director and three other managers in finance.  Was there for about four hours.  \r\ndidn't hear from them again until maybe 2-3 weeks later with a job offer which I accepted.", "Interview Questions": "Not difficult, the usual questions about your background and what you are looking to do."}, {"date": "18 Apr 2014", "title": "Volunteer Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity", "Interview Descriptions": "Interviewed for a Volunteer Coordinator position. Went right to an in-person interview without conducting a phone interview. The staff seemed competent and friendly - low pressure.  They ended up hiring internally so it seemed a bit like they were interviewing a few people to go through the motions. The job sounded like it was primarily paperwork/data entry focused due to their high volume of volunteers. I was more interested in the interaction aspect.", "Interview Questions": "Asked the usual - How have you handled a difficult situation with a volunteer, What are you most/least excited about, what motivates you...no curveballs. "}, {"date": "30 Mar 2014", "title": "Resource Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Habitat for Humanity", "Interview Descriptions": "Received an email from the ED requesting a phone interview which occurred the following week.   Very friendly, knowledgable 35 minute phone interview followed by an in person with director of finance.", "Interview Questions": "N/A"}, {"date": "3 Jun 2015", "title": "Senior Specialist, Knowledge Sharing Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at Habitat for Humanity (Atlanta, GA) in Apr 2014", "Interview Descriptions": "The interview process is very slow going. In the company's defense, the HR process involves upper level management, including the CEO, reviewing every candidate for every position. In some ways that is nice that everyone is involved in hiring, but it does slow the hiring process down very much. \r\n\r\nI interviewed with HR for a position in April by phone, followed by another phone interview with the hiring manager in May. I was told it would take a couple of months before I would hear back. Finally, I was contacted in late July to interview in person in August. Once I interviewed in person, it took another 6 weeks for an offer to be made. \r\n\r\nI understand that my interview process took slightly longer than others, but don't be surprised if interviews take months to completed. At least the HR team usually informs you the steps along the way so you are not caught off guard.", "Interview Questions": "The questions were pretty typical of any interview. The thing they seemed to focus on for me was my willingness to learn new technologies and how the position would challenge me or help me grow professionally."}, {"date": "16 Aug 2015", "title": "Develoopment and Marketing Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 days. I interviewed at Habitat for Humanity in Apr 2014", "Interview Descriptions": "I interviewed at a profession placement company that then sent my resume to Habitat. My resume was sent to Habitat and the interview schedule quickly. It was a temp to perm position. I was hired hired the next day.", "Interview Questions": "Competency in Raiser's Edge."}], [{"date": "31 Jul 2015", "title": "Management Assistent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Habitat for Humanity (The Hague) in Mar 2014", "Interview Descriptions": "Ging super snel, binnen een week wist ik al of ik de baan had of niet. \r\nOnline gesolliciteerd en kreeg direct een ontvangstbevestiging en dat er binnen 2 werkdagen contact met mij opgenomen zou worden. 3 dagen later maakten we een afspraak voor de sollicitatie en die had ik met twee werkgevers; Operationeel Manager en de Management Assistent.", "Interview Questions": "Veel vragen over je persoonlijkheid en wat je ambities zijn. \r\nWaar zie jij jezelf over 5 jaar, hoe reageer je in stressvolle situaties?"}, {"date": "26 May 2016", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Habitat for Humanity in Mar 2014", "Interview Descriptions": "Reviewed qualifications and skills, informative on responsibilities of the position. Interest in HfH was questioned in the interview and the necessary ethical responsibilities of the position were also reviewed. Interview was casual yet be prepared to discuss your skills and qualifications. Second interview is likely necessary if you are being considered.", "Interview Questions": "What experience do you have with non-profits?"}, {"date": "16 Mar 2018", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity (Troy, OH) in Mar 2014", "Interview Descriptions": "First interview was pretty informal, one on one with the Executive Director.  2nd interview 1 week later was with the E.D. and Board President and contained some good behavioral type questions.", "Interview Questions": "What would you do if you came to work and there was no enough manpower to run operations?"}, {"date": "7 Jul 2014", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Habitat for Humanity (Seoul) in Feb 2014", "Interview Descriptions": "applying resume by online, 2 times interviews in a week. las result will get in a month. no salary negotiation. if you want to know, you have to ask first", "Interview Questions": "talking about future strategy for NGOs"}, {"date": "28 Jan 2014", "title": "Web Content Editor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "The interview process took a while.  I applied for the job online and then didn't hear back from anyone for a couple of months.  After that, though, things moved pretty quickly.  I interviewed with 5 people, I think -- the communications director, a few editors, and the web developers.", "Interview Questions": "N/A"}, {"date": "3 Dec 2013", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "The interview was brief and in person.", "Interview Questions": "The interviewer kept to standard interview questions regarding my competencies and job responsibilities. Nothing our of the ordinary was discussed. "}, {"date": "20 Apr 2016", "title": "Family Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. I interviewed at Habitat for Humanity (Winston-Salem, NC) in Nov 2013", "Interview Descriptions": "It was a wonderful experience. The Director of Family Services interviewed and hired me. We had an hour interview.   In which, we spoke on my  many skills and work experience. We immediately took a liking to each other and seem to have a connection. We both knew this was the job for me.", "Interview Questions": "Work ethics seem to be very important in the company."}, {"date": "5 Aug 2015", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Habitat for Humanity (Flint, MI) in Oct 2013", "Interview Descriptions": "The interview process went as follows... Walked in the door. Asked to see the General Manager.  Talked with him  for about ten minutes.  He asked if I was willing to work today.  I said yes.  I was hired on the spot as a volunteer for Habitat for Humanity ReStore.", "Interview Questions": "am I a hard worker?"}, {"date": "26 Jan 2014", "title": "Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 months. I interviewed at Habitat for Humanity (Lorain, OH) in Oct 2013", "Interview Descriptions": "The interview process was through Mature Services. It was comprehensive as to my employment experience, my expectations for employment, and how I would be assisted in future employment opportunities with Mature Services and For Profit organizations.", "Interview Questions": "There were none per se, but I did feel that I would like to stay with the Not For Profit organizational opportunities available. At my age I do not really want to be employed in other venues."}, {"date": "28 Aug 2013", "title": "Construction Supervisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Habitat for Humanity", "Interview Descriptions": "I had two interviews both with several interviewers asking questions.  Members of the board of directors, executive director, and construction committee members were all there.", "Interview Questions": "How would you conduct a days work with 30 volunteers, what would that day look like if your were framing/or painting/or interior work."}], [{"date": "20 Apr 2017", "title": "Director of Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Habitat for Humanity (Bay Saint Louis, MS) in Jul 2013", "Interview Descriptions": "Met with the Board of Directors after submitting a resume strong with community activism. This was at a Habitat affiliate not the Habitat International which is somewhat of an umbrella organization.", "Interview Questions": "Why did I want to work for a non-profit.\r\n  "}, {"date": "27 Mar 2015", "title": "Accounting Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Habitat for Humanity (Tacoma, WA) in Jun 2013", "Interview Descriptions": "Quick and easy. I was interviewed by the HR manager as well as the CFO for the local affiliate. Amazing people. Made the interview really informal and comfortable. They asked me basic questions about my skills with the Microsoft suite especially including excel. They are looking for someone who is willing to learn and were very open about the training. Everyone is ready and available if you should require any assistance on a task.", "Interview Questions": "Are you an good with excel (i.e. pivot tables)"}, {"date": "16 Apr 2015", "title": "Construction Crew Leader Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity (Los Angeles, CA) in Jun 2013", "Interview Descriptions": "The hiring process was relatively fast. I applied online and received an email the next day. The interview was on the easy side and felt more like a conversation than an interrogation. Leading skilled and unskilled volunteers was a major component of the job and was highlighted thoroughly.  I was offered the position within two weeks.", "Interview Questions": "Why a nonprofit vs. a private construction company?"}, {"date": "15 Apr 2013", "title": "Development Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Habitat for Humanity", "Interview Descriptions": "Conducted completely over phone interviews due to distance. First interview asked questions about my experience and a few personal questions. A few emails asking for more of my portfolio. A second interview was conducted with more leadership members present.", "Interview Questions": "Tell us a little about yourself"}, {"date": "2 Nov 2016", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Habitat for Humanity (Atlanta, GA) in Apr 2013", "Interview Descriptions": "I had several rounds of interviewing. I first spoke with an HR representative by phone then met in person with a panel of potential team members. After that, I met in person with head of department. The timing did not feel rushed and I enjoyed the opportunity to meet many people.", "Interview Questions": "What attracts you to this organization? How did you decide to apply?"}, {"date": "13 Aug 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity (Memphis, TN) in Mar 2013", "Interview Descriptions": "job was posted online, sent in resume got called in for interview. interviewed with one person. pretty straight forward questions. got a tour of the building & introduced to other employees. got an email with an offer a few days later.", "Interview Questions": "asked for samples of previous work and detailed questions about previous experience"}, {"date": "9 Jun 2015", "title": "Driver Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Habitat for Humanity (Los Angeles, CA) in Mar 2013", "Interview Descriptions": "I came to the place.  Talked to the manger at first, and gave them my resume as well as cover letter.  I flared it up a little bit, and made it look very good.  The manager gave me a call and wanted to meet in person and he was very helpful and nice during the interview.", "Interview Questions": "What type of pieces are these"}, {"date": "30 Oct 2015", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Habitat for Humanity (Huntsville, AL) in Mar 2013", "Interview Descriptions": "interview was long, but it was very professional. The process took about 45 minutes and was mostly me answering questions about leadership, and responsibility. It was a fairly lengthy interview but i thought it was well performed and i respected the two individuals who interviewed me.", "Interview Questions": "Give an example of when you had to lead a project."}, {"date": "29 Jul 2015", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Habitat for Humanity in Feb 2013", "Interview Descriptions": "Two interviews, low pressure, friendy and comfortable environment. Just two staff members, made me feel less nervous by how human and friendly they were. No long questionaires, no drug tests, all happened within 2 weeks.", "Interview Questions": "Problem solving"}, {"date": "4 Dec 2012", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity (Budapest)", "Interview Descriptions": "Very fast interview process. Written test and two face to face interviews", "Interview Questions": "What are my views on religion"}], [{"date": "27 Feb 2013", "title": "Paralegal Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 months. I interviewed at Habitat for Humanity (Atlanta, GA) in Oct 2012", "Interview Descriptions": "Applied online and immediately was called and had a phone interview with a member of HR.  Basic questions (why do you want this job? what are you doing now?)  Was called back days later and asked to come in for a face-to-face interview with three different attorneys.  I thought the interviews went quite well, and was in the main office for over three hours.  I followed up with the HR contact every other week for about a month and a half.  Was given cursory responses.  After about three months (and me finally just giving up on the job) I was told the company had decided not to hire anyone for the position.  I guess business is business but it would have been nice to have been at least given a \"thank you for your time and interest.\"", "Interview Questions": "Are you comfortable working in a Christian based workplace?"}, {"date": "1 Sept 2016", "title": "M & E Officer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Habitat for Humanity (Lilongwe) in Sept 2012", "Interview Descriptions": "I was called by phone to come attend the interview on a specified date and to bring along all my original copies of certification. I was then invited for the panel interviews where questions were asked and I responded. I was informed I will be notified of the results once the decision was made.", "Interview Questions": "Share your experience in the M & E field."}, {"date": "13 Jul 2012", "title": "Product Development Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Habitat for Humanity", "Interview Descriptions": "It was a phone interview, very intense. Asked detailed questions about how you work", "Interview Questions": "N/A"}, {"date": "20 Sept 2016", "title": "Program Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Habitat for Humanity (Americus, GA) in May 2012", "Interview Descriptions": "Phone screening by HR, then short phone conversation with hiring manager, then an in-person panel interview with manager and peers. Questions tended to be general. They asked for examples but did not drill down to follow-up questions. It is important to charm HR representative, as they provide a recommendation, but they know little about the job or wider office culture. It is also important to express revere for the Habitat mission and reputation, as it is valued above all by management. Flatter them by talking about your emotional connection to the mission, and you will have a far greater chance of being hired.", "Interview Questions": "What would a colleague say is their favorite thing about working with you? Their least favorite?"}, {"date": "3 May 2012", "title": "Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Habitat for Humanity (Austin, TX) in Mar 2012", "Interview Descriptions": "easy", "Interview Questions": "how many hours are you able to work a week?"}, {"date": "2 Jun 2012", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Habitat for Humanity in Mar 2012", "Interview Descriptions": "Started with a phone interview to reduce the number of applicants.  Then was given a panel interview.  Phone interview went extremely well in my view.  Then face to face interview also went well even though I felt a little nervous.  I prepared by going online and doing research on the non-profit organization as well as interview questions.  I felt prepared.  Was made to feel at ease with the interviewers and felt I did well.", "Interview Questions": "How well do you work with diversity with individuals."}, {"date": "10 Apr 2015", "title": "Volunteer Builder Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Habitat for Humanity (Yonkers, NY) in Jun 2011", "Interview Descriptions": "The person I spoke to was in charge of the entire site in Yonkers, NY. He was friendly and very happy to hear that I was interested in volunteering. I was immediately hired after speaking to him on the phone and was invited to come to the workplace as soon as I was free. Not a hard interview in any way, shape, or form.", "Interview Questions": "How did you learn about us?"}, {"date": "23 May 2015", "title": "Volunteer Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Habitat for Humanity in Mar 2011", "Interview Descriptions": "Phone interview and then two in person interviews; one with a panel. The phone interview was very basic and easy. The in person interview was casual and pretty laid back. When I got to the panel interview there was really only one person interviewing me so it wasn't clear why the others needed to sit in.", "Interview Questions": "What do you bring to the company? Why do you want to get involved with Habitat? How do you deal with stressful situations?"}, {"date": "13 Jun 2014", "title": "Head Cashier/Floor Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Habitat for Humanity (Cleveland, OH) in Jan 2011", "Interview Descriptions": "i volunteered there for 7 months prior to employment, I was offered the job based on my work ethic and the love of the mission..Habitat for Humanity hired me , I was elated, then administration hired someone who destroyed the whole atmosphere of a great lace to be involved with.", "Interview Questions": "would I settle for the small pay scale?"}, {"date": "7 May 2013", "title": "Marketing Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Habitat for Humanity (Atlanta, GA) in Aug 2010", "Interview Descriptions": "Initial phone screen with HR before brought into the office for interviews. Almost solid 8 hours of interviews (with a break at lunch time) with various staff (potential coworkers, hiring manager, manager's manager). I was an internal candidate so I knew everyone interviewing me, but was put through the same hiring process as external candidates.", "Interview Questions": "How does your degree (BA in English) apply to this position?"}], [{"date": "27 Aug 2014", "title": "President Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Habitat for Humanity (Jacksonville, FL) in Jun 2010", "Interview Descriptions": "Referred to affiliate by existing board member. No formal process for hiring. Was hired as the original employee at a very low annual salary. Board members were not exactly clear of their goals for the first hire. Because of this was able to develop my own organization", "Interview Questions": "None. Lack of clarity on job content was the major obstacle. Had to create my own direction during the interview. This worked since the measurable outcomes did not yet exist. "}, {"date": "16 Aug 2011", "title": "Development Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at Habitat for Humanity (Atlanta, GA) in May 2010", "Interview Descriptions": "I met with a group of six different people for about an hour each and had casual behavior based questions.  I had lunch with the hiring manager.  After the interview it took another couple weeks before the offer was made.", "Interview Questions": "Why non-profit?"}, {"date": "10 Oct 2011", "title": "ReStore Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Habitat for Humanity (Williamsport, PA) in May 2010", "Interview Descriptions": "Was contacted by Operations Director for interview.  Very pleasant person who conducted an enjoyable interview.  Asked me numerous manager and sales related questions.  Gave me a facility tour and introduced me to volunteers and the executive director. .  Also had other people waiting for interviews in the lobby.  The end result was that the monetary offer was far below what I needed to take care of my family and the offer was FIRM.  I also felt that he person they were looking for would have no ability to exercise creativity in the job.", "Interview Questions": "N/A"}, {"date": "23 Jun 2014", "title": "Construction Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Habitat for Humanity (Orlando, FL) in May 2010", "Interview Descriptions": "Interviewed by members of the Board of Directors. They were more concerned about my experience and did not do a great job of explain the role and job description. Only later was this explained by the fact that the B.O.D. was really not involved in the day to day of the affiliate. As such the affiliate was in disarray but this only became evident after being hired.", "Interview Questions": "There were no questions that caught me off guard or were unexpected."}, {"date": "4 Feb 2010", "title": "Controller Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Habitat for Humanity in Jan 2010", "Interview Descriptions": "The interview process consisted of an initial general phone interview followed by a 3 person panel interview.  The questions were general in nature with the exception of questions regarding accounting software conversions.  The Organization will be implementing MIP in the next 6 months and would like to hire someone with conversion experience.", "Interview Questions": "What type of experience have you had with accounting software conversions?"}, {"date": "24 Nov 2009", "title": "Executive Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Habitat for Humanity (Chambersburg, PA) in Oct 2009", "Interview Descriptions": "Initial communication: I sent resume and cover letter through USPS. Chair of search committee replied with interview date and time, leaving messages via email and voice mail.\r\n\r\nThe group did not seem to view the position as significant, as they scheduled a series of candidate interviews in consecutive blocks of 30 minutes each.\r\n\r\nMembers of the search committee were very pleasant. They stated that they were physically tired from the effort of holding up the organization and recognized a need for changed management style. However, they did not appear ready to professionalize the position. \r\n\r\nIn fact, they opened the interview with the statement that they were looking for full-time accomplishments on part-time hours.\r\n\r\nI was told that I came second. I would have liked the job, but it would have been very low-ball in terms of pay.", "Interview Questions": "What is Toastmasters (the volunteer organization mentioned on my resume)"}, {"date": "13 Mar 2011", "title": "Family Services Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Habitat for Humanity in Oct 2009", "Interview Descriptions": "Very simple. First interview was on the phone. Second was face to face. The third is with the whole staff.", "Interview Questions": "What experience do you have when it comes to working with low income families?"}, {"date": "21 Oct 2009", "title": "ETL Developer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Habitat for Humanity (Atlanta, GA) in Sept 2009", "Interview Descriptions": "It took about 4-5 weeks for HR to call me after submitting my resume. The interview was one on one with hiring manager. I had to call and send e-mail to ask about further interviewing and was finally informed that I was not being considered. Overall the experience was positive.", "Interview Questions": "What makes a good ETL design?"}, {"date": "15 Feb 2013", "title": "Office Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Habitat for Humanity (Lancaster, PA) in Jul 2009", "Interview Descriptions": "applied through state job bank, where opening was listed.  got a call for an interview, was hired on the spot.", "Interview Questions": "N/A"}, {"date": "12 Jun 2013", "title": "Development Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Habitat for Humanity (San Antonio, TX) in Jan 2009", "Interview Descriptions": "Position posted online, but not on organization website. Submitted resume and references which generated a response via telephone. A brief telephone interview was conducted, followed by reference checks. Face-to-face interview was held a few weeks later. Offer made within a couple of days and was contingent on clean background check.", "Interview Questions": "I do not recall any questions as being odd, unexpected or difficult."}], [{"date": "9 Jul 2011", "title": "I Was A Volunteer and They Offered Me A Position Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at Habitat for Humanity (Orlando, FL) in Jan 2009", "Interview Descriptions": "I was there to complete community service as a volunteer with Habitat for Humanity when they realized my skill set and offered me a position. I accepted and began to work with the company on the floor by selling and organizing incoming products.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "21 Aug 2012", "title": "Executive Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Habitat for Humanity (Ajwa Restaurant and marriage Garden) in Sept 2008", "Interview Descriptions": "I had anounce my retirement from the Habitat affiliate I was currently working for and was immediately approached by the Board Chair and ED of the nieghboring  affiliate.  We met the following noon over lunch.  The questions were very specific and much as to be expected.  I had had previouse history with this affilate and know all parties involved very well.", "Interview Questions": "Can You start the day following you retirement?"}, {"date": "21 Oct 2009", "title": "Resource Development Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at Habitat for Humanity (Newland, NC) in Feb 2007", "Interview Descriptions": "The hiring process was quite long and rather confusing. It consisted of several emails back and forth with the Executive Director, a 1:1 interview with the Executive Director, and a panel interview with members of the Board of Directors. I was also required to attend a board meeting with another candidate, which was rather unusual.", "Interview Questions": "Tell us about your previous fundraising experience...what percent of grants that you wrote were funded?"}]]