[[{"date": "25 May 2023", "title": "Director of Infrastructure Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of West Georgia (Carrollton, GA) in Nov 2022", "Interview Descriptions": "The first interview was a board room type interview with all IT Directors and VP. The 2nd interview was a classroom type presentation and interview with multiple IT staff. Overall, a very plesant experience.", "Interview Questions": "How would you implement DevOps"}, {"date": "11 May 2022", "title": "Tier I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of West Georgia", "Interview Descriptions": "The interview process was easy and flexible due to it being online and having an open schedule where you can record your responses at any time, with a deadline in mind.", "Interview Questions": "Why are you interested in this job position?"}, {"date": "9 Sept 2021", "title": "System Support Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of West Georgia", "Interview Descriptions": "It was overall about determining skills and your interest in working with a team. The interview was rather simple for me, but I was already well known around the University.", "Interview Questions": "What are some of the IT related experiences you have had?"}, {"date": "24 May 2021", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of West Georgia", "Interview Descriptions": "The interview was laid back and standard in the questions. A list of questions was used for the interview and consisted of about 10. The interviewer appeared knowledgeable and interested in the interview.", "Interview Questions": "What are some of the things on the description that interested you for the position? "}, {"date": "27 Mar 2020", "title": "Admissions Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at University of West Georgia (Carrollton, GA)", "Interview Descriptions": "It took about 90 days to hire for the position. A call to set up an interview, the initial phone interview, face to face interview and presentation with the entire admissions staff.", "Interview Questions": "What tangible assets do you bring to the team"}, {"date": "19 Nov 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of West Georgia (Carrollton, GA)", "Interview Descriptions": "The interview was very easy and laid back. The employers really just want to know that you are a good person and will complete your task. Be sure to bring examples of some of the work you have done(such as social media management) and it's useful to have on-campus references.", "Interview Questions": "What can you help us improve"}, {"date": "2 Aug 2019", "title": "ECampus Instructional Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of West Georgia (Washington, DC) in Jun 2019", "Interview Descriptions": "I applied for the position around late May 2019 and received an invitation for a phone interview. The phone interview went great and they panel informed me that I will hear back later that day should I be invited for the second interview which would be face-to-face. By 3 PM (estimate) I received an email asking me back for the face-to-face interview with 3 parts (1st- me and the interview panel, 2nd- group interview, 3rd- job-related presentation). The job-related presentation included 3 scenarios given by the team lead in which I needed to respond too and develop a powerpoint presentation. The second interview was conducted by Blackboard Collab (academic version of skype). Once the interview concluded both finalists were informed that we would hear back in a week regarding their decision as they wanted someone to start in July. I sent the panel a thank you email and offering additional time should they require more information etc. I received no response for about 3-4 weeks until I got an automatic email telling me that they went with another candidate option.", "Interview Questions": "Tell me about yourself "}, {"date": "25 Jun 2021", "title": "Resident Assistant (RA) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of West Georgia in Feb 2019", "Interview Descriptions": "The university conducts a Panel Interview with managerial staff and a group interview with the other applicants to see how individuals operate in a group setting. The group interview has a plethora of team challenge exercises that judge individual consideration and contributions to the group.", "Interview Questions": "How would you resolve a conflict between two residents?"}, {"date": "29 Sept 2020", "title": "Marketing Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at University of West Georgia (Carrollton, GA) in Aug 2018", "Interview Descriptions": "The interview process started with a resume submission, followed by an interview with the marketing coordinator and a social media assessment. After I was informed I got the job with a phone call from the marketing coordinator.", "Interview Questions": "Q: Here are a set of three pictures from events, how would you caption this to market the event?"}, {"date": "9 Feb 2020", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at University of West Georgia (Carrollton, GA) in Apr 2018", "Interview Descriptions": "Was reached out to by supervisor to see if I was interested. Was called in to interview shortly after. Fairly straightforward conversational interview with no trick questions. You’ll be informed on what your duties are and will be given a tour the same day", "Interview Questions": "How will you manage school & extracurriculars with this job?"}], [{"date": "16 Nov 2017", "title": "Mail Clerk Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of West Georgia (Carrollton, GA) in Nov 2017", "Interview Descriptions": "The questions were fairly easy. Mainly about my skills and what I can bring to the table. After I was showed around the mail room and met all the office ladies. In my opinion I was over qualified considering I have a bachelors degree but I over thought the questions and didn't give the best answers.", "Interview Questions": "Tell us about yourself"}, {"date": "25 Aug 2017", "title": "Departmental Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of West Georgia", "Interview Descriptions": "About 2-3 weeks after applying online, I received a call asking to schedule a phone interview for the next day. The phone interview lasted about 20-30 minutes with about 5 questions asked by at least 4 people. They let me know I'd receive a call back soon regarding the rest of the process, and called back within a day to invite me to an on campus interview the following week. They followed up with an emailed agenda and topic for me to present on. At that interview, I met with the employees in that department, gave my presentation,  took a typing test, and took a written test that seemed to mostly assess attention to detail. After that, I received a call about a week and a half later with an offer.", "Interview Questions": "What do you do when presented a task with little direction?"}, {"date": "4 Oct 2018", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of West Georgia (Carrollton, GA) in Mar 2017", "Interview Descriptions": "Interview process was very smooth. I enjoyed meeting the staff. My interview consisted of answering questions regarding my experience and background in my field. I enjoyed the entire process. Just be yourself and give honest feedback.", "Interview Questions": "What is your skill set "}, {"date": "18 Jan 2019", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of West Georgia in Jan 2017", "Interview Descriptions": "The interview was through skype and I was hired immediately following the interview, friendly staff, communicated to me the working environment, structured and organized, The interview was through skype and I was hired immediately following the interview, friendly staff, communicated to me the working environment, structured and organized,", "Interview Questions": "Tell me about yourself"}, {"date": "11 Jan 2021", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of West Georgia (Carrollton, GA) in Jan 2017", "Interview Descriptions": "Comfortable, Relaxed, With a panel of current RA as well as Housing Leadership asking various questions. Just want to gauge how you would lead and connect with residents within the hall.", "Interview Questions": "How would you promote community within your hall?"}, {"date": "4 Nov 2016", "title": "Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of West Georgia (Carrollton, GA) in Jan 2016", "Interview Descriptions": "Applied online through the Career Services website, contacted for an interview. The supervisor will ask you a couple of questions, basic questions, nothing too difficult.  You are usually hired on the spot or a few days later.", "Interview Questions": "Do you have any previous experience?"}, {"date": "2 Aug 2016", "title": "Policy Development Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of West Georgia (Carrollton, GA) in Jan 2016", "Interview Descriptions": "The process was a fair process based on experience and knowledge that can be contributed to the job. The expectation is to be poised to represent the University as the professional educational institution that it is.", "Interview Questions": "What knowledge can you contribute?"}, {"date": "18 Aug 2015", "title": "Departmental Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of West Georgia", "Interview Descriptions": "Interview was a panel interview but was very relaxed. Questions were not difficult, and you were given plenty of time to answer. Each interviewer looked you in the eye, and, also, each interviewer was very pleasant. Also, the interview was early in the morning, so you had the rest of the day left, and, with this, you could take a look around the campus. I was very pleased.", "Interview Questions": "How early would you arrive to assist the department?"}, {"date": "31 Mar 2014", "title": "Desktop Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of West Georgia (Carrollton, GA) in Nov 2013", "Interview Descriptions": "I had 1 interview for the job position. It was a small group of 3 members of ITS, we sat down for about 45 minutes where they asked me general questions over IT situations, workplace situations, and team situations and how I would handle them.\r\n\r\nThey were very nice and calm in the interview process, overall I'd rate it as a good experience with the company and obviously good results as I am now working with them.", "Interview Questions": "It was probably a questions pertaining to how I would handle a situation where it was a co-worker doing wrong and should I keep it to myself or notify my boss."}, {"date": "11 Dec 2014", "title": "Web Support Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of West Georgia in Jul 2013", "Interview Descriptions": "I applied online, received a callback from the hiring manager within a day or two of submitting the application. He briefly discussed the job to ensure that I was still interested. Afterwards he informed me that he would be getting a committee together for interviews and would contact me soon to schedule. During this time he made sure he kept me up-to-date regarding when the committee would be ready to schedule. \r\n\r\nThe scheduling was very flexible and there were no conflicts in a coming up with a mutual date/time to interview. The interview itself was about an hour or so. There was a panel of about 5 people from different areas within the ITS Department (including the hiring manager). Everyone was nice and friendly. The interview didn't feel too uptight. Some of the interview even felt more like a conversation versus strict question and answer, which is always more of a comfort.\r\n\r\nAfter the interview, I was shown around and introduced to a few people so this made me feel confident. I received a call back within a week or so with a verbal offer. Received official offer from HR within a week after the verbal offer.", "Interview Questions": "There was nothing too difficult. Most of the questions were behavioral type questions with a few regarding the experience as listed on your resume."}], [{"date": "6 Aug 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of West Georgia (Carrollton, GA) in Dec 2012", "Interview Descriptions": "I did not have a formal interview for my Graduate Assistantship but I had one for my Internship which I did before the Assistantship. The Internship interview was about 1 hour long and very detailed. A sample of my previous work was examined and the questions themselves were detailed yet clear.", "Interview Questions": "About my background and skills in writing/editing for PR and communications."}, {"date": "13 May 2015", "title": "Graduate Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at University of West Georgia (Carrollton, GA) in Aug 2012", "Interview Descriptions": "Laid back and casual, what the office managers are looking for is someone intelligent and creative who can solve problems without constant direct supervision. I came in and sat down with the department secretary over coffee and we discussed what the position involved and who the personalities in the department were.", "Interview Questions": "What was a problem you dealt with at a job before? Name one problem that you faced and how you addressed it?"}, {"date": "5 Nov 2015", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at University of West Georgia (Carrollton, GA) in Oct 2011", "Interview Descriptions": "A brief phone call with an invitation for a face to face interview. Very relaxed, all questions related to the environmental position. All references were contacted, background check also. The interview experience was not stressful.", "Interview Questions": "How have you handled conflict at work."}, {"date": "8 May 2013", "title": "Technical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of West Georgia (Carrollton, GA) in Jul 2011", "Interview Descriptions": "University posted this student job with Career Services. Applied via e-mail late in the summer as I was not available to work prior to then. Interviewed on-site later that week, which consisted mainly of a competence test. The test consisted of hardware identification and walking through certain procedures. I got e-mailed roughly 2-3 weeks later asking me to come by and complete paperwork to finalize the hiring decision.", "Interview Questions": "Identify this port (rear motherboard ports)."}, {"date": "26 Aug 2012", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of West Georgia (Carrollton, GA) in Aug 2009", "Interview Descriptions": "The interview process was very informal.  Met with the department chair and another professor over lunch.  Met with the Dean of the school on another occassion.  That was pretty much it.", "Interview Questions": "Tell me about yourself."}]]