[[{"date": "2 Apr 2023", "title": "Machine Learning Engineer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at IEEE", "Interview Descriptions": "The interview was very strict but very helpful. I liked the process and I felt like I was judged well. I would definitely get back there again. Would recommend to anyone.", "Interview Questions": "What was the concept of deep learning?"}, {"date": "20 Mar 2023", "title": "Senior QA Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IEEE", "Interview Descriptions": "Only the QA manager interviewed me. It was a contracting position. The initial offer was low but after negotiation, they increased the rate. The recruiting company was very helpful and supported me through the process", "Interview Questions": "Please tell me about yourself."}, {"date": "9 Mar 2023", "title": "Student Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at IEEE", "Interview Descriptions": "Goggle Meet interview - basis questions (introduction, why want to join, skill related to this position and why should we choose you etc) There were 5 people in total excluding myself", "Interview Questions": "introduction, why want to join, skill related to this position and why should we choose yo"}, {"date": "19 Mar 2023", "title": "Sales Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at IEEE (Manila, Manila) in Mar 2023", "Interview Descriptions": "The interviewer talked about the resume and then ask questions about yourself. There's a little chit-chat here and there. It was a laid-back interview but the questions flow naturally. There are also questions about sales and some pitch demo", "Interview Questions": "Why did you choose sales?"}, {"date": "6 Apr 2022", "title": "Event Organizer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at IEEE", "Interview Descriptions": "the interview process was so smooth, and beautiful the hiring team was so friendly and responded quickly, the place was wonderful and full of energetic people\r\n\r\nthe interview process was so smooth, and beautiful the hiring team was so friendly and responded quickly, the place was wonderful and full of energetic people", "Interview Questions": "What is your last experience?"}, {"date": "3 Mar 2022", "title": "Data Scientist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at IEEE", "Interview Descriptions": "Excellent introduction and verbal back and forth. The technical process using pseudo-code was also well done. The questions about group dynamics were also well thought out. Two interviewers were present during the video call.", "Interview Questions": "Q: asked about personal group dynamics and how one would respond to conflict."}, {"date": "11 Dec 2021", "title": "Volunteer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at IEEE", "Interview Descriptions": "It was great . not easy and not hard it is natural and there were group of people from different countries review the application then the interviewer had a remote session to ask about the problem solving techniques and past expertience", "Interview Questions": "How many volunteering Projects had you joined?"}, {"date": "26 Oct 2021", "title": "Interviewer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at IEEE", "Interview Descriptions": "Great interview! The hiring manager was very personable and easy to speak to. I’m looking forward to this work In an area that I’m truly passionate in; science & technology!", "Interview Questions": "Tell me about yourself? \r\nBased on company culture and administrative practices, explain how your experiences prepare you for this role? "}, {"date": "30 Sept 2021", "title": "Data and Analytics Business Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at IEEE", "Interview Descriptions": "Two steps. First interview with the manager and the next week a interview with the hiring manager. Interviewed Friday and got the offer letter monday. Easy and quick process. Basic interview questions and worked more like a conservation then an interview", "Interview Questions": "Where do you see yourself in 5 years"}, {"date": "30 Aug 2021", "title": "Marketing Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at IEEE (Piscataway, NJ)", "Interview Descriptions": "I got an in-person interview through a recruiter. When I reached the office, I had to check in with the front desk first.  Then the manager came out and took me to the interview room. The office setting was in cubical style with high walls. It's hard to see and interact with other co-workers unless you stand next to them. The interview process went about 40 minutes. They went through my resume and asked a lot of questions", "Interview Questions": "Why Do You Want to Work at This Company?\nWhy Do You Want This Job?\nWhy Should We Hire You?\nWhat Can You Bring to the Company?\nWhat Are Your Greatest Strengths?"}], [{"date": "11 Jan 2021", "title": "Editorial Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at IEEE", "Interview Descriptions": "I first received an email almost 3 months after I had applied. Following the email, I had multiple phone interviews with HR recruiter, followed by in-person interview and skills test, followed by in-person interview with direct manager, followed by in-person interview with direct manager's manager.", "Interview Questions": "Why are you interested in working at IEEE."}, {"date": "16 Jun 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IEEE (New Brunswick, NJ) in Jan 2021", "Interview Descriptions": "With a team of people who were volunteers and staffers.  It took 2 hours and had to take several tests not associated with the position.  But luckily it all went very well.", "Interview Questions": "Best thing I liked about my former job"}, {"date": "18 Apr 2022", "title": "Social Media and Email Marketing Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at IEEE in Jan 2021", "Interview Descriptions": "The interview was three parts, with each part being about an hour. The first interview was with two people in HR, the second interview was with two people in the marketing/ communications department and the last interview was with another two people in HR. \r\n\r\nThe people I spoke to that I would be working with directly liked me and seemed impressed with my work. But for some reason, the two women in HR were annoyed that I said I am a good writer, even though that's one of the most important skills to have in a marketing & communications position. It's not surprising that this job had been listed for 6+ months. Dodged a bullet here.", "Interview Questions": "Why are you looking to leave your current employer? "}, {"date": "20 Dec 2020", "title": "Volunteer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at IEEE", "Interview Descriptions": "It was good lasts for 30 mins to 1 hour of 2 interviewers. started with introducing themselves and then asking Non-technical questions to see if I will be committed during the term or not", "Interview Questions": "Non-Technical Questions like why do you want to volunteer and how you gonna manage your time"}, {"date": "18 Jan 2021", "title": "Membership Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at IEEE (New York, NY) in Feb 2020", "Interview Descriptions": "I had a phone screening interview which lasted roughly 15 minutes. Consisted of checking certain things on my resume, asking basic experience and knowledge questions. About a week later I had an in-person interview with the main supervisor. The office was quite empty, quite, and lots of construction to the main building. I did not feel as though my interviewer was entirely present, I felt like they did not like that I brought in an outside drink with me, and when asked about my experience there were areas that I had left out of my resume that had come up. The experience wasn't related to the position, but interviewer seemed to think I was silly for not including my experience at a lobbying firm on my resume.", "Interview Questions": "Tell be about a time when you developed a program that drove an increase in membership?"}, {"date": "1 May 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at IEEE", "Interview Descriptions": "Applied online and was contacted a later by HR for a phone interview with Hiring Manager. After the interview, I was contacted around a week later with the internship offer", "Interview Questions": "Why do you want to intern at IEEE?"}, {"date": "18 Nov 2022", "title": "Senior Web Developer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at IEEE (Piscataway, NJ) in Mar 2019", "Interview Descriptions": "Phone screen, then technical interview. Technical Interview consists of a panel. Around 1 hour of getting questions from the panel and one coding exercise. Using Codepen, Zoom. Most of it was the questions from the panel", "Interview Questions": "What is zonejs in Angular"}, {"date": "25 Jul 2017", "title": "Open Source Community Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at IEEE in Jun 2017", "Interview Descriptions": "Applied online. A few weeks later I received an email invitation to a Skype interview with the hiring manager. The conversation was pleasant and I felt like both of us had a common understanding of the job and the potential for the position as this is a new project within ieee. I know others were being interviewed and it is likely other candidates were a better fit. Either way, that Skype conversation was the last communication I had, which is disappointing. EDIT: I finally received word 6 weeks later that I was not selected. I'm okay with that for the reason already stated, but disappointed that it took so long to send a form email.", "Interview Questions": "What is your experience working with open source software communities?"}, {"date": "12 Oct 2017", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IEEE (Piscataway, NJ) in May 2017", "Interview Descriptions": "I received the email for an on-site interview two weeks after submitting the online application. It was a panel interview with three members of the team in which the position was opening. The process went professionally casual and smoothly. A week after, I was informed via email not being considered for the opening.", "Interview Questions": "Why do you apply this position?"}, {"date": "28 Jan 2018", "title": "Volunteer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at IEEE (Visakhapatnam) in Jan 2017", "Interview Descriptions": "it wasnt that difficult to be a part of this. I just maintained my cool and answered whatever i felt like. The recruiter being pretty good has helped me learn new things from those few minutes itself.", "Interview Questions": "Why do you want to be a part of IEEE"}], [{"date": "14 Dec 2016", "title": "Video Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2+ months. I interviewed at IEEE (East Greenbush, NY)", "Interview Descriptions": "I had a great experience interviewing with IEEE GlobalSpec. The employees are extremely friendly and everyone greets you with a smile. \nThe first step was a phone interview. After that I went in for an in-person interview where I met with the employee I spoke to during the first phone interview and another employee in that department. Next was a phone interview with a supervisor from that department. And the about a week later I received an offer. I applied in late October and received the offer in early December.", "Interview Questions": "Have you ever worked with Final Cut Pro?"}, {"date": "10 Jan 2017", "title": "Client Services Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at IEEE (New York, NY) in Dec 2016", "Interview Descriptions": "First interview was a phone interview that lasted a little more than one hour.  It took about 3 weeks from the title I applied to get the interview.  About two weeks later, I heard from HR and I will be having a in person interview.", "Interview Questions": "Asked about my willingness to travel overseas"}, {"date": "19 Sept 2016", "title": "Product Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at IEEE (Piscataway, NJ)", "Interview Descriptions": "There was a phone interview followed by 2 panel-style in-person interviews. The people interviewing had very little knowledge about the position. There was a standard set of questions given to each person applying for the position. There was very little opportunity to \"go off script.\" The process took several months to complete.", "Interview Questions": "Basic questions based on past experience."}, {"date": "1 Feb 2016", "title": "IT Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 1 week. I interviewed at IEEE", "Interview Descriptions": "Fairly Routine, Single Shot Interview with Hiring Manager. Seemed more like a personality fit than an assessment of technical ability. I was also assessed by a consulting partner during the process.", "Interview Questions": "What do you think of Microsoft?"}, {"date": "25 May 2016", "title": "IEEE Student Barnch Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at IEEE (Asyut) in Dec 2015", "Interview Descriptions": "I find the application in the facebook page of IEEE AU Student Branch then Apply application then interview with a questions we know in all interviews as introduce your self and tell me the skills you have and weakens and strength.", "Interview Questions": "what's your weakness?"}, {"date": "17 Nov 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at IEEE", "Interview Descriptions": "Easy process from HR to management. Able to meet with multiple people at different levels to get an understanding of the scope of the department. Able to do entire interview process in a single day.", "Interview Questions": "Asked about my experience"}, {"date": "20 Oct 2015", "title": "Contact Center Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 3 months. I interviewed at IEEE (Bengaluru) in Jul 2015", "Interview Descriptions": "The position was for Bangalore and there were 5 rounds(which was not informed to candidate),1 F2F @ Bangalore,2 rounds Skype and 2 other were online tests .The whole process took around one and half months  and to get the result/feedback it took another one and half month i.e totally 3 months.But in JD it was mentioned as urgent opening.", "Interview Questions": "Questions were based on the current job experience ."}, {"date": "23 Jun 2015", "title": "Editor, Document Developer (Standards Department) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at IEEE (Piscataway, NJ)", "Interview Descriptions": "First phone call and meeting with HR; needed to fill out an online application in the HR office so bring your work history with you. Once complete I met with hiring manager for about 45 minutes and was also given a skills test. A second interview was peer, scheduled with folks who were to be my coworkers. A third interview was attempted, to meet with the head of the department, but this individual was traveling extensively at the time and, when too much time had passed, HR made me an offer anyway.", "Interview Questions": "Describe how you might handle a rejection to a request for cooperation."}, {"date": "12 Feb 2016", "title": "Senior Administrator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at IEEE (Piscataway, NJ) in Jun 2015", "Interview Descriptions": "Quick moving.  Applied on line and was contacted within 3 days for an interview.  I met with the team leader and was asked questions in line with my experience, my ability to travel, and my management skill. Interview lasted about an hour.  In the end I was offered a position other than the one I applied for", "Interview Questions": "Are you willing to travel"}, {"date": "22 Nov 2015", "title": "Help Desk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at IEEE (Piscataway, NJ) in May 2015", "Interview Descriptions": "Fairly simple interview process, I had met up with the Help Desk manager for a one on one interview. I was mostly briefed on the responsibilities of the internship and what to expect from the company. Later was questioned on my past work experiences with IT and the tools that I have used.", "Interview Questions": "Past job experiences and situational questions"}], [{"date": "15 Apr 2015", "title": "International Tax Accountant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at IEEE (Piscataway, NJ)", "Interview Descriptions": "I got into this company as a temporary worker. After about a year, the upper management approved to make my position become permanent. Once they posted the new position, I had to apply and interview for the position.", "Interview Questions": "Why do you want to work here?"}, {"date": "10 Apr 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at IEEE", "Interview Descriptions": "Email and phone call fro the hiring manager. Pleasant conversation, easy questions for an internships position. While the hiring manager canceled and we went back and forth a few times to actually get to the interview, it was worth it. I got the email offering me the position 5 days later.", "Interview Questions": "What is your future interest"}, {"date": "14 Aug 2019", "title": "Product Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at IEEE in Apr 2015", "Interview Descriptions": "Scheduled call then interview with two people. The managing director and director both interviewed me. They were asking questions about my training background and what I knew academically about L&D", "Interview Questions": "Educational background related to training and development"}, {"date": "15 Jun 2015", "title": "Associate Art Director Magazines & Newsletters Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at IEEE (Piscataway, NJ) in Apr 2015", "Interview Descriptions": "Very long process. First interview with HR at the end of March (this kind of screening is usually done on the phone with a recruiter-HR employee didn't know much about the position), second interview with hiring manager at the end of April, rejection letter finally came 6 weeks later. There was a homework assignment and an on-site assignment. The interviewer's questions followed a strict script.", "Interview Questions": "What did you do at your last position."}, {"date": "29 Jan 2016", "title": "Corporate Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at IEEE in Apr 2015", "Interview Descriptions": "Phone interview with two possible managers - review my resume and asked about previous experience. Very nice and it was hard talking to two people at once on the phone but very casual and very engaged", "Interview Questions": "How do you handle multiple projects at one time"}, {"date": "7 Dec 2014", "title": "Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at IEEE", "Interview Descriptions": "Process was inexplicably drug out over more than 3 months.  I'd written them off after a few weeks, but they kept calling me back, then left me hanging again.  What was so unexpected is that I was asked almost no questions at all.  I felt my interviewers were trying to sell the organization to me because they did most of the talking.  At times I couldn't get a word in edgewise.", "Interview Questions": "There were no difficult or unexpected questions.  There were practically no questions at all."}, {"date": "6 Feb 2015", "title": "Team Lead Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 1 day. I interviewed at IEEE in Dec 2014", "Interview Descriptions": "Interview was very casual. Interviewer asked a couple questions, then asked if I had any questions. Interview was held in small office space but did not feel threatened by lack of space or tense air. Just a very regular interview.", "Interview Questions": "What does an H Bridge do? "}, {"date": "19 Aug 2014", "title": "Contact Center Supervisor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at IEEE (Piscataway, NJ) in Aug 2014", "Interview Descriptions": "The hiring manager basically is wasting people's time.  By looking at my resume, she knew that I did not have heavy supervisor experience, and yet she called me for interview.  I thought for a moment that it may be a chance given.  But no.. when I get there, like 5 minutes, she just looked at my resume again and rejected me right there.\r\n\r\nIt was a waste of time interview.  She should have looked at the resume carefully first before calling candidates.  According to the hiring manager, she is calling all candidates who sent resume to interview.  I guess that she has nothing else to do.\r\n\r\nShe should have done phone interview first and filter all non-qualified candidates.  I could do a better job as hiring manager... It totally wastes my time.", "Interview Questions": "Have you done performance review for people who work under you ?"}, {"date": "3 Aug 2015", "title": "Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at IEEE (Piscataway, NJ) in May 2014", "Interview Descriptions": "First had a phone screening where the manager thoroughly described the company and department and then was asked to come in for an in-person interview a week later. Met with the hiring manager as well as 2 other members of the team. Things went very smoothly and everyone was very pleasant to be around. I had a great experience talking with them. The interview questions were generic.", "Interview Questions": "Have you ever been in a situation where a team member was not doing their job? "}, {"date": "6 Oct 2013", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at IEEE (Piscataway, NJ)", "Interview Descriptions": "Many levels of interviews conducted, by Director, Senior Manager, and co-workers.", "Interview Questions": "Don't recall at this time, most questions were related to resume."}], [{"date": "5 Sept 2013", "title": "Communications Associate Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at IEEE", "Interview Descriptions": "The interview began on topic and rather refreshing. However, it was not very long until the interview went off focus, as they had two other associates join in the questioning and conversing with the initial interviewer and myself. I felt that transition was abrupt and disorganized, as I had to repeat much of my prior answers. It was a circular, regressive interview rather than an expansive, focused, and interesting one. They were also vague on what tasks I would perform when I asked upon being prompted to inquiry anything at the close of the interview.", "Interview Questions": "There was a question about budgeting time between internal and external communications, which I found confusing since the position was listed as strictly internal communications. "}, {"date": "18 Nov 2012", "title": "Electrical Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at IEEE (Allahabad) in Jul 2012", "Interview Descriptions": "my interest in electrical field . I have some experiences in electrical field..", "Interview Questions": "business case"}, {"date": "29 Nov 2011", "title": "Accounting Supervisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at IEEE (Piscataway, NJ) in Oct 2011", "Interview Descriptions": "Interviewed with hiring manager. Second interview with hiring manager's supervisor and HR representative. Completed authorization for background check. It appears that they give preference to internal referrals. Most applicants are referred by existing employees.", "Interview Questions": "Why do you think your are qualified for the job."}, {"date": "6 May 2011", "title": "Engineering Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at IEEE (Vũng Tàu) in May 2011", "Interview Descriptions": "the hiring process is very long and difficult.", "Interview Questions": "what course did you like most ?"}, {"date": "7 Feb 2012", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 days. I interviewed at IEEE (Piscataway, NJ) in Oct 2010", "Interview Descriptions": "Overall relatively easy.", "Interview Questions": "Describe a time you emerged as a leader"}, {"date": "11 Jul 2012", "title": "Engineering Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at IEEE (Kottayam) in Jul 2010", "Interview Descriptions": "i was having my interview with the MD of the company, the most questions were to calculate your attitude towards the job, and personal character analysis.", "Interview Questions": "what is the best quality in you and why do you think you need a job like this?"}]]