[[{"date": "15 Mar 2023", "title": "Master Student Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Delaware (Newark, NJ)", "Interview Descriptions": "I emailed the professor i was interested in joining and attached my CV to it. Fews weeks later she replied and asked for a zoom meeting. I gave a presentation on my thesis and she asked me to apply for the graduate program", "Interview Questions": "Masters thesis based and past research experience mostly during internship"}, {"date": "25 Apr 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at University of Delaware (New York, NY) in Mar 2023", "Interview Descriptions": "The interview took place over online and it took around 2.5h and that's a long interview. I was very nervous but the professor was very friendly and gives me very friendly vibe and she asked me questions about my previous works. It goes well actually but out of nervousness, I forgot many important things. They started with pretty simple things like introduction and them they asked question regarding my interest. At the end, they told me that they will let me know the resuls.", "Interview Questions": "It varies depending on the professor"}, {"date": "17 Nov 2022", "title": "Blue Hen Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Delaware", "Interview Descriptions": "Super easy. Just looking to see if you can communicate well for others and give the talking points on the school and what it has to offer. Two levels. First with current students. Then another one with admissions staff who coordinate the program.", "Interview Questions": "Why did you choose to attend UD?"}, {"date": "28 Oct 2022", "title": "Student Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Delaware", "Interview Descriptions": "2 step process, with the first part being a written question section about past experience and background (club involvement etc.). Second was in person, and more conversational to gage people skills and personality, lasted maybe 30 minutes.", "Interview Questions": "Tell us about yourself and why you would benefit from this position"}, {"date": "8 Sept 2022", "title": "Philanthropy Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Delaware", "Interview Descriptions": "Two round interview with personality test, one in phone and once in person. Department was very courteous, professional and welcoming. Personality test was pretty friendly as well- it was the PI index. Overall very positive experience for a job seeker.", "Interview Questions": "Standard behavioral questions about strengths, challenges, teamwork, communication. A unique question was “what was something you expected us to ask you, but we didn’t?” "}, {"date": "13 Jun 2022", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Delaware", "Interview Descriptions": "The interview process is two rounds. The first interview is about how your experience ties into the position and asks if you have experience with the target for your position. Second is a presentation that you get the topic for in advance.", "Interview Questions": "When was a time that you worked with people different than you?"}, {"date": "3 Apr 2022", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Delaware", "Interview Descriptions": "Interview was general and included behavioral parts such as what would you do in such and such circumstances. Overall just brush up on your interviewing skills and go through the TA responsibilities beforehand.", "Interview Questions": "How would you respond to an injury?"}, {"date": "26 Apr 2022", "title": "Assistant Professor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Delaware (Newark, DE) in Mar 2022", "Interview Descriptions": "It was a one-day interview meeting with several colleagues, the dean, and the department chair. I presented a research talk for an hour following Q&A. I also had a meeting with the search committee who asked several questions, and a  meeting with graduated students", "Interview Questions": "What are your strengths and weakness?"}, {"date": "16 Feb 2022", "title": "Lab Tech Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Delaware", "Interview Descriptions": "Email then zoom interview. Interview panel consisted of three other people. They all took turns asking questions. Sometimes I’d get confused and think they were asking about something different but I think that was just me.", "Interview Questions": "How do you handle conflict?\r\nHow do you handle things not going well?"}, {"date": "14 May 2022", "title": "Associate Director Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Delaware (Newark, DE) in Feb 2022", "Interview Descriptions": "Process was timely and well organized. Everyone was friendly. The process was fairly transparent for the field. They had a good variety of stakeholders involved in the preliminary interview and follow up, but not too many.", "Interview Questions": "What I anticipated as challenges in the role."}], [{"date": "15 Jul 2022", "title": "Assistant Professor of French Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Delaware in Nov 2021", "Interview Descriptions": "I was invited to an interview on Zoom. Several members of the department that was hiring were there. Each one asked some questions, and they let me ask questions at the end.", "Interview Questions": "Why were you interested in this job?"}, {"date": "27 Sept 2021", "title": "Business Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Delaware (Jersey City, NJ) in Sept 2021", "Interview Descriptions": "A few days after applying I was contacted via email and we set up a date for the interview via zoom. I was interviewed by 4 persons from the department including the founder. I was very uncomfortable and I don't think I did well to impress them with my Caribbean background. Didn't hear back from them.", "Interview Questions": "Tell me about applications you have worked with"}, {"date": "11 May 2022", "title": "New Student Orientation Clerk Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Delaware (Newark, DE) in May 2021", "Interview Descriptions": "Zoom interview with two people from the department. Laid back and informative about the specifics of the position and hours. Followed by offer letter with all the details about the onboarding process. Both interviewers were very nice and were not intimidating at all.", "Interview Questions": "Would you be able to start (specific date) and work without days off through the summer?"}, {"date": "7 Jun 2021", "title": "Admissions Counselor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Delaware in Mar 2021", "Interview Descriptions": "Phone call to confirm the initial interest and round of the interview process. Two rounds of interviews on Zoom. The first one only was about 15 minutes which was interesting. 2nd one lasted about 2 hours.", "Interview Questions": "Tell me about yourself and interest in the position?\n"}, {"date": "27 Sept 2022", "title": "Campus Tour Guide Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Delaware in Mar 2021", "Interview Descriptions": "It was engaging and friendly, and the people I talked to were very welcoming. They sent me a spreadsheet and I picked a time slot, based on behavioral aspects, public speaking, and why I wanted the job", "Interview Questions": "What do you think about public speaking"}, {"date": "9 Feb 2021", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Delaware", "Interview Descriptions": "Straightforward interview process. Group interview which involves collaboration, and individual interview with a few staff members. Advice would be to not BS it- be genuine. They know when you're just saying what you want them to hear. And don't dominate conversation- invite others into it.", "Interview Questions": "How would you promote inclusion on the floor community?"}, {"date": "27 Oct 2020", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Delaware", "Interview Descriptions": "Friendly, positive, and kind employees interviewed me! I had a great experience. Everyone was really cheerful and nice and I loved talking to every single person. I highly recommend taking a position there if you are able!", "Interview Questions": "N/A"}, {"date": "9 Oct 2020", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Delaware", "Interview Descriptions": "Long gauntlets of interviews. You start with the individual interview which isn't too bad because you get breaks in between question segments. Then you go to the group interviews which requires you to work with people you've likely just met and that can be challenging but overall it was a fair process and I made some friends from it.", "Interview Questions": "How would you help a resident who's struggling with classes?"}, {"date": "26 Oct 2021", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Delaware in Sept 2020", "Interview Descriptions": "Not too complex of a process. Had to take the GRE and I had enough extra curricular activities in order to get accepted. Needed to maintain a solid GPA in undergrad", "Interview Questions": "Asked about your background and interests as a graduate student "}, {"date": "18 Sept 2020", "title": "Instructional Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at University of Delaware (Newark, DE) in Jul 2020", "Interview Descriptions": "It started with a contact from their recruiter.  I interviewed with her first.  Then there was a phone interview with the hiring committee and then a video interview with the hiring committee and almost the entire department.", "Interview Questions": "Review this online course and tell us what you would to improve it."}], [{"date": "8 Mar 2022", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Delaware (Newark, DE) in Aug 2019", "Interview Descriptions": "An email was sent with application form, which I filled out, and was emailed within a week to schedule an interview. Interview was laid-back and I was hired immediately after.", "Interview Questions": " What lessons have you learned from your previous jobs?"}, {"date": "3 Jul 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at University of Delaware", "Interview Descriptions": "Have you ever had experience in materials science.  The professor was understanding that I did not have much of a background in material science, however it was important that I had a stem background and was able to take and analyze data.", "Interview Questions": "Do you have any experience in material science."}, {"date": "2 Jun 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Delaware (Newark, DE) in Apr 2019", "Interview Descriptions": "Very laid back, asked about past experience and why I would want to be part of the laboratory. Asked extensively what equipment I had used, how long I'd be there for research, and let me know what my responsibilities would be.", "Interview Questions": "What past experience do you have in the laboratory."}, {"date": "11 Sept 2020", "title": "REU Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Delaware in Mar 2019", "Interview Descriptions": "I submitted my application materials online and there was not an interview process. They accepted me and after the fact I had a call with my assigned advisor. They work hard to select qualified students and work with the advisors to make sure your interests and experience align.", "Interview Questions": "They asked about my educational background. I was exploring a new field and did not have much background, but was not penalized for that."}, {"date": "28 Feb 2019", "title": "Fitness Supervisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Delaware", "Interview Descriptions": "Talked with hiring manager about health and work life balance in office. I first applied online and then talked with current employees to get some contacts. i reached out multiple times via email to gym staff and eventually was directed to the right person. manager was friendly and personable", "Interview Questions": "Why do you use the gym? are you a go getter/motivated? are you healthy? will you be willing to work opening shift (5AM)? will you be able to cover for other people if they cannot make it to work? can you enforce policies? "}, {"date": "3 Oct 2022", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Delaware in Jan 2019", "Interview Descriptions": "The interview process is a multi-stage process for hiring new employees. The interview process typically includes the following steps: writing a job description, posting a job, scheduling interviews, conducting preliminary interviews, conducting in-person interviews, following up with candidates and making a hire.", "Interview Questions": "Why do you Wanna be an RA?"}, {"date": "31 Jul 2018", "title": "Ambassador Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Delaware", "Interview Descriptions": "One Interview accessing customer service skills. Admins counselor asks you about your time at UD. your involvement your goals and your current schedule. Not much else after that. After the fact you usually get an email or call back with a yes or no.", "Interview Questions": "N/A Been too long for me to remember "}, {"date": "6 Apr 2020", "title": "IT Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 3 months. I interviewed at University of Delaware (Newark, DE) in Apr 2018", "Interview Descriptions": "Very comprehensive with several steps from phone, zoom to on site presentation and face/face interviews.  Had to prepare a 20-25 min presentation to show your vision and how you would accomplish it.  Also had to take questions and answers from the open forum.", "Interview Questions": "What's your goal for this position?"}, {"date": "13 Apr 2022", "title": "Graduate Research Assistant/Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at University of Delaware (Newark, DE) in Jan 2018", "Interview Descriptions": "You have to talk with the future advisor about your experience in research and the advisor will evaluate if it matches with what the group is doing.  It is preferable to have previous experience so you can produce more results in the research assistant position.", "Interview Questions": "What equipment do you have experience using? "}, {"date": "10 Feb 2021", "title": "Parking Enforcement Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Delaware (Newark, DE) in Jan 2018", "Interview Descriptions": "I was interviewed by the Supervisor of the group initially. For full time options I interviewed with leads from areas with in the group and the Department Manager. They described the role and the each asked question that were basically in the situation what would you do. The size of the department and expectations for the role were covered.", "Interview Questions": "Nothing stands out, mostly discerning work habits and explaining the position."}], [{"date": "11 Sept 2017", "title": "Peer Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at University of Delaware", "Interview Descriptions": "Simple, just need to submit writing samples and talk to the director. Writing samples have to be from college work that you have completed and you have to have a certain GPA to be considered.", "Interview Questions": "How do you view the writing process?"}, {"date": "6 May 2021", "title": "Front Desk Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at University of Delaware (Newark, DE) in May 2017", "Interview Descriptions": "Very easy. Friendly people. Interview was informal and asked no technical questions. Mostly wanted committed people. Hires out of high school if needed and hours are a little weird in the summer.", "Interview Questions": "When can you start working here?"}, {"date": "8 Feb 2018", "title": "Grad Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Delaware (Newark, DE) in Jan 2017", "Interview Descriptions": "One 15 Minute Interview and a follow up. Mostly background questions as well as a couple of behavioral ones. Not long at all. Very straight up and to the point. Specific departments have very different processes in many cases.", "Interview Questions": "Where do you see yourself in 10 years?"}, {"date": "16 Dec 2016", "title": "Writing Center Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at University of Delaware (New York, NY)", "Interview Descriptions": "They contact you inviting you to apply. Then you have an interview with one of the leaders and a current tutor. If you're accepted, you take a semester-long class as training.", "Interview Questions": "How do you edit your own papers?"}, {"date": "26 Mar 2018", "title": "Math Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Delaware (Newark, DE) in Aug 2016", "Interview Descriptions": "Interview was basically an explanation of what the job would entail. I was briefly asked about my teaching/tutoring experience. I also was asked about all of my math classes I had taken and how I had done in them. After an explanation of the job I was given an opportunity to ask questions.", "Interview Questions": "What would you do if a student asks you something you don't know the answer to?"}, {"date": "23 Jun 2020", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at University of Delaware (Newark, DE) in May 2016", "Interview Descriptions": "Simple. Focused on my relationship with the lab staff. 1 on 1 experience with the head of the lab. It was a relaxed setting. Mostly discussed how I did in the lab when I took the class and my experience with students/teaching. Also discussed course load to make sure I would have enough time to devote.", "Interview Questions": "Time commitments, current course load, experience with students, why I wanted to help"}, {"date": "6 Dec 2016", "title": "Biomechanics REU Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Delaware (Newark, NJ) in Apr 2016", "Interview Descriptions": "There was no phone interview or in person interview, I simply submitted letters of recommendation, an essay, and a resume online and received an offer.  I found out about the internship via an email from my academic advisor.  I think there is no phone interview because you have to submit two letters of recommendation, and because the professors hand pick the students they like.", "Interview Questions": "No interview questions in person!  I had to write an essay about my passion for biomechanics research."}, {"date": "28 Sept 2016", "title": "Resident Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at University of Delaware (Newark, DE) in Feb 2016", "Interview Descriptions": "The first interview is a group interview which took about 2 hours. They will introduce each other and then have some activities. 30 mins later, we were brought to another room to have individual interviews at 6 different tables. Most of them are current RAs, and they asked about behavioral questions.", "Interview Questions": "what did you do as a leader?\r\nwhat will you do if your resident have issue with her/his roomates?"}, {"date": "13 Nov 2015", "title": "Information Technology Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Delaware (Newark, DE) in Nov 2015", "Interview Descriptions": "Called for interview roughly 24 hours in advance. Applied for multiple positions. No emailed confirmation of interview time, date or which position interview was for. \r\nPanel was on speaker could barely hear the questions being asked, had to consistently ask each panelist to repeat each question. The frustration transferred through their tone. This is already a tedious and nerving process. This was not at all a good experience.", "Interview Questions": "What interested you about this position?"}, {"date": "12 Aug 2015", "title": "Graduate Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at University of Delaware", "Interview Descriptions": "Applied online, needed to contact advisors after applying, eventually got a call back - a few basic questions about my interests, but mostly he told me about the lab and what my duties would be if I joined them", "Interview Questions": "Why are you interested in this lab?"}], [{"date": "7 Mar 2015", "title": "Disability Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Delaware", "Interview Descriptions": "3+ months. Starts with a phone interview, then a full day of on campus interviews with panels and individuals. The questions weren't too challenging, but it was a lengthy process. UD is an amazing place to work, though, so it was well worth it. The one thing to be aware of is that on average, 60 plus people are applying for the same job, so be sure to make yourself standout in your resume and cover letter.", "Interview Questions": "Explain what you know about FERPA, ADA, and HIPAA and how they relate to this role."}, {"date": "21 Jan 2015", "title": "Administrative Assistant II Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Delaware", "Interview Descriptions": "received phone call to set up interview the next week. interview was with 4 person committee. easy interview, friendly staff. offered great benefits and seemed to be very interested in making a decision but had to wait for an HR decision.", "Interview Questions": "how would you deal with a student who might be hovering in the office"}, {"date": "30 Dec 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at University of Delaware", "Interview Descriptions": "First interview was over the phone. Asked general questions and then directed to an online application to solve a puzzle. Also asked to design the table structure for an application. Not difficult. Face to face interview was also good. Took me to lunch and was very informal.", "Interview Questions": "N/A"}, {"date": "9 Aug 2017", "title": "Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Delaware (Newark, DE) in Jan 2015", "Interview Descriptions": "No interview was given to me for the position. Brand new job and all i had to do is e-mail someone and I got it. Nothings was needed form me at the time. I also had good grades in intro bio and chem.", "Interview Questions": "No interview question at all"}, {"date": "22 Mar 2017", "title": "Media Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Delaware (Newark, DE) in Jan 2015", "Interview Descriptions": "Applied online through Handshake, was emailed to come in for an interview about two weeks later. I interviewed with the then-marketing manager and a current intern. I initially applied for an internship for the spring semester, but about a week after my interview they let me know that they no longer needed an intern. Then towards the end of the spring semester, they emailed me letting me know that they had an opening for the summer and wanted to bring me on. I accepted the internship offer and have now been working for them for almost two years.", "Interview Questions": "How much video experience do you have?"}, {"date": "21 Dec 2014", "title": "Blue Hen Ambassador Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Delaware", "Interview Descriptions": "3 stage interview consisting of written application, followed by individual and group interviews. Group interviews require collaborative problem solving and demonstration of public speaking skills. Individual interview focused on personal interests and goals. Mainly conversational. Very fair questions, and very transparent regarding the hiring process. Many employees very involved in the hiring process.", "Interview Questions": "If there was one negative aspect of the campus that you could change, how would you change it?"}, {"date": "23 Apr 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 5 days. I interviewed at University of Delaware (Newark, DE) in Dec 2014", "Interview Descriptions": "It is about 30min interview and the professor asked some question about the project on my resume. \r\nHe asked easy questions and it was a very happy talk. I think the process depend on the professor individually. Hope everyone get funded.", "Interview Questions": "Why we should choose you?"}, {"date": "4 Aug 2015", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Delaware (Newark, DE) in Nov 2014", "Interview Descriptions": "The hiring process was stress free. I wasn't prepared for a group interview, but it wasn't bad at all. The questions asked weren't difficult at all. The followed up with me a day after I interviewed and set the hiring process in motion. It was an easy transitions and the were clear about everything including the salary.", "Interview Questions": "How my skills from previous roles would be applicable to the one I interviewed for."}, {"date": "18 Sept 2014", "title": "Career Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at University of Delaware (Newark, DE)", "Interview Descriptions": "Process initially moved quickly. Communication prior to interview was via email and telephone. Phone interview lasted for around 20-30 minutes and consisted of 3 staff members from the Career Services Center. Within 2 weeks, I was contacted to schedule an on-campus interview but the date that they proposed wasn't for another month. The on-campus interview was a 3/4 day event. They paid for my hotel the night before, meals the night before and day of, and then my transportation also. The interview consisted of one-on-one interviews with some key campus partners, a group interview with the CSC staff, a brief tour, and one-on-ones with department leadership. I also had to give a brief presentation on a topic relevant to the position. The staff was very welcoming and the department is heading a great direction in terms of leadership and vision. The only downside was that after my on-campus interview, I was told that I would hear back from them in 1-2 weeks and it took a month for me to receive a phone call about the status of the position.", "Interview Questions": "How would you work to collaborate with other university departments who maybe do not want to work with you?"}, {"date": "18 Sept 2014", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Delaware", "Interview Descriptions": "Typical interview for postdoctoral fellows, it involves a presentation of you work in your PhD program. You will also talk to other postdoctoral fellows and graduate students about their research before you will talk to the principle investigator.", "Interview Questions": "the questions are typically related to your research project"}], [{"date": "25 Jul 2016", "title": "Front Desk Attendant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at University of Delaware (Newark, DE) in Sept 2014", "Interview Descriptions": "Filled out an application (not online) and after a few days I got an email to schedule an interview. The interview was very simple since most of the questions were the same as the ones on the application.", "Interview Questions": "What is good customer service?"}, {"date": "2 Aug 2014", "title": "Assistant Professor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at University of Delaware", "Interview Descriptions": "Skype interview with the head of department to get an idea about my research and teaching interests and my linguistic skills. I got an email exchange with some colleagues from the department about the courses I can teach and so on. The whole process was smooth and friendly.", "Interview Questions": "N/A"}, {"date": "4 Apr 2016", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Delaware (Newark, DE) in Jun 2014", "Interview Descriptions": "I was contacted by email to set up a phone interview. In the interview, the advisor mainly described the philosophy in her group, and asked me simple interview questions such as why you want to join my group? etc. Then I was asked to present my work in a separate skype interview. The presentation was set for 30 min + 30 mins for questions. I got some more detailed questions about my PhD research. 6-7 hours after the skype interview, I received another email stating that I got the job.", "Interview Questions": "What do you wanna do after postdoc?"}, {"date": "28 May 2014", "title": "IT Student Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 3 days. I interviewed at University of Delaware", "Interview Descriptions": "I got the interview through on campus submission of the resume. The process took 3 days. I got an email to schedule and appointment. The interview was with the supervisor. Basic questions and prior experiences with technology, software based applications and IT support were asked including dealing with clients and customer satisfaction.", "Interview Questions": "Basic questions"}, {"date": "23 May 2014", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Delaware", "Interview Descriptions": "I applied with GRE scores and and all the necessary paperwork. Had an email conversation with my prospective supervisor. He was looking for an engineering type student and I was a perfect fit. After couple of days I got my offer that I accepted.", "Interview Questions": "There was no question asked as my work was good enough for the professor to choose me."}, {"date": "25 May 2015", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at University of Delaware (Newark, DE) in Apr 2014", "Interview Descriptions": "Fairly simple and laid back after taking a course with the professor that I wanted to work for. Flexible hours but a lot is expected of you depending on the lab you choose.", "Interview Questions": "What are you interested in doing?"}, {"date": "27 Feb 2014", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Delaware", "Interview Descriptions": "The interview included a presentation followed by lab visit and meeting with lab members.", "Interview Questions": "N/A"}, {"date": "15 Oct 2016", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at University of Delaware (Newark, DE) in Feb 2014", "Interview Descriptions": "I had multiple rounds of interviews including an interview with a six person search committee, immediate team and volunteers I'd be working with, once hired. I was surprised that it took a month to hear back with an offer-- I almost accepted another offer to work somewhere else.", "Interview Questions": "Why UD, why now?"}, {"date": "26 Jan 2014", "title": "Resident Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through college or university. I interviewed at University of Delaware", "Interview Descriptions": "Needed reference.  Several interview process regarding behavior questions", "Interview Questions": "Google online typical group and behavior questions "}, {"date": "6 Nov 2013", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Delaware", "Interview Descriptions": "I got the job without any interviews. The professor told to work with him and I accepted the offer.", "Interview Questions": "Why do I need to hire you? "}], [{"date": "4 Feb 2014", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at University of Delaware in Nov 2013", "Interview Descriptions": "The interview took a whole day. It can make a person very tired at the end of the day. So be prepared to keep smiling till the end!!", "Interview Questions": "No unexpected questions."}, {"date": "19 May 2013", "title": "Financial Processor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at University of Delaware", "Interview Descriptions": "I applied online for the Financial Processor position. I was called back for an interview 3 weeks later after applying. I was interviewed by a panel of people who asked me questions. The interview was VERY fast. It felt as if they already chose someone for that position and did my interview to meet HR requirements. I forgot about the interview until 5 weeks later I received a rejection e-mail.", "Interview Questions": "Why do you feel your a fit for this position? Anything you can tell us about yourself thats not on your resume? How well do you work in a team?"}, {"date": "20 Mar 2017", "title": "Limited Term Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at University of Delaware (Newark, DE) in May 2013", "Interview Descriptions": "First interviewed by the hiring manager who asked very specific technical questions for the position. Then interviewed by several engineers in the group who mostly asked about my working experience, basic knowledge for the position. The last step was to be interviewed by the human resource department.", "Interview Questions": "How many years of industrial experience do you have in this area?"}, {"date": "18 Apr 2013", "title": "Staff Position Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at University of Delaware", "Interview Descriptions": "Most staff postions at UD are posted with a salary grade level which helps applicants/candidiates get an idea of the pay prospects.  However, you find out quickly either during or post interview that the actual \"budgeted\" amount is at least $25K - $30K LESS than the LO-HI range.  In addition, the range is broken up into 4 quartiles, and the budgeted salary winds up being in the lowest quartile or very minimum $$$.  To offset the lack of money, they then try to lure you in with their GREAT benefits and tuition reimbursement -- excellent benefits for sure, but one still has to maintain their cost of living.  Plus, you still have to pay for parking on UD premises.  Talk about Bait&Switch -- Very unethical practice to luring competent candidates into UD.  If the entire salary range is unattainable for new hires, then state it as such or provide the actual budgeted range, but don't try to deceive new recruits, which just presents a poor image of UD as a top employer.", "Interview Questions": "N/A"}, {"date": "12 Mar 2013", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at University of Delaware", "Interview Descriptions": "Submitted CV and cover letter after reading job ad; already knew the hiring professor.", "Interview Questions": "N/A"}, {"date": "8 May 2016", "title": "Teaching Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at University of Delaware (Newark, DE) in Jan 2013", "Interview Descriptions": "Very easy, knew the professor and had taken the class.  Did not have to answer and specific questions since we already had a relationship.  I had taken the course the previous semester so everything was fresh in my head.", "Interview Questions": "N/A"}, {"date": "1 Oct 2013", "title": "Undergraduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at University of Delaware (Newark, DE) in Dec 2012", "Interview Descriptions": "Just speak to any professor that is doing research", "Interview Questions": "Can you explain the group members projects"}, {"date": "26 Feb 2014", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Delaware (Newark, DE) in Sept 2012", "Interview Descriptions": "I worked as a student intern and was transitioned to a permanent position after 9 months. The interview was straight to the point as it was a skilled position. People are generally nice and interested in your own work as well.", "Interview Questions": "What was a time where you failed and what did you do?"}, {"date": "17 Jul 2015", "title": "Digital Collections Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at University of Delaware (Newark, DE) in Mar 2012", "Interview Descriptions": "Very brief. One of the workers sat me down, barely looked over my resume and asked me a few questions. Within minutes she basically told me that we were done and that I had the job. She spoke very poor English, so honestly I don't think she even read my resume.", "Interview Questions": "What year I was at UD."}, {"date": "23 Jan 2014", "title": "Postdoctoral Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 months. I interviewed at University of Delaware (Newark, DE) in Jan 2012", "Interview Descriptions": "During the Skype interview, a couple of technical questions about my previous job were concerned, especially intellectual property-related issues because I have a lot of international patents. However, it never occurred an issue at all while I work as a postdoc at University of Delaware.", "Interview Questions": "I could not answer a couple of questions properly although I was confident but failed to deliver over the Skype interview. I sent a follow-up email to the hiring boss about my anxiety but it turned out to be a minor issue anyway."}], [{"date": "21 Jul 2015", "title": "Graduate Student Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 months. I interviewed at University of Delaware (Newark, DE) in Sept 2011", "Interview Descriptions": "talked with different professors about their research projects; was asked about my relevant experience in college and at work; asked them their funding situation and expectation of years before graduation; chatted with their graduate students about their groups to know insides and if they like it;", "Interview Questions": "Why did you leave your previous research group?"}, {"date": "10 Dec 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Delaware (Newark, DE) in Aug 2011", "Interview Descriptions": "Discussion with prospective research advisor to see possible matches in interests. Then you will be given a simple research problem to solve over the period of a semester. Based on your performance over the period of the semester, the professor will decide if he is interested in hiring you. You will also be considered a member of the lab during this probationary period and you might have to attend group meeting and weekly reviews.", "Interview Questions": "Mention your area of interests and the type of projects you are interested in"}, {"date": "12 Jul 2015", "title": "Graduate Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at University of Delaware in Apr 2011", "Interview Descriptions": "Because I was from out of state, I had a phone interview first that went over the basic interview questions such as \"tell me more about your experience\", etc. I then was flown to the University to do a face to face meeting where more specific details were discussed such as future goals and things I could contribute to the field.", "Interview Questions": "What are your overall goals? Why would you like to work in this field?"}, {"date": "17 Oct 2013", "title": "Administrative Assistant II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at University of Delaware (Newark, DE) in Jul 2010", "Interview Descriptions": "Easy pretty generic, I had been working in the position as a temp for 7 months", "Interview Questions": "N/A"}, {"date": "16 Jun 2010", "title": "Admission Counselor Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at University of Delaware (Newark, DE) in Jun 2010", "Interview Descriptions": "The entire staff at UD was very welcoming and amicable.  They asked your typical questions of why you want to work here, strengths/weaknesses, and past work experiences. If you make it to the final round they have a 5 hour interview process with an optional tour - take the tour! Two professional staff members take you out to lunch as well. All-in-all I left with a positive impression of the institution, staff and position", "Interview Questions": "How would you describe who  we -University of Delaware- is as as higher education institution?\r\n"}, {"date": "14 May 2013", "title": "Research Associate I Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at University of Delaware (Newark, DE) in May 2010", "Interview Descriptions": "The interview was professional but semi-informal.  The principal investigator (PI) of the grant that funds my research was present, along with a fellow collaborator and a human resources representative.  We met for about 45minutes and discussed how my previous experience would contribute to success in the new project.  The PI contacted me the following week via email to unofficially offer me the position. Hiring was a breeze.  UD has a process that they call \"on-boarding\".  Its very fluid and they lead you through all the various HR hoops.", "Interview Questions": "Why do you think you are the best fit for this position? "}, {"date": "4 Oct 2013", "title": "Research Associate II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at University of Delaware in Oct 2009", "Interview Descriptions": "meet with boss, he opened data and asked to do analysis.\r\nI give him suggestion how to do that. He is happy and accept me.\r\nthis is not regular employement.", "Interview Questions": "this is not regular employement. this is informal interview.\r\nAsk me how to analyze LD 50"}, {"date": "12 Oct 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at University of Delaware (Newark, DE) in Jul 2009", "Interview Descriptions": "Asked many questions about skills, handling stress, etc.", "Interview Questions": "How do you resolve conflict?"}, {"date": "15 Oct 2009", "title": "Webmaster Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at University of Delaware (Newark, DE) in Aug 2008", "Interview Descriptions": "Mostly Hr questions", "Interview Questions": "tell me bout urslef"}]]