[[{"date": "20 Aug 2019", "title": "Learning Specialist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Baker College (Cadillac, MI)", "Interview Descriptions": "One way video interview. I was given unlimited time to think about questions before answering and three minutes to answer. It was uncomfortable talking only to a computer screen with no active listener. The questions were easy to answer as far as co tent went, though.", "Interview Questions": "3 most important skills for\r\nthis job"}, {"date": "28 Nov 2018", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baker College in Apr 2018", "Interview Descriptions": "Interview process is very intense but well worth you time. They liked that i know the history of the college as well as the requirements for the program. Also, knowing the potential classes that I would be teaching as well as the other faculty members.", "Interview Questions": "What should we hire you?"}, {"date": "23 Jul 2016", "title": "Admissions Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Baker College", "Interview Descriptions": "A total of 3 interviews are done. Screening, panel, and third interview. I waited a very long time in the lobby before being interviewed. I met a current advisor for the initial screening. Questions were based on a sales position. During the panel interview, I was asked me \"sell a pen.\" Entire process was quite intimidating.", "Interview Questions": "Can you sell?"}, {"date": "16 Aug 2016", "title": "Customer Service Representative Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Baker College (Waterford, MI) in Jul 2016", "Interview Descriptions": "The first thing I had to do was take a personality test online. Within 24 hours of completing the test, I received a call from the CEO, who requested a face to face interview. Interviewed with the two owners (CEO and CFO). The questions surrounded my experiences working as an Adjunct Faculty, a corporate trainer and my knowledge of and use of MSOffice.", "Interview Questions": "What was my level of knowledge of Excel."}, {"date": "15 Mar 2016", "title": "Resident Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Baker College in Mar 2016", "Interview Descriptions": "First there was a phone interview. This interview lasted about 15 minutes or so. I thought that this interview was going to be with the Director of housing, but it was with the Area Coordinator. The next interview was a Facetime/ Skype interview and, this interview was with both the Area Coordinator and with the Director of housing. This interview lasted about twenty-five minutes. During both interviews, the questions where about the experience that that I had that was relevant to the position.", "Interview Questions": "What is one of your strength and weaknesses? \r\n\r\nBased on experience, tell me of a time where you were dependable? "}, {"date": "26 Mar 2019", "title": "Adjunct Faculty Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Baker College (Lansing, MI) in Sept 2015", "Interview Descriptions": "Applied online via job search website. Offered position at first meeting. Low-stress and pleasant experience. Situation was perhaps unique because of position vacancy and urgency to fill said position. Overall, great experience", "Interview Questions": "I was asked about my experience regarding the position."}, {"date": "11 Aug 2015", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 days. I interviewed at Baker College (Clinton Township, MI)", "Interview Descriptions": "I mailed in resume and cover letter, they called for interview, I met with dean. It was a standard interview with basic questions\r\nIt was pretty short and easy and they hired me right away \r\nThey do a lot of last minute hiring before the start of the school quarter", "Interview Questions": "Why do you want to work here"}, {"date": "29 Aug 2016", "title": "Academic Advisor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Baker College in Jul 2015", "Interview Descriptions": "Application was made by mail following the employer's directions. The interview was conducted by phone by two representatives of the HR department. After small introductory remarks were made, the interviewers asked general questions. I was my impression that very few of the questions asked related to the position I was seeking.  Rather, the questions were primarily screening questions. I did not feel like I had the opportunity to demonstrate how I would be an asset to the employer.", "Interview Questions": "I was asked about how I would handle working in an environment with a difficult coworker due to personality disagreements."}], [{"date": "19 Sept 2019", "title": "Admissions Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. I interviewed at Baker College (Detroit, MI) in Feb 2015", "Interview Descriptions": "There were 4 interviews over two months. First online, the other two in person. second was on one and third was a small group. Followed up by meeting several team members.  Started with 250 applicants and went down to two by the 3 rd and just me the last interview", "Interview Questions": "What was my work experience? What was the customer service background? "}, {"date": "7 Aug 2015", "title": "Associate Dean Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Baker College (Flint, MI) in Jan 2015", "Interview Descriptions": "very odd questions - very disturbing experience and all employees were extremely tense - just a weird environment - I knew after about a half hour that this was not a good place to work", "Interview Questions": "What would you do if someone here stabbed you in the back? I could not believe it!"}, {"date": "27 Aug 2014", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Baker College", "Interview Descriptions": "Simple process which involved me answering some basic questions. Nothing more than sitting at a desk and having ideal conversation. Didn't really cover any past experience or educations (which surprised me being a college).", "Interview Questions": "How would you handle a student who is verbally upset with a status involving financial aid? "}, {"date": "29 May 2014", "title": "Director Interview", "results": "Declined Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Baker College", "Interview Descriptions": "It is all fake - formality - you only get the job if you know someone there. They will call you for an interview and ask you one question and tell you thank you, we will let you know, or hire you on the spot. Fake interview.", "Interview Questions": "There are no difficult questions. They have to beg people to work for them once you hear the salary"}, {"date": "10 Jan 2017", "title": "Bookstore Sales Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Baker College (Allen Park, MI) in Mar 2014", "Interview Descriptions": "I sat down with the bookstore manager and the president of the college. They asked me about my past history with sales and customer service, about my strengths and weaknesses and how I would benefit their company. I was nervous but it was a fairly normal interview and I went to interview practices before hand with our career services department at Baker College and they helped tremendously. Being as prepared as one can be makes all of the difference and helps with confidence.", "Interview Questions": "How can you benefit our company?"}, {"date": "30 Aug 2017", "title": "Administrative Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baker College (Detroit, MI) in Jan 2014", "Interview Descriptions": "The interview was very laid back they make you feel really comfortable. I'm not sure why I have to be made to do this process just to get on Glassdoor?! I don't want to do this and it should not be forced.", "Interview Questions": "What does customer service meant to you?"}, {"date": "31 Dec 2013", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Baker College", "Interview Descriptions": "One interview with one person and job offer was made", "Interview Questions": "Asked why I would be a good fit for Baker College"}, {"date": "26 Mar 2015", "title": "Adjunct Professor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 2 days. I interviewed at Baker College (Richmond Hill, GA) in Dec 2013", "Interview Descriptions": "The Department Chair sent me an email and asked if I was interested in teaching for the college after he read a LinkedIn post I wrote. He called me after I responded and asked about my background and prior teaching experience. He set me up with human resources and the rest, as they say, is history.", "Interview Questions": "How long have you been an adjunct?"}, {"date": "10 Nov 2014", "title": "Adjunct Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at Baker College in Nov 2013", "Interview Descriptions": "Interview was very relaxed, and comfortable. The usual questions. Nothing difficult. The interviewer really made me feel at ease and was very personable. I received an offer at the end of the interview.", "Interview Questions": "N/A"}, {"date": "21 Jul 2013", "title": "Department Chair Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at Baker College (Allen Park, MI)", "Interview Descriptions": "I applied and was contacted by the Allen Park campus approximately two weeks after my application. I was first interviewed over the phone, and was then asked to come in for an interview with the campus president and a member of the academic staff. After this interview, I did not hear anything for a couple of weeks -- I called Baker to follow up on the interview and at that point I was offered a job.", "Interview Questions": "There were not any difficult or unexpected questions, it was a very typical interview process."}], [{"date": "22 Jul 2013", "title": "Academic Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Baker College (Flint, MI)", "Interview Descriptions": "One interview and drug/background test.", "Interview Questions": "General questions"}, {"date": "16 Jun 2013", "title": "Professional Tutor - Learning Support Services Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Baker College", "Interview Descriptions": "The interview process would absolutely be different form campus to campus. Flexibility of work schedule (5-5hr days )and a genuine people person are absolutes necessities. Most important quality needed would be the ability to think on your feet, problem solve, and keep it together under pressure.", "Interview Questions": "What can you contribute to our organization?"}, {"date": "6 Jun 2013", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Baker College", "Interview Descriptions": "I went in person to inquire about a position and had an interview set up within the week. The interview was short with a skills and intelligence test that included things like alphabetizing according to name and title. A background check was completed and a sexual harassment and work place violence seminar were completed online. Each of these took about 45 minutes with a certificate of completion forwarded to management and placed in my personnel file. The interview and hiring process were simple and pretty easy. No tough questions asked. The main focus was on skill, professionalism, and whether I was the right fit for the department I was being placed in.", "Interview Questions": "There were really no unexpected or difficult questions. The interviewer did more talking than I am accustomed to during an interview. "}, {"date": "5 Apr 2013", "title": "Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Baker College (Clinton Township, MI)", "Interview Descriptions": "Always at least. 2 interviews.  Sometimes with higher ups in flint that want to make sure you fit the Baker mold", "Interview Questions": "What do you know about Baker"}, {"date": "11 Sept 2016", "title": "Program Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at Baker College (Jackson, MI) in Aug 2012", "Interview Descriptions": "The interview was very brief. I was only interviewed by one person, one time. To my knowledge, no references were checked. There was no test, training, or written philosophy required. I was offered the position during the interview and began working before my orientation and drug screening. There appears to be no formal process for interviewing at Baker College.", "Interview Questions": "How soon can you start?"}, {"date": "11 Jul 2016", "title": "Academic/Financial Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Baker College (Owosso, MI) in May 2012", "Interview Descriptions": "the interviews started with a phone screwing. It advanced to a face to face panel interview which consisted of a dice person panel. The interview also included a written portion. The written portion had five scenarios. A response of one page for each scenario was required.", "Interview Questions": "How would hiring you make an influence on the students at Baker College?"}, {"date": "1 Mar 2016", "title": "English Tutor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Baker College (Flint, MI) in Jan 2012", "Interview Descriptions": "I had an interview from the student services head and then they hired me and we had some procedures for work. It was great and they explained me my job status pretty well. I didnt had any trouble with it.", "Interview Questions": "They asked me pros and cons"}, {"date": "24 Aug 2015", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Baker College (Detroit, MI) in Aug 2011", "Interview Descriptions": "The interview was straightforward and not too stressful. I was contacted by phone to schedule an interview. The office manager was polite on the phone.  The interviewers were professional and asked traditional and behavioral questions. Locating the school was easy to find and in an area easily viewable. The school was clean and the staff were professional and pleasant. Overall, the interview process was a comfortable experience.", "Interview Questions": "How do you handle difficult people?"}]]