[[{"date": "8 Jun 2023", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Institutes for Research (Washington, DC)", "Interview Descriptions": "The interview was technical and expected. Hiring managers were very professional and capable. I would recommend to come prepared and be ready to be engaged in high-level and technical discussions.", "Interview Questions": "It was all technical stuff"}, {"date": "31 May 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "About 1 week after submitting my application I received an email inviting me to schedule a phone screen interview. That interview took about 20 minutes and then I was requested to provide a code and writing sample. I am still waiting to hear back if I will continue further in the process.", "Interview Questions": "What is your coding experience?"}, {"date": "19 Apr 2023", "title": "Junior Data Scientist Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "First, there was a coding test with a few questions to test my Python skills. The interview was a one-on-one interview with technical questions, such as asking for the step-by-step process for one of my projects.", "Interview Questions": "Describe the steps you took for any project you completed recently."}, {"date": "13 Apr 2023", "title": "Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "I went through a phone screening interview with HR, and then did a second interview with a researcher who would manage the internship. The interviews were short, 30 minutes each and asked typical behavioral questions and experience creating digital content. I never heard back.", "Interview Questions": "What is an accomplishment you're most proud of?"}, {"date": "15 Mar 2023", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research in Mar 2023", "Interview Descriptions": "I applied online, received an email from a recruiter about 2 weeks later, and had an initial (20-30 min) phone screening about a week after that, with questions about my qualifications and why I'm interested in this position. About a week later I received an email to schedule a video call interview, and I spoke with 4 different employees with various positions, with a mix of behavioral questions and giving me a chance to ask them questions", "Interview Questions": "Describe a time when... (ex. you worked on a team, you communicated information, you had a tight deadline, etc.)"}, {"date": "23 Mar 2023", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at American Institutes for Research (Arlington, VA) in Mar 2023", "Interview Descriptions": "The interview process included a screening call with a recruiter and a hiring lead, a day-long interview with various team members, and a job talk. Each interviewer asked thoughtful and unique questions.", "Interview Questions": "What are your perspectives on the state of our field? What are scholars and practitioners doing well? What are scholars and practitioners missing? What are your ideas for moving the field forward?"}, {"date": "7 Apr 2023", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at American Institutes for Research (Atlanta, GA) in Feb 2023", "Interview Descriptions": "Took a really long time to get back to me between each stage. Wasn't transparent. Had to follow up between interviews. Took 3 months total, without keeping me updated between stages.", "Interview Questions": "How do you feel about working in teams?"}, {"date": "5 Jan 2023", "title": "Research Scientist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "I had a first interview with HR which asked standard questions, then an interview with a team member which asked more in depth questions. Then I was to do a whole day of interviews with various team members and give a job talk. Honestly I was frustrated that I put in so much work not to receive an offer. I think they went with someone who had more technical experience, and I would have just rather they cut things off after the second interview rather than asking me to put so much time and effort into a whole day of interviews.", "Interview Questions": "N/A"}, {"date": "20 Feb 2023", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research in Jan 2023", "Interview Descriptions": "I have not received a formal offer or rejection yet but I wanted to comment about the interview process. So far the process has taken 3 months. I was initially screened via phone call about 1 week after my application. Then I did not hear back for weeks after reaching out several times. I was contacted by a different recruiter about a month after my initial phone screening to do another phone screening.  A few weeks later I was invited to an interview with 2 senior researchers. I was asked standard questions about my skill set and research experience. I was told a final decision would be made in about a week and I should hear back. After a few weeks I was invited to an additional interview. I was told that although the center was interested, there were no job openings for the original team I interviewed with. The next interview was with one senior researcher and again answered standard interview questions. Again it has been a few weeks and I have not received a final decision after reaching out for an update. All interviewers were very nice and seemed to enjoy their jobs but the interview process is very off-putting.", "Interview Questions": "What data softwares do you have experience with?"}, {"date": "1 Mar 2023", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research in Jan 2023", "Interview Descriptions": "I was first interviewed by the HR person, who then set up a group interview with 2 senior researchers and 1 manager. They asked questions about my prior research expereince, project management, and data analysis.", "Interview Questions": "What is your experience with managing projects?"}], [{"date": "18 Sept 2022", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research (Austin, TX) in Aug 2022", "Interview Descriptions": "The interview process was straightforward. Contact from the recruiter asked about my resume and then set an interview with the team.\nThe team was looking for a SAS programmer. I have experience programming in R and Python. I talked about  R and python but the team had tailored technical questions in SAS and began asking questions on SAS. \nI'd told my recruiter that I have experience in other programming languages but not so much in SAS. I wish they had arranged the interview with the team with all of my information. \nThe recruiter or the team didn't give me any information on what their team does in the beginning. But when I ask them, all they did was clean and merge data.\n\n ", "Interview Questions": "Are you willing to learn SAS on hire?"}, {"date": "18 May 2022", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "The interview process was straightforward and relatively traditional. The questions were standard, and there was an opportunity to ask any questions that a candidate would have. No additional comments to make at this time.", "Interview Questions": "N/A"}, {"date": "12 Jul 2022", "title": "Senior Industrial/Organizational (I/O) Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 8 weeks. I interviewed at American Institutes for Research in May 2022", "Interview Descriptions": "First round was HR phone screening, background-related questions and opportunity to explain how they fit the role.\r\nSecond round was a Teams meeting with the division managing director. Role-related competencies focused.\r\nThird round was meetings with 7 people (interviewers were paired up and there were several Teams sessions). These interviews each appeared to have a different job-related theme and we talked about specific skills and experiences. Very conversational. Plus a 1 hour job talk/ presentation on a I/O subject of my choice, also on Teams.\r\nFinally, a Teams meeting with area Vice President.", "Interview Questions": "Interview questions were on the whole focused on competencies for the role. I was also asked repeatedly about why I was interested in AIR and this role at AIR."}, {"date": "11 Jun 2022", "title": "Data Scientist Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at American Institutes for Research in May 2022", "Interview Descriptions": "Three stages to the interview process: first a take-home coding test which took roughly 2-3 hours, next a 30 minute phone interview, and lastly a three-round panel interview with 7 people total.", "Interview Questions": "Tell me about your prior research projects"}, {"date": "24 Mar 2022", "title": "Communications Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "Initial phone call with a recruiter. Then second phone call with the hiring manager. Then zoom interview with 5 team members separately (30 mins each). Received an offer about 2 weeks later.", "Interview Questions": "They asked a lot of scenario-based questions.  How do you keep yourself organized and what time management skills?"}, {"date": "7 Mar 2022", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "It was a call with a recruiter that was basically to make sure I was interested in the role, then a one-on-one interview a week late. Finally, 3 consecutive one-on-one interviews, and I received an offer a week later.", "Interview Questions": "Talk about your quantitative experience."}, {"date": "29 Mar 2022", "title": "Project Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research in Mar 2022", "Interview Descriptions": "I sent in an application with a resume and cover letter. The hiring manager reached out to me to set up a call. I had a phone screening with the hiring manager and then never heard back. They seemed optimistic, but probably chose someone with a more technical background.", "Interview Questions": "Common traditional and behavioral questions!"}, {"date": "13 Apr 2022", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at American Institutes for Research (Washington, DC) in Mar 2022", "Interview Descriptions": "One initial screening  call by the recruiter, followed by a video call where I talked to the director of the team, and then I was told they would contact me for a third interview with a panel of people and then they ghosted me.", "Interview Questions": "How would you handle multiple tasks for different projects?"}, {"date": "5 Apr 2022", "title": "Human Resources Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research (Arlington, VA) in Mar 2022", "Interview Descriptions": "The Recruiter called me and the interview was very smooth . But the sad part was the recruiter didn't back with the result of the interview. Inspite of me dropping a follow up email i didn't get any reply. Very unprofessional.", "Interview Questions": "Statistics Questions , Past Work experience."}, {"date": "17 Apr 2022", "title": "Data Science Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American Institutes for Research (Arlington, VA) in Mar 2022", "Interview Descriptions": "Coding test, a one-on-one interview, and then an three round interview with several people. Both personal interviews contained technical questions and the final one contained more “tell me a time when” questions. Everyone was very personable and the process went pretty quickly, with only about a week or so between the two personal interviews.", "Interview Questions": "What are you learning right now?"}], [{"date": "11 Jan 2022", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "easy interview with basic research related questions. 1st round with HR and 2nd round with team members. HR mostly asks behavioral questions while in the 2nd round, they want to know your research interest. interviewers are super nice and friendly, they are dream colleagues.", "Interview Questions": "introduce yourself and your research interest"}, {"date": "26 Jan 2022", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research in Jan 2022", "Interview Descriptions": "Very quick turn around process. Contacted by recruiter days after I submitted application, interviewed two weeks later, job offer followed immediately afterwards. The research was previously familiar with my work — allowed for a very informal laid back interview. Felt that I was interviewing the team rather them interviewing me.", "Interview Questions": "What type of projects do you see yourself working on"}, {"date": "5 Oct 2021", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "Sat through an all day interview and never hear back from them … interviewed with over 6 people for an entry level position. Some people were in person and some were over zoom", "Interview Questions": "Have you ever worked with an international team "}, {"date": "12 Sept 2021", "title": "Development Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "A phone screening was followed by the company providing transportation and lodging for the interview at their central office. A one-hour test was followed by a series of interviews in person and by phone with managers at several different levels.", "Interview Questions": "I was asked about my particular experience that was unusual in the field."}, {"date": "13 Oct 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research in Sept 2021", "Interview Descriptions": "The interview process went quite quickly. After submitting an application online, I was contacted for a phone interview a few days later. I was asked for a writing sample and scheduled for an interview the next week. I had two more back-to-back interviews, which I will admit that I did not feel that confident about. After a week or so, I reached out to one of the interviewers and my recruiter but neither responded. I tried reaching out one more time but never got a response. I understand getting ghosted early in the process, but it seems rude to go through three interviews and not get the courtesy of an email letting me know they were not moving forward.", "Interview Questions": "Tell me about your quantitative experience "}, {"date": "30 Aug 2021", "title": "Research Intern Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "It was very smooth and friendly. They asked e about my research experiences and working experiences. They answered my questions patiently and completely. They tried to support me as well.", "Interview Questions": "Tell me about yourself and your research."}, {"date": "16 Jul 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "1 screening phone interview. Then 2 weeks later, 3 interviews by different team members back to back. Received an offer 4 days after interview. Recruitment team is very helpful & responsive", "Interview Questions": "Describe a time where you disagreed with a supervisor? What was the result?"}, {"date": "26 Jun 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "I did not interview with American Institutes for Research. I never heard back about my application, and could not find anyone to get in touch with to check in about my application.", "Interview Questions": "N/A"}, {"date": "9 Jun 2021", "title": "Education Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "The interview process itself was smooth. The interviewers were nice and straightforward, and the materials that I needed for the programming part of the interview was sent before so that I could prepare. Positive experience overall", "Interview Questions": "Tell me about yourself\r\nProgramming questions"}, {"date": "26 Jul 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at American Institutes for Research in Jun 2021", "Interview Descriptions": "The interview questions were very cookie cutter, and I felt that the interviewer didn't leave much space for me to show who I was. \nThe interviewer unfortunately had very little concrete information about the position itself, so very few of my questions were answered. \nI left the interview feeling like the interviewer had very little idea of who I was as a person, which was frustrating.", "Interview Questions": "What made you interested in this position? \nWhat do you hope to do in 5 years? "}], [{"date": "14 May 2021", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "Pretty straightforward. Recruiter sends email, does initial virtual interview, asks for writing sample and transcript. Actual interviews scheduled next. Interviewed with four people who were pleasant enough. Waited to hear back but had to email recruiter to check status.", "Interview Questions": "How do you measure/ensure quality in your work?\nWhere do you see yourself in five years?\nDescribe a time when you had to work/perform with no guidance."}, {"date": "12 May 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "Simple, straight forward, nice experience meeting team and learning about the company. Asked open-ended questions and were friendly. Had an interesting interview and thought the organization was a good fit", "Interview Questions": "Can not recall specific questions"}, {"date": "22 Jun 2021", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research in May 2021", "Interview Descriptions": "The interview process was quick and simple. Two weeks after I applied, I received an offer for a quick phone interview with a recruiter, which was as straightforward as phone screenings usually go. I was asked right after to provide a writing sample and two days later, I was called back for a second and final interview. This interview consisted of four back-to-back 30 min interviews with members of the team. It was more about getting to know you as a person, including your working style and ideal environment, so the mood felt comfortable. I was getting more excited for the position over time as well since I could sense the team's passion for the work. Quite a few questions overlapped and I received an informal offer later that day. The entire process took about a month.", "Interview Questions": "How do you manage multiple ongoing projects?"}, {"date": "7 Jul 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research (Chicago, IL) in May 2021", "Interview Descriptions": "Fifteen minute screening interview w/ Hiring Director (basic interview questions), then I was asked to send a writing sample, then an invitation to have 3 separate behavioral interviews with members of a research team.", "Interview Questions": "What is your experience with research? Explain a time where you had conflicting deadlines- which one did you handle first? "}, {"date": "9 Apr 2021", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "Submitted application, then was contacted a month later. Had two phone screens, then spoke with hiring manager. Then was ghosted for a while then was finally offered the role. The interviews were straight forward. Questions about experience based on my resume and behavioral questions about group work ....etc.", "Interview Questions": "Tell me about your self, tell me about a research project you worked on and what was your role in it"}, {"date": "25 May 2021", "title": "Qualitative Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research in Apr 2021", "Interview Descriptions": "The recruiter and the team were very responsive to my needs. I had another job offer that I needed to decide on and they transformed what was supposed to be a month-long interview process and fit it into a week's time.", "Interview Questions": "What kind of data collection experience do you have in the field?\nWhat experience do you have using qualitative research methods?"}, {"date": "11 Jul 2022", "title": "Research Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research (Lewiston, ME) in Mar 2021", "Interview Descriptions": "Screening with a recruiter first, and then a 2.5 hour interview with various staff members. Questions ranged from behavioral to scenarios, as well as overviewing relevant experience. Was nice to get a feel for the staff and team members that I would be working with. The rigor of the interview depended on the person--for me, the principal researcher was very relaxed and I found that the other research analysts asked more difficult questions, but overall it was a positive experience.", "Interview Questions": "Tell us about a time you had to work as a team. "}, {"date": "21 Jan 2023", "title": "Junior Researcher Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research (Ottawa, ON) in Feb 2021", "Interview Descriptions": "The application process was easy, after the submission of my application, I relatively quickly got an answer and an invitation to do further steps. That was a great chance and an advantage compared to competitors in a similar industry.", "Interview Questions": "E.g. Why did you apply for this position"}, {"date": "30 Jan 2021", "title": "Data Scientist Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "In person interview consisting of several individual interviews with different people, and also a presentation of my research similar to an academic job talk. Very extensive interview process, which allowed me to see if I was going to be a good fit for the company and allowed them to see if I was a good fit for the organization. In all, it was a long interview but was very helpful.", "Interview Questions": "Standard interview questions in the individual interviews. "}, {"date": "21 Jan 2021", "title": "Intern Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "I had a series of short phone and video interviews with potential team members and managers. Questions ranged from standard behavioral questions to open ended discussion of my research interests.", "Interview Questions": "What are you hoping to gain from an internship at AIR?"}], [{"date": "22 Dec 2020", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research (Washington, DC) in Nov 2020", "Interview Descriptions": "Easy interview process, and I appreciated the quick and clear communication from the recruiter throughout. Applied and got invited to a 30 minute phone screener with an HR recruiter within a couple days. The interview asked pretty basic questions about my experience, interest in the role and that specific research area. Afterwards, I had to send a writing sample. Within a week I got invited to a 30 minute video interview with the  hiring manager, which was very casual and just asked me to elaborate specific experiences on my resume. Got back to me the next day with an invitation to a 1.5 hour interview with the larger group of researchers. It was basically 3 back to back 30-minute interviews with 3 separate researchers. Everyone was super nice and each interview more of a casual conversation about my interests and experiences. Got an offer the next day. Altogether took about a month. Was a great experience!", "Interview Questions": "Why are you interested in AIR and this department? "}, {"date": "15 Jul 2020", "title": "Quantitative Researcher Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "I was referred by a colleague.  The process took about a month (initial recruiter call, phone screen, all day on-site). I declined the offer because the salary offered was well below my current compensation and far outside the range initially quoted by the recruiter.", "Interview Questions": "The interviews were fairly casual discussions of my current and planned future research projects. Plan to describe your research in detail, provide details about your intended specialization at AIR, and articulate a vision for your area - where is the current need? Where are there gaps in knowledge? In one interview, I was also asked to think through a research strategy for an ongoing project."}, {"date": "19 Jun 2020", "title": "Research Assistant - Quantitative Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Institutes for Research (Washington, DC) in May 2020", "Interview Descriptions": "10-minute phone screen focused mainly on the \"low pay\" and how the hiring manager was \"basically unwilling to even consider going above\" a certain amount (their words). Did not spend much time discussing my background or what they were looking for. It was certainly off-putting, but I decided to go through with the process.\r\n\r\nCommunication prior to interview was minimal. Interviewed with three people for 30-minute segments each. 2/3 seemed very disorganized and misinformed, and it’s unclear whether HR even had a set interview procedure. It’s not unreasonable to expect that questions about the process/schedule prior to an interview would be appreciated and answered rather than ignored, forcing a prospective employee to go in unprepared.", "Interview Questions": "Screen-share with interviewer and write a function in R that will read all the column and row names in a data frame."}, {"date": "29 Apr 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research in Mar 2020", "Interview Descriptions": "I applied online and was contacted about 2 weeks later for an initial phone screening.  The phone screening was straightforward, with the recruiter asking basic questions about my research experience and my interest in the role. At the end of our conversation, the recruiter asked me to send a writing sample and informed me I would hear about next steps within two weeks. After hearing nothing for three weeks (I figured with the pandemic, there might be some delay), I reached out and got no response. I tried to get an update a second time but still heard nothing from the recruiter or AIR, not even an automated reply. I understand COVID-19 has made things difficult for everyone, but they seem to be still hiring, so I was pretty frustrated as I  was told I would at least hear if I was rejected, which is much better than just being ignored.", "Interview Questions": "N/A"}, {"date": "25 Feb 2020", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American Institutes for Research", "Interview Descriptions": "Interview process was long and tedious - I had 30 min sessions each with 7 mid- to high-level leaders in addition to my manager-to-be. But the worst was when, after being offered the job, I tried negotiating for a higher salary and they pulled the offer. Says a lot about the organization.", "Interview Questions": "What would you do to reach our target audience?"}, {"date": "13 Nov 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "Sent in application in January when I was living abroad, had initial phone screen I think a month later. Got an email that entire application process was put on hold. Re-applied when I returned to the US. HR rep was late to the phone screen but remembered me from the February call and passed me straight to the next round.\r\n\r\nThe second round was over video conference and was basically two back-to-back behavioral interview power hours. Spoke with HR for ten minutes, and then two groups of senior researchers asked questions off a script and you had to give short responses of how you would describe yourself / how you've acted in different scenarios. Pretty sure they had to rate the answers on a scale. There were a lot of questions and there were repeat questions across the two rounds, so if you mess up one there's opportunity to recover. Definitely some frankenstein monster cooked up by HR, but the interviewers were super friendly and eager to put me at ease. It was test of patience and of how well I could talk about and frame my experiences.\r\n\r\nI didn't realize that the skype interview was the final round, so I was pleasantly surprised when they called back with an offer a week or two later.", "Interview Questions": "Would you describe yourself as a detail oriented or big picture person?"}, {"date": "8 Nov 2019", "title": "Assessment Reporting(Data QC) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at American Institutes for Research", "Interview Descriptions": "Brief behavioral phone interview with HR recruiter. About a week later I had a 30 minute phone interview with the senior director for the reporting team which consisted of mostly behavioral questions.", "Interview Questions": "Tell me about any experience you have with Excel"}, {"date": "4 Jan 2020", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research in Nov 2019", "Interview Descriptions": "The interview was conducted on Skype and was around 2 hours in total. However, those two hours were split into 30-45 minute segments where you talk either with the Senior Research Analyst, who would be your boss, or two separate teams of other research analysts, who would be your coworkers. \r\n\r\nA lot of the same questions were carried over from each interview time slot to the next.", "Interview Questions": "Do you like to work as part of a team or more as an individual?"}, {"date": "11 Oct 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "The HR called me about a week after I submitted my application. She scheduled an interview for me with a senior researcher. The interview was basic describing my previous work and experience. The salary they offered is way too low in the Bay area.", "Interview Questions": "Describe your previous work experience related to the hiring position."}, {"date": "16 Sept 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "The first interview was a short 5-minute interview asking general questions and picking a time for the next interview. The next interview was 2-hours long and included 4 interviews. Most of the interview was scripted and if they felt like they wanted to know more about a particular answer, they would ask an of-scripted question.", "Interview Questions": "Behavioral questions about leadership, research, and teamwork style. What would you do if you had a project due in a week but your supervisor needed it tomorrow? How do you manage multiple projects at once? If you knew someone made a mistake analyzing a set of data, how would you go about problem-solving?"}], [{"date": "14 Aug 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "It was pretty similar to other research assistant positions - first a qualifying phone interview with a rep from HR and then two weeks later I had a longer phone call with a project director before going in to one of the offices and having a series of five interviews. The questions weren't difficult, they really just wanted to get a sense of your skill and ability and why you want to work at AIR. In a way that makes the questions harder, because there really is no trick. But overall it was a pleasant experience and they were extremely thoughtful about keeping me updated at each stage of the process.", "Interview Questions": "Ask about a specific research experience involving whatever field this research assistantship is based in."}, {"date": "15 Jun 2020", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at American Institutes for Research (Washington, DC) in Aug 2019", "Interview Descriptions": "I got my 30 min phone interview about 2 weeks after I submitted the application. The phone interview was with the HR and  informative about the role and salary. I got an offer from a different place while I was waiting for the next round of interview and decided to withdraw my application.", "Interview Questions": "Why are you interested in the position?"}, {"date": "16 Aug 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research (Washington, DC) in Aug 2019", "Interview Descriptions": "The process was very smooth, but not short. Had an HR phone screening a month after I applied. The HR person set up my phone interview with the hiring manager while we were still on the phone. Then a week later I got the in person interview that was 2.5 hours. Very quick turnaround to offering a job.", "Interview Questions": "Why are you interested in this position?"}, {"date": "7 Jun 2019", "title": "Item Writer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research (Washington, DC)", "Interview Descriptions": "Began with HR phone screening, the notes from which were sent to the hiring manager. Three days later I was contacted by HR to schedule an in-person interview. I met with five people, three through a video chat and two in the DC office. I was there for just over 2.5 hours, which was really draining. Everyone was nice and engaged. Wasn't really asked any difficult questions. HR told me they should know the decision within 24 hours, which was true. Found out I was no longer being considered. The job description made it sound like it was an entry-level job, and one of the interviewers said training would be available. I guess they didn't want to work with me. Who knows. So many factors go into making the final decision. Also, I'm not sure why HR began the interview process by going in depth about the good benefits; it's a little cruel.", "Interview Questions": "How do you feel about being critiqued? Do you have any experience creating assessments? How would you go about selecting passages? "}, {"date": "9 Oct 2022", "title": "Research Assistant - Youth, Family, Community Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research (Austin, TX) in Jun 2019", "Interview Descriptions": "I had a phone interview with the HR Recruiter. I moved onto the the second round of interviews. I had two back-to-back interviews with 3 people in each interview. Each interview was 45 minutes. I prepared for the interview days in advance. I went over the requirements and how the aligned with my experiences and so much more. However, the questions asked were very data heavy (unexpected!). I took me a little longer to come up with responses since having strong analytical skill was not mentioned int he job description. I noticed one of the interviewers (in the first interview), who was a junior level staff, was smirking almost laughing. That completely threw me off! The second interview was a lot better. Overall, the first interview was completely unprofessional. Maybe just laugh at someone during a call. If you expect someone to have data software skills, then maybe mention that in the job description. Or how about maybe understand that it's an entry level role and those skills can be learned! I would suggest training junior level staff on how to conduct interviews (let go of your ego).", "Interview Questions": "Tell me about yourself. Why AIR and why this research? Use of data."}, {"date": "27 May 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "I was contacted by the HR after submitting resume online. Had three rounds of interviews with five different people. Overall the interviews went pretty smoothly. The questions were pretty standard but we had to video calls, which I found a little bit confusing at first.", "Interview Questions": "Some statistics questions since my job is quantitative. "}, {"date": "1 May 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research (Washington, DC)", "Interview Descriptions": "My interview was over 4 hours long. I first spoke with HR, who gave me an overview of the workplace's policies. Then I interviewed with 2 more people who I would have been working for/with in person, and interviewed with another via Skype.  I followed up with the company via email thanking them. I never heard back from them- neither an offer nor a decline. Dissapointing to not even hear back.", "Interview Questions": "Do you have experience working with people who are not physically in the same place? "}, {"date": "6 Sept 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at American Institutes for Research (Boston, MA) in May 2019", "Interview Descriptions": "I applied for the Research Assistant position available in the Boston office. I received an invitation to do an initial phone interview shortly after I applied and was then scheduled to have a follow-up phone interview with the principal researcher of the project.  After this interview, I received an email that same day requesting an in-person interview with AIR staff. This third round of interviews consisted of three, 30-minute virtual interviews with different staff involved in the project and one informational interview with a current in-office RA.\r\n\r\nDespite sending multiple follow-up emails, I did not hear back from the recruiter for another three weeks. After three weeks, I received a reply from this recruiter letting me know that the team would be making a decision that day, and would get back to me later with the result. They then emailed later that evening informing me that the team wanted to extend me a job offer, and I would receive an offer letter in two days. \r\n\r\nIt was the day after I had received this good news that I received an email from the recruiter informing me they were rescinding the job offer because the project funding had not been confirmed, and would get back to me if there was an update. Even after following up several times, I never heard back from the recruiter, nor anyone from AIR. Personally, I saw this as unprofessional and was very frustrated given that the interview process took 7 weeks and was three stages. My advice: be sure to ask about project funding when you interview with AIR for a project-specific RA position.", "Interview Questions": "Why do you want to work for AIR?"}, {"date": "22 Oct 2020", "title": "Senior Data Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research in May 2019", "Interview Descriptions": "There was an initial call with HR to establish salary expectations and basic and eligibility, followed by a phone interview with a senior team member, and an in-person interview with the team and other key personnel.", "Interview Questions": "What the tuning parameters of my GBM were."}, {"date": "27 Apr 2019", "title": "Web Designer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "I applied through glassdoor,  I got an online exam link to complete as a next step in the hiring process which was multiple choice questions it had a basic web design and coding related questions, after couple of days I got an email from HR for a telephonic round with HR. it was nice and positive, after HR interview I had Technical telephonic round. questions were very specific to coding, just a couple of technical questions . which I couldn't answer other questions were about experience and background. My technical round experience was not good. just I couldn't answer two technical questions which do not mean I can not code or don't know anything about web design HTML & CSS. \r\n\r\nI had a very positive feeling for the job as all skill set and experience were matched.", "Interview Questions": "About background and past experience - web design related work "}], [{"date": "28 Sept 2019", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research in Apr 2019", "Interview Descriptions": "The HR did not call me after 10 minutes after the time we decided together for starting the interview. I called the HR, and was told that she was busy with something else. Also, she stressed that I should not call her, and should just wait for her call...I did not know what to say (shouldn't I call to double check when you are not calling me, during this scheduled interview time??). This was very unprofessional.", "Interview Questions": "Briefly introduce yourself."}, {"date": "20 Nov 2019", "title": "Psychometrican Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research in Apr 2019", "Interview Descriptions": "they briefly introduced their project, and asked more details about my research projects written in my resume, some questions about data calibration and scoring. Then they asked if I had any questions for them", "Interview Questions": "How strong stats skills do you have"}, {"date": "2 Jun 2019", "title": "Data Scientist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Institutes for Research (Washington, DC) in Apr 2019", "Interview Descriptions": "The interview process was surprisingly quick -- I applied online, heard back from HR the next day, and set up a quick phone interview with HR and a 30 minute phone interview with the hiring manager for the following week. Then the next week I went in for two and a half hours of in-person interviews. From applying to job offer took exactly three weeks.", "Interview Questions": "Tell me about this project"}, {"date": "21 Mar 2019", "title": "Database Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "The outreach is a phone interview, then if the qualification are a match, you are called in for a face-to-face.  There are at least three people involved in the interview process asking a list a pre-interview questions.", "Interview Questions": "My experience in previous job"}, {"date": "13 Mar 2019", "title": "Research Support Staff Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "First there was a phone call with the recruiter, then a phone call with the hiring manager, and lastly, an in person interview with the hiring manager, the HM's supervisor, and HR.  Interview process moved quickly.\r\n\r\nDuring my first call with the recruiter, I was told the job title and salary would be x.  When they made me an offer, it was for less money than originally offered, and for a lesser title, although the responsibilities would remain the same.\r\n\r\nAlso worth noting that the most senior level exec that I met has a very negative ethos - \"I don't want any victims here.\"  A more positive perspective would have been \"I want empowered people here\".  Why are people thinking of themselves as victims?  And also, the lack of empathy being demonstrated by sneering at self-described \"victims\" is disconcerting. \r\n\r\nI very politely and promptly turned down the offer and didn't even get an acknowledgement from the recruiter.  I'm sure different departments operate differently -- consider yourself warned.", "Interview Questions": "Have you ever had to work with difficult personalities?"}, {"date": "26 Jul 2019", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 months. I interviewed at American Institutes for Research in Mar 2019", "Interview Descriptions": "The interview process was long, a little disorganized, and without much word in between rounds. I had two phone interviews and a final video interview over the course of several months. The video interview included a 15 minute conversation with my recruiter, and then three 30 minute interviews with researchers. My recruiter and interviewers were all very, very nice and seemed genuinely interested in me and the work I'd done previously. My only complaint is the amount of time it took in between rounds and then to finally hear back (six weeks after last round).", "Interview Questions": "How do you manage your time when you have multiple things going on at once?"}, {"date": "13 Feb 2019", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "First I submitted my resume and my cover letter. Then I went through a phone interview with a few people. Then I was interviewed with multiple people in person (maybe 4 people total).", "Interview Questions": "What is your biggest weakness?"}, {"date": "11 Feb 2019", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at American Institutes for Research (New York, NY)", "Interview Descriptions": "Contacted by a recruiter to schedule a screening interview by phone after applying on company website. The interviewer was very rushed throughout the process and seemed eager to get on to the next question and the next interview. The interview lasted fifteen minutes.\n\nThe interviewer detailed the job responsibilities and asked me to detail my previous research experience. \n\nThey told me that AIR has a preference for Stata.", "Interview Questions": "Salary expectations"}, {"date": "27 Feb 2023", "title": "Psychometrician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at American Institutes for Research in Feb 2019", "Interview Descriptions": "It was a very difficult interview with six individual interviews in 3 hours. A lot of overlap between the interviewers and by the time it was over, I wasn't sure if I still wanted the job.", "Interview Questions": "Tell me a bit about yourself."}, {"date": "26 Jan 2019", "title": "Project Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "It was pretty straightforward. At this place it does help to know someone, otherwise it is the luck of the draw in terms of getting a call back. Referrals are preferred. But I did one phone interview then came in for two face to face interviews.", "Interview Questions": "Describe myself as an individual and my core values."}], [{"date": "23 Jan 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "In the early stages of applying to AIR, I was confident in putting my best foot forward and kept an open mind well throughout the process. Fortunately, I was contacted by a recruiter who located a most recent opening and thought my skills and abilities would be a great match for the role - I applied the same day after receiving the email. Within the same week, I conducted an initial phone interview with my recruiter who inquired me to share my personality traits more so than solely my experience which gave me the impression that AIR is more interested in me as an individual than just what I have to offer based on my resume. Following the initial phone interview, I conducted another phone interview where I was asked to elaborate on my experience and was given the liberty to ask about projects I would potentially work on. One week following my second phone interview, I conducted a video interview with three researchers of the company and they were beyond helpful with providing in-depth analyses of their work and answering my questions.", "Interview Questions": "Can you describe your experience managing multiple projects?"}, {"date": "21 Jun 2020", "title": "Psychometrics Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research (Washington, DC) in Jan 2019", "Interview Descriptions": "Took about 4 hours, about 8 different people interview you at different times. I had two phone screenings, then came in for an interview in Washington DC. I mostly interviewed with two people at a time and went through about four groups of two interviewers at a time.", "Interview Questions": "What are your organizational skills?"}, {"date": "12 Dec 2018", "title": "Tier II Help Desk Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "The interview was quick and standard. I had a phone interview for about 20 minutes and was called in for one in person. Questions were both technical and personal.", "Interview Questions": "What does dna stand for?"}, {"date": "12 Sept 2018", "title": "Communications Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "Terrible, terrible system. I was contacted for the first two interviews, which went well. And then the HR emailed me for the final interview, which was going to conducted via Skype. I sent her a couple of times for the interview, and then...nothing. The HR staff straight up ghosted me. No rejection, no explanation, just nothing. I emailed her and called her several times but was ignored. She couldn't even be bothered to pick up the phone.", "Interview Questions": "What sort of qualities do you look for in a company?"}, {"date": "20 Jul 2018", "title": "Systems Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "The interview process was very fast. I applied through an staffing company. I got first round of telephonic interview with the manager then another round of skype interview with the manager and higher management. Also a round of interview with HR.", "Interview Questions": "One common question for any interview is to describe a recent problem you have solved."}, {"date": "15 Jul 2018", "title": "Software Engineer(Internship) Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "HR mailed me to set up a phone screen.  I replied within the next hour.  I got no response. Then, I tried to reach them again to schedule the phone screen. They never replied me back. At least they must have acknowledged me if they moved with other candidates.", "Interview Questions": "No Questions"}, {"date": "2 Apr 2021", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at American Institutes for Research (Washington, DC) in Jun 2018", "Interview Descriptions": "Lengthy, convoluted process. Involved many rounds of HR screen before getting to the in-person interview day. The first HR recruiter said that he lost my application file but knew he was supposed to call me. The calls with HR were not scheduled - it was as if they called at random to catch the candidate off-guard.", "Interview Questions": "Where do you see yourself in 5 years?"}, {"date": "10 Aug 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at American Institutes for Research (Washington, DC) in Jun 2018", "Interview Descriptions": "I was contacted via email to schedule a phone interview with an HR person about a week after completing my online application. The phone interview was strange because it basically repeated questions that were asked on the online application. It was very brief, maybe 10 minutes long. At that point, I was told that I would be contacted if the Research team was interested in interviewing me. About a week after the phone interview, I was contacted to schedule another interview at the D.C. office (although I've heard from friends that there is an option to interview via video chat if you are not local). It was a long event, where I interviewed again with someone from HR and four people from the Research division. It was a good opportunity for me to paint a fuller picture of myself and make more of an impression than if I had a more traditional 30-45 minute interview with one person, and I think it helped me get the job. Everyone was very friendly, and they mostly asked background questions about my education and professional experience; there were very few behavioral questions. As I was interviewing for other positions at the time, the interview process helped me decide that AIR was the right fit for me. About two weeks after the in-person interview, I got a call from HR with an official offer. I was given a few days to give them my answer, which I took advantage of. While the salary is certainly competitive for an entry-level position, salary negotiation was not at all welcome. It was actually a little awkward how taken aback the HR person was when I attempted to negotiate. I assumed that salary negotiation was expected; even though they were unable to negotiate, they could have been more polite/understanding in refusing the negotiation. I say this because salary negotiation, while a difficult skill, is important particularly when it comes to pay equity and I believe it is a practice that should be much more openly discussed. All told, the hiring process took about a month and a half, so it wasn't super speedy but it was much faster than other organizations I applied to.", "Interview Questions": "Tell me about your research experience."}, {"date": "10 Jun 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research in May 2018", "Interview Descriptions": "The process was very straightforward. I applied online and within the same day was contacted by HR to set-up a screening interview with an interview, which took place the following week. Then two weeks after that, I had two Skype interviews (in the same day) with 2 staff members and then a senior manager. I got an offer the following morning. Throughout the process, everyone was very warm and easy to talk to.", "Interview Questions": "Asked to elaborate a lot on past research experiences"}, {"date": "29 Apr 2018", "title": "Office Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "They were very focused on tasks rather than management or educational accomplishments. I felt like I was walking into a nail salon. The office was unorganized and the receptionist desk had masking tape holding it together", "Interview Questions": "Why do you want this job?"}], [{"date": "11 Apr 2018", "title": "Health Policy Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at American Institutes for Research", "Interview Descriptions": "One phone interview, followed by entire day of in person interviews with staff and senior researchers, half hr research presentation followed by questions. Lunch interview. And interviews through video conference. Long waiting period to get back. Very pleasant staff and very hospitable", "Interview Questions": "Detailed research methodology questions"}, {"date": "25 Feb 2019", "title": "Data Reporting Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Institutes for Research (Washington, DC) in Apr 2018", "Interview Descriptions": "There are three rounds of interviews. I talked with the HR first on some behavioral questions. Then I was taken to a computer room to do an assessment, which tests the candidate's writing and analytical skills. The third round was interviews with their team leader and four team members one by one.", "Interview Questions": "Do you have any project management experience? \r\nCan you do presentations? \r\nTell me about your understanding of this position.\r\nTell me the difference between SPSS, SAS and STATA. Which is your favorite one? "}, {"date": "31 Mar 2019", "title": "Project Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American Institutes for Research in Apr 2018", "Interview Descriptions": "Very easy simple interview with Human Resources. But since the first moment, they told me that the salary was 50k max, and ask me if I was ok with that. I said that it was dependent on other benefits but the interviewer did not sound happy after that.", "Interview Questions": "She went through each requirement in the job posting. Not difficult but more or less robotic"}, {"date": "22 Sept 2019", "title": "Assurance Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research (Washington, DC) in Apr 2018", "Interview Descriptions": "HR 1st round - phone interview, background questions, behavioral questions, overview of internship roles, Q&A\r\nManager 2nd round - phone interview, mostly behavioral questions, explain the internship role, its impact and significance, Q&A\r\nOverall about  2 weeks", "Interview Questions": "Have you worked in a team? How would this internship help you?"}, {"date": "19 Mar 2018", "title": "Quantitative Modeler Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "Applied on line. Hr Contact. Hiring manager interview. Too details in technical issue such as regression, data, logit, probit, survival analysis, statistics. Very details. How do you solve the issue of missing data.", "Interview Questions": "Regression, mising data"}, {"date": "5 Mar 2018", "title": "QA Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at American Institutes for Research (Washington, DC)", "Interview Descriptions": "1st phone interview with HR basic simple overview of previous work. 2 nd round with QA team just basic questions. Then called for onsite interview which was good and everything was positive. Answered most of the questions but the interviewees were judgemental most of the time. Worst experience anyway didn’t wanted to work with those ladies in team.", "Interview Questions": "What is functional testing?"}, {"date": "3 Apr 2018", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 4 months. I interviewed at American Institutes for Research (San Mateo, CA) in Mar 2018", "Interview Descriptions": "Email correspondence with the H.R. representative  was slow and disorganized. The process lasted from December to March.  It consisted of an initial phone interview, second GotoMeeting interview with research team, and job offer. In the interim I was able to find a job that was all around a better fit, and declined their offer.", "Interview Questions": "Describe a time when you experienced difficulty in a team setting, and how did you overcome that obstacle?"}, {"date": "5 Apr 2018", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 5 weeks. I interviewed at American Institutes for Research (Washington, DC) in Mar 2018", "Interview Descriptions": "I submitted my application online and a recruiter called me to schedule a phone interview with a senior member of the team. The phone interview lasted about an hour and was very technical due to the technical nature of this position. Following the phone interview, I was asked to complete a coding assessment within 3 days. About two weeks after I submitted the assessment, the recruiter reached out to schedule an in-person interview with the entire team at the headquarter in DC. The half-day interview took about 3 hours, with half-hour time slots with different team members, from senior level to associate level. \r\n\r\nI would say that the phone interview and the coding assessment were definitely okay overall, but the in-person interview was a bit confusing and also very stressful, because of the various different (even conflicting) expectations from different members of the team about this position. I was asked a lot of technical questions for which one of the interviewers was expecting a certain fixed answer, and the in-person interview was actually different than I had imagined. I was also asked questions about experience and qualifications that were not included in the job description, and it seems that the interviewers did not quite get on the same page about what to expect about this role. Overall, I would say that this entire interview process was very stressful and mildly unpleasant.", "Interview Questions": "How do you transform a data set given the distribution of the data."}, {"date": "26 Feb 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at American Institutes for Research in Feb 2018", "Interview Descriptions": "I did interview with recruiters at AIR. It was a simple phone interview asking if I am interested in the position. She explained me the salary and job descriptions. Also asked what is the available start date/graduation date.", "Interview Questions": "What qualitative/quantitative skills do you have?"}, {"date": "20 Mar 2018", "title": "Data Analyst (SQL) Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research in Feb 2018", "Interview Descriptions": "Applied Online. Got an email from recruiter to complete an SQL assessment. It was very easy. HR scheduled a phone interview with a Data Analyst and Manager. The manager seemed hurry and asked few basic questions in SQL.", "Interview Questions": "Basic SQL Questions"}], [{"date": "26 Jan 2018", "title": "Senior Software Developer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1+ week. I interviewed at American Institutes for Research (Washington, DC)", "Interview Descriptions": "I got a call from recruiter followed by an online test. Then one hr round. I was not ready for video call but hr did go for video later hr decided not to move with me.", "Interview Questions": "Online test has sql n data structure questions."}, {"date": "19 Jan 2018", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. I interviewed at American Institutes for Research", "Interview Descriptions": "Used to be an intern. Got hired after graduation. Only had one interview with a high level person. We talked about what projects they have and what might be of interest for me.", "Interview Questions": "They introduced the project and asked about my interest and what part of the projects I'd like to be involved with."}, {"date": "9 Jan 2018", "title": "Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at American Institutes for Research (New York, NY)", "Interview Descriptions": "Initial phone call with HR followed by online sql assessment and technical video interview with technical lead. I was invited for on-site interview which has practical sql assessment for 1 hr and two rounds of technical interviews with the team along with brief interview with HR.", "Interview Questions": "Multiple sql technical questions and Case study with open ended questions"}, {"date": "6 Apr 2018", "title": "Help Desk Support Tier Two Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 months. I interviewed at American Institutes for Research (Reston, VA) in Dec 2017", "Interview Descriptions": "They asked me a few basic technical questions and gave me scenarios on hows I deal with certain types of customers. The interview process was very quick. It only took about 30 minutes", "Interview Questions": "What is the difference between a DNS server and a Domain"}, {"date": "8 Nov 2017", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at American Institutes for Research", "Interview Descriptions": "I had a phone interview with the HR person in DC office and an on-site interview with 4 colleagues in the San Mateo office (where I'm working). We mainly discussed my past experience in quantitative research and data analysis, and the statistical software skills I have.", "Interview Questions": "talk about your research project "}, {"date": "23 Dec 2017", "title": "ELearning & Training Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research (Washington, DC) in Nov 2017", "Interview Descriptions": "The interview process included an initial phone screen with HR, followed by a 30 minute phone interview with the hiring manager.  After those interviews, I interviewed in person two days later: 4, 30-minute interviews back to back and a writing test. After that the hiring manager wanted to do another 30 min phone interview the following week. The hiring manager made me a verbal offer in the last phone meeting, discussed my salary expectations which were on target with hers, discussed a starting date and that they wanted to switch the role to a contract position for the first 3 months, to which I agreed. She told me she'd have the HR personnel follow up with me and that she was excited to have me come aboard. I waited a week for HR to contact and then followed up. The HR person indicated that the hiring manager had not contacted her with offer information for me and that the hiring manager still wanted to interview other candidates and would make a decision and notify me on a specific date in a week. A week later the HR person told me I was still under consideration but they would be pushing their decision back by another week. That week came and went and I was not notified either way. \r\n\r\nIn all, aside from my meetings with HR and the four individuals, the interview process was disorganized. Each thirty minute interview was rushed and didn't offer enough time to have reasonable discussions, but each person I met with still tried to have a good interview meeting despite the rush. Also the hiring manager was rushed in all three of the meetings I had with her and obviously it left a bad taste to be offered the job by the hiring manager and then to not even be directly told that the offer is being rescinded or rethought or why. She asked me to prepare some materials for the interview, which I did and then apparently did not remember what materials she had asked for also didn't have time to look at them. \r\n\r\nThe hiring managers at this firm need additional training from HR on how to conduct interviews well: how long a quality interview should be, how to prepare yourself and questions prior to an interview in order to gather the data you need to make a decision in an organized and timely manner and of course what questions you can legally ask candidates so as not to open the company up to any legal exposure. No one took notes in any of minutes and essentially just asked me questions off the cuff.\r\n\r\nI've known other employers who work from a list of set questions when interviewing multiple candidates to ensure equitable comparison, to ensure of course notes are taken rather than working from memory to make a hiring decision and to ensure they don't discuss things they shouldn't with candidates.\r\n\r\nAlso be considerate of the effort candidates put into in their job search and make sure that hiring managers have the time to evaluate candidates, their work and respond in a reasonable timeframe or certainly in the time frame you commit to respond in.", "Interview Questions": "General interview questions about my professional background and interest in the role and the company. However the hiring manager, a Vice President, did ask me an illegal question regarding what did my spouse do for a living I'm assuming so she could get a sense of how long did I plan to be living in the area. And another interviewer inadvertently asked me if had children but did take back the question after they, I believe, realized, it was inappropriate for an interview\r\n\r\nWhere do I see myself in five years?"}, {"date": "27 Jan 2018", "title": "Science Assessment Item Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at American Institutes for Research in Nov 2017", "Interview Descriptions": "The interview process at AIR is as disorganized as the organization itself. I applied at the beginning of November, had a phone screen two weeks later, a phone interview with the hiring manager two weeks later, then a test & Skype interview two weeks after that, and I still have never been informed where my candidacy stands (3 months later). I checked in two weeks after my Skype interview and they told me a decision had not yet been made. I have not heard from them since. The phone screen was pretty standard and the recruiter very nice. The phone interview was the total opposite, the woman on the other end seemed uninterested in talking to me and wanted me to design questions on the spot for topics I had not studied since high school. The Skype interview was better, but a lot of the people told me just how disorganized and chaotic their organization was. While I appreciated their honesty, this may not be the best way to sell your organization to a potential employee. Overall, even if they had offered me a position, I would have politely declined because it was evident there are a lot of problems and chaos in the assessment department. This is also clear reading employees reviews.", "Interview Questions": "How would you design a test question that incorporates the NGSS standard of engineering a solution and Newton's Second Law of Motion."}, {"date": "22 Aug 2017", "title": "Science Test Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research (Washington, DC)", "Interview Descriptions": "First, was a phone screen with HR, followed by phone interview with Senior Manager a few days later. A day after the phone interview, received invitation for on-site visit to meet with 5-6 people. 1hr long test. Spoke with HR about benefits and chatted with several staff members.", "Interview Questions": "What interests you about this job?"}, {"date": "1 Aug 2017", "title": ".NET Developer Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "HR and the tech team was good. The whole interview process was fast and efficient. Wish I had more experience on C# and database design. The recruiting team are eager to hire talented .NET developer.", "Interview Questions": "Database design questions and C# knowledge"}, {"date": "24 Aug 2017", "title": "Senior Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research (Washington, DC) in Jul 2017", "Interview Descriptions": "There we three steps.  The first was video conference with the recruiter followed by technical phone interview. The last step was onsite interview with senior engineer, technical director, and technical project manger.", "Interview Questions": "Questions related to data structures."}], [{"date": "28 Jun 2017", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "It was an interesting experience... a recruiter calls out of the blue and begins to ask questions about salary, interest in working at the organization, and start date. Was very sudden and difficult to prepare for. I was told I would be contacted for a follow up interview but was never reached again.", "Interview Questions": "What kind of salary range are you looking for?"}, {"date": "17 Jun 2017", "title": "SQL Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at American Institutes for Research", "Interview Descriptions": "At first, the HR replies the email very quickly. Even though she postponed my interview but the first interview was smooth and delightful. She asked me some general SQL questions and about my expected salary, when can I come to work, etc. Then she scheduled my next technical interview next week and told me about the overall process. She promised to send me detailed information later and looked forward to keeping in touch with me. I thought she was so efficient and thoughtful. Then came to the interview day, I waited and sent email, no reply and no phone calls. It's been two weeks after and still no update. I could understand that they may have better candidates or the position is filled. However, I would really appreciate if they could give me a reply.", "Interview Questions": "some general sql questions."}, {"date": "29 Dec 2017", "title": "Communications Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at American Institutes for Research (Chicago, IL) in Jun 2017", "Interview Descriptions": "I applied for the job in May, in June I had a phone interview, followed by an in-person interview at the Chicago office.  It was a long interview and a combination of multiple people in-person and via Skype over a couple hours.", "Interview Questions": "N/A"}, {"date": "28 May 2017", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at American Institutes for Research (Washington, DC)", "Interview Descriptions": "Met with four senior level folks. We discussed my project management skills. They wanted to know about my technical skills. They asked about my education background. They asked about my past experiences. They wanted to know if I worked on multiple projects at the same time.  They wanted to know if I had experience with folks from outside engineering.", "Interview Questions": "They asked about project management skills."}, {"date": "19 May 2017", "title": "Psychometric Support/Research Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "I applied for the position on the AIR website. I was initially contacted by an HR rep via email about 2 weeks after I had applied. We set up a short (15-minute) phone screening, which was then followed by a 30-minute phone interview with two managers. This went well and so they immediately scheduled me for a 2 1/2 hour GoTo Meeting (similar to Skype). I talked with HR, then rotated with a couple people who were in the position I was applying for,  as well as a couple Psychometricians. Overall, the interview went smoothly. I ended the interview feeling pretty confident. I was told I would hear back a week later. I didn't hear anything from HR, so I followed-up and was told they chose someone else", "Interview Questions": "They mainly wanted me to explain my research experience. They did, however, ask me a few statistics related questions."}, {"date": "21 Apr 2017", "title": "Researcher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "The interview process occurred over 4 months; communication for interview scheduling and at follow-up was poor. I applied online, had an initial interview and then a second interview two months later. In the second interview, I gave a research presentation and then met with several employees one-on-one throughout the day. The questions that I received were normal, nothing challenging (tell me about your research, your experience, etc.).  After my interview, communications with AIR went silent. HR did not respond to my follow-up email two weeks after my interview inquiring about the status of my application. I didn't hear anything until a month later (following an additional follow-up e-mail) when I was told they gave the position to somebody else.", "Interview Questions": "Tell me about your research."}, {"date": "6 Apr 2017", "title": "Data Analyst Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 weeks. I interviewed at American Institutes for Research (Washington, DC)", "Interview Descriptions": "Two rounds of phone screen followed by an onsite interview. They asked a lot of technical questions  on SQL and some questions on Excel. The overall experience was very professional and efficient and people there were very nice.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "13 Apr 2017", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research (Washington, DC) in Apr 2017", "Interview Descriptions": "Applied online. I had one screen interview with HR, followed by phone technical interview and onsite interview. Questions on Data structure, Algorithms, C#.Net, SQL, Multi threading, Problem solving skilss, Database queries.", "Interview Questions": "Parallel Programming."}, {"date": "6 Dec 2017", "title": "Test Development Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research (Washington, DC) in Mar 2017", "Interview Descriptions": "The interview process was fairly unique. I met with 3 different members of the team and had 30 minute long interviews with each of them. The conversations were fairly relaxed. It seemed like they were just trying to assess if I would be a good fit for their team.", "Interview Questions": "What is your teaching experience?"}, {"date": "13 Apr 2018", "title": "Test Developer Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at American Institutes for Research (Washington, DC) in Mar 2017", "Interview Descriptions": "Was contacted by third party recruiter for temporary position. Setup interview within 1 week. Interview was over phone with 3 senior test developers. Was given job offer within 1 week of interview.", "Interview Questions": "Do you have any programming knowledge?"}], [{"date": "27 Sept 2018", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at American Institutes for Research (Washington, DC) in Mar 2017", "Interview Descriptions": "It took 3 months. The first round interview was a phone interview asking behavioral questions. The second round was a go-to-meeting interview with two senior researchers and they ask a lot about my previous experience and statistical background.", "Interview Questions": "Tell me about research projects you have previously done. "}, {"date": "3 Feb 2017", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American Institutes for Research (Chicago, IL) in Jan 2017", "Interview Descriptions": "I applied online and a few days later received the HR's email scheduling an initial telephone screening. It was quite standard and lasted 10-15 minutes collecting basic information, at the end of the call the HR asked me to submit a set of my independent writing samples in order to be considered for the second round of interview. I emailed her three writing samples of mine and waited for about 2 weeks before they further contacted me to schedule the second phone interview with the hiring manager. The second interview lasted for about 30 minutes asking for experience in relevant skills required by the position. It was a pleasant conversation and the hiring manager was friendly and courteous. 3 days later I was informed to confirm with a date for an onsite interview. Flight and accommodation were both taken care of by AIR, which was good. The onsite interview was 3-hour long talking with 6 interviewers with a 2-interview panel in each hour, starting from those who are in the position I applied for to senior fellows. 3 of them were in the DC office, so it was part remote. All of them were friendly and courteous and asked questions basically related to my research experience and particular skills with very few behavioral questions as I remember. The last hour with two senior fellows was a lot more technical and difficult than with the previous two panels. I gave half-baked answers to two questions in this round. Overall it was a positive experience meeting nice people, and the entire process was very professional. Two weeks later I was informed that they just chose someone else.", "Interview Questions": "How could you ensure the validity of data collected from surveys? "}, {"date": "7 Dec 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American Institutes for Research in Jan 2017", "Interview Descriptions": "Apply, Hr phone screen, phone call with manager, interviews either onsite or via video,  job offer\r\n\r\nVideo interview felt long. Interviewed with 2 people at a time for an hour. Did two sessions of that then one final one with one person for 30 min.", "Interview Questions": "Software capabilities and how and when I have used them"}, {"date": "5 Jan 2018", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 weeks. I interviewed at American Institutes for Research (Washington, DC) in Jan 2017", "Interview Descriptions": "Assessment,Interview and Final Assessment on Sql Scripting questions.Mostly on Sql and the scripting.There will be conceptual and also scripting questions on various requirements.Should have good knowledge working on Sql.Assessment,Interview and Final Assessment on Sql Scripting questions.Mostly on Sql and the scripting.There will be conceptual and also scripting questions on various requirements.Should have good knowledge working on Sql", "Interview Questions": "Pivot tables"}, {"date": "9 Feb 2017", "title": "Principal Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at American Institutes for Research (Washington, DC) in Dec 2016", "Interview Descriptions": "Phone screening with the recruiter followed by phone interview with two senior software engineering managers. They mainly asked theoretical technical questions and had specific answer in mind. Any alternative valid options were not taken seriously. It was obvious that the interviewers were not able to evaluate analytical problem solving creative thinks skills.", "Interview Questions": "What is the minimum and maximum number of entries in a JOIN operation?"}, {"date": "22 Oct 2016", "title": "Program Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "Applied online and received a call after 2 weeks from a recruiter to set up a 15 min phone interview. That went well, the recruiter was very friendly and professional. The recruiter then set up a 30 min phone interview with the hiring managers (researchers ) for the following day which was a total joke. There  was some awkward silence and over all the interaction was very dull and unattractive. As they went along with explaining the position, I started to lose interest with the position and the people I may be working with.", "Interview Questions": "Basic interview  questions. Why did you choose AIR and the position etc"}, {"date": "28 Sept 2016", "title": "Psychometric Support/Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at American Institutes for Research (Washington, DC) in Sept 2016", "Interview Descriptions": "The total process once I received the first call from the recruiter took about three weeks, it was very quick. I applied online through Indeed and got a random call a few weeks later asking me to do a brief, easy phone screening. The next step was a 30 minute phone interview which was also very easy and straightforward, asking mostly about my interest in the position and my research experience.\r\nThe final step is a 3 hour in-person interview; since I was traveling out of the country we scheduled a skype interview, and I spoke with 6 different individuals for 30 minutes at a time. Fairly straightforward and mostly similar, asking me mostly about my research experience, why I was interested in working for AIR, and my future plans etc. \r\nI found out a week later I got the offer.", "Interview Questions": "Tell me about your undergraduate research experience and talk a little about working independently and with others"}, {"date": "11 Dec 2016", "title": "Network Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research (Washington, DC) in Sept 2016", "Interview Descriptions": "a recruited contacted me and scheduled a 30 minute interview with the IT director. basic questions mostly on my background and on the job description. passed that and got another 30 minute technical interview. was good and got a third face to face interview with 6 people who i work with each with 30 minutes.", "Interview Questions": "what is your interest in the future ?"}, {"date": "16 Jun 2016", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied through a recruiter. I interviewed at American Institutes for Research", "Interview Descriptions": "The process was long and confusing. I did 3 phone interviews, one all day interview where I had to give a \"job-talk\" similar to a talk given for an academic job and a second 2 hour interview. After that I waited for more than 2 months for a decision. The whole process took longer than a federal job.", "Interview Questions": "Statistical methods?"}, {"date": "4 Jun 2016", "title": "Test Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at American Institutes for Research", "Interview Descriptions": "The recruiter was friendly. The next round..the hiring manager was condescending and dismissive before I even got a chance to explain or sell myself. She acted as if she was annoyed she had to speak to me...100% rude. Additionally   she immediately yawned and sighed after i just answered hello.", "Interview Questions": "Why do you consider your nonpaid graduate research relevant?"}], [{"date": "27 Jan 2017", "title": "Item Writer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at American Institutes for Research (Washington, DC) in Jun 2016", "Interview Descriptions": "Three interviews, one face to face, two by phone. They had an editing task where they had random writing samples which were to be edited. The expectation was that the item writer knows obscure science facts by rote.", "Interview Questions": "They asked how good I was with getting critiqued."}, {"date": "11 May 2016", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at American Institutes for Research (Chicago, IL) in May 2016", "Interview Descriptions": "Received a call from HR to set up a phone interview with a lead software developer on the team. When talking to the developer we discussed class work and went over my resume.  About half way thought the interview he called me (female) sweetheart. While the interview went okay, I was not planning on taking the job after that.", "Interview Questions": "What is the difference between a stack and a queue"}, {"date": "11 Jun 2016", "title": "Test Development Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at American Institutes for Research (Washington, DC) in May 2016", "Interview Descriptions": "Screening interview with HR, phone interview with manager, flew me out for third interview during which time I took a one hour test and had a half hour interview with 5 different team members. It was almost s 4 hour process.", "Interview Questions": "Tell me more about your experience."}, {"date": "29 Dec 2017", "title": "Item Writer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at American Institutes for Research (Washington, DC) in May 2016", "Interview Descriptions": "American Institutes for Research offered me an interview after I submitted an online application. They flew me out to DC (even though I would be working in Chicago) for an extensive interview process that involved a skills assessment in which I was given 30 minutes or so to perform specific job-related tasks such as writing content. Then, I had six different one-on-one interviews with people of various rankings within the organization, including the vice president, the director, and a staff manager.", "Interview Questions": "They asked me to explain in detail my process for writing assessment items."}, {"date": "24 Apr 2016", "title": "Psychometric Support/Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research (Washington, DC)", "Interview Descriptions": "There were three interviews in total. First a brief (15 min) phone interview, then a 30 minute phone interview the following week, followed finally by a 3 hour interview on sight.\r\n\r\nThe first interview was pretty standard (why are you interested in working here, etc.); the second was more about my experience; and the third was fairly similar to the second but on sight and with more people.", "Interview Questions": "What are your research interests?"}, {"date": "25 Nov 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Institutes for Research in Apr 2016", "Interview Descriptions": "The recurter called and told me the description of the job. Made an appointment for a phone interview. On the phone interview day nothing hard was asked... The interviewer mainly described the job and asked if that is something I would be interested in", "Interview Questions": "They just want to know if what they are offering you is something that you would interested in doing"}, {"date": "21 Apr 2016", "title": "Linux Administrator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research (Washington, DC) in Apr 2016", "Interview Descriptions": "I have done many phone interviews, but nothing has been as odd as my experiences with AIR.  First call was a quick series of technical questions that were almost unrelated to the job offered.  The questions were programming oriented questions for a Linux systems administrator job.  I thought that was the end of it and was sent a email stating I was not selected.  Shortly after I was emailed again asking for a second phone interview.  They canceled that one at the last minute.  It was rescheduled and we started talking about my past experience.  Mid way though me talking they said it was 'not a match' as they were looking for 10-15 years of experience in the Linux systems administration field and I had about seven.  \r\n\r\nI hear that AIR is a great place to work but they have a pretty unusual set of gatekeepers there.", "Interview Questions": "Unrelated to the job being offered."}, {"date": "26 Apr 2017", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research (Chicago, IL) in Mar 2016", "Interview Descriptions": "very positive interview process overall. The lady who contacted me was friendly and explained the organization completely. They seem like a solid company really focused on the benefit of supporting schools and educators.", "Interview Questions": "Given all of the sources of information circulating on the internet, how do you consider which sources to site and which to leave out?"}, {"date": "1 Mar 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research in Feb 2016", "Interview Descriptions": "Submitted an application online, didn't hear back right away.  Several weeks later I get a call from someone in HR looking to do a phone interview on the spot.  They called at 1pm while I was at work and I didn't pick up the phone.  Returned their call and left a message with some times that would work for me and directed them to email me if they'd like an alternate time.  No response.  2 days later the same woman calls again at 10am (not one of my suggested times).  I call back and get a voicemail - leave a nearly identical message to the 1st.  This goes on for a week or so, back and forth.  I stopped trying to call back - if they can't be bothered to schedule something in advance or communicate with applicants in a reasonable way I can only imagine how awful it must be to actually work there.", "Interview Questions": "N/A"}, {"date": "9 Feb 2016", "title": "Research Analyst Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "Preliminary phone interview. Followed by an in person interview. Was never able to schedule the in-person interview as they kept cancelling and rescheduling with little notice. As I had several job interviews occurring at the same time, after the third cancelling of my in-person interview, I decided to decline the offer to come in and pursue several other opportunities that were moving along more quickly.", "Interview Questions": "What kind of research have you done?"}], [{"date": "7 Apr 2016", "title": "Network Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 days. I interviewed at American Institutes for Research (Reston, VA) in Jan 2016", "Interview Descriptions": "recieved a call from the recruiter.\r\nwe had a phone interview\r\ntook a behaviour test.\r\nskype interview\r\nset up date for interview with AIR\r\nmedium size room 2-3 managers from their team\r\nInterviewed\r\nreceived a call about 1-2 hours later stating i got the job.", "Interview Questions": "how have i handle a conflict in my previous work"}, {"date": "2 Jan 2016", "title": "Project Manager, Software Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research (Washington, DC) in Dec 2015", "Interview Descriptions": "The interview with the recruiter was in detail and a good experience. The first round of interviews were rescheduled with reassignment of interviewees. Then came the interview with the first technical person. It was a positive interaction with the person although the questions were not related to the position. The interview with the second technical person, although I understood the questions, the questions were not related to the position. I felt that the technical interviewers are accomplished people in the technical field. At the same is like they were not aware of the requirements of the position that they were interviewing. I initially applied because I had a good perception of the institute. Now I think that they have good people in a chaotic environment.", "Interview Questions": "Questions were not difficult but were not related to the position. The questions were more related to day to day work of the person doing the interview."}, {"date": "12 Dec 2015", "title": "Lead SQL Server Database Developer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at American Institutes for Research (Washington, DC) in Dec 2015", "Interview Descriptions": "Initial phone interview took 2 weeks to set up and schedule.  The actual interview was 5 questions delivered by a non-technical HR person.  The interview was recorded and I was told it would be played back for their technical people later.   Didn't allow for any clarification in terms of what was being asked or give/take in terms of actual discussion.  Was also asked how many miles it was for me to drive there which seems like an odd question for a phone screen.  Found out later the HR person was 1000 miles away.   No information about the company or position was offered.", "Interview Questions": "Lots of questions about Microsoft Best Practices.  Best to study beforehand as they expect you to have the answers memorized."}, {"date": "2 Dec 2015", "title": "Senior Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at American Institutes for Research (Washington, DC) in Oct 2015", "Interview Descriptions": "Process took almost three months and consisted of 11 interviews. One of which was a phone screen. On one of my interview days, two of the people I was scheduled to interview with just didn't come into the office that day and we had to reschedule the interviews as SKYPE calls. For one of the skype interviews the person actually didn't realize which job I was applying for and hadn't even looked at my resume. She essentially asked me questions about my current employer to try and find out what we were doing relative to the work she was doing. One of the interviewers also couldnt' figure out how to use Skype and the interview started 15 minutes late. \r\n\r\nI was brought back for a second round of in person interviews with additional leadership. I found this group to be a bit more professional but not particularly engaging other than one person. But I was told the feedback was positive and that the next step would be a meeting with the CEO. \r\n\r\nApparently while I was waiting to have that meeting scheduled, a candidate \"emerged\" from what I was told. At that point they essentially stopped communicating with me until I eventually called and put them on the spot. I was told essentially in the window while they were waiting to get the meeting scheduled they came across another candidate that was a better fit. You can read a lot into that scenario. I don't think they did anything unethical, just unprofessional and disrespectful to a candidate that you get that deep into the process with. Absolutely have the right to move on, but could have been handled a lot better.", "Interview Questions": "In hindsight I think they were more interested in my current employer and what we were doing than they were me the candidate. "}, {"date": "10 Feb 2016", "title": "Tier II Helpdesk Support Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a staffing agency. The process took 4 days. I interviewed at American Institutes for Research (Reston, VA) in Oct 2015", "Interview Descriptions": "6 panel interview. The questions are based off of your resume. Questions asked are partially geared toward the job, but a big portion is just random technical questions that make the job seem a bit more legit.", "Interview Questions": "The questions are based on your resume, so what do you think you're terrible at?"}, {"date": "28 Oct 2015", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research (Washington, DC) in Sept 2015", "Interview Descriptions": "Phone interview with HR: easy and quick. After 1 week and a half, the HR contact called me to schedule an in -person interview in their DC office. The in-person interview lasted around 3 hours: interviewed with HR, a Research Assistant, 2 managers, and back to HR. The interview went smoothly, and I had positive experience there. The HR gave me a feeling that I had a high chance to get accepted, and promised to call me whether I got the position or not. He told me that I should hear back from him in around 1 week and a half. After 4 weeks, still nothing happened. Throughout that time, I contacted the HR twice to check my status, and received responses that the Hiring Manager was still deciding. I ended up hearing nothing from them. The whole process was long and frustrating.", "Interview Questions": "Tell me a time you faced conflicts in team work."}, {"date": "1 May 2016", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research (Washington, DC) in Aug 2015", "Interview Descriptions": "I applied online in June of 2015, and was contacted to do a phone interview several weeks later. After the phone interview, I was scheduled for an in person interview with 4 people from the company that would take around 3 hours. It was rescheduled twice, but I finally had the in person interview in late August of 2015. I thought it went very well. I was promised repeatedly by the person in charge of recruiting that I would hear back from them whether or not I was accepted. He said I should be getting a call for him to tell me whether I was accepted or rejected in about a week. Two weeks went by, and I hadn't heard anything, so I left a voicemail to check on the status of my application. He said no decision had been made, but he promised to call me back with a decision even if that decision was no. He said it would be another week. Two more weeks go by, and I still haven't heard anything, so I left another voicemail and he gives me the same spiel and promises he won't leave me hanging. I never heard from them again. I thought it was incredibly rude and disrepectful of my time to promise me I would get a rejection call from them and then leave me hanging indefinitely. If they had been upfront about it at the outset and said \"due to the high volume of applicants, we only plan on notifying people who have been accepted\" I would have understood, but they specifically said dozens of times that they would notify people even if they had been rejected, and that turned out to be a blatant lie.", "Interview Questions": "Describe to us the research process of a study that you've conducted."}, {"date": "29 Apr 2019", "title": "Senior Technical Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research (Chicago, IL) in Aug 2015", "Interview Descriptions": "One human resource screening interview followed by an interview with 3 people for about an hour.  The overall process went very quickly, next steps were identified and an offer was extended about 5 days after my in person interview.", "Interview Questions": "Tell us how you analyze data"}, {"date": "18 Aug 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at American Institutes for Research (Boston, MA) in Jul 2015", "Interview Descriptions": "I got a surprise call from HR. I didn't even know which company was calling at the time and didn't know which position he was talking about since I'd applied to this position weeks and weeks ago. He seemed pretty friendly and willing to explain the position to me again. We talked about my past work experiences in education and I got an offer for an in-person interview on the spot.\r\n\r\nThe in person interview was a 2 hour long process, where I met with 5 different people, including a research assistant, 3 research associates, and one senior researcher. Everyone seemed pretty nice though they all had different styles. They focused a lot on organization and open communication skills and asked a lot of behavioral questions. I don't recall any technical questions other than a general question about whether or not I had any experience analyzing data.", "Interview Questions": "How do you manage your time when you're working on different projects at the same time?"}, {"date": "26 Jun 2015", "title": "Researcher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "After I applied online, I did a phone interview with an HR person for about 45 minutes. It was pretty casual. The next step was the on-site interview, but I did not hear back again.", "Interview Questions": "What would be the three projects I would be interested in doing after getting my PhD."}], [{"date": "28 Mar 2019", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research (Washington, DC) in Jun 2015", "Interview Descriptions": "First there was a phone call interview with standard questions about how I felt about doing mundane tasks vs. higher level tasks. Then I went in for an in-person interview where I talked with at least five different employees and the job and was able to ask them questions about the work that they did.", "Interview Questions": "I don't remember there being any hard questions! Just make sure to be able to talk about your resume in detail and provide specific examples from past experiences."}, {"date": "7 Aug 2015", "title": "Intern - Hourly Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research (Washington, DC) in Jun 2015", "Interview Descriptions": "I was contacted by HR department then I was scheduled to a Skype meeting. Through Skype,  I was interviewed by HR and was briefly told about the culture of AIR. Then, I am asked some questions to check if I'd fit socially in AIR's work environment. Later on, I was interviewed by the manager of the department I applied for. The manager asked very technical questions and answered any questions I had.", "Interview Questions": "How do you build a computer?"}, {"date": "21 Apr 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 days. I interviewed at American Institutes for Research (Washington, DC) in Apr 2015", "Interview Descriptions": "It was a phone interview which took about 15 mins. My supervisor and program director briefly described the job requirements and asked my interest of work. Since it is a summer intern, the program director said it was OK if I was not familiar with the software they were using and suggested me to learn it during the internship.", "Interview Questions": "When will you graduate?"}, {"date": "30 Apr 2015", "title": "Data Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research in Apr 2015", "Interview Descriptions": "I had a 15-min phone call with a recruiter, completed a programming quiz, and a 30-min technical phone interview with 3 people from the local office. The recruiter and quiz steps went well, but the technical interview was very bizarre and confrontational. When I mentioned two procedures I was in the process of learning, one interviewer spent the next 20 minutes asking me about only those two procedures. The recruiter mentioned they were having a difficult time finding someone to make it past the technical interview, and that does not surprise me based on the way my interview was conducted.", "Interview Questions": "In what situation would you use a hash merge? proc sql? data step?"}, {"date": "30 Jun 2015", "title": "Inern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at American Institutes for Research in Apr 2015", "Interview Descriptions": "After receiving an email about interview confirmation i was called by the Director of Software QA. He was very friendly and it felt like we were engaged in conversation more then an interview. After a few days he called back and informed that i received the position", "Interview Questions": "What was the largest programming project you have ever done?"}, {"date": "12 Dec 2015", "title": "Education Researcher Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Institutes for Research in Apr 2015", "Interview Descriptions": "I applied and received a call back from HR about two weeks later. I had a good initial call with an HR Recruiter, then a week later, I had a phone interview with three staff members from the department. From that interview I realized this wasn't the right position for me. They may have realized it, too, because I never received another email or phone call from them. It would have been good for them to send the obligatory no thank you email.", "Interview Questions": "They asked me for ideas on how to bring in new clients."}, {"date": "1 Apr 2015", "title": "Senior Contracts Administrator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "Entire process took ~three weeks.  I ppplied online.  About a week or two later, received a phone call from their recruiter to schedule a quick phone screening the following day.  Following week, they brought me in for an interview for the entire afternoon.  Spoke w/HR, then two Contracts Managers, then two Directors, and lastly, the recruiter who contacted me.  As they are a behavioral and social science research institute, questions were largely behavioral based.  Also basic questions about my resume.", "Interview Questions": "Describe your perfect job.\r\nHow would people who know you describe you?"}, {"date": "19 Mar 2015", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at American Institutes for Research", "Interview Descriptions": "Did not take too long. Interview itself was too long, nearly all day. Had to prepare and give a presentation, which seemed to be unnecessary (I never once presented while working there).", "Interview Questions": "Was I interested in getting a PhD?"}, {"date": "5 May 2015", "title": "Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research in Mar 2015", "Interview Descriptions": "The first round was a short phone interview with HR, followed by a short phone interview with a Senior Researcher from the team. This was within a short time frame, and followed by an in-person 2.5 hour interview: meeting local HR, a three person panel interview with the team, a one hour analytical task and a short debrief with HR. I was told that I would be contacted within a week but I heard nothing. I followed up by email to HR twice after two and four weeks and received no response. I would have appreciated even a template rejection email given how long the in-person interview was and really soured the interview experience which would otherwise have been positive.", "Interview Questions": "All situational questions at the panel interview: give us an example of a time when you had to work with a dysfunctional team, when did you have difficulty communicating with a client, what is an example of a complex project you managed"}, {"date": "7 Feb 2015", "title": "Research Assistant Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at American Institutes for Research", "Interview Descriptions": "The whole process lasted about three months from when I first submitted my resume in early November to when I finished my last interview in February.\r\n\r\nOverall, the process went by fairly quickly, and the hiring manager was very courteous throughout our communication. I had a pleasant experience overall. Once you're accepted to do the final interview, expect for it to last about 2.5-3 hours long. If you're traveling far, they take care of the expenses and travel accommodations including: airfare, hotel, and ground transportation.", "Interview Questions": "1) Tell me about yourself?\r\n2) What is your experience with program/project management?\r\n3) What is your communication style?"}], [{"date": "4 Feb 2015", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "Phone interview, self introduction, past research experience, research projects that I have been involved in, what role I played, one or two behavior questions, ask if I have any other related experience that might contribute to the position, if I have any questions for the company. Briefly introduced about the position, the team, location, but never really heard back from the recruiter.", "Interview Questions": "Past research experience"}, {"date": "31 Mar 2015", "title": "Research Associate (I/O Psychology) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at American Institutes for Research (Washington, DC) in Feb 2015", "Interview Descriptions": "HR contacted me a week or two after I'd made my application online. We set up a time to talk... my first conversation was with the HR rep n it lasted for half an hour. We spoke about why I wanted to work at AIR, why this position, salary expectations, etc. This was followed by me emailing them an independently written piece of research. \r\n\r\n3-4 weeks later I had my second round (phone interview) with an experienced researcher. He was v easy to talk to. We spoke about my work experiences abs background. \r\n\r\nHad to wait a while before I heard back re the in person interview. AIR covered the travel and accommodation costs. The interview lasted for 3.5 hours. I had the chance to meet 7people, including the director of the program. Everyone I spoke to was very friendly, professional and easy to talk to. They were very forth coming when it came to discussing the types of projects they work on. \r\n\r\nI heard back from HR two weeks later. The entire interview process took 9 weeks (from my first phone interview to having received the offer) and did involve having to follow up with the recruiter a few times. That having been said, everyone I interacted with was very courteos and professional in their manner.", "Interview Questions": "Tell me about a time when you worked within a team and things didn't go very well."}, {"date": "6 Jun 2015", "title": "Software Quality Assurance Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at American Institutes for Research in Feb 2015", "Interview Descriptions": "It was a fairly straightforward process. Had two telephonic interviews.\r\n\r\nI applied through university career fair. Received a call around 2 weeks later, asking if I was interested in the said position. Basic questions about my qualifications and background in testing were asked, and a technical interview was set up after another couple of weeks.\r\n\r\nThe technical interview was a conference call. I was asked about Software testing, it's role in the entire software development process, types of testing, and the importance of testing. The interviewers were also interested my knowledge of databases, primarily I assume because it was the concerned department. It might vary.\r\n\r\nReceived a call the following week that I had been selected.\r\n\r\nOverall, a very positive experience, with courteous and polite employees throughout the process.", "Interview Questions": "Do you think testing is important in the entire software development process? Why?"}, {"date": "20 Mar 2015", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 months. I interviewed at American Institutes for Research (Washington, DC) in Jan 2015", "Interview Descriptions": "I met a PhD level researcher from AIR at APHA (American Public Health Association's annual conference) in November. We had a brief informational interview. Afterwards, she introduced me to one of their internal recruiters, and they both encouraged me to apply for the open position in the Health Policy department at their DC headquarters. I submitted an application, and they invited me for an onsite interview. Because of the holidays, that process was a little lengthy, and I didn't go to DC for the interview until the end of January. They paid for my flight and hotel. I spoke to 6 people in 2.5 hours, beginning and ending with HR reps. They mostly asked me to describe my experience with quantitative and qualitative research methods as well as various data management and analysis software packages. There weren't any particularly intense technical questions. After that, it was 3-4 weeks before they contacted me with a job offer.", "Interview Questions": "Describe your experience working with qualitative data."}, {"date": "25 Aug 2015", "title": "Tier II Systems/Net Support Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at American Institutes for Research (Sterling, VA) in Jan 2015", "Interview Descriptions": "15 minutes phone call screening, few questions about desktop support, networking & operating systems. I have been recruited by MODIS and posted the job description then, submitted my resume. MODIS recruiter called me later and discussed this opportunity with and went through all the contract and payment details. After that, I have been schedules a phone call interview with American Institutes of Research. Upon completing this phone call interview I have got a notice that I was being accepted. Finished some paper work for job on-boarding and started the next week.", "Interview Questions": "How to troubleshoot  a workstation reported as does not have an Internet connection."}, {"date": "10 Jul 2015", "title": "Health Research Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 3 months. I interviewed at American Institutes for Research (Washington, DC) in Jan 2015", "Interview Descriptions": "I applied online and heard nothing. I met a recruiter (PhD Researcher) who came on-campus for an info-session and finally got in touch with an HR person. The whole process was not what was described during the info-session. The HR called out of the blue for a phone screen without prior notice. After the phone screen, it was another two weeks before I had a 2 hour interview with 2 researchers. They mostly wanted me to describe a previous projects and asked if I had questions for them. The second interviewer didn't seem to be interested, and didn't ask many questions. Around 2-3 weeks later, the HR got in touch with me to schedule an on-site interview. We had set the date for two weeks later, and a week before the interview, I received a rejection email (which seemed to be mass-mailed). I was confused to why this happened and reach out to the HR person and found out that she had left AIR. I reached out to the PhD Researcher who only told me that everything over in the HR side is confidential, and even though I followed up with another HR person, I never heard back. Overall, their HR seems to be pretty disorganized and unresponsive.", "Interview Questions": "Previous project experience "}, {"date": "16 Nov 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research (Washington, DC) in Jan 2015", "Interview Descriptions": "I was interviewed by 6 people or more,  going from office to office answering a variety of different questions. Everyone was extremely nice and welcoming, the questions were not very hard at all, and the staff seemed very happy to hear about me.", "Interview Questions": "Why did you decide to join AIR?"}, {"date": "22 Dec 2015", "title": "Senior Researcher Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 8 months. I interviewed at American Institutes for Research (Washington, DC) in Dec 2014", "Interview Descriptions": "Long ... a very long and detailed interview process that involved multiple phone interviews and a face to face with many people.  Each step of the process was really great, though.  The on site interview day was exhausting, meeting with many different people throughout the day.", "Interview Questions": "What areas of research are you most interested in?"}, {"date": "28 Jul 2015", "title": "Senior Cyber Security Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 days. I interviewed at American Institutes for Research (Washington, DC) in Dec 2014", "Interview Descriptions": "After a phone interview, I met with multiple tiers of employees in the department in which I'd be working - Engineer, Manager, CISO, Director - as well as with HR.  It was a very well organized interview, and an exciting opportunity to speak with people I'd be working with and working for.  Questions that were asked were very relevant and required specialized knowledge for the position.  They expect high quality from their employees, and the interview process reflects that.", "Interview Questions": "What sort of anomalies would you look for to identify a compromised system?"}, {"date": "8 Jan 2015", "title": "Psychometric Support/Research Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American Institutes for Research in Nov 2014", "Interview Descriptions": "I applied for the research assistant position through the AIR website and was contacted by HR via phone.  The interview process started with a phone screening, where I was told about the company, what the position entailed, and asked about my expectations (what I wanted, salary, etc.).  Very very basic stuff just to make sure I was interested.  \r\n\r\nAfter the phone screening, I was invited for an in-person interview at the office in D.C.  I met with NINE people.  First, the HR rep that I had spoken with on the phone, then I was shuffled from office to office to meet almost everyone on the team that held the same or similar job role as I was interviewing for.  It was really unorganized. These people were NOT trained interviewers.  They were literally just told that I was coming in and given a list of generic interview questions (i.e. What is your greatest strength? Weakness?) to ask me.  They were really cool, and I enjoyed talking to them, but they were definitely uncomfortable \"interviewing\" me.  It struck me as really odd.  Especially, when I asked them how conflicts were managed in the workplace and they responded with, \"Oh, we don't really have conflicts here...\"  Come on.  There is ALWAYS some amount of conflict.  But the layout of the office was pretty sequestered (two to an office room), so it seems like they have very little interaction with each other.  And most communication seems to be through email.  So, perhaps they do have little conflict.  \r\n\r\nAfter meeting a whole string of people, I met with the final HR liaison who went over salary and benefits, like parking.  The starting salary was REALLY low, $38,000.  I asked for higher, and I have a year's worth of experience in education.  I asked when I would be hearing about a decision, and was told that I should know by the end of the following week.\r\n\r\nTwo weeks went by and I heard nothing.  So, I emailed my HR rep from the very beginning.  He said that they had to schedule two interviews for the following week, so I should know the week following.  I waited some more... Waited two weeks after the second deadline and heard NOTHING.  Now, it's MONTHS after my interview and I've just GIVEN UP.  It is SO INCREDIBLY RUDE for them to just ignore me after all the effort I went through during the interview process.  DO NOT WORK HERE. THE PAY IS LOW AND THEY TREAT YOU LIKE CRAP DURING THE INTERVIEW PROCESS.  NO WONDER THEY DON'T HAVE CONFLICT MANAGEMENT BECAUSE THEY AVOID CONFLICT LIKE THE PLAGUE.  A simple, \"I'm sorry but we've decided to hire someone else\" would have been nice.  SO RUDE.\r\n\r\nRecap:\r\nOnline app submitted - 9/29/14\r\nPhone screening - 11/3/14\r\nIn-person interview - 11/12/14 (first expected hiring decision deadline given: 11/21/14)\r\nFollow up - 11/26/14 (new hiring decision deadline given: week of 12/8/14)\r\nNo response since.", "Interview Questions": "None. Super easy interview... if you can call it that. "}], [{"date": "14 Oct 2014", "title": "SAS Programmer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "I was Mailed by recuiter and have a phone interview. The process took one month. Recruiter is very nice and helpful. Reply my questions very quickly and help me to set up a interview as soon as possible.", "Interview Questions": "Which function you will prefer, merge or full join? What's the different?"}, {"date": "26 May 2015", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research (Chicago, IL) in Oct 2014", "Interview Descriptions": "First got a call from HR for a screening interview. Then had an in-person interview that lasted a few hours with several members of the team the position was with. The in-person interview was at AIR's offices downtown. The meeting had a polished and professional feel; it's clear that they do a lot of interviews and their HR team seems to be organized, though a little slow (but so are most HR departments).", "Interview Questions": "The questions were straightforward and about experience in the different skills required for the position."}, {"date": "18 Sept 2014", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at American Institutes for Research (Washington, DC)", "Interview Descriptions": "Two phone interviews with recruiter and one in-person, full day interview. Phone intervews with recruiter established my prior work experience, interest in the position, overall expectations, and preliminary expectations of the Principal Researcher. Full day interview is a chance to showcase your own research, meet staff, and discuss how you'd fit in with staff and the project.", "Interview Questions": "Questions about theoretical framework of my research."}, {"date": "5 Sept 2014", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "I found the interview process to be straight forward and thoughtful. I received a call from Human Resources to review my interests and then had two phone interviews with various members of the leadership. The phone interviews were followed by an in-person interview that was quite congenial. It seemed like a great place to work.", "Interview Questions": "I found the questions to be fair"}, {"date": "20 Apr 2016", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 day. I interviewed at American Institutes for Research (Washington, DC) in May 2014", "Interview Descriptions": "I interviewed with six different people in a back to back format. The whole process took around 5 hours or so and was fairly draining. Unfortunately, for an entry level staff they did not pay for hotel or travel, so it was a pricy interview. I had a follow up phone interview which was actually more difficult than the in person interview. My one complaint is how long it took to find out about the decision.", "Interview Questions": "What are your research interests?"}, {"date": "27 Jul 2015", "title": "Project Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at American Institutes for Research (Washington, DC) in May 2014", "Interview Descriptions": "Interview process is very basic. I went through a round of 5 interviews, all very casual.I received an offer within a few days of my interviews. Process was rather fast.", "Interview Questions": "Why did you choose to apply to this company?"}, {"date": "12 Apr 2014", "title": "Quantitative Researcher Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research", "Interview Descriptions": "There were 3 phone interviews with different people: first one with a hiring manager, and the other two with a senior researcher and a principal researcher, respectively.", "Interview Questions": "Describe your experience in qualitative research. \r\n"}, {"date": "20 Mar 2015", "title": "Reporting Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at American Institutes for Research in Apr 2014", "Interview Descriptions": "I applied online through their website and received a phone interview for the summer internship. The supervisor for the position gave a brief explanation about the project and the responsibilities of the position; and asked if I had any questions. We did not discuss my resume or qualifications. The interview lasted for less than 10 minutes.", "Interview Questions": "Do you have any questions about the position?"}, {"date": "12 Apr 2018", "title": "Finance Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at American Institutes for Research (Washington, DC) in Apr 2014", "Interview Descriptions": "I first had a phone interview.  Then I came in for an interview.  I interviewed with three people separately.  ok ok ok ok ok ok ok", "Interview Questions": "The interview question was the same as any other interview question I had. "}, {"date": "6 Apr 2016", "title": "Mid Level QA Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at American Institutes for Research (Washington, DC) in Apr 2014", "Interview Descriptions": "Two people took the interview in DC.Interview lasted for about half an hour.They asked few questions about manual testing and automation testing.\r\nAfter the interview was done. Next day they communicated my feedback with HR and they gave me offer. Joined the company in less than 2 weeks after the interview.", "Interview Questions": "Like how would you handle a situation when the application throws error when running automation scripts.\r\nSome other questions about my prevous projects and basic manual testing questions.\r\nThey asked some questions on SQL too."}], [{"date": "5 Mar 2014", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at American Institutes for Research (Washington, DC)", "Interview Descriptions": "Typical software interview. Phone screen by HR, followed by phone interview with an engineer, followed by a full day of interviews at the office.", "Interview Questions": "none were difficult., nor easy, just your typical software questions. ex. what data structure would you use to store this data?, or how would you find the nth number in a sorted list of integers and what is the run time?"}, {"date": "15 Nov 2014", "title": "Software Engineer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research (Naperville, IL) in Mar 2014", "Interview Descriptions": "Initially I applied online. After a week received mail to schedule technical phone interview. In phone interview the they asked in depth about previous projects. Asked lot of technical questions on JavaScript, AJAX, C#.  If you have experience in the required fields, basic preparation and brushing up skills will suffice for preparation. \r\nAfter 1 week received phone call from recruiter that they are giving me offer.", "Interview Questions": "Nothing unexpected, all general questions on JavaScript, AJAX, JSON, C#.NET, ASP.NET and some questions like explaining Oops concepts in JavaScript"}, {"date": "4 Feb 2014", "title": "SAS Programmer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "Great company, very professional people. I think they just randomly ask the interview questions related to statistics. I didn't get why the questions related to my position. Maybe this was the reason why I didn't get the offer.", "Interview Questions": "N/A"}, {"date": "6 Feb 2014", "title": "Research Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at American Institutes for Research (Washington, DC)", "Interview Descriptions": "applied online\r\nContact by HR 4 weeks later. \r\nHR contact was very professional.\r\nFlew in 2 weeks later, hotel and flight paid.\r\nMet with a handful of people: direct boss, colleague, phone interview.\r\n\r\nSince it is a research institute, I was expecting very bright question and meeting ivy-league level people.  Wrong math notation.  Unaware of new methods.  I asked to see the project, it's something I could do in a day with coffee.  Data analysis is equivalent to 3rd year college level.\r\n\r\nThey sensed I am not too excited, asking for high pay.  No offer next day.", "Interview Questions": "Difference between fixed effect and random effect?"}, {"date": "19 Apr 2016", "title": "IO Research Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at American Institutes for Research (Washington, DC) in Feb 2014", "Interview Descriptions": "HR Interview, followed by a phone interview with a senior IO Researcher, and lastly an in-person interview. The process was pretty straightforward, but a bit slow. The in-person interview was a great experience. Everyone I met was very friendly and down to earth.", "Interview Questions": "Tell me about a time when you had to work in a team and things did not go as planned. "}, {"date": "2 Jan 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "I had two 30 minute phone interviews with AIR staff members and then about a 2.5 hour in person interview (I had 30 minute interviews with four members of my program and then a 30 minute interview with HR). Throughout my hiring process a staff member from HR kept in close contact with me and updated me on where they were with their hiring process. \r\n\r\nMy interview questions were very straight forward. I was asked to walk through my resume, discuss why I was interested in this area of research, discuss my undergraduate coursework, talk about my research skills, long term professional goals, etc. I don't remember being asked a lot of behavioral questions.", "Interview Questions": "N/A"}, {"date": "22 Nov 2013", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "Submitted resume via job board.  Received email requesting phone screen about 3 weeks later.  Had phone screen with HR, then a phone interview with the hiring manager and a couple of directors 2 business days later.  2 business days afterwards, I was scheduled for an onsite interview with 3 separate interviewers.  I was told before I left that an offer was being prepared.", "Interview Questions": "Did you complete your degree online or in a classroom?"}, {"date": "22 Nov 2013", "title": "Finance Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research (Washington, DC) in Nov 2013", "Interview Descriptions": "Initial phone interview with HR/ 1:1 Team interview", "Interview Questions": "Excel Test\r\nGeneral questions related to work and previous experience. \r\nBehavioral questions and some of job technical skill question\r\nBe prepared for job technical skill questions. For example, when do you think you would use pivot table, graphs and charts, etc. \r\n\r\nInterviewers were nice and very professional. \r\nInterview difficultly was above average.\r\nI did not get an offer but it was a great experience. "}, {"date": "2 May 2014", "title": "Statistical Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at American Institutes for Research (Washington, DC) in Oct 2013", "Interview Descriptions": "Initial communication was via email. This was followed by a phone conversation. The conversation went well. The recruiter said she will have the HR Manager get back in touch with me to set up a face to face interview which never happened. After sending a few emails in the next couple of weeks, I was told that I wasn't selected for the position.", "Interview Questions": "No difficult questions were asked."}, {"date": "27 Jul 2015", "title": "Statistical Support Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research (Washington, DC) in Aug 2013", "Interview Descriptions": "It was a lengthy process but it was very nice. Everyone was super friendly and informative and answered all our questions. It is more casual than you think it would be.", "Interview Questions": "Are you willing to perform x, y, z tasks for thsi position it is more or less to see if an individual will be a fit."}], [{"date": "10 Feb 2016", "title": "Technical Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at American Institutes for Research (Washington, DC) in Jul 2013", "Interview Descriptions": "Process started with a 30-minute technical phone screen conducted technical recruiter. After the basic technical screen, a 30-minute phone interview was conducted by two senior staff. Phone interview was followed by an in-person interview. Met with 5-6 different people on site for in-person interview, including completing a problem-solving & data analysis exercise. Received phone call the day after interview with an offer. Entire process moved quickly.", "Interview Questions": "How do you manage scope creep?"}, {"date": "18 Oct 2017", "title": "Software Engineer Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at American Institutes for Research (Washington, DC) in Jul 2013", "Interview Descriptions": "After the initial phone screen, which included a light technical portion, I was brought in for an in-person interview. Which, I think was three sessions of 1 or 2 interviewers each. After the day was done, for some reason I had to be brought back again another day. That was a pain, as the office was not easy to reach via the Metro system.\r\n\r\nThings that stuck out with me were, even though this was a senior level .NET software engineering position, the interviewers kept hammering at computer science-type questions. Sometimes, that's fine and good, but I got the distinct feeling the ones interviewing me had little exposure to jobs outside of AIR. Salary levels seemed quite below the standard for the area too.", "Interview Questions": "One Q was something that was an obvious situation to lead the interviewee to use a hash table to solve the problem."}, {"date": "10 Jun 2013", "title": "Researcher Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through a recruiter. I interviewed at American Institutes for Research", "Interview Descriptions": "The process was clear and efficient.  My initial interactions were with an HR recruiter who maintained contact with me throughout the process. The next steps involved conversations with the manager for the specific research area who asked for additional information about my skills and qualifications (e.g., writing sample, statistical background).  All communication was professional.", "Interview Questions": "HR recruiter asked for salary requirements much earlier in the process than anticipated.  Be sure to do your market research early."}, {"date": "6 Jun 2013", "title": "Software Engineer Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "Got a call from recruiter to setup a technical phone interview. Upon my realization, it was the same recruiter taking my phone interview next week reading from a piece of paper and trying to get answers from me.", "Interview Questions": "SQL questions: AUB  AxB  where A and B are tables , whats is delegate function. "}, {"date": "3 Jun 2013", "title": "Software Engineer Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at American Institutes for Research (Washington, DC) in May 2013", "Interview Descriptions": "Data structure and Java questions. All 5. I feel very difficult. After which I get a denied email immediately. Data structure and Java questions. All 5. I feel very difficult. After which I get a denied email immediately.Data structure and Java questions. All 5. I feel very difficult. After which I get a denied email immediately.", "Interview Questions": "algorithm"}, {"date": "20 Nov 2013", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through other source. The process took 4 weeks. I interviewed at American Institutes for Research (Washington, DC) in Apr 2013", "Interview Descriptions": "Initially, two interviews were conducted at the Society for Industrial Organizational Psychology Conference, followed by a phone interview and a series of interviews at the headquarters in Washington DC.  In DC, I met with a series of workers at different levels of the organization who each had their own specialization within the organization.  It was a very thorough and professional experience.", "Interview Questions": "Please describe the three types of validity and how they are different."}, {"date": "8 Apr 2013", "title": "Software Engineer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at American Institutes for Research in Apr 2013", "Interview Descriptions": "Got a phone interview. No resume related question. Started with a list of technology question and moved very quickly.", "Interview Questions": "It was a little difficult. But I am sure if I did more research, I should be able to answer most of them. "}, {"date": "14 Mar 2014", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Institutes for Research in Mar 2013", "Interview Descriptions": "I found this job on a typical job posting website (I believe it was idealist or indeed) and applied while still in my senior year of college. I heard back about a week and a half later over the phone. I was a little caught off guard because I hadn't received an email in advance letting me know I was being considered and I was attending a class at the time. When I had returned the call, it turned out to be a very basic, preliminary HR screen; I was asked why I had applied and what interested me about the company. Shortly afterwards, I received an email asking me to schedule phone interviews. \r\n\r\nI went through one round of phone interviews with two staff members. The people interviewing me were from two different offices - one was someone in a position similar to mine and the other was a senior researcher who had been at the company for quite some time. Both experiences were positive and questions were pretty straightforward (prior work experience, ability to work in groups, interest in the company and projects). Although from speaking with the staff member who was in a similar position as the one I was interviewing in,  it was made very apparent that it is difficult to move up in the company without a higher degree (she was leaving for graduate school shortly thereafter). \r\n\r\nI received another call several business days later (again, during class) letting me know that the phone interviewers had responded positively and they were going to move ahead with scheduling in-person interviews. The in-person interview lasted about 3.5 hours. Again, interviews were conducted in rounds. I spoke with HR, research assistants, research associates, senior researchers, and then looped back with HR. Everyone was pleasant and questions again were pretty standard - nothing too tricky, just basics on education, elaborating on prior relevant work, work attitude and style, etc. I was told that they would be in contact.\r\n\r\nHere's where it gets tricky. If you are applying for other jobs, HR tends to get a little bit more irritable. Firstly, be honest about where else you are applying and whether or not you are already considering their offer. For me, I had been juggling other offers and HR was not as responsive as they had initially promised. I was told there would be a response within the week, and a week later, when I touched back in with HR, I was told they were just starting to consider all applicants. I essentially had to force their hand and told them I needed an answer right away since I had already been holding off on other offers - I got the sense that HR was flustered, but in my mind, if I was a good fit, they should have stopped interviewing others indefinitely and gotten back to me when they had promised.", "Interview Questions": "All questions were very straightforward - some were even questions that were asked in previous rounds of interviews. I believe there may have been just one question that was slightly more technical drawing upon education and coursework. "}, {"date": "9 May 2013", "title": "Software Engineering Intern Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 day. I interviewed at American Institutes for Research (Washington, DC) in Mar 2013", "Interview Descriptions": "I got the job information at my college's job fair. About half a month later, I received a call from a Recruiting Assistant and ask me to sent her a resume.  After I do that, about three days later. I received an email and schedules time for the first phone interview.", "Interview Questions": "For the interview, there are three interviewer with India accent. Because my English is not very strong, so I hardly understand their questions. Basically they just ask some questions relative to my resume. They asked me to describe the merge sort, some Jave network questions, and so on... I can't  remember, mostly  I can't get the whole question because of cannot understand their English."}, {"date": "25 Apr 2013", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research (Washington, DC) in Feb 2013", "Interview Descriptions": "Was contacted initially by a recruiter requesting that I participate in a phone interview. A phone interview consisted of speaking with a couple of researchers and about my experience. Was asked whether I had any questions and the phone interview was very friendly.\r\n\r\nAbout a week later I was contacted for an in person interview in the Washington office. Spent an entire day at the office speaking with HR, the team I would be working with, and meeting other colleagues. Very positive experience in-person.", "Interview Questions": "Describe your research experience in detail."}], [{"date": "23 Jan 2013", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "Three rounds of interview, including two phone interviews and an on-site interview. Be sure to read their publications, especially those written by your potential interviewers. I feel this is the most effective way to impress them. Be prepared for both behavioral questions and technical questions.", "Interview Questions": "What's your plan in five years?\r\nDifference between quasi-experimental and experimental design?"}, {"date": "20 Oct 2015", "title": "Senior Software Engineer Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at American Institutes for Research (Washington, DC) in Jan 2013", "Interview Descriptions": "phone call from HR with some questions and answers and then a technical phone interview and then in person interview once cleared; asked questions on basic software engineering like object oriented approaches; data structures and others", "Interview Questions": "have you coded on java script"}, {"date": "13 Nov 2012", "title": "Researcher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "The initial interview process unfolded very smoothly and quickly. I had a phone interview with the recruiter and then another with the hiring manager and a senior researcher, which also went very well. Both were very friendly (remember this; it will be important later). I was invited for an on site interview the same day. \r\n\r\nThe interview day started off very well. After a customary meeting with the HR person, I had a phone interview with someone at the same job level (which went swimmingly) and then  a face to face with a senior administrator (which went even more swimmingly). Next was my presentation and things suddenly went  irrevocably south. Attending the presentation was a mix of junior and senior researchers, including the two I met during the initial phone interview. The senior researcher seemed confused but not hostile to my presentation, the hiring manager heckled. The presentation did not win rave reviews from anyone, but no one else heckled. I explained myself as well as I could, but it did not make a dent. Next was my lunch. With the aforementioned hiring manager. \r\n\r\nI started trying to get a hold of the process, because the interview was slipping out of my fingers. Although it was clear as daylight that she had made up her mind about me, I was trying to stay positive while trying to answer her increasingly impatient questions. At some point, she asked me how I would change the centuries of gender bias in my country (my work and education are a million miles away from this question) I gave up and said, I don't know. She stopped me and started giving me 'feedback', the gist of which was that I'd sucked at the interview in every way. My answers weren't impressive enough, my ideas weren't grand enough (she said she didn't care in the least if any of them were truthful) and I hadn't shown myself to be good enough. About an eternity of this surreal plot twist later, we continued with the 'interviewee's questions' part of the meeting (I was offered the consolation prize for asking 'good' questions). Then on to two more interviews, normal and professional as can be. The second one ended with the kicker- \"you should've presented your other work\" (instead of the one vetted by the recruiter and the senior researcher). Bazinga! \r\n\r\nNever heard from them again, but I knew the answer by noon.", "Interview Questions": "How will you change centuries of gender bias in your country?"}, {"date": "10 Nov 2012", "title": "Project Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "First, I interviewed with an HR representative and then had two phone interviews within a few days of the initial HR interview.  Shortly after, they flew me in for an in-person, panel interview.\r\n\r\nThe interview process was organized and pretty standard.", "Interview Questions": "The questions were basic questions--asking about my previous experience, research experience, and typical behavioral questions."}, {"date": "27 Dec 2012", "title": "Accounting Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at American Institutes for Research (Washington, DC) in Nov 2012", "Interview Descriptions": "The interview process involved two phone interviews and a structured face to face interview over a period of four hours. There were five seperate inter iews which included the associates, manager and director.  In addition, an scenario of a tpical day was presented via. computer and was expected to resolve the situation via. email. The team was very polite and friendly which made it a comfortable process.", "Interview Questions": "Te most difficult question surrounds a typical case which involves an irate team member who did not follow the rules and demands that the situation be remeidied immediately.  How would you handle the situation?"}, {"date": "28 Sept 2012", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at American Institutes for Research", "Interview Descriptions": "The interview process is extensive.  The first round I interviewed for two hours with about 5 or 6 different people.  All very friendly and open, and easy to read.  They called me back for a second interview within a couple business days.  The second interview was scheduled within the week, also took about 1.5 to two hours with several people.  The next day I got the job offer!", "Interview Questions": "Since the position is very heavy on stats I had to explain my experience working with statistical programs, which was hard to do on the spot.  A little preparation before hand would have helped."}, {"date": "16 Mar 2013", "title": "Research Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research (Chicago, IL) in Sept 2012", "Interview Descriptions": "Professional from start to (almost) finish. Courteous in terms of scheduling.\r\n\r\nA lot of repetitive questions from phone to in-person interviews.", "Interview Questions": "Demonstrate your qualitative research skills. What (specifically) is your domain of interest and why?"}, {"date": "16 Nov 2012", "title": "Senior Engineer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 4 days. I interviewed at American Institutes for Research (Township Washinton, NJ) in Sept 2012", "Interview Descriptions": "Called about resume.  Never bothered to call back.", "Interview Questions": "Never called back."}, {"date": "2 Oct 2012", "title": "Researcher Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at American Institutes for Research (Washington, DC) in Aug 2012", "Interview Descriptions": "Perhaps the most unprofessional interview process I've ever experienced.  I applied for a job through the online system, but also had a mentor forward my CV to several hiring managers in the organization.  Within 24 hours of my CV being sent to contacts in AIR, a recruiter called me to set up an initial phone screen for the next day.  The scheduled interview time came and went with no call.  The next day, the same recruiter contacted me again to set up a phone screen.  When I explained that I'd had an phone interview scheduled, but no one called me at the designated time, the recruiter said that she \"couldn't remember\" if she'd set up an interview with me and that she must have missed it on her calendar.  The phone screen was rescheduled for the next day and actually happened this time.  The interview lasted about 30-45 minutes and went very well.  The recruiter contacted me the next business day to set up a phone interview with 2 hiring managers.  She also asked me to send a writing sample and sent an email to confirm the scheduled interview time.  However, like the initial phone screen, the scheduled interview time with the hiring managers came and went with no phone call.  I contacted the recruiter to find out what had happened, and she said that the hiring managers \"got really busy and forgot to call\" me.  Once again, the interview was rescheduled.  This time, only one of the hiring managers called, but the interview went on as planned.  It went very well, and I was told that they were interested in bringing me in for an on-site interview once they were certain that they would have enough funding to hire another researcher.  Almost two months have passed, and I still have not been contacted to schedule the on-site interview.  While it is possible that they are still trying to work out the funding situation, I've basically given up on AIR and do not intend to continue the interview process with them if I am contacted.  I'm just amazed that an organization of this stature thinks that they can continue to get the \"best and brightest\" to work for them when the hiring process is such a mess.  I got along well with the hiring manager who interviewed me, and I think I would have enjoyed working for him, but just about everything else in the interview process suggested huge problems with the organizational culture at AIR.", "Interview Questions": "No difficult or unexpected questions.  Everything was pretty basic - asked about my dissertation research, background and training in quantitative research, experience with statistical analysis programs, etc."}], [{"date": "9 Sept 2012", "title": "Research Assistant Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at American Institutes for Research (Washington, DC) in Aug 2012", "Interview Descriptions": "I submitted an application online. Within a month, I got a screening call or pre-interview from an HR assistant, asking basic questions like my interest in this position. I had a phone interview shortly after with a senior research associate. A few weeks later, I had an in person interview with 2 other research associates. Everyone I spoke to was courteous and informative. They asked about my research experience in detail, my future goals, and what I wanted from this position. I tried to answer questions as fully as possible and convey my enthusiasm for working there. I called 2 weeks later to check on my status and was told they would call if they were moving forward. I never got the call.", "Interview Questions": "What do you see yourself doing in 5 years?"}, {"date": "2 Aug 2012", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied online. The process took 4 weeks. I interviewed at American Institutes for Research", "Interview Descriptions": "I applied for the job via idealist or indeed.com. HR called me a week or two later to do a preliminary interview. The HR rep asked me a few questions about my interests. She asked me what salary I was looking for. Then she said she would call me back if AIR wanted to move forward with the interview process. I got a call a few days later, and I scheduled an hour-long phone interview with my would-be supervisors. After that, I got another call asking if I could come in for an in-person interview. That interview lasted from I believe9am to 11:30 am. I met with several people in the division in which the position was available. I met with the HR rep twice. Then they told me that they would call me shortly if they were interested in offering me a position. They e-mailed me the next day asking for a writing sample. I provided that and then it was a day or two before they called me to extend me the offer. They did not require a drug test.", "Interview Questions": "They asked me to explain why I had moved around so much in the recent past (I had moved several times within the past several years due to grad school and then consulting jobs). "}, {"date": "7 Jul 2016", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at American Institutes for Research (Washington, DC) in Jul 2012", "Interview Descriptions": "I started as a freelancer and was hired after three or four months of submitting items. I didn't have an official interview (I was hired after freelancing), but I later participated in interviews for new employees. I always got the feeling that we were expected to put a positive spin on everything. We couldn't answer some applicant questions honestly. Management had its spies, and there was always a feeling that we had to watch our backs.", "Interview Questions": "Before I was hired, I was asked if I was willing to travel, though I wasn't told how extensive that would be. I was promised promotions, but they never came--for me or anybody else I worked with...and there were many, many people moving through while I was there."}, {"date": "20 Jun 2014", "title": "Project Specialist Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at American Institutes for Research (Washington, DC) in Jun 2012", "Interview Descriptions": "the actual interview wasn't long\r\nphone, on site, presentation, panel \r\nthe hiring process was too long\r\n\r\nthe project director was very nice and asked professional questions. by the end of it, he told me he thought I was a good fit and will move me to an onsite interview. (but unfortunately this person was a victim of internal politics and was let go)", "Interview Questions": "mostly just research related questions"}, {"date": "8 Sept 2015", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 2 days. I interviewed at American Institutes for Research (Washington, DC) in May 2012", "Interview Descriptions": "I interviewed with three different people and one over the phone. Everyone was very nice. During the interview we talked about the types of work that I would be doing and whether that interested me. Also, you get interviewed by different levels which is good to know.", "Interview Questions": "How can you contribute to AIR?"}, {"date": "26 Jul 2011", "title": "Research Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at American Institutes for Research (Washington, DC) in Jul 2011", "Interview Descriptions": "First there was a 30-minute HR interview, followed by two separate phone interviews with Research Associates that lasted about 30 minutes each (about a week later), then another phone interview the following week with a manager/senior associate, then an in-person interview at the D.C. headquarters with 7 different individuals (some were with two at a time, and a couple were on the phone to the other AIR locations). Overall a very nice interview process, they paid for flight and accommodations to D.C. and were very friendly.", "Interview Questions": "What is your approach to qualitative research and data analysis?"}, {"date": "9 Mar 2012", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 5 months. I interviewed at American Institutes for Research (Washington, DC) in Feb 2011", "Interview Descriptions": "I was able, through networking, to meet someone who worked within the organization.  After an initial telephone conversation my resume was forwarded to HR who then set up a formal interview.  Due to timing and internal evaluations, it was five months before an opening was available for me.", "Interview Questions": "Detail the ways in which you showed competency in qualitiative and quantitative analysis."}, {"date": "18 Mar 2011", "title": "IT Operations Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at American Institutes for Research in Feb 2011", "Interview Descriptions": "I discovered AIR at a job fair, and researched online. They appeared to have received a large new government contract and were bulking up their IT group substantially, including senior management, front line managers, and technical staff.  The existing IT group was not so large.  The recruiter at the job fair seemed very positive I would be considered, but I did not get a call back within a week so I applied online.  I received a phone interview with their recruiter a few days after that.  In this case, the recruiter did both a 'phone screen' and an initial interview in the same hour... in effect I had to get through some screening questions in order to keep going.   For this job, she really stressed the commute that I would have to make... I think that reflects that the operations jobs probably require some server rebooting etc and they wanted someone who was able to effectively supervise overnight.   The technical questions were not difficult.   I didn't get the position. I wrote a thank you a month later and their HR politely responded.", "Interview Questions": "what is the difference between QA and testing?"}, {"date": "13 Mar 2014", "title": "Research Associate Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at American Institutes for Research in Feb 2010", "Interview Descriptions": "I interviewed with 5 separate people--it was a surprise to me that they interviewed me for 2 different positions. They have you talk to someone around your level as well as your potential boss(es).", "Interview Questions": "N/A"}, {"date": "30 Oct 2011", "title": "Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at American Institutes for Research (Washington, DC) in Feb 2009", "Interview Descriptions": "The interview and hiring process were well handled by the HR department.  They moved things along at a fair pace and communicated well with the executive recruiter who set up the interview.  They did everything they said they were going to do.  They were generous with the flight cost and hotel cost reimbursement.  They repaid the expenses very quickly too.  They did a good job explaining the role to the recruiter.  They answered every question that I asked and didn't dodge any issues.  They painted an accurate picture of the work and the environment.  When I asked to spend some time with some of my future colleagues, they didn't freak out and the people I met with were gracious through the process.", "Interview Questions": "None, they were all pretty standard"}], [{"date": "2 Nov 2010", "title": "Research Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at American Institutes for Research (Washington, DC) in May 2008", "Interview Descriptions": "I applied on-line. A recruiter contacted me via e-mail. Then, I had a phone-interview. Then I was invited for on-site interview. I had an interview with a hiring manager and few more people. Interview process was smooth and people were very nice and friendly. Then, I talked with a HR staff about benefits, etc.", "Interview Questions": "What was the most proud of yourself?"}]]