[[{"date": "4 Nov 2021", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Asia Foundation", "Interview Descriptions": "It was smooth and going very well. Had really effective and communicative conversations with all the penalists who were generally being very nice and cheerful. The penalists were from different international offices.", "Interview Questions": "Why do you see yourself a fit for this position?"}, {"date": "3 Jan 2023", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at The Asia Foundation (Manila, Manila) in Oct 2021", "Interview Descriptions": "There were three interviews in total: one with Human Resources, then another with the program team, then finally, with the Country Representative. The questions were all reasonable, and I was asked to draw from my previous experience.", "Interview Questions": "What is your experience in the advocacy related to the program?"}, {"date": "22 Sept 2021", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Asia Foundation (New York, NY)", "Interview Descriptions": "It was an efficient and fair interview with a few people.  The questions were thorough, assessing the various skills and aptitudes for the position.  Everyone was friendly and professional.  It was probably one of the less stressful interviews I've had.", "Interview Questions": "How would you manage your team to ensure that they grow? On the other hand, what would you do if they are not performing?"}, {"date": "18 Jun 2021", "title": "Communications Officer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at The Asia Foundation", "Interview Descriptions": "Okay experience, the questions were fairly thorough. There was a delay between the closing date and when they actually contacted me for a interview, I had actually written it off and figured they'd hired somebody already.", "Interview Questions": "To describe my knowledge of the subject area"}, {"date": "1 May 2021", "title": "Senior Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at The Asia Foundation", "Interview Descriptions": "It was a video interview but the panel turned their video off which wasn't helpful for me as a candidate. The questions revolved around my skills and previous work experience. It was a long time since I heard back from them with a positive response", "Interview Questions": "CV, Past roles, academics, future career goals"}, {"date": "17 Apr 2021", "title": "Data Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at The Asia Foundation", "Interview Descriptions": "Interview with five different people under the same team and had practice test. Good Experience. Flexible colleagues. Not difficult at all.  Have a lot of experience and knowledge after interviewing.", "Interview Questions": "The experience related with data managing?"}, {"date": "20 Feb 2021", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at The Asia Foundation (Ulaanbaatar)", "Interview Descriptions": "I went through two-staged interviews. A first interview was with human resource, project consultant and project manager. It went well and smooth,  after about seven days, I was invited for second interview was conducted by the Country Representative and Vice Country Representative. I was so thrilled but however before the interview, I had lots preparation and did my home work, at the end I was so confident.", "Interview Questions": "Describe  a difficult or challenging situation and how you successfully handled it?"}, {"date": "29 Jan 2021", "title": "Psychological Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at The Asia Foundation (Faisalābād, Punjab)", "Interview Descriptions": "It was the first interview I ever had and there was a panel of  lawyers who took my interview, asked really general questions and about my understanding of the court and law system", "Interview Questions": "Kindly tell us about yourself?\n"}, {"date": "1 Sept 2020", "title": "Summer Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 2 weeks. I interviewed at The Asia Foundation (Seoul) in Jun 2020", "Interview Descriptions": "I submitted resume and writing sample through email.\r\nThen I got the interview through call, asking me to come into the office for interview.\r\nI had an in-person interview with 3 staff (Country representative, Director of Programs, Executive Assistant)\r\nI got internship offer through a call.", "Interview Questions": "General questions about my background and what I want to get out of the experience. "}, {"date": "3 Apr 2022", "title": "Project Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at The Asia Foundation (Ulaanbaatar) in May 2020", "Interview Descriptions": "Starts with the application consists of CV and Cover letter. If shortlisted, called for an interview. Written test will be followed, which consists of writing briefs and translation of documents in Eng and Mongolian", "Interview Questions": "Why are you interested in this position?"}], [{"date": "13 Mar 2019", "title": "Regional Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at The Asia Foundation (Bangkok) in Feb 2019", "Interview Descriptions": "I submitted my application materials online, and waited for 2.5 weeks to receive a call from HR for the interview. The interview process took around 40 minutes with the Director and Associate Director, and was followed by a brief written exam.", "Interview Questions": "Q: How did you hear about TAF?\r\nQ: Describe the relationships between conflict and development"}, {"date": "14 Nov 2019", "title": "Director Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at The Asia Foundation (San Francisco, CA) in Feb 2019", "Interview Descriptions": "Over the course of four months, I interviewed with a series of people.  Follow-up information from HR was inconsistent and I would often be contacted to schedule interviews without having been informed that I should expect additional calls/requests for meetings.  I was asked to visit the main office multiple times to meet with different people, within the same few days.  It would have been more useful to coordinate these meetings (back to back), if possible.", "Interview Questions": "Why are you interested in joining The Asia Foundation and leaving your current employer?"}, {"date": "11 Nov 2022", "title": "Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at The Asia Foundation (Kabul) in Apr 2018", "Interview Descriptions": "The organization conducts competency-based interviews with a focus on the candidate's abilities to undertake the roles and responsibilities by asking questions that require candidates to provide real-life examples as the basis of their answers.", "Interview Questions": "How do you convince two or three institutions to agree upon a policy reform, that is not their priority?"}, {"date": "13 Feb 2020", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at The Asia Foundation (San Francisco, CA) in Jan 2018", "Interview Descriptions": "Applied online and received interview invitation a week after the deadline. One on one interview: Self introduction, project-related experience, motivation for doing the internship, expectation of the internship. Got offer for internship a week after the interview.", "Interview Questions": "Can you elaborate on your research experience on women and gender issues?"}, {"date": "24 Oct 2017", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at The Asia Foundation (Ulaanbaatar) in Aug 2016", "Interview Descriptions": "It was practical and the questions are not that hard. I had two rounds of interviews and a test.\r\nMy last interview went well and I got an offer.", "Interview Questions": "Why do want to work for this project?"}, {"date": "24 Apr 2016", "title": "English Language Trainer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at The Asia Foundation (Kabul) in Dec 2015", "Interview Descriptions": "it was around 12 pm that i got a call and was told that you have an interview at 1pm at the main branch of Asia Foundation.\r\nwhen i got there,i saw that there were almost 9 other people waiting for their turn.\r\nfinally, my turn came, when i got into the interview room, so there were four persons sitting in the interview panel to me.\r\nwe had our introduction to each other and after that i was asked a few technical questions by all the interview panel members", "Interview Questions": "how to keep the maintenance of the Students"}, {"date": "5 Oct 2015", "title": "Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Asia Foundation (San Francisco, CA) in Mar 2014", "Interview Descriptions": "The interview process was thorough: telephone then in person with HR (two people), then four others in person, one at a time. There is no way that I could have prepared other than to know my past work and my application materials inside out, know the organization well, and to have a sense of humor and ease about the process. Each person's perspective and set of questions was very different; agility was important to the process as it is in my job.", "Interview Questions": "How do you feel about being overqualified for the job?"}, {"date": "21 Aug 2015", "title": "Technology Consultant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at The Asia Foundation (Kabul) in Apr 2013", "Interview Descriptions": "All candidates were interviewed and selection was based on merit. More focus was on Technical Knowledge of the candidate. Past Experience was a plus point for those who has been for around 4-5 years in industry.", "Interview Questions": "What are programming languages you are well versed at ?"}, {"date": "11 Apr 2011", "title": "Finance Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at The Asia Foundation (San Francisco, CA) in Apr 2011", "Interview Descriptions": "In the interview, you will know that they are not interested in you.  From the start, they only talk about TAF, so I agree from the other review made earlier that the managers need to be replaced because even the Senior Director who is supposed to be the leader of the group interviewing did not even show that he knew the protocol of a decent review- didn't introduce himself- nor shake your hands before and after the interview.  The first thing he said was totally a discouraging comment that your qualifications are so..... Therefore, during the interview process, you felt so discouraged to even continue talking and so with the other employees.  It showed that the interview is so political and you better be a Chinese to be accepted.", "Interview Questions": "Tell me about yourself because I did not bring your CV and I already read everything about you.  Also, your qualifications don't really match because we need someone very passionate about the job."}, {"date": "13 Aug 2012", "title": "Program Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at The Asia Foundation (Ulaanbaatar) in Oct 2010", "Interview Descriptions": "Initial communication by email with a newly opened job description, followed by an unofficial meeting with the program director requested by me. after an official application for the job from my side, they requested a salary history form. Then official interview was held with 3 people.  Then came letter of offer with my my last salary almost unchanged and I accepted the offer as the job itself seemed appealing.", "Interview Questions": "Most difficult question was if I knew or had experience of working with standards. This wasn't really my area."}], [{"date": "23 Oct 2011", "title": "Internship Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at The Asia Foundation (San Francisco, CA) in Oct 2009", "Interview Descriptions": "initial contact and application process was very smooth, with an hr generalist to assist the process.  applied online, got a call for an initial interview with some lower level associates, with your usual nonprofit interview questions.  everyone was very professional.  got called for a 2nd interview, with a couple mid level managers, 1 on 1 with 3 directors.  Response from the 2nd interview took a while to get back, and eventually not offered the position.  I contacted one of the directors, who had given me her business card (and had told me to contact her if I had any questions during the entire process).  I contacted via phone and email, to which I got no response.  Very unprofessional.  A simple question of why I wasn't the one chosen for the position, which many orgs have offered me in great detail.", "Interview Questions": "basic interpersonal questions, background of how your experience fits the job..."}]]