[[{"date": "8 Jan 2023", "title": "Certified Medical Assistant Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Swedish Medical Center", "Interview Descriptions": "Had a quick 10-minute Zoom interview with the hiring manager in Primary Care and was immediately invited to meet the team. Unfortunately, had to decline offer as they were offering my current pay.", "Interview Questions": "Q: Why do you want to work at this clinic?"}, {"date": "7 Sept 2022", "title": "RN NURSE Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Swedish Medical Center", "Interview Descriptions": "Quick interview friendly staff decent pay nice looking facility good opportunity I hate writing these reviews Glassdoor is ridiculous I’m just trying to find out information about a job I dont know why we have to type 30 words", "Interview Questions": "Current experience licensure and qualification "}, {"date": "31 Aug 2022", "title": "Patient Services Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Swedish Medical Center", "Interview Descriptions": "Phone interview with HR and recruiter\ninterviewed with peers of the same job title\ninterviewed with nurses \ninterviewed with manager\nSat in conference room while everyone asked me questions and I answered", "Interview Questions": "name a difficult situation and how you handled it"}, {"date": "30 Aug 2022", "title": "ICU RN, BSN Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Swedish Medical Center", "Interview Descriptions": "It was an in-person interview with a panel of people. Director or dept manager, charge nurse, other staff nurses were present during the interview.  Introductions were had and typical questions  were asked.", "Interview Questions": "Tell me of a time you disagreed with a co-worker. "}, {"date": "1 Jun 2022", "title": "Certified Nursing Assistant CNA Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Swedish Medical Center", "Interview Descriptions": "Phone, then in person. Phone interview was a typical HR screen, then in-person was with the hiring manager for the department. It was great because you were interviewing with the person who would be your connection to upper management once hired.", "Interview Questions": "Typical availability/experience, strengths/ weaknesses, how do you handle conflict with patients/coworkers"}, {"date": "20 May 2022", "title": "Medical Coder Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Swedish Medical Center", "Interview Descriptions": "The talent and acquisitions takes a long time to schedule the interview but the interview process is pretty straight forward and virtual. overall a positive experience. I was \"pending interview\" for a month before I was contacted and scheduled.", "Interview Questions": "what would your previous supervisor/manager have to say about you?"}, {"date": "6 Mar 2022", "title": "Medical Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Swedish Medical Center", "Interview Descriptions": "They asked about my experience, my weakness, and my strength, and why did I want to work there. They asked about the difference between the different roles in the different clinics. It was not difficult.", "Interview Questions": "They asked about my experience, my weakness, and my strength, and why did I want to work there. They asked about the difference between the different roles in the different clinics. It was not difficult. "}, {"date": "12 Jan 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Swedish Medical Center", "Interview Descriptions": "Panel interview with several floor nurses, charge nurse and manager. The questions included clinical questions and then explanations about job. Very personable staff.  I really enjoyed meeting the nurse and the interview process.", "Interview Questions": "Name a patient scenario where you had to deal with a difficult patient."}, {"date": "7 Jan 2022", "title": "Clinical Research Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish Medical Center (Seattle, WA)", "Interview Descriptions": "Overall three rounds.first is screening and second is panel interview.Third round is in person.The process was good and easy.Total time duration is around a month.The overall process is great.The team was patient enough to answer all my questions", "Interview Questions": "How will your peers describe your strength and weekness"}, {"date": "8 Sept 2021", "title": "Patient Sitter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Swedish Medical Center in Aug 2021", "Interview Descriptions": "Pretty easy. Was told to reserve and hour and it ended up being a 6 minute video chat. Pretty straight forward with basic questions. Setting up your account to schedule the interview was a little confusing but overall not bad", "Interview Questions": "Why did I have a gap in my employment?"}], [{"date": "12 Jul 2021", "title": "Registered Nurse Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Swedish Medical Center", "Interview Descriptions": "Video group interview with peers and supervisors. Round table questions regarding some clinical situations and abstract value based questions. Overall was about 45 minutes and received job offer the next business day.", "Interview Questions": "How do you deal with a family who is asking you do change protocol to something to provide comfort for patient?"}, {"date": "13 Nov 2021", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 4 months. I interviewed at Swedish Medical Center (Seattle, WA) in Jun 2021", "Interview Descriptions": "A group interview but not all the intended people showed up. While some looked happy and were pleasant and engaging others looked miserable or left half way through or didn’t have screen on or were clearly not listening or engaged..  An unusual experience through virtual which was awkward", "Interview Questions": "Describe your leadership style and how you deal with poor performers "}, {"date": "11 Mar 2021", "title": "Remote Graphic Designer Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish Medical Center", "Interview Descriptions": "The process was unusual at best. It was conducted via Google Hangouts and then my answers were evaluated by the hiring committee but I had to stay online indefinitely while that was done.", "Interview Questions": "Q: Can you embrace challenge and complexity with a sense of enthusiasm?\nQ: How do you work with collaborators like copywriters, developers and project managers?"}, {"date": "15 Sept 2021", "title": "Resident RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Swedish Medical Center (Seattle, WA) in Feb 2021", "Interview Descriptions": "Online interview with different nurse managers who viewed your resume and decided you might be a good fit. The questions were fair, basic, and pretty standard. They want to know your clinical experience, strengths as a nurse, and teamwork skills amongst other things. Got an offer two days after the interview.", "Interview Questions": "Describe your clinical experience and how they relate to this position."}, {"date": "24 Jan 2021", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Swedish Medical Center (Denver, CO) in Dec 2020", "Interview Descriptions": "The entire process took 3 weeks. First, phone interview, then video call, and finally in person interview. First two rounds were ok, average questions. The final round of interview was terrible. They were very unprofessional, almost mocking me. Considering it was an entry level position, they asked difficult questions. I'm glad they didn't make an offer. They posted the job listing for the third time. It looks like they have no idea what they want.", "Interview Questions": "Tell me about a time when you tried to convince someone to do something, and you were not successful. What would you do differently in the future in order to convince them. \n"}, {"date": "6 Feb 2020", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Swedish Medical Center (Englewood, CO)", "Interview Descriptions": "Unit director was friendly, followed up with shadowing experience afterward. Staff RN were very friendly also but the whole process seemed a bit unorganized. The whole thing took about 5 hours or so.", "Interview Questions": "How do you handle stressful situations?"}, {"date": "9 Sept 2020", "title": "New Grad RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish Medical Center (Denver, CO) in Jan 2020", "Interview Descriptions": "The interview was suppose to be in person, but something came up and we had to do interview over the phone. After interview was over, I was asked to shadow the unit.  A couple days later I was offered the position.", "Interview Questions": "Tell me about yourself?\r\nTell me about a time you had a difficult patient, what did you do, and what was the outcome?\r\nWhat are your top three strongest traits"}, {"date": "25 Sept 2019", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 days. I interviewed at Swedish Medical Center (Denver, CO) in Sept 2019", "Interview Descriptions": "Staff RNs and director were all very nice and friendly. I spoke with three RNs from the floor at a job fair and was then invited to the unit to shadow a nurse. I'm a new grad nurse so the process for me may be a little bit different.", "Interview Questions": "Describe a patient situation where you made a difference (or something like that)"}, {"date": "12 Jul 2019", "title": "Machine Operator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Swedish Medical Center (Seattle, WA)", "Interview Descriptions": "Initial phone interview with hiring manager seeking experience and if I had any problems with working evenings or weekends. Single person review follow up with direct manager and an intro to coworkers. 30 Minutes.", "Interview Questions": "Talk about the position in your previous job. "}, {"date": "14 Jun 2019", "title": "Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Swedish Medical Center (Seattle, WA)", "Interview Descriptions": "Extensive with many people that were part of the process.  Combination of panel & individual interviews.  Extremely long process that last almost a full day.  Leaders were engaged and gave me their full attention.  Extremely nice and thoughtful leaders.", "Interview Questions": "Explain your recruitment process."}], [{"date": "12 Feb 2019", "title": "Registered Nurse, BSN Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Swedish Medical Center", "Interview Descriptions": "Unwelcoming. The manager and educator did interview. Read off the paper going down the list of questions. No real personality or excitement.  Did a brief tour and never introduced me to staff. Not sure if they already had someone else in mind for this position.", "Interview Questions": "If I was to ask your previous manager what developmental class you might need to take to improve,  what would they tell me? "}, {"date": "25 Aug 2018", "title": "RN Case Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish Medical Center", "Interview Descriptions": "Process was cool.  3 bosses interviewed followed by 4 Peer interviews (as a team).  I really enjoyed the process.  The only problem was with follow up.  They stated that they would be in contact with me either that afternoon or the next day.... its been more than a week now...I assume I didn't get the job but it is appropriate to do what you say you are going to do?", "Interview Questions": "How did you overcome a difficult or stressful time at work or at home?"}, {"date": "25 Jan 2018", "title": "Registered Nurse Orthopedics Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Swedish Medical Center in Jan 2018", "Interview Descriptions": "Went to the HealthOne hiring event, interviewed on the spot, got called the next day and offered the position.  The nurse manager and the charge nurse interviewed me.  Nurse manager kept getting up to get food and not really listening to the interview. They were basically looking for a bodies. It was pretty unprofessional.", "Interview Questions": "How do you feel about working with the nurse to patient ratio of 1 to 8 patients?"}, {"date": "5 Nov 2017", "title": "Nurse Residency Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish Medical Center in Nov 2017", "Interview Descriptions": "This was a HireVue (video) type of interview. The question would come up and you had an unlimited amount of times to prep before each question. Once you were ready, you were only allowed to record answer once (no going back or re doing).", "Interview Questions": "As a nurse how do you envision yourself making a positive impact on patient experience\r\n\r\nPlease share about a time when your assigned patient was exhibiting symptoms that made you feel like you needed to act quickly to intervene. What was the situation, what did you do, what was the outcome.\r\n\r\n\r\n"}, {"date": "5 Sept 2018", "title": "Human Resources Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Swedish Medical Center in Aug 2017", "Interview Descriptions": "Very long, multi-step process. Be prepared for at least five “interviews” ranging from a self-assessment exam, phone call with a recruiter, phone interview, panel interview and a job shadow with another private meeting with hiring head. No easy feat when you have a full-time job. At the job shadow words used like “this will be your office” and then devastating news of not being selected after having invested hours in the process.", "Interview Questions": "Name a time you were confronted with an ethical dilemma, how did you handle it?"}, {"date": "20 Apr 2017", "title": "Vice President Orthopedic Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Swedish Medical Center", "Interview Descriptions": "Half the people didn't even show up for the interview wasn't one time and then I had to go back a second time because of their mistakes of not being there", "Interview Questions": "The basic questions traditional over and over culture"}, {"date": "9 Jan 2018", "title": "Patient Care Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Swedish Medical Center in Mar 2017", "Interview Descriptions": "The in person interview was about 10-15 questions. They were questions like tell me a time when.....I was called back for a 4 hour shadow shift the next week and was followed by a group interview afterwards. Very casual and welcoming.", "Interview Questions": "Tell me about a difficult time with a coworker and how you handled it?"}, {"date": "18 Oct 2016", "title": "Physical Therapist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Swedish Medical Center", "Interview Descriptions": "Applied online, contacted by a recruiter, phone interview with a manager in the Physical Therapy dept, in-person panel interview with Physical Therapy director and management followed by an in-person interview with peers, finally a job shadow to determine if there would be a good fit.", "Interview Questions": "What is the most challenging aspect of multi-tasking?"}, {"date": "6 Dec 2018", "title": "RN Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 2 weeks. I interviewed at Swedish Medical Center in Sept 2016", "Interview Descriptions": "approached by an HCA recruiter who was very nice, professional, applied online, f/u with a personality assessment online, called in to interview on 2 different floors, called back for one, offer was close ended leaving no room for negotiation and the HR rep was fairly rude about it.  Was told in the interview that I could have my pick of which holiday to have off, once I accepted they made me work both Christmas and Thanksgiving- when I had asked HR about this before accepting the offer they said it wasn't their job/decision...", "Interview Questions": "Asked a q about punctuality, another on strengths and weaknesses, how to deal with difficult patients/families, reactions to changes in work environment, all needing examples to explain, and 5 words to describe yourself, how to diagnose sepsis"}], [{"date": "8 Aug 2016", "title": "Pct Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Swedish Medical Center (Englewood, CO) in Jan 2016", "Interview Descriptions": "Applied online and got an email from the recruiter after a day or so. The recruiter called me and ask basic questions and then he scheduled an in-person interview with the Asst. Director of the department.", "Interview Questions": "Why did you apply for the position"}, {"date": "20 Oct 2015", "title": "Staff RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Swedish Medical Center", "Interview Descriptions": "I had a phone interview due to living out of state. The interview lasted 15 mins and was with 3 people. I was hired the next day based off the phone interview. Easy!", "Interview Questions": "A medical mistake you have made."}, {"date": "17 Oct 2015", "title": "Exercise Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Swedish Medical Center (Englewood, CO) in Oct 2015", "Interview Descriptions": "I applied for the position on Glassdoor and was contacted by email the following day to set up an interview. I interviewed with the hiring manager, and was asked back for a staff interview. I met with a few different positions, two positions that I would be supporting and one in the position I was interviewing for. I really enjoyed that the entire team has a role in the hiring process and the department is amazing! Very awesome team from what I've seen so far.", "Interview Questions": "What is your 3-5 year plan? "}, {"date": "16 Jan 2015", "title": "Registered Nurse Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Swedish Medical Center (Denver, CO) in Jan 2015", "Interview Descriptions": "I applied my position online and after i passed my frist interview in HealthOne office, they get me a second interview for the hospital that Im applying. I have 5 panels who interviewed me. They ask my Scenario questions, Behavioral questions and Traditional questions.", "Interview Questions": "What is your short term and Long tern goal?"}]]