[[{"date": "23 Jan 2022", "title": "Management Trainee Officer (MTO) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Pride Group (Savar) in Jan 2022", "Interview Descriptions": "At first they take a written test then the next phase is viva. After all those things they make a short list. Then again they called those short listed person and they take viva again. After the viva they select some employee they need.", "Interview Questions": "1. What's my name?\r\n2. Where you from?\r\n3.Your origin? \r\n5.Tell me about your career plan and also your family\r\n"}, {"date": "9 Nov 2021", "title": "Kitchen Team Member Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Pride Group", "Interview Descriptions": "Pretty straightforward.  I received a good explanation of what the job entails and what was expected of me. The menu is in a rotation which make prep and timing easier day to day.", "Interview Questions": "If I was flexible as far as scheduled hours were concerned."}, {"date": "15 Apr 2016", "title": "Operations Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Pride Group (Tempe, AZ) in Apr 2016", "Interview Descriptions": "I was emailed by the VP of Equipment's assistant and setup an interview with him and the VP of Operations. I wasn't going to take the interview, but decided I was interested in finding out why they would have wanted to meet with me. I was very clear that I am in analytics, and they told me right away that's not the type of person they were looking for. \r\n\r\nThey were also 10 minutes late to the interview.\r\n\r\nOverall, I didn't get a professional vibe from them. They are clearly successful in what they do, but the type of people they hire are basically hands-on paper pushers and blue collar workers. If you're remotely analytical or looking for a white collar position, this won't be the place for you. If you're blue collar, hands-on worker, this will probably be right up your alley. And I mean no disrespect with that. Some people like getting their hands dirty, others like to stare at spreadsheets all day (my specialty). Business and college grads, this isn't the company you'll want to work for.", "Interview Questions": "Did you like working for your former boss?"}], []]