[[{"date": "13 May 2022", "title": "Dietitian Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied in-person. I interviewed at Jewish General Hospital (Montreal, QC)", "Interview Descriptions": "The interview was intimidating, asked relèvent questions. Hard to think on the spot but If you’re good at that you should be okay. There are 2 managers sitting in the room while asking you questions", "Interview Questions": "To calculate a tube feeding formula "}, {"date": "11 May 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Jewish General Hospital", "Interview Descriptions": "Common interview process. Meeting with HR and head nurse. Questions about nursing knowledge and case studies. They really want to test your critical thinking and capacity to prioritize. Once you are chosen they call you within a week.", "Interview Questions": "They give you 4 scenarios of fictive patients ask you to prioritize their care"}, {"date": "5 Apr 2022", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Jewish General Hospital", "Interview Descriptions": "The process was fast and the interviewers were nice. It went smoothly.  The questions were pertinent to the unit. My interview was through zoom.  I was interviewed by 2 people", "Interview Questions": "why the Jewish General Hospital"}, {"date": "24 Aug 2021", "title": "Summer Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Jewish General Hospital (Montreal, QC)", "Interview Descriptions": "The interviewer was very kind and comprehensive. She seemed very interested in me and my career. She was encouraging and willing to help me attend my goals. She was discussing with me all the possibilities and offers.", "Interview Questions": "They asked me about my studies and my career goals "}, {"date": "21 Dec 2022", "title": "Administrative Agent Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Jewish General Hospital in Jan 2021", "Interview Descriptions": "First Interview was done on zoom . Employee was very kind and asked straightforward questions and all of my questions and concerns were clarified. Then upon hiring theirs a lot of paper work to fill out .", "Interview Questions": "Tell me about yourself? Why do you want to work with us ? What is your weakness?"}, {"date": "30 Jul 2020", "title": "Unit Agent Class II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Jewish General Hospital in Jul 2020", "Interview Descriptions": "Call from HR representative to schedule interview with herself and unit manager.\r\nInterview on Zoom due to COVID pandemic, about 45 minutes in length. Questions both situational as well as personal (career goals, previous employment experience, education, etc.)", "Interview Questions": "How do you handle difficult patients"}, {"date": "5 Aug 2020", "title": "Unit Agent Class II (Recall) Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through other source. The process took 3 weeks. I interviewed at Jewish General Hospital (Montreal, QC) in Jul 2020", "Interview Descriptions": "Got in through a friend who works there. I have a feeling that your connections and who you know are very important. I was contacted by someone from HR for an initial phone interview. Questions: -confirm your name\r\n-Where did your graduate from( all schools)\r\n-Availability \r\n-description Of the position \r\nAfter the the phone interview I was sent an administrative test which is comprised of: English language, French language, Microsoft Word, Microsoft Excel, Microsoft PowerPoint. You only get the results at your main interview. After that I had a scheduled interview with the HR representative and a unit manager on Zoom ( virtual)  due to Covid pandemic.", "Interview Questions": "Tell us about yourself"}, {"date": "13 Jul 2020", "title": "CPNP (Candidate for the Profession of Nursing) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 day. I interviewed at Jewish General Hospital (Montreal, QC) in Nov 2019", "Interview Descriptions": "There are two rounds of interviews. First round is phone interview, some questions like why would you be a nurse, why do you select to work for the hospital/unit. Then 2nd round, there are two interviewers in the procedure. one is the HN, the other from HR. The interview may take place in HN's office, or conference room. I directly submitted my CV to HN as I did my clinical on that ward.", "Interview Questions": "I applied for internal medicine ward. The questions are about how to administer the meds, how to give insulin, when should you call MD, what is you midterm goal, etc. "}, {"date": "18 Aug 2021", "title": "Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Jewish General Hospital (Montreal, QC) in Feb 2019", "Interview Descriptions": "Asked typical interview questions (i.e. tell us about yourself, why should we hire you) and included clinica scenarios regarding common diagnosis such as COPD, diabetes, fractures etc... The type of diagnosis would depend on the unit you are interviewed for.", "Interview Questions": "Q: What tests would be done for an elderly patient with a fall\nQ: What is one quality you do not like in other colleagues "}, {"date": "24 Jul 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Jewish General Hospital", "Interview Descriptions": "sent the resume, then after a month i've received a call for an interview with a committee of 4 persons. The interview was good and everything was smooth. I had personality questions and cases", "Interview Questions": "why you want to work at the jgh?\r\ntell us about your experience?\r\nHow do you manage a project from a to z\r\n"}], [{"date": "26 Nov 2018", "title": "Unit Agent Class II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Jewish General Hospital (Montreal, QC) in May 2017", "Interview Descriptions": "2 interview process. you do a computer (excel/word test about 15-30 multiple choice questions) followed by a language test. The skills test is long. After that, I waited about a week or so, HR calls and  they set up an interview with you , the HR person and your boss for final interview.", "Interview Questions": "If you had the call bell that rings, the telephone rings , a doctor who asks for you to send a patient down for a test and a visitor by your desk asking you for directions, in which order of priority do you go about the tasks?"}, {"date": "2 Feb 2021", "title": "Postdoctoral Fellowship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 weeks. I interviewed at Jewish General Hospital (Montreal, QC) in Feb 2017", "Interview Descriptions": "The interview process was very helpful, average in difficulty and welcoming. People who work at the company were very inviting and great. The atmosphere of the company is very organized and nice. The position is very exciting and intriguing.", "Interview Questions": "What are the skills that prepared you for this position?\r\nWhy did you choose our company?\r\nWhy do you think you are a proper and good fit for this position?\r\n"}, {"date": "4 Mar 2021", "title": "Postdoctoral Fellow Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Jewish General Hospital (Montreal, QC) in Feb 2017", "Interview Descriptions": "The interview process provided me with great experience and was  fair. The atmosphere was stimulating and the supervisor was so kind. I would definitely recommend the place for future prospect who are interested in developing their careers.", "Interview Questions": "What are your accomplishments and strengths? "}, {"date": "20 Apr 2018", "title": "CPNP (Candidate for the Profession of Nursing) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Jewish General Hospital (Montreal, QC) in Feb 2016", "Interview Descriptions": "I submitted my application online. Unlike most other applicants, I never received a call from HR, but directly from the head nurse. She invited me for an interview.  Had the interview in her office with the nurse educator. They were very casual and warm. Most questions were very typical interview questions (in any field). If you spend an hour or two watching youtube videos about nursing interviews you'll do well. They also asked a case study question. They did not expect me to know the answer but were more interested in my thought process and reasoning. I thought I did horrible but got a call the very next day saying I got the job.", "Interview Questions": "My patient had a bowel resection two days ago and has been vomiting twice a shift since. Describe your assessment and interventions. (Something along those lines)\r\n"}, {"date": "7 Nov 2015", "title": "Network Administration Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. I interviewed at Jewish General Hospital (Montreal, QC)", "Interview Descriptions": "There were a lot of questions about Networking and teamwork. The questions about teamwork were more difficult because the answers can be different for different companies. And it is difficult to understand which answer is right for which company. I did my best but I do not know about were my answers correct.", "Interview Questions": "Networking:\r\n- Protocols\r\n- Troubleshooting\r\n- Routing\r\n- Switching\r\n- Cisco configuration\r\netc\r\n\r\nTeamwork:\r\n- Many questions about teamwork\r\netc"}, {"date": "11 Jul 2016", "title": "Hospital Administrative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Jewish General Hospital (Montreal, QC) in Jul 2015", "Interview Descriptions": "I applied online and received a phone call approximately a month later. It was comprised of interviews by HR, in-person tests and once hired, there was a physical to pass on-site. Following this, they advised me that they could place me in a variety of positions or departments as needed.", "Interview Questions": "The toughest part of the interview was when they asked multiple \"scenario\" type questions but overall it was laid back and low pressure.I was made an offer within two months of my initial application."}, {"date": "21 Mar 2018", "title": "Administrative Technician Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Jewish General Hospital (Montreal, QC) in Aug 2014", "Interview Descriptions": "it was pleasant and the staff was nice.  I met with the main person responsible for technicians then the manager for that department.  both were pleasant.  they tested me in both official languages written and spoken.", "Interview Questions": "Am I experienced in office work.  Testing was also performed"}, {"date": "8 Jun 2015", "title": "RN Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. The process took 1 day. I interviewed at Jewish General Hospital (Montreal, QC) in Feb 2011", "Interview Descriptions": "Head nurse and her assistant (always 2 nurses), we were in a closed room, they looked the type of clothes that I was wearing,  how much eye contact that I gave , they were asking lots of personal questions", "Interview Questions": "why do you want to work here? why do you travel so ? (they wanted to see that the candidate is someone stable that is not going to leave after passing the licensing exam)"}]]