[[{"date": "9 May 2023", "title": "Contact Center Agent Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Bromford (Bristol, England)", "Interview Descriptions": "Really good, no issues, in navigating what was expected, I was not successful, but will try again if the opportunity arises. People were helpful easy to understand, it was not too pressured, and I fell fair and reasonable.", "Interview Questions": "Experience was a major requirement"}, {"date": "11 Apr 2023", "title": "Service Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bromford (Lichfield, England) in Apr 2023", "Interview Descriptions": "Very easy, just an informal chat, they made you feel at ease, and just asked the normal standard interview questions. It took a while after to get a decision but there was the easter bank holiday inbetween.", "Interview Questions": "When were you stopped in your tracks at work and unsure what to do?"}, {"date": "7 Feb 2023", "title": "Customer Service Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Bromford (Wolverhampton, England) in Feb 2023", "Interview Descriptions": "Great team, made to feel relaxed. Assessment a great way to get an insight to the position and also get a feel for the workplace. Team leaders are all very welcoming. Can already see this would be a fantastic place to work.", "Interview Questions": "Speed dating style get to know"}, {"date": "24 Feb 2023", "title": "Customer Service Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bromford in Feb 2023", "Interview Descriptions": "I was invited along to a relaxed group assessment, this was followed by a more formal interview a week later, which was competency and behavioural based. The interviewers were very friendly and put me at ease.", "Interview Questions": "Tell us about a time when you went the extra mile for a customer."}, {"date": "27 Feb 2023", "title": "Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bromford (Wolverhampton, England) in Dec 2022", "Interview Descriptions": "Application form filled in via their dedicated job website. I received a phone call inviting me to interview and was offered a choice of time slots. I attended the interview in person at their office, approx 1 hour. The outcome was emailed to me, which in this case was a rejection. I replied asking for feedback, and the admin person seemed confused that I had not received a phone call prior to her email and seemed under the impression I already knew. I advised her that her email was the first I knew about the outcome. She confirmed she would get someone to contact me with feedback. I did not hear anything, so a while later I repeated my request, but again nobody bothered to respond. I found this frustrating as their application process demanded a higher level of effort/input than other vacancies, and yet they did not take any time to provide any feedback at all.", "Interview Questions": "Tell us about a time you failed to meet a deadline at work."}, {"date": "10 Sept 2022", "title": "Neighbourhood Coach Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Bromford (Tewkesbury, England) in Sept 2022", "Interview Descriptions": "Greated warmly, interviewers put you at your ease, allowed you to get settled. Discussed job role, followed by various questions to get to know you and your past experience what you can offer, what you understand about aspects of the job role.  Time to ask your own questions.  After the initial interview there were some written tasks and they gave you plenty of time to answer them.  Very relaxed and informative", "Interview Questions": "What does safe guarding mean to you can you explain what safe guarding is"}, {"date": "29 Sept 2022", "title": "Learning and Development Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Bromford in Sept 2022", "Interview Descriptions": "The interview I attended in general were good. However, the recruitment team is by far the worst team for communication I have come across in any job search.\r\n\r\nI was invited for an initial telephone interview with a recruiter, who then did not call me as scheduled, I received a call the following week. Just general experience questions for 20 minutes.\r\n\r\nI was then invited to another telephone interview with the hiring manager. It took 40 minutes. All situational questions. The manager was very friendly and forthcoming in answering my questions. He called when scheduled. I was told i would find out of my success by the end of the week on the Wednesday. I was not contacted at all, just sent an email invite to book in my face to face email on the following Tuesday.\r\n\r\nFor the face to face interview i had to prepare a presentation. For this i put a lot of time and effort into creating and rehearsing. Following the presentation i answering more situational interview questions. At the end of the interview i was told i would be contacted at the end of the week to be told if i have been successful.\r\n\r\nI contacted the recruiter at the end of the week as it was nearing the end of the day and was then told that I will be contacted on the Monday. \r\n\r\nFrom there i have heard nothing. It has been a following two weeks so i presume i have not been successful even though they have not updated their recruitment portal and it still states pending.\r\n\r\nConsidering the amount of time and effort i had put into the interview process the least a company can do is inform the candidate if they are successful or not. It is rude and given me a horrible impression of the company as a whole. I was fairly excited to interview for Bromford but now I will avoid and advise as many peope to avoid also. \r\n\r\nBromford, if you are paying a recruitment team you should make sure they are doing their jobs fully, not only half of one.", "Interview Questions": "How would you find a companies training needs?"}, {"date": "15 Jul 2022", "title": "Neighbourhood Coach Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Bromford", "Interview Descriptions": "Very lengthy and thorough. Pre telephone call, questions to answer for personality, 1.5 hour interview by 2 managers and then a written task. Made me feel very comfortable during the interview.", "Interview Questions": "describe to us what safeguarding is?"}, {"date": "16 Mar 2023", "title": "Risk Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Bromford in May 2022", "Interview Descriptions": "two stage interview. Competency based interview followed by a follow up interview with SLT. Strong focus on Bromford's DNA throughout the process. Recruitment team are helpful, and the process overall was swift.", "Interview Questions": "A range of competency based interview questions, work experience, and DNA fit"}, {"date": "6 Apr 2022", "title": "Graduate Internal Audit Apprenticeship Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Bromford (Wolverhampton, England) in Apr 2022", "Interview Descriptions": "There was an application online with a couple of questions, which have a 250 character limit. If you are successful you have an assessment centres where you partake in group activities. If you are successful after that you get invited to interview. Prior to interview you are asked to complete a psychometric test\r\n\r\nThe interview was a competency/behaviour based interview. You also had to do a little test \r\n\r\nMake sure you talk about their DNA and read up on their strategy.\r\n\r\nThey say they will let you know at the end of the week and I got a call the same day that I missed but then one the next day where feedback was provided", "Interview Questions": "Why do you want to work for Bromford? "}], [{"date": "11 Jan 2022", "title": "Electrical Administrator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Bromford (Wolverhampton, England) in Jun 2021", "Interview Descriptions": "Interview was very professional and I was made to feel at ease.  I was asked about 10 questions on how I would deal with different scenarios. I was asked if I had any experience in the role I was applying for. I found the interview quite easy", "Interview Questions": "How would I deal with a difficult customer"}, {"date": "18 Jul 2023", "title": "Communications Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Bromford (Tewkesbury, England) in Apr 2021", "Interview Descriptions": "An online interview process. It was really good, there were 2 interviewers. They had a relaxed style but one that led to a detailed chat about why I wanted to work for Bromford and both mine and the company's values.", "Interview Questions": "Why do you want to work at Bromford"}, {"date": "16 Mar 2021", "title": "HR Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. The process took 1+ week. I interviewed at Bromford", "Interview Descriptions": "There was an initial phone screening to briefly go through my CV and past experience. This was followed by a 2 stage interview, as well as a psychometric profiling questionnaire.", "Interview Questions": "Competency based questions as well as some based on the psychometric profile"}], [], [{"date": "4 Jun 2019", "title": "Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Bromford (Lichfield, England) in Sept 2018", "Interview Descriptions": "After submitting a written application online I was interviewed and also completed some written assessments. Once I had completed this I was called back to shadow a Bromford member of staff to see the job in practice to ensure this was something that I wanted  to do.", "Interview Questions": "About previous experience"}, {"date": "7 Aug 2018", "title": "Lettings Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Bromford (Bristol, England) in Aug 2018", "Interview Descriptions": "Process was fine, quite easy, online application, asked to prepare a presentation, and then present for 10 -15 minutes, then approximately 8 questions.  The interview was over a week ago and the company have not bothered to respond or provide any feedback.  This does not look good for the organisation", "Interview Questions": "A couple of questions were worded poorly and could have been done better, I am still waiting for a response from them, I find this extremely poor that candidates put time and effort in and they don't bother to get back to you when they say they will.  Its very poor shows a lack of thought and I feel that companies need to realise that you are choosing them, its not just them choosing you.  The behaviour a candidate experiences from the outset, whether they are offered the role or not is the experience they discuss with others and it does show the company in a bad light and makes people not want to work for them."}], [], [], [], [], []]