[[{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Materials.transport", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Feb 2017", "job_title": "Anonymous Employee in Athens, GA", "duration": "N/A", "pros": "Awesome staff Care for each other and patients", "cons": "none I can think of at this time"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Many people are leaving", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "26 May 2023", "job_title": "Provider in Athens, GA", "duration": "N/A", "pros": "Major addition to the hospital has been completed", "cons": "Many employees are leaving. Major staffing issues"}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Great coworkers but upper management/HR needs improvement", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Sept 2022", "job_title": "Laboratory Technician in Athens, GA", "duration": "N/A", "pros": "Coworkers are hardworkers and the work is rewarding", "cons": "Pay is suboptimal and shortage of staff results in stressful environment."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": 5, "Career Opportunities": 5, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Feb 2022", "job_title": "Registered Nurse in Maysville, GA", "duration": "N/A", "pros": "Good teamwork. Great co-workers. Knowledgeable staff.", "cons": "Pay could be better. Float to other units often."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": 0, "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Out of touch management .", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "9 Jul 2021", "job_title": "Physician in Athens, GA", "duration": "N/A", "pros": "Physicians are well trained and competent. Nursing staff generally cares. Growing ability to handle complex medical problems.", "cons": "Management is disconnected from reality. There is a tremendous amount of nepotism that controls everything in the hospital. Disagreement is not allowed. There is growing physician discontent"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Recruiter", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Aug 2021", "job_title": "Recruiter in Athens, AL", "duration": "N/A", "pros": "Yes everything was ok there", "cons": "No I don’t recommend this"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "It all comes down to poor Management on every level", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Jul 2015", "job_title": "Anonymous Employee in Athens, GA", "duration": "N/A", "pros": "There are a lot of really good employees. For the most part, staff are hard working and really care about giving excellent patient care.", "cons": "Very poor management on all levels - From upper management to mid-level to departmental management teams.  High Mgmt turnover within departments. You have people in decision making roles who have no idea what is really going on. There is a huge disconnect between management and staff. Management spends way too much time behind closed doors or in meetings.  These people are professional meetings attendees. They do little more than that. Then you have the \"Managers\" who do nothing but sit in an office all day and get paid. Their own staff have no idea what their purpose is.  This used to be a great hospital at one time, but poor management and leadership has run it into the ground. Don't even get me started on the pay and horrible benefits! The insurance has a $4500 deductible!! Someone in HR actually thought this was a good idea??!! The hard working staff in the trenches doing all the work everyday get no\nRespect or appreciation, but we all stick it out hoping that someday things will change."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "FORMERLY a great place to work.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "15 Jan 2014", "job_title": "Support Staff in Athens, GA", "duration": "N/A", "pros": "The benefits, however those have also been slowly pared away, if the new management could get away with it, we'd have either none or pay more for them out of our own pockets.", "cons": "A serious lack of communications between depts. Senior Management has a real problem with actually caring about it's employees. There is little to no recognition of employees work. Work hard or slack off, they really just don't give a d@mn. Incompetency rules the day."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Have worked full time at ARMC for 8 years", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "26 Oct 2013", "job_title": "Registered Nurse in Athens, GA", "duration": "N/A", "pros": "Athens is a great place to live! Lots of good nurses and doctors at ARMC. Many good places across the street or very close to get food. Location close to many things on broad street.", "cons": "Have steadily cut pay, benefits, positions in the last 2 years. Many, many people have been fired this year! Very few units have the same directors since Jamey Thaw CEO came. Some units are on there 2nd director since he came. Prefers to have cheaper ancillary personal and nurses. These are nurses with much much less experience. Prefers part time nurses over full time nurses. ARMC has no part time benefits.\r\n      Insurance for next year has a 4,500 deductible with an 80$ co-pay for a specialist visit. ARMC owns Athens Area Health Plan Select and many, many general practitioner and pediatrician offices. This seems to me to be a conflict of interest."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Beautiful campus on the outside, with many great employees, but upper management and organization is a nightmare.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Jan 2015", "job_title": "Anonymous Employee in Athens, GA", "duration": "N/A", "pros": "Generally nice working environment/working conditions; you get exercise room access for being an employee or volunteer. Most staff members are extremely friendly and helpful, and fun to work with. The company trains during the first week of work on how to be an exceptional employee, which can be helpful beyond working at ARMC.", "cons": "There is very little room for advancement or even horizontal movement within the company.  Upper management does not seem to care about issues if someone low on the totem pole brings concerns about administrative operations to their attention. The administration is quick to \"dismiss\" employees under the guise of sudden budget cuts and position eliminations. Extremely unorganized hierarchy of power. Every department is like an entirely different entity as far as internal operations go; very little coherency and communication between departments. Constant changes in leadership, which leads to constant changes and inconsistencies in policies and procedures."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 5, "Senior Management": 3, "review_title": "great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Oct 2008", "job_title": "Physician in Athens, GA", "duration": "N/A", "pros": "average salaries but good benefits.  hospital seems to understand that satisfied employees cost the hospital less, improve service and care, and increase its chances for success", "cons": "management does not seem to bring the common employees into the information network except to announce events that are happening.  by the time information filters down to the workers, the decisions have been made."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Come for the experience, not the pay.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Mar 2015", "job_title": "Support Service Tech in Athens, GA", "duration": "N/A", "pros": "Great direct patient exposure if you need it for school or business. Lot's of networking with medical professionals if your not afraid to meet new people. If your persistent, you can shadow and assist with a lot of amazing procedures that are above your title.", "cons": "They don't pay...period. The small town theme rings loud. To add that, some internal purchasing errors have but the hospital in a bad spot. Doctors are leaving left and right. Nurses threaten everyday to quit, but many of them feel stuck. PCT and other staff are over worked because they can't keep people. Favoritism also controls the schedule on a lot of floors. Moving to a new department takes an act of congress."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "RN", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Oct 2018", "job_title": "Staff RN in Athens, GA", "duration": "N/A", "pros": "Decent pay and a lot of benefits", "cons": "Crappy insurance, management that doesn't know a thing about some of the units they are responsible for, and therefore put bully charge nurses in place that cover up a lot of horrendous things that go on on the unit.. Since Piedmont took over, too much red gape and firing the best employees for stupid stuff regardless of the circumstance"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Always something to do", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "11 Nov 2016", "job_title": "Anonymous Employee in Athens, GA", "duration": "N/A", "pros": "Hospital IT department is in constant flux so there is always a new project to work on.  Since 2010 ARMC has gone through 3.5 system-wide EMR changes and will soon be doing a 4th, due to the acquisition by Piedmont", "cons": "Salary, while competitive for Athens, does not come close to what can be earned at other non-local businesses."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Poorly managed environment", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Jun 2014", "job_title": "IS in Athens, GA", "duration": "N/A", "pros": "Front line staff for patient care is dedicated.   Strong feeling of community and service to community.    Pay is reasonable.   Benefits are fair but penalties for not using Athens Regional Pharmacy are a slap in face that offset other benfits.", "cons": "Extremely weak management at all levels.   Managers fail to manage staff or issues.   Most managers  take an \"iron hand / my way or the highway\" approach.    Others try to be their staff's best friend and fail to hold them  accountable for anything.   The few good managers are becoming increasingly frustrated.      There is a lot of  \"us against them\" politics between work groups.    \r\n\r\nThe Information Services department is too small for the scope of work and project schedules they are asked to support.    The department has survived this long by heroic effort of specific individuals (many of whom have become frustrated and left over the past two years).    Frontline IS staff level has been reduced by 25% over the last few years while additional levels of management (CTO / Director) have been added.   An IS department of this size should not require CIO, CMO, CTO, and mutliple director positions in addition to front line unit managers.  \r\n\r\nIS staff roles are changed randomly based on the current crisis; whims of newly arrived management/consultants; or the current manager's inability to address staff performance issues."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Definitely not the same place it was a few years ago", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Feb 2015", "job_title": "Nursing in Athens, GA", "duration": "N/A", "pros": "Compensation, some co-workers, cafeteria food is good", "cons": "Disorganized, high turn over of staff, lack of parking for employees, benefits are expensive, hospital has tried to grow too fast and it shows"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "People are leaving for a reason", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "20 May 2014", "job_title": "Employee in Athens, GA", "duration": "N/A", "pros": "Currently not many.  The benefits are a positive but they have been dramatically cut over the past 2 years.", "cons": "As an employee for more than 10 years, I have seen Athens Regional go from a vibrant and expanding hospital to losing many of its best and brightest employees over the course of only two years.  The hospital is no longer increasing its patient base but rather struggling to function on a day-to-day basis.  The IT department has been decimated by its current CIO.  Her complete lack of communication with her own department as well as the rest of the hospital means that her decisions (and she makes all IT decisions) are made in a vacuum with no basis in real life experience.  Subsequently the people who use tech have absolutely no input into what tech they get to use.  People are really told what they get and to make it work.  This has resulted in extreme inefficiencies and risky patient safety policies.\r\n\r\nMore importantly, the CEO is completely out of touch with his hospital.  On the one hand he puts out politically correct and glowing e-mails and blog posts about how wonderful the hospital is running.  In reality, his decisions to fire key long term and well respected personnel, completely suppress any opinion other than his own by threat of termination, and spend incredible amounts of hospital money on systems that were poorly chosen, again with no input from the people who will actually use them, have placed the hospital in a financially unstable state.  The hospital board seems oblivious that his actions place the hospital at risk.  There is a fear amongst upper and mid level managers and directors that any dissent or opinion that does not line up with the C-level thought will result in termination.  Subsequently, there is no discussion or evaluation prior to the institution of new policies.  And the fear is real.  Multiple high-level well thought of managers have been terminated without warning and for no apparent reason other than they expressed a dissenting opinion.\r\n\r\nAs a result of all this, the hospital is struggling.  It will take a new CEO with the ability to utilize the wealth of intellectual treasure that is the hospital's employees for ARMC return to its stature as a vibrant and growing hospital."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Sinking ship!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "4 Aug 2014", "job_title": "Anonymous Employee in Athens, GA", "duration": "N/A", "pros": "Everything good about ARMC has vanished. There are no rewards to working at ARMC besides knowing you took exceptional care of the community while you were at work.", "cons": "It use to be a teamwork environment. The company cared about its employees at one time, but unfortunately that is no longer the case. You are another replaceable body and they let you know how little you are valued especially when performance appraisal awards are withheld due to the \"economy\". They expect everything from you including sacrificing your time with family for the good of the company. They don't allow you to be a human being with a real life. Should you be a woman and decide to have children, expect to not have career advancement opportunities and a condescending patriarchal leadership to your new role as a mother. They love to make examples out of pregnant workers and push them to the breaking point and make them go out on maternity leave early. If you can no longer do your job description due to an injury from work, be ready to be kicked to the curb. You are replaceable and they thrive on replacing you with someone younger and cheaper. The good 'ol boy network is still alive and well in this hospital. HR is not your friend. Do not trust HR to have your best interest in mind, because they don't.  You need to listen and read between the words in order to protect yourself. Keep very detailed records of everything that happens and not on ARMC's computers. If you can start your career at ARMC and retire from there with the new management team in place, my hats off to you. Goodluck!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "The pay was fair and benefits were great when I was there", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "15 Aug 2013", "job_title": "Staff RN in Athens, GA", "duration": "N/A", "pros": "The benefits were great when I was there.  I have heard they are not as affordable and do not cover as much now, but that it with everywhere these days", "cons": "The pay raises are very small.  The CEO is paid ridiculously too much!!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "Classic bureaucracy", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "21 Nov 2014", "job_title": "Anonymous in Athens, GA", "duration": "N/A", "pros": "I can't think of anything good to say, however I believe for the most part, the medical staff are highly skilled professionals. The business end of the organization is the complete opposite. (low down and dirty)", "cons": "Too many to mention but, here's a start. Management and assistants mostly consists of a bunch of  incompetent people who got their jobs because they were friends or \"more\" with a department hiring manager. The level of unfairness is nauseating. The slackers keep their jobs and the employees who actually come to work on time and do a great job are threats to the status quo."}], [{"Recommended": "N/A", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 3, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 0, "Senior Management": 3, "review_title": "Decent place to work, but not much growth potential.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "29 May 2010", "job_title": "Data Analyst in Athens, GA", "duration": "N/A", "pros": "Flexibility, communication, discounts. There is a community feel at the company, and the people for the most part are a pleasure to work with.", "cons": "Lack of recognition, no raise or bonus even with a great annual review. Very disappointed about the lack of monetary recognition. Of course management did get raises and bonuses!"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Great atmosphere and community, but lacks direction under current CEO. Company is drifting...", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "14 Oct 2013", "job_title": "Director in Athens, GA", "duration": "N/A", "pros": "Great environment to work in, it feels like a family.\r\nWonderful quality of life in Athens, GA.\r\nYou get the sense that our patients really appreciate the work we do.", "cons": "There is not a lot of opportunity for advancement.\r\nNo clear direction for the organization from the CEO--you get the impression he's in over his head."}, {"Recommended": "Yes", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Used to be a great place to work, still has potential!", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "25 May 2014", "job_title": "RESPIRATORY in Athens, GA", "duration": "N/A", "pros": "Awesome employees! Great people, decent benefits although they used to be great.", "cons": "Benefits while good, have been cut! There is a lack of communication between managers and the workers. In some departments anyway.  Not much in the way of opportunities for advancement. Would like to see a better scheduling system."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Incompetent and paranoid leader", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "15 Feb 2014", "job_title": "Anonymous Employee in Athens, GA", "duration": "N/A", "pros": "Staff in trenches care about quality of patient care work hard to bridge the gaps created by leadership poor decision making", "cons": "CEO has a social phobia--lacks any ability to inspire and direct the troops. More interested in finding out who his enemies are rather than leading. Has placed incompetent and inexperienced people in IT and COO roles. Enterprise is coming apart and is 15 months away from major crisis. Conflicts of interest abound, nursing staff severely fatigued and demoralized, many fearing for patient safety and cataclysmic event occurring."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Don't waste your time working here if you are in allied health.", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Jun 2014", "job_title": "CPhT in Athens, GA", "duration": "N/A", "pros": "You get a paycheck… that is about it. Look elsewhere if you want to be happy and feel appreciated.", "cons": "Poor management, management is up in the clouds, they could really careless about the life or feelings of the individual. All they do is use you.."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "ARMC", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "10 May 2016", "job_title": "Staff RN in Athens, GA", "duration": "N/A", "pros": "The salaries were decent. Co-workers were fun and very competent.", "cons": "It's all about appearances. They are more interested in you knowing the hospital values or mission statement than knowing how to care for sick people. Always focused on PR. Brown-nosers go to the top."}, {"Recommended": "Yes", "CEO Approval": "N/A", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Not horrible, not great", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Dec 2012", "job_title": "Anonymous Employee in Athens, GA", "duration": "N/A", "pros": "Really good employees.  The clinical staff is incredibly caring.  Good pay.  Decent benefits.  Some flexibility.  It's really not a bad place to work if you can deal with politics.", "cons": "Terrible management.  Policies change depending on who you are and who you complain to.  Poor planning and communication.  Constant construction and moving."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "I was promoted to Lead Security shortly after employment, considering my 30 plus years in law Enforcement, 17 yrs in  MH", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Feb 2014", "job_title": "Lead Security Officer in Athens, GA", "duration": "N/A", "pros": "It's a very competitive Organization.", "cons": "Following my termination due to a fatal auto accident, I have since heeled to the point I feel I can work again in Security, yet I haven't  even been considered."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 3, "review_title": "Behind on standards of care", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Feb 2013", "job_title": "Staff RN in Athens, GA", "duration": "N/A", "pros": "Nice people but they were slow in adopting latest standards of care in the area of the hospital where I worked.", "cons": "I was not embraced warmly due to my northern USA heritage"}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Its a good company with good insurance.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Aug 2013", "job_title": "Housekeeper in Athens, GA", "duration": "N/A", "pros": "The best reason is the insurance and health care.", "cons": "The rules are not very good and the pay is not so great."}], [{"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Lead security officer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Jun 2015", "job_title": "Security Officr in Athens, GA", "duration": "N/A", "pros": "I liked the working environment and carrying out the safety and security for the Facility.", "cons": "My experience and previous employment there speaks for it self."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "RN", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Jan 2018", "job_title": "Registered Nurse in Athens, GA", "duration": "N/A", "pros": "Most employees are friendly, cafeteria is good, hourly wage fair", "cons": "Poor communication from immediate leadership, nurse to patient ratio too high/not always safe, mandatory call"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "food preparation,cleaning work areas and dining areas. Responsible for maintaining high standard of cleanliness.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "28 May 2016", "job_title": "Dietary Aide in Athens, GA", "duration": "N/A", "pros": "good pay. High quality and variety of food", "cons": "unfair labor, unflexible schedules, bad supervisors.Short break time, no overtime!"}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 3, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": "N/A", "Senior Management": 0, "review_title": "Employment", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Jan 2014", "job_title": "CMA in Athens, GA", "duration": "N/A", "pros": "Good Benefits,  good work hours", "cons": "Management doesn't stand up for its employees."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 5, "review_title": "Excellent company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "20 Jul 2016", "job_title": "Emergency Department Charge Registered Nurse in Clarkesville, GA", "duration": "N/A", "pros": "ARMC is an excellent company to work for! Great pay, excellent benefits, and a wonderful atmosphere to work in.  I would recommend ARMC to everyone!", "cons": "I have no cons for this company."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 1, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 5, "Compensation and Benefits": 5, "Senior Management": 1, "review_title": "Life in the ER", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Oct 2015", "job_title": "Unit Secretary Bed Control in Athens, GA", "duration": "N/A", "pros": "Great company to work for.", "cons": "There are to many bosses."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 3, "Culture & Values": 0, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "ARMC", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "4 Jun 2016", "job_title": "Administrative in Athens, GA", "duration": "N/A", "pros": "Good facilities and competitive salaries.", "cons": "Poor senior management and low employee morale."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 4, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Medical Laboratory Technician", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 May 2016", "job_title": "MEDICAL Lab Technician in Ringgold, GA", "duration": "N/A", "pros": "I Enjoyed working there with the other techs", "cons": "there wasn't enough employees working per patients"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 0, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 1, "review_title": "Rn", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Oct 2017", "job_title": "RN Staff Nurse in Athens, GA", "duration": "N/A", "pros": "Paycheck, patients, food in cafeteria isn't that bad", "cons": "RNs are overwhelmed, overworked, under appreciated, not valued. Leadership is a joke. Very negative culture starting all the way at the top aka management/leaders."}, {"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "General Surgery Registered Nurse", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "16 May 2016", "job_title": "General Surgery Nurse in Athens, GA", "duration": "N/A", "pros": "Wide variety of job possibilities.", "cons": "Salary could stand to be a little more competitive."}], [{"Recommended": "Yes", "CEO Approval": "Yes", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 4, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Registered Nurse", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Aug 2017", "job_title": "Registered Nurse in Athens, GA", "duration": "N/A", "pros": "Great place to work with financial stability.", "cons": "Lack of continuing education and opportunities for staff development."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": "N/A", "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": "N/A", "review_title": "Patient Access Representative", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 Jul 2015", "job_title": "Patient Access Representative in Athens, GA", "duration": "N/A", "pros": "Co-workers, ability to obtain certifications", "cons": "Out of touch management, preferential treatment, inconsistent policy enforcement, administration thar doesn't practice what they preach"}]]