[[{"date": "11 Mar 2021", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Health Services (MD)", "Interview Descriptions": "There is a 15 min interview with a nurse recruiter. Then an hour long interview with the manager of the unit you applied to. It’s over a WebEx program. The nurse recruiter is very helpful with answering questions and responding promptly to emails.", "Interview Questions": "Tell me about yourself? \r\nHow have you handled conflict? "}, {"date": "12 Feb 2021", "title": "Nursing Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Mercy Health Services (MD)", "Interview Descriptions": "The interview process was efficient and fast. I received a call within a week for an interview and received an offer within a couple of days after that. I was very happy with this entire process", "Interview Questions": "Tell me about yourself\nWhy should we hire you"}, {"date": "21 Jan 2021", "title": "Marketing Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Mercy Health Services (MD)", "Interview Descriptions": "Received a cold call about the position after I applied online. This was followed with an in-person panel interview. I met with a few folks who would be my colleagues. A few days later I received a call with the results of the interview.", "Interview Questions": "Are you a believer in the mission of Mercy?"}, {"date": "10 May 2023", "title": "IT Systems Analyst II Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 6 months. I interviewed at Mercy Health Services (MD) (Baltimore, MD) in Jan 2021", "Interview Descriptions": "Very easy interview, just talked through resume and some scenarios and whether or not I would be comfortable handling them (meeting with higher up execs often, presenting data, translating technical terms). They took forever to get back to me. Almost 6 months from the initial interview.", "Interview Questions": "Do you have any experience speaking with upper management/executives and presenting data to them?"}, {"date": "9 Sept 2020", "title": "Lab Assistant I Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy Health Services (MD)", "Interview Descriptions": "The Interview process was short and quick and the lady I spoke with was very very nice! They seem very understanding. I think as long as you communicate your skills and why you want the job, you should get it!", "Interview Questions": "What is a team-player, and what qualities do you have?"}, {"date": "12 Feb 2023", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mercy Health Services (MD) (New York, NY) in Feb 2019", "Interview Descriptions": "I was contacted by HR. The set up time for an interview was easy. I met with various staff members through the process, eventually meeting with the nurse manager who was also thorough, insightful and spent time answering all my questions.", "Interview Questions": "Scenario questions on how to care for group of patients"}, {"date": "12 Jul 2018", "title": "Executive Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Health Services (MD) (Baltimore, MD) in Jun 2018", "Interview Descriptions": "Contacted by a recruiter,  interview with HR department and SVP .   Interview style depends on person asking questions, some want to walk through your resume, some ask behavior based questions,  most interview questions are conversation based.  Disappointed in end result as one of the core pillars of their culture is hospitality and no follow up from recruiter or HR department.  Was told by multiple people that I would hear from them as to next steps and have not gotten any follow up.  While this is typical/standard business practice in today's culture Mercy prides it's on being different.  Grateful to have discovered their lack of response in the interview process instead of after becoming a potential employee and being disappointed that they are like many medium sized companies where you are a number not an individual.", "Interview Questions": "Very typical questions... mostly based on your experience/resume"}, {"date": "9 May 2018", "title": "Patient Service Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 2 weeks. I interviewed at Mercy Health Services (MD) (Baltimore, MD) in Apr 2018", "Interview Descriptions": "I first went to the open house career fair at mercys. While there I was able to leave my resume for several departments and was asked a few interview questions. In about a week I received phone calls for another interview. I met with the hiring person and she went into detail of what the position entails and the locations. I was also asked general interview questions. I met with her again the next day at the different locations and was introduced to the doctor and managers and was ask several questions from them. I also was given a tour of the department's. Once finished, I was told I would receive a phone call from the HR department. In a few days I received a call and was offered a position", "Interview Questions": "Tell me about a time where you had to handle an upset customer/ patient?"}, {"date": "26 Sept 2019", "title": "Surg Tech Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Mercy Health Services (MD) (Baltimore, MD) in Mar 2018", "Interview Descriptions": "Recruiter and management staff were very informative of what to expect during the interview and on boarding if the job was rewarded to us. Very professional appearance and protocol of what to expect in the future hiring process.", "Interview Questions": "What are your 2 strengths and weaknesses?"}, {"date": "4 Oct 2019", "title": "IT Systems Administrator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy Health Services (MD) in Jan 2017", "Interview Descriptions": "causal, nothing specific, they just needed a person, surprised with the process\r\nMost of the people work here are contractors and people who are here for long do not bother knowing or working with you. They think they own the entire organization and new comers or contractor are all useless regardless how much you know or can help to improve the system. Some people are really unprofessional and  arrogant.", "Interview Questions": "Nothing specific, basic work related questions"}], [{"date": "22 Jun 2017", "title": "Quality Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Mercy Health Services (MD) in Jun 2015", "Interview Descriptions": "Quick - applied online, received an e-mail to schedule an interview.  Once interviewed, I was called back a week later with a job offer.  The interview itself was very conversational - my manager definitely just wanted to see if I could work well with a team.", "Interview Questions": "Interview was very behavioral based."}, {"date": "30 Jul 2015", "title": "Quality Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Mercy Health Services (MD) (Baltimore, MD) in May 2014", "Interview Descriptions": "Met with 6 people in the department- asked very general questions. I feel like you just answered the same questions six times- what experience do you have, why healthcare, what are your strengths and weaknesses, experience with Excel, etc.", "Interview Questions": "What are your strengths?"}, {"date": "5 Dec 2017", "title": "Clinical Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Mercy Health Services (MD) (Baltimore, MD) in Sept 2013", "Interview Descriptions": "I went to HR first to meet with the Nurse Recruiter and then she walked me to meet the Nurse Manager. It took about an hour, they asked very generic questions. Then I shadowed another nurse on the unit for four hours.", "Interview Questions": "Why do you want to work here? "}, {"date": "3 Sept 2013", "title": "Nurse Support Technician Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Mercy Health Services (MD) (Baltimore, MD) in Aug 2013", "Interview Descriptions": "I applied online, they called me back the next week for a interview. I came in and had a interview with human resources then I had another interview with the unit manager all in the same day. After the last interview the manager set me up with another nurse technician to briefly orientate and walk me through the floor. After my walk through the manager told me she was going to make her decision between 3 other candidates and I the next week. They ended up calling me back the very next day and told meI got the job. Next, I had to come in for a physical, name badge photo, and to fill out the tax paper work. After that, I just had to wait for my start date which was approximately a month after my interview. They were very cooperative and organized.", "Interview Questions": "The most difficult question to me would be \"What are your weaknesses and why?\" , because you don't want to tell the manager your weaknesses because whatever they may be might prevent you from getting the job. "}, {"date": "23 Mar 2016", "title": "Quality Analyst Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Mercy Health Services (MD) in Mar 2013", "Interview Descriptions": "I did not speak to one HR employee. I was put in a small meeting room, and 8 different employees, managers, and directors came in one by one to talk to me. By about the 6th person, I felt like I was being asked the same questions to see if my answers changed. One senior analyst saw my nervousness and talked to me about my volunteer experience instead. Another talked to me about his puppy.\n\nAfter these 8 people, I was brought across the hospital to the Department of Medicine to meet the Medical Director (who is also the Quality and Patient Safety director, and several other titles). She was very nice and only asked a few questions.\n\nThen they took me back to the first building to meet another Director, who negotiated salary (see below). Total, it was about 3-4 hours. Very grueling, but very few hard questions.\n\nThen they stopped contacting me for about a month. Suddenly, they called me back again!", "Interview Questions": "Summarize your past work experience"}, {"date": "20 Apr 2013", "title": "Nurse Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Mercy Health Services (MD) in Feb 2013", "Interview Descriptions": "Interviewed directly by the department and was given a timeline for a decision.  When that timeline passed I followed-up and was told I would hear back from them by the end of the week.  Two more weeks went by and nothing.....later found out it was filled internally.  Very unprofessional to drag someone along in that manner.", "Interview Questions": "All very appropriate"}, {"date": "27 Mar 2014", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Mercy Health Services (MD) in Jul 2010", "Interview Descriptions": "Very simple, started off as an extern, met with the manager who thought I would be a good fit, asked me a few questions, set me up for an interview and hired me on the spot. They contacted me via phone and email with orientation details and it went on from there. Very professional organization", "Interview Questions": "Nothing difficult except for what are my own weaknesses that I may face working in a highly stressed environment?"}]]