[[{"date": "29 Mar 2023", "title": "Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Reed College", "Interview Descriptions": "Phone screening, zoom interview, in-person interview. The communication and planning was absolutely terrible. They forgot to tell me what day the scheduled my interviews for, the person coordinating then went on vacation and I had to email everyone I could find. The Dean who I was meeting with was unorganized, overall a bad experience.", "Interview Questions": "Why Reed, how do you deal with difficult Faculty"}, {"date": "29 Sept 2022", "title": "Marketing & Communications Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Reed College in Jul 2022", "Interview Descriptions": "Offered a phone interview shortly after submitting my application. Spoke with the hiring manager, who was kind and professional.  She stated on the phone and in a follow-up email that they would be in touch the following week about next steps. I never heard from them again.", "Interview Questions": "Example of time you advocated for diversity/equity?\nWays of managing multiple responsibilites?\nWilling to work in person? "}, {"date": "3 May 2022", "title": "Housing Advisor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Reed College", "Interview Descriptions": "Standard interview and group interview. First round, you meet and AC and and HA, talk about yourself, if you get to the second round, you show the qualities you showcase in a group setting (leader, follower, quiet, compromising etc. all strengths are valued).", "Interview Questions": "1. What is a personal object that is important to you and why?\n2. Rank a list of ten given things from least ethical to most and then decide as a group how to rank as a collective and why."}, {"date": "9 Mar 2022", "title": "Director of SEEDS Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Reed College", "Interview Descriptions": "Phone interview, one in-person interview. Friendly. Questions were provided ahead of time, which was great. Position oversaw student staff. Interview was on-site and comfortable. Casual. Three interviewers on a panel, one person from HR.", "Interview Questions": "Describe your approach to DEI."}, {"date": "5 Nov 2021", "title": "Bookstore Assistant, General Merchandise Buyer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Reed College in Oct 2021", "Interview Descriptions": "First interview was a 30 minute phone call with Bookstore manager. Went over position and responsibilities.\n\nSecond interview was an hour long zoom call with Bookstore manager and another buyer. Both took turn asking questions.", "Interview Questions": "Explain a instance where you had to delegate a task."}, {"date": "11 Oct 2021", "title": "Human Resources Partner Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Reed College in Sept 2021", "Interview Descriptions": "The interview process was well organized start to finish, and I felt respected throughout. I had a chance to meet and speak with staff from a variety of departments, which gave me a good idea of the work culture at Reed. The hiring manager and recruiter kept me informed of timeline and next steps, which I appreciated so I could plan ahead. This was an excellent candidate experience!", "Interview Questions": "Tell us about a mistake you made."}, {"date": "30 Aug 2021", "title": "Admission Counselor/Assistant Dean Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Reed College (Portland, OR) in Jun 2021", "Interview Descriptions": "Most degrading interview process I've ever experienced. I formally applied for this job in early May after being in conversation about applying in March. I was told I was being interviewed, but every week a new email came saying \"sorry! it's going to happen next week!\". \r\n\r\nI was finally interviewed around June 15th, and the interview process itself was fine, until meeting with HR. I was under the impression that three candidates were interviewing for three positions, and I found out via HR (and not from the people interviewing me) that there were actually two positions available. HR also asked me “if I could press you for a concern about this position, what would it be?” and after answering I was completely shot down and not even listened to.\r\n\r\nAfter interviewing, I was told \"oh, you'll hear next week!\" to \"oh, you'll hear in two weeks\" until finally \"you will hear via phone this weekend\". Understandably, I was stressed out that entire weekend expecting a phone call, until the weekend had passed and I still didn't hear. On that Monday I emailed asking for a update, only to receive no response. That Tuesday, I finally found out via phone at the end of the work day I was not being offered the job. The people interviewing me made it seem pretty clear that I was likely to receive this job offer, until I was kept waiting on the hook from March until July only to not get an offer. In this job market, this really took a toll on myself mentally and I would highly recommend staying away.", "Interview Questions": "What is a problem you've had in the workplace and how did you solve it?"}, {"date": "24 Jan 2023", "title": "InterConnect Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Reed College in May 2021", "Interview Descriptions": "One zoom interview with two members of the ISS team going over different qualifications and experience living/studying abroad as well as with diverse communities. Fairly straightforward and didn't take more than 30 minutes to complete.", "Interview Questions": "Conflict Resolution Experience Living/Studying Abroad Qualifications for the role"}, {"date": "16 Feb 2021", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Reed College (Portland, OR)", "Interview Descriptions": "This was probably one of the worst interview experiences I had.  Also, this was all in the \"COVID-19\" era too - so keep that in mind. \r\n\r\nI applied and they were fairly quick to get back with me via email where they scheduled a 30 minute phone screen. That was a pretty typical and easy. \r\n\r\nI then moved on to the next round, which was 1 hour zoom interview. That also was fairly typical and easy, mostly behavioral questions but also some questions about diversity and working styles. A lot of the questions were thought provoking, which I appreciated.\r\n\r\nI then moved on to the next round, which was a 4 hour zoom interview process (Again, COVD times).  \r\n\r\nIn between that, they offered to do an in person tour of the campus and the department I'd be working in. I was a little hesitant, because of COVID, but I really wanted the job, so I risked it and did the in person tour. That was about 2 hours.\r\n\r\nThen came the 4 hour zoom call/interview. That went okay. It was about four 45 minute interviews with different people and one 30 minute interview. You meet with people you'd be working alongside as well as an HR person who went over all their benefits, which can be found on their website. Most of the people didn't seem prepared to interview me, so I had to ask A LOT of questions most of the time, which is fine, if not repetitive. \r\n\r\nTotal time spent with Reed college about about 7-1/2 hours. I did not get the job and they let me know via email which was a HUGE disappointment. A call would have been nice and way more professional considering all the time I took to interview with them. I asked for feedback and they told me they had zero feedback for me but I should be happy I made it to the final round (not sure what I'll do with that accomplishment?). \r\n\r\nReed claims they do this long winded interview process out of \"tradition\". For one, as a candidate, there is nothing more stressful as someone who is currently employed than trying to come up with excuses as to why you'll be out of the office so much (7-1/2 hours, basically a full work day). Secondly, it was really strange to me that they had me meet with the HR person. Again, all their benefit information is online. I'd think anyone applying/interviewing with a company would do research beforehand. This seemed like a giant waste of time for not only the candidate, but also the HR department. \r\n\r\nIn short, Reed has a lovely campus with some lovely people. The interview process is not so lovely and the rejection is all but unprofessional. A huge build up to end in  an annoying letdown.", "Interview Questions": "In what ways do you incorporate diversity in your life?"}, {"date": "31 Jan 2021", "title": "Landscaper Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Reed College", "Interview Descriptions": "Very thorough be prepared! You take a tour and meet with higher ups, excessive but nice to see what you’re getting into at least! Would recommend to interview, good practice if nothing else", "Interview Questions": "They will drill you with questions"}], [{"date": "6 Mar 2021", "title": "Area Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Reed College (Portland, OR) in Nov 2020", "Interview Descriptions": "3 rounds with presentation and a separate call to talk to current staff member about the role. The process was all online and it was fine expect for a few issues. The student panel was mostly white, cis people who upheld a layer of “being proper” and not sharing direct information eluding to implicit communication centered around excluding talk that comes for communities of color; i.e. the students expressed themselves in the whitest of mannerism which was pretty disappointing for a school that is suppose to be unique and forward thinking. The whole day had 30 minutes breaks which meant I went form 9am to 7pm and was exhausted. Recommend they review this method as it was exhausting and I burned out near the end. I was asked about my religious affiliation even with the caveat that I ‘didn’t have to answer’ as a potential employee in student affairs there is no ‘you don’t have to’. When I connected with them after about hearing back I was told I would stay connected when another position opened up. I haven’t heard anything and they posted the position a month ago so don’t waste your time believing them.", "Interview Questions": "Not available to provide thanks"}, {"date": "11 Oct 2020", "title": "Program Coordinator Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Reed College in Oct 2020", "Interview Descriptions": "I received a phone interview and one virtual face-to-face interview, both of which were in a question and answer format. In the second interview, a panel of three people took turns asking situation-based questions for about 30 minutes and at the end I was able to ask additional questions about the position.\r\n\r\nBoth rounds were ultimately fairly similar and neither really provided me a chance to highlight aspects of my application that differentiated me from other candidates since they primarily used situational questions that asked me hypotheticals or examples for how I've handled things in the past.\r\n\r\nAdditionally, Reed did not provide any interview questions in advance, which seems like an equity policy this institution should have already implemented. Additionally, while Reed has decided prohibit salary negotiation because women and POCs are typically uncomfortable engaging in that process, they did not provide any information on how they then pay their employees more equitably to balance out this policy.", "Interview Questions": "Provide an example of a program that focused on a marginalized identity"}, {"date": "24 Oct 2019", "title": "International Student Mentor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Reed College", "Interview Descriptions": "Was asked questions, two people listened and took notes. They were very nice. There were about 10 questions, some described what ive done in the past to help people, some described what id do in a hypothetical situation, and some were the generic interview questions.", "Interview Questions": "If a student is stressed out about their living situation, how would you help them?"}, {"date": "31 Oct 2018", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "The process took 2 months. I interviewed at Reed College", "Interview Descriptions": "I want to start off by saying I have been through many interview processes in the field of higher education, and this was honestly one of the worst experiences I've ever had.  I am somewhat relieved I didn't get an offer because the process really put a bad taste in my mouth.\r\n\r\nI submitted my cover letter, resume, and online application, and was emailed a day later to schedule a short phone interview with the search committee chair. The interview was a basic screening of my experience and interest in the role, which was quick and easy.\r\n\r\nTwo weeks later, I was invited to an on-campus interview. This was a typical 45-minute panel style interview with a few current employees - great, no problem. A week went by and I was emailed again and asked to schedule a 30-minute phone interview with another person who couldn't be present during my previous on-campus interview. Fine.\r\n\r\nAnother week later, I was invited for another on-campus interview, which was scheduled 3 weeks out. This was a half-day interview, which is pretty typical in the higher ed field. Usually, you are invited to campus to meet with some of the people you'd be working with while in the role. In my previous experience with these, I have been invited for lunch, coffee, or at the very least a campus tour. These interviews are generally two-way, in that you are also interviewing the staff and the campus to see if it is a good fit for you. This was not the case at Reed. \r\n\r\nMost of my 5 hour half-day interview consisted of sitting in a basement conference room fielding the same behavioral questions over and over again by different campus members and stakeholders. I met with 7 different groups of people, there were no scheduled breaks, no time to grab a snack or glass of water. 5 hours without a scheduled break is cruel. A few of my interviewers mentioned they were filling in for someone else and hadn’t seen my resume/didn’t know anything about me. 5 hours later, I was shaking from hunger and mentally exhausted. I was not shown the office where I might be working, or anywhere else on campus. I was told a decision would be made in about a week. There was no real closure to my interview, and I was not walked out. \r\n\r\nTwo weeks of silence went by and I emailed the search committee chair to check in and see if they made a decision or have an update on their timeline. No response. Another week went by, and I finally received a generic email letting me know that they had chosen another candidate. I replied promptly with gratitude, and to see if they had any feedback about my interview and what qualifications I might have been lacking. No response. \r\n\r\nI was very put off by this entire process and the way I was treated both during and after my interviews. Our higher education community is very small, and I'm sure our paths will probably cross again, so I am very perturbed by this behavior.  Do better, Reed.", "Interview Questions": "What would you do if a faculty member didn't follow your requests?"}, {"date": "22 Sept 2020", "title": "Registered Nurse Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Reed College (Portland, OR) in Aug 2018", "Interview Descriptions": "I applied through indeed.com and you must submit a resume, cover letter, and you have to submit an essay related to diversity, equity, and inclusion.  After this if your application is selected you go through a phone screen in which they ask basic questions about why you applying to reed, strengths and weakness, your skill set and how it would be useful in a college setting.  Then once you get through the phone screen if you are selected for a final interview it will be in person or during covid it will be a video zoom interview. This interview will be done with a panel of staff members from the medical and counseling team and they each take turns asking questions. The questions are more in depth and ask about how you handle conflict, your behavior as a team player, your views on health equity and inclusion, and some scenario questions.", "Interview Questions": "Sometimes it is necessary to work in unsettled, rapidly changing circumstances. When have you found yourself in this position and please tell us what you did?"}, {"date": "17 Jan 2018", "title": "Project Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Reed College (Portland, OR) in Mar 2017", "Interview Descriptions": "One phone interview, two in person interviews. 2nd interview was with two people and lasted about an hour. Last interview was a half day and included meeting with HR and various teams.", "Interview Questions": "Why do you want to work at Reed College"}, {"date": "26 Oct 2016", "title": "Associate to the Vice President Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Reed College (Portland, OR) in Sept 2016", "Interview Descriptions": "I applied for the position in early August, had a 2 hour phone interview with the hiring manager, then met with the hiring committee the first week of September 2016. I have not been able to get a hold of anyone about the status of the position, despite numerous emails and calls to the hiring manager and also to someone in HR. I finally received a voicemail (with no details about the job or hiring status, just a request to call back) two weeks ago, returned the call, and have not heard anything since. It's now been eight weeks since my in-person interview.\r\n\r\nAnyone who goes through such a lengthy hiring process - resume & application plus short essay, phone interview with the hiring manager, and an in-person interview with a five person hiring committee - deserves to be updated in a timely manner about the status of his/her candidacy. Of course, I assumed after a couple of weeks of no responses that I was probably out of the running, but would have appreciated a response from Reed. I let HR know that I was having trouble finding out my status, figuring HR would be able to help me, but again, no response.", "Interview Questions": "The panel asked very good questions, geared toward problem solving rather than just asking about skills and past positions. These kinds of questions are great at examining one's problem-solving and communication skills, and helps hiring managers gauge how a candidate may fit in with the department or organization."}, {"date": "26 May 2017", "title": "Assistant Dean Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Reed College (Portland, OR) in Aug 2016", "Interview Descriptions": "Two phone calls and an 8-hour interview with various departments. I had a lunch interview with the team, a walk with the Dean, presented a 15 minute presentation, met with HR, and met with Data Processing.", "Interview Questions": "Very typical, unimaginative interview questions. "}, {"date": "30 Jun 2017", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Reed College (Portland, OR) in Nov 2014", "Interview Descriptions": "A job was posted internally on IRIS, but I was referred to it by my professor. I communicated with the person I would be working for over email, then in person. After 14 days, my application was accepted.", "Interview Questions": "What are your programming skills? What are your prior research experiences? What is your schedule like?"}, {"date": "14 Jun 2014", "title": "Grader Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Reed College", "Interview Descriptions": "There was no interview or application process really. Students submitted a form which said where they said which positions they are eligible for and which they are interested in. Students were chosen based on academic background and prior employment in the department.", "Interview Questions": "No questions were asked."}], [{"date": "16 Feb 2014", "title": "Community Safety Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Reed College (Portland, OR)", "Interview Descriptions": "I applied on the Reed College website. I was first interviewed by the Community Safety Department management, then a manager from Residence Life and a student. The interviews were good.", "Interview Questions": "N/A"}, {"date": "22 Jun 2012", "title": "Research Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "The process took 1 day. I interviewed at Reed College (Portland, OR) in Feb 2012", "Interview Descriptions": "I was basically just offered the job, take it or leave it. But this was a professor that I knew well, so as long as you do well in classes you have high chances of being hired for the econ faculty.", "Interview Questions": "Do you want to work as an RA?"}]]