[[{"date": "4 May 2023", "title": "Student Worker Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Year Up (Dallas, TX)", "Interview Descriptions": "It was easy going. Did two interviews. The program manager communicated well. The first interview was just getting to know me and the second one was about submitting the necessary documents and going over them. It was overall an average", "Interview Questions": "Why are you interested in the program"}, {"date": "21 May 2023", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Year Up (Chicago, IL) in May 2023", "Interview Descriptions": "The interview is relaxed and takes an hour via Zoom. The company wants to know more about the future interns(schooling, work experience, etc.)I got feedback in one week. Also they asked about ability to pass drug test", "Interview Questions": "Your goals and intentions Schooling, work experience"}, {"date": "24 Apr 2023", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up (Boston, MA)", "Interview Descriptions": "I did several interviews with Year Up after originally applying for a different role and being asked by the HR if I would consider a different position. All interviews were done virtually over Zoom or phone. My first interview was by phone with HR and other interviews were with the hiring manager and staff members.", "Interview Questions": "How do you set boundaries?"}, {"date": "14 Apr 2023", "title": "Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up (New York, NY)", "Interview Descriptions": "You will never interview with less than 4 company members from various departments. This can often lengthen the amount of time it takes for the company to make a final decision.", "Interview Questions": "What is your experience coaching or mentoring a young adult?"}, {"date": "10 Jun 2023", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through a recruiter. I interviewed at Year Up (Atlanta, GA) in Apr 2023", "Interview Descriptions": "Step1: Phone Interview Step 2: Hiring Manager Step 3: Panel Interview The process generally takes two weeks for each interview and you have to wait on the recruiter to get back to you. Feedback is given if you are not selected.", "Interview Questions": "What are your strengths? What is your greatest accomplishment? What are you most excited about?"}, {"date": "14 Mar 2023", "title": "Senior Software Engineer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Year Up", "Interview Descriptions": "Extremely easy but all whilst being thorough lasted around forty five minutes. chance for questions at the end. panel of 6 people. only 1 really spoke. other 5 just took notes.", "Interview Questions": "Above and beyond example please"}, {"date": "15 Feb 2023", "title": "Account Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up", "Interview Descriptions": "Thorough and ver comprehensive with extensive questioning and deep dive into personal goals only typing this and doing this so I can reach the 30 word minimum how many more god damn words is it going to take", "Interview Questions": "Usual questions you might expect"}, {"date": "12 Dec 2022", "title": "Software Developer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Year Up", "Interview Descriptions": "It was a friendly interview. They want to get to know you, and your work ethics. Remember you are interviewing them as well. So ask questions, like any other interview.", "Interview Questions": "Why do you want to join?"}, {"date": "21 Sept 2022", "title": "Training Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Year Up", "Interview Descriptions": "Easy, basic questions. Just a little get to know you better type of questions. They interviewer was very nice and helpful. Just do a little research before you come to the interview.", "Interview Questions": "Tell me about yourself.\nWhy did you choose year up"}, {"date": "20 Feb 2023", "title": "Internship Services Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up in Sept 2022", "Interview Descriptions": "Two rounds of interviews. One with the internal recruiter and then a panel with the Director and Associate Director. First round was about 15 mins and second round was around 45.", "Interview Questions": "They asked how I am actively working to dismantle white supremacy."}], [{"date": "18 Jan 2023", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Year Up (New York, NY) in Sept 2022", "Interview Descriptions": "Applied online and had a call with the recruiter a week later. She then set up a call with the hiring manager a week later. He asked me questions and barely let me speak. He spoke for about 45 min about himself, his achievements, his department and barely about the role.", "Interview Questions": "Tell me about yourself and your resume"}, {"date": "9 Aug 2022", "title": "Sales Data Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 1+ week. I interviewed at Year Up (Tampa, FL) in Aug 2022", "Interview Descriptions": "asked some tough questions, how do you educate yourself on different cultures? and what do you do to be a good storyteller of data? these questions are hard to prepare for", "Interview Questions": "how do you educate yourself on different cultures? and what do you do to be a good storyteller of data?"}, {"date": "14 Jan 2022", "title": "Software Engineer(Internship) Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Year Up", "Interview Descriptions": "The HR is very nice, understandable and patient. They really want to know about you and your background. The HR asked a lot of questions to make sure you are the best fit for their programs. Strongly recommended.", "Interview Questions": "Why would I choose Year Up. What do you know about the program"}, {"date": "24 Dec 2021", "title": "Software Engineer(Internship) Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Year Up", "Interview Descriptions": "They said it will be nine am to five pm every day Monday to Friday. It is a good and average question all employees ask in an interview. I did pretty good", "Interview Questions": "What you expected from the Year Up"}, {"date": "27 Jun 2022", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up (Jacksonville, FL) in Dec 2021", "Interview Descriptions": "Amazing  the whole process was smooth and the interview is more about you as a person than your resume . Also , they asked behavioral questions and help you to express yourself and gain confidence during the process", "Interview Questions": "Tell me about yourself ?"}, {"date": "28 Sept 2021", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Year Up (New York, NY)", "Interview Descriptions": "The process is thorough, easy, but very annoying. Ex, several rounds plus excel test. They will call your reference before advancing you to last interview.  If you want to provide references, be careful.", "Interview Questions": "general question like, tell me about yourself"}, {"date": "9 Sept 2021", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Year Up", "Interview Descriptions": "The screening interview was easy but the hiring manager interview was much more challenging. They had great questions. They were also very communicative in the process and you hear back quickly even if not selected.", "Interview Questions": "What’s a way you’ve upheld white supremacy in the past, how did you come to realize that and what did you do to address it?"}, {"date": "8 Aug 2021", "title": "ISM Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Year Up", "Interview Descriptions": "Fair and multiple interviews that included a \nScreening interview, meeting with a director, and a panel interview with the ISM team.\n\nThe interviews did show that therr existed a genuine interest on behalf of the organization.", "Interview Questions": "General background as well as situational questions.\n"}, {"date": "5 Aug 2021", "title": "Administration Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Year Up", "Interview Descriptions": "Interview was easy going, professional, and personal. Be prepared to talk about your past as well as your future. I was interviewed by an retired FBI agent which was intimidating", "Interview Questions": "Where do you see yourself in five years "}, {"date": "22 Jun 2022", "title": "Business Communications Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Year Up (Boston, MA) in Aug 2021", "Interview Descriptions": "I was reached out to by a Year Up recruiter on LinkedIn.  We quickly set up a call for a basic screening interview to determine if I'd be a good fit for the roll.  About a week later I had two 1:1 interviews with current program instructors.  About a week later I was set up for a mock lesson with current students and current staff over zoom, and was sent a list of lesson topics to choose from.  Afterwards I met with the director of the program for a final interview.  Everyone was very kind, but definitely a lengthy and involved process.", "Interview Questions": "Why and how do you value diversity? "}], [{"date": "7 Jul 2021", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Year Up in Jun 2021", "Interview Descriptions": "Interview process was thorough and involved a skills assessment, along with multiple rounds of video calls over the course of 6 weeks. Their interview team was intentional with prompts, and provided ample time for candidate questions. The team showed great care in the interview process. Excellent candidate experience overall.", "Interview Questions": "Why Year Up? Give an example of a project you led start to finish. "}, {"date": "21 May 2021", "title": "Academic Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Year Up", "Interview Descriptions": "This was a pretty average process.  Everyone involved was communicative through email and through zoom.  The interviewer was friendly but talked more than they asked questions - but communicated the position well.", "Interview Questions": "What is your management style?"}, {"date": "20 May 2021", "title": "Admissions Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Year Up", "Interview Descriptions": "Thorough and well thought out. Interviewers gain a greater scope of the interviewee during the interview process. There were multiple interviews on different days, and I gained an understanding of the company culture, and got to interact with current students/alumni.", "Interview Questions": "How would you describe the opportunity divide?"}, {"date": "15 May 2021", "title": "Investment Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. I interviewed at Year Up (New York, NY)", "Interview Descriptions": "Went pretty well. It was quite easy but I’m not sure compared to others. I got accepted with the position and I hope it works out for me. I also hope it’s not a scam.", "Interview Questions": "Tell me about yourself and why year up?"}, {"date": "22 Apr 2021", "title": "Director Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I interviewed at Year Up", "Interview Descriptions": "Had a phone interview. The questions were straight forward, was easy to get through. Wasn't the warmest phone call, but fine. Didn't ask any follow up questions. Was a bit slow to respond via email afterwards.", "Interview Questions": "Experience, scenarios, management style, etc"}, {"date": "22 Mar 2021", "title": "HR Analyst Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up (New York, NY)", "Interview Descriptions": "Interviewed with 5 people.  In addition to technical questions about HR, systems and processes the interview explored my commitment to giving back to the community.  After this process which lasted almost 2 months, I was told that they decided that they wanted to promote from within.   I think if that was their philosophy, they should have concluded our discussion much sooner.", "Interview Questions": "How  committed are  you in helping young disadvantaged youth?   Are you interested in mentoring?"}, {"date": "20 Mar 2021", "title": "Student Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up", "Interview Descriptions": "My interview process was great, although they do ask really personal questions. Be prepared and confident in your answers! Right now they are doing 30 minutes interview slots due to a influx of applications.", "Interview Questions": "What are some hardships you're facing?"}, {"date": "11 Feb 2021", "title": "Beginner Student Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Year Up (Chicago, IL) in Feb 2021", "Interview Descriptions": "The interview process is very simple from the start to the finish. They guide you and ease you into YearUp and what you have to look forward to. I just started my process and I'm very excited to even have this opportunity! Thank you so much YearUp", "Interview Questions": "What is your greatest strength and weakness?"}, {"date": "15 Jul 2022", "title": "IT Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through college or university. I interviewed at Year Up in Jan 2021", "Interview Descriptions": "very easy, interviewer was kind. They don't seem to judge your background but goes into personal information.  This may seem bad at first but going into the experience everyone was nice.", "Interview Questions": "*why do you want to join yearup? "}, {"date": "16 Dec 2020", "title": "Development Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Year Up", "Interview Descriptions": "The interview process had 4 interview steps. The first interview phone was with HR, the second was with another phone call with a direct team member, then the third interview was in person with direct team members/supervisors. At the time, the Director of Development was on maternity leave, so during the in-person interview, I video chatted with her for a portion of the time. The third interview was about 2 hours. The last interview was in person again with the Director of Development but at this time I was offered another position so I declined a final interview. I also had to take a Behavioral Assessment.", "Interview Questions": "Explain a time where you were challenged at work and how you navigated that?"}], [{"date": "30 Oct 2020", "title": "Human Resources Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Year Up in Oct 2020", "Interview Descriptions": "Incredibly unprofessional.  First, she complained that it was too early  or her to be on the phone (it was 10 AM), then a few complaints about how she had to type all of her answers.  It was clear she was reading from a prepared list of questions and not actually listening to my answers, so there was no \"conversation\" to the interview.  Most questions had nothing to do with the role.  I was advised that a PI survey was required for the process before any decisions are made, and yet I never received one (even after I emailed her again about it).  I did get a rejection letter, though.  So, if I didn't take the survey, how can you reject me?", "Interview Questions": "1.  How do you organize yourself?  (I mean, come on, I'm a senior leader!)"}, {"date": "13 Jan 2021", "title": "Director of Philanthropy Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up (Boston, MA) in Oct 2020", "Interview Descriptions": "The Year Up interview process appears to be unusually long, and can take 6-8 weeks from their receipt of your resume to potential offer.  Depending on the level of responsibility of your position, this may be driven by their culture.  Initial interview is typically with a recruiter.  Subsequent interviews would be with the person you will report to, and often several members of different teams. You may also have an opportunity to have courtesy \"interviews\" with colleauges with your same title, and/or those who will report to you.  While comprehensive, it can be diffiult to manage this process if you have other offers on the table. I can appreciate the thoroughness but would have preferred process that moved forward quicker.", "Interview Questions": "Be prepared to discuss your passion for mission."}, {"date": "30 Jul 2020", "title": "Director of Program Development Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up", "Interview Descriptions": "Interview process included screening and in-depth meetings. Screening process was excellent--best screening interview I had for many positions. Screening interviewer listened and asked intelligent questions and provided good clarity on position, company and salary range.", "Interview Questions": "Interviewer and I discussed salary range and preference."}, {"date": "13 Jan 2021", "title": "Information Technology Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Year Up in Jun 2020", "Interview Descriptions": "Asked about your background and wanted to know that you're invested. However the interviewer seemed to have his decision set before the interview. The most important things to answer is why you want to be in IT and what makes you think it's a good fit for you. I answered the question well but like I said the interview seemed to have the applicants in mind already.", "Interview Questions": "Why do you think IT is the right fit for you?\n\nTell me about a time where you encountered a problem.\n\nWhy Year Up vs the other programs?"}, {"date": "5 Feb 2020", "title": "Analytics Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Year Up", "Interview Descriptions": "Interview process will scrutinize very closely to find your finance knowledge . Salary offered was very low.  The interviewer gave me a sense of non inclusion and came across judgmental. Year Up mission is all about opportunity divide but it seems that only applies for helping young adults.", "Interview Questions": "How to read financial statements? What is Cash Flow statement? What are the possible expenses incurred in Non Profit environment?"}, {"date": "7 Dec 2019", "title": "Finance Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Year Up", "Interview Descriptions": "Online skills inventory survey, phone interview with recruiter, Skype and in person interview with my manager, brief skills test, Skype interviews with more senior team members. The interview process was very good. The recruiter was extremely helpful, friendly, informed, and upfront. She worked with me through the whole process. I spoke with several people in my direct line of supervision, and the interviews were relatively laid back and more conversational in tone. Lots of tell me about a time when type of questions. It was a lot of interviews for my level, but they were also extremely accommodating of some unusual circumstances I had during the process.", "Interview Questions": "How do you handle Diversity, Equity, and Inclusion in the workplace?"}, {"date": "19 May 2022", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Year Up (Chicago, IL) in Oct 2019", "Interview Descriptions": "Felt as if they already knew the candidate they wanted but continued to interview candidates as a formality.   Continued with 2-3 rounds of interviews that included interacting with students and was never offered the position.", "Interview Questions": "Do you understand the Learning Community?"}], [{"date": "18 Jul 2019", "title": "Business Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Year Up (Dallas, TX) in Jul 2019", "Interview Descriptions": "Information Session to get to know about Year Life. The Interview they will ask why and who told you to join Year Up. They will ask your financial situational and if you will do your best because it is thought program that you need to be prepared to work for an entire year. The Mandatory meetings and Orientation you need to be prepared and study about the program and continue to take notes and write a small essay over the program.", "Interview Questions": "Who can you go to for support emotionally and financially?"}, {"date": "11 Dec 2019", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Year Up (Menlo Park, CA) in Jul 2019", "Interview Descriptions": "The recruiter contacted me the day after I submitted my application. We scheduled a phone interview for the following week. I also filled out an Behavioral Assessment. I appreciate how transparent and quick the process was.", "Interview Questions": "How do you keep students engaged while facilitating a group or teaching a lesson?"}, {"date": "25 Jun 2019", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Year Up", "Interview Descriptions": "First was a 30 minute phone interview, mostly situational questions and talking about the role. Then I waited about 3+ weeks for a second round skype interview. Interview lasted an hour, all of the questions were situational \"if this happened, what would you do\".", "Interview Questions": "How would you handle a year up young adult coming to a meeting not in dress code - wearing white socks instead of black socks?"}, {"date": "1 Sept 2021", "title": "Student Services Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up (Charlotte, NC) in Jun 2019", "Interview Descriptions": "I had a phone interview for a management position and the interview seemed to go well. We spoke for about 30 minutes. It wasn't a bad experience. The interviewer said I would hear back about next steps and the next round of interviews, but instead I got an email letting me know they had chosen to go with someone else. I talked to a colleague who works for the program, just for feedback about why they chose not to move forward with me and was told they were looking for someone with many years of upper management experience- which I didn't have. That was fine, but it was little frustrating to know they'd knowingly wasted my time. My resume was pretty clear so I wasn't sure why they interviewed me in the first place if I didn't meet their (unwritten) requirements.", "Interview Questions": "Tell me about your experience with student support."}, {"date": "26 Apr 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Year Up", "Interview Descriptions": "Very straightforward easy going. Just be yourself and let them know more about you. Don't stress it out too much. The interviewer was great and very helpful too. They ask personal questions and also questions retaining to your experiences and past.", "Interview Questions": "Anything they ask of you. Pretty simple questions. "}, {"date": "25 Jul 2019", "title": "Internship Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Year Up (New York, NY) in Apr 2019", "Interview Descriptions": "The process was just too long and lack of communication. Having to have such a long interview process to just end without an offer.  several rounds of interviews felt  accessive", "Interview Questions": "What skills do you have to fit into this role"}, {"date": "8 Mar 2019", "title": "Associate Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Year Up", "Interview Descriptions": "The initial interview was by phone and it was a very informative and straightforward process.  The Talent Acquisition Specialist was knowledgeable and transparent regarding the needs of the site.", "Interview Questions": "What metrics have you used?"}, {"date": "31 Dec 2019", "title": "Senior Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up in Mar 2019", "Interview Descriptions": "1 phone interview; followed by 2 video interviews.  During the second video interview, the manager asked qeustions about room placement; interrupted during answer session and redirected questions to non skill-related approach.  Clearly not a good match.", "Interview Questions": "What do you do to unwind?"}, {"date": "19 Feb 2019", "title": "Fundraiser Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Year Up (Washington, DC)", "Interview Descriptions": "Phone interview followed by group meeting. People were very nice. Call was good, 1:1 interview was OK - could have gone better but I had gotten terrible sleep the night before so didn't do very well. I also lacked the government grants experience they were looking for.", "Interview Questions": "What support do you need for the role?"}], [{"date": "15 Feb 2019", "title": "Marketing Fellow Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Year Up", "Interview Descriptions": "Was contacted just days after applying for the position to be screened by phone. We scheduled a date and time. Interviewer cancelled the day of due to being sick and suggested a couple of days later in the week to reschedule. After confirming that the first date worked for me, the day came and went with no response. Followed up asking if the interviewer would like to set another date, and wished them a speedy recovery. Over a week later still haven't received a response since my initial interview was cancelled. Disappointing and unprofessional.", "Interview Questions": "N/A"}, {"date": "16 Jan 2019", "title": "Business Operations Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied online. I interviewed at Year Up (Jacksonville, IL)", "Interview Descriptions": "On my first in person interview.  Previously I had a 30 minute phone interview.  The 2nd interview was an overview of the company and several behavioral questions.  The questions were standard.", "Interview Questions": "Behavior questions"}, {"date": "28 Jun 2019", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Year Up in Jan 2019", "Interview Descriptions": "Recruiter scheduled video interview,  later received call from site manager to schedule phone interview instead. After phone interview, scheduled in person interview.  Staff was nice, a little unorganized.", "Interview Questions": "Why interested in job, situational questions, very casual I thought. I had gotten some pretty bad news right before going in, and probably wasnt my best. So I'm not surprised I didn't get an offer.  However I was really disappointed in the lack of communication from the company.  I never got a \"weve chosen someone else email\" the communication ended at the interview.  UNTIL about a month after the interview a recruiter called me and asked me if I wanted to interview for the the same position. I told her I had already interviewed in person . She had no idea.  Our call ended with her saying she would email me back and let me know if they wanted me to come back in. Of course I never heard back. "}, {"date": "18 Jul 2020", "title": "Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Year Up (Boston, MA) in Jan 2019", "Interview Descriptions": "Applied for one job, was recruited into a different job. Took a behavioral assessment. Had a phone screen and the recruiter was cold - I thought I didn't get it. Moved to the next round with the C-level exec, and then an interview with a team director. The people I spoke with in the 1:1 interviews were friendly and knowledgeable.\r\n\r\nThen I was invited to come onsite for another team interview. I asked the recruiter about timing expectations and logistics so I could plan for the interview around my current job responsibilities. (A video interview would be preferable, but I would be happy to come in person.) The recruiter said she would get back to me about scheduling. One week later the recruiter emails me saying that they are moving forward with other candidates. But I thought we were going to the next round? I asked for feedback and she said she \"thought I wasn't interested\" because I was concerned about scheduling. \r\n\r\nI have had many successful interviews and never have had a \"misunderstanding\" with a recruiter - they are always personable and effective communicators. Lesson learned - show you are willing to drop everything to meet with YU. Also the recruiter may communicate poorly & basically create a misunderstanding once they decide you're not the top candidate.", "Interview Questions": "Have you run an integrated campaign?"}, {"date": "15 Dec 2018", "title": "IT Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up", "Interview Descriptions": "It was an hour and thirty minutes process they asked about life, transportation, why I want to be in IT prior to their program you can't take no more then 2 of there classes", "Interview Questions": "how would my family like the program?"}, {"date": "5 Nov 2018", "title": "Marketing Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "N/A", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Year Up (Boston, MA)", "Interview Descriptions": "The process was a phone screen with HR, then the hiring manager, then a half day of 1:1 interviews. I had great conversations with everyone on the team. They seem very invested in what they do. I made it to the final round, did a project, and met with several team members. I wasn't offered the role, but what was most disappointing was after all my effort and time I was sent a form letter rejection email.", "Interview Questions": "What drew you to Year Up and this role?"}, {"date": "9 Dec 2019", "title": "Business Management Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 8 weeks. I interviewed at Year Up (New York, NY) in Nov 2018", "Interview Descriptions": "It starts with a phone call, then they schedule a meeting in person and ask you if you are enrolled in school, if you are employed, and what you want out of the program.", "Interview Questions": "Are you or do you plan to enroll in school?"}, {"date": "1 Aug 2019", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Year Up (San Francisco, CA) in Aug 2018", "Interview Descriptions": "The interview lasted 1 hour. The interviewers asked me about my background and other standard interview questions like why I want to come to Year Up, how I can contribute to this program, and behavioral questions like how I resolve conflict. They were very helpful and willing to give me feedback at the end.", "Interview Questions": "My background, why I want to come to Year Up, behavioral questions..."}, {"date": "27 Sept 2018", "title": "Admissions Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Year Up (Washington, DC) in Aug 2018", "Interview Descriptions": "3 round interview.  Sometimes more to include HR Recruiter.  HR recruiter is awesome and very informative.  I was not impressed by the local interviewers.  At times seemed rather unprofessional.  The questions were your regular run of the mill with little attention to record of professional experience, quality, and metrics.", "Interview Questions": "what does diversity mean to you? "}], [{"date": "21 Jul 2018", "title": "Hris Business Analyst Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 3 weeks. I interviewed at Year Up in Jun 2018", "Interview Descriptions": "The interview process was thorough - I had a phone screen with the recruiter, plus 30-minute interviews with 5 different people that I would have been working with in some capacity.  Emily, the recruiter I worked with, was excellent. She checked in with me right after each interview to let me know the next steps and move the process along. She was very responsive and able to answer all my questions. \r\n\r\nEveryone I interviewed with was great, and for the most part pretty laid-back. They were really interested in getting to know me and sharing about what the company does and what this role would entail. They were very flexible in working around my schedule with my current job, and most of the interviews were through Skype, which was really convenient. Everyone was very mindful of my time and ended the interviews on time.\r\n\r\nAfter the last interview I was asked to complete a behavioral analysis assessment. It was just 2 questions asking me to select from a list of qualities that I think are expected of me, and to choose from the same list those qualities I actually possess. It was interesting. I have no idea what the results were.\r\n\r\nI was disappointed that I wasn't made an offer, but I was very impressed with the interview process and it was a great experience overall, and a good opportunity to learn about a really cool company.", "Interview Questions": "Describe how you handle feedback."}, {"date": "3 Jun 2018", "title": "Assistant Director Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Year Up (New York, NY) in Apr 2018", "Interview Descriptions": "The entire interview process including the online application, phone screening, and in-person interview were seamless and efficient. I took note of a distinct brand of transparency and genuine enthusiasm.", "Interview Questions": "Describe how previous experiences are relevant to the position. "}, {"date": "6 Jan 2018", "title": "Admissions Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "The process took 3 months. I interviewed at Year Up (New York, NY)", "Interview Descriptions": "13 interviews over 3 months. Overall a great interview experience.  Diverse questions and staff from various departments and levels were well represented.  Questions about how previous exp related to mission.", "Interview Questions": "Why do you want to work at YU?"}, {"date": "20 Mar 2018", "title": "Development Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Year Up (Chicago, IL) in Mar 2018", "Interview Descriptions": "The interview process was timely.  The entire process took about a month.  I was contacted from a recruiter within the week I had applied.  I was told to take an online personality assessment, after which I was asked to schedule a phone interview with the recruiter.  After the phone interview, I was asked to do two in-person interviews over two weeks.  At the first interview, I met my prospective team members.  For the second interview, I met the Senior Director of Development as well as other members of the organization.  Immediately following the second in-person interview, I was asked to provide three professional references.  By the end of the week, I was offered the job!", "Interview Questions": "How would you describe Year Up to a potential donor?"}, {"date": "15 Mar 2018", "title": "Development Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 weeks. I interviewed at Year Up in Feb 2018", "Interview Descriptions": "I had an initial phone interview with a recruiter, and afterwards was asked to take a personality test and submit a writing sample based on a prompt. I then had a Skype interview with two members of the Development team.\r\n\r\nOverall the interview process was pretty average. No curveball questions. \r\n\r\nMy only complaint was the amount of time the whole process took. It took a full five weeks from submitting my application to have one short phone interview and one Skype interview. Normally I would not care, as I understand that most companies take a lot of time with the interview process these days, but Year Up goes out of their way to specifically say on their website \"We understand your time is valuable. We will respond to you in days, not weeks\". Don't make this a tag line on your website if it's not true! Just don't say anything.", "Interview Questions": "How would you describe Year Up and what they do to friends or family?"}, {"date": "21 Aug 2018", "title": "Research & Evaluation Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Year Up (Boston, MA) in Feb 2018", "Interview Descriptions": "After sending in my application I received a phone call to schedule a phone interview for that week. After the phone interview I received an email inviting me to schedule a one on one interview with the individual I would be working under.", "Interview Questions": "Why do you want to work here?"}, {"date": "5 Apr 2022", "title": "Operations Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. I interviewed at Year Up (Chicago, IL) in Feb 2018", "Interview Descriptions": "This company takes a team approach to interviewing and you will most like meet with 3-5 team members before being hired even for the smallest roles.  All team members are require to be apart of the hiring process to ensure the best match candidate is selected for the role.", "Interview Questions": "How can you contribute to the success of what we do to serve young adults?"}, {"date": "16 Jan 2019", "title": "Development Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Year Up (Boston, MA) in Feb 2018", "Interview Descriptions": "One pretty straightforward phone interview. The questions were what you'd expect - I think they focused more on my resume and just did the phone call as a formality. I heard by the end of the phone call that they were interested and then wanted to discuss my availability.", "Interview Questions": "Why are you interesting in working t Year Up?"}], [{"date": "24 Oct 2018", "title": "Development Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Year Up (Boston, MA) in Feb 2018", "Interview Descriptions": "I only had a phone interview, and I was offered an internship. It was typical 'walk through your resume' interview and some Q&As. They asked me some questions, and I asked some questions. Also, after a phone call, I met my managers a week after to talk about hours and expectations, and also received a tour of the company.", "Interview Questions": "Typical 'walk through your resume' type of phone interview, and they offered me an internship. "}, {"date": "30 Oct 2017", "title": "Contact Center Representative Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Year Up", "Interview Descriptions": "I did two interviews over the phone which I did a great job resulting in an offer. After phone screen I then had to undergo a background check. After background check cleared I was asked did I want to take the position.", "Interview Questions": "N/A"}, {"date": "11 Nov 2017", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Year Up (McDonough, GA) in Oct 2017", "Interview Descriptions": "They ask lots of personal questions the people make you feel comfortable it is a professional setting. I took my academic assessment and set an appointment for my interview the same day i received my results", "Interview Questions": "Why do you think this program is right for you"}, {"date": "26 Oct 2017", "title": "Admissions Recruiter Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Year Up (Miami, FL) in Oct 2017", "Interview Descriptions": "The interview process was quick but very detailed. When selected the first interview was over the phone with a talent acquisition specialist (HR), then met with the site Manager and Admissions Director is separate interviews. All 3 interviews varied about 5 to 7 days of each other. Only the  second  quickest interview schedules that I have encountered.", "Interview Questions": "Give an overview of your work history, and why did you choose to apply for this position with YearUp?"}, {"date": "19 Sept 2017", "title": "Recruitment Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Year Up", "Interview Descriptions": "Submitted application for role on Aug 4. One month and a half later, I get a one sentence email inviting me to a phone interview to take place the next day. Lack of professional courtesy turned me off from org despite its mission.", "Interview Questions": "What have you been doing since your last period of employment?\r\nExplain your resume."}, {"date": "20 Jun 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Year Up (San Francisco, CA)", "Interview Descriptions": "About 2 weeks after initial application, HR representative scheduled a 30min phone interview, where she described the role and organization briefly. She then asked me  some basic questions about my past roles and experience, and why I wanted to work with Year Up. It was a wonderful conversation, and at the end she did ask about desired salary range.\r\nNext, was invited to do an in-person interview with Sr. Director of Program. Was a great conversation, and she asked many scenario questions: \"If you see that a particular group of students are firing themselves from program, what kinds of interventions might you put into place?\".  A few days later, I was invited for a final interview with the Associate Director of Program, and Associate Director of Student Services. They asked many scenario questions as well, and throughout the whole process were open to me asking questions.\r\nThat interview happened on a Friday, and about a week later received the offer.", "Interview Questions": "How do you think you would handle managing up to other staff to make sure they are fulfilling their coaching obligations?"}, {"date": "29 Jun 2018", "title": "Admissions Manager Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Year Up (Chicago, IL) in Sept 2017", "Interview Descriptions": "The interview process was good. I didn't get the job however they provided quick feedback. I didn't feel as though the second interviewer was very engaged. She seemed extremely per-occupied with something else. Her questions didn't seem very relevant to my interview.", "Interview Questions": "How would you increase admissions?"}, {"date": "15 Aug 2017", "title": "Content Marketing Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "N/A", "Application Type": "I interviewed at Year Up", "Interview Descriptions": "After being contacted by the recruiter to schedule a phone interview, I responded and gave him some times. Then, I never heard from him again until I received a form email saying they decided to pursue other candidates.", "Interview Questions": "He asked me for some available times to talk on the phone. That's as far as the \"interview\" went."}, {"date": "12 Aug 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up (Seattle, WA)", "Interview Descriptions": "Phone interview followed by in person.   The in person was a panned, which could be a little intimidating. They asked a lot of really thoughtful youth development questions that gave me confidence in their programs. However,  when I was offered the job, I was expected to take the job right then and there on the phone. When I asked if I could see an offer letter and have a day or two to decide, I was told they don't do that. I was really excited about the opportunity, but the phone call offering me the job made me feel uneasy enough that I decided to go with another offer.", "Interview Questions": "What is the importance of code switching?"}, {"date": "28 Jul 2017", "title": "Manager Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Year Up", "Interview Descriptions": "It was wonderful I really liked it . I got a call back a couple weeks later and decided to go for the interview. The interview was pleasant and not too difficult. Two weeks after, I got an offer", "Interview Questions": "WHy do you want to work here?"}], [{"date": "23 Jul 2017", "title": "Program Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Year Up (Philadelphia, PA) in Jul 2017", "Interview Descriptions": "Was called the day before and asked to prepare a lesson plan for the 3rd interview. This interview was in another state and would take an hour to get there. Was not told about parking or even who I would be teaching. I get there and pay 20 dollars to park only for the staff to be rude and unprofessional. The two students I met where great.", "Interview Questions": "They asked none "}, {"date": "21 Aug 2017", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up (Phila, PA) in Jul 2017", "Interview Descriptions": "Very lengthy, expect at least four interviews over several weeks. Some people respond and act quickly to get you through the various interview processes, some are slower. I had a phone interviews, personality profile to complete, and two in person interviews.", "Interview Questions": "What was your Year Up?"}, {"date": "19 Sept 2017", "title": "Director of Operations Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up in Apr 2017", "Interview Descriptions": "Although there was a lot of time in between interviews, the interviews were really great.  The process consisted of a phone screen, in person panel and then a final interview day which included 3 rounds of interviews with staff and students.  The staff were prepared, friendly and interested in getting to know me and probed for fit within the Year Up culture.  At the end of the process, I was offered a role different than that one I applied for, which I accepted because it was a better fit.", "Interview Questions": "Why do I want to work at Year Up"}, {"date": "28 Mar 2017", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Year Up (San Jose, CA)", "Interview Descriptions": "I felt like I was dismissed rather quickly because of my age. It was evident within the first few minutes that my interviewer didn't feel I had the experience necessary.", "Interview Questions": "What would you do if a student didn't show up? "}, {"date": "10 Apr 2017", "title": "Teaching Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Year Up (Boston, MA) in Mar 2017", "Interview Descriptions": "I applied online mid-February and was interviewed by phone at the end of March. Didn't click very well with interviewer, but interview was a pretty standard phone screen. Sent two follow-up e-mails until I was notified that someone else had been hired. HR department seems very disorganized and it's disappointing that an organization that does such good work is so inconsiderate to potential employees.", "Interview Questions": "How would you market a Year Up student?"}, {"date": "19 Apr 2017", "title": "Interview Candidate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Year Up (Baltimore, MD) in Mar 2017", "Interview Descriptions": "Email received to schedule & confirm the interview date. We had a Telephone interview.  \r\nThe Interviewer was from a corporate office,  not the local office in Baltimore, MD, however she was very courteous and demonstrated excellent customer service skills.", "Interview Questions": "What is your background in workforce development? "}, {"date": "1 May 2017", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up (Baltimore, MD) in Mar 2017", "Interview Descriptions": "Very concise and straight forward. Professional communication. Recruiter asked engaging questions and have a good descriptive look at what the details of the job would be.  She was attentive to my questions and I felt like she was thoroughly with answering questions I had for her as it pertains to the skill sets needed to perform the job.", "Interview Questions": "What do you know about our organization"}, {"date": "29 Nov 2017", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Year Up (Boston, MA) in Feb 2017", "Interview Descriptions": "The interview Process was extensive. The first step is a phone screening. The second is an in person interview with 2 members of the team. If accepted to move on to the next step you are then sent an assignment to complete under a deadline.  I had to do a Data Analysis on Excel about the previous graduating class. Upon completion I then had a phone interview to explain my findings, process and analogy. Once accepted you have a last interview with 2 team members. This process lasted about a month. Although I did not get an offer the manager reached out to me personally to tell me that they hired internally and how impressed they were. She only gave all the positive feedback that she got from the interview process and invited to apply again and put her as a personal referral.  I also would like to add that it is imperative to prepare for each interview the questions are extensive and require a lot of thoughts.  They are really missing driven and require someone that is open and can multitasks efficiently.", "Interview Questions": "How does career goals fit within Year up Mission? "}, {"date": "22 Jan 2017", "title": "Operations Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Year Up (Dallas, TX)", "Interview Descriptions": "Entire process only took 3 weeks: initial interview with a recruiter, then interview with similar position at another location, then final interviews with the site's executive director and site director. Every step in the process was clear and professional.", "Interview Questions": "Pretty standard questions:\n- why did you apply?\n- tell me a time when....\n- what are your long term goals?"}, {"date": "9 Jan 2018", "title": "Assistant Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up (Ludhiana) in Jan 2017", "Interview Descriptions": "I got through ibps and I have appeared  in interview  for punjab national  Bank. It was penel  interview and most  of questions were related to banking and rbi.  It was easy interview", "Interview Questions": "Why you  want  to join banking"}], [{"date": "14 Feb 2017", "title": "Partner Relations Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Year Up in Jan 2017", "Interview Descriptions": "The first interview is with the HR person and it is very formal, scripted and not conversational at all. I understand that HR has the job of filtering through a ton of people but I don't think an interrogation style is the best way to feel out a candidate, especially for a sales position.  I wasn't even allowed to ask questions until the very end of the call and even then the answers I received felt rushed. I would skip HR if possible and try going direct to the hiring manager.", "Interview Questions": "How would you sell Year Up to potential partners? What is your salary requirement? Why are you interested in this position?"}, {"date": "26 Jan 2018", "title": "Manager Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Year Up in Jan 2017", "Interview Descriptions": "First, I received an email from someone in HR to take an assessment and do a phone interview. The assessment was a personality quiz seemingly measuring disposition and attitudes. After the phone screening I had an on campus interview with the person who supervised the role and an assistant. About a week later I came for another interview where I met the executive director, site director, and various other team members.", "Interview Questions": "Why do you want to work for Year Up?"}, {"date": "5 Nov 2016", "title": "Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Year Up", "Interview Descriptions": "About a 5 week process. I had an initial phone screening, then 2 in person interviews. I interviewed with 2 people for each in person so it wasn't bad. I thought my first in person was a lot harder because one of the interviewers kept interrupting me to ask a different question that was related to the first, so it was hard to back track to the first question. Otherwise, everyone was very kind and helpful with information.", "Interview Questions": "Can you explain the opportunity divide? \r\nIf you had 120 students to serve in your position what would be your course or action?"}, {"date": "18 Feb 2017", "title": "Program Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 4 weeks. I interviewed at Year Up in Nov 2016", "Interview Descriptions": "Submitted application but did not receive initial phone interview for a few months. Once I received the phone interview, I had two more interviews with in four days. Within the next week I was booked to fly out to the site and was interviewed by other team members and Year Up young adults. The process was slow to begin, but was  extremely quick once the process began. On site, I had the opportunity to observe a lesson and interact with Young Adults. Regarding the interviews, I had an initial phone interview with a national recruiter, a Skype interview with the site director, a second Skype interview with the social services manager and founding program manager. Once on site I had an interview with the executive director and a panel of young adults. You can literally feel the magic.", "Interview Questions": "Tell me about your experience with \"dotted line leadership.\" What are your techniques for motivating someone that you do not directly supervise?"}, {"date": "27 Nov 2016", "title": "Partner Relations Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up (Boston, MA) in Oct 2016", "Interview Descriptions": "I had the opportunity to have a phone interview within a week of sending over my resume.  The interviewer was non conversational and seemed to read from a list of questions.  There were no follow on questions.  I heard from them regarding an in person interview about two weeks after the phone interview.", "Interview Questions": "Describe how you would sell Year Up\r\nWhat would your communication strategy be?\r\nHow have you engaged and embraced diversity?\r\nWhat are your salary requirements?"}, {"date": "6 Aug 2016", "title": "Associate Director of Recruitment Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 4 weeks. I interviewed at Year Up", "Interview Descriptions": "Length was good. Interviews were friendly and comfortable. There was also plenty of time and opportunity to ask questions. It was really very good all around.It felt like maybe it went on for a longer period of time than necessary, but that's not unusual.", "Interview Questions": "Why I was interested in working there. What I knew about the org."}, {"date": "11 Mar 2017", "title": "Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Year Up (Miami, FL) in Aug 2016", "Interview Descriptions": "Long process. Long phone interview, then another interview, emails back and forth always congratulating me for moving forward. It seems the job was mine, but then I met with the Miami team, a woman second in charge ask me if I speak creolle, I said nope, but I undestand. She looked at me with a discriminatory face, I knew my white completion and latino background were not quite qualities she was looking for. They made me even met with the students of the MDC miami campus, they made waist so much time to not offered me the possition! I felt discriminated against being white and latino.\r\nI've never felt so bad in my life in any job interview.\r\nI have family who have dark completion. I dont know how to discrimanate anybody. I have hatian friends. I can live and work with anybody. How it's possible that you segregate yourselfs from the rest of the world.", "Interview Questions": "Do you speak creolle?"}, {"date": "16 Jun 2016", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Year Up", "Interview Descriptions": "The whole process took 2+ months, I applied in Jan and didn't get a final answer until late March. Did a phone interview, an in office with, and then I had to prepare a presentation and interview with 4 other people. Intense and exhausting. They also said they would reach out to my reference but never did. I was very excited in the beginning but in the end it felt like they were dragging it out and did not care. Bummer because I really believe in what they do.", "Interview Questions": "How do you explain to someone about year up?"}, {"date": "25 Oct 2016", "title": "Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Year Up (Seattle, WA) in Jun 2016", "Interview Descriptions": "Negative experience. The process took two weeks. Relatively fast to clear a phone interview and obtain an in-person interview. Interviewed with a panel of two- one was clearly experienced in interviews and very professional. The other was cold, inpersonable and cut me off multiple times to ask for a generic interview answers. This individual was not open to clarifying question from me as a candidate. I have been interviewing candidates as a non-profit director for years and recognized this as disinterest in me as a candidate immediately. I have never been so cold to any individual in an interview. This seems like an honorable organization with wonderful intentions and a positive impact that probably does not treat employees well. Corporate appearance of individuals promoting economic empowerment. Definitely not a come as you are non-profit. Interviewers openly admitted to being overworked, wearing many hats and stated the interview process was fast due to urgency in filling a gap. I suspect I was only interviewed to meet an HR standard.", "Interview Questions": "Why are you interested in working here?"}, {"date": "2 Jun 2016", "title": "Associate Director Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Year Up (Boston, MA) in Apr 2016", "Interview Descriptions": "Phone call with assistant level team member. Second phone call with middle-level manager. Was told I was getting in-person interview with two senior leaders, waited over a month to just schedule it (I was told they were too busy with a staff retreat to schedule it any sooner) and then 24 hours after it was scheduled, I'm told the position description changed and they no longer wanted to see me. Complete waste of time for all involved.", "Interview Questions": "Explain your past experience working on skills gap/opportunity divide efforts."}], [{"date": "23 Jun 2016", "title": "Admissions Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Year Up in May 2016", "Interview Descriptions": "Phone interview with 2 people for 30 minutes. In the original e-mail, I was told that the interview would be for 30 minutes and to select dates/times I would be available. After doing so, I received a confirmation email stating that the interview would be for one hour-- but that wasn't the case. It was pretty simple, felt like a conversation. I was told I would hear back in 2-3 weeks and its been one month. Glad I didn't have all of my eggs in one basket. I currently work in admissions, and its hard telling someone if he/she isn't the right fit-- but I do it. It's unprofessional and disrespectful to someone that is currently looking for a job.  They clearly do not have the decency to be straightforward with folks.", "Interview Questions": "Level of Presentation skills"}, {"date": "29 Apr 2016", "title": "IT Instructor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 5 days. I interviewed at Year Up (San Jose, CA) in Mar 2016", "Interview Descriptions": "By far, the most comprehensive job interview I have ever had.It covered multiple questions on background, training, experience, as well as \"what would you do in this situation\". There is a panel interview as well as 1:1 and phone interviews. The staff was very professional.", "Interview Questions": "Multiple questions on background, training, experience, as well as \"what would you do in this situation\"."}, {"date": "18 Jul 2018", "title": "On the Influence Team Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Year Up (Boston, MA) in Mar 2016", "Interview Descriptions": "A few phone interviews with people that I would be working with. It was nice to speak to more senior people as well as past interns who were hired. They gave me a good understanding of what I would be gaining from the experience as well as what they needed from me.", "Interview Questions": "Why are you interested in this cause? "}, {"date": "30 Mar 2017", "title": "Participant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through college or university. The process took 5 months. I interviewed at Year Up (New York, NY) in Mar 2016", "Interview Descriptions": "Long and arduous. Took a ton of effort, many questions about your personal finances, goals, and abilities. They wanted to know what skills I had and how I could leverage the program to advanced my skillset and be valuable to a company.", "Interview Questions": "Would the low income salary force you to leave the program?"}, {"date": "31 Mar 2016", "title": "Program Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Year Up (Woodbridge, VA) in Jan 2016", "Interview Descriptions": "Overall was good. Phone interview, on-campus interview, and then a final interview with the head of the campus. The final interview was strange, didn't understand why it was needed and the person interviewing me did not seem engaged in what I had to say. Was great until the last phone call.", "Interview Questions": "Talk about your experience working with diverse populations"}, {"date": "7 Jun 2016", "title": "Innovation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 1 week. I interviewed at Year Up (Boston, MA) in Jan 2016", "Interview Descriptions": "Started with a phone interview. Questions were mixed: both typical (why are you interested in Year Up) and intricate/intent at testing thinking skills. Following the phone interview, I had an in-person interview with two other employees.", "Interview Questions": "Describe an advertisement that you would create for the importance of using data."}, {"date": "11 Feb 2017", "title": "IT Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Year Up (San Francisco, CA) in Jan 2016", "Interview Descriptions": "My first phone interview was with someone in HR. She first asked me about my background and my salary expectations and then asked me other questions. Then I received an invitation for a PI Behavioral Assessment which was very easy.  Two weeks later I received a calendar invite for a phone interview with the director who missed the first two two meetings.  I sent him a reminder and he apologized and we had a good conversation on the third attempt. Three weeks later I was contacted for face to face interview. I was asked to prepare 15 minutes presentation. The presentation I thought went very well because the students were very exited and gave me a good hand of applause. Then I met face to face with one of  instructors their and another meeting with one of the student's counselor and finally with the director. It took almost three months due to the holidays.", "Interview Questions": "Can you explain the opportunity divide?"}, {"date": "11 Apr 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 6 months. I interviewed at Year Up (Chicago, IL) in Nov 2015", "Interview Descriptions": "The process to getting the internship is about six months.  You will have an information session, then you will have a group interview.  In which after you have the group interview you will at the end have two essays to do.  You will find out in a week if you will be called back for a individual interview. After that you will be given multiple tasks online to do for a few months as they evaluate everything that you have done and will do.", "Interview Questions": "What do you believe you will bring to the table as an intern in our program."}, {"date": "13 Feb 2016", "title": "Program Manager Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Year Up in Oct 2015", "Interview Descriptions": "Long and drawn out- it took place over 3 months with 4 different interviews. The organization will say they want to ensure they get the best candidate, but that can be done more efficiently. Phone interviews were handled efficiently and well organized. Directors and talent acquisition gave great insight into roll and expectations, passion for organizational mission.  Interview in person was unprofessional. Staff person was late (20 min) and unprepared.  Took a month to get a response.", "Interview Questions": "What are your goals in 5 years?"}, {"date": "19 Oct 2015", "title": "Recruitment and College Outreach Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Year Up (Ban Som Phone) in Oct 2015", "Interview Descriptions": "I have not interviewed yet, but after submitting an application over the weekend, I received an email back Monday morning asking to set up a 30 minute interview. I was also required to fill out a Predictive Index survey.  That's about all the information that I have right now.", "Interview Questions": "Predictive Index survey required prior to phone interview."}], [{"date": "28 Aug 2015", "title": "Internship Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Year Up", "Interview Descriptions": "They asked me your general can you work in a team, best experience in life, worst experience. It is very simple and laid back nothing to get worked up about. Just be yourself and you will be accepted in no time. They don't want an extreme professional or a complete dunce.", "Interview Questions": "What made you pursue this opportunity?"}, {"date": "15 Aug 2015", "title": "Recruitment Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Year Up (New York, NY) in Aug 2015", "Interview Descriptions": "Review process was fairly easy, it was conducted over Skype. My only criticism would be that relying on Skype assumes certain conditions on the behalf of the applicant. Namely, that they have a computer with a camera and microphone and internet access. This may seem like it's not a big deal, but it may not be easy for some potential applicants to accommodate. While they gave the option for a phone interview, it was clear that they preferred the video option. \r\n\r\nOther than that, it was easy, and the convenience of not having to travel to their office can't be understated. This was a recent interview, so I am still in consideration for the position.", "Interview Questions": "What would your plan be for the first 6 months of the job?\r\nHow would you convince someone who is not on board with the goals of the organization?\r\nTell me about your experience and how it relates to the job?\r\nWhy do you want to work at Year Up?"}, {"date": "22 May 2015", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 2 months. I interviewed at Year Up", "Interview Descriptions": "Basic interview questions, lots of behavioral and situational questions. Be ready to describe how you work under pressure and how you handle ambiguity. Made it past the phone interview, and then got rejected after the second interview due to reasons that were never disclosed to me. I actually thought the second interview went much better than the first.  I didn't even apply for this position, a member of the team actually sought me out because they felt I would be a strong candidate However, I was extremely overqualified(position required a Bachelors, I have a PhD, with 3 years of career counseling experience, and one year in a management role in career services)...and the pay was less than impressive(and I believe their team was fully aware of this, so thats why I didn't progress). However, I did respectfully request that they disclose why I didn't make to the last stage...still waiting on a response...... They are really committed to finding the right fit, and I think they would take a less qualified applicant(with minimal direct experience).  I guess I am just confused about how someone who is sought out for a job, and is qualified, and got the director to raise the salary(prior to even being offered a second interview) is not selected, or at least invited to the last stage. If I was overqualified, why was I sought out???", "Interview Questions": "Describe how you work under pressure? How do handle conflicting opinions?"}, {"date": "2 Jun 2015", "title": "Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Year Up", "Interview Descriptions": "Telephone call followed by face-to-face.  Telephone was a conference call with two parties. I believe the next step is another call plus reference checks and then a face to face.   Follow up after the intitial call could be better but most employers fail in this area anyway.   They are not easy to reach however. They do appear to have very enthusiastic and mission focused staff so prepare and prepare some more. You will not move beyond this phase with a strong resume of you can not connect with the culture of the company.", "Interview Questions": "They will ask you to provide examples of \"tell me about a time when you -blank- and -blank- happened\". They want confident and clear examples"}, {"date": "15 Jul 2015", "title": "Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Year Up (San Francisco, CA) in Jun 2015", "Interview Descriptions": "The process was well handled and professional. The staff were kind and very informative. I enjoyed the personalities and the transparency the interviewers provided. The ethos of the company is apparent and the staff seem very much behind their mission.", "Interview Questions": "Provide one example of facilitating a group."}, {"date": "4 Jun 2015", "title": "Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 3 weeks. I interviewed at Year Up (New York, NY) in May 2015", "Interview Descriptions": "I had 3 phone interviews of which one was with the recruiter, one with the head of the team and one was a technical interview. The first 2 interviews were not very difficult. They spoke of the company culture and the work they are doing. I wasn't told that the 3rd interview will be a technical one and I will have to be using a PC to work on excel stuff. This came as a shock when I was on the phone with the person taking the interview. So I had to start my PC during the interview and had to download all the files. I found this really unprofessional. It took me a while to get everything started so maybe he was disappointed in my performance and I got rejected the next day. I do appreciate them letting me know within 2 days if I was going to move ahead in the interview process but the last interview was horrible. Even the interview process was not reveled to me. I had phone interviews over phone interviews but none of them mentioned when I was being called in for an in person interview.", "Interview Questions": "Do you have any interests in working with the students? Are you presently working"}, {"date": "23 Jan 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Year Up (San Francisco, CA) in May 2015", "Interview Descriptions": "Apply online for an information session. You then need to gather all needed papers (transcript, personal statement, online application, etc). Show up prepared for interview. Follow up. They're more into how committed you will be to the program and if you have a passion for technology. A tech background is not needed, just interest. Always show up to interviews 15 minutes early.", "Interview Questions": "Tell me about a time you had issues with a manager?"}, {"date": "4 Mar 2015", "title": "Associate Director Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Year Up", "Interview Descriptions": "I went through 3 phone interviews. The initial interview was for 30 minutes and the 2 after were for an hour. All 3 went very well. The staff was nice, friendly and we talked about job experiences and work conflicts. The questions weren't hard, just thought-provoking. If you do your homework on Year up and yourself (be prepared) , you will be fine.", "Interview Questions": "Year Up is a data driven organization so you must brush up on that skill Or at least have experience moving an entity (students, company) with data. The question will come up."}, {"date": "7 May 2015", "title": "Talent Acquisition Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 7 weeks. I interviewed at Year Up (San Francisco, CA) in Apr 2015", "Interview Descriptions": "I had one phone interview and an in person interview. I had a positive experience overall, even though I did not get asked to interview in the final round. One drawback was waiting over two weeks to hear back after the in person interview. I understand sometimes it takes time to debrief but this felt excessive, especially since I was not asked back. \r\n\r\nReally enjoyed talking to everyone on the team, it's a good group of people passionate about the organization, and it's clear they work well together.", "Interview Questions": "How can you add value to the Talent Acquisition team? "}, {"date": "24 Feb 2015", "title": "Admissions Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2+ months. I interviewed at Year Up in Feb 2015", "Interview Descriptions": "3 month long process; 4 interviews with 9 people. 1 Phone interview, 3 in person, and one presentation. Very in depth interviews to ensure I was a good fit for the orginzation's culture.", "Interview Questions": "How would you contribute to Year Up's mission?"}], [{"date": "11 Jun 2015", "title": "Employment Placement Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. The process took 3 months. I interviewed at Year Up (San Francisco, CA) in Jan 2015", "Interview Descriptions": "It was a long process, though there was some organizational restructuring happening during the interview/application process, so that extended things a bit. The process consisted of: an online PI survey; a phone interview; in-person interview with the team manager; a second in-person interview with the rest of the team, team director, and 3 current students; and finally a third in-person interview with the team manager and director. Despite the long process, everyone was very communicative and apologetic along the way. I received regular updates about why there was a delay in making a decision, and overall it was a very positive experience.", "Interview Questions": "How do you manage competing priorities, and how do you handle not having enough time in the day to complete your work?"}, {"date": "1 Feb 2016", "title": "Project Manager Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Year Up (New York, NY) in Jan 2015", "Interview Descriptions": "The interview was very straight forward and informal. I was referred to the hiring manager by two of our mutual close friends and colleagues. I coordinated a time to speak with him via email. We soon met for coffee by the Year Up office. He seemed impressed and quickly asked that I send him a sample of my project management skills and my rate. I obliged. Soon after he asked for references. Shortly after contacting them, he called me and gave me the offer.  \r\n\r\nSince I have integrity and he was a personal connection, I chose to be honest and tell him I was waiting on another position and would need a week to get back to him. (It would not be fair to our mutual friends to start a job and quit soon after.) He said that would be fine and that he understood as his offer was part-time, contract work. I never got the other offer and quickly replied to the hiring manager to tell him that I accepted his offer. \r\n\r\nI expected either a yes or a friendly no. I got neither. Hiring manager never responded to my emails or calls.  He did not have the decency to treat me like a human being, much less a close friend of his colleagues. I doubt a lack of common decency makes for a good boss.", "Interview Questions": "What is your rate?\r\nRecall difficult project management experiences and how you got around them."}, {"date": "26 Sept 2014", "title": "Director of Admission Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I applied through other source. The process took 3 months. I interviewed at Year Up", "Interview Descriptions": "The whole process took more than 3 months to complete, and included 1 telephone interview and 3 in-person interviews.  Every single interview was blundered in some way-- either they gave me the wrong address or the person who was to interview me wasn't expecting me.  I felt that-- as a currently employed person-- my time was not being respected.  All of the interviewers were very kind, but also very frank about the heavy workloads and lack of work-life balance at the organization.", "Interview Questions": "I was asked many times about my management style, and I felt like they were expecting something more or different from my answer."}, {"date": "19 Oct 2015", "title": "IT Trainee Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 months. I interviewed at Year Up (Chicago, IL) in May 2014", "Interview Descriptions": "It's broken up into 2 or 3 phases. There may be a phone interview, then group interview during the group interview you play different icebreakers to see if you will be a fit for the program., followed by1 on 1 which is more serious. It lasted about 30 minutes. Next you wait a few weeks to see if you made it. Even if you don't make the cut initially you will be placed on a waitlist.", "Interview Questions": "Tell me about yourself?\r\nWhy should we accept you into the program"}, {"date": "7 Feb 2014", "title": "Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Year Up (San Francisco, CA)", "Interview Descriptions": "Applied online, was asked to complete a personality test prior to a 30 minute phone interview. Lots of behavioral questions during the phone interview. Test results have never been shared. Unfair? The recruiter followed up with the rejection letter, which is a professional thing to do than not to.", "Interview Questions": "Prepare for behavioral type of questions and examples."}, {"date": "3 Mar 2014", "title": "Instructor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Year Up (Arlington, VA) in Jan 2014", "Interview Descriptions": "Apply online and if qualified, you are called in for an interview.", "Interview Questions": "N/A"}, {"date": "16 Dec 2013", "title": "IT Instructor Interview", "results": "No Offer", "experience": "N/A", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Year Up", "Interview Descriptions": "After applying online, received an email asking to schedule a phone screen. This call lasted about 30 minutes and then I was told I would hear back within 2 weeks. The next steps would be coming in and doing a \"Test Teach\" (teaching a lesson plan) in front of real students and other staff members, in addition to a group interview with staff. After about 3-4 weeks I received another email saying I was no longer in consideration for the position. Be prepared for a long interview process and a lot of waiting. The phone screen was not bad - no really difficult questions. Be prepared to talk about why you love technology, your teaching style, how you would handle difficult conversations with students, etc.", "Interview Questions": "If you were to teach a student a programming language, who has had no prior experience with programming and who is easily frustrated, how would you do it?"}, {"date": "23 Apr 2013", "title": "Business Communications Teaching Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Year Up (Chicago, IL) in Apr 2013", "Interview Descriptions": "I applied online with a very detailed cover letter, and I was contacted later that week for a phone interview. Prior to the interview I had to complete a basic personality test. It was relatively easy, but my internet browser kept messing up. Use IE not Chrome!\r\n\r\nThe interview went very well I thought. She asked about my teaching experience (I was a tutor) and mentoring experience. I think that since I hadn't mentored before I was less desirable. She was very nice and understanding, however, and I thought the interview went well. I followed up, but I never got a reply. I was told that I would know within a week if I would be moving on or not. It's been almost a month, so I'm assuming that's a no. The interviewer was very friendly, and it seemed like a nice company.", "Interview Questions": "All pretty basic questions for a position helping kids."}, {"date": "15 Sept 2012", "title": "Instructor Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Year Up (San Francisco, CA) in Sept 2012", "Interview Descriptions": "Be prepared to spend several months interviewing for a position. The first interview, a phone screen, started 30 minutes late (when the interviewer finally called, she stated that the time of the interview was for the time she called, despite the fact that my email said otherwise). The second interview/test teach was scheduled for a date that didn't exist, and then it was finally scheduled for almost a month later and at that, I was left waiting for about 15 minutes because the room was not ready. After that, a third interview with several staff members and instructors was scheduled for yet another month later. At the end of that interview, I was informed of what the next steps were (while thinking, \"really? MORE steps?!?!), but after all was said and done, I was told that they weren't moving forward with me as a candidate. I didn't feel like I was asked anything terribly difficult at the third interview, and a lot of the questions were the same as in the one-on-one interview, so I don't know why they had me in if their minds were apparently made up already. I really hope this isn't representative of how the entire organization is run. I ended up feeling like my time was wasted and that I was strung along for a ridiculous amount of time. I was often told to expect a phone call or an email on a specific date and time, but I was never contacted when promised (with the exception of being told I didn't get the job). The program itself seems to be a great model and the staffers I met were very nice and helpful. I know this sounds like I'm bitter, but these are complaints that I have had and made note of throughout the process, as it was very frustrating - so be prepared for a LONG process.", "Interview Questions": "The interviewer asked some vague questions (one example: how do you feel about collaboration?), but she had very specific answers that she expected and seemed annoyed if they weren't answered with the level of specificity that she wanted."}, {"date": "31 Jul 2016", "title": "Instructor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Year Up (Boston, MA) in Feb 2012", "Interview Descriptions": "Phone interview followed by teaching demonstration and extensive interviews. Guest teach day was 5 hours long, though I believe this process has since been streamlined. Questions about difficult situations I'd faced in a classroom and why I wanted to work with this student population. Interviews with supervisor, executive director, and co-workers in rapid succession on the same day as the guest teach.", "Interview Questions": "Why do you want to do this work?"}], [{"date": "1 Dec 2011", "title": "Events Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Year Up (New York, NY) in Nov 2011", "Interview Descriptions": "I received an email stating I had been selected for a phone interview and to select a few times that worked best for me. On the day and time agreed on for the interview, I never received a call. I followed-up with an email and voicemail inquiring about the missed interview (making sure they didn't have trouble reaching me) and never received a response.", "Interview Questions": "What time can you interview?"}, {"date": "8 Aug 2011", "title": "Member Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 2 weeks. I interviewed at Year Up in Sept 2010", "Interview Descriptions": "The hiring process is a very rigorous one. They make sure to do a thorough interview for idesal candidates for the program.", "Interview Questions": "What are the qualities and traits that make you fit for this position?"}, {"date": "27 Jul 2010", "title": "Internship Coordinator Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Year Up in Jul 2010", "Interview Descriptions": "This interview was for a newly created Internship Coordinator position with Year Up. Prepared for the phone interview using standard and difficult questions and was expecting the conversation to last at least 30 minutes to an hour. However, the interviewer's phone line dropped the call in the middle of my answering questions three times. Yes, I was using a land line and she mentioned their office's tech people were working on the problem from their end. This made the process very awkward and offsetting.", "Interview Questions": "What do you think you can bring to the position? "}]]