[[{"date": "14 Apr 2023", "title": "Assistant Professor Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 days. I interviewed at Columbia College of Missouri (Columbia, MO)", "Interview Descriptions": "This was a meeting with administrators and other professors, teaching demonstration and typical interview questions. The questions were asked by different members of the group and time was allowed for questions.", "Interview Questions": "Share your teaching philosophy and how it applies in your teaching."}, {"date": "30 Apr 2022", "title": "Training Program Coordinator Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "The process took 2 weeks. I interviewed at Columbia College of Missouri (Columbia, MO) in Apr 2022", "Interview Descriptions": "The interview was good but they didn't tell me until we were in the interview that the job required 50% travel! That should have been listed in the job description.", "Interview Questions": "Mentioned the travel and asked how I do working with a lot of difficult people...makes you wonder? "}, {"date": "26 Mar 2019", "title": "Student Worker Tech Center Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Columbia College of Missouri (Columbia, MO)", "Interview Descriptions": "Short and brief. I applied online and was called to schedule an interview after a few days. I was interviewed by the Director of Tech Center.  I accepted the offer right in the interview.", "Interview Questions": "What antivirus software do you use for your personal computer?"}, {"date": "22 Sept 2018", "title": "Student Support Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 6 days. I interviewed at Columbia College of Missouri (Orlando, FL) in Sept 2018", "Interview Descriptions": "I never write reviews, but I could not pass on this.... I arrived for my interview 10 minutes early.  Scheduled for 9:00 a.m.  (I was called to schedule this interview the day before and this was the only time option I was given) I sat and waited in the lobby.  I watched the staff go in and out.  During that time most of them acknowledged me.  At approx. 9:10 a.m. the receptionist guides me Behind the Front Desk to take a “test.”  The test seemed simple.  While taking the test there were several conversations upfront including the receptionist and one of the staff members came over to me and introduced himself & shook my hand.  I said hello & explained I was taking a test.  Then at 9:20 a.m. the receptionist states my time is up.  I explained to him, I had no idea I was being timed. Then, I was escorted to the conference room of a panel of 6 people.  I was highly skilled for the position and dressed as a career person should be for an interview.  I felt as if they did not think I would stay there long, because of my experience.  If they felt that I was over qualified and would not stay, why would they call me for an interview to come in the next day.  I was very interested in the small location, the position and learning more about the team.  It is unfortunate that the people who are interviewing are not trained to do so.   I guess that is why it is taking them 6 months to fill the position.  It was last minute and a complete waste of my time.  They disrespected my time.  The team needs interviewing training.", "Interview Questions": "What are your career goals in the next 5 years?"}, {"date": "5 Nov 2016", "title": "Administrative Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "N/A", "Application Type": "I applied in-person. The process took 1+ week. I interviewed at Columbia College of Missouri", "Interview Descriptions": "1 interview, it lasted 20 minutes or less. It was a panel, the campus director, associate director and administrative assistant. It included a tour of the facility and time at the end for my questions. I was introduced to people and it was easy to find.", "Interview Questions": "I was asked about previous experience, how I deal with difficult people. There were lots of questions about the job description."}, {"date": "15 Dec 2015", "title": "Administrative Assistant Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Columbia College of Missouri in Nov 2015", "Interview Descriptions": "I Applied back in the September 2015..I actually forgotten that I had applied at this place through indeed, I got a call from the admissions rep she asked if I could come in for an interview.I interviewed in November 2015. Went to the interview and it lasted almost 2 hrs I though it went really well the school director was very personable during the interview It felt like I had the job since it went so well. Unfortunately interviewing with the school director made it a bit confusing now that I think about it she almost made it seemed like I was in, we even went into a personal convo while I was there. Anyway 2 days passed and she called me back for a second interview(even though she had said initially she wasn't going to do second interviews) last minute the same day I got the call. So I went in and interviewed with the school director and an admission rep. It seemed odd the admissions rep was doing most of the talking while on the second interview ultimately I was like Ok whatever i went along. After the second interview they said \"we will let you know the status eitherway\". 4 days passed and nothing, I ended up emailing/calling and the school director  i was told she was not in..I wanted  to know what the status was because i was interested in the position. Long story when I called the ppl that answered the phone they gave me the run around which I though was disorganized  and unprofessional just because they said they were going to do something and they didn't. It doesn't take long for someone to email \"the position has been filled\" ok cool now I can move on... although  when I had called they were like \"call back tomorrow\" so I called \"oh she not here again I'll pass the message expect a call in 2 days\". blah blah blah!! VERY unprofessional in my opinion. Anywho waiting around for a week dealing with these people was def a waste of my time.", "Interview Questions": "How will you represent Columbia College?"}, {"date": "7 Jul 2015", "title": "Enrollment Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 days. I interviewed at Columbia College of Missouri in Jun 2015", "Interview Descriptions": "Began with email requesting phone interview. This followed with a face-to-face interview. The group interview was a series of questions - each person asked one question.  Much of the information was asked during the phone interview.", "Interview Questions": "Why should we hire you?"}, {"date": "17 May 2015", "title": "Chief Operating Officer Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Columbia College of Missouri (Mexico, MO) in Oct 2014", "Interview Descriptions": "The persons I interviewed with went into great detail about the upcoming services to be provided and what they hoped the new C.O.O position could add to this.  WE were in a small conference room at the local site.  A new site is being constructed where all the administrative offices will relocate.", "Interview Questions": "What could I bring to the table as an RN that would benefit the role of C.O.O?"}, {"date": "26 Jan 2013", "title": "Financial Aid Coordinator Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Columbia College of Missouri", "Interview Descriptions": "Submitted my application and they called me for an interview.  Pretty simple", "Interview Questions": "What did you like least about your last job"}, {"date": "28 Sept 2016", "title": "Enrollment Assistant Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Columbia College of Missouri in Jan 2013", "Interview Descriptions": "The interview was done by the campus director and the associates that already worked there. They told me the duties and my responsibilities. Each of the associates told me about there position and how mine would tie in to theirs. The office is very small (only 5 people total) and they said they have become a family. They were right.", "Interview Questions": "How would you handle conflict with students?\r\nWhat characteristics would someone use to describe you?\r\nWhy do you want to work here?\r\nHow do you handle multiple work assignments?\r\nElaborate on past working experiences"}], [{"date": "18 Feb 2014", "title": "Verification Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 1 week. I interviewed at Columbia College of Missouri (Columbia, MO) in Jul 2012", "Interview Descriptions": "The HR department was very upfront with the salary for the position before I even went in to interview. I was impressed by the salary considering I was going to be benefiting from the tuition benefits but once I graduated, the pay just didn't seem as great. Interviews were professional and well conducted and the HR staff was a pleasure when taking a tour of the campus (after being hired)", "Interview Questions": "Name a time when you had to deal with a difficult situation. What was that situation and how did you deal with it?"}, {"date": "27 Mar 2013", "title": "Student Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1+ week. I interviewed at Columbia College of Missouri (Columbia, MO) in Oct 2011", "Interview Descriptions": "They used a behavioral interview process. I was in the Networking area of the Technology services of the campus.  The interview did include some basic Computer and Networking questions. The questions were more to gauge how much they would need to teach you and to find how much you already know.", "Interview Questions": "Why are manhole covers round?"}, {"date": "11 Jun 2014", "title": "Campus Admission Manager Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 1 week. I interviewed at Columbia College of Missouri (Salt Lake City, UT) in Sept 2010", "Interview Descriptions": "Not a good process, interviewed by Director and phone interview with main campus. No support and questions asked in interview were not politically correct, asked personal questions about religion and then was told She didnt want my religion to be mentioned at the job site", "Interview Questions": "Asked personal questions about personal life and about my religious beliefs and then was told could not get offended with her off colored jokes about races and certain religions"}]]