[[{"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 5, "review_title": "Wonderful!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Aug 2017", "job_title": "Distribution Tech II in Aurora, CO", "duration": "N/A", "pros": "Working here was the best experience I ever had with a job. It was very rewarding and fun. The people I worked with were great and my boss was amazing.", "cons": "The only downside to working here was there wasn't very much room for advancement and also the pay was decent but ultimately I left for better pay."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "This is the worst job experience of my career.", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Oct 2011", "job_title": " in Denver, CO", "duration": "N/A", "pros": "Satisfaction of helping save lives; nice breakroom facilities; nice gifts (vests, t-shirts, camp chair) once a year and some of the employees are great.", "cons": "The cultural environment is very dysfunctional.  There is constant back stabbing and finger pointing, not a team environment at all.  Most mid-managers are interested only in saving their own jobs, not at all interested in or capable of coaching their staff."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 3, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 3, "Senior Management": 0, "review_title": "Blood Systems was ok", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "9 Apr 2019", "job_title": "Donor Care Supervisor in Aurora, CO", "duration": "N/A", "pros": "A lot of good entry level positions within the organization but you have to play the game with management to grow your career.  Lots of skill sets to learn and eventually carry on to another field.", "cons": "Pay across the company was well below the market place and the hours you are asked to work at times are extremely unreasonable especially when on salary.  There is a lot of back door politics, egos and power trips in management which made accomplishing your job or stayting positive very difficult at times."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 4, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Rewarding work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Mar 2017", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Mission driven organization.  Good people work here for great reasons.  I came from private industry and haven't regretted moving to non-profit.  I am challenged in my position and have a great supportive team.  All jobs have ups and downs.  This is a place where you get out what you put in!  A great opportunity in healthcare for lots of job types.  Paid training for phlebotomists with no experience required.", "cons": "Benefits are good but plan used to be more comprehensive.  Paid holidays limited compared to private company's but normal for healthcare."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 0, "review_title": "Not a positive experience, proceed with caution.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Aug 2010", "job_title": "Laboratory Technologist I (Night Shift) in Denver, CO", "duration": "N/A", "pros": "Get to work in an industry that is positive and beneficial to the community.  Dont have to have any previous industry experience to apply for basic positions.  Starting pay and benefits are great to start.", "cons": "If you dont mind getting thrown under the bus by both management and other employees its just fine.  I have never been in a work place that is so cut-throat at all levels.  Advancement requires an act of god.  However, there are many departments and not all are run by the same people - some folks are very happy there.   Burn out was excessive while I was there due to consistent mid-level management failure."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 3, "Senior Management": 4, "review_title": "Great people, stable job!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Apr 2014", "job_title": "Mfg Lab Tech II in Denver, CO", "duration": "N/A", "pros": "Great work environment, great coworkers. Stability in Mfg,", "cons": "Non-profit = below avg.pay for all the training and responsibility put on Mfg.= High turnover"}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Neutral", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 1, "Senior Management": 1, "review_title": "If Recruiting is this disorganized and discorteous, what must it be like after you sign on?", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Dec 2016", "job_title": "Prospective Phlebotomist in Denver, CO", "duration": "N/A", "pros": "Being part of a team who have the potential to improve lives through blood donated by a caring and compassionate community.", "cons": "Shady organization. \n\nRecruiters will leave you a message, and only identify themselves by 1st name, without title or reason for call.  If you're a regular blood donor, and someone identifieds themselves only as an employee of Bonfils, your mind goes to \"What could be wrong with my blood/me?\"; because it's easy to imagine it's a nurse or pathologist who needs to notify you of something grave. \n\nI had to run through a gauntlet of people before discovering the person who called was a recruiter."}, {"Recommended": "No", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 0, "review_title": "Bonfils...good idea....bad place to work.", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Sept 2008", "job_title": " in Denver, CO", "duration": "N/A", "pros": "The purpose of the Company is to provide life saving blood to the Colorado healthcare community.  I chose to work here because I wanted my work to have a greater impact other than just earning a check.  Parts of the laboratory favored fresh college graduates and was an good introductory workplace.", "cons": "Constant management change, constant internal restructuring, three rounds of layoff's within two years (DTL, Warehouse, QSS staff, HR staff, VP's)  There has been an incredible shift to not hire skilled medical technicians or science educated staff, management is shifting towards hiring business mindsets for laboratory work.  No talent stays in management...very fast departures, mobile/collection staff, business development reps and production staff have extremely consistent and high turn over rates.  Increased push on manufacturing productivity is back-breaking and demoralizing to all.  Has no set tiered discpline system, and question the many of the ethical practices in regards to employee rights to complain and not be punished or treated in a hostile fashion.  Company had divided into two buildings and then is in process of merging back into one, very embarrassing that layoff's had to take place due to bad financial choices by management.  Watching the public flagging of our last Medical Director and company president Dr. Dickey on the news and throughout Denver media was absolutely shameful."}, {"Recommended": "No", "CEO Approval": "No", "Business Outlook": "N/A", "Work/Life Balance": 0, "Culture & Values": "N/A", "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Bonfils is a good place for a paycheck but that is about it.", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Jun 2011", "job_title": "Donor Tech in Westminster, CO", "duration": "N/A", "pros": "Develop new skills and can take them elsewhere.  Helping your community blood supply.", "cons": "No recognition from management and constant pressure to meet unfair goals.  No pay raises in years.  Very low morale in the company."}, {"Recommended": "No", "CEO Approval": "Yes", "Business Outlook": "Bad", "Work/Life Balance": 4, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 4, "Senior Management": 3, "review_title": "Great people, not a great company.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Aug 2012", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Some of the most dedicated, passionate people I've ever worked with.\r\nDecent pay, particularly for new grads.\r\nGood benefits, especially health insurance.", "cons": "Some managers have difficult personalities.\r\nQA/RA department has been losing all their best employees due to mismanagement. This will hurt them in the long run.\r\nLoss of employees through attrition has resulted in low morale - everyone is doing 3 people's jobs."}], [{"Recommended": "No", "CEO Approval": "No", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "The Worst", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Mar 2017", "job_title": " in Denver, CO", "duration": "N/A", "pros": "Good benefits, pay is ok", "cons": "Everything. Managment is condescending and rude. They do not care if you have a family. They believe that work comes before all else. You are nothing but a number to them. They make up lies so they can have reasons to fire employees. Lots and lots of favoritism. Staff is can be very childish it makes high school look like a cake walk when it comses to spiteful gossip and vendictive people.  Always whatch your back here."}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Bad", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": "N/A", "Compensation and Benefits": "N/A", "Senior Management": 1, "review_title": "Hell on earth", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "22 May 2016", "job_title": " in Denver, CO", "duration": "N/A", "pros": "Good benefits. Some good people to work with.", "cons": "Bonfires is a very hypocritical place to work. Not only do you always have to watch your back for who is going to stab you in it, you are constantly walking on egg shells. Management talks about these values that the company is supposed to be held to, all the while it seems to not apply to management at all. For example; and employee will make a mistake and get fired while a supervisor will violate HIPPA laws or break OP and not even get talked to about it. \r\nManagement is a joke. They have no idea how the real world works. So they come up with this great idea to \"make things better\" and they have never been in the filed to audit how things are done before making these changed. So when they implement things, everything is put is a \"rushed\" fashion and it is left to the phlebotomists to figure out \"how\" to make this work. \r\nThey pay is a rate was considered \"good\" pay 5 years ago. Since denver's cost of living has increased tremendously in the past 5 years, bonfils has not given a cost of living raise nice I had been there. (6 years) \r\nThey do not enforce the chain of command which states \"if you have a problem with some one take it up with them first and if it does not resolve then proceed to management\". People in the phlebotomy area of this company constantly go to management with petty things like, they did't like the music that was put on at a drive, she/he gave me a dirty look or something stupid and management then pulls that person into the office to have a talk with them. Most of the time these \"talks\" catch the person completely off guard and they have no idea there was even a problem. These people that snitch are then promoted to team lead and supervisory positions. \r\nThe moral at bonfils is terrible. It is like working at a high school all day. Again, having to walk on egg shells and wonder who is going to stab you in the back next. People there are great at smiling to your face and acting like your friend and that they care, all the while waiting for the chance to get something on you to tell on you to boost their own place in the company. Theres more, but 20 words isn't very much space. :)\r\nOverall, it is a terrible place to work and if you can avoid working there do so. It will destroy your spirit and eat your soul!!!!!"}, {"Recommended": "N/A", "CEO Approval": "N/A", "Business Outlook": "N/A", "Work/Life Balance": 1, "Culture & Values": 1, "Diversity and Inclusion": "N/A", "Career Opportunities": 1, "Compensation and Benefits": 0, "Senior Management": 1, "review_title": "Donor Tech", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Dec 2015", "job_title": "Donor Tech III in Lakewood, CO", "duration": "N/A", "pros": "If you're willing to work as a full flex employee at all locations, they seem to pay pretty well.", "cons": "Experience and reviews are not taken into consideration as far as pay.  Not a balanced schedule."}, {"Recommended": "Yes", "CEO Approval": "Neutral", "Business Outlook": "Good", "Work/Life Balance": 5, "Culture & Values": 5, "Diversity and Inclusion": "N/A", "Career Opportunities": 3, "Compensation and Benefits": 4, "Senior Management": 4, "review_title": "Great Organization", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "28 Mar 2016", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Felxible schedules, great people, mission you can believe in", "cons": "Management/organizational changes have been difficult on employee moral"}, {"Recommended": "No", "CEO Approval": "Neutral", "Business Outlook": "Neutral", "Work/Life Balance": 0, "Culture & Values": 3, "Diversity and Inclusion": "N/A", "Career Opportunities": 0, "Compensation and Benefits": 3, "Senior Management": 1, "review_title": "Donor tech", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Apr 2016", "job_title": "Donor Technician II in Pueblo West, CO", "duration": "N/A", "pros": "lots of overtime and van time", "cons": "horrible hours, management dosnt really care about your personal life"}]]