[[{"date": "1 Jun 2023", "title": "Temporary Filing Assistant Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Management Sciences for Health (Kampala) in Jun 2023", "Interview Descriptions": "Applied online but i had to laugh at the crazy requirements. this job is an administrative job where the job description says: The Filing Clerk will be primarily responsible for printing, scanning and filing both soft and hard copy assets disposition documents Responsibilities: Printing, scanning and filing (80%) The crazy requirements: Required: Minimum Diploma in Business Administration or equivalent qualification Preferred: Graduate degree A graduate degree to file some papers? EVen a bachelor's is asking the most. This job can be done by anyone. At the very most ask for a 2-year diploma. but not a bachelor's degree, and certainly not a master's", "Interview Questions": "I did not bother going for the interview. They said we go at 9am so I knew it would be those long interviews were you seat and wait for someone else interviewing to finish."}, {"date": "20 Jan 2023", "title": "Senior Technical Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Management Sciences for Health", "Interview Descriptions": "The interview was Virtual with 8 panelist and it took one and a half hour. The panelist were all across different focus areas within the organization. it's good to know about the organization as well", "Interview Questions": "tell us about yourself and why did you apply for this job?"}, {"date": "27 Nov 2022", "title": "Technical Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Management Sciences for Health", "Interview Descriptions": "HR Screen followed by two panel interviews. Questions focuses on a mix of management style and technical skills. Interviewers were friendly and engaging. The recruitment process was fast and the recruiter was responsive to questions.", "Interview Questions": "What is your approach to mentorship?"}, {"date": "6 Sept 2022", "title": "HR Business Partner Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Management Sciences for Health", "Interview Descriptions": "The initial interview was okay. but they was a period of ghosting. This is an experience that is not  just particular to one particular person or instance. There is need to work on communication", "Interview Questions": "How does this position with MSH meet your career objectives? "}, {"date": "13 Dec 2021", "title": "Director Level Role Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Management Sciences for Health (Arlington, VA) in Nov 2021", "Interview Descriptions": "Very well organized and transparent process. Reasonable gaps between the interviews (I had four). Clear communication about the next stage and its participants. Overall, a great candidate experience. Although I was not selected, I feel that the process helped me learn more about myself. Was provided with a clear feedback at the end and felt respected.", "Interview Questions": "behavioral interview. Questions on developing team, driving change, building relationships. "}, {"date": "15 Jun 2021", "title": "Business Development Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Management Sciences for Health (Washington, DC) in May 2021", "Interview Descriptions": "I was treated with courtesy a respect during the full process. Recruiter was helpful, punctual, and communicative. Good representation of the organization, although disheartened to have not received an offer.", "Interview Questions": "Tell me about your writing skills."}, {"date": "7 Jan 2022", "title": "Advisor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Management Sciences for Health in Apr 2021", "Interview Descriptions": "There was an HR call first, followed by an interview with a future supervisors and colleagues, followed by another with the department director, and lastly a short conversation with the vice president.", "Interview Questions": "What is your experience with DHIS2? "}, {"date": "24 Oct 2020", "title": "Manager Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Management Sciences for Health", "Interview Descriptions": "Applied online, three interviews - each one with different members of the team I was supposed supposed to join. Everyone was very polite and engaging. Asked a few tough questions and some easier ones. Made me feel at ease.", "Interview Questions": "Why do you want to work here"}, {"date": "10 Jul 2020", "title": "Project Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Management Sciences for Health", "Interview Descriptions": "Talked with someone from HR first, who told me a little bit about the position and benefits and interview process and timeline, and then had a video call interview with three panelists.", "Interview Questions": "LOTS of questions about \"tell us about a time when...\""}, {"date": "24 Jul 2020", "title": "Referral Specialist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Management Sciences for Health (Antananarivo) in Jul 2020", "Interview Descriptions": "2 stage, 1st with HQ , second with local team the interview lasted approx 60 minutes each. They were friendly and straightforward questions about previous experience. Both interviews were on skype.", "Interview Questions": "What would you do to improve the public hospital in madagascar?"}], [{"date": "13 Jan 2020", "title": "Project Support Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 4 weeks. I interviewed at Management Sciences for Health", "Interview Descriptions": "Brief 15-20 phone screen from a HR manager. Within a week I was set up for a remote interview (with a team in DC) while in the Boston office. The interview lasted 45 minutes and included straightforward behavioural and technical questions related to the role. Within a few days I was set up with the Technical Advisor to interview via Skype (this time I was not required to be in the Boston office). The interview was strictly technical and lasted about an hour.", "Interview Questions": "Tell me about a time you facilitated a team project. What project management tools did you use?"}, {"date": "6 Jan 2020", "title": "Business Development Manager Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Management Sciences for Health", "Interview Descriptions": "Had a phone screen with HR that lasted about 45 minutes, then was scheduled for a in person interview with a panel. \r\nInterview was technical, straight to the point but yet warm", "Interview Questions": "I was asked about previous work experience,  work style, previous task "}, {"date": "4 Jun 2019", "title": "Monitoring and Evaluation Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Management Sciences for Health (Kampala)", "Interview Descriptions": "Applied online for monitoring and evaluation intern. Was contacted for practical interviews which were successful and was called again for second phase which were oral interviews. The process was good quick and fast", "Interview Questions": "Analysing health  data using either stata or ms excel"}, {"date": "30 Aug 2021", "title": "IPT/Viral Load Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Management Sciences for Health (Birnin Kebbi) in Mar 2019", "Interview Descriptions": "Interactive, well orgaanized, convincing. The interviewer made the session swift and engaging. He also made sure, I was calm while he asked his questions.\nWhen I got there, all staffs were set and ready, as they managed the crowd that came for the interview such that it rounded up in mo time.", "Interview Questions": "Can you do this job ?"}, {"date": "5 Jan 2021", "title": "Project Support Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied through an employee referral. I interviewed at Management Sciences for Health (Arlington, VA) in Oct 2018", "Interview Descriptions": "Very fast process and detailed. The interviewer keeps track of the process and kept me informed the whole time.  It took about 3 weeks to be completed. It was very pleasant and professional and I had no complaints about the process. Salary negotiations are important but they are not very flexible for too much negotiations.", "Interview Questions": "Tell me about yourself, describe a challenge, experience working with donors, experience working with international entities "}, {"date": "29 Jan 2018", "title": "Project Support Associate Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Management Sciences for Health (Medford, MA) in Jan 2018", "Interview Descriptions": "I was contacted a week after submitting my application to schedule an interview. I had an in person interview with the hiring manager and someone who is currently in the role. French is required for the position so half of the interview took place in French and then afterward there was a written translation test. About a week later I was contacted for another interview, this time over Skype. A week after this they asked for my references, and after another week gave me an offer.", "Interview Questions": "How would you prioritize competing tasks?"}, {"date": "28 Feb 2018", "title": "Project Support Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Management Sciences for Health (Boston, MA) in Jan 2018", "Interview Descriptions": "There was 1 phone interview, 2 in person meetings and there was a french test at the end of the interviews which took about 30 minutes.  Overall it was well organized and I was able to learn a lot about the company, industry, and interview panel.", "Interview Questions": "Why are you interested in Public Health?"}, {"date": "23 Apr 2021", "title": "AV Supply Chain Management Coordinator Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Management Sciences for Health (Cotonou) in Nov 2017", "Interview Descriptions": "Questions sur la compréhension de la description du poste. Questions concernant les expériences qui cadrent avec le poste. Question spécifiques sur les défis liés à la chaine d'approvisionnement en Afrique et dans le pays de travail. Questions sur le travail en équipe", "Interview Questions": "Questions about understanding the job description. "}, {"date": "5 Jun 2017", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. I interviewed at Management Sciences for Health", "Interview Descriptions": "Was initially recruited for a full time paid position and then was offered an unpaid internship. Overall it was a very bizarre process but ended up taking the position for more work experience.", "Interview Questions": "N/A"}, {"date": "27 Jun 2017", "title": "IT Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I applied online. I interviewed at Management Sciences for Health (Lilongwe) in May 2017", "Interview Descriptions": "Was interviewed over skype by a technical expert from US. 3 weeks later was called for an interview with 3 people after which there was a written test. The interview panel was very friendly and cheerfull", "Interview Questions": "they asked me why I want to leave my current employer"}], [{"date": "20 Aug 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Management Sciences for Health in Jun 2016", "Interview Descriptions": "I got a phone interview. It lasted about 20 minutes. I answered a few questions and got the offer. I was introduced to a project I would be working on.", "Interview Questions": "Why are you interested in working at MSH?"}, {"date": "2 Feb 2016", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Management Sciences for Health", "Interview Descriptions": "I submitted my resume online and got a call to schedule and interview. There was a 15-20 minute phone interview asking about my personal characteristics and why I was interested in the area of expertise, as well as telling me more about what I would actually be doing on the job. I got a call offering the position a week later.", "Interview Questions": "Name 3 strengths of yours and one weakness"}, {"date": "24 Jan 2016", "title": "Project Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Management Sciences for Health (Arlington, VA)", "Interview Descriptions": "Pretty easy interview with both behavioral and technical questions conducted via skype. Only 1 interview before an offer was made. There was a panel of 4 people in my interview. From application to interview was about a month and a half (it was over the December holiday period, hence the lag) and from interview to offer was about 3 days (over a weekend).", "Interview Questions": "When have you disappointed your boss? What happened? How did you handle it?"}, {"date": "15 Oct 2019", "title": "Communications Specialist Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. I interviewed at Management Sciences for Health in Nov 2015", "Interview Descriptions": "I interviewed with a recruiter, then took an editing, writing and translation test, then interviewed with a director. The director was 30 minutes late and asked every question as if she felt I wasn't capable or worthy of her time.", "Interview Questions": "Many questions delved into the specifics of the job description to get examples of how I had done aspects of what they were seeking."}, {"date": "19 Jan 2017", "title": "Business Development Manager Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Management Sciences for Health (Arlington, VA) in Aug 2015", "Interview Descriptions": "Friendly and assessing. Phone interview, than panel interview, 1:1 interview with the director then a writing test. People were warm and put you at ease during the interview but asked direct questions to assess how well you will fit with the team and your ability to do the job.", "Interview Questions": "Standard questions to assess your experience related to the job."}, {"date": "31 Jul 2015", "title": "MEC Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied through an employee referral. The process took 1+ week. I interviewed at Management Sciences for Health (Cambridge, MA)", "Interview Descriptions": "I had two interviews, I think. A grad-school colleague who worked at MSH shared my resume with her boss. Shortly after, HR contacted me to schedule an interview. The first interview was with the M&E and communications team (5 people I think), and the second interview (I think the following week?) was with the M&E Director. They called to make an offer a few days later. I tried to negotiate up, but they wouldn't budge.", "Interview Questions": "They asked about the transition from research/academia to applied work."}, {"date": "9 Jul 2015", "title": "Program Officer Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Management Sciences for Health in May 2015", "Interview Descriptions": "Extremely scatterbrained, dysfunctional recruiting process. \r\n\r\nEarly May: MSH recruiter contacts me for phone screen regarding open position. They seemingly like what they hear, and ask me if I would be available for an interview.I live out of the area, but I mention that I'll actually be visiting Washington DC during the next week and could make time to come in then. MSH recruiter says that works and that he'll get back to me with a specific time, he never responds back. I assume they aren't interested, I take my trip to DC as planned.\r\n\r\nTwo weeks later: A second MSH rep, from the same office, contacts me about a second position. I apparently again pass the phone screen, as they ask for an interview, and after mentioning what happened with the first recruiter/interview, they offer to do a Skype interview instead. They send me a list of dates/times and I quickly reply back that most of them work for me and I'll do it at their convenience.\r\n\r\nThe next two weeks: the MSH recruiter continues to respond tardily to my confirmation emails, meaning that the proposed interview date gets pushed back multiple times. Since this is getting ridiculous and I want to come off like the likeable, flexible job candidate, I finally just tell her to pick a day  and time that works on their end and that I will make sure that I'm available. Finally we settle on a time the following Monday morning.\r\n\r\nThe Friday afternoon before the interview: I receive a confirmation email for the recruiter, stating the date, time, who I'm supposed to be meeting with, and what time I'm expected to be in Washington DC. Shocked, I quickly respond back and say that I was under the impression that this would be a Skype interview, that last minute flight/accommodations are expensive, and that I had offered to do an in-person while I'd been in DC a couple weeks before , etc.\r\n\r\nMonday morning: I finally get a clarification email from the recruiter, who apologizes for the confusion. At this point I'd already been offered and accepted a better-paying, better-fitting position elsewhere, so I was only doing the MSH interview for extra practice. The interview itself lasts an hour, followed by a language exam they ask you to perform while still on Skype that takes approximately another 45 minutes. I submit the exam, they tell me they'll be contacting me in a couple weeks either way.\r\n\r\nMid-July: Absolutely no contact from MSH, and very glad I found a better opportunity elsewhere.", "Interview Questions": "N/A"}, {"date": "9 May 2015", "title": "Technical Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Management Sciences for Health (Virginia)", "Interview Descriptions": "Had a phone interview with the recruiter and all went well though i wasn't given a job i felt the interviewer was very kind and professional. She was able to walk me through the urgency of that particular position.", "Interview Questions": "One of the interview question that i think didn't give me the job was whether i am i am available within two weeks or not"}, {"date": "17 Jul 2015", "title": "Business Development Specialist Interview", "results": "Declined Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Management Sciences for Health (Medford, MA) in May 2015", "Interview Descriptions": "interview process was fine until i was offered the job and was not allowed to speak with any current employees to get more info about the position. this would've been my first job out of college and not being allowed to speak to anyone under 50 at the organization was a huge turn off. in addition, i was given 2 DAYS to accept the offer, and HR was extremely unaccommodating and rude to me in trying to negotiate this. all of these issues really gave me a bad vibe from the organization, and after reading their reviews on glassdoor, it's clear they need to do something differently if they want people to stay with them.", "Interview Questions": "how do you think this interview is going right now?"}, {"date": "5 Jun 2015", "title": "Project Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Management Sciences for Health (Washington, DC) in May 2015", "Interview Descriptions": "I was contacted within two weeks of applying for a phone interview. About a week later, I was contacted for a second in-person interview. The questions for the first interview were pretty standard, while they focused more on specifics of the position during the second one. While I did not get the position, the people in the office were very friendly, and I felt very comfortable during the interview.", "Interview Questions": "Why are you interested in the position? "}], [{"date": "2 Aug 2019", "title": "Technical Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 3 months. I interviewed at Management Sciences for Health in May 2015", "Interview Descriptions": "A very random and slow process.  Didn’t like the approach. Took three months to get me on board. I think they didn’t really assess skills. Experience, skills, motivation, salary expectations.", "Interview Questions": "N/A"}, {"date": "7 Jun 2018", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Management Sciences for Health (Kinshasa) in Apr 2015", "Interview Descriptions": "C'est un processus permettant d'évaluer des atouts d'un demandeur d'emploi par rapport aux attentes du poste. Il commence par publication de l'offre, la sélection des candidats répondants au test, examen ou test des candidats (écrit ou de personnalité), interview et offre d'emploi.", "Interview Questions": "Résumer en 3 points les priorités dès la première semaine de ton travail "}, {"date": "21 Jun 2015", "title": "Finance and Administrative Assistant Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 1 day. I interviewed at Management Sciences for Health (Abuja, Niger) in Mar 2015", "Interview Descriptions": "It was a group interview and there was six applicants and about six interviewers. The interview was scheduled for 10am but it never started until about 2 or 3 hours later. We were interviewed in turns and I was the last to be interviewed. The interviewers were already tired and exhausted so they never wasted much time. All the interviewers were very friendly and respectful. Well, it was a wonderful experience though, I was not selected for the job.", "Interview Questions": "Where will you be in five years’ time?\r\n"}, {"date": "31 Aug 2015", "title": "Project Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 3 weeks. I interviewed at Management Sciences for Health (Arlington, VA) in Feb 2015", "Interview Descriptions": "I was contacted 3 weeks after I initially applied for the position online. The overall interview process was in 2 rounds over another 3 weeks. The screening process was long and tedious - similar to the job experience.", "Interview Questions": "Explain how you have handled a challenge "}, {"date": "29 Jan 2016", "title": "Financial Analyst Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Management Sciences for Health (Port-au-Prince) in Sept 2014", "Interview Descriptions": "I was first called for a phone screen. Then I was called in to conduct a skills test. After passing successfully these first step I was called in for a group/panel interview with the Project Director, the HQ Financial Analyst and Human Resources staff... Ultimately I had to sit down with the HR Manager who [come to find out] lied and misled me to believe that there were career progression and compensation increase opportunities...", "Interview Questions": "To detail how I managed my responsibilities and tasks as the Financial Controller at Catholic Medical Mission Board. "}, {"date": "26 Jun 2014", "title": "Senior Contract Officer Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Difficult Interview", "Application Type": "I interviewed at Management Sciences for Health", "Interview Descriptions": "I applied online, got a phone interview, then was flown to Boston to be interviewed in person, and did a written test. I met with a lot of people.  Some individuals and some in groups.", "Interview Questions": "\"What do you think of the Red Sox\"?"}, {"date": "7 Feb 2014", "title": "Senior Project Officer Interview", "results": "Accepted Offer", "experience": "N/A", "difficulties": "Easy Interview", "Application Type": "I interviewed at Management Sciences for Health", "Interview Descriptions": "I had an informational interview with an employee before the job was posted. Once the job was posted I sent my resume to the same employee, who then forwarded my information to HR. I was brought in for an in-person interview, and was offered the job shortly after. The interview consisted of a 3-person panel, and I was asked basic questions plus a question in French.", "Interview Questions": "Where do you see yourself in five years?"}, {"date": "18 Feb 2014", "title": "Officer Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through a staffing agency. The process took 4 weeks. I interviewed at Management Sciences for Health", "Interview Descriptions": "MSH likes conducting interviews in groups and there are usually two or three rounds of group interviews.  Many of the questions are to find out if you are a going to be a good fit with the group of people you would closely work with.  Follow-ups and next steps are slow because usually only one person can make the decision and they might be out on vacation or on TDY.", "Interview Questions": "What do you do for fun outside of work"}, {"date": "4 Mar 2014", "title": "Project Associate Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. I interviewed at Management Sciences for Health (Cambridge, MA) in Nov 2013", "Interview Descriptions": "I had a phone interview with HR then later had an in person interview with a panel of 2 people over Skype and then interviewed with one more person. At this point it seemed pretty clear that I had the job so it was more of a discussion. I began working within 2 weeks.", "Interview Questions": "All of the questions were pretty straight forward."}, {"date": "30 Aug 2013", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Management Sciences for Health (Arlington, TX) in Aug 2013", "Interview Descriptions": "I was emailed about coming in for an interview, set one up, and came in. The interview was one on one, very straightforward, and easy going. I was excited to work there and felt the interview went well but really couldn't tell either way until I got the offer a week later.", "Interview Questions": "None, all of it was expected questions I've heard before."}], [{"date": "28 Feb 2014", "title": "Business Development Specialist Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Management Sciences for Health (Cambridge, MA) in Jul 2013", "Interview Descriptions": "Initial contact after employee referral for position. A screening document was sent ahead of the phone interview to gauge interest and experience in field. Phone screening was brief and to the point. Was mainly to get background information and direction of interest. ASked about salary preferences.", "Interview Questions": "Straight forward questions - nothing tricky!"}, {"date": "7 Jun 2013", "title": "Project Associate Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Management Sciences for Health", "Interview Descriptions": "I had a phone interview with a recruiter within a day of submitting my CV, followed by a second phone interview with a member of the technical team that was hiring. Next week was the in person interview in their VA offices. I met with the same recruiter who had contacted me initially and then met both a junior and senior member of the technical team. They were very nice, walked me through all details of the position, and asked fairly standard questions about my experience and interests. Nothing tricky or unexpected.  Lots of questions were expanding upon the experiences referenced in my CV and giving examples.", "Interview Questions": "Describe a situation at work where it has been difficult to work as a member of a team."}, {"date": "11 Apr 2013", "title": "Project Officer Interview", "results": "No Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. I interviewed at Management Sciences for Health (Arlington, VA)", "Interview Descriptions": "I applied for many positions with MSH and never heard any response. I connected with a current employee who is a fellow alumnus of my graduate school, and got a response from the next job for which I applied. \r\n\r\nI was called in for a personal interview in the Arlington-based office. I had a video conference call with an HR rep based in Connecticut and then interview with the project team in person. The interviews went very well and everyone was very personable. \r\n\r\nI also had one hour to complete a budget assessment.", "Interview Questions": "I can't remember a particularly difficult question. I remember there was no, \"What are your weaknesses?\" But they expected me to sell myself for the job. "}, {"date": "20 Jun 2017", "title": "Technical Advisor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied in-person. I interviewed at Management Sciences for Health (Abuja, Federal Capital Territory) in Feb 2013", "Interview Descriptions": "They asked basic interview questions about the role and told me about the project and the company.  They asked questions about my previous organizations and what I can do for them.", "Interview Questions": "Tell me about yourself..."}, {"date": "17 Nov 2012", "title": "Accounting Associate Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Management Sciences for Health (Cambridge, MA) in Oct 2012", "Interview Descriptions": "The hiring process is time consuming and cumbersome. I applied very recently for a new position and found the recruiter for this particular position to not understand the work I currently did, the work I was intending to do and where the responsibilities intersected. The hiring manager was aware of me and worked quite well to spite the lack of assistance from the recruiter. The particular recruiter, as I have found out internally, struggled to pass on my information to the manager. I had to pull from the other side. Please also note that the positions do not pay as well as the public sector, and an equivocal interview I later involved myself in offered me between 10-20k more annual salary to start.", "Interview Questions": "I have completed 75% of the tasks for the position in which I applied. The most unexpected question was repetitive inquiry as to the state of my college degree. I have worked in a related field for 4 years, the job information indicated \"or equivalent work experience\" which I had. "}, {"date": "2 Feb 2016", "title": "Senior Leadership Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied through a recruiter. The process took 7 months. I interviewed at Management Sciences for Health (Washington, DC) in Sept 2012", "Interview Descriptions": "It was long and there were a lot of steps:  phone interviews, in-person interviews, presentations, video interviews.  I was shocked at the carelessness of the people involved in the process when I was copied on an internal email with comments from interviewers about the candidates.  It was very unprofessional and sloppy.  Some of the comments were completely inappropriate and there were no consequences for the people involved.  That was a red flag!", "Interview Questions": "Nothing special in terms of the questions.  The most important things was to prepare a presentation of my proposed strategy for the business unit."}, {"date": "28 Jun 2011", "title": "Senior Program Associate Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 6 weeks. I interviewed at Management Sciences for Health (Arlington, VA) in Jun 2011", "Interview Descriptions": "Applied for a job online. Used network/contact to put in a good word so that my profile would stand out. That procured a phone interview almost immediately (power of networking, as they say). The initial phone interview was very short - simply to gauge my interest in the position and cover my basic questions on the scope of work. Two weeks later - I was called in for a in-person interview with a panel. This lasted about an hour - consisting of behavioral type questions to gauge my interest and fit for the position. Everyone on the panel was very warm - and it felt like a conversation rather than an interview.", "Interview Questions": "Describe your experiences with this technical issue (provided an example). \r\n"}, {"date": "20 Apr 2011", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Management Sciences for Health (Cambridge, MA) in Apr 2011", "Interview Descriptions": "HR rep emailed prescreening questionnaire, then called in for panel interview with hiring manager, project manager, and administrative coordinator. interview lasted 45 minutes asked very standard questions and did part of the interview in french. then the HR rep came in to ask logistical questions about salary, references, etc for 20 min", "Interview Questions": "Answering situational questions in French"}, {"date": "2 Aug 2014", "title": "Monitoring and Evaluation Consultant Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Difficult Interview", "Application Type": "I applied online. The process took 6 weeks. I interviewed at Management Sciences for Health (Georgetown) in Feb 2011", "Interview Descriptions": "1=Two interviews: screening interview and the standard interview\r\n2=There were 2 weeks between the two interviews\r\n3=I got the offer after 3 weeks.\r\n\r\nI found the job opportunity on the web site of Management Sciences for Health (MSH).  I submitted all my job applications materials through that web site: cover letter and CV.  I was shortlisted for an interview.  I got the news after about 6 weeks.  The first interview was a screening interview.  It took place a week after the short list news.  It lasted 50-60 minutes. I got news for a second interview 2 weeks later.  It lasted 60 minutes.  I got the offer after 3-4 weeks.", "Interview Questions": "How are you going to ensure that M&E data are valid, timely and reliable?"}, {"date": "21 Aug 2015", "title": "Program Coordinator Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 3 days. I interviewed at Management Sciences for Health (Ballston, VA) in Jan 2011", "Interview Descriptions": "Ok place to work, really. They asked a lot of questions about my previous work and even asked about international travel. There were a lot of people in the interview. It was a very typical interview. Nothing out of the ordinary here.", "Interview Questions": "What are your two greatest strengths and weaknesses?"}], [{"date": "6 Apr 2012", "title": "Technical Position Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through a recruiter. The process took 4 weeks. I interviewed at Management Sciences for Health in Oct 2010", "Interview Descriptions": "My interviews were extremely well organized from the first contact by the recruiter on through the hiring process.  The HR administrator contacted me to set up my interviews and from that contact all the way through to my offer, the process was handled in a most professional manner.  The panel interview, in particular, was impressive because it appeared each interviewer had been assigned to specific areas to cover in my background.  I felt as if I was able to demonstrate all my accomplishments in that interview!  Everyone from the receptionist, who called me by name and knew what I was there for, to employees in the corridors to the interviewers made me feel welcome.  I could feel myself being a part of MSH!", "Interview Questions": "In providing technical assistance, to what extent have you worked with M&E expert in ensuring that the interventions are working?  Could you share a few examples and outcome?"}, {"date": "4 Dec 2014", "title": "Program Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 day. I interviewed at Management Sciences for Health (Boston, MA) in Sept 2010", "Interview Descriptions": "Met with 2 senior staff.  It was quite informal, however, because I was first hired for a short term position when there was a job that needed to be done.", "Interview Questions": "N/A"}, {"date": "1 Feb 2012", "title": "Administrative Coordinator Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "The process took 2 days. I interviewed at Management Sciences for Health in Jan 2010", "Interview Descriptions": "Communications were poor--this is an organization with the worst HR department there is. HR is not paid well, and also attracts incompetent people. The team dynamics of the panel was great, but they clearly did not communicate with each other and asked the same questions over and over again. HR contacts you, does a brief screening interview, passes your information on to the hiring panel, they decide whether to call you in, and HR is supposed to set up an interview. However, if they forget, it looks like you decided not to show up. There are no consequences for mistakes in this organization.", "Interview Questions": "Why did you apply for this position?"}, {"date": "16 Jun 2013", "title": "Communications Associate Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through college or university. The process took 2 months. I interviewed at Management Sciences for Health (Washington, DC) in Jan 2010", "Interview Descriptions": "Phone interviews with project director, communications staff and regional director for overseas position.", "Interview Questions": "How would you describe your management style?"}]]