[[{"date": "1 Apr 2022", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Riverside Community Care (Boston, MA)", "Interview Descriptions": "It was a zoom interview. Interviewer basically asked why I wanted to work the company and if i wanted full time/ part time hours. It was a simple process that only lasted about 10mins, but I’m pretty sure they were short staffed.", "Interview Questions": "What kind of experience do you have working with the public "}, {"date": "24 Apr 2022", "title": "Residential Counselor Interview", "results": "Accepted Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Riverside Community Care (Boston, MA) in Jan 2021", "Interview Descriptions": "The interview process was very simple - including a 15-minute zoom call. There were very few questions outside of a few about previous experience and scheduling availability. Not through screening which may have been a sign of the lack of consistency across the sites.", "Interview Questions": "What is your experience in social or supportive services?"}, {"date": "3 Aug 2020", "title": "Clinician Interview", "results": "No Offer", "experience": "Negative\nExperience", "difficulties": "Easy Interview", "Application Type": "I interviewed at Riverside Community Care", "Interview Descriptions": "Personally I felt as though the interviewer was not listening to me during the phone call and had a lack of follow up afterwards. They also did not return a follow up email.", "Interview Questions": "Why i was interested in this position "}, {"date": "7 Dec 2020", "title": "Community Coordinator Interview", "results": "Declined Offer", "experience": "Neutral\nExperience", "difficulties": "Easy Interview", "Application Type": "I applied online. I interviewed at Riverside Community Care (Revere, MA) in Jan 2020", "Interview Descriptions": "Short phone call. Twenty minutes. Didn’t go into depth and got the job right away. It was really easy but the hiring pay is low even when you’re over qualified. Done", "Interview Questions": "Are you comfortable driving your own vehicle to reach patients "}, {"date": "5 Dec 2018", "title": "Overnight Mental Health Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Riverside Community Care (Dedham, MA) in May 2018", "Interview Descriptions": "Very Easy. Interview is done over the phone. They really are concerned if you have experience in the field or not. They mainly are looking for people with a good friendly personality", "Interview Questions": "How Long Have you been working in this field."}, {"date": "26 Oct 2020", "title": "Family Support Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I interviewed at Riverside Community Care (Somerville, MA) in Jan 2017", "Interview Descriptions": "Easy, group setting. More experienced oriented and bachelors needed or working towards it. They value professional skills and team dynamics. The first interview is alone, the second one is with the team.", "Interview Questions": "What’s your strengths at work? And what do you on your free time?"}, {"date": "15 Mar 2016", "title": "Intensive Care Coordinator (ICC) Interview", "results": "Declined Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied in-person. The process took 3 weeks. I interviewed at Riverside Community Care (Needham, MA) in Mar 2016", "Interview Descriptions": "Met the supervisor at a career fair, talked about the job and handed her my resume. A week later I received a call asking if I was interested for an interview. Interviewed the week after that. Was offered a second interview but I declined.", "Interview Questions": "If you had to prioritize this case with these problems, how would you do it and why?"}, {"date": "28 Jan 2015", "title": "Mental Health Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Riverside Community Care", "Interview Descriptions": "I went in for my first interview a week after submitting my application. I had submitted my application and then uploaded my resume. I was then emailed and it took a week to set up an appointment for the actual first interview. I was then asked to refill out an application and attach references and my resume. When I went in for my interview I was asked to give a statement of why I wanted to work for the company. I was then contacted by another person for my second interview in which three people were present. After the interview I was then asked to visit the three houses that they had open positions. The whole process took about 3 hours.", "Interview Questions": "Tell them one time where I made a mistake and what I learned from it."}, {"date": "9 Jul 2014", "title": "Respite Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 4 weeks. I interviewed at Riverside Community Care (Dedham, MA)", "Interview Descriptions": "I was e-mailed by the agencies main HR department and asked to call to schedule an interview. I did so, and came in for an interview about a week later. The questions were the ones typical to human service field jobs (\"Why do you want to work in the mental health field?\" \"What are obstacles in recovery for those with mental illness?\")\r\n\r\nAfter that initial interview, I hadn't heard from anyone for a few weeks so I took some initiative and called the specific program to ask if there was any  movement on the decision to bring me in for a second interview. The manager of the program said that she was just about to call me and asked me to come in later that week. That interview was basically just telling me what the job entailed and just gauging my experience and background with mental health.", "Interview Questions": "I would say that the most difficult question to ask in this and any interview is the \"Think of a time where you experienced failure or difficulty in your job and how you handled it\". These questions seem like a trap and take me by surprise because I am not good at sugar coating things which is what I think this type of question entails. "}, {"date": "28 Aug 2015", "title": "Community Support Counselor Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 2 weeks. I interviewed at Riverside Community Care (Wakefield, MA) in Jul 2014", "Interview Descriptions": "Applied with a friend referral, got a call in a week, interviewed the following week with congregate site director. Called back for second interview with 5 house managers plus congregate site director. Round table style.", "Interview Questions": "Name a time you made a mistake on the job and how you handled it"}], [{"date": "9 Nov 2015", "title": "Intern Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 5 days. I interviewed at Riverside Community Care (Dedham, MA) in Jan 2014", "Interview Descriptions": "The interview was pretty quick. I reviewed my resume and explained why I was interested in the position. The hiring manager asked a few questions and then introduced me to the team.", "Interview Questions": "Why are you interested in working at Riverside Community Care"}, {"date": "24 Oct 2013", "title": "Register Nurse Interview", "results": "No Offer", "experience": "N/A", "difficulties": "N/A", "Application Type": "I interviewed at Riverside Community Care", "Interview Descriptions": "Over the phone interview first and a manager interview", "Interview Questions": "N/A"}, {"date": "7 Feb 2015", "title": "Speech-Language Pathologist Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Easy Interview", "Application Type": "I applied through other source. The process took 1 week. I interviewed at Riverside Community Care (Somerville, MA) in Feb 2013", "Interview Descriptions": "I heard about the position from one of my friends who interviewed for the same position (and was unable to pursue the position due to not having a car). So, I emailed my resume directly to the program director, came in for an interview with her and filled out application and background check forms. A few days later I had a phone interview with the woman who would be my direct clinical supervisor. Both conversations were very low-stress, mostly straightforward questions about my experience as well as them telling me more about the job. Got an email offer soon after the phone interview.", "Interview Questions": "I cannot remember any specific questions, they were all expected questions about my job history, why I wanted to work there, etc."}, {"date": "19 Oct 2012", "title": "Mental Health Counselor Interview", "results": "No Offer", "experience": "Neutral\nExperience", "difficulties": "Average Interview", "Application Type": "I applied online. The process took 2 weeks. I interviewed at Riverside Community Care (Dedham, MA) in Apr 2012", "Interview Descriptions": "Phone call, initial screening interview with HR, follow up interview with head of department, follow up interview with manager of department", "Interview Questions": "N/A"}, {"date": "28 Jun 2013", "title": "Clinical Social Worker Interview", "results": "Accepted Offer", "experience": "Positive Experience", "difficulties": "Average Interview", "Application Type": "I applied through an employee referral. The process took 1 week. I interviewed at Riverside Community Care (Newton, MA) in Apr 2010", "Interview Descriptions": "There were two  interviews-one with clinic director and another with three clinicians, no case presentation, friendly, and less than ninety minutes. They asked about substance abuse experience, past work, clinical interests, working with colleagues, internships, and availability. A tour of the office was given and everyone seemed friendly. The atmosphere was relaxed and welcoming.", "Interview Questions": "Weaknesses?"}]]